[
    {
        "Title": "Excalibur : Mojo Mayhem",
        "Authors": "By Claremont, Chris",
        "Description": "",
        "Category": "",
        "Publisher": "Marvel",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Grill It!: 100 Easy Recipes for Foods to Sear, Sizzle, and Smoke",
        "Authors": "By Yates, Annette (EDT)",
        "Description": "Tired of charring the same old hot dogs and hamburgers? Delight your friends and family with 100 mouthwatering grilled treats, guaranteed to make your next barbecue the talk of the neighborhood! Grill It! combines a delicious range of quick and easy recipes for marinades, sauces, salsas, seafood, poultry, meat, vegetables, and desserts with full-color photographs throughout and advice on grilling equipment and techniques. Annette Yates has written more than 25 books on barbecue, microwave, and pressure and slow cooking techniques.",
        "Category": " Cooking , Methods , Outdoor",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Children of Tender Years: A Novel",
        "Authors": "By Allbeury, Ted",
        "Description": "Assigned to investigate rumors of neo-Nazism and anti-Semitism in Germany, Jake Malik, a survivor of Auschwitz, and his partner discover a group of fanatics bent on containing the threat of the Soviet Union",
        "Category": " Fiction , General",
        "Publisher": "Beaufort Books",
        "Price Starting With ($)": "5.96",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "How to Start & Run Your Own Bed & Breakfast",
        "Authors": "By Hotch, Ripley and Glassman, Carl A.",
        "Description": "Provides practical information for running a profitable bed and breakfast inn, discussing how to estimate costs and cash flow, develop a good business plan, market the inn, and attract the right guests",
        "Category": " Business & Economics , Industries , Hospitality, Travel & Tourism",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "DSM-IV Diagnosis in the Schools",
        "Authors": "By House, Alvin E., Ph.D.",
        "Description": "Familiarity with the DSM-IV has become an integral part of child and school psychology. Specific diagnoses are increasingly required for educational placement, funding and resource allocation, and treatment planning. This clearly written guide provides a succinct and well-organized overview of the principles of diagnostic classification used by the DSM-IV. Readers learn how the DSM-IV \"works\" as a method of organizing and communicating our understanding of adjustment and cognitive disorders in youth. Chapters group diagnoses thematically by prominent presenting symptoms, focusing on the disorders most commonly encountered in school-age children and adolescents. Throughout, the author explains terms, concepts, and procedures that might be less familiar to practitioners in a school environment.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Web of Life: Weaving the Values That Sustain Us",
        "Authors": "By Law, Richard",
        "Description": "In a collection of stories, discussion, and quotations, the author of Childhood's Future examines the interconnections among all people; the links that make up family, community, and more; and the importance of memory and personal stories. 35,000 first printing. Tour. IP.",
        "Category": " Family & Relationships , General",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Life and Death of Stars",
        "Authors": "By Cooke, Donald A.",
        "Description": "Describes the life cycle of stars and discusses supernovas, black holes, variable stars, and pulsars",
        "Category": " Science , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "ABCs of the Human Mind",
        "Authors": "By Reader's Digest Association",
        "Description": "A study of the workings of the brain explains the mind's physical structure, how it shapes personality and creativity, the reason for dreams, and related subjects",
        "Category": " Psychology , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Tap, Tap",
        "Authors": "By Martin, David Lozell",
        "Description": "What if your best friend started murdering you worst enemies?That's the frightening premise of Tap, Tap, David Martin's most terrifying thriller since his international bestseller Lie to Me. In Tap, Tap we meet Roscoe Bird, a get-along, go-along Washington, D. C., businessman who does his best to avoid conflict in his life, marriage, and workplace. But not in his past. Because when Peter Tummelier, his buddy from childhood, suddenly appears, bodies start showing up, too. And when Roscoe becomes the police's prime suspect for the killing spree, a heart-stopping race against time blocks Peter's brilliantly diabolical scheme of manipulation and murder from continuing. Only by destroying his closest friend can Roscoe save his own family, clear his name, and avoid a hideous death himself.Sophisticated, suspenseful, and replete with page-turning drive that marks the finest thrillers, Tap, Tap is a riveting examination of the ties that bind - and the ties that strangle, too.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Soft Focus",
        "Authors": "By Krentz, Jayne Ann",
        "Description": "Businesswoman Elizabeth Cabot decides to end her romantic relationship with Jack Fairfax when she learns he has deceived her, but disentangling herself from their business relationship proves much trickier. 180,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Mandate of Heaven: A New Generation of Entrepreneurs, Dissidents, Bohemians, and Technocrats Lays Claim to China's Future",
        "Authors": "By Schell, Orville",
        "Description": "This astonishing new book by Orville Schell, for thirty years America's foremost chronicler of contemporary China, offers a unique look at the China of the mid-'90s and the generation that stands poised to inherit the \"mandate of heaven,\" the right to govern the world's largest nation.China's current leaders - already in their eighties and nineties - will soon be leaving the country's political scene. Their departure raises the ultimate question: Who will assume power? The generation that was the natural heir was decimated in the chaos of the Cultural Revolution during the 1960s and '70s. Thus, with the end of the Deng era, it is left to a new generation, with a drastically different set of experiences and priorities, to take over.The crackdown that followed the democracy protest in Tiananmen Square in 1989 seemed to foretell doom to international investment and any possibility of political freedom, but Deng Xiaoping, who had already begun instituting bold capitalist-style economic reforms in the 1980s, maneuvered China back onto the path of reform, and by 1992 China had become the fastest growing economy in the world. Yet China remains a place where even peaceful expression of political views is punishable by imprisonment.Traveling back to China many times since 1989, Schell takes readers on a series of trips inside the latter-day People's Republic to meet the people who acted out the drama of the Square and who are now playing the leading roles in China's high-speed rush into the future. With the intimacy of an old friend, Schell introduces us to these ordinary and extraordinary characters, not necessarily the children of the elite, as some might expect, but students, workers, peasants, entrepreneurs, teachers, soldiers, intellectuals, labor leaders, and pop stars.As China's importance on the world stage grows, it becomes increasingly necessary that the West acquaint itself with the \"new China\" and get to know these young people who must now negotiate a way out of their country's myriad contradictions. With his knowledge of Chinese history and his unparalleled understanding of the Chinese people, Schell is the perfect writer to interpret the changes that will determine the future of this important but uncertain land.",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Some Kind of Miracle: A Novel (Dart, Iris Rainer)",
        "Authors": "By Dart, Iris Rainer",
        "Description": "Cousins Dahlia and Sunny Gordon were best friends growing up, bound by a shared love for making music that was as pure, powerful, and radiant as the California sunshine. When Dahlia's soulful lyrics combined with Sunny's soaring melodies, magic happened, and they promised they would stick together all the way to the top. But a darkness was already descending on Sunny, one that would ultimately plunge her into a nightmare of solitude and schizophrenia. And after their lives were torn apart, a quarter of a century would pass before the cousins would meet again.After long years of fruitless struggle, Dahlia still dreams of making it in the L.A. music business, a dream that comes to rest on one song. A lucky break has brought a composition she and Sunny wrote long ago to the attention of a powerful Hollywood producer. Desperate for success, Dahlia must find her cousin in order to secure the rights to the song that will win her fame and great fortune.But the world Sunny Gordon now inhabits is a place of madness and despair, and her obstinate refusal to sign a contract only infuriates Dahlia and strengthens her resolve. There are no depths Dahlia will not sink to in order to get what she wants -- even if it means moving her tragically damaged cousin, demons and all, into her own home.Yet selfish motives and greed are, remarkably, leading Dahlia somewhere she never imagined she'd go. For the first time since she was a girl -- and perhaps the first time ever -- she will have to put someone else's needs before her own, and her life will be unexpectedly transformed in the process.And sometimes, even when real life reaches its cruelest and lowest ebb, miracles do happen ...",
        "Category": " Fiction , Women",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Shameless Exploitation in Pursuit of the Common Good: The Madcap Business Adventure by the Truly Oddest Couple",
        "Authors": "By Hotchner, A. E. and Newman, Paul",
        "Description": "“There are three rules for running a business; fortunately, we don’t know any of them.”In 1978, Paul Newman and A. E. Hotchner decided that rather than just distribute Paul’s own salad dressing at Christmas to neighbors, they would offer it to a few local stores. Freewheeling, irreverent entrepreneurs, they conceived of their venture as a great way to poke fun at the mundane method of traditional marketing. Much to their surprise, the dressing was enthusiastically received. What had started as a lark quickly escalated into a full-fledged business, the first company to place all-natural foods in supermarkets. From salad dressing to spaghetti sauce, to popcorn and lemonade, Newman’s Own became a major player in the food business. The company’s profits were originally donated to medical research, education, and the environment, and eventually went to the creation of the eight Hole in the Wall Gang camps for children with serious illnesses. In these pages Newman and Hotchner recount the picaresque saga of their own nonmanagement adventure. In alternating voices, playing off one another in classic “Odd Couple” style, they describe how they systematically disregarded the advice of experts and relied instead on instinct, imagination, and mostly luck. They write about how they hurdled obstacle after obstacle, share their hilarious misadventures, and reveal their offbeat solutions to conventional problems. Even their approach to charity is decidedly different: every year they give away all the company’s profits, empty the coffers, and start over again. The results of this amazing generosity are brought to life in heartwarming stories about the children at their camps.With rare glimpses into their zany style and their compassion for those less fortunate, Newman and Hotchner have written the perfect nonmanagement book, at once playful, informative, and inspirational.",
        "Category": " Business & Economics , Nonprofit Organizations & Charities",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Jemima Puddle-duck Board Book (Peter Rabbit)",
        "Authors": "By Potter, Beatrix",
        "Description": "An introduction to the lovely Jemima Puddle-Duck follows the Puddle-Duck family as they march down the road and splash in the pond.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Warne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Hard Time (V.I. Warshawski Novels)",
        "Authors": "By Paretsky, Sara",
        "Description": "Among the first, and perhaps the most compelling, female private investigators of contemporary fiction, Sara Paretsky's incomparable character V. I. Warshawski at last returns to the page in her first full-length appearance since 1994's Tunnel Vision. Hard Time is the work of a master--a riveting novel of suspense that is indisputably Paretsky's best V.I. Warshawski novel yet.Multimedia conglomerate Global Entertainment has purchased the Chicago Herald-Star, forcing the paper's staff to scramble to stay employed. Reporter Murray Ryerson, V.I.'s longtime friend and sometime rival, manages to reinvent himself as the host of a television show on Global's network. On her way home from a party celebrating Murray's debut, V.I. almost runs over a woman lying in the street. Stopping to help, V.I. soon learns that her Good Samaritan act will drop her squarely in a boiling intrigue. In a case that forces her to go head-to-head with one of the world's largest providers of private security and prison services, a case that exposes dark hidden truths behind the razzle-dazzle of the entertainment industry, V.I. will be ahead of the game if she gets out alive.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Taste of Honey (Carson Spring Series)",
        "Authors": "By Goudge, Eileen",
        "Description": "A season has passed in Carson Springs since Stranger in Paradise. And with a baby on the way, Samantha Kiley and Ian Carpenter will soon be loving parents. But in Taste of Honey it is Sam's best friend Gerry whose head and heart are put to the test when she is forced to face the secret she has kept for almost thirty years.  Everyone knows that feisty, sensual Gerry Fitzgerald wasn't always so outspoken. As a young, impressionable novitiate, Gerry became pregnant. She fled the altar just as she was about to take her vows to become a nun and never breathed a word about why. Twenty-eight years later the child she gave up for adoption has come back into her life, a grown woman looking for answers. For Gerry, the question is how to defuse the years of guilt, shame, and bitterness that divide her from her daughter, how to create and nurture a bond as fragile as a cobweb. As Gerry opens the emotional floodgates she also unexpectedly finds that her feelings for her lover, symphony conductor Aubrey Roellinger, grow more complex and consuming. No longer only a series of satisfying trysts with manageable emotional boundaries, their relationship has begun to crack open both their cautious hearts.  Compulsively readable, Taste of Honey brings fans back to the idyllic California valley with characters who take on new dimensions as their secrets emerge and their lives and loves progress. Irresistible and romantic, Eileen Goudge's latest Carson Springs novel is not to be missed.",
        "Category": " Fiction , Literary",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Acts of Love",
        "Authors": "By Michael, Judith",
        "Description": "In Acts of Love, Judith Michael's most deeply realized story yet, the many acts of love - discovery, friendship, hope, trust, perseverance in the face of doubt, constancy in the face of fear and rejection - are explored and dramatized as they make a broken life whole again.An odyssey of the heart begins the moment theater director Lucas Cameron discovers a box of letters left behind by his deceased grandmother, the famous stage actress Constance Bernhardt. The letters were written by her protege Jessica Fontaine, who disappeared from the stage years before. Even in the midst of his busy world - staging a new Broadway play, coping with the overwhelming needs of his former wife and the social ambitions of his current girlfriend - Luke finds himself returning again and again to the letters, recognizing in them a deeply passionate young woman discovering herself and the magic of the theater. Luke begins to realize that he has fallen in love with the woman who wrote them. Finally he can bear it no longer - and tracks down the elusive Jessica Fontaine.But when he travels to her hideaway on Lopez Island off the coast of Washington, nothing is as he expected it. In one brief, magical week, Luke and Jessica face emotions and decisions that turn their worlds upside down.",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "By This Fire",
        "Authors": "By Gaither, Gloria",
        "Description": "Legendary songwriter Gloria Gaither takes a nostalgic look at treasured memories made around the hearth, the heart of her family's home. Her poetic language makes this comforting, affirming book read like her songs. You'll remember the warmth and meaningful associations of fireplaces past—or wish for such a place now.",
        "Category": " Religion , Holidays , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Monkey House",
        "Authors": "By Fullerton, John",
        "Description": "Sarajevo is a dying city: violence and possible death from shell fire or a sniper's bullet lurk around every corner. People are hungry a lot of the time, cold most of the time, and frightened all of the time. An arrogant American journalist, Branson Flett, records it all.Amid the chaos, Police Superintendent Rosso and his ragtag force must solve a murder - one of their informants, a young woman, has been found dead in \"The Monkey House,\" a Serbian apartment complex. The crime bears the unmistakable marks of being tied to the powerful Bosnian warlord and black marketer Luka - a man whom Rosso is determined to bring to justice. And he needs Flett's help to do so. For Rosso, a Croat whose Serbian wife is sinking ever more deeply into alcoholism and despair and whose Muslim goddaughter may be having an affair with Luka, this case has become a mission, but also to save his family and his city. And in the process, perhaps he may be able to redeem his own dark and bloody legacy.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "SECOND WIND",
        "Authors": "By Francis, Dick",
        "Description": "Perry Stuart, TV meteorologist working routinely before cameras, chiefly predicts periods of English drizzle, with bursts of heavier rain and sunshine to follow. His life calm and ordered, his face familiar to every British household, Stuart's profound weather knowledge and accuracy have given him high status among forecasters, but no physical baptism by storm.Not, that is, until a fellow forecaster offers him a Caribbean hurricane-chasing ride in a small aeroplane as a holiday diversion. By frightening accident, Stuart learns more secrets from the flight than wind speeds - and back home in England he faces threats and danger as deadly as anything that nature can evolve.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "A Sudden Change of Heart",
        "Authors": "By Bradford, Barbara Taylor",
        "Description": "Best friends since childhood, Laura Valiant and Claire Benson find solace in each other as Claire struggles to cope with sudden tragedy and Laura's investigation into artwork stolen by the Nazis suddenly leads to Claire's divorced husband's family. 200,000 first printing. Tour.",
        "Category": " Fiction , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Stop the Insanity! Eat, Breathe, Move, Change the Way You Look and Feel--Forever",
        "Authors": "By Powter, Susan",
        "Description": "The popular television personality and authority on wellness explains how people can take control of their lives for better health and self-esteem through diet, mental fitness, and the power of intimacy. 125,000 first printing. Major ad/promo. Tour.",
        "Category": " Health & Fitness , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Sacred Heart",
        "Authors": "By Montecino, Marcel",
        "Description": "Among the speakeasies and brothels of New York City's West Side, Tommy Coyne's appetite for sex, power and violence made him a shark among men. So when dirty cops made him head for cover with Frank, his pious Jesuit brother in Mexico, he did it in his own unique style - disguised as a priest. But Frank never mentioned that Mexico was locked in its own bloody struggle, with government troops ruthlessly attacking the clergy and their faithful. Soon, the black robes that got Tommy across the border have him hanging from a noose in the dusty village square of Santa Maria.But then provinces or plain Irish luck collapses the scaffold, Tommy blasts his way free, and a whisper ripples through the crowd: Un milagro - a miracle! In the eyes of the peasants, he is now the padre with God on his side, a new leader who will deliver them from their misery. Frank sees Padre Tommy from a more mercenary angle - he knows his brother has all the skills to lead a fierce crusade in the name of the church. And heaven-sent Lourdes, the tragically beautiful nun who tends Tommy's wounds, knows only that her attraction to this priest is as powerful as it is forbidden.While Tommy ponders his divine change of fortune, Frank prepares a scheme more suitable for wise guys than men of the cloth. In this harsh, blood-soaked land, these two brothers face choices that will seal their destinies.",
        "Category": " Fiction , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "An Ounce of Prevention, A Pound of Uncertainty: The Cost-Effectiveness of School-Based Drug Prevention Programs",
        "Authors": "By Caulkins, Jonathan P. (EDT)",
        "Description": "Uses results from the school-based drug prevention programs Project ALERT and Life Skills to answer questions surrounding the effectiveness and cost effectiveness of drug prevention programs and how they compare, dollar for dollar, with other approaches to drug control, such as enforcement or treatment. Discusses implications of findings for school-based drug prevention as a matter of national drug control policy, and shows how different analytical assumptions may result in different answers. No index. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Rand Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Appliqué (Better Homes and Gardens)",
        "Authors": "By Better Homes and Gardens Books (COR)",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Hope Springs from Mended Places: Images of Grace in the Shadows of Life",
        "Authors": "By Komp, Diane M.",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Basic Essentials of Canoeing (The Basic essentials series)",
        "Authors": "By Jacobson, Cliff",
        "Description": "",
        "Category": "",
        "Publisher": "Ics Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Great Works of Heart (Memories in the Making Series)",
        "Authors": "By Childs, Anne Van Wagner (EDT)",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Year in Wreaths: Caprilands' Guide to Wreaths",
        "Authors": "By Simmons, Adelm Grenier",
        "Description": "Provides instructions for making a variety of seasonal wreaths traditional throughout the church year, and discusses preservation, bases, living wreaths, garlands, and related matters",
        "Category": " Gardening , General",
        "Publisher": "Bdd Promotional Book Co",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Potpourri, Incense, and Other Fragrant Concoctions",
        "Authors": "By Fettner, Ann Tucker",
        "Description": "\"Recipes for making potpourri sachets, scented candles, [and more]. . . Many good suggestions for decorating. . .\"-- Library Journal. \"This delightful little book is for all flower lovers, rose gardeners, herb fanciers, and all who love the sweet smell of spring. Included are recipes and instructions for making enchanted scented concoctions-things like potpourris, sachets, incense, pomander balls, toilet water, and other flowery things\"-- The South Carolina Gardener. Selection of the Better Homes & Gardens Family Book Service. 209,000 copies in print.",
        "Category": " Crafts & Hobbies , Potpourri",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Your Child & the New Age",
        "Authors": "By Kjos, Berit",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The Best-Case Scenario Handbook: A Parody",
        "Authors": "By Tierney, John and Buckley, Christopher (FRW)",
        "Description": "Prepare for the best—you never know when life will take an unpredictable turn, forcing you to deal with sudden wealth, power, love, success, fame, and earthly glory. Here are step-by-step illustrated instructions on what you need to know THIS VERY MINUTE.How to cope with a broken ATM that will not stop dispensing cash How to accept an Academy Award How to respond when someone you want to dump dumps you first What to do in a pretentious restaurant when you're mistaken for the Times food critic What to do when you look younger every birthday  ...plus practical information on how to wangle a first-class upgrade from coach and how to behave when confused Palm Beach retirees erroneously elect you President of the United States.",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Ole Doc Methuselah",
        "Authors": "By Hubbard, L. Ron",
        "Description": "A member of the soldiers of Light, the most elite organization in the universe, Ole Doc Methuselah battles disease, plague, mutation, slavery, and old age with the assistance of his alien servant, Hippocrates.  National ad/promo.",
        "Category": "",
        "Publisher": "Bridge Publications",
        "Price Starting With ($)": "10.95",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Gravelight",
        "Authors": "By Bradley, Marion Zimmer",
        "Description": "Wycherly Musgrave doesn't have good luck with cars and alcohol. Trying to outrun the memory of a young woman he may have killed in a drunk-driving accident, Wych sends his expensive sports car sailing off the road...and, with his usual impossible luck, survives the crash with no more than a few bumps and bruises. the car is totaled, stranding Wycherly in the tiny mountain town of Morton's Fork. Making the best of a bad situation, Wych decides to try to dry out.Wycherly isn't Morton's Fork's only unusual guest this summer: A movie star has taken up residence in a converted schoolhouse. Sinah Dellon left Morton's Fork as an infant foundling. Now she's come home to learn who her people were - and why she has the ability to read minds. But Sinah's psychic powers do not help her with the townsfolk, who turn from her in fear and hatred.Equally untrustworthy, according to the residents of Morton's Fork, are the RV-load of researchers from the Bidney Institute, come to investigate centuries of reported hauntings, vanishings, poltergeists, and other phenomena. They too are poking around in things better left unexplored. Before long, Truth Blackburn, heroine of Bradley's novel Ghostlight, discovers that the source of the psychic storm is a renegade Gate - and one with a connection to Truth's own tangled past. But she cannot close the Gate alone, and the true Keeper is nowhere to be found.In despair, Wycherly Musgrave has made a pact with evil. In fear, Sinah Dellon feels her soul slipping away under attack from a vengeful spirit. In dread, Truth Blackburn must make a great sacrifice to save all the people of Morton's Fork, and the man she loves, from the power of the Gate.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Vitals",
        "Authors": "By Bear, Greg",
        "Description": "Blending fierce, fast plots with vivid characters and mind-bending ideas, Greg Bear has mastered a powerful alchemy of suspense, science, and action in his gripping thrillers. Darwin’s Radio was hailed across the country as one of the best books of the year. His newest novel, Vitals, begins with a harrowing descent to a netherworld at the very bottom of the sea–and then explodes to the surface in sheer terror.Hal Cousins is one of a handful of scientists nearing the most sought after discovery in human history: the key to short-circuiting the aging process. Fueled by a wealth of research, an overdose of self-confidence, and the money of influential patrons to whom he makes outrageous promises, Hal experiments with organisms living in the hot thermal plumes in the ocean depths. But as he journeys beneath the sea, his other world is falling apart.Across the country, scientists are being inexplicably murdered–including Hal’s identical twin brother, who is also working to unlock the key to immortality. Hal himself barely eludes a cold-blooded attack at sea, and when he returns home to Seattle, he finds himself walking into an eerie realm where voices speak to him from the dead . . . where a once-brilliant historian turned crackpot is leading him on a deadly game of hide-and-seek . . . and where the beautiful, rich widow of his twin is more than willing to pick up the pieces of Hal’s life–and take him places he’s never been before.Suddenly Hal is trapped inside an ever-twisting maze of shocking revelations. For he is not the first person to come close to ending aging forever–and those who came before him will stop at nothing to keep the secret to themselves. Now every person on earth is at risk of being made an unsuspecting player in one man’s spectacular and horrifying master plan.From the bottom of Russia’s Lake Baikal to a billionaire’s bionic house built into the cliffs of the Washington seashore, from the darkest days of World War II and the reign of Josef Stalin to the capitalist free-for-all that is the United States, Vitals tells an astounding tale of the most unimaginable scientific secret of all–exposed by the quest for immortality itself . . .",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Race, Class, And Gender In The United States: An Integrated Study",
        "Authors": "By Rothenberg, Paula S.",
        "Description": "A comprehensive collection of essays that focus on similarities and differences between and among forms of oppression and emphasize the ways in which issues of race, class, gender, and sexuality intersect. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Worth Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Photomosaics",
        "Authors": "By Silvers, Robert and Hawley, Michael (EDT)",
        "Description": "Marrying art and technology, Silvers, the creator of the photomosaics and the software used to assemble them, and Hawley (MIT Media Lab) present mosaics pieced together from thousands of tiny photographs. Held at arm's length, the pages seem to compose themselves, revealing the image of an owl, or Darth Vader, or Marilyn Monroe. Held close up, they explode in a riot of color and movement and exquisite detail. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Photography , Techniques , Darkroom",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Official Rules",
        "Authors": "By Dickson, Paul",
        "Description": "The director of the Murphy Center for the Codification of Human and Organizational Law collects, classifies, and annotates laws, principles, rules, and bits of conventional wisdom that guide our lives",
        "Category": "",
        "Publisher": "Dell Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "Heat of Ramadan",
        "Authors": "By Hartov, Steven",
        "Description": "When a hit team sent to Munich to assassinate a Palestinian terrorist learns that the terrorist survived and is undergoing plastic surgery to change his appearance, they must stop him before he carries out his plans to assassinate Israel's leader",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Men, Women and Relationships: Making Peace With the Opposite Sex",
        "Authors": "By Gray, John",
        "Description": "",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Beyond Words Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "They Must Have Seen Me Coming",
        "Authors": "By Brindley, Louise",
        "Description": "Brindley describes her work in a home for old people in the seaside town of Eastmarch where she used her courage, laughter, and common sense to turn a soulless, restrictive institution into a real home for its elderly residents",
        "Category": " Social Science , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "The Negotiator",
        "Authors": "By Forsyth, Frederick",
        "Description": "Frederick Forsyth,  master of the international thriller, retums with  an electrifying story of a man of immense power and  a conspiracy to crush the President of the United  States. Only one man--Forsyth's most  unforgettable hero yet--can prevent the plan from succeeding.  His name is Quinn. He is the  Negotiator.President Cormack is  bent on a signing a sweeping U.S.-Soviet  disarmament treaty, and the master conspirator is  determined to stop him. The kidnapping of a young man on a  country road in Oxfordshire is but the first  brutal step in the explosive plot engineer the  president's destruction. Enter  Quinn.  Quinn plays the  kidnappers like a master musician. . . until, in a shocking  tumabout, he discovers that ransom was not their  objection after all--and that he has been lured  into a cunningly woven web. Now he must draw upon  his deepest strengths--to save not only the victim  but the entire free  world.From the Paperback edition.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Talking about Genesis",
        "Authors": "By Moyers, Bill D. (INT) and Public Affairs Television (COR)",
        "Description": "Offers guidelines for organizing and conducting a Genesis discussion group, and presents essays and commentary by leading scholars, with accompanying questions and activities",
        "Category": " Religion , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Jumpstart: The 21 Day Plan to Lose Weight Get Fit and Increase Your Energy and Enthusiasm",
        "Authors": "By Austin, Denise",
        "Description": "Denise Austin knows what you want: a simple plan to help you lose weight and get fit that adapts to your hectic lifestyle. Experts have learned that it takes 21 consecutive days to form a habit, so Austin provides an easy step-by-step plan designed to make positive changes in your eating and workout habits and increase your energy and enthusiasm.Offering a comprehensive day-by-day plan to health and fitness, Denise acts as your own personal nutritionist and trainer. Every day she tells you exactly what to eat, with choices and ingredients that fit into your lifestyle and over 100 recipes for delicious low-fat foods that work as well for a family as they do for one person. Denise provides a detailed exercise plan for each day, whether it's toning, stretching, or a cardiovascular workout - in 30 minutes or less. And every day Denise offers \"Deniseology,\" her own inspirational words to keep you motivated and on the plan. Throughout the book are the words and photographs of those who have successfully followed the plan and lost weight and inches.",
        "Category": " Health & Fitness , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Listening to Catnip: Stories from a Catanalyst's Couch",
        "Authors": "By Winnicat, Sigmund F. and Smith, Camille",
        "Description": "Dr. Sigmund F. Winnicat (who uses his middle initial only, never the full name Fluffy), noted cat psychiatrist and prominent member of feline society, here offers his compassionate expertise on the controversial subject of feline psychopharmacology, through five intriguing case studies.From Felix's problematic melancholy - he is no longer interested in squirrels, and has stopped playing his favorite game, \"Scatter the Clean Laundry\" - to Puff's tendency towards self-destructive relationships, Dr. Winnicat takes us along as he successfully treats his patients with appropriate doses of the wonder-herb.",
        "Category": " Humor , General",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Two Lives, One Russia",
        "Authors": "By Daniloff, Nicholas",
        "Description": "Recounts the author's research into his Russian revolutionary great-great-grandfather and how that search led to his arrest by the KGB and a growing understanding of Soviet politics and people",
        "Category": " Social Science , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Christmas crafts book",
        "Authors": "By Sterling Press",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Nest of Vipers",
        "Authors": "By Davies, Linda",
        "Description": "Sarah Jensen - smart, ambitious, independent, and beautiful - is one of the most successful currency traders in the City of London. When the governor of the Bank of England invites her to his office, she's intrigued. When he explains that he suspects someone at the notoriously cutthroat Inter-Continental Bank of corrupt trading practices, she's not entirely surprised. But when he asks her to go undercover for him working at the bank, to discover and document the corruption, she's initially shocked. Why her? First, he says, because she knows the ins and outs of trading better than anyone else. And second, because due to her reputation as a bit of a wild card no one will imagine she could be working for the government. The glamour of all the secrecy, and the challenge of working for the government, prove too hard to resist, so Sarah agrees to go along. It all seems, at the beginning, on the up-and-up.James Bartrop, the director of Counter-Narcotics Crime at M16, has spent years tracking Anthony Fieri, a powerful Mafia financier whose long and illustrious career has included everything from drug and arms smuggling to political fixing and simple assassination. Bartrop now believes that Fieri has entered new territory, and is the invisible hand behind an elaborate scheme to take tens of millions of \"legitimate\" dollars out of the international currency markets. Bartrop will stop at nothing to find a clear, provable path through the complex web of financial fraud back to Fieri.Sarah soon uncovers clues to an illegal scheme reaping multimillion-dollar profits for a small group of corrupt traders, and she begins secretly gathering evidence to expose it. But when a friend and a colleague at the bank are murdered, she realizes there is much more going on than anyone is telling her, and that the fraud extends way beyond the world of merchant banking...",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Such a Pretty, Pretty Girl: A Novel",
        "Authors": "By Groom, Winston",
        "Description": "Delia Jamison is a gorgeous woman of a certain age and at the pinnacle of her career as anchor a network news show in Los Angeles. But she is being blackmailed by someone she is certain is one of her former lovers. Terrified to go to the police for fear the story will leak and cause a scandal, Delia's at her wit's end when she accidentally runs into none other than one of those former lovers, Johnny Lightfoot, whom she hasn't seen in nearly twenty years. Johnny is now an Academy Award-winning screenwriter living in New York and L.A. who feels the old emotional attraction for Delia rising again. Even though she's recently married, Delia mysteriously seems to encourage Johnny's interest.Since she won't go to the police, Johnny agrees to help her find the culprit, which means she has to produce a list of the suspects. And what a list it is: moguls on the New York Stock Exchange, fancy lawyers, a stellar Ivy League professor - even a United States senator. As Johnny's investigation delves deeper into Delia's past, it exposes more than he ever wanted to know; meanwhile, the blackmailer rachets up his dangerous game.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Sweet Flavorings (Library of Culinary Arts)",
        "Authors": "By Norman, Jill",
        "Description": "Identifies and decribes a variety of sweet flavorings, offers new suggestions for their use, and includes a selection of recipes",
        "Category": " Cooking , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "America Needs a Raise: Fighting for Economic Security and Social Justice",
        "Authors": "By Sweeney, John J. and Kusnet, David",
        "Description": "John J. Sweeney and the new leadership of the AFL-CIO are committing millions of dollars and thousands of organizers to the mobilization of working people all over the country. America Needs a Raise is Sweeney's manifesto. It is a blunt yet compassionate account of the dilemmas facing American workers of all kinds: high tech and low, immigrant and native born, blue collar and white. Sweeney targets the growing disparity between rich and poor, the decline in the standard of living of middle- and working-class Americans, the overwork and unemployment, the racial polarization and ethnic animosity, and the gnawing sense of powerlessness and uncertainty that afflicts us all. He indicts corporate America too for its \" lean and mean \" abdication of social responsibility. He offers a way of dealing with the realities of the global economy that is more effective and humane than the downsizing of America and the sacrifice of working people on the altar of international competitiveness. Most of a",
        "Category": "",
        "Publisher": "Houghton Mifflin (T)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Cholesterol Handbook",
        "Authors": "By Consumer Guide",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Customer Service on the Internet: Building Relationships, Increasing Loyalty, and Staying Competitive",
        "Authors": "By Sterne, Jim",
        "Description": "",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Amazing Animals: The Fastest, Heaviest, Smallest, Largest, Fiercest, and Funniest",
        "Authors": "By Gomboli, Mario",
        "Description": "Introduces some of the most remarkable dinosaurs, endangered species, inhabitants of the Antarctic, noctural animals, and creatures in a variety of other categories, and explains what makes them outstanding",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "O'Hara's Choice",
        "Authors": "By Uris, Leon",
        "Description": "Fifty years after his first novel, Battle Cry, took the world by storm, Leon Uris returns to the topic that first inspired him to write books that captivate, educate, and thrill -- the Marine Corps.  In the years following the Civil War, first-generation Irish-American Zachary O'Hara, son of a legendary Marine and a force of a man in his own right, finds himself playing a critical role in the very future of the Marines. If he can persuade the Secretary of the Navy that the Marines are more crucial than ever to America's safety and security -- all the while hefting a heavier secret weight in his heart -- he'll save the corps and make his career.But there's an obstacle in his path that this warrior had not planned on. Amanda Blanton Kerr, the daughter of a ruthless industrialist, is a woman on a mission of her own; passionate, obstinate, and whip-smart, she's an heiress poised to blaze a trail for her sex.O'Hara's Choice is the story of the inevitable collision of these two handsome, fighting spirits. Getting their souls' desire could jeopardize everything they -- and their parents before them -- scraped and struggled to achieve.Duty to country, love of family, and a tormented passion intertwine in this latest epic by Leon Uris, international bestselling author of such classics as Exodus, Trinity, and Battle Cry. A riveting, sweeping tale in inimitable Uris style, O'Hara's Choice is this master of the historical novel at his most brilliant.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Ten Questions: A Sociological Perspective (Sociology)",
        "Authors": "By Charon, Joel M.",
        "Description": "Raising ten important questions, (Why is there inequality in the world? and What does it mean to be human?), Charon examines how classical sociologists (Marx, Weber, Durkheim, Mead, Berger, and others) approach these important, timeless questions and how the field of sociology has approached them over the past 150 years. By describing the basic principles behind sociology, Charon encourages readers to think critically about their assumptions concerning their lives and society. The authors goal is for readers to realize how our thinking and actions are largely the result of the social context within which we live.",
        "Category": "",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "George Washington: A Life",
        "Authors": "By Randall, Willard Sterne",
        "Description": "As the two hundredth anniversary of the first president's death approaches, an acclaimed biographer explores Washington's life from a personal rather than political perspective, sharing the story of his life as a man rather than a leader. 35,000 first printing.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Red Lobster, White Trash, & the Blue Lagoon: Joe Queenan's America",
        "Authors": "By Queenan, Joe",
        "Description": "For fourteen years, critic Joe Queenan walked past the Winter Garden Theater in New York City without once even dreaming of venturing inside to see Cats. One fateful afternoon in March 1996, however, having grown weary of his hopelessly elitist lifestyle, he decided to buy a half-price ticket and check out Andrew Lloyd Webber's record-breaking juggernaut. No, he did not expect the musical to be any good, but surely there were limits to how bad it could be. Here, Queenan was tragically mistaken. Cats, what Grease would look like if all the cast members were dressed up like KISS, was infinitely more idiotic than he had ever imagined. Yet now the Rubicon had been crossed. Queenan had involuntarily launched himself on a harrowing personal oddyssey: an 18-month descent into the abyss of American popular culture. At first, Queenan found things to be every bit as atrocious as he expected. John Tesh defiling the temple of Carnegie Hall reminded him of Adolf Hitler goose-stepping in the shadow of the Eiffel Tower. The Celestine Prophecy and The Horse Whisperer proved to be prodigiously cretinous. And the sight of senior citizens forking over their hard-earned nickels and dimes to watch Joe Pesci in Gone Fishin' so moved Queenan that he began standing outside the theater issuing refunds to exiting patrons. But then something strange happened. Queenan started enjoying Barry Manilow concerts. He went to see Julie Andrews and Liza Minnelli and Raquel Welch in Victor/Victoria. He said nice things about Larry King and Charles Grodin in his weekly TV Guide column. He spent hours planted in front of the television, transfixed by special, two-hour episodes of Walker: Texas Ranger. He actually ordered the dreaded zuppa toscana at the Olive Garden. Most frightening of all, he shook hands with Geraldo Rivera. How Queenan finally escaped from the cultural Hot Zone and returned to civilization is an epic tale as heart-warming, awe-inspiring, and life-affirming as Robinson Crusoe, The Adventures of Marco Polo, Gulliver's Travels, and Swiss Family Robinson. Well, almost.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Stalking Horse",
        "Authors": "By Shoemaker, Bill",
        "Description": "The greatest jockey of all time, Bill Shoemaker moved in a world of fast horses, high living, and gorgeous, dangerous women. Now, in his fiction debut, Shoemaker draws on his experiences on and off the track to spin one of the most suspenseful and entertaining mysteries to appear in years. Stalking Horse is an odds-on favorite to win Shoemaker a huge and devoted readership.Colley Killebrew, the hero of Stalking Horse, was a jockey himself, one of the best in the business, until a race-fixing scandal got him barred from the track seven years before. But Colley blew more than his racing career - he also lost Francie Dorn, the irresistible redhead he loved. Colley wants Francie back and badly. So badly he'll even cut a deal with Raymond Starbuck the former track steward who destroyed his reputation.The deal works like this: Colley goes down to New Orleans to foul up a racetrack scam that a rich, sleek aristocrat named Remy Courville is running. If Colley can keep Remy and his unsavory cronies from muscling in on the old Magnolia Park track, Starbuck will give him ten thousand dollars and Francie Dorn's address. But Colley doesn't expect to run into Lea, Starbuck's leggy, blond daughter, who is as adept at seducing men as she is at blowing them away....From the racetrack barns to the mansions of Los Angeles and the steamy plantations of New Orleans, Shoemaker guides us through an intricate tale that could only play out at the races. With Stalking Horse, the fabled jockey who triumphed in four Kentucky Derbies takes yet another winner across the finish line.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Stainless Steel Rat Goes To Hell (Stainless Steel Rat Books)",
        "Authors": "By Harrison, Harry",
        "Description": "In book after book, one outrageous adventure after another, Harry Harrison has chronicled the wild and fast-paced exploits of the universe's greatest thief and con artist: Slippery Jim diGriz, alias the Stainless Steel Rat. Now the Rat returns in his most devilish caper yet.DiGriz is strenuously fighting boredom on a ritzy pleasure planet when his beloved wife, Angelina, disappears while visiting the Temple of Eternal Truth, an enigmatic institution that promises its wealthy patrons a sneak peek at Heaven - for a price. The Temple's scam offends that Rat's professional sensibilities. It's one thing to fleece the idle rich of their cash; stealing their souls is something else entirely.Besides, he wants his wife back.DiGriz immediately calls in the troops, including his twin sons, Bolivar and James, and a sexy superspy named Sybil. With his friends and family at his side, and armed with his own survival ability and experience, he thinks he's ready for anything, but he never expects to find himself banished to Hell, complete with man-eating devils with horns and pointed tails. After years of gleeful criminality, has divine judgment caught up with the Rat at last?Of course not.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Rocking the Roles: Building a Win-Win Marriage",
        "Authors": "By Lewis, Robert",
        "Description": "",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "For Matrimonial Purposes",
        "Authors": "By Daswani, Kavita",
        "Description": "Anju wants a husband. Equally important, her entire family wants Anju to have a husband. Her life in Bombay, where a marriage can be arranged in a matter of hours, is almost solely devoted to this quest, with her anxious mother hauling her from holy site to holy site in order to consult and entreat swamis and astrologers. As Anju’s twenties slip away, she’s fast becoming a spinster by her culture’s standards, so she moves to New York City to work in fashion.   For Matrimonial Purposes is the hilarious story of Anju’s journey, her quest for love, and the choices that she must make while trying to remain true to herself and satisfy her family and tradition.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "The International Traveller's Guide to Doing Business in Latin America (International Business Traveller's Series)",
        "Authors": "By Morrison, Terri and Conaway, Wayne A.",
        "Description": "The International Traveler's Guide to Doing Business in Latin America has the information you need to succeed. Arranged in an easy-to-use who/what/when/where/why format, it provides vital data on each country in Latin America. Concise enough to be read en route on an airplane trip, it offers the background information every visitor should know before arriving. Each chapter includes notes on the economy, history, legal environment, customs and business styles of a single Latin American country. It also provides cultural tips (including literature and movies) so that you can discuss each country's cultural heritage. And if you think you know this information already, try the Cultural IQ Quiz at the beginning of each chapter!",
        "Category": "",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The 100 Best Companies to Work for in America: 3rd Revised Edition (ONE HUNDRED BEST COMPANIES TO WORK FOR IN AMERICA)",
        "Authors": "By Moskowitz, Milton and Levering, Robert",
        "Description": "Interviews with workers nationwide identify one hundred of today's best companies to work for, in a volume that rates companies based on salary and benefits, promotion opportunities, fairness and openness, and pride in the workplace. Reprint. 50,000 first printing. Tour.",
        "Category": " Business & Economics , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Flying Lessons",
        "Authors": "By Halkin, Hillel and Semel, Nava",
        "Description": "Hadara, a lonely child in a small Israeli village, hears a story from a Holocaust survivor about Jews who could fly, and the young girl becomes determined to learn how to fly herself.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Present Value: A Novel",
        "Authors": "By Willett, Sabin",
        "Description": "The perfect lives of toy company executive Fritz Brubaker and his attorney wife, Linda, unravel when his company's stock value plunges, he is arrested for insider trading, Linda's image conscious firm suspends her, their house is repossessed, and their kids run amok, as the power couple is forced to reassess their lives. 50,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.6",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Nothing to Lose: A Guide to Sane Living in a Larger Body",
        "Authors": "By Erdman, Cheri K.",
        "Description": "Nothing to Lose offers a practical guide to achieving real psychological and physical self-acceptance for women of size. Surveying the history of our culture's attitudes toward women's body size, challenging beliefs about fat with the latest health facts, and suggesting practical tips and exercises for building fitness and self-esteem, Erdman helps readers through the slow, often painful process of healing body shame.Each chapter begins with a personal story of Erdman's own process of body-size acceptance, then explores significant issues such as body image; myth vs. fact about health, weight and dieting; when to consult a therapist and how to choose one; and much more. Erdman has interviewed and worked with hundreds of women and she includes many of their stories here to illustrate the pain, joy, frustration, and triumph that are all part of the journey toward self-acceptance.",
        "Category": " Psychology , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Glory's War (Goldenwing Cycle)",
        "Authors": "By Coppel, Alfred",
        "Description": "Voyaging aboard the Goldenwing starship toward an enemy star system, Glory and her crew struggle to avoid capture while preparing to face a greater menace that threatens all interstellar human life.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "13.17",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "How to Rock Climb! (How to Rock Climb Series)",
        "Authors": "By Long, John",
        "Description": "",
        "Category": " Sports & Recreation , Mountaineering",
        "Publisher": "FalconGuides",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "On Doctoring: Stories, Poems, Essays",
        "Authors": "By Richard C. Reynolds~John Stone",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Book of Tea and Herbs: Appreciating the Varietals and Virtues of Fine Tea and Herbs",
        "Authors": "By Amador, Gina (ILT)",
        "Description": "",
        "Category": " Cooking , Beverages , Coffee & Tea",
        "Publisher": "Cole Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Short-Term Psychotherapy and Emotional Crisis",
        "Authors": "By Sifneos, Peter",
        "Description": "Peter Sifneos describes a type of active and brief psychotherapeutic intervention which he believes is tremendously useful for selected patients with circumscribed emotional difficulties. The therapist assists the patient in defining the conflict underlying his dilemma and helps him learn to solve his emotional problems. As a result of this novel educational experience, the patient is able to use these newly acquired techniques to deal with other hazardous situations after the end of treatment. Indeed, the author maintains, the treatment is similar to an immunization procedure that enables certain individuals to prevent the development of emotional difficulties in the future. Dr. Sifneos describes two forms of this short-term therapy, “crisis-intervention” and anxiety-provoking—with emphasis on the latter—and presents in detail the theoretical background, criteria for selection of appropriate patients, technique, and illustrative case material.",
        "Category": " Medical , Psychiatry , General",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Ultimate Weight Solution: The 7 Keys to Weight Loss Freedom",
        "Authors": "By McGraw, Phillip C., Ph.D.",
        "Description": "You have a decision to make. Those are the opening words Dr. Phil uses in his new and groundbreaking weight loss book. You know he is talking to you if you are among the millions who have chased one fad diet after another, none of which ever works. Dr. Phil is talking about the decision you have to make to change all of that. You know those crash diets never last, and you have to quit lying to yourself and get real about making the ultimate choice to finally take control of your weight and your life. \"If you are overweight, you are out of control. That's not a natural place to be,\" says Dr. Phil. The Ultimate Weight Solution will give you the control that you crave.  Dr. Phil wants to lead you to weight loss freedom. He's spent over thirty years working with overweight patients to get results that last. Now, in The Ultimate Weight Solution, he sounds his loudest wake-up call yet, giving the bottom-line truth and his unprecedented 7 Key approach to permanent weight loss.  You know all too well that the \"diet\" experience can be bitterly disappointing. The Ultimate Weight Solution  will change the way you behave and think about food, weight loss, and, ultimately, yourself. In this landmark book, Dr. Phil delivers an action-oriented plan to give you immediate results, results that will last a lifetime. Forget counting calories or tracking carbs or fat. You'll get the real reasons you've lost control of your weight, with tools to identify what to eat, when to eat, how to eat, and why you eat when you don't want to.  Knowledge is power, and you're about to \"break the code\" on how to get off of the weight loss roller coaster and fix this problem once and for all. Dr. Phil hands you the keys so that you can finally be in control of your weight instead of your weight being in control of you.  Congratulations! When you picked up The Ultimate Weight Solution, you took the first important step down the road to weight loss freedom. It's your health, it's your life, it's your decision.  Want to challenge you about your weight and yourself in a way that you have never been challenged before. We both know that the endless string of fad diets has done nothing but leave you heavier than before. The Ultimate Weight Solution is a book that is the product of thirty years of working with overweight patients and figuring out what really works. Giving you the real tools to permanent weight loss will change your life and its quality. I am determined to get you immediate results and do so in a way that will last a lifetime. Permanent weight loss is about changing many things in your life, and The Ultimate Weight Solution will help you do just that -- change yourself, change the way you think about dieting, change the way you think about food, change the way you think about your health. The 7 Keys that are in this book will open doors to a new life for you.   -- Dr. Phil",
        "Category": " Self-help , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Home Buyer's Checklist: A Foolproof Guide to Finding the Perfect House",
        "Authors": "By Scutella, Richard M., Heberle, Dave, and Marcinowski, Jay (ILT)",
        "Description": "Describes the advantages and disadvantages of various home features, and tells how to inspect a home's condition",
        "Category": " Reference , General",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "5.46",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "North American Indians: A comprehensive account",
        "Authors": "By Kehoe, Alice Beck",
        "Description": "Traces the history of the tribes of North America region-by-region, describes each tribe's culture, and looks at the impact of white settlers on Indian life",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Dream of the Golden Mountains: Remembering the 1930s",
        "Authors": "By Cowley, Malcolm",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "6.22",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "Net Worth: Shaping Markets When Customers Make the Rules",
        "Authors": "By Hagel, John and Singer, Marc",
        "Description": "Net Worth explains how businesses can benefit by forming new partnerships with customers in matters of information capture and privacy. Consumers are losing patience with companies that use personal data about buying habits, income levels, and credit card usage for corporate gain. What consumers need is a new kind of business&#151;an information intermediary or infomediary&#151;to protect customers' privacy while maximizing their information assets. Companies playing the infomediary role will become agents of customer information, marketing such data to businesses on consumers' behalf and protecting consumer privacy. John Hagel, co-author of the bestselling Net Gain, teams with Marc Singer to lay out the underlying economic and competitive dynamics that will foster the emerging business of the infomediary. Net Worth identifies the convergence of commerce, technology, and consumer frustration as the incubator for the infomediary business, as consumers seek to release their personal information only when they can receive value in exchange for their data.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "5.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Potomac Portrait",
        "Authors": "By James Q Reber",
        "Description": "",
        "Category": "",
        "Publisher": "Liveright",
        "Price Starting With ($)": "6.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Thieves of Baghdad",
        "Authors": "By Patrick, William and Bogdanos, Matthew",
        "Description": "He’s a spit-and-polish Marine, a competitive boxer, a classics scholar, and an assistant DA in Manhattan. New York tabloids call him “pit bull” for his relentless prosecution of high-profile defendants like Sean “Puff Daddy” Combs and the “baby-faced butchers” of Central Park. When Baghdad fell, Colonel Matthew Bogdanos was in Southern Iraq, tracking down terrorist networks through their financing and weapons smuggling—until her heard about the looting of the museum. Immediately setting out across the desert with an elite group chosen from his multiagency task force, he risked his career and his life in pursuit of Iraq’s most priceless treasures.Thieves of Baghdad takes you from his family’s flight to safety at Ground Zero on 9/11, to his mission to hunt down al-Qaeda terrorists in Afghanistan, and into the war-torn streets of Baghdad on the trail of antiquities. Colorful characters and double-dealing are the norm as Bogdanos tries to sort out what really happened during the chaos of war. We see his team going on raids and negotiating recoveries, blowing open safes and mingling in the marketplaces, and tracking down leads from Zurich and Amman to Lyons, London, and New York. In an investigation that led to the recovery of more than 5,000 priceless objects, complex threads intertwine, and the suspense mounts as the team works to locate the most sensational treasure of all, the treasure of Nimrud, a collection of gold jewelry and precious stones often called “Iraq’s Crown Jewels.”A mixture of police procedural, treasure hunt, wartime thriller, and cold-eyed assessment of the connection between the antiquities trade and weapons smuggling, Thieves of Baghdad exposes sordid truths about the international art and antiquities market. It also explores the soul of a man who is equal parts hardened Marine, dedicated father, and passionate scholar. Most of all it demonstrates that, in a culture as old as that of the Middle East, nothing is ever quite what it seems.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Chadwick Forever",
        "Authors": "By Cummings, Priscilla",
        "Description": "When Chadwick and Esmeralda the crabs return to Shady Creek, they learn that Hester, the Delmarva Peninsula fox squirrel, has discovered that she is an endangered animal and wants to leave the area, and they call a meeting of the other animals, many of whom are also endangered.Chadwick and Esmeralda the crabs learn that Hester, the Delmarva Peninsula fox squirrel, has discovered that she is an endangered animal and wants to leave the area, and they call a meeting of the other animals, many of whom are also endangered",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Tidewater Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Lemons And Oranges",
        "Authors": "By Donhauser, Rose Marie",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Fruit",
        "Publisher": "Silverback Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Last Reflections On a War, Last Comments on Viet-nam; Preface By Dorothy Hall",
        "Authors": "By Falls, Bernard B.",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Co.",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The Purple Emperor: Faerie Wars II (Faerie Wars Chronicles)",
        "Authors": "By Brennan, Herbie",
        "Description": "Henry Atherton, his faerie prince friend Pyrgus, and Pyrgus's fearless sister, Holly Blue, return in this fantastic adventure to save the Faerie Realm from the evil Hairstreak and his henchmen, Chalkhill and Brimstone. With the help of forest faeries, some silk mistresses, a sewer-dwelling creature of unknown dimensions, and additional creatures magical and otherwise, the three intrepid young friends find their way from exile back to the home they all would die to preserve and protect.",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Bloomsbury USA Childrens",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "THE EXECUTIONER #22 Hawaiian Hellground",
        "Authors": "By Pendleton, Don",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "House Poor: Pumped Up Prices, Rising Rates, and Mortgages on Steroids: How to Survive the Coming Housing Crisis",
        "Authors": "By Fletcher, June",
        "Description": "Skyrocketing home values, cheap money, and enticing home equity offers in recent years ... millions of us took on bigger mortgages, bigger houses, and bigger debt. But disturbing signs point to the end of the housing bubble:Home sales and starts are at all-time record highs;In some markets, prices have ballooned by over 100% in the past few years;Interest rates are rising, while consumer debt stands at a record 110% of disposable income;In some cities, real estate investors are creating \"vulture capital\" funds to buy condos cheaply when the market collapses.This indispensable survival guide will address questions that include:Should I take equity out of my house in these uncertain times?If the U.S. market tanks, how can I sell to foreign investors?How can I tell when my hometown is likely to boom or bust?Is it too late to buy as a first-time home-owner?  How about as an investor?What are the best tips to protect my home investment?What are the best tips to increase my investment?Should I just get out of the market now while prices are still hot?Where are America's most vulnerable housing markets?Today's real estate developments could make you house poor, but this is the book to keep you house proud.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Hot Kid",
        "Authors": "By Leonard, Elmore",
        "Description": "Carl Webster, the hot kid of the marshals service, is polite, respects his elders, and can shoot a man driving away in an Essex at four hundred yards. Carl works out of the Tulsa, Oklahoma, federal courthouse during the 1930s, the period of America's most notorious bank robbers: Dillinger, Baby Face Nelson -- those guys.Carl wants to be America's most famous lawman. He shot his first felon when he was fifteen years old. With a Winchester.Louly Brown loves Carl but wants the world to think she is Pretty Boy Floyd's girlfriend.Tony Antonelli of True Detective magazine wants to write like Richard Harding Davis and wishes cute little Elodie wasn't a whore. She and Heidi and the girls work at Teddy's in Kansas City, where anything goes and the girls wear -- what else -- teddies.Jack Belmont wants to rob banks, become public enemy number one, and show his dad, an oil millionaire, he can make it on his own.With tommy guns, hot cars, speakeasies, cops and robbers, and a former lawman who believes in vigilante justice, all played out against the flapper period of gun molls and Prohibition, The Hot Kid is Elmore Leonard -- a true master -- at his best.",
        "Category": " Fiction , Westerns",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Hello to the Cannibals: A Novel",
        "Authors": "By Bausch, Richard",
        "Description": "\"My heart stopped peacefully, its beating grew slow and weak, and then just -- stopped. I died young. There is, really, only a little to tell.\"And so ended, in 1900, the short but remarkable life of explorer and writer Mary Henrietta Kingsley, most of which was spent caring for her ailing mother, and attending to the business of her world-wandering father. But the moment she was unencumbered, she set out on her own journey of discovery. Blithely ignoring the narrowly circumscribed roles and rules for a young woman of her day, she traveled alone to West Africa, and went to places no European had ever been.\"Oh, silent friend, if you ever come to read this ... I am in Africa. Soon I will be walking inland, heading to places unknown.\"It is almost a hundred years later, on her fourteenth birthday, that Lily Austin first hears the name of Mary Kingsley, the only female face in a book full of male adventurers. That night, as an ice storm rages outside, something awful and unexpected befalls Lily; and this is why, as she matures into a young woman, it is to the writings of Kingsley that she returns again and again for solace and comfort -- which she finds, especially, in a secret cache of intimate letters Kingsley wrote to an unnamed woman in the distant future. Lily, the child of professional actors, begins to write a play about Kingsley.\"When they buried me at sea, off the coast of South Africa, the strangest thing happened. My coffin wouldn't sink. It floated away from the ship ... Imagine that. I was still sailing the seas, even in death. I was wandering away.\"On the surface, Lily Austin's life could not be more different from Mary Kingsley's. And yet, working on the play, she finds in her subject's wit and resourcefulness the inspiration -- the bravery -- she needs to navigate the complicated waters of intimacy and betrayal, kindness and love.A triumph of the imagination, Hello to the Cannibals is Richard Bausch's most dazzling and beautifully crafted novel to date.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Jim the Boy : A Novel",
        "Authors": "By Earley, Tony",
        "Description": "The old-fashioned story of a boy named Jim growing up in North Carolina during the Depression with his mother and three uncles perfectly captures the innocence, wonder, and confusion of childhood. A first novel. Reprint. 50,000 first printing.",
        "Category": " Fiction , Literary",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Jane Eyre (Treasury of Illustrated Classics)",
        "Authors": "By Bronte, Charlotte (EDT), Thomson, Sara, and Lauter, Richard (ILT)",
        "Description": "In early nineteenth-century England, an orphaned young woman accepts employment as a governess at Thornfield Hall, a country estate owned by the mysteriously remote Mr. Rochester.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Secret Hour",
        "Authors": "By Rice, Luanne",
        "Description": "One of America’s most mesmerizing storytellers, Luanne Rice enthralls readers with her moving tales of ordinary people in crisis--and how they are transformed by the enduring power of love and family.  Now the author of Safe Harbor, True Blue, and other New York Times bestsellers presents the gripping story of a man fighting for his family, a woman searching for her sister--and the promise of a new life where both least expected it...The Secret HourBeneath his careful and controlled demeanor, attorney John O’Rourke is a man whose life is in turmoil. Since the death of his wife, he has been juggling the rigors of a controversial capital murder case and the demands of raising two children. Eleven-year-old Maggie’s crooked bangs and rumpled clothes eloquently reproach John’s earnest but haphazard attempts at mothering. Teddy, John’s stalwart fourteen-year-old, has quietly assumed responsibilities far too weighty for his young shoulders, as he longs for the way things used to be and tries to ignore the hostility that has swirled around his family since his father took on the defense of a killer whose crimes have rocked Connecticut.A brick through the window one autumn morning signals a dangerous new level of hatred. But a quieter event also takes place that day.  A woman arrives on the O’Rourke doorstep to find a household on the brink of chaos but brimming with love--and, she hopes, answers. Kate Harris is searching for the key to her own mystery. Six months ago her younger sister fled far from their beloved home following a devastating confrontation. After mailing a single postcard from the New England shore, Willa Harris vanished. With only a postmark to go on, Kate takes a leave of absence from her job as a marine biologist to come to the seaside Willa adored--and discovers the one man who may be able to help her.Compelling and evocative, at once suspenseful, heartbreaking, and triumphant, The Secret Hour is an unforgettable novel that explores the power of sisterly love, the gift of second chances--and the way magic can sometimes be the most real thing in the whole world.",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Virgin Blue: A Novel",
        "Authors": "By Chevalier, Tracy",
        "Description": "Meet Ella Turner and Isabelle du Moulin—two women born centuries apart, yet bound by a fateful family legacy. When Ella and her husband move to a small town in France, Ella hopes to brush up on her French, qualify to practice as a midwife, and start a family of her own. Village life turns out to be less idyllic than she expected, however, and a peculiar dream of the color blue propels her on a quest to uncover her family’s French ancestry. As the novel unfolds—alternating between Ella’s story and that of Isabelle du Moulin four hundred years earlier—a common thread emerges that unexpectedly links the two women. Part detective story, part historical fiction, The Virgin Blue is a novel of passion and intrigue that compels readers to the very last page.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Lady and the Unicorn: A Novel",
        "Authors": "By Chevalier, Tracy",
        "Description": "A tour de force of history and imagination, The Lady and the Unicorn is Tracy Chevalier’s answer to the mystery behind one of the art world’s great masterpieces—a set of bewitching medieval tapestries that hangs today in the Cluny Museum in Paris. They appear to portray the seduction of a unicorn, but the story behind their making is unknown—until now.Paris, 1490.  A shrewd French nobleman commissions six lavish tapestries celebrating his rising status at Court. He hires the charismatic, arrogant, sublimely talented Nicolas des Innocents to design them. Nicolas creates havoc among the women in the house—mother and daughter, servant, and lady-in-waiting—before taking his designs north to the Brussels workshop where the tapestries are to be woven. There, master weaver Georges de la Chapelle risks everything he has to finish the tapestries—his finest, most intricate work—on time for his exacting French client. The results change all their lives—lives that have been captured in the tapestries, for those who know where to look.In The Lady and the Unicorn, Tracy Chevalier weaves fact and fiction into a beautiful, timeless, and intriguing literary tapestry—an extraordinary story exquisitely told.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Voice of America: Stories",
        "Authors": "By Demarinis, Rick",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Try Again Sally Jane",
        "Authors": "By Mary Diestel-Feddersen",
        "Description": "",
        "Category": "",
        "Publisher": "Gareth Stevens Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Joy to the World: A Treasury of Christmas Crafts",
        "Authors": "By Cowles Creative Publishing (COR) and Howe, Deborah (EDT)",
        "Description": "",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Parenting Your 1-to-4-Year Old",
        "Authors": "By Popkin, Michael H.",
        "Description": "This book shows you how to discipline your young children without hitting them.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Active Parenting",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Sinatra a Life Remembered",
        "Authors": "By Irwin, Lew",
        "Description": "Tracks Frank Sinatra from the early days in Hoboken, his turbulent marriages, his relationships with the \"Rat Pack,\" and his award-winning career",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Major Writers of Early American Literature",
        "Authors": "By EMERSON, Everett H.",
        "Description": "Major Writers of Early American Literature provides a fresh appraisal of the most important authors of seventeenth and eighteenth century America. Although knowledge of early American literature has been greatly widened and deepened in recent years, the standard study of this literature is nearly a hundred years old. It is time for a new study, which will take into account the modern reader as well as such recent findings as the discovery only a generation ago of America's best early poet.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "University of Wisconsin Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1976"
        }
    },
    {
        "Title": "Prevention's Quick and Healthy Low-Fat Cooking: From Entertaining to the Everyday, over 200 Delicious Recipes",
        "Authors": "By Rogers, Jean",
        "Description": "Gathers healthful recipes for appetizers, soups, salads, vegetables, meat, poultry, fish, seafood, and desserts, and discusses the advantages of a low-fat diet",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Little Bear's Friend, An I Can Read Book",
        "Authors": "By Minarik, Else Holmelund",
        "Description": "This is the third book about Little Bear. All his old friends are back—Owl, Cat, Duck, and Hen—and a new friend has come for the summer—a little girl named Emily. Emily has her doll, Lucy, with her, and she promptly introduces Lucy to Little Bear. The three get along wonderfully, and when summer ends, Emily finds the perfect parting gift for her friend.Beginning readers who already know Little Bear will welcome him joyously, and youngsters who meet Little Bear and Emily here for the first time have a treat in store, for the story and the pictures are better than ever.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    }
]