[
    {
        "Title": "Dinosaur (Eye Wonder)",
        "Authors": "By Gray, Samantha and Walker, Sarah",
        "Description": "A precursor to DK's awarding-winning Eyewitness series, Eye Wonder was specially developed for children aged five plus, featuring astonishing photography exhibiting subjects within their natural setting, offering a whole new level of information through powerful images. Each title in the series now contains educational activities including true and false questions, quizzes, matching games, and mazes. Vocabulary is accessible to young readers, with the meanings of new, subject-related words clearly explained. The combination of visuals and informative, accurate text will hook even those children who usually avoid books. Eye Wonder: Dinosaurs takes young readers back in time to an age when dinosaurs ruled the earth, from gentle Jurassic giants and the terrifying Tyrannosaurus Rex, to fearsome packs of Velociraptors and herds of Hadrosaurs.",
        "Category": " Juvenile Nonfiction , History , Prehistoric",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Gourmet LA: A Collection of Fresh and Elegant Recipes",
        "Authors": "By Beck, Myron (PHT) and Junior League of Los Angeles",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Junior League of Los Angeles",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Milk-Free Kitchen",
        "Authors": "By Kidder, Beth",
        "Description": "Here is the only all-purpose, appetizers-to-candy cookbook for the millions of Americans who must avoid having milk and milk products in their diets. Included here are many easy-to-follow recipes for baked goods (which are usually laden with dairy products) for the lactose intolerant or milk-allergic sufferer who must either learn to bake milk-free or go without cakes, cookies, pies, muffins, biscuits, and puddings. The appendix also lists recipes for baked goods that are egg-free.\"Most people who deal with food intolerances day in and day out become pretty good 'scratch' cooks. I wrote this book as an all-occasion cookbook. The idea is to give you lots of choices. The Milk-Free Kitchen is focused on all the things you can have. The idea behind every recipe here is that the food should taste good. I hope you will enjoy your milk-free meals and that you and the people with whom you share them will not feel deprived or 'different'\"—Beth Kidder",
        "Category": " Cooking , Specific Ingredients , Dairy",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Snap",
        "Authors": "By Snow, Carol",
        "Description": "Madison Sabatini thought she knew who she was: an almost-sophomore with a bright future. The newest photographer on her school paper. A shopaholic with great hair and a fabulous wardrobe. Then, in a flash, everything changed.Now she's stuck in Sandyland, a gloomy beach town in the middle of nowhere, living with her parents in a crappy hotel \"suite.\" Instead of spending the summer with her friends at home, she's hanging out with pink-haired Delilah, an artist who works in a shop called Psychic Photo, and a skater boy named Duncan who's totally not her type. Except, maybe he is . . .Determined to make the best of things, Madison throws herself into her one passion: photography. But when strange figures start appearing in her pictures—people who weren't there when she snapped the shots, people who are later reported dead—she begins to question everything about who she is . . . and who she wishes she could be.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "A Tale Of Ten Cities - The Triple Ghetto In American Religious Life",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "see notes for publisher info",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Batting Four Thousand: Baseball in the Western Reserve",
        "Authors": "By Sullivan, Brad (EDT)",
        "Description": "In Batting Four Thousand: Baseball in the Western Reserve are twenty  articles about people, events, and ideas from the four corners of that “strange and wonderful thing we call Cleveland baseball,” as editor Brad Sullivan calls it. The all-star roster of contributors includes leading SABR researchers and Cleveland sportswriters who share their deep knowledge of Cleveland’s professional teams, including the Buckeyes and Tate Wars, as well as of the storied Indians—even of Cleveland’s brief entry in the American Association. For the significance of the journal’s enigmatic title, see Russell Schneider’s moving piece about Gomer Hodge.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Society for American Baseball Research",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Swiss Courier",
        "Authors": "By Yorkey, Mike and Goyer, Tricia",
        "Description": "It is August 1944 and the Gestapo is mercilessly rounding up suspected enemies of the Third Reich. When Joseph Engel, a German physicist working on the atomic bomb, finds that he is actually a Jew, adopted by Christian parents, he must flee for his life to neutral Switzerland.Gabi Mueller is a young Swiss-American woman working for the newly formed American Office of Strategic Services (the forerunner to the CIA) close to Nazi Germany. When she is asked to risk her life to safely \"courier\" Engel out of Germany, the fate of the world rests in her hands. If she can lead him to safety, she can keep the Germans from developing nuclear capabilities. But in a time of traitors and uncertainty, whom can she trust along the way?This fast-paced, suspenseful novel takes readers along treacherous twists and turns during a fascinating--and deadly--time in history.",
        "Category": " Fiction , Christian , Historical",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Shakespeare: The Art of the Dramatist",
        "Authors": "By Frye, Roland Mushat",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Co",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "Death at St. Asprey's School: A Carolus Deene Mystery (Carolus Deene Series)",
        "Authors": "By Bruce, Leo",
        "Description": "There are strange goings-on at St. Asprey's, an expensive boys' preparatory school: footsteps in passages at night . . . strange lights . . . rabbits with battered skulls. Carolus Deene has some spine-tingling experiences before he solves the mystery.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Chicago Review Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Three Graces: Faith, Hope, Love",
        "Authors": "By Grimbol, William R.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Alpha Books",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Fuzzy Duckling (A Golden Fuzzy-Wuzzy Book)",
        "Authors": "By Teitelbaum, Michael, Watson, Jane Werner, and Borgo, Deborah (ILT)",
        "Description": "Feeling lonely, the fuzzy duckling looks for a friend, but the colts, calves, turkeys, geese, lambs, pigs, and puppies won't play with her",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "The Only Grant-Writing Book You'll Ever Need: Top Grant Writers and Grant Givers Share Their Secrets!",
        "Authors": "By Karsh, Ellen and Fox, Arlen Sue",
        "Description": "The competition for government and foundation grants is steeper than ever in this post-9/11 environment of urgent monetary need. For everyone who has to raise money through grants, for every type of organization and government agency, comes a book that details winning strategies for developing grant proposals, from authors who know where the money is and know how to get it. The authors frame writing the grant proposal as the final, not-too-difficult step in a comprehensive and methodical process. From the first step of determining what kinds of funding are most appropriate, they show readers how to identify a compelling need, analyze the effectiveness of existing programs to address that issue, and develop one or more of these existing programs or create an innovative one that will indeed have an impact. Along the way, they explain how to build a coalition when it is needed to implement the program efficiently. The grant application becomes a showcase for readers’ organization, well-designed programs, and dedicated partners.",
        "Category": " Social Science , Philanthropy & Charity",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "In Every Heartbeat",
        "Authors": "By Sawyer, Kim Vogel",
        "Description": "As three friends who grew up in the same orphanage head off to college together, they each harbor a cherished dream. Libby wishes to become a famous journalist, Pete plans to study to become a minister, and Bennett wants to join a fraternity and have as much fun as possible. But as tensions rise around the world on the brink of World War I, the friends' differing aspirations and opinions begin to divide them, as well. And when Libby makes a shocking discovery about Pete's family, will it drive a final wedge between the friends or bond them in ways they never anticipated?",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Together Again: Love Inspired",
        "Authors": "By Hannon, Irene, Wolverton, Cheryl, and Kastner, Deb",
        "Description": "",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Steeple Hill Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Tackle Craft",
        "Authors": "By Pfeiffer, C. Boyd",
        "Description": "Detailed explanations are given for making, maintaining, and repairing popular lures and tackle accessories",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "December",
            "Year": "1974"
        }
    },
    {
        "Title": "B Is for Bunny",
        "Authors": "By Stone, Tanya Lee and Rama, Sue (ILT)",
        "Description": "B is for bunny   She’s always hip-hopping   Her button nose twitching   Her long ears flip-flopping!   Little ones will love learning about springtime in the newest shaped alphabet book. Rhyming couplets celebrate everything spring from bunnies to blooming flowers to budding trees. And because it’s shaped like adorable bunny ears, everyone will be hopping wildly for B Is for Bunny.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to American History, 4E",
        "Authors": "By Axelrod, Alan",
        "Description": "America?s Past and Its Relevance Today  At times America?s historical events can seem like a random collection of names, dates, and events, with no coherent storyline to pull them together. Understood as our collective biography, however, and free of the cheerleading found in many textbooks, The Complete Idiot?s Guide to American History, Fourth Edition, enriches our understanding of who we are and gives us an understanding of where we are going.",
        "Category": " History , United States , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Calendar Creator Plus (Version 5.0)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Power Up Corp",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Barbara & Susan's Guide to the Empty Nest: Discovering New Purpose, Passion & Your Next Great Adventure",
        "Authors": "By Rainey, Barbara and Yates, Susan",
        "Description": "You’re done . . . but you’re not finished! And one more thing. You’re not alone.  Feeling unsure? Scared? Expectant? Maybe even giddy? Is your nest empty—except for a bundle of mixed emotions? As you grieve what’s behind and daydream about possibilities, you’ll feel young again, ready for new challenges and adventures. Yet you may not know what to pursue or how to discover what’s next.  Many women in this season of life wonder: Who am I now? And what should I do? How will my marriage be affected? Does anyone need me? How do I relate to my children? Is it okay to feel sad? Or thrilled?  What’s next? Barbara and Susan can be the friends you need to walk you through these new experiences. They’ll guide you to answers, and together you’ll discover a new purpose and passion for your next life adventure.",
        "Category": " Family & Relationships , Life Stages , General",
        "Publisher": "FamilyLife",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "My Final Answer for Kids: Thirty Interactive Quizzes That Put You in the Hot Seat",
        "Authors": "By Kent, Paul",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Ajax For Dummies",
        "Authors": "By Holzner, Steven",
        "Description": "Ajax is short for “Asynchronous JavaScript+CSS+DOM+XMLHttpRequest.”Even if you weren’t intimidated before, that tidbit is probably enough to make you reach for the Excedrin. Just reach for Ajax For Dummies instead. With screen shots, actual code and explanations, and live Web sites where you can see Ajax applications doing their thing, it will have you using Ajax to create Web applications that look an act like desktop applications in no time. With Ajax, you can speed up and clean up your Web applications. Shoppers at your online store can fill their carts without waiting for multiple page refreshes. Searchers on your sites can get instant results on the same page.This guide takes you on a tour of how Ajax is used today, complete with examples of Ajax applications in action, such as an Ajax-enabled Yahoo! search or an Ajax-based chat application. Then it gives you basics on using JavaScript. After that you dive in and get info on:Writing some Ajax, interactive mouseovers using Ajax, passing data to the server with GET or POST, and moreConnecting to Google for a live searchUsing free Ajax frameworks so you don’t have to start from scratch, including Ajax Gold (written specifically for this book), AJAXLib, and grabbing XML with libXmlRequestAll kinds of Ajax techniques, such as using Ajax for drag-and-drop operations, pop-up menus, downloading images behind the scenes, and moreUsing SACK (simple AJAX code kit), decoding XML with Sarissa, and creating visual effects with RicoHandling XML int Ajax ApplicationsWorking with cascading style sheets (CCS) in Ajax, including setting up the styles, displaying a menu, styling text, handling colors and backgrounds, and moreWorking with Ajax and PHPComplete with a companion Web site, free Ajax frameworks, and sample code you can use, Ajax for Dummies is your friendly guide to creating truly user-friendly Web sites!Note: CD-ROM/DVD and other supplementary materials are not included as part of eBook file.",
        "Category": " Computers , Data Transmission Systems , Broadband",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "We Americans (Story of man library)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "National Geographic Society",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Personality",
        "Authors": "By Burger, Jerry M.",
        "Description": "Brings personality theories to life with personality test exercises, news topics boxes, and boxes on key figures in the field. For each major theoretical approach, there is a chapter on theory, applications, and assessment, with an accompanying chapter on relevant research.  Twenty-six research programs are covered in seven research chapters, illustrating research processes in the field. This fifth edition contains new material on research in gender and culture, defense mechanisms, and cognitive interpretation of Freudian concepts. The author teaches psychology at Santa Clara University. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Psychology , Personality",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Jamie's Way: Stories for Worship and Family Devotion",
        "Authors": "By Harriss, Susan C.",
        "Description": "A collection of story-sermons for children about moral and religious questions intended to be read aloud in the context of family worship.",
        "Category": "",
        "Publisher": "Cowley Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The A to Z no-cook cookbook",
        "Authors": "By Rojas-Lombardi, Felipe",
        "Description": "",
        "Category": "",
        "Publisher": "R-L Creations, inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Whack-a-Mole: The Price We Pay For Expecting Perfection",
        "Authors": "By Marx, David",
        "Description": "A systems engineer and high consequence industry consultant, David Marx, uses national, international and personal stories to outline the prevalence and complexities of human error. Arguing that our approach to human fallibility is flawed, Marx applies principles of a Just Culture model to topics such as medical malpractice reform, healthcare and aviation safety, human resources policies, and parenting. Rather than embracing a merely reactive approach to human error, Marx argues for holding people accountable based on the quality of their choices—not merely the positive or negative outcomes in any given situation. On a macro level, this would include retiring the medical malpractice system, re-evaluating tort reform objectives and incorporating error-reporting systems into healthcare and aviation sectors. On a micro level, Marx encourages readers to release their expectations of perfection and embrace personal accountability for choices they and their neighbors make daily.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "By Your Side Studios",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "New Testament Activity Bible: Favorite Stories Jesus Told (Faith Kids)",
        "Authors": "By Bond, Bob (ILT) and Bond, Bob",
        "Description": "Tells Bible stories, including Noah, Moses, David and Goliath, Daniel and the lion's den, and Jonah, and provides games and puzzles for each story.",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Braving the Fire",
        "Authors": "By Severance, John B.",
        "Description": "John B. Severance, whose latest biography was Einstein, Visionary Scientist, now turns his research skills and fine eye for detail to fiction. The last two years of the Civil War are the setting for this fast-paced story of a 15-year-old Maryland farm boy who joins the Union Army, despite being torn between loyalty to his father, a Union officer, and loyalty to his grandfather, a Confederate. When foraging Confederate soldiers burn down the barn on Jem’s land, he and his best friend go off on what they think will be a glorious adventure. But they are hardly prepared for the true face of battle as they fight the enemy—boys like themselves—in the woods and swamps, become part of the regiment proudly known as General Barlow’s Boys, march through blood-soaked cornfields, and witness death. Details of the soldiers’ daily life and vivid depictions of actual battles and historical figures are interwoven with bits of dark humor and even a touch of romance in this well-wrought novel that clearly shows there is no glory in war.",
        "Category": " Young Adult Fiction , Historical , United States , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Spy Who Wants Me",
        "Authors": "By Lucy Monroe",
        "Description": "",
        "Category": "",
        "Publisher": "Kensington Publishing Corp.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to American History",
        "Authors": "By Axelrod, Alan",
        "Description": "This guide will give you an overview of American history from early, Native American history to modern times.  It covers the milestones of the country's history, provides biographical sketches of the most important figures of each era, gives a chronologies of the nation's leaders, and defines key historical terms.",
        "Category": " History , United States , General",
        "Publisher": "Alpha Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Sharing The Gift Of Encouragement (The in Touch Study Series)",
        "Authors": "By Stanley, Charles F.",
        "Description": "Dr.Charles Stanley's new series of Bible study guides features insights and wisdom of this beloved pastor and author.  Small groups and individuals who want a Bible study that's spiritually sound and practical will find a wealth of ideas to help them understand and apply the Scriptures to the real world. Each title takes a unique fourfold approach to get the most out of Bible study time-emphasizing personal identifications with the Scripture passage, recognition of your emotional response, reflection of the passage's meaning and application, and taking steps to apply what's been learned.  This is a sound way to explore the Word of God.",
        "Category": " Religion , Ethics",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Stolen Seduction",
        "Authors": "By Naughton, Elisabeth",
        "Description": "When she finds herself on the wrong side of a police interrogation, cop Hailey Roarke must take matters into her own hands if she wants to clear her name, which leads her to Detective Shane Maxwell who joins her on an international hunt for a sadistic killer. Original. 150,000 first printing.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Christmas Cookie Club: A Novel",
        "Authors": "By Pearlman, Ann",
        "Description": "Mark your calendar. It's the Christmas Cookie Club! Every year on the first Monday of December, Marnie and her twelve closest girlfriends gather in the evening with batches of beautifully wrapped homemade cookies. Everyone has to bring a dish, a bottle of wine, and their stories. This year, the stories are especially important. Marnie's oldest daughter has a risky pregnancy. Will she find out tonight how that story might end? Jeannie's father is having an affair with her best friend. Who else knew about the betrayal, and how can that be forgiven or forgotten, even among old friends such as these? Rosie's husband doesn't want children, and she has to decide, very soon, whether or not that's a deal breaker for the marriage. Taylor's life is in financial freefall. Each woman, each friend has a story to tell, and they are all interwoven, just as their lives are.On this evening, at least, they can feel as a group the impulses of sisterly love and conflict, the passion and hopefulness of a new romance, the betrayal and disillusionment some relationships bring, the joys and fears of motherhood, the agony of losing a child, and above all, the love they have for one another. As Marnie says, the Christmas Cookie Club, if it's anything, is a reminder of delight.The Christmas Cookie Club is about the paths Marnie and her friends have traveled, the absolute joy they take in life and love despite the decisions they've regretted, the hard choices and amends they've had to make, and the sacrifices along the way. Ultimately, The Christmas Cookie Club is every woman's story. As you read about Marnie and her friends, their struggles and triumphs, what makes them laugh and what has made them cry, you'll see yourself and some of the ingredients of your own story. Celebrating courage and joy in spite of hard times and honoring the importance of women's friendships as well as the embracing bonds of community, Ann Pearlman has written a novel that speaks to us all.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Everything Cookbook",
        "Authors": "By Lawson, Karen, Jaycox, Faith, and Jaycox, Sarah",
        "Description": "A fun, colorful all-purpose cookbook features advice on how to prepare appetizers, snacks, breads, muffins, salads, sauces, meat, fish, vegetables, casseroles, soups, pizza, sandwiches, desserts, and much more. Original.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "If You're Happy And You Know It",
        "Authors": "By Sexton, Brenda (ILT)",
        "Description": "A fun song in a unique board book format with applique on the cover and colorful ribbon tags perfect for little hands!If you're happy and you know it, clap your hands.  Clap! Clap!If you're happy and you know it, stomp your feet.  Stomp! Stomp!If you're happy and you know it, shout \"Hurray!\"  Hurray!If you're happy and you know it, then your face will surely show it.This adorable board book features soft applique on the cover, and on each spread are smooth and colorful ribbon tags that babies and toddlers will love to touch.  Based on the popular Taggies blankets!",
        "Category": " Juvenile Nonfiction , Concepts , Senses & Sensation",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Everyday Prayers for Everyday Cares/Women",
        "Authors": "By Honors Books",
        "Description": "",
        "Category": " Religion , Prayerbooks , Christian",
        "Publisher": "Cook Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Russians & Reagan",
        "Authors": "By Talbott, Strobe",
        "Description": "Examines the development of relations between the Soviet Union and the United States and discusses the Russian view of the Reagan administration",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Reckless Endangerment: How Outsized Ambition, Greed, and Corruption Led to Economic Armageddon",
        "Authors": "By Morgenson, Gretchen and Rosner, Joshua",
        "Description": "A Washington Post Notable Nonfiction Book for 2011One of The Economist’s 2011 Books of the Year The New York Times's Pulitzer Prize-winning columnist reveals how the financial meltdown emerged from the toxic interplay of Washington, Wall Street, and corrupt mortgage lendersIn Reckless Endangerment, Gretchen Morgenson, the star business columnist of The New York Times, exposes how the watchdogs who were supposed to protect the country from financial harm were actually complicit in the actions that finally blew up the American economy. Drawing on previously untapped sources and building on original research from coauthor Joshua Rosner—who himself raised early warnings with the public and investors, and kept detailed records—Morgenson connects the dots that led to this fiasco. Morgenson and Rosner draw back the curtain on Fannie Mae, the mortgage-finance giant that grew, with the support of the Clinton administration, through the 1990s, becoming a major opponent of government oversight even as it was benefiting from public subsidies. They expose the role played not only by Fannie Mae executives but also by enablers at Countrywide Financial, Goldman Sachs, the Federal Reserve, HUD, Congress, the FDIC, and the biggest players on Wall Street, to show how greed, aggression, and fear led countless officials to ignore warning signs of an imminent disaster. Character-rich and definitive in its analysis, this is the one account of the financial crisis you must read.",
        "Category": " Business & Economics , Economic Conditions",
        "Publisher": "Times Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Infinite Days: A Vampire Queen Novel (Vampire Queen, 1)",
        "Authors": "By Maizel, Rebecca",
        "Description": "The first in the delicious new Vampire Queen YA series, a tale that rewrites the rules of blood-sucking eternity\"I never expected to be sixteen again...then again, I never expected my past to come back and haunt me . . .\"After centuries of terrorizing Europe as the world's most powerful vampire queen, Lenah is finally able to realize the dream all vampires have -- to be human again.  After performing a dangerous ritual to restore her humanity, Lenah entered a century-long hibernation, leaving behind the wicked coven she ruled over and the eternal love, Rhode, who sacrificed himself in the ritual to grant her deepest wish. But when Lenah draws her first natural breath in centuries at Wickham  Boarding School in Lover's Bay, Massachusetts, she rediscovers a human life that bears little resemblance to the one she had known. As if suddenly waking up a teenager isn't hard enough, she has to dress herself appropriately, go to class, and be gawked at as the beautiful new girl, all while learning her new human senses and weaknesses -- and trying not to fall in love with Justin, the most popular guy in school. And right when she thinks she has the hang of it, the worst happens: Her old life collides violently with her new one, making Lenah realize how attached she's become to her humanity. How can she choose between protecting her new friends and honoring her past?“Infinite Days is a wonderfully sexy, dark novel full of lush prose. Rebecca Maizel is a marvel, writing more than just a story, she creates myth with every page.” —Carrie Jones, author of New York Times bestselling series, NEED",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Soups",
        "Authors": "By Janine Flew",
        "Description": "",
        "Category": "",
        "Publisher": "Fog City Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Coming of the King (Spectra)",
        "Authors": "By Tolstoy Nikolai",
        "Description": "An epic novel of the life of Merlin follows the man of great powers on a remarkable journey that ends in a meeting with destiny on the hills of Dinerth, where history will take a turn",
        "Category": " Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Building Dynamic Faith",
        "Authors": "By Falwell, Jerry",
        "Description": "Using inspirational examples on faith as illustrated by the life and faith of Dr. Jerry Falwell, Building Dynamic Faith invites readers to experience the changing power of faith in their own lives.The book is divided into 31 chapters - perfect for a month of daily readings.  But it is more than a devotional. The reader will progress from a simple understanding of faith, to having practiced the skills needed to exercise faith, and finally to having experienced the blessing of God through answered prayer.",
        "Category": " Religion , Devotional",
        "Publisher": "World Pub",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Quiet Whispers from God's Heart for Women",
        "Authors": "By Fuller, Cheri",
        "Description": "Most women attempt to slow down long enough to connect with their Creator, but are repeatedly distracted by long \"to-do\" lists, job responsibilities, or the demands associated with raising a family. In this inspiring new gift book, best-selling author Cheri Fuller offers women a \"time-out\" from the hectic pace of everyday living. Selected poems, quotes and scriptures surround Fuller's true-life stories, while the \"whisperings\" of the Holy Spirit invite quiet reflection.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Going Along with Lewis & Clark",
        "Authors": "By Fifer, Barbara",
        "Description": "",
        "Category": " Young Adult Nonfiction , History , United States , 19th Century",
        "Publisher": "Farcountry Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The RoMANtics Guide: Hundreds of Creative Tips for a Lifetime of Love",
        "Authors": "By Webb, Michael",
        "Description": "The Romantic's Guide contains hundreds of tips for the romantically impaired. There are unique ideas on gift-giving, creative dating, having fun with food, and all the little things you can do each day for increasing the romantic potential of even the most stoic of lovers. The perfect gift for anyone involved in a loving relationship.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Little Visits on the Go: With Cassette",
        "Authors": "By Simon, Mary Manz",
        "Description": "Children learn about Jesus in these brief stories accompanied by prayers, songs, and suggested Bible verses.",
        "Category": " Juvenile Nonfiction , Religion , Christianity",
        "Publisher": "Concordia Publishing House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The Electronic Christian: 105 Readings from Fulton J. Sheen.",
        "Authors": "By Sheen, Fulton J.",
        "Description": "Excerpts from the work of one of the first Christian evangelists to exploit the mass media of radio and television are arranged on the themes of dogma, the life and teachings of Christ, ecumenism, and Christian living",
        "Category": " Religion , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Not That Kind of Place",
        "Authors": "By Fyfield, Frances",
        "Description": "Crown Prosecutor Helen West and Detective Superintendent Geoffrey Bailey investigate the discovery of a naked body in the woods and uncover a hidden world of envy, greed, lust, and rage in a tiny hamlet",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "The Story of Ruth (Now You Can Read Bible Stories...)",
        "Authors": "By Matthews, Leonard",
        "Description": "",
        "Category": "",
        "Publisher": "Rourke Publications",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Making Sense of God: A Woman's Perspective (Called to Holliness: Spirituality for Catholic Women)",
        "Authors": "By Dreyer, Elizabeth A.",
        "Description": "Called To Holiness: Spirituality for Catholic Women   \"Discovering who we are as women in God's sight is an amazing journey toward truth and love. We make sense of God as we reflect, walk, drive, ponder and question the meaning of our lives as Christians.\"   The moment is ripe for ordinary Catholic women to \"do Christian theology.\" Times such as these challenge us to be holy, to be alive in the Spirit, to summon the energy and make the commitment to help one another grow spiritually. Now is the time for Catholic women to make sense of God.   In this introductory volume to the groundbreaking eight-volume series, Called to Holiness: Spirituality for Catholic Women, Catholic theologian Elizabeth Dreyer encourages us to acknowledge our dignity, harvest our gifts and empower all women in church and society. Dreyer helps us to shape what we think about God, justice, love, prayer, family life, the destiny of humanity and the entire universe.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "St. Anthony Messenger Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Sword in the Stone Legends of King Arthur",
        "Authors": "By James Knowles",
        "Description": "",
        "Category": "",
        "Publisher": "Post Productions",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Black Man's Burden: Africa and the Curse of the Nation-State",
        "Authors": "By Davidson, Basil",
        "Description": "Traces the roots of Africa's independence movement and the continent's present-day political instability, arguing that Africa's colonial legacy has resulted in the formation of nation-states based on flawed European models",
        "Category": " History , Africa , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Pure Sin (Privilege)",
        "Authors": "By Brian, Kate",
        "Description": "The drama follows her wherever she goes: Ariana Osgood’s reign continues in this Private series spin-off.After escaping from the Brenda T. Trumball Correctional Facility for Women and stealing the identity of rich socialite, Ariana Osgood finally thought she was on the path she always believed she deserved. But her past caught up with her and is blackmailing her right back to her old ways. Everything she wants seems further out of reach. The Privilege series continues with all the suspense, romance, drama and, wherever Ariana is concerned, murder.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "The firebringer, and other great stories;: Fifty-five legends that live forever,",
        "Authors": "By Untermeyer, Louis",
        "Description": "",
        "Category": "",
        "Publisher": "M. Evans; distributed in association with Lippincott, Philadelphia",
        "Price Starting With ($)": "8.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The New American Judaism: The Way Forward on Challenging Issues from Intermarriage to Jewish Identity",
        "Authors": "By Blecher, Arthur",
        "Description": "Popular Washington, D.C. rabbi and psychotherapist Arthur Blecher believes that the American Jewish community is actually flourishing amidst fears of dying out. He shows us that intermarriage strengthens Judaism--a concept that many Jews continue to debate. In straightforward and engaging chapters, he provides a progressive and positive outline of how this religion has changed over the years, and why American Jewish culture must be embraced and discussed in depth in Jewish families. This is a fascinating exploration of the ways in which social and psychological forces created a new and quite different form of Judaism in America more than one hundred years ago.",
        "Category": " Religion , Judaism , History",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Turtles and Tortoises (Complete Pet Owner's Manuals)",
        "Authors": "By Bartlett, Richard D. and Bartlett, Patricia Pope",
        "Description": "Is a turtle easier to keep than a tortoise? For that matter, what are the differences between the two? These are only the first of many questions answered in this book. The authors describe both indoor and outdoor housing, discuss lighting and heating, and go into great detail on questions of food, health care, and breeding.",
        "Category": " Pets , Reptiles, Amphibians & Terrariums",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Chip & Dip Lovers Cookbook",
        "Authors": "By Bollin, Susan",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Golden West Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "On the John University: World History",
        "Authors": "By Kelli Dugan",
        "Description": "",
        "Category": "",
        "Publisher": "Sweetwater Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Design Solutions for Small Gardens (Time-Life Garden Factfiles)",
        "Authors": "By McHoy, Peter",
        "Description": "",
        "Category": " Gardening , Techniques",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "A Book of Courage (Book Of... Series)",
        "Authors": "By Rice, Helen Steiner and Ruehlmann, Virginia J.",
        "Description": "Poems deal with courage as it is needed in situations involving the individual, family, business, community, nation, and world",
        "Category": " Religion , General",
        "Publisher": "Fleming H. Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Deeper Than Midnight (The Midnight Breed, Book 9)",
        "Authors": "By Adrian, Lara",
        "Description": "DELIVERED FROM THE DARKNESS, A WOMAN FINDS HERSELF PLUNGED INTO A PASSION THAT IS DEEPER THAN MIDNIGHT.   At eighteen, Corinne Bishop was a beautiful, spirited young woman living a life of privilege as the adopted daughter of a wealthy family. Her world changed in an instant when she was stolen away and held prisoner by the malevolent vampire Dragos. After many years of captivity and torment, Corinne is rescued by the Order, a cadre of vampire warriors embroiled in a war against Dragos and his followers. Her innocence taken, Corinne has lost a piece of her heart as well—the one thing that gave her hope during her imprisonment, and the only thing that matters to her now that she is free.Assigned to safeguard Corinne on her trip home is a formidable golden-eyed Breed male called Hunter. Once Dragos’s most deadly assassin, Hunter now works for the Order, and he’s hell-bent on making Dragos pay for his manifold sins. Bonded to Corinne by their mutual desire, Hunter will have to decide how far he’ll go to end Dragos’s reign of evil—even if carrying out his mission means shattering Corinne’s tender heart.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Would You Rather . . . ?: The Outrageous Book of Bizarre Choices",
        "Authors": "By Horn, Randy and Horn, Darcy",
        "Description": "Would You Rather...? takes the idea of parlor game questions to a new level of debate and lunacy. It&#39;s a chunky book of 400 questions that range from the heinous to the nauseating to the downright disturbing, each a field-tested conversation starter—because no matter how strange or far-fetched, Would You Rather...? knows that choice provokes thinking, and thinking is fun. Some questions, like a Rorschach test, reveal values: Would you rather . . . Age only from the neck up -OR- age only from the neck down? Be stupid and rich -OR- smart and poor? Some delight in their own grossness: Eat three earthworms -OR- wear a necklace made of them on your wedding day? Be trapped in an elevator with wet dogs -OR- three fat men with bad breath? Some churn up prejudices: Lose your mate to the same sex as yourself -OR- the opposite sex? Some create that squirming sensation: Get a bad case of poison ivy way up inside your nose -OR- inside your inner ear? Or ethical dilemmas: Be president of a firm that poaches endangered species -OR- work for a corrupt politician? And some are just deliciously absurd: Catch a porcupine thrown from a second-story window -OR- a skunk thrown from the same window? Each question is followed up with related, often off-the-wall information, from odd trivia to dumb jokes to the occasional practical advice (go for the skunk—the porcupine&#39;s got 30,000 quills, while tomato juice will take away the skunk smell).",
        "Category": " Reference , Questions & Answers",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Air War 1939-1945",
        "Authors": "By Overy, R. J.",
        "Description": "Clears the ground of myths and misconceptions about the nature of air power,...first book of its kind in English to treat the war in the air as a whole. DSThe Economist",
        "Category": " History , Military , Aviation",
        "Publisher": "Stein & Day",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Wrecking Crew: How Conservatives Rule",
        "Authors": "By Frank, Thomas",
        "Description": "From the author of the landmark bestseller What’s the Matter with Kansas?, a jaw-dropping investigation of the decades of deliberate—and lucrative—conservative misruleIn his previous book, Thomas Frank explained why working America votes for politicians who reserve their favors for the rich. Now, in The Wrecking Crew, Frank examines the blundering and corrupt Washington those politicians have given us. Casting back to the early days of the conservative revolution, Frank describes the rise of a ruling coalition dedicated to dismantling government. But rather than cutting down the big government they claim to hate, conservatives have simply sold it off, deregulating some industries, defunding others, but always turning public policy into a private-sector bidding war. Washington itself has been remade into a golden landscape of super-wealthy suburbs and gleaming lobbyist headquarters—the wages of government-by-entrepreneurship practiced so outrageously by figures such as Jack Abramoff.It is no coincidence, Frank argues, that the same politicians who guffaw at the idea of effective government have installed a regime in which incompetence is the rule. Nor will the country easily shake off the consequences of deliberate misgovernment through the usual election remedies. Obsessed with achieving a lasting victory, conservatives have taken pains to enshrine the free market as the permanent creed of state.Stamped with Thomas Frank’s audacity, analytic brilliance, and wit, The Wrecking Crew is his most revelatory work yet—and his most important.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Metropolitan Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Ten Commandments For Grandparents",
        "Authors": "By Krueger, Caryl Waller",
        "Description": "This book offers specific, practical ways to make the all-important relationship among grandparent, parent, and grandchild happy, memorable, and something to cherish.",
        "Category": " Religion , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Fodor's How to Pack, 2nd Edition (Travel Guide)",
        "Authors": "By Fodor's Travel Publications, Inc. (COR) and Cardone, Laurel",
        "Description": "Aiming to trade your jumbo suitcase for one that's merely medium-size?  Trying to fit everything into a carry-on?  Do you always pack too much, too little, or the wrong thing?and obsess about it? Fodor's How to Pack is a must-have to helps you get organized.Packed with info and advice on everything from foolproof pre-trip to-do lists; travel kits; how to arrive wrinkle-free; tips for packing tricky items; help for moms and dads; carry-on packing?all the secrets; how to pack for the way back; and what to take no matter where you're going. Plus how to avoid the overpacking trap; clothing checklists for men, women, and kids; packing checklists for every kind of trip; and how to buy luggage.",
        "Category": " Travel , Reference",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "As You Like It (The Pelican Shakespeare)",
        "Authors": "By Shakespeare, William and Sargent, Ralph M. (EDT)",
        "Description": "As You Like It, Shakespeare's most lighthearted comedy and one of the best-loved and most performed of all his plays, was probably written in 1599 or 1600, though it was not printed until the First Folio of 1623. As its witty heroine is Shakespeare's longest female role, the play's performance history is marked by notable Rosalinds, from Hannah Pritchard and Margaret Woffington (giving rival performances in 1741), to Helen Faucit, Ada Rehan, Peggy Ashcroft, Katharine Hepburn, Vanessa Redgrave, Ronald Pickup (in an all-male production of 1967), Juliet Stevenson, and many others.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1959"
        }
    },
    {
        "Title": "Angle of Vision: Christians and the Middle East",
        "Authors": "By Kimball, Charles",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Friendship Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The Second Middle Age: Looking Differently at Life Beyond 50",
        "Authors": "By Manheimer, Ronald J. (EDT)",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Visible Ink Pr",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Must Love Shoes: A Collection of Stories About Life in a Woman's Shoes",
        "Authors": "By Julie Gaver",
        "Description": "",
        "Category": "",
        "Publisher": "Ruby Slipper Publishers",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Bride of Anguished English: A Bonanza of Bloopers, Blunders, Botches, and Boo-Boos",
        "Authors": "By Lederer, Richard",
        "Description": "For years wordsmith and punster Richard Lederer has charmed and delighted fans with his bestselling \"Anguished English\" series.  In his funniest book yet, readers will again cherish the author's latest chronicle of the goofs and gaffes and fluffs and flubs of our anguished language.  And the best part?  Everything in here actually occurred!  Nothing has been made up!Bloopers from foreign restaurants include: * \"Our wines leave you nothing to hope for.\"* \"As for the tripe served here, you will be singing its praises to your grandchildren on your deathbed.\"Excerpts from students' twisted history papers include:* \"World War I made the people so sad that it brought on the Great Depression.\"* \"America was founded by four fathers.  Delegates from the original 13 states formed the Contented Congress.  Thomas Jefferson, a Virgin, and Benjamin Franklin were two singers of the Decoration of Independence, which says that all men are cremated equal and are well endowed by their creator.\"Hilarious illustrations by Jim McLean make The Bride of Anguished English the perfect book for anyone who loves English with all its blunders and bloopers and quips and quirks.",
        "Category": " Language Arts & Disciplines , Grammar & Punctuation",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Best Enemies (Heller, Jane)",
        "Authors": "By Heller, Jane",
        "Description": "New York Times bestselling author Jane Heller focuses her sly wit on female bonding in this hilarious story that proves there are two sides to every friendship. . . .Jane Heller is:\"Wildly inventive!\" ---People\"Fresh . . . Spirited!\" ---Publishers WeeklyAmy Sherman is doing just fine---she has a nice apartment in Manhattan, a good job as publicity director at a publishing company, and a decent social life---until she runs into Tara Messer, the beautiful blond prom queen who was once her best friend. It's been four years since Tara stole Amy's fiancé---four years since Amy swore she'd stop playing second fiddle to spotlight-hog Tara. Amy thought she had finally made peace with herself, but when Tara asks whether she's dating anyone, Amy can't bear to admit there's no man in her life. Instead, she claims she's getting married in six months, figuring she'll never see Tara again, so the lie won't come back to haunt her. Wrong. The next day, Amy learns that her publishing house has just acquired a lifestyle book called Simply Beautiful by none other than Tara---and that Amy's job will be to make it a bestseller. Now she'll not only have to promote her nemesis to the media, she'll also have to dig up a temporary Mr. Right. When she enlists a commitment-phobic mystery writer as the pawn in her game of payback, she stumbles on the surprising truth about Tara's \"lifestyle\"---and her own fears about falling in love. What follows is a laugh-out-loud story of betrayal, reconciliation, romance, and the unbreakable bonds of friendship. Told from both Amy's and Tara's points of view, Best Enemies is a thoroughly entertaining tale about trying to keep up appearances, even with the person who knows you best.",
        "Category": " Fiction , Psychological",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Frommer's New York State (Frommer's Complete Guides)",
        "Authors": "By Schlecht, Neil E., Silverman, Brian, and Beattie, Rich",
        "Description": "Meticulously researched by a team of expert residents who know this region intimately, Frommer's New York State, 3rd Edition is an extraordinary and highly personal guide to one of America’s most diverse regions.Frommer’s New York State is packed with candid opinions on everything about New York City, but also on the beaches, antiques shops, wineries, skiing, hiking, biking, and other outdoor adventures that make up the rest of New York State. We’ve covered all the perennial favorites, from the Hamptons to Niagara Falls, but we’ll also take you off the beaten track to discover New York's best small towns and natural escapes. Whether you want a romantic getaway in an upstate B&B or family fun on Long Island's best beaches, Frommer’s will help you design the trip that’s right for you.",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Frommer's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Avenging Angels (A Beaufort & Company Mystery)",
        "Authors": "By Stanton, Mary",
        "Description": "The series that's \"a breath of fresh air for fans of paranormal cozy mysteries\" (Publishers Weekly, starred review)   Law school hasn't prepared Bree to appeal cases for the dead. After inheriting her great-uncle's haunted law firm, she must now represent ex-banker O'Rourke, who supposedly killed himself after losing a fortune. But with a merry widow and evidence mounting, it's beginning to look like murder. So Bree and her team of angels begin to investigate. But Bree soon discovers that someone would rather see her deceased than debriefed.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Safari of African Cooking",
        "Authors": "By Odarty, Bill",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Broadside Lotus Pr",
        "Price Starting With ($)": "17.5",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "Mid-Atlantic Winter Sports Guide: The Complete Guide to DownhillSkiing, Snowboarding, Cross-country Skiing, Snow Tubing, and More Throughout the Mid-Atlantic Region",
        "Authors": "By Phillips, John",
        "Description": "",
        "Category": " Sports & Recreation , Winter Sports",
        "Publisher": "Beachway Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Heath Anthology of American Literature",
        "Authors": "By Lauter, Paul (EDT) and Yarborough, Richard (EDT)",
        "Description": "",
        "Category": " Literary Collections , American , General",
        "Publisher": "Houghton Mifflin College Div",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Port Mortuary (Kay Scarpetta)",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "As the chief of the Cambridge Forensic Center, Kay Scarpetta is confronted with a case that could shut down her new facility and ruin her personal and professional life. By the #1 best-selling author of The Scarpetta Factor. Reprint. A best-selling novel.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "Courtly Art of the Ancient Maya",
        "Authors": "By Mary Miller, Simon Martin, 1884011119",
        "Description": "",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "32.36",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "How to Pray: The Best of John Wesley on Prayer (VALUE BOOKS)",
        "Authors": "By Wesley, John",
        "Description": "",
        "Category": " Religion , Christian Life , Prayer",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Basic Elements of the Christian Life, Vol. 3",
        "Authors": "By Witness Lee & Watchman Nee",
        "Description": "",
        "Category": "",
        "Publisher": "Living Stream Ministry",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Glorious Church ((NEW COPY))",
        "Authors": "By Watchman Nee",
        "Description": "",
        "Category": "",
        "Publisher": "Living Stream Ministry",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Basic Elements of the Christian Life, Vol. 2",
        "Authors": "By Witness Lee & Watchman Nee",
        "Description": "",
        "Category": "",
        "Publisher": "Living Stream Ministry",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The ATLANTIC CROSSING (The Seafarers)",
        "Authors": "By Melvin Maddocks",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life Books",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Would You?: Questions to Challenge Your Beliefs",
        "Authors": "By McFarlane, Evelyn and Saywell, James",
        "Description": "The authors of the bestselling If . . . series have innovated a fresh new spin on their trademark questions. Would You? offers more than one hundred pairs of thought-provoking questions designed to explore and test our priorities and values.         ¸   Would you cheat on an exam? Would you write your child's college entrance essay?         ¸   Would you be able to forgive your child anything at all? Would you be able to forgive your mate anything at all?  ¸   Would you live within twenty miles of a nuclear reactor? Would you work in a nuclear power plant on a daily basis?        These 250 delicately calibrated questions confront head-on what we stand for and what we value--and what stakes we'd sacrifice for those beliefs. With the same insight and wit that have made the If . . . series and How Far Will You Go? wildly and enduringly popular, Would You? is an endlessly fascinating exercise, a penetrating look into our moral and ethical selves.",
        "Category": " Self-help , Creativity",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Shadow Zone (Hannah Bryson)",
        "Authors": "By Johansen, Iris and Johansen, Roy",
        "Description": "Deep below the Atlantic Ocean, guarded by hundreds of dolphins, lie the astonishing remains of an Atlantis-like lost city called Marinth. Its disappearance has confounded scientists for years--until now. Marine architect Hannah Bryson has unearthed a legendary artifact that might hold the key to unlocking the city's long-buried secrets. But Hannah's discovery could have dire consequences for the modern-day world--and there are some people who will do anything to keep the truth about Marinth hidden…When the artifact is hijacked, Hannah stands alone between a power-hungry enemy and widespread destruction. Willing to form whatever alliance is necessary to regain control of this potentially world-changing weapon, Hannah joins forces with Nicholas Kirov, a loose cannon from her past who is now her best hope for survival. Together they will race to unravel Marinth's last great secret…and before the lethal game is over, Hannah will realize that nothing and no one is what she expected--not even the dolphins, who know so much more than anyone could imagine…",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Pony Crazy (Pony Tails)",
        "Authors": "By Bryant, Bonnie and Ramsey, Marcy Dunn (ILT)",
        "Description": "Best friends May Grover and Jasmine James, each of whom has her own pony, are puzzled by the strange sounds coming from the house and stable of their new neighbor. Original.",
        "Category": "",
        "Publisher": "Skylark",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Marie Antoinette: The Last Queen of France",
        "Authors": "By Temerson, Catherine (TRN) and Lever, Evelyne",
        "Description": "In MARIE ANTOINETTE, Evelyn Lever draws on a variety of resources, including diaries, letters, and firsthand accounts, to write this sumptuous, addictive delight. From family life in Vienna to the choke of the guillotine, this gripping work combines a fast-paced historical narrative with all the elements of scandalous fiction: Marie's wedding at Versailles to Louis XVI, the French court, boredom, hypocrisy, loneliness, allies, enemies, scandal, intrigue, sex, peasant riots, the fall of the Bastille, mob rule in Paris, imprisonment, and, finally, execution.From primary source documents Lever fashions an insightful glimpse into the French court at Versailles. The characters of court are expertly drawn. There is the dashing Axel Fersen, Marie's great love; Maria Theresa, the scheming mother trying to place her daughter on the Hapsburg throne; the legendary Madame du Barry, lover to Louis XV; and, of course, Marie herself. Luxuriously evocative of the Versailles court, historically sharp and witty, and detailing the compelling story of Marie Antoinette's life, Evelyn Lever's biography entrances readers.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The richest lady in town",
        "Authors": "By Heatherley, Joyce Landorf",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "8.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Winter Estates Thomas Edison Henry Ford",
        "Authors": "By Robert P. Halgrim",
        "Description": "",
        "Category": "",
        "Publisher": "Terrell Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Puppies For Sale",
        "Authors": "By Clark, Dan",
        "Description": "",
        "Category": "",
        "Publisher": "dalmatian press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Children's prayers for today",
        "Authors": "By McKim, Audrey",
        "Description": "Prayers on such themes as death, pain, Christmas, family relationships, and friendship.",
        "Category": "",
        "Publisher": "Association Press",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "How to Take Good Pictures: A Photo Guide by Kodak",
        "Authors": "By Kodak",
        "Description": "Introduces techniques for taking better pictures, provides guidelines for operating a camera, and includes tips on photographing people, animals, and landscapes",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Greece - A Travellers' Guide to the Sites, Monuments   Histo",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Ekdotike Athenon S.A.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Relativity; The special and the general theory, a popular exposition : Auth. trans. by R.W. Lawson",
        "Authors": "By Einstein, Albert",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Blood Law (Blood Moon Rising, Book 1)",
        "Authors": "By Tabke, Karin",
        "Description": "A captivating paranormal from a rising voice in erotic romance.  As undisputed Alpha, Rafael must choose a life mate to preserve the dominance of his Lycan pack. He never suspected his mate would be a human, the same wounded girl-woman he seduced from the brink of death.  Falon is a dangerous combination of Lycan and Slayer-bred to destroy his kind. She's also a mesmerizing beauty whose sensuality tempts the warrior to take risks. Surrendering to their primal heat could destroy them both...for a vengeful foe awaits to take what is rightfully his by Blood Law.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "The Every Day Chicken Cookbook",
        "Authors": "By Hill, Simona (EDT)",
        "Description": "Celebrating the best of the world&#39;s poultry recipes, here are tried-and-tested ideas for every kind of dish and occasion, shown step by step in 1600 photographs.",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "Southwater",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2014"
        }
    },
    {
        "Title": "Totally Bizarre (Ripley's Believe it or Not!)",
        "Authors": "By Bell-Rehwoldt, Sheri",
        "Description": "",
        "Category": "",
        "Publisher": "Ripley Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "In Ruins",
        "Authors": "By Woodward, Christopher",
        "Description": "We live in a world of relentless progress, and yet we cannot pull ourselves away from the enchantment of what once was: the hold that an abandoned building can exert on us, the spell cast by the remains of past settlement. In Ruins is a meditation on ruins and, most particularly, a history of our fascination with them.When we contemplate ruins, Woodward suggests, we contemplate the prospect of the future. Ruins are also the jigsaw pieces of what once was, the clues to a past whose allure is heightened by the fact that it has vanished. And, finally, Woodward shows us how ruins serve as the source of inspiration for the artist who sees beauty in decay and desolation; he quotes by way of example what he calls the finest sonnet Shelley ever wrote: \"Round the decay/Of that colossal wreck, boundless and bare/The lone and level sands stretch far away.\"",
        "Category": " Social Science , Archaeology",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Notorious (Hqn)",
        "Authors": "By Cornick, Nicola",
        "Description": "When the town&#39;s most notorious heartbreaker&#133;Dangerously seductive and sinfully beautiful, Susanna Burney is society&#39;s most sought after matchbreaker Paid by wealthy parents to part unsuitable couples, she&#39;s never yet failed to accomplish her mission of diverting a groom&#150;to&#150;be. Until her final assignment brings her face&#150;to&#150;face with the man who&#39;d once taught her an intimate lesson in heartache&#133;Meets London&#39;s most disreputable rake&#133;James Devlin has everything he&#39;s always wanted: a title, a rich fiancee and a place in society. But the woman who&#39;s just met his eyes across a crowded ballroom threatens it all. Not because she&#39;d once claimed his heart, or that every sinuous swirl of her ball gown takes his breath away. But because the secrets she carries could cost him everything.To put the past to rest once and for all, Dev just might have to play Susanna at her own wicked game&#133;Let the seduction begin!",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    }
]