[
    {
        "Title": "Deadly Little Secret (A Touch Novel) (A Touch Novel, 1)",
        "Authors": "By Stolarz, Laurie Faria",
        "Description": "Some secrets shouldn't be kept... Until three months ago, everything in sixteen-year-old Camelia's life had been fairly ordinary: decent grades, an okay relationship with her parents, and a pretty cool part-time job at the art studio downtown.  But when a mysterious boy named Ben starts junior year at her high school, Camelia's life becomes anything but ordinary.Rumored to be somehow responsible for his ex-girlfriend's accidental death, Ben is immediately ostracized by everyone on campus. Except for Camelia. She's reluctant to believe he's trouble, even when her friends try to convince her otherwise.  Instead, she's inexplicably drawn to Ben and to his touch.  But soon, Camelia is receiving eerie phone calls and strange packages with threatening notes. Ben insists she is in danger, and that he can help-but can he be trusted? She knows he's hiding something... but he's not the only one with a secret.From the best-selling author of Blue is for Nightmares comes a new series that's sure to be a thrilling and chilling teen favorite.",
        "Category": " Young Adult Fiction , Romance , General",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Eating Well After Weight Loss Surgery: Over 140 Delicious Low-Fat High-Protein Recipes to Enjoy in the Weeks, Months and Years After Surgery",
        "Authors": "By Levine, Patt, Bontempo-Saray, Michele, Inabnet, William B., M.D. (FRW), and Urban-Skuro, Meredith (CON)",
        "Description": "The best-selling bariatric cookbook, with more than 125 low-carb, low-fat, high-protein recipes for patients to enjoy after weight-loss surgery.In April 2003 Patt Levine underwent \"Lap-Band\" gastric surgery, one of the primary bariatric surgeries being widely practiced today. As a lifelong foodie, she was expecting the worst when her surgeon's nutritionist handed her dietary guidelines to follow post-surgery, and she was right. With her decades of cooking skills, she immediately set out to devise low-fat dishes that would be just as delicious pureed and chopped as they would be served whole. As an added problem, she wanted to cook for her husband at the same time. This first-ever cookbook for the hundreds of thousands who are lining up for bariatric bypass surgery is proof that it can be done. With collaborator Michele Bontempo-Saray, the author has created 125 recipes that contain no added sugar, are very low in fat, and get their carbohydrates almost exclusively from fruits and vegetables. Each recipe includes specific guidelines for preparation of the dish for every stage of the eating programs for Lap-Band, gastric bypass, and Biliopancreatric Diversion Duodenal Switch (BPD-DS) patients, as well as suggestions for sharing meals with those who have not gone through gastric surgery. Creative recipes cover every meal and food-breakfast and brunch, soups, vegetables, main courses, and sweet indulgences.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Government in America: People, Politics, and Policy",
        "Authors": "By Edwards, George C., Wattenberg, Martin P., and Lineberry, Robert L.",
        "Description": "",
        "Category": " Young Adult Nonfiction , Social Science , Politics & Government",
        "Publisher": "Pearson",
        "Price Starting With ($)": "7.33",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Teacher Evaluation to Enhance Professional Practice",
        "Authors": "By Danielson, Charlotte and McGreal, Thomas L.",
        "Description": "Offers a guide to an effective teacher evaluation system that combines quality assurance with professional development.",
        "Category": " Education , Professional Development",
        "Publisher": "Association for Supervision & Curriculum Developme",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Authentic Beauty: The Shaping of a Set-Apart Young Woman",
        "Authors": "By Ludy, Leslie",
        "Description": "Inside Every Young Woman is a Princess…In Search of her PrinceIn a culture that mocks our longing for tender romance, in a world where fairy tales never seem to come true — do we dare hope for more?  For every young woman asking that question, this book is an invitation.  With refreshing candor and vulnerability, bestselling author Leslie Ludy reveals how, starting today, you can experience the passion and intimacy you long for.  You can begin a never-ending love story with your true Prince.  Discover the authentic beauty of a life fully set-apart for Him.  Experience a romance that will transform every part of your existence and fulfill the deepest longings of your feminine heart.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.98",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "No Talking",
        "Authors": "By Clements, Andrew and Elliott, Mark (ILT)",
        "Description": "It’s boys vs. girls when the noisiest, most talkative, and most competitive fifth graders in history challenge one another to see who can go longer without talking. Teachers and school administrators are in an uproar, until an innovative teacher sees how the kids’ experiment can provide a terrific and unique lesson in communication. In No Talking, Andrew Clements portrays a battle of wills between some spunky kids and a creative teacher with the perfect pitch for elementary school life that made Frindle an instant classic.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Dark Visions: The Strange Power; The Possessed; The Passion",
        "Authors": "By Smith, L. J.",
        "Description": "GIFTED AND CURSED    Kaitlyn Fairchild has always felt like an outsider in her small hometown. Her haunting eyes and prophetic drawings have earned her a reputation as a witch. But Kait's not a witch: She's a psychic. Tired of being shunned, Kait accepts an invitation to attend the Zetes Institute, where she can have a fresh start and study with other psychic teens.   Learning to hone her abilities with four other gifted students, Kait discovers the intensity of her power -- and the joy of having true friends. But those friendships quickly become complicated when Kait finds herself torn between two irresistible guys. Rob is kind and athletic, and heals people with his good energy. Gabriel is aggressive and mysterious, a telepath concealing his true nature as a psychic vampire, feeding off of others' life energy. Together, Rob and Gabriel's opposing forces threaten the group's stability.   Then one of the experiments traps the five teens in a psychic link. A link that threatens their sanity and their lives. And Kaitlyn must decide whom to trust...and whom to love.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Glass Houses",
        "Authors": "By Caine, Rachel",
        "Description": "College freshman Claire Danvers has had enough of her nightmarish dorm situation, where the popular girls never let her forget just where she ranks in the school's social scene: somewhere less than zero.When Claire heads off-campus, the imposing old house where she finds a room may not be much better. Her new roommates don't show many signs of life. But they'll have Claire's back when the town's deepest secrets come crawling out, hungry for fresh blood.Watch a Windows Media trailer for this book.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "NAL Jam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Wishin' and Hopin': A Christmas Story",
        "Authors": "By Lamb, Wally",
        "Description": "Wally Lamb, the beloved #1 New York Times bestselling author of The Hour I First Believed, I Know This Much Is True, and She’s Come Undone, delivers a holiday treat with Wishin’ and Hopin’—an unforgettable novella that captures the warmth and joy of the holiday season. Poignant and hilarious, in a vein similar to Jean Shepherd’s A Christmas Story and David Sedaris’s The Santaland Diaries, Lamb’s Christmas tale focuses on a feisty parochial school fifth grader named Felix Funicello—a distant cousin of the iconic Annette!",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Norton Anthology of American Literature, Vol. B: 1820 to 1865",
        "Authors": "By Baym, Nina (EDT), Krupat, Arnold, and Levine, Robert S.",
        "Description": "Firmly grounded in the core strengths that have made it the best-selling undergraduate survey in the field, The Norton Anthology of American Literature has been revitalized in this Seventh Edition through the collaboration between three new period editors and five seasoned ones.",
        "Category": " Literary Collections , American , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Enemies of the People: My Family's Journey to America",
        "Authors": "By Marton, Kati",
        "Description": "\"You are opening a Pandora's box,\" Marton was warned when she filed for her family's secret police fi les in Budapest. But her family history -- during both the Nazi and the Communist periods -- was too full of shadows. The files revealed terrifying truths: secret love aff airs, betrayals inside the family circle, torture and brutalities alongside acts of stunning courage -- and, above all, deep family love.   In this true-life thriller, Kati Marton, an accomplished journalist, exposes the cruel mechanics of the Communist Terror State, using the secret police files on her journalist parents as well as dozens of interviews that reveal how her family was spied on and betrayed by friends and colleagues, and even their children's babysitter. In this moving and brave memoir, Marton searches for and finds her parents, and love.   Marton relates her eyewitness account of her mother's and father's arrests in Cold War Budapest and the terrible separation that followed. She describes the pain her parents endured in prison -- isolated from each other and their children. She reveals the secret war between Washington and Moscow, in which Marton and her family were pawns in a much larger game.   By the acclaimed author of The Great Escape, Enemies of the People is a tour de force, an important work of history as it was lived, a narrative of multiple betrayals on both sides of the Cold War that ends with triumph and a new beginning in America.",
        "Category": " Biography & Autobiography , Editors, Journalists, Publishers",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Southern Living: Homestyle Cookbook: Over 400 Mouthwatering, Made-with-Love Recipes",
        "Authors": "By Southern Living Magazine (COR)",
        "Description": "Integrating comfort foods with traditional, old-fashioned recipes, a delectable new cookbook celebrates the best in Southern regional cuisine with more than four hundred kitchen-tested recipes, including specialties from the Chesapeake Bay, Low Country, Cajun and Creole, and Heart of Dixie regions. 100,000 first printing.",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Wimpy Kid Movie Diary (Diary of a Wimpy Kid)",
        "Authors": "By Kinney, Jeff",
        "Description": "A NEWER, REVISED AND EXPANDED EDITION OF THIS BOOK IS NOW AVAILABLE,  The Wimpy Kid Movie Diary (DOG DAYS EDITION), ISBN 978-1419706424. INCLUDES 32 NEW PAGES ABOUT THE THIRD WIMPY KID MOVIE, DOG DAYS, PLUS AN ALL-NEW COVER ILLUSTRATION.",
        "Category": " Juvenile Nonfiction , Performing Arts , Film",
        "Publisher": "Amulet Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Fearless Small Group Discussion Guide",
        "Authors": "By Lucado, Max",
        "Description": "Can you imagine your life without fear?In his book Fearless, Max Lucado offers hope and calm in a time of unprecedented fear in our nation and the world. Now Max's timeless messages are also available in discussion guide and DVD (each sold separately) that can be used for individual reflection or small-group discussion.Fearless draws from Jesus’ encounters with people in frightening situations giving evidence that we can trust God through these scary times. In six sessions, Max takes a close look at our greatest fears and offers scripturally based reassurance and guidance through even the toughest moments of our lives. This discussion guide can be used for personal journaling or as a prompt for open-hearted discussions with your small group. Let Max Lucado show you how to find a sense of peace and security in today's troubled world.Sessions include:Why Are We Afraid?Fear of Not MatteringFear of Disappointing GodFear of Life's Final MomentsFear of Global CalamityFear of God Getting Out of My BoxDesigned for use with the Fearless DVD 9780718008758 (sold separately).",
        "Category": " Religion , Biblical Studies , Bible Study Guides",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Irresistible Henry House: A Novel",
        "Authors": "By Grunwald, Lisa",
        "Description": "It is the middle of the twentieth century, and in a home economics program at a prominent university, real babies are being used to teach mothering skills to young women. For a young man raised in these unlikely circumstances, finding real love and learning to trust will prove to be the work of a lifetime. In this captivating novel, bestselling author Lisa Grunwald gives us the sweeping tale of an irresistible hero and the many women who love him.From his earliest days as a “practice baby” through his adult adventures in 1960s New York City, Disney’s Burbank studios, and the delirious world of the Beatles’ London, Henry remains handsome, charming, universally adored—and never entirely accessible to the many women he conquers but can never entirely trust.Filled with unforgettable characters, settings, and action, The Irresistible Henry House portrays the cultural tumult of the mid-twentieth century even as it explores the inner tumult of a young man trying to transcend a damaged childhood. For it is not until Henry House comes face-to-face with the real truths of his past that he finds a chance for real love.",
        "Category": " Fiction , Psychological",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "More than Enough: The Ten Keys to Changing Your Financial Destiny",
        "Authors": "By Ramsey, Dave",
        "Description": "In his first bestseller, Financial Peace, Dave Ramsey taught us how to eliminate debt from our lives. Now in More Than Enough, he gives us the keys to building wealth while also creating a successful, united family. Drawing from his years of work with thousands of families and corporate employees, Ramsey presents the ten keys that guarantee family and financial peace, including: values, goals, patience, discipline, and giving back to one's community. Using these essential steps anyone can create prosperity, live debt-free, and achieve marital bliss around the issue of finances. Filled with stories of couples, single men and women, children, and single parents, More Than Enough will show you:   •  How to create a budget that fits your income and creates wealth   •  What finances and romance have to do with one another   •  What role values play in your financial life   •  How to retire wealthy in every way   •  And much, much moreResonating with Ramsey's down-home, folksy voice, heartwarming case histories, inspiring insights, quotations from the Bible, and exercises, quizzes, and worksheets, More Than Enough provides an inspiring wealth-building guide and a life-changing blueprint for a vital family dynamic.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "You, Inc.: The Art of Selling Yourself",
        "Authors": "By Beckwith, Harry and Beckwith, Christine Clifford",
        "Description": "In YOU, INC. Beckwith provides practical tips, anecdotes and insights based on his 30 years of marketing and selling his advertising services. Beckwith learned early on in his career that no matter what product you're selling, the most important component of the product is you.In YOU, INC.: A Field Guide to Selling Yourself, Beckwith relates tantalizing tidbits and real stories of how to harness your enthusiasm with an ability to impress your key accounts.Written in his traditional homespun style, Beckwith offers doses of humour and pithy knowledge to anyone who wants to seal the deal and thrive in business",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Black Ops (Presidential Agent Novels)",
        "Authors": "By Griffin, W. E. B.",
        "Description": "W.E.B. Griffin always hits the target-right at the top of the bestseller lists...   W.E.B. Griffin's explosive Presidential Agent novels have gained worldwide acclaim for \"leaving satisfied thriller readers hankering for more.\"  Now, in Griffin's latest #1 New York Times bestseller, the Russian bear is stirring after many years of hibernation-and it is hungry.",
        "Category": " Fiction , War & Military",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Murderer's Daughters",
        "Authors": "By Meyers, Randy Susan",
        "Description": "Lulu and Merry's childhood was never ideal, but on the day before Lulu's tenth birthday their father propels them into a nightmare. He's always hungered for the love of the girls’ self-obsessed mother; after she throws him out, their troubles turn deadly. Lulu had been warned not let her father in, but when he shows up drunk, he's impossible to ignore. He bullies his way past Lulu, who then listens in horror as her parents struggle. She runs for help, but discovers upon her return that he's murdered her mother, stabbed her five-year-old sister, Merry, and tried, unsuccessfully, to kill himself.Lulu and Merry are effectively orphaned by their mother’s death and father’s imprisonment. The girls’ relatives refuse to care for them and abandon them to a terrifying group home. Even as they plot to be taken in by a well-to-do family, they come to learn they’ll never really belong anywhere or to anyone—that all they have to hold onto is each other. For thirty years, the sisters try to make sense of what happened. Their imprisoned father is a specter in both their lives, shadowing every choice they make. One spends her life pretending he's dead, while the other feels compelled--by fear, by duty--to keep him close. Both dread the day his attempts to win parole may meet with success.A beautifully written, compulsively readable debut, The Murderer's Daughters is a testament to the power of family and the ties that bind us together and tear us apart.",
        "Category": " Fiction , Family Life",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Castaways: A Novel",
        "Authors": "By Hilderbrand, Elin",
        "Description": "An intense tale of love and loyalty set against the backdrop of endless summer island life from bestselling and beloved author Elin Hilderbrand.  Greg and Tess MacAvoy are one of four prominent Nantucket couples who count each other as best friends. As pillars of their close-knit community, the MacAvoys, Kapenashes, Drakes, and Wheelers are important to their friends and neighbors, and especially to each other. But just before the beginning of another idyllic summer, Greg and Tess are killed when their boat capsizes during an anniversary sail. As the warm weather approaches and the island mourns their loss, nothing can prepare the MacAvoy's closest friends for what will be revealed.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "The Message New Testament (Mass Paper, Green): The New Testament in Contemporary Language (Experiencing God)",
        "Authors": "By Peterson, Eugene H.",
        "Description": "Born a King. Bearing a Kingdom.When Jesus is born in a small town outside a minor provincial capital, few suspect the destiny awaiting him. But tremors felt among shepherds, kings, and angels foreshadow a seismic shift that will one day ripple across the globe.Thirty years later, he emerges a dynamic preacher claiming to be the Son of God. In town after town, many attack his audacious claim and conspire to kill him. And when he falls under the harsh glare of one of history’s greatest empires, death will stand between him and his destiny.In the aftermath, a small group bands together—loyalists following his example and spreading his teaching. As they do, his flesh-and-blood life begins to transform them into a Kingdom that will have no end.“The story of Jesus and the movement he started is one that we all think we know. The Message brings us back to this story in all its wonderful strangeness.”—Ian Cron, coauthor of The Road Back to You\"Peterson shines in his breathtaking translation of the cadence and eloquence of Biblical poetry in particular, bringing it alive with vitality, wisdom, and hope.\"—Tosca Lee, New York Times bestselling author“A fabulous resource for teaching busy young people in contemporary terms and bringing scripture into a modern age.”—Lisa Wingate, New York Times bestselling author of Before We Were Yours“It returns us to the humble language of ordinary people. It invites us to stumble not over language but over Jesus, that he might become the capstone of our lives.”—Amy Julia Becker, author of A Good and Perfect Gift and White Picket Fences“Both poetic and prophetic, penetrating the spirit in a powerful way.”—Mark Batterson, New York Times bestselling author of The Circle Maker",
        "Category": " Literary Collections , Ancient & Classical",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2017"
        }
    },
    {
        "Title": "Black & Decker The Complete Guide to Wiring: Upgrade Your Main Service Panel - Discover the Latest Wiring Products - Complies with 2008 NEC (Black & Decker Complete Guide)",
        "Authors": "By Editors of creative Publishing",
        "Description": "North America’s best-selling wiring book—now even better In previous editions, The Complete Guide to Home Wiring sold more than one million copies, making it the all-time bestselling book on home wiring for consumers. In this newly revised and redesigned edition, the book includes everything that made the original the favorite of American homeowners, but also adds new projects, such as wiring a shed or gazebo, and includes important revisions to meet the 2008 National Electrical Code.   The modern home can include dozens of electronic components unknown just a few years ago, and this book provides essential information on wiring for those devices. It includes information on security systems, home theaters and surround-sound systems, computer networks, and a host of kitchen amenities like espresso machines to grind-and-brew coffee machines. Tech savvy homeowners will appreciate the section devoted to Bluetooth and wi-fi technologies—the next wave of “wireless wiring”  Once again, this book features more than 700 color photographs showing installation and repair projects with unsurpassed realism and clarity.",
        "Category": " House & Home , Do-It-Yourself , Electrical",
        "Publisher": "Cool Springs Press",
        "Price Starting With ($)": "7.67",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Toddler 411: Clear Answers & Smart Advice for Your Toddler, 2nd Edition",
        "Authors": "By Fields, Denise and Brown, Ari, M.D.",
        "Description": "Combines proven medical advice from an award-winning pediatrician with the tried-and-true recommendations of parents, in a sequel to Baby 411 that covers such topics as toy safety, autism, and how to avoid unnecessary trips to the doctor. Original.",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Windsor Peak Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "How to Play Guitar: Everything You Need to Know to Play the Guitar",
        "Authors": "By Evans, Roger",
        "Description": "In How to Play Guitar guitar players of all levels will find a wealth of instruction and inspiration. Whether you want to play pop, folk, country, rock, blues, jazz, classical, or any other style of music, you will pick up the basic techniques without tedious drills and exercises. Using real music and a step-by-step approach, How to Play Guitar will teach you about:- Choosing and buying a guitar- Tuning your instrument correctlyReading sheet music, guitar music, and tablature- Playing melodies with chordsFingerpicking- Mastering left-hand techniques, including sliding and bending notes- Transposing melodies from one key to another and much more.",
        "Category": " Music , Instruction & Study , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Photoshop Elements 8 For Dummies",
        "Authors": "By Padova, Ted and Obermeier, Barbara",
        "Description": "The perennial bestseller is updated and revised throughout for the latest release of Photoshop Elements 8Richly illustrated in full color, this friendly, easy-to-understand guide provides all the essentials on the latest version of the affordable and popular image-editing program, Photoshop Elements. Get the scoop on using the latest digital imaging tools and techniques to correct color, brightness, and contrast; create postcards, slideshows, and movie files; apply artistic effects to your photos; fix flaws and even remove unwanted elements from your images; and so much more.Use the Organizer on a Windows PC or Adobe Bridge on a Mac to sort, find, tag, and catalog your photosStraighten crooked lines, crop for effect, or fix color, sharpness, red-eye, and contrastMove people or objects in and out of your pictures, change the background, combine multiple images, or replace one color with anotherAdd effects with filters, get creative with type, or play with the drawing and painting toolsTag your photos using People Recognition or by geographical locationTurn your photos into postcards, calendars, greeting cards, and photo books with a few simple clicksImport images into Elements from a variety of sourcesUpload and save images to Photoshop.comPhotoshop Elements 8 For Dummies  shows you how to make the most of Elements awesome image editing, organization, and photo sharing tools. Whether you’re concerned about color correction and clarity or just want a cool calendar of your kids for the wall, you’ll learn how to do it with this book!",
        "Category": " Computers , Image Processing",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Healthy College Cookbook",
        "Authors": "By Nimetz, Alexandra, Stanley, Jason, Starr, Emeline, and Holcomb, Rachel",
        "Description": "If the pizza-delivery guy is in your apartment more often than your roommate, The Healthy College Cookbook is exactly what you need. Whether you’re a meat lover, vegetarian, or vegan, you’ll find simple and adaptable recipes for quick breakfasts, portable snacks, fresh lunches, and satisfying dinners. Busy students will love these tasty, nutritious recipes.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Geometry: Practice Workbook With Examples",
        "Authors": "By Holt Mcdougal (COR), Boswell, Laurie, and Stiff, Lee",
        "Description": "",
        "Category": " Young Adult Nonfiction , Mathematics , Geometry",
        "Publisher": "MCDOUGAL LITTEL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "In My Father's House: A Novel",
        "Authors": "By Harris, E. Lynn",
        "Description": "For his final new series, New York Times mega-bestselling author E. Lynn Harris introduces Bentley L. Dean, owner of the hottest modeling agency in Miami’s sexy South Beach.Only the world’s most beautiful models make the roster of Picture Perfect Modeling agency and they only do shoots for the most elite photographers and magazines. They are fashionista royalty—and the owners, Bentley L. Dean and his beautiful partner Alexandra, know it. But even Picture Perfect isn’t immune from hard times, so when Sterling Sneed, a rich, celebrity party planner promises to pay a ludicrously high fee for some models, Bentley finds he can’t refuse. Even though the job is not exactly a photo shoot, Bentley agrees to supply fifteen gorgeous models as eye candy for an “A” list party—to look good, be charming and, well, entertain the guests. They don’t have to do anything they don’t want to, but... His models are pros and he figures they can handle the pressure, until one drops out and Bentley asks his protégé Jah, a beautiful kid who Bentley treats as if he were his own son, to substitute. Suddenly, the stakes are much higher, particularly when Jah falls in love with the hottest African American movie star in America. Seth Sinclair is very handsome, very famous, and very married—and his closeted gay life makes him very dangerous as well. Can Bentley’s fatherly guidance save Jah from making a fatal mistake?",
        "Category": " Fiction , African American , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Cook with Jamie: My Guide to Making You a Better Cook",
        "Authors": "By Oliver, Jamie, Loftus, David (PHT), and Terry, Chris (PHT)",
        "Description": "My guide to making you a better cook. I can't tell you how long I've dreamed about writing this book. It's the biggest book I've ever done, and I've really tried to make it a timeless, modern-day classic. Whether you're a student, a young couple, an established cook, or a novice, I'll take you through a whole load of simple and accessible recipes that will blow the socks off your family and any guests you might have round for dinner. There's information on the equipment that I think you should have in your kitchen, advice on how to recognize and cook loads of different cuts of meat, as well as on how to get the best value and quality when you're out shopping. With all of us consuming more processed food than ever, it's a sad fact that most people just aren't confident enough to cook anymore. With this in mind, now is the time for you to get stuck in and reclaim your fantastic cooking heritage! You know what . . . if you're going to eat three times a day for the rest of your life, you might as well learn to cook properly and enjoy it! So roll up your sleeves and let me help you. P.S.: By the way, you should feel good about buying this book because every single penny I make from it will go toward training and inspiring young kids from tough backgrounds all over the world to have a career in food through the Fifteen Foundation. So on behalf of them, thank you.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "7.8",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "12 Steps to Raw Foods: How to End Your Dependency on Cooked Food",
        "Authors": "By Boutenko, Victoria",
        "Description": "Why do we overeat time and time again? Why do we make poor diet choices while we want to be healthy? What makes losing weight so difficult? These and many other vital questions are addressed in 12 Steps to Raw Foods in an open and sincere dialogue. Based on the latest scientific research, Victoria Boutenko explains the numerous benefits of choosing a diet of fresh rather than cooked foods. This book contains self-tests and questionnaires that help the reader to determine if they have hidden eating patterns that undermine their health. Using examples from life, the author explores the most common reasons for people to make unhealthy eating choices.Rather than simply praising the benefits of raw foods, this book offers helpful tips and coping techniques to form and maintain new, healthy patterns. Learn how to make a raw food restaurant card that makes dining with co-workers easy and enjoyable. Discover three magic sentences that enable you to refuse your mother-in-law’s apple pie without offending her. Find out how to sustain your chosen diet while traveling. These are only a few of the many scenarios that Boutenko outlines.Written in a convenient 12-step format, this book guides the reader through the most significant physical, psychological, and spiritual phases of the transition from cooked to raw foods. Embracing the raw food lifestyle is more than simply turning off the stove. Such a radical change in the way we eat affects all aspects of life. Boutenko touches on the human relationship with nature, the value of supporting others, and the importance of living in harmony with people who don’t share the same point of view on eating. Already a classic, this enhanced second edition is aimed at anyone interested in improving their health through diet.",
        "Category": " Cooking , Specific Ingredients , Natural Foods",
        "Publisher": "North Atlantic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Eleven",
        "Authors": "By Giff, Patricia Reilly",
        "Description": "Sam must solve the mystery of who he really is.Sam is almost 11 when he discovers a locked box in the attic above his grandfather Mack’s room, and a piece of paper that says he was kidnapped. There are lots of other words, but Sam has always had trouble reading. He’s desperate to find out who he is, and if his beloved Mack is really his grandfather. At night he’s haunted by dreams of a big castle and a terrifying escape on a boat. Who can he trust to help him read the documents that could unravel the mystery? Then he and the new girl, Caroline, are paired up to work on a school project, building a castle in Mack’s woodworking shop. Caroline loves to read, and she can help. But she’s moving soon, and the two must hurry to discover the truth about Sam.★ “This psychological mystery explores a child’s deepest genetic need for belonging. An engrossing examination of a profound theme in the deft hands of a discerning author.”—Kirkus Reviews, Starred★ “Exquisitely rendered story of self-discovery. . . . Given the author’s expertise at developing sympathetic characters and creating a suspenseful plot, readers will find the complexity of Sam’ vulnerabilities to be asintriguing as the unfolding enigma of his past.”—Publishers Weekly, Starred",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Cooking Light Annual Recipes 2008: EVERY RECIPE...A Year's Worth of Cooking Light Magazine",
        "Authors": "By Cooking Light Magazine (EDT)",
        "Description": "Cooking Light Annual Recipes 2008 is jam-packed with more than 1,000 mouthwatering, indulgent recipes. It’s also so much more than just a recipe collection! This 496-page book is a comprehensive must-have resource for all the latest cooking techniques, quick tips, fresh ingredients, and innovative kitchen equipment. Within this 12th volume of Cooking Light Annual Recipes you'll find: Over 1,000 great-tasting, kitchen-tested recipes! Every recipe from Cooking Light magazine 2007 can be found in these pages. We’ve included everything from brilliant Butterscotch Blondies to fresh-from-the-grill recipe sensations that sizzle. Don’t worry; you don’t need to be a chef to cook like one. The glory of these recipes is that you can make them with confidence! Our Test Kitchens staff rigorously tests all the recipes, often two or three times, to ensure that they’re not only healthy and reliable, but also rich, filling, and supremely scrumptious. Over 100 menus to help you plan for every occasion! From weeknight suppers to supper club entertaining, Cooking Light helps you round out your favorite recipes with excellent menu pairing suggestions. Get ready to try: Comforting Classics Menu, Dinner with Friends Menu, and Saturday Night Family Feast Menu. More than 70 bold and bright color photos! Just take another glance at the cover! If the Peach-Blueberry Cobbler doesn’t scream gorgeous, then we don’t know what does. And that’s just the beginning! Over 50 staff favorite recipes! Peek inside to see the best-of-the-best recipes from a year’s worth of Cooking Light. Some of our staff favorites include Lemon-Scented Blueberry Cupcakes, Fettuccine Alfredo, Classic Mint Juleps, Yukon Gold Potatoes Sautéed in Clarified Butter, and Fiery Flank Steak with Tomato Jam. Look for other top-rated winners in Our Favorite Recipes. Hundreds of hints, tips, and secrets! And that’s not all! Cooking Light Annual Recipes 2008 features a host of other helpful tips and guides. • Get fix and freeze dinner favorites. • Discover easy and economical ways to work beneficial omega-3 fatty acids into your diet. • Learn how to add pizzazz to your go-to weeknight meals. • Showcase the season’s best produce with recipes for starters, entrées, sides, and desserts from our Summer Cookbook. • Find out how cooking in parchment or foil packs creates light, simple, springtime specialties. • Cooking for a picky eater? We’ve got the kitchen strategies to assist you. PLUS The Holiday Cookbook! Celebrate the season with The Holiday Cookbook, our annual section in dedicated to offering you ideas on what to serve, when to serve it, and how best to serve it. We provide a generous helping of make-ahead tips and menu suggestions to take the hustle and bustle out of the holidays. Our festive dinners and creative ideas ensure that the time you spend in the kitchen is, indeed, time well-spent. From its spectrum of over 1,000 recipes to its endless number of captivating ideas for both the fresh and familiar, Cooking Light Annual Recipes has never been better.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Barron's Sat Math (Barron's: The Leader in Test Preparation)",
        "Authors": "By Leff, Lawrence S.",
        "Description": "Updated to reflect questions and question types on recent tests, this workbook presents hundreds of math questions in both multiple-choice and grid-in formats with worked out solutions. These exercise with answers will hone students’ math skills and prepare them to excel when they take the actual SAT. The author also suggests special math strategies to help test takers approach and correctly answer question types that might be unfamiliar to them. Here is intensive preparation for the SAT’s all-important Math section, and a valuable learning tool for college-bound students who need extra help in math.",
        "Category": " Mathematics , General",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "A Potty for Me!",
        "Authors": "By Katz, Karen",
        "Description": "Mommy got me a brand new potty! But I'm not ready yet! I want to run and play. Uh-oh, I peed in my pants. But Mommy says, \"That's okay!\"  Children will love following along and lifting the flaps to see the child play, sit on thepotty, eat, sit on the potty, sleep, and then sit on the potty...until finally there is success.  Written from a child's point of view, this new potty-training book will help children join in the final refrain, \"I'm so proud of me!\"",
        "Category": " Juvenile Nonfiction , Health & Daily Living , Toilet Training",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Exceptional Learners: Introduction to Special Education",
        "Authors": "By Kauffman, James M., Hallahan, Daniel P., and Pullen, Paige C.",
        "Description": "Exceptional Learners is an outstanding introduction to the characteristics of exceptional learners and their education, emphasizing classroom practices as well as the psychological, sociological, and medical aspects of disabilities and giftedness.  In keeping with this era of accountability, all discussions and examples of educational practices are grounded in a sound research base.      With over 600 new references added to the 11th edition, the authors are committed to bringing the most current and credible perspectives to bear on the ever-increasing complexity of educating students with special needs in today’s schools.  The authors believe firmly that responsible instruction can help all students to maximize their potential, and they offer practical suggestions for ways in which educators can meet the educational needs of students with special needs and diverse abilities in collaborative environments that include families, other professionals, and the community.       HIGHLIGHTS OF WHAT'S NEW IN THE ELEVENTH EDITION:       Over 600 new references have been added, reflecting the authors’ commitment to present readers with the most current perspectives on the ever-increasingly complex issues involved in educating students with disabilities in today’s schools.     NEW Assessment of Academic Progress sections in all categorical chapters provide readers with category-specific information about Progress Monitoring, Outcome Measures, Testing Accommodations and Alternative Assessment for students with special needs.      Significantly reorganized Chapter 2, \"Integration, Inclusion, and Support of Positive Outcomes\" both provides new information on Universal Design, use of technologies, differentiated instruction, response to intervention (RTI), and assessment of academic progress and student outcomes, highlighting the current focus of federal mandates (e.g. NCLB, IDEA) on student outcomes, and makes it easier for students to absorb that information.    Increased coverage of Response to Intervention (RTI) in accordance with changes to federal law, including major new sections in Chapter 2 and Chapter 6, emphasises the importance of multi-tiered assessment to readers.    Marginal references throughout the text make it easy for readers to use the relevant multimedia assets on the MyEducationLab website created specifically to accompany Exceptional Learners, 11e, to improve their mastery of key concepts.      New information on Identifying and Implementing Effective Reading Instruction (for English Language Learners).    New information on Parent Training and Information Centers and Community Parent Resource Centers.    New discussion of the change in terminology from mental retardation to intellectual and developmental disabilities.    New information on Fetal Alcohol Spectrum Disorders.    The lastest research on gullibility as a characteristic of persons with mild intellectual disabilities.    New research on neuroimaging and genetics findings relevant to the causes of Learning Disabilities and ADH.    New Skills definition of blindness.    The latest research on the role of visual-spatial abilities in autism.",
        "Category": " Education , Special Education , General",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "7.23",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Algebra Survival Guide: A Conversational Guide for the Thoroughly Befuddled",
        "Authors": "By Rappaport, Josh and Blakemore, Sally (ILT)",
        "Description": "If there’s one question that many parents would rather not hear when Sophia or Aiden gets home from school, it’s, “Mom, can you help me with my algebra homework?”And nowadays that question gets asked by younger and younger children because algebraic thinking has been inserted into the math curriculum as early as 5th grade, sometimes even in 4th grade! So what helps parents recall algebra and also helps students learn it in a friendly way? The Algebra Survival Guide, now updated in its Second Edition. Following on the success of the award-winning First Edition book and written by teacher/tutor Josh Rappaport, the Second Edition Guide offers time-tested advice for understanding the key areas of this gateway math subject. The new Algebra Survival Guide features a unique Q&A format so students hear their own questions echoed in the text. The book’s answers, written in the voice of a friendly tutor, provide conversational responses, along with step-by-step instructions in English right next to the math steps. Each page is a one-page mini-lesson so students can focus without feeling overwhelmed. Following each lesson is a short set of practice problems, offering students instant feedback. At the end of each section, chapter tests provide comprehensive checks on understanding. Since word problems are often the highest “hurdle” of algebra, the Second Edition contains a new 62-page chapter on advanced word problems. This chapter provides detailed strategies for setting up and solving word problems on such dastardly areas as rate, time and distance, work performed, mixture formulas, and even those crazy problems about Joe being three years older than four times Jane’s age 10 years in the future.In its twelve content chapters the 352-page Second Edition covers all key areas of PreAlgebra and Algebra 1: Algebraic Properties, Sets of Numbers, Positive and Negative Numbers, Order of Operations, Absolute Value, Exponents, Radicals, Factoring, Cancelling, Solving Equations, the Coordinate Plane, and Word Problems. As a major bonus, the Guide buzzes with lively illustrations by award-winning artist Sally Blakemore. Ms. Blakemore’s cartoons not only provide comic relief, they also offer a visual way to grasp algebra’s challenging abstractions. (Example:  to illustrate the Reflexive Property of x = x, a cartoon shows a sad ‘x’ gazing at itself in the mirror while suffering a ‘bad hair day.’) With all of these features, the Second Edition Algebra Survival Guide appeals equally to homeschoolers, students, parents, teachers, tutors and adult students striving to recall the math they learned a decade or so ago.The Second Edition aligns with the Common Core State Standards for Math, so it’s up-to-date for today’s teachers. Loaded with thorough explanations, practice problems and answers, the new Algebra Survival Guide gives anyone and everyone the needed boost for learning or teaching the timeless and critical subject of algebra.",
        "Category": " Mathematics , Algebra , General",
        "Publisher": "Singing Turtle Press",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Plum Pudding Murder",
        "Authors": "By Fluke, Joanne",
        "Description": "When Larry Jaeger, the owner of the Crazy Elf Christmas Tree Lot, is murdered, bakery owner Hannah Swenson, during the busiest time of the year, must sift through a wealth of suspects before a murderous Scrooge strikes again.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Scott Foresman Handbook for Writers (8th Edition) (MyCompLab Series)",
        "Authors": "By Ruszkiewicz, John J., Hairston, Maxine, and Friend, Christy",
        "Description": "The best-selling Scott Foresman Handbook has proven again with this edition that it is still the most comprehensive and innovative writing handbook available. Examples of real writers at work gives this book human expression and reinforces key points about writing, style, and mechanics. Readers using The Scott Foresman Handbook will know what good writing means today and what they will need to know in the future.  It incorporates the latest theories and technologies, including civic literacy, visual rhetoric, online research, and service learning and other emerging trends. Topics include the writing process (finding and exploring a topic, focus and organization, drafting and revising, editing and proofreading, and evaluation); writing for academic and public forums; style (crafting opening and closing paragraphs, what kinds of language to use, effective sentences, and stylish sentences); visual design (documents, web sites); grammar, punctuation, and mechanics; research and writing; and documentation.  An excellent reference resource for anyone needing to learn effective writing skills, whether for college, business, or other areas.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Human Stain: American Trilogy (3)",
        "Authors": "By Roth, Philip",
        "Description": "It is 1998, the year in which America is whipped into a frenzy of prurience by the impeachment of a president, and in a small New England town, an aging classics professor, Coleman Silk, is forced to retire when his colleagues decree that he is a racist.  The charge is a lie, but the real truth about Silk would have astonished even his most virulent accuser.Coleman Silk has a secret, one which has been kept for fifty years from his wife, his four children, his colleagues, and his friends, including the writer Nathan Zuckerman.  It is Zuckerman who stumbles upon Silk's secret and sets out to reconstruct the unknown biography of this eminent, upright man, esteemed as an educator for nearly all his life, and to understand how this ingeniously contrived life came unraveled.  And to understand also how Silk's astonishing private history is, in the words of The Wall Street Journal,  \"magnificently\" interwoven with \"the larger public history of modern America.\"",
        "Category": " Fiction , Jewish",
        "Publisher": "Vintage International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "A is for Alibi (Kinsey Millhone Alphabet Mysteries, No. 1)",
        "Authors": "By Grafton, Sue",
        "Description": "READ THE SENSATIONAL BLOCKBUSTER THAT STARTED IT ALL!Take it from the top in #1 New York Times bestselling author Sue Grafton's knockout thriller that introduced detective Kinsey Millhone—and a hot new attitude—to crime fiction…A IS FOR AVENGERA tough-talking former cop, private investigator Kinsey Millhone has set up a modest detective agency in a quiet corner of Santa Teresa, California. A twice-divorced loner with few personal possessions and fewer personal attachments, she's got a soft spot for underdogs and lost causes.A IS FOR ACCUSEDThat's why she draws desperate clients like Nikki Fife. Eight years ago, she was convicted of killing her philandering husband. Now she's out on parole and needs Kinsey's help to find the real killer. But after all this time, clearing Nikki's bad name won't be easy.A IS FOR ALIBIIf there's one thing that makes Kinsey Millhone feel alive, it's playing on the edge. When her investigation turns up a second corpse, more suspects, and a new reason to kill, Kinsey discovers that the edge is closer—and sharper—than she imagined.\"A\" Is for Alibi\"B\" Is for Burglar\"C\" Is for Corpse\"D\" Is for Deadbeat\"E\" Is for Evidence\"F\" Is for Fugitive\"G\" Is for Gumshoe\"H\" Is for Homicide\"I\" Is for Innocent\"J\" Is for Judgment\"K\" Is for Killer\"L\" is for Lawless\"M\" Is for Malice\"N\" Is for Noose\"O\" Is for Outlaw\"P\" Is for Peril \"Q\" Is for Quarry\"R\" Is for Ricochet \"S\" Is for Silence \"T\" Is for Trespass\"U\" Is for Undertow \"V\" Is for Vengeance \"W\" Is for Wasted \"X\"",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Our Choice: A Plan to Solve the Climate Crisis",
        "Authors": "By Gore, Albert",
        "Description": "It is now abundantly clear that we have at our fingertips all of the tools we need to solve the climate crisis. The only missing ingredient is collective will. Properly understood, the climate crisis is an unparalleled opportunity to finally and effectively address many persistent causes of suffering and misery that have long been neglected, and to transform the prospects of future generations, giving them a chance to live healthier, more prosperous lives as they continue their pursuit of happiness. Our Choice gathers in one place all of the most effective solutions that are available now and that, together, will solve this crisis. It is meant to depoliticize the issue as much as possible and inspire readers to take action—not only on an individual basis but as participants in the political processes by which every country, and the world as a whole, makes the choice that now confronts us. There is an old African proverb that says, \"If you want to go quickly, go alone; if you want to go far, go together.\" We have to go far, quickly. We can solve the climate crisis. It will be hard, to be sure, but if we can make the choice to solve it, I have no doubt whatsoever that we can and will succeed. —AL GORE, from the introduction",
        "Category": " Science , Environmental Science",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "The Words We Live By: Your Annotated Guide to the Constitution (Stonesong Press Books)",
        "Authors": "By Monk, Linda R.",
        "Description": "UPDATED FOR THE FIRST TIME IN 10 YEARS, The Words We Live By takes an entertaining and informative look at America's most important historical document, now with discussions about new rulings on hot-button issues such as immigration, gay marriage, the right to bear arms, and affirmative action.In The Words We Live By, award-winning author and journalist Linda R. Monk explores the many interpretations of the Constitution's text in a balanced manner. The Words We Live By presents a new way of looking at the Constitution through entertaining and informative annotations--filled with the stories of the people behind the Supreme Court cases and historical perspective, along with enough surprises and fascinating facts and illustrations to prove that the Constitution is every bit as relevant today as it was in 1787.",
        "Category": " Reference , General",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Understanding Health Policy, Fifth Edition (LANGE Clinical Medicine)",
        "Authors": "By Bodenheimer, Thomas S., M.D. and Grumbach, Kevin, M.D.",
        "Description": "An engaging and clinically applicable work on the principles and structure of the U.S. healthcare systemA Doody's Core Title for 2011!\"Eminently readable...Anyone wanting to gain insight into the forces that shaping health policy and the future of health care will appreciate this book.\"--Critical Care Nurse MagazineUnderstanding Health Policy is the best-written, most informative book available on the subject--and it's the #1 choice for healthcare students and professionals alike. The authors carefully weave key principles, descriptions, and concrete examples into chapters that make important health policy issues both interesting and understandable. Fully updated to reflect current issues in the ever-changing world of healthcare, the newest edition addresses all the topics that affect you most, from the structure and organization of the industry to issues regarding government and private insurance, to access to healthcare. Everything you need to understand how the healthcare system works - and your role in it: Clinical vignettes in every chapter illustrate key points Detailed treatment of both U.S. and international issues A complete chapter of review questions   NEW Expanded coverage of healthcare workers other than physicians NEW Closer scrutiny of the pharmaceutical industry NEW Brand-new chapter on the medical education system",
        "Category": " Medical , Public Health",
        "Publisher": "McGraw-Hill Medical",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Disciple",
        "Authors": "By Coonts, Stephen",
        "Description": "In this new novel by the New York Times bestselling author, Stephen Coonts, Iran is weeks away from acquiring nuclear weapons and has every intention of using them to strike first— only Tommy Carmellini and Jake Grafton can stop a nuclear nightmare Iran is much closer to having operational nuclear weapons than the CIA believes, and Iran’s president, Mahmoud Ahmadinejad, has a plan. Iran will become a martyr nation, and Ahmadinejad will lead the united Muslims of the world in a holy war against the non-believers. But the Americans have a secret weapon in a group of Iranian dissidents, including a brother and sister determined to avenge the death of their beloved grandfather at the hands of the religious police. They are funneling information to Carmellini. They want to stop the attack before their leader launches a new world war. But will the U.S. government believe the information they are providing, and can the Americans prevent the Israelis from taking matters into their own hands, which could prove disastrous? Returning to the kind of military and espionage story that made Cuba one of his most successful novels, Coonts weaves an unforgettable tale of men and women at war, with the sort of dramatic military action and undercover technology for which Coonts is known.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Cat of the Century: A Mrs. Murphy Mystery",
        "Authors": "By Brown, Rita Mae, Gellatly, Michael (ILT), and Brown, Sneaky Pie (CON)",
        "Description": "Acclaimed authors Rita Mae Brown and her feline partner, Sneaky Pie Brown, are back with this new mystery starring Mary Minor “Harry” Haristeen, the sleuthing cats Mrs. Murphy and Pewter, and corgi Tee Tucker. And this time they must catch a killer determined to turn a birthday party into a funeral.Harry’s beloved and tart-tongued Aunt Tally is about to turn the big 1-0-0. The alumnae association of her alma mater sees an opportunity to honor the event and make some loot off the centennial as well. The plan is to hold a big fund-raiser in Aunt Tally’s honor to recoup some of the school revenue lost in the cratered economy. But soon there’s more at risk than investments and endowments.First, an impending blizzard threatens to ruin the whole affair. Then a suspicious transaction is discovered in the association’s account: board member Mariah D’Angelo has mysteriously withdrawn and then replaced $25,000. But was that enough to get her killed? Mariah’s car is on campus, she’s gone missing, and Tucker has found human blood near the school’s stables.What’s behind the disappearance? Was it Mariah’s donations to crafty politicians and crooked charities? Her rivalry with fellow board member Flo Langston? And is there a connection to the forty-year-old unsolved death of an old acquaintance of Aunt Tally’s? Using animal cunning and human canniness, Harry and her menagerie of mystery solvers must sniff out the answers or—even at a hundred years old—Aunt Talley may outlive them all.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Potty Training Boys the Easy Way: Helping Your Son Learn Quickly--Even If He's a Late Starter",
        "Authors": "By Fertleman, Caroline and Cave, Simon",
        "Description": "Potty Training Boys the Easy Way is a pediatrician's guide for navigating the challenges unique to toilet training boys. Boys tend to take longer to be trained, learn this skill at later ages, and have different challenges from girls. Parents will find an accessible plan for getting their son trained quickly, clever games to make learning to use the toilet fun, as well as important tips for handling accidents and setbacks.The book includes advice on boy-specific problems, such as whether to teach him to sit or stand and how to aim, dealing with distractions, handling refusals, and staying dry through the night. Practical and reassuring, Potty Training Boys the Easy Way is packed with all the information a family needs to achieve this important milestone calmly and confidently.",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Blood on the River: James Town, 1607",
        "Authors": "By Carbone, Elisa Lynn",
        "Description": "Twelve-year-old Samuel Collier is a lowly commoner on the streets of London. So when he becomes the page of Captain John Smith and boards the Susan Constant, bound for the New World, he can’t believe his good fortune. He’s heard that gold washes ashore with every tide. But beginning with the stormy journey and his first contact with the native people, he realizes that the New World is nothing like he imagined. The lush Virginia shore where they establish the colony of James Town is both beautiful and forbidding, and it’s hard to know who’s a friend or foe. As he learns the language of the Algonquian Indians and observes Captain Smith’s wise diplomacy, Samuel begins to see that he can be whomever he wants to be in this new land.",
        "Category": " Juvenile Fiction , Historical , United States , Colonial & Revolutionary Periods",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Anna's Return (Pleasant Valley)",
        "Authors": "By Perry, Marta",
        "Description": "In the third Pleasant Valley novel, the Amish community welcomes back one of their daughters, but she hasn’t returned alone...After spending three years in the English world, Anna Beiler has come back to Pleasant Valley with a baby girl, which will surely cause a stir since Anna is unmarried. She is also hiding secrets: the baby is not hers by birth, nor does she intend to stay. Rather, she desperately needs sanctuary from the child’s violent father...It surprises Anna how quickly her Amish habits return to her, and how satisfying it feels to reconnect with her friends and family. Even Anna’s childhood friend Samuel, whose slow, thoughtful manner used to frustrate her, becomes a fond and reassuring companion.But Anna hasn’t fully faced the consequences of her irresponsible youth, and now, her mere presence may endanger the family she holds dear. If she wants to stay, she must seek forgiveness from the community whose blessing she took for granted, and experience the true change of heart required to make a new beginning.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "The Evolution of Calpurnia Tate (Calpurnia Tate, 1)",
        "Authors": "By Kelly, Jacqueline",
        "Description": "Calpurnia Virginia Tate is eleven years old in 1899 when she wonders why the yellow grasshoppers in her Texas backyard are so much bigger than the green ones.With a little help from her notoriously cantankerous grandfather, an avid naturalist, she figures out that the green grasshoppers are easier to see against the yellow grass, so they are eaten before they can get any larger. As Callie explores the natural world around her, she develops a close relationship with her grandfather, navigates the dangers of living with six brothers, and comes up against just what it means to be a girl at the turn of the century. Debut author Jacqueline Kelly deftly brings Callie and her family to life, capturing a year of growing up with unique sensitivity and a wry wit.The Evolution of Calpurnia Tate is a 2010 Newbery Honor Book and the winner of the 2010 Bank Street - Josette Frank Award. This title has Common Core connections.",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "Henry Holt and Co. (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Building Background Knowledge for Academic Achievement: Research on What Works in Schools (Professional Development)",
        "Authors": "By Marzano, Robert J.",
        "Description": "Marzano (Cardinal Stritch University) shows how a combination of two approaches--a five-step sustained silent reading process and a six-step process for instruction in subject-specific vocabulary terms--can help overcome the deficiencies in background knowledge that hold many students back. Vignettes suggest how the methods might be implemented in elementary, middle, and high schools. A 66-page appendix of 7,923 vocabulary terms, organized into 11 subject areas and four grade-level categories, is included. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Research",
        "Publisher": "Association for Supervision & Curriculum Development",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Desperate Marriages: Moving Toward Hope and Healing in Your Relationship",
        "Authors": "By Chapman, Gary D.",
        "Description": "What to do when you feel like giving upWhen  you said, “I do,” you entered marriage with high hopes, dreaming it  would be supremely happy. You never intended it to be miserable.Millions  of couples are struggling in desperate marriages. But the story doesn’t have  to end there. Dr. Gary Chapman writes, “I believe that in every troubled marriage,  one or both partners can take positive steps that have the potential for changing  the emotional climate in their marriage.”Loving Your Spouse When  You Feel Like Walking Away, the revised and updated edition of the award-winning  Desparate Marriages, teaches you how to:Recognize and  reject the myths that hold you captiveBetter understand your spouse’s  behaviorTake responsibility for your own thoughts, feelings, and actionsMake  choices that can have a lasting, positive impact on you and your spouseAn  experienced marriage and family counselor, Gary Chapman speaks to those whose spouse  is any of the following:IrresponsibleA workaholicControllingUncommunicativeVerbally  abusivePhysically abusiveSexually abusiveUnfaithfulAddicted  to alcohol or drugsDepressedMarriage has the same potential  to be miserable as it does to be blissful. Read Loving Your Spouse When You Feel  Like Walking Away to learn how you can turn things around.",
        "Category": " Religion , Christian Ministry , Counseling & Recovery",
        "Publisher": "Northfield Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Culturally Responsive Teaching : Theory, Research, and Practice (Multicultural Education Series, No. 8)",
        "Authors": "By Gay, Geneva and Banks, James A. (FRW)",
        "Description": "",
        "Category": " Education , Multicultural Education",
        "Publisher": "Teachers College Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Giada's Family Dinners: A Cookbook",
        "Authors": "By De Laurentiis, Giada",
        "Description": "In her New York Times bestseller Everyday Italian, Giada De Laurentiis introduced us to the simple, fresh flavors of her native Italian cuisine. Now, America’s favorite Italian cook is back with a new batch of simple, delicious recipes geared toward family meals—Italian style. These unpretentious and delicious meals are at the center of some of Giada’s warmest memories of sitting around the table with her family, passing bowls of wonderful food, and laughing over old times. Recipes for soups like Escarole and Bean and hearty sandwiches such as the classic Italian Muffuletta make casual, easy suppers, while one-pot dinners like Giada’s Chicken Vesuvio and Veal Stew with Cipollini Onions are just as simple but elegant enough for company. You’ll also find recipes for holiday favorites you’ll be tempted to make all year round, including Easter Pie, Turkey and Ciabatta Stuffing with Chestnuts and Pancetta, and Panettone Bread Pudding with Amaretto Sauce.Giada’s Family Dinners celebrates the fun of family meals with photographs of Giada’s real-life family and friends as well as the wonderful dishes she shares with them in her kitchen. Suggested menus help you put together a family-style meal for any occasion, from informal to festive. The heart of Italian cooking is the home, and Giada’s Family Dinners—full of fantastic recipes that require a minimum of fuss to prepare—invites you to treat everyone like a member of the family.Nothing is more important than family. Bring yours to the table with Giada’s unpretentious, authentic, down-home Italian cooking!• SOUPS AND SANDWICHES• ITALIAN SALADS AND SIDES• EVERYDAY FAMILY ENTREES• THE ITALIAN GRILL• FAMILY-STYLE PASTA• FAMILY-STYLE GET-TOGETHERS• ITALIAN FAMILY FEASTS• FAMILY-STYLE DESSERTS",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "All the Lovely Bad Ones",
        "Authors": "By Hahn, Mary Downing",
        "Description": "When Travis and his sister, Corey, learn that their grandmother&#39;s quiet Vermont inn has a history of ghost sightings, they decide to do a little \"haunting\" of their own. Before long, their supernatural pranks are drawing tourists to the inn. But Travis and Corey soon find out that there are other ghosts at Fox Hill Inn, and their tricks have awakened something dangerous and threatening. It&#39;s up to these pranksters to figure out how to lay to rest the ghosts they&#39;ve stirred. A fresh take on haunted houses, Mary Downing Hahn&#39;s entertaining, spooky story pokes gentle fun at charlatan ghost hunters while suggesting that ghosts are not to be trifled with.",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Too Small to Ignore: Why the Least of These Matters Most",
        "Authors": "By Merrill, Dean (CON) and Stafford, Wess",
        "Description": "Too Small to Ignore will encourage you to turn your good, loving intentions into  strategic actions and empower you to help change the world–and the  future–forever, one child at a time.The time has come for a major paradigm shift: Children are too important and too intensely loved by God to be left behind or left to chance. Children belong to all of us and we are compelled to intervene on their behalf. We must invest in children all across the world. In Too Small to Ignore, Dr. Stafford issues an urgent call for change. His adventures as a boy raised in a West African village provide an often-humorous and always-captivating backdrop to his profound and inspiring challenges. Wess lived the reality of “it takes a village to raise a child” and calls us to “be that loving village for children everywhere.”",
        "Category": " Religion , Christian Living , General",
        "Publisher": "WaterBrook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "YOU: Having a Baby: The Owner's Manual to a Happy and Healthy Pregnancy",
        "Authors": "By Roizen, Michael F., M.D., Oz, Mehmet, M.D., Spiker, Ted (CON), Oz, Lisa (CON), and Wynett, Craig (CON)",
        "Description": "Can I get a cavity filled while pregnant? Will avoiding spicy foods make my kid a picky eater? Can I really increase my baby's IQ while she's in utero?    Whether you're pregnant for the first time, are trying to start your family, or already have enough children to start your own basketball team, you're bound to have questions about what it means to be pregnant -- and how you can increase your odds of having a healthy and happy pregnancy. But no matter how much you've read, watched, studied, or talked about this amazing biological journey, you have never read anything like this.   In this groundbreaking book, Dr. Michael Roizen and Dr. Mehmet Oz act as mythbusters for the hundreds of questions surrounding pregnancy in the same scientific, informative, and entertaining ways that have made them America's Doctors. In these pages, you'll learn everything you need to know about the miracles of fetal development, your health throughout the pregnancy, and providing the best possible environment for your growing child.   Pregnancy is a complicated balancing act, but it doesn't have to be frightening. The doctors will help you de-stress as they describe accurately and rationally what happens during a thrilling nine months of life. While every pregnant body is different, odds are you'll experience some of the cravings, crying, and discomfort that almost all women go through. Your best tactic? Learn why these things are happening -- and what you should do about them. YOU: Having a Baby will teach you everything you need to know about what to eat (should I be eating for two?), how much to exercise, and what guilty pleasures will actually make pregnancy easier on you (and the loved ones who get to be around you for the whole thing). Each phase of pregnancy has different challenges, but the right information will prepare you for what's ahead. The interactive week-by-week calendar inside provides an even more detailed guideline for how and what you should feel through every step of the process.   Exciting, cutting-edge scientific research in the fi eld of epigenetics has changed the way the medical profession looks at pregnancy, and now it can change your perspective, too. Epigenetics explores what makes us develop in certain ways -- why some people thrive at math while others are prone to chronic diseases. It turns out that there are easy things you can do that will not just help your baby's development in utero but will actually improve his or her chances of living a healthy, fulfi lling adult life.   Filled with recipes for nutritious, satisfying snacks and meals even Pop can cook (yes, he can!), safe exercises for staying fit, and tons of YOU tips that will help you stay comfortable, YOU: Having a Baby is the ultimate guidebook for what to do from the moment of conception to the weeks after your child has arrived home. From morning sickness and food cravings to choosing a doctor and changing a diaper, YOU: Having a Baby will give you the real scoop about what's in store for you during this amazing time in your life.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "New Gas Grill Gourmet: Great Grilled Food For Everyday Meals And Fantastic Feasts (Non)",
        "Authors": "By Sinnes, A. Cort",
        "Description": "This fully revised and expanded version of the best-selling gas griller's bible now has 300 recipes for easy and creative everyday grilling. Each recipe is designed specifically for use on the gas grill, and author Cort Sinnes provides lots of tips and information on equipment and techniques. He'll show you how to perfect your basic steak and chicken, and then he'll help you get creative with delicious recipes like Chuck Roast with Bourbon and Coke, Tunisian Tilapia, Barbecued Catfish Sandwiches, Hoisin-Chili Pork Satay, Lamb Chops with Blackberries and Lavender, and a whole lot more!",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "To Try Men's Souls: A Novel of George Washington and the Fight for American Freedom",
        "Authors": "By Gingrich, Newt, Forstchen, William R., and Hanser, Albert S. (EDT)",
        "Description": "After two bestselling series examining the Civil War and WWII, Newt Gingrich and William R. Forstchen have turned their sharp eye for detail on the Revolutionary War. Their story follows three men with three very different roles to play in history: General George Washington, Thomas Paine, and Jonathan Van Dorn, a private in Washington’s army. The action focuses on one of the most iconic events in American history: Washington cross - ing the Delaware. Unlike the bold, courageous General in Emanuel Leutze’s painting, Washington is full of doubt on the night of December 25, 1776. After five months of defeat, morale is dangerously low. Each morning muster shows that hundreds have deserted in the night. While Washington prepares his weary troops for the attack on Trenton, Thomas Paine is in Philadelphia, overseeing the printing of his newest pamphlet, The Crisis. And Jonathan Van Dorn is about to bring the war to his own doorstep. In the heat of battle, he must decide between staying loyal to the cause and sparing his brother who has joined up with the British. Through the thoughts and private fears of these three men, Gingrich and Forstchen illu minate the darkest days of the Revolution. With detailed research and an incredible depth of military insight, this novel provides a rare and personal perspective of the men who fought for, and founded the United States of America.",
        "Category": " Fiction , Biographical",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Blood Vines",
        "Authors": "By Spindler, Erica",
        "Description": "In this bare-knuckled adrenaline ride from New York Times bestselling author Erica Spindler, Alex Clarkson’s worst nightmares are about to come true…A sinister, hooded figure…When Alexandra Clarkson starts having terrifying visions filled with blood and ceremonial images, she tries to find a rational explanation – maybe her mind is playing tricks on her, resurrecting creepy tableaux from her research on religious ceremonies and sects.  But when Alex’s mother, Patsy, commits suicide without leaving behind any information, Alex is left wondering: could she be haunted by something from the childhood she doesn’t remember?Naked, writhing bodies…Detective Daniel Reed was the last person to speak to Patsy.  What he reveals to Alex is shocking. Twenty-five years earlier, Patsy was married to Harlan Sommer, one of Sonoma County’s most prominent vintners, when their infant son disappeared without a trace.  The loss destroyed the Sommers’ marriage, causing Patsy to leave and take Alex with her.A dead child…Called on to investigate the identity of a baby’s remains unearthed in a Sonoma vineyard, Reed had picked up a trail that led him to Patsy in San Francisco.  Now Reed and Alex both wonder if the cold bones could be her baby brother Dylan, and Alex decides to accompany Reed back to Sonoma for the investigation.  No sooner does she arrive, however, than she is drawn deep into the search for a twisted killer…",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Saving Your Marriage Before It Starts Workbook for Men Updated: Seven Questions to Ask Before-and After-You Marry",
        "Authors": "By Parrott, Les",
        "Description": "The Saving Your Marriage Before It Starts Workbook for Men will help you uncover and understand the unique shaping factors you bring into your marriage both as a man and as an individual. Prepare for some surprising and helpful insights; for honest, intimate, and enjoyable relationship-strengthening conversations with you and your fiancée, and for engaging discussions with a small group.EXERCISES AND ASSESSMENTS   Twenty-four exercises will shed amazing new light on the way you are put together, how that affects specific aspects of how you and your loved one relate, and how you can improve those areas to build a better relationship. You will gain unprecedented insights into• your personal “Ten Commandments”• making your roles conscious• getting your sex life off to a great start• identifying your “hot topics”• your spiritual journey … and much, much moreDISCUSSION GUIDE   Les and Leslie will help both of you enjoy lively and eye-opening interaction through seven sessions and one bonus session in the Zondervan DVD. For use by small groups, individual couples, and pastors and marriage counselors. Each session links with the workbook exercises and concludes with an exercise each couple can do together over the next week.",
        "Category": " Social Science , Men's Studies",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The O2 Diet: The Cutting Edge Antioxidant-Based Program That Will Make You Healthy, Thin, and Beautiful",
        "Authors": "By Glassman, Keri and Mahoney, Sarah",
        "Description": "Kick-start weight loss and boost beauty with an easy 4-day cleanse and a delicious 4-week antioxidant-based program from CBS's The Early Show nutrition contributor In The O2 Diet, nutritionist Keri Glassman translates cutting-edge science into an easy-to-do program that will leave dieters energetic, healthy, and beautiful— inside and out. Glassman shows how dieters can—and should—indulge in foods like Caramelized Pear and Pecan French Toast and Flank Steak withChimichurri Sauce and actually lose weight! For once, it's not about counting calories or restricting what one eats; it's about eating more of the right things.The diet is based on the ORAC (Oxygen Radical Absorbance Capacity) scale, a calculus developed by the USD A that measures how well a food protects against free radicals, the culprits behind many forms of cancer, heart disease, and symptoms of aging. Research demonstrates that eating a high- ORAC diet increases the antioxidant power of human blood 10 to 25 percent, strengthening memory and cognition, preventing cancer and heart disease, improving skin, and aiding in weight loss.The O2 Cleanse kicks things off, maximizing weight loss, inspiring confidence, and delivering immediate results. The 4-week plan builds on initial success and includes simple guidelines for pampering and stress reduction that are proven to enhance weight loss. Plus it gives dieters real-world options for eating out and recipes that allow them to indulge at home with treats such as Chocolate-Covered Pecans and Sangria. This simple program is a positive, empowering new way to approach eating that will leave readers slim, sated and beautiful.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Runner's World The Runner's Diet: The Ultimate Eating Plan That Will Make Every Runner (and Walker) Leaner, Faster, and Fitter",
        "Authors": "By Fernstrom, Madelyn H., Ph.D.",
        "Description": "A unique eating plan for both novice and experienced runners--to help you achieve optimum performance and keep those unwanted pounds off.If you are a serious runner, or are thinking about starting a running or run/walk program to keep fit and help you lose weight, forget about the traditional food pyramid--or today's low-carb diets. As noted dietitian Madelyn H. Fernstrom, Ph.D., C.N.S., explains, the eating plan that best meets the needs of runners at all levels is based on a 50 percent carb, 25 percent protein, 25 percent fat ratio. Here Dr. Fernstrom details a realistic program, individualized for each person's activity level, that will enable runners to maximize their performance while maintaining long-term success at weight control.In Runner's World The Runner's Diet, the reader will discover:o Why the 50-25-25 ratio works best for runners--and even walkerso How to match your eating pattern to your running styleo How to make use of a daily food and activity logWith the imprimatur of Runner's World, the leading authority in the running field, Runner's World The Runner's Diet by Madelyn H. Fernstrom with Ted Spiker is the first book to recognize that runners cannot depend solely on physical activity to control their weight--and to outline a lifetime weight-loss plan that is best for their special needs.",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Heaven: Close Encounters of the God Kind",
        "Authors": "By Duplantis, Jesse",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Harrison House",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Secret Scripture: A Novel",
        "Authors": "By Barry, Sebastian",
        "Description": "An epic story of family, love, and unavoidable tragedy from the two-time Man Booker Prize finalist. Now a major motion picture starring Rooney Mara. Sebastian Barry's latest novel, Days Without End, is now available.  Sebastian Barry's novels have been hugely admired by readers and critics, and in 2005 his novel A Long Long Way was shortlisted for the Man Booker Prize. In The Secret Scripture, Barry revisits County Sligo, Ireland, the setting for his previous three books, to tell the unforgettable story of Roseanne McNulty. Once one of the most beguiling women in Sligo, she is now a resident of Roscommon Regional Mental Hospital and nearing her hundredth year. Set against an Ireland besieged by conflict, The Secret Scripture is an engrossing tale of one woman's life, and a poignant story of the cruelties of civil war and corrupted power. The Secret Scripture is now a film starring Rooney Mara, Eric Bana, and Vanessa Redgrave.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "The Complete Joy of Homebrewing Third Edition",
        "Authors": "By Papazian, Charlie",
        "Description": "Charlie Papazian, master brewer and founder and president of the American Homebrewer's Association and Association of Brewers, presents a fully revised edition of his essential guide to homebrewing. This third edition of the best-selling and most trusted homebrewing guide includes a complete update of all instructions, recipes, charts, and guidelines. Everything you need to get started is here, including classic and new recipes for brewing stouts, ales, lagers, pilseners, porters, specialty beers, and honey meads.The Complete Joy of Homebrewing, third edition, includes:Getting your home brewery together: the basics -- malt, hops, yeast, and water Ten easy lessons for making your first batch of beer Creating world-class styles of beer (IPA, Belgian wheat, German Kölsch and Bock, barley wine, American lagers, to name a few)Using fruit, honey, and herbs for a spicier, more festive brew Brewing with malt extracts for an unlimited range of strengths and flavorsAdvanced brewing techniques using specialty hops or the all-grain method or mash extracts A complete homebrewer's glossary, troubleshooting tips, and an up-to-date resource section And much, much moreBe sure to check out Charlie's The Homebrewer's Companion for over 60 additional recipes and more detailed charts and tables, techniques, and equipment information for the advanced brewer.",
        "Category": " Cooking , Beverages , Alcoholic , Beer",
        "Publisher": "HarperResource",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Barbecue! Bible Sauces, Rubs, and Marinades, Bastes, Butters, and Glazes (Steven Raichlen Barbecue Bible Cookbooks)",
        "Authors": "By Raichlen, Steven and Tanovitz, Ron (ILT)",
        "Description": "Marinate skewers of beef tips in Tex-Mex Tequila-Jalapeno Wet Rub before putting them on the grill. Or slather pork chops with B.B. Lawnside Spicy Apple Barbecue Sauce. Or coax a chicken breast to perfection with a Coconut Curry Baste. From Steven Raichlen, author of the big, bad, definitive BARBECUE! BIBLE, comes BARBECUE! BIBLE SAUCES, RUBS, AND MARINADES, BASTES, BUTTERS & GLAZES, an in-depth celebration of those cornerstones on which unforgettable live-fire flavors are built.  Here are fiery spice mixtures for massaging into food, sensuous bastes to be brushed on like lacquer, killer marinades, sugary glazes, tangy mops from award-winning barbecue teams, and dozens of sauces, from the classic tomato-based American Sweet and Smoky to a bold Moroccan Charmoula with its medley of fresh herbs and spices.  In all, 200 recipes cover the gamut. But BARBECUE! BIBLE SAUCES aims even higher - offering a serious education in flavor. Big flavor. It tells how to use a mortar and pestle to maximize fresh garlic and onions. How to create a failproof fish cure and radically improve home-smoked fish. The best way to handle a Scotch bonnet chili to reap its heat and savor without scorching skin or eyes. How to balance acid, oil, and aromatics in a marinade so that it tenderizes meat, coats the exterior to keep it from drying out during cooking, and adds cannon blasts of flavor. And how to confidently incorporate ingredients like tamarind, lemon grass, star anise, wasabi, marjoram, kaffir lime leaf, and tarragon.  Put it all together, and you'll really have your barbecue mojo working.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Success in Practical/Vocational Nursing: From Student to Leader",
        "Authors": "By Hill, Signe S. and Howlett, Helen Stephens",
        "Description": "Using an engaging, interactive, 1-2-3 approach, this text helps you develop problem-solving skills that will be useful throughout your nursing career. Active participation and application of critical thinking are utilized through questions, quizzes, and self-assessments to provide you with practical and efficient aids to learning. You will also discover learning strategies, tips on taking the NCLEX-PN®, guidance on the job search, and an in-depth discussion of supervision, delegation, assignment of tasks, and the distinctions among them. An LPN Threads Series title.UNIQUE! 1-2-3 approach in a clear, simple, engaging writing style instructs you in what you need to do and how to do it.UNIQUE! Learning Exercises challenge you to imagine, visualize, and think outside the box.UNIQUE! Leadership Activities provide exercises to practice and develop leadership skills and Leadership Hints provide helpful pointers to follow and remember when in various leadership situations.UNIQUE! Management Tools and Management Hints provide practical instructions, resources, and tips to use when in a management situation.UNIQUE! Offers time-management tips to help prioritize. Integrates wellness and personal care throughout the text, including information and coping skills for stress management and burnout, nutrition and exercise, the impaired nurse, and co-dependency.Includes separate chapters on \"Ethics Apply to Nursing and \"Nursing and the Law that address pertinent legal and ethical issues that directly and indirectly affect LPN/LVNs.Features information on Medicare and the many changes that affect health care, including health care settings, medication coverage, and the costs of managed care.Includes a separate chapter on learning strategies for the adult student and updated approaches for traditional and returning students.A separate chapter on critical thinking and many critical thinking exercises promotes the development of critical thinking and problem solving skills in both academic and personal situations.Includes updated State Boards of Nursing and Internet Resources Appendixes with the most up-to-date addresses for nursing boards and website addresses for nursing, medical, and health-related information as an all-in-one ready resource for you as you prepare to enter the work world.UNIQUE! Keep In Mind boxes located in each chapter introduce readers to the underlying theme in the chapter.UNIQUE! Evolve Student Resources includes 230 NCLEX Exam-Style Interactive Questions per chapter, with correct response and rationales for both correct and incorrect responses, to encourage self-study and review.UNIQUE! The \"Learning During School, for the NCLEX-PN, and Beyond chapter includes new content on the role of simulation in nursing education and etiquette for electronic device use, such as cell phones and iPods.UNIQUE! The \"Personal Health Promotion chapter helps you provide a positive role model for patients with new content on MyPyramid, the benefits of exercise, personal steps to help prevent hospital-acquired infections, burnout versus stress, and tips for personal safety. UNIQUE! Culture content has been expanded content addressing the growing needs of patient care for special populations and to help students develop cultural sensitivity.Includes the latest protocols from NAPNES regarding standards of practice and educational competencies that LPN/LVN nursing students need to know.",
        "Category": " Medical , Nursing , General",
        "Publisher": "Saunders",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "A Vintage Affair: A Novel",
        "Authors": "By Wolff, Isabel",
        "Description": "Every dress has a history. And so does every woman. In Isabel Wolff’s captivating A Vintage Affair, a treasured child’s coat becomes a thread of hope connecting two very different women. Her friends are stunned when Phoebe Swift abruptly leaves a plum job at the prestigious Sotheby’s auction house to open her own vintage clothing shop in London—but to Phoebe, it’s the fulfillment of a dream. In the sunlight-flooded interior of Village Vintage, surrounded by Yves Saint Laurent silk scarves, Vivienne Westwood bustle skirts, cupcake dresses, and satin gowns, Phoebe hopes to make her store the hot new place to shop, even as she deals with two ardent suitors, her increasingly difficult mother, and a secret from her past that casts a shadow over her new venture.For Phoebe, each vintage garment carries its own precious history. Digging for finds in attics and wardrobes, Phoebe is rewarded whenever she finds something truly unique, for she knows that when you buy a piece of vintage clothing, you’re not just buying fabric and thread—you’re buying a piece of someone’s past. But one particular article of clothing will soon unexpectedly change her life.  Thérèse Bell, an elderly Frenchwoman, has an impressive clothing collection. But among the array of smart suits and couture gowns, Phoebe finds a child’s sky-blue coat—an item with which Bell is stubbornly reluctant to part. As the two women become friends, Phoebe will learn the tale of that little blue coat. And she will discover an astonishing connection between herself and Thérèse Bell—one that will help her heal the pain of her own past and allow her to love again.",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "The Pill Book (13th Edition) (Pill Book (Mass Market Paper))",
        "Authors": "By Silverman, Harold M. (EDT)",
        "Description": "For more than two decades, millions of consumers have trusted The Pill Book to provide official, FDA-approved drug information plus guidelines from leading pharmacists. Each drug is profiled in a concise, readable, and easy-to-understand entry, making The Pill Book the perfect reference when you have questions about the medications your doctor prescribes.The most up-to-date information about the more than 1,800 most commonly prescribed drugs in the United States:• Generic and brand-name listings that can help you save money• What the drug is for, and how it works• Usual dosages, and what to do if a dose is skipped• Side effects and possible adverse reactions, highlighted for quick reference• Interactions with other drugs and food• Overdose and addiction potential• Alcohol-free and sugar-free medications• The most popular self-injected medications and their safe handling• Information for seniors, pregnant and breast-feeding women, children, and others with special needs• Cautions and warnings, and when to call your doctor• 32 pages of actual-size color photographs of prescription pills",
        "Category": " Reference , Consumer Guides",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Fodor's Exploring China, 6th Edition (Exploring Guides)",
        "Authors": "By Knowles, Christopher",
        "Description": "Fodor's Exploring Guides are the most up-to-date, full-color guidebooks available. Covering destinations around the world, these guides are loaded with photos; essays on culture and history, architecture and art; itineraries, walks and excursions; descriptions of sights; and practical information. Fodor's Exploring China, 6th Edition gives you great tips on dining and lodging for all budgets as well as tips on basics such as getting there and getting around and when to go and what to pack",
        "Category": " Travel , Asia , China",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Declaration of Independence and the Constitution of the United States of America",
        "Authors": "By Thomas Jefferson",
        "Description": "",
        "Category": "",
        "Publisher": "Cato Institute",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Dangerous Desires Collection (Too Wild To Wed, Montana Man, and Falling Angel)",
        "Authors": "By Stuart, Anne, Krentz, Jayne Ann, and Delinsky, Barbara",
        "Description": "",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Frommer's National Parks of the American West (Park Guides)",
        "Authors": "By Laine, Don, Laine, Barbara, Frommer, Arthur, and O'Gara, Geoffrey",
        "Description": "All the Details on 49 National Parks, Monuments, Preserves, and SeashoresThe best strategies for seeing the parks?so you can make the most of your time and avoid the crowdsComplete campground guides, from car-accessible campsites to backcountry spots?plus park lodges, gateway motels, and nearby B&Bs and innsAdventures for everyone: easy day hikes, backpacking trips, wildlife watching, guided mule and horseback rides, rafting trips, sea kayaking, and bikingWhere to eat and stock up on supplies, both in the parks and in gateway townsEverything you need to know to plan the perfect trip?plus detailed maps, advice for families traveling with kids, and moreCoverage of each and every park reviewed for accuracy by local National Park Service personnel. Frommer's. The Name You Can Trust. Find us online at www.frommers.com",
        "Category": " Travel , Parks & Campgrounds",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Little Dorrit",
        "Authors": "By Dickens, Charles, Wall, Stephen (CON), and Small, Helen (CON)",
        "Description": "Coming to PBS in March 2009-a MasterpieceTM Classic production of Charles Dickens'sLittle DorritCharles Dickens 's great satire on poverty, riches, and imprisonment, Little Dorrit is the story of Arthur Clennam, a man whose kindly interest in Amy Dorrit, his mother's seamstress, assures him nothing but trouble. Her father, William Dorrit, a man of shabby grandeur, has long been imprisoned for debt in the Marshalsea. A masterly evocation of the state and psychology of imprisonment,Little Dorrit is a supreme work of Dickens's maturity.",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "The Retirement Savings Time Bomb . . . and How to Defuse It: A Five-Step Action Plan for Protecting Your IRAs, 401(k)s, and Other RetirementPlans from Near Annihilation by the Taxman",
        "Authors": "By Slott, Ed",
        "Description": "The premier guide for retirement and investment planning by \"America's IRA Expert\" (Mutual Funds magazine)-fully updated to reflect the recent tax rule changes With the possible e xception of home property, the most valuable asset for most Americans is their retirement fund. Yet most people don't know that the IRS is waiting to grab up to 90 percent of their hard-earned retirement savings. Now, in this fully updated edition of The Retirement Savings Time Bomb, renowned tax advisor Ed Slott explains in clear-cut layman's terms what people need to know to keep their money and pass it on to their families.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "New Chinese 300 Textbook: A Beginning Language Course (C&T Asian Languages Series)",
        "Authors": "By Faculty of Peking Language Inst",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Cheng & Tsui",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "The Forgotten Ways: Reactivating the Missional Church",
        "Authors": "By Sweet, Leonard (FRW) and Hirsch, Alan",
        "Description": "Alan Hirsch is convinced that the inherited formulas for growing the Body of Christ do not work anymore. And rather than relying on slightly revised solutions from the past, he sees a vision of the future growth of the church coming about by harnessing the power of the early church, which grew from as few as 25,000 adherents in AD 100 to up to 20 million in AD 310. Such incredible growth is also being experienced today in the church in China and other parts of the world. How do they do it?The Forgotten Ways explores the concept of Apostolic Genius as a way to understand what caused the church to expand at various times in history, interpreting it for use in our own time and place. From the theological underpinnings to the practical application, Hirsch takes the reader through this dynamic mixture of passion, prayer, and incarnational practice to rediscover the dormant potential of the modern church in the West.",
        "Category": " Religion , Christian Church , Growth",
        "Publisher": "Brazos Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Extreme Grandparenting",
        "Authors": "By Kimmel, Tim and Kimmel, Darcy",
        "Description": "Grandparents have a vital role in the lives of their grandchildren, not only as a mentor and loving family member, but as a spiritual rock during the hard times. Extreme Grandparenting helps readers understand how to make the most of the new role of grandparent and how to grow the next generation for greatness.",
        "Category": " Religion , Christian Living , Family & Relationships",
        "Publisher": "Focus on the Family",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "As You Like It (No Fear Shakespeare) (Volume 13)",
        "Authors": "By Shakespeare, William and Crowther, John (EDT)",
        "Description": "Read Shakespeare’s plays in all their brilliance—and understand what every word means!   Don’t be intimidated by Shakespeare! These popular guides make the Bard’s plays accessible and enjoyable.Each No Fear guide contains:The complete text of the original playA line-by-line translation that puts the words into everyday languageA complete list of characters, with descriptionsPlenty of helpful commentary",
        "Category": " Study Aids , Book Notes",
        "Publisher": "SparkNotes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Psalms and Consolations: a Jesuit's Journey through Grief",
        "Authors": "By Brown, S. J. Timothy (NA)",
        "Description": "",
        "Category": " Religion , Prayerbooks , General",
        "Publisher": "Resonant Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Asking God Your Hardest Questions",
        "Authors": "By Ogilvie, Lloyd John",
        "Description": "With warmth and clarity, Lloyd Ogilvie offers thoughtful, biblical  insights to modern questions. He encourages us to honestly ask God  anything, because there's no question too big for him and no need too  deep for him to meet.",
        "Category": " Religion , Inspirational",
        "Publisher": "Shaw Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Irish Fairy Tales (Wordsworth Children's Classics)",
        "Authors": "By Joseph Jacobs",
        "Description": "",
        "Category": "",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Horse Facts",
        "Authors": "By susan-mcbane",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "America's Favorite Wild Game Recipes (The Hunting & Fishing Library)",
        "Authors": "By",
        "Description": "We gathered nearly 150 recipes for all types of game from a variety of game lodges, food writers, and our own expert chefs. Whether you're a dedicated hunter or a cook who buys game from a game farm, you'll enjoy this mouthwatering collection of recipes.The book is divided into sections based on the menu approach. There are sections for appetizers; main dishes; soups, stews and chilies; and a detailed section on sausages and smokehouse specialties. Helpful photo sequences throughout the book show you how to prepare complex recipes. No matter whether you're a first-time deer stalker, a dedicated waterfowler, or a cook who buys game from a grocery store or game farm, there's sure to be a recipe in this book that will help you savor the incomparable flavors of the wild harvest.",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "Cool Springs Press",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Doing Battle: The Making of a Skeptic",
        "Authors": "By Fussell, Paul",
        "Description": "In this highly praised autobiographical work, the author of \"The Great War\" and \"Modern Memory\" recounts his own experience of combat in World War II and how it became a determining force in his life. \"Doing Battle\" is at once a summing-up of one man's life and a profoundly thoughtful portrait of America's own search for identity in the second half of this century. of photos.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "It's the Will, Not the Skill: Principles and Philosophies of Success as Seen Through the Eyes, Mind and Heart of Herman Edwards, Head Coach of the N",
        "Authors": "By Tunney, Jim",
        "Description": "",
        "Category": "",
        "Publisher": "Executive Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Encyclopedia of Horses & Ponies",
        "Authors": "By Pickeral, Tamsin",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon",
        "Price Starting With ($)": "7.82",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Resume Magic: Trade Secrets of a Professional Resume Writer, 2nd Edition",
        "Authors": "By Whitcomb, Susan Britton",
        "Description": "",
        "Category": " Business & Economics , Careers , Resumes",
        "Publisher": "Jist Works",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Better Homes And Gardens Step-By-Step Successful Gardening: Annuals",
        "Authors": "By Loewer, Peter",
        "Description": "Offers advice for gardening with annuals, provides timesaving tips and troubleshooting ideas, and includes an encyclopedia of 150 annual plants",
        "Category": " Gardening , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Crafts Library: Jewelry",
        "Authors": "By Innes, Miranda, Streeter, Clive (PHT), and Streeter, Clive",
        "Description": "Provides instructions for making jewelry from paper, fabrics, beads, glass, wood, metal, and suggests a variety of projects",
        "Category": " Crafts & Hobbies , Jewelry",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Catcher in the Rye",
        "Authors": "By SparkNotes (EDT)",
        "Description": "Features explanations of themes, motifs, and symbols, analyses of characters and quotes, plot summaries and analysis, an exploration of historical context, and facts and essay topics.",
        "Category": " Literary Criticism , General",
        "Publisher": "Spark Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Chicken Soup for the Entrepreneur's Soul: Advice and Inspiration on Fulfilling Dreams (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Gardner, John (COM), Gardner, Elizabeth (COM), Hill, Tom (COM), Wilson, Kyle, and Mckowen, Dahlyn",
        "Description": "Fulfill your dreams...Chicken Soup for the Entrepreneur's Soul is a compilation of short stories from entrepreneurs, both large and small, who share their experiences of success, failure and courage, with a little helpful advice mixed in.Many of these stories, told for the first time here, will enlighten you to new methods of entrepreneurship or simply help you believe in the possibilities of getting started. People such as Doris Christopher, a stay-at-home mother, who introduced her love of cooking to others through founding The Pampered Chef; Thom Chappell, who stuck to his instincts when developing Tom's of Maine and kept value at the core of his business; and Carol Gardner who intimately shares a desperate time of debt and divorce, until along came a bulldog named Zelda, followed by a greeting card line - Zelda Wisdom - which became one of Hallmark's number one sellers. These entrepreneurs and many more will inspire you with their amazing life experiences and fascinating beginnings.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Dance of the Thunder Dogs",
        "Authors": "By Mitchell, Kirk",
        "Description": "Badly wounded and estranged from his partner and love interest, Anna Turnipseed, Emmett Parker has come home. After thirteen years of federal law enforcement assignments that took him to every Indian nation but his own, the veteran investigator for the Bureau of Indian Affairs has finally arrived in Oklahoma on convalescent leave. At once a son of the Nuhmuhnuh (\"the People,\" as the Comanche call themselves) and a government investigator, he has ties to both sides - and is about to discover which side pulls harder.Once on the reservation, Emmett finds an intricate web of familial and tribal duties - and what could become a massive class action suit. Indian plaintiffs are suing the BIA for oil well funds they never received. Drawn into the controversy, Emmett is now accused of murder by an investigator of his own blood. And now, a man who used to be the law is running from it.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Twizzlers Percentages Book",
        "Authors": "By Pallotta, Jerry and Bolster, Rob (ILT)",
        "Description": "Using Twizzlers candy as the teaching tool, young readers are introduced to the math concept of percentages, in a bright and fun mathematical picture book for young learners. Simultaneous.",
        "Category": " Juvenile Nonfiction , Concepts , Counting & Numbers",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Winners & Losers: campaigns, candidates and congressional elections",
        "Authors": "By Stuart Rothenberg",
        "Description": "",
        "Category": "",
        "Publisher": "Institute of Government and Politics",
        "Price Starting With ($)": "11.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Citizen Warriors: America's National Guard and Reserve Forces & the Politics of National Security",
        "Authors": "By Duncan, Stephen M.",
        "Description": "",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Presidio Press",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Growth: Training vs. Trying (Pursuing Spiritual Transformation)",
        "Authors": "By Ortberg, John, Pederson, Laurie, and Poling, Judson",
        "Description": "What would your life be like if Jesus lived it? Imagine the change you would experience in your thoughts, actions, and relationships. Think of the joy and freedom that could transform every area of your life. That’s exactly what God has in mind for you! You’ll find out how in Growth. Through personal study and small group interaction, this study sets you on a path to live out the character of Jesus in this world as only you can. It happens not by trying hard, but by training. By cultivating spiritual disciplines--Scripture meditation, prayer, solitude, endurance, loving others--you’ll discover the joy of being transformed by Christ and the freedom of living each day sustained by his power. Leader’s guide included!Growth group sessions are:Training to Live Like JesusThe Practice of Scripture MeditationThe Practice of SolitudeSimple PrayerThree Transforming PrayersThe Roundabout WayAnd the Greatest of These Is Love",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "HarperChristian Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Skyscraper: A Novel",
        "Authors": "By Zane",
        "Description": "Most corporations hand out bonus checks or gift certificates for Christmas, but Wolfe Industries hands out drama. Skyscraper chronicles the week before the annual Christmas party at Wolfe Industries, an African American-owned automobile manufacturer.  Chico, a nineteen-year-old mail-room clerk who still lives with his overprotective mother, is the typical young man when it comes to sex. He doesn't turn it down. So, when Zetta Wolfe, the wife of CEO Tomalis Wolfe, attempts to seduce him, he jumps at the opportunity. Meanwhile, Anastasia, a twenty-five-year-old secretary, along with her best friend and coworker, Shakia, spends her nights in the secret penthouse maintained by Wolfe executives for partying and wild sex. She has higher aspirations though -- she wants to be the next wife of the CEO. Tomalis has never actually participated in the in-office sexual activities, but Anastasia plans to seduce him by the end of the year.  Diana, a thirty-five-year-old single mother is frustrated with her current position as an executive assistant. Every time she approaches her boss, Bradford, about the possibility of a promotion, he makes her promises that he never keeps. Meanwhile, Edmund, a parking-garage attendant, has the hots for her, but she won't give him the time of day. That is until two of her girlfriends drag her to a holiday cabaret and she discovers another sexier side to this blue-collar man.  The week leading up to the Wolfe Industries annual Christmas party is unforgettable, as the lives of four people who have barely interacted with one another in the past begin to cross paths in the most disturbing ways. By the time the party is over, they will be lucky if the skyscraper is still standing.",
        "Category": " Fiction , African American , Erotica",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Jiffy Phrasebook German (Book Only) (English and German Edition)",
        "Authors": "By Langenscheidt",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Langenscheidt Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Family Celebrations at Thanksgiving: And Alternatives to Halloween",
        "Authors": "By Hibbard, Ann",
        "Description": "",
        "Category": " Family & Relationships , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    }
]