[
    {
        "Title": "American Civil War Reports (American Civil War Reports: As Recorded in Harper's Weekly)",
        "Authors": "By Sidney Rudeau",
        "Description": "",
        "Category": "",
        "Publisher": "Historical Briefs, Inc.",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Civil War: A Treasury of Art and Literature",
        "Authors": "By SEARS, Stephen W. (Ed.)",
        "Description": "",
        "Category": "",
        "Publisher": "Hugh Lauter Levin Associates Inc.",
        "Price Starting With ($)": "9.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Great Battles and Leading Figures of the Civil War",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "JG Press",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Civil War - The Years Asunder",
        "Authors": "By Editors of Country Beautiful",
        "Description": "",
        "Category": "",
        "Publisher": "Country Beautiful",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Category Five",
        "Authors": "By T.J. MacGregor",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "A Pictorial History of the Confederacy",
        "Authors": "By Buchanan, Lamont",
        "Description": "",
        "Category": "",
        "Publisher": "Bonanza",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "COCO'S CANDY SHOP--WONDER WORLD BOOKS",
        "Authors": "By Beers, V. Gilbert",
        "Description": "",
        "Category": "",
        "Publisher": "Southwestern",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "How to Be a Good Dad",
        "Authors": "By Bly, Stephen A.",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "A Soft Place to Land: A Novel",
        "Authors": "By White, Susan Rebecca",
        "Description": "From the award-winning author of Bound South comes a powerful, moving novel of family loss and sisterly redemption.For more than ten years, Naomi and Phil Harrison enjoyed a marriage of heady romance, tempered only by the needs of their children. But on a vacation alone, the couple perishes in a flight over the Grand Canyon. After the funeral, their daughters, Ruthie and Julia, are shocked by the provisions in their will…not the least of which is that they are to be separated. Spanning nearly two decades, the sisters’ journeys take them from their familiar home in Atlanta to sophisticated bohemian San Francisco, a mountain town in Virginia, the campus of Berkeley, and lofts in Williamsburg, Brooklyn. As they heal from loss, search for love, and begin careers, their sisterhood, once an oasis, becomes complicated by resentment, anger, and jealousy. It seems as though the echoes of their parents’ deaths will never stop reverberating—until another shocking accident changes everything once again.",
        "Category": " Fiction , Sagas",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "The Very First Lord's Supper - Arch Books",
        "Authors": "By Ballman, Swanee and Streff, Michael (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Concordia Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Do-Si-Do with Autism",
        "Authors": "By Stup, Sarah Ann, Starchak, Matthew (ILT), and Sanders, Libby (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Health & Daily Living , General",
        "Publisher": "Trafford Publishing",
        "Price Starting With ($)": "6.53",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "No True Glory: A Frontline Account of the Battle for Fallujah",
        "Authors": "By West, Bing",
        "Description": "\"This is the face of war as only those who have fought it can describe it.\"–Senator John McCainFallujah: Iraq’s most dangerous city unexpectedly emerged as the major battleground of the Iraqi insurgency.  For twenty months, one American battalion after another tried to quell the violence, culminating in a bloody, full-scale assault.  Victory came at a terrible price: 151 Americans and thousands of Iraqis were left dead.The epic battle for Fallujah revealed the startling connections between policy and combat that are a part of the new reality of war.The Marines had planned to slip into Fallujah “as soft as fog.”  But after four American contractors were brutally murdered, President Bush ordered an attack on the city–against the advice of the Marines.  The assault sparked a political firestorm, and the Marines were forced to withdraw amid controversy and confusion–only to be ordered a second time to take a city that had become an inferno of hate and the lair of the archterrorist al-Zarqawi.Based on months spent with the battalions in Fallujah and hundreds of interviews at every level–senior policymakers, negotiators, generals, and soldiers and Marines on the front lines–No True Glory is a testament to the bravery of the American soldier and a cautionary tale about the complex–and often costly–interconnected roles of policy, politics, and battle in the twenty-first century.From the Hardcover edition.",
        "Category": " History , Military , United States",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Frommer's Switzerland (Frommer's Complete Guides)",
        "Authors": "By Porter, Darwin and Prince, Danforth",
        "Description": "Including detailed walking tours to guide you through the cobblestone streets of Zurich, Bern, Geneva, and Lucerne.Outspoken opinions on what's worth your time and what's not.Exact prices, so you can plan the perfect trip whatever your budget.Off-the-beaten-path experiences and undiscovered gems, plus new takes on top attractions.Find great deals and book your trip at Frommers.com",
        "Category": " Travel , Europe , Switzerland",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "We Were Soldiers Once...and Young: Ia Drang - The Battle That Changed the War in Vietnam",
        "Authors": "By Moore, Harold G. and Galloway, Joseph L.",
        "Description": "Each year, the Commandant of the U.S. Marine Corps selects one book that he believes is both relevant and timeless for reading by all Marines. The Commandant's choice for 1993 was We Were Soldiers Once . . . and Young. In November 1965, some 450 men of the 1st Battalion, 7th Cavalry, under the command of Lt. Col. Hal Moore, were dropped by helicopter into a small clearing in the Ia Drang Valley. They were immediately surrounded by 2,000 North Vietnamese soldiers. Three days later, only two and a half miles away, a sister battalion was chopped to pieces. Together, these actions at the landing zones X-Ray and Albany constituted one of the most savage and significant battles of the Vietnam War. How these men persevered--sacrificed themselves for their comrades and never gave up--makes a vivid portrait of war at its most inspiring and devastating. General Moore and Joseph Galloway, the only journalist on the ground throughout the fighting, have interviewed hundreds of men who fought there, including the North Vietnamese commanders. This devastating account rises above the specific ordeal it chronicles to present a picture of men facing the ultimate challenge, dealing with it in ways they would have found unimaginable only a few hours earlier. It reveals to us, as rarely before, man's most heroic and horrendous endeavor.",
        "Category": " History , Military , Vietnam War",
        "Publisher": "Presidio Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Brother Death",
        "Authors": "By Perry, Steve",
        "Description": "In the sequel to Black Steel in the Matador series, the ruling elite summons Bork, strongman of the Matadors, to save them from a secret brotherhood armed with the powers of an alien civilization. Original.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Lonely Planet Costa Rica Spanish Phrasebook (Phrasebooks) (Spanish Edition)",
        "Authors": "By Kohnstamm, Thomas",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Shall We Dance: Eight Classic Ballroom Dances in Eight Quick Lessons",
        "Authors": "By Golden, Manine Rosa",
        "Description": "Shall We Dance? is a fun and easy way to learn, whether you've admired ballroom dancing from afar or just need a refresher lesson. This elegant, entertaining, simple, step-by-step instruction course is the ideal way to master the eight most popular ballroom dances: the foxtrot, waltz, tango, cha-cha, samba, swing, rumba, and mambo.Each of the book's eight sections begins with a description of the dance and its origins, followed by a concise explanation of each dance pattern. These simple instructions are ingeniously designed so that the lead and follow steps are mirrored opposite one another on one spread, allowing the diagrams and instructions to be read by both partners simultaneously. This unique format lets you learn and practice face to face with your partner until you're dancing before you know it!",
        "Category": " Performing Arts , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Roadside Geology of the Yellowstone Country (Roadside Geology Series)",
        "Authors": "By Fritz, William J.",
        "Description": "",
        "Category": " Travel , United States , West , Mountain (AZ, CO, ID, MT, NM, NV, UT, WY)",
        "Publisher": "Mountain Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Awesome Knock-Knock Jokes for Kids",
        "Authors": "By Phillips, Bob",
        "Description": "\"Who's there?\" is the best set up line in comedy history. Now kids of all ages can knock hilarious jokes out of the fun park. Friends, family, and fellow-jokesters will be rolling in the aisles with laughter and secretly taking notes.This collection of the crazy and zany is from Bob Phillips—which means everyone who hears these comic gems will laugh hysterically and fall to the ground in awe of the most awesome knock-knocks ever invented.",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Ultimate Guide to Pampering Your Horse",
        "Authors": "By Evers, June V.",
        "Description": "Hundreds of easy ways to give horses extra love and attention.",
        "Category": " Pets , Horses",
        "Publisher": "Horse Hollow Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Marshall and the Heiress",
        "Authors": "By Potter, Patricia",
        "Description": "U.S. Marshal Ben Masters travels across the Atlantic to misty Scotland to guard the life of a four-year-old orphan, the lost heir of an ancient estate, whose beautiful aunt distracts him from his mission. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Fanfare",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Your First Quilt Book (or it should be!)",
        "Authors": "By Doak, Carol",
        "Description": "If you haven't got a clue about quilting, then this is the book for you! Written for beginning quiltmakers (and those who want to brush up on the basics), Your First Quilt Book introduces all the tools, supplies, and techniques you need to create simple patchwork quilts.Eight small projects are provided to help you practice your new hand- or machine-stitching skillsStep-by-step illustrations, a friendly, conversational style, and a generous dose of humor keep the learning easy and funTreat yourself to an enjoyable, anxiety-free first quilting experience and lay a solid foundation for your quiltmaking with this resource that you'll turn to again and again",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "That Patchwork Place",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Melted Coins (Hardy Boys, No. 23)",
        "Authors": "By Dixon, Franklin W.",
        "Description": "Frank and Joe Hardy suspect that their best friend Chet Morton is the victim of a summer school swindle and offer to help get his money back. While probing a baffling burglary at the Seneca Indian Reservation in New York State they investigate Zoar College located nearby. A startling connection between the Zoar College swindle and the theft of the Seneca’s gold tribal relic Spoon Mouth propels the teenage sleuths into a series of perplexing and dangerous situations.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Coconut's Guide to Life: Life Lessons from a Girl's Best Friend (American Girl Today)",
        "Authors": "By Pleasant Company (EDT)",
        "Description": "Coconut's positive, upbeat life lessons encourage girls to share the sunny spot, stick up for themselves, and appreciate the simple joys of life--perfect advice from a girl's best friend.",
        "Category": " Juvenile Nonfiction , Social Issues , General",
        "Publisher": "Amer Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "One Day in the Life of Ivan Denisovich",
        "Authors": "By ALEXANDER SOLZHENITSYN",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Sports Brain Teasers",
        "Authors": "By Holzschuher, Cynthia",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teacher Created Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Total Pilates (Total Series)",
        "Authors": "By Worth, Yvonne, Muirhead, Malcolm, and Rochford, Matthew",
        "Description": "Pilates is a unique method of conditioning based on the philosophy that the body and mind must work together to achieve overall fitness. Total Pilates presents a system for losing weight, sculpting long, lean muscles, and reshaping the body from head to toe. Easy-to-follow with over 200 full-color photographs, the instructions demonstrate the role of the body frame, the importance of body alignment, and the effects of breathing on performance.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Thunder Bay Press",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Dying Breath (Psychic Killer)",
        "Authors": "By Staub, Wendy Corsi",
        "Description": "A Seaside Retreat.  .  .    It's summer on the Jersey Shore. Children play on the beach. Husbands are off working in the city. And the surf echoes in the night. Here, in this perfect place, a serial killer has no worries in the world--except choosing the next victim.  .  .      Has Just Become.  .  .      Cam Hastings has come to Long Beach Island with her teenage daughter and the hope that maybe she can save her failed marriage. Cam has never stopped loving her husband Mike nor has she been able to outrun her flaws and demons--a vanished mother, a lost sister, and the ugly visions she has of missing children.  .  .      A Killer's Favorite Playground.  .  .    Now, Cam is about to step over the edge. For once, she will act on one of her visions--and then face the consequences. For a killer has just struck again. And for Cam, and the people she loves most, fear has come home for good.  .  .",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Don Winslow and the Scorpion's stronghold,",
        "Authors": "By Martinek, Frank Victor",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman Pub. Co",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "How to Study the Bible",
        "Authors": "By West, Robert",
        "Description": "You Know You Need To. . . Here&#39;s How This guide provides a brief, concise overview of personal Bible study for the layperson. Long-time Bible teacher Robert West gives insight into the types, tools, and techniques of personal study, offering both practical guidance and encouragement to pursue the command of 2 Timothy 2:15 (\"Be diligent to present yourself approved to God as a workman who does not need to be ashamed, accurately handling the word of truth\"). Covering topics such as:The inductive methodWord studiesCommentariesDictionaries and concordancesHow to Study the Bible also emphasizes the personal benefits of private Bible time!",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Value Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Good Husband Guide: 19 Tips for Domestic Bliss",
        "Authors": "By Ladies' Homemaker Monthly",
        "Description": "“A woman’s home is her domain, and as such, she should be treated like a queen.” This fun, retro volume shows husbands how to keep Her Royal Highness happy, and her tiara shiny and sparkling. When she moans and groans about her demanding responsibilities in and around the home, a woman rightfully deserves a lot of pampering. Here are all the secrets for keeping her happy: advice on tending the toddlers, keeping the house neat and tidy, fixing without asking, preparing special meals, why compliments and the right gift make wifey feel like the diva she deserves to be, valuable hints on making yourself more attractive for her, and much more.  The Good Husband Guide is a great gift for grooms-to-be or happily married men, for bachelor and bachelorette parties, and for bridal showers.",
        "Category": " Humor , Topic , Men, Women & Relationships",
        "Publisher": "Cider Mill Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Paula Deen's Kitchen Wisdom and Recipe Journal",
        "Authors": "By Deen, Paula H. and Cohen, Sherry Suib (CON)",
        "Description": "Hey there, y'all!   My favorite recipes came direct from my momma and grandmommas. I just love goin' through all the recipe cards they passed on to me and readin' their handwritten notes; it makes me remember our good times in the kitchen, gathered round the table. Sometimes, though, I need a little remindin' when it comes to writin' down my own recipes and recollections, so I've put together this darlin' little journal to get me (and you) started recordin'. I know I never forget a meal, but I also know that Jamie and Bobby aren't always listenin' to what I'm tellin' 'em.   So for you and the boys, I've included some tried-and-true recipes and some of my hard-learned tricks for gettin' out of culinary scrapes -- and Lord, honey, have there been a few. Whether it is a real disaster -- the boss and his wife are comin' over and the kitchen is full of smoke (no shame in servin' some takeout) -- or just an everyday bump in the road -- your husband didn't hear the buzzer, and the cake got a little dry in the oven (let some sugar water soak into those layers, and no one will know the difference) -- I've got your answer. Just get cookin' and let loose: nothin' makes memories like the smell of home-cooked meals. Jot down your ingredients and your musings, cut out a recipe card or two to share with friends, keep track of who came to dinner, who liked what, and who laughed the loudest; remember the good times and learn from the bad. Like I always say, there's not much in life you can't learn in the kitchen.   Paula Deen",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "A Precious Jewel",
        "Authors": "By Balogh, Mary",
        "Description": "New York Times bestselling author Mary Balogh weaves a sensuous spell of romance that brings together the unlikeliest pair of lovers in the unlikeliest place of all–an infamous London house of pleasure. She was unlike any woman he’d ever met in the ton or the demimonde. But Sir Gerald Stapleton frequented Mrs. Blyth’s euphemistically dubbed “finishing school” for pure, uncomplicated pleasure–and nothing else. So why was this confirmed bachelor so thoroughly captivated by one woman in particular? Why did he find himself wondering how such a rare jewel of grace, beauty, and refinement as Priss had ended up a courtesan? And when she needed protection, why did Gerald, who’d sworn he’d never get entangled in affairs of the heart, hasten to set her up as his own pampered mistress to ensure her safety–and have her all to himself?For Priscilla Wentworth, the path leading to Sir Gerald’s bed had been as filled with misfortune as it suddenly seemed charmed. But Priss couldn’t allow herself to believe she’d ever be more to a man like Sir Gerald than a well-cared-for object of pleasure. Now, despite Gerald’s deep distrust of marriage, neither scandal nor society’s censure can keep them apart–only the fear of trusting their hearts.",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Treasury Of American Mystery Stories",
        "Authors": "By McSherry, Frank D. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The Best of Signature Kitchens",
        "Authors": "By Homeowner, The Editors of",
        "Description": "As a showcase of Signature Kitchens & Baths magazine's top kitchens, The Best of Signature Kitchens provides a glimpse of 110 modern, state-of-the-art kitchens from leading designers around the country. With numerous possibilities, it is no wonder why this cornerstone space is one of the most commonly updated and renovated rooms for new and existing homeowners. Over 250 beautiful, full-color photographs and illustrated floor plans show readers how to turn any kitchen into a warm, inviting heart of the home.",
        "Category": " House & Home , Decorating",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Can't Fail Color Schemes--Kitchen & Bath: How to Choose Color for Stone and Tile Surfaces, Cabinets & Walls",
        "Authors": "By Wax, Amy",
        "Description": "Can't Fail Color Schemes--Kitchens and Baths addresses one of the most difficult decorating decisions a homeowner has to make when building or renovating a kitchen or bath: choosing colors for the many permanent--and expensive--materials and finishes. The so-called \"safe\" neutral route has many pitfalls...all beiges are not equal! As she did in Can't Fail Color Schemes, color expert Amy Wax explains how to look at color specific to stone, tile, laminate products, fixtures, and paint, and provides hundreds of palettes that homeowners can use to inspire and coordinate their own scheme or take along to a home center or showroom.",
        "Category": " House & Home , Decorating",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Hot Rocks",
        "Authors": "By Roberts, Nora",
        "Description": "From #1 New York Times bestselling author Nora Roberts comes a thrilling contemporary romance that “burns with all the brilliance and fire of a finely cut diamond”(Publishers Weekly).Antiques dealer Laine Tavish is an ordinary woman living an ordinary life. At least, that's what everyone in the small town of Angel's Gap, Maryland, thinks. They have no idea that she used to be Elaine O'Hara, the daughter of a notorious con man...Laine's past catches up with her when one of Big Jack's associates turns up in her shop with a cryptic warning and is then run down in the street. Now the next target of a ruthless killer, Laine teams up with sexy PI Max Gannon to find out who's chasing her, and why. The anwer lies in a hidden fortune that will change Laine's life forever...Don’t want the story to end? Look for Big Jack by #1 New York Times bestselling author J. D. Robb and continue the adventure with Lieutenant Eve Dallas.Hot Rocks was previously published in Remember When",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Queene of Light (Lightworld/Darkworld, 1)",
        "Authors": "By Armintrout, Jennifer",
        "Description": "In a time not long from now, the veil between fantasy and reality is ripped asunder—creatures of myth and fairy tale spill into the mortal world. Enchanted yet horrified, humans force the magical beings Underground, to colonize the sewers and abandoned subway tunnels beneath their glittering cities. But even magic folk cannot dwell in harmony, and soon two Worlds emerge: the Lightworld, home to faeries, dragons and dwarves; and the Darkworld, where vampires, werewolves, angels and demons lurk. Now, in the dank and shadowy place between Lightworld and Darkworld, a transformation is about to begin…. Ayla, a half faery, half human assassin, is stalked by Malachi, a Death Angel tasked with harvesting mortal souls. They clash. Immortality evaporates, forging a bond neither may survive. And in the face of unbridled ambitions and untested loyalties, an ominous prophecy is revealed that will shake the Worlds.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Schaum's Outline of Organic Chemistry",
        "Authors": "By Meislich, Herbert (EDT) and Hademenos, George",
        "Description": "The new edition of this study guide makes learning organic chemistry much easier than with the usual textbook, and it shows how organic chemistry is applied today in biological chemistry, medicine and industry. Grasping the concepts of this daunting subject is much easier with the clear, concise explanations backed up with hundreds of concrete examples. Students learn how to solve problems step-by-step; they can further hone their skills solving additional problems with answers.",
        "Category": " Science , Chemistry , Organic",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The GREÂ For DummiesÂ (Gre for Dummies)",
        "Authors": "By Vlk, Suzee",
        "Description": "\"I've recommended Suzee for ten years because her techniques deliver results.\" ? Jill Q. Porter, Educational Consultant \"A powerful learning tool that's fun to use.\" ? Kim Buchanan, Student, Escondido, CA \"Highly recommended. Finally, a test-prep book that's actually fun to read.\" ? Bettie B. Youngs, Ph.D., Ed.D., Del Mar, CAPractice on Two Complete Sample Tests ? Answers and Analysis Provided!Everything You Need to Do GREat! Using a fun and friendly format, The GRE® For Dummies®, 3rd Edition, reveals all the essential information you need to improve your scores and reduce test-taking anxiety. This newly revised edition has been thoroughly updated with all the latest tips, techniques, and strategies to help you ace either the traditional or new computerized version! With this indispensable guide at your fingertips, you'll be on the road to your graduate degree in no time! Face It and Ace It!Discover special study strategies for taking the computerized GRE examReincarnate two years of need-to-know math in a fraction of the timeHone your skills for deciphering antonyms and analogiesExtract pertinent information from reading comprehension passagesBeat the clock with valuable timesaving tipsReduce your stress and stay focused using special relaxation techniques ? before and During the testWhip your analytical skills into shape with a crash-course in logicRecognize trick questions and answer them correctlyAvoid the \"Ten Dumb Things You Can Do to Mess Up Your GRE\"",
        "Category": " Study Aids , GRE (Graduate Record Examination)",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "This Matter Of Marriage (MIRA)",
        "Authors": "By Macomber, Debbie",
        "Description": "Giving herself a year to meet Mr. Right, thirty-year-old Hallie shudders over her disastrous dates and sets her sights on handsome neighbor Steve Marris, who is trying to win back his ex-wife. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Cabinets, Shelves & Home Storage Solutions: 24 Storage Projects Plus Ideas for Organizing Your Home",
        "Authors": "By Hughes, Herb, Flexner, Bob, and Oberrect, Ken",
        "Description": "Today's homeowners are looking to create additional storage space in the home with the most design flair possible. Home Storage addresses a problem that is common to all homeowners: lack of adequate storage. The book presents the reader with the latest in storage solutions from some of the country's leading designers. The book also covers the latest in storage ideas and products. For the do-it-yourselfer, there are 24 fully illustrated projects for the kitchen, bath, bedroom, living room, and utility room to improve the storage possibilities of any home. An extensive techniques section provides the novice handyperson with the skills they will need to complete the projects.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Can't Fail Color Schemes: Color Guide for the Interior & Exterior of Your Home",
        "Authors": "By Wax, Amy",
        "Description": "Want to give your home a brand new look, but are unsure of how to coordinate the right colors to make it work? Well now there is a fresh new way of seeing color in this hard-hitting color design book. Can’t Fail Color Schemes features over 300 color photographs and more than 200 pages of working color schemes. Highlighted are important factors such as coordinating paint colors, textures, lighting effects and the psychology behind color.  Can’t Fail Color Schemes comes as a small spiral-bound book that is convenient to carry around and can be used as a color reference to be taken along when shopping for paint or furnishings. Swatches on the sides of the pages make it easy for color comparisons and compatibility. This workbook comes complete with concise text, a glossary, an index for quick reference, along with a comprehensive color guide containing a full spectrum of color for both interior and exterior designs. This impressive body of work provides valuable insight on color such as descriptions of complimentary colors, where they might work best, and what it is that makes them work together. Learn about hues and tones, accented colors, and much more with this handy guide to color.",
        "Category": " House & Home , Decorating",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Optical Illusions: Amazing Deceptive Images - Where Seeing Is Believing",
        "Authors": "By Menkhoff, Inga",
        "Description": "Looks at various types of optical illusions, including distortion illusions, motion illusions, color illusions and afterimages, and impossible objects and images.",
        "Category": " Art , Popular Culture",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Hidden Star (The Stars of Mithra)",
        "Authors": "By Roberts, Nora",
        "Description": "Hidden Star by Nora Roberts released on Dec 25, 2000 is available now for purchase.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Dead Sexy",
        "Authors": "By Ashley, Amanda",
        "Description": "In The Still Of The Night The city is in a panic. In the still of the night, a vicious killer is leaving a trail of mutilated bodies drained of blood. A chilling M.O. that puts ex-vampire hunter Regan Delaney on the case, her gun clip packed with silver bullets, her instincts edgy. But the victims are both human and Undead, and the clues are as confusing as the vampire who may be her best ally--she hopes. . .Master of the City, Joaquin Santiago radiates supernatural power like heat from a blast furnace, but he's never met a creature like Regan Delaney. She intrigues him, fires his hunger, and unleashes his desire, but before he can enter her world, or she his, they must confront a vicious, elusive killer who is an enemy even to his own. . .\"Sexy, fast-paced, gritty, this is Amanda Ashley at her best! A must read!\" --Ronda Thompson",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Zebra Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Complete Illustrated Rugs and Carpets of the World",
        "Authors": "By BENNETT, Ian, edited by",
        "Description": "",
        "Category": "",
        "Publisher": "Wellfleet Press",
        "Price Starting With ($)": "8.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "American Log Homes",
        "Authors": "By Thiede, Arthur and Teipner, Cindy",
        "Description": "This book features more than fifty photographs of log homes, floor plans for more than twenty homes, a concise history of log building in America, and suggestions for those interested in building a log home",
        "Category": " Architecture , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Lassie: Adventure in Alaska",
        "Authors": "By Elrick, George S.",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "It's Not Easy Being Mean (The Clique, No. 7)",
        "Authors": "By Lisi Harrison",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Curious George Takes a Trip (CGTV Reader)",
        "Authors": "By Rey, H. A.",
        "Description": "Curious George and his friend are going on vacation on an airplane. At check-in, the ticket clerk gives George a toy airplane to play with, but he soon loses it and has a few adventures trying to find it again. What an exciting start to his vacation! Learning concepts: modes of transportation Level one in Houghton's new Curious George reader line means that the text is minimal and simple, perfect for readers learning to sound out words while looking at the art for visual clues.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Evening Star (Star Series)",
        "Authors": "By Coulter, Catherine",
        "Description": "Sent to Rome to prevent her marriage to a vicious fortune hunter, Giana Van Cleve, an innocent beauty, finds herself the property of the highest bidder, the handsome, hot-blooded American, Alex Saxon, after the infamous Roman Flower Auction. Reissue.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Calypso Magic (Magic Trilogy)",
        "Authors": "By Coulter, Catherine",
        "Description": "While visiting London, a beautiful young woman becomes homesick for the West Indies. Unfortunately, her only available chaperone for the perilous journey is her rakish hot-tempered cousin...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Can't Fail Room Makeovers",
        "Authors": "By Samu, Mark and Samu, Luciana",
        "Description": "Filled with helpful advice on how to makeover a room, a practical handbook covers everything one needs to know to transform a room based on a range of time, budget, style, and taste considerations, with tips on color selection, furniture arrangement, lighting, art and collection display, accessories, and more. 25,000 first printing.",
        "Category": " House & Home , Decorating",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Complete Idiot's Guide(R) to Scrapbooking",
        "Authors": "By Smedley, Wendy",
        "Description": "You're no idiot, of course! You know that, in the end, our lives are really just scrapbooks--bits and pieces of our past, lovingly stitched together to become an emotional archive of who we are. But when it comes to assembling your photos and mementos into a valuable heirloom, you feel like you'll never have anything more elaborate than a tacky photo album. Don't scrap the idea  yet! The Complete Idiot's Guide to Scrapbooking shows you all you need to know to create a scrapbook you'll cherish forever... and that won't cut-and-paste away your time or money. In this Complete Idiot's Guide, you get:",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Lincoln: A Photobiography",
        "Authors": "By Freedman, Russell",
        "Description": "Abraham Lincoln stood out in a crowd as much for his wit and rollicking humor as for his height. This Newbery Medal-winning biography of our Civil War president is warm, appealing, and illustrated with dozens of carefully chosen photographs and prints.Russell Freedman begins with a lively account of Abraham Lincoln's boyhood, his career as a country lawyer, and his courtship and marriage to Mary Todd. Then the author focuses on the presidential years (1861 to 1865), skillfullly explaining the many complex issues Lincoln grappled with as he led a deeply divided nation through the Civil War. The book's final chapter is a moving account of that tragic evening in Ford's Theatre on April 14, 1865. Concludes with a sampling of Lincoln writings and a detailed list of Lincoln historical sites. This title has been selected as a Common Core Text Exemplar (Grades 2-3, Read Aloud Informational Text).",
        "Category": " Young Adult Nonfiction , Photography",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Invisible Man: A Grotesque Romance (Bantam Classics)",
        "Authors": "By Wells, H. G.",
        "Description": "Spine-tingling and entertaining, The Invisible Man is a science fiction classic–and a penetrating, unflinching look into the heart of human nature. To its author, H. G. Wells, the novel was as compelling as “a good gripping dream.” But to generations of readers, the terrible and evil experiment of the demented scientist, Griffin, has conveyed a chilling nightmare of believable horror. An atmosphere of ever-increasing suspense begins with the arrival of a mysterious stranger at an English village inn and builds relentlessly to the stark terror of a victim pursued by a maniacal invisible man. The result is a masterwork: a dazzling display of the brilliant imagination, psychological insight, and literary craftsmanship that made H. G. Wells one of the most influential writers of his time.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "The Tangent Factor",
        "Authors": "By Sanders, Lawrence",
        "Description": "Two men--one, a troubleshooter for an American oil company and the other, a ruthless power-hungry politician--square off in a duel fueled by greed and honor, but are united by one woman who loves them both. Reissue.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "101 Great Resumes",
        "Authors": "By Career Press, Inc. (EDT)",
        "Description": "Shows examples of effective resumes for specific situations, such as layoffs and reentering the job market, and various occupations, from nurse to stockbroker",
        "Category": " Business & Economics , Careers , Resumes",
        "Publisher": "Career Pr Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Guide to the Recommended Country Inns of New England: Elizabeth Squier",
        "Authors": "By Squier, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Globe Pequot Press",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Magnetism: What It Is and How Man Has Used It From Ancient Times to the Present",
        "Authors": "By Raymond Holden",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Kick Me: Adventures in Adolescence",
        "Authors": "By Feig, Paul",
        "Description": "Written in side-splitting and often cringe-inducing detail, Paul Feig takes you in a time machine to a world of bombardment by dodge balls, ill-fated prom dates, hellish school bus rides, and other aspects of public school life that will keep you laughing in recognition and occasionally sighing in relief that you aren’t him. Kick Me is a nostalgic trip for the inner geek in all of us.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Spooked! (A Spooky Lift-the-Flap Book)",
        "Authors": "By Faulkner, Keith",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "A Tapestry of Dreams",
        "Authors": "By Gellis, Roberta",
        "Description": "During the Scottish invasion of 1138, a brave knight known as \"The Unicorn\" captures the heart of Lady Audris, a mysterious woman who weaves prophetic visions of the future into magnificent tapestries",
        "Category": "",
        "Publisher": "Jove",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Promise Me Tomorrow (Hqn Romance)",
        "Authors": "By Camp, Candace",
        "Description": "Lord Lambeth is uncharacteristically captivated byMarianne Cotterwood, even though she's off-limits andkeeping secrets. Determined to unravel her mystery, hekeeps close watch.Alone in the world, Marianne wishes she could rememberher life before the orphanage. The only \"family\" she hasis a warmly eccentric bunch of pickpockets and thieves.Marianne's inborn grace makes her a natural at minglingamong the wealthy while looking for valuables, but thenLord Lambeth catches her in the act&#133;.Yet someone else is interested in Marianne's secrets, as well.A dangerous shadow from her past is closing in, andLord Lambeth is the only man she can turn to.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "New recipes for Italian favorites (Quick cuisine international)",
        "Authors": "By Anna Maria Victor",
        "Description": "",
        "Category": "",
        "Publisher": "Knapp Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Flavors of China",
        "Authors": "By Ferguson, Clare",
        "Description": "Forty delectable recipes for such fare as Drunken Chicken, Toffee-dipped Water Chestnuts, and Cold-tossed Noodles are accompanied by more than 150 full-color photographs and information on equipment and techniques.",
        "Category": " Cooking , Regional & Ethnic , Chinese",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Prayers",
        "Authors": "By Quoist, Michel",
        "Description": "",
        "Category": "",
        "Publisher": "NY : Sheed and Ward",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "French Wit and Wisdom",
        "Authors": "By beilenson, peter",
        "Description": "",
        "Category": "",
        "Publisher": "Peter Pauper Press ND",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "The Amazing Adventures of the Jewish People",
        "Authors": "By Dimont, Max I.",
        "Description": "Presents a history of the Jewish people throughout the ages.",
        "Category": " Religion , Judaism , History",
        "Publisher": "Behrman House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Beatrix Potter Deluxe Pop-Ups: Peter Rabbit (Pop-Up Book)",
        "Authors": "By Potter, Beatrix",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.2",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The Tale of Benjamin Bunny (Potter 23 Tales)",
        "Authors": "By Potter, Beatrix",
        "Description": "",
        "Category": "",
        "Publisher": "Warne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1904"
        }
    },
    {
        "Title": "Saddlebags (The Saddle Club, Book 42)",
        "Authors": "By Bryant, Bonnie",
        "Description": "After preparing their parents as best they can, a fierce rainstorm hits during the week of roughing it at the Bar None Ranch, and the girls must use their skills to rescue their parents from terrible danger. Original.",
        "Category": "",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Western Star (Saddle Club Super Edition No 3)",
        "Authors": "By Bryant, Bonnie",
        "Description": "The members of the Saddle Club spend their winter break at the Bar None Ranch, where each member of the club has an experience that teaches them all an unforgettable lesson about the true meaning of the holiday season. Original.",
        "Category": "",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Mary Beth's Haunted Ride (Riding Academy)",
        "Authors": "By Hart, Alison",
        "Description": "During a fun-filled Halloween weekend with the boys from Manchester School, novice rider Mary Beth must do some quick thinking when a boy from the masked costume party runs into danger during the Haunted Trail Ride. Original.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Skeletal Radiology: The Bare Bones",
        "Authors": "By Chew, Felix S.",
        "Description": "Written by an acknowledged master in the field, Skeletal Radiology: The Bare Bones is a succinct, focused, clinically oriented textbook in musculoskeletal radiology. It presents the core knowledge base in musculoskeletal imaging necessary for radiology residents and practitioners. Major sections focus on trauma, tumors and tumor-like lesions, joint disease, and miscellaneous topics such as developmental and congenital conditions, metabolic, endocrine, and nutritional conditions, infection and marrow disease, postsurgical imaging, and interventional procedures. Emphasis is on understanding how abnormalities on images mirror the specific anatomic and pathophysiologic features of diseases.This Third Edition includes all modalities in current use, including plain film, ultrasound, PET-CT, and much more MRI than previous editions. The book includes over 900 images selected from the teaching files and clinical case material at leading medical centers.",
        "Category": " Medical , General",
        "Publisher": "Raven Pr",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Those Who Knew Him: Profiles of Christ in Verse",
        "Authors": "By Morris, Gilbert, Myers, Stan D. (ILT), and Myers, Stan D.",
        "Description": "",
        "Category": "",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Planets: Planets",
        "Authors": "By Hasbrouck, Ellen K. and McDougall, Scott (ILT)",
        "Description": "Take a trip through the solar system and discover what¹s really up in the sky! Packed with fascinating facts about planets, comets, asteroids and more, Planets is a galaxy of fun for young astronomers...and everybody who gazes at the night sky!  Create your own universe and solar system with reusable stickers of the planets, asteroids, galaxies, and comets!",
        "Category": " Juvenile Nonfiction , Science & Nature , Astronomy",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "A Guest Is a Guest",
        "Authors": "By Himmelman, John",
        "Description": "Chaos prevails when the barnyard animals decide to live in the house with Farmer Beanbuckets and his family",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Dutton Books for Young Readers",
        "Price Starting With ($)": "7.5",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "A Children's Book About: Overdoing It (Help Me Be Good)",
        "Authors": "By Berry, Joy Wilt",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Enterprises",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Riddle of the Compass: The Invention that Changed the World",
        "Authors": "By Aczel, Amir D.",
        "Description": "The story of the compass is shrouded in mystery and myth, yet most will agree it begins around the time of the birth of Christ in ancient China. A mysterious lodestone whose powers affected metal was known to the Chinese emperor. When this piece of metal was suspended in water, it always pointed north. This unexplainable occurrence led to the stone's use in feng shui, the Chinese art of finding the right location. However, it was the Italians, more than a thousand years later, who discovered the ultimate destiny of the lodestone and unleashed its formidable powers. In Amalfi sometime in the twelfth century, the compass was born, crowning the Italians as the new rulers of the seas and heralding the onset of the modern world. Retracing the roots of the compass and sharing the fascinating story of navigation through the ages, The Riddle of the Compass is Aczel at his most entertaining and insightful.",
        "Category": " Transportation , Navigation",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Thrill Rides Top 10 Roller Coasters in America",
        "Authors": "By Shulman, Mark",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Story of Snow White and Other Tales",
        "Authors": "By Holeinone, Wolf",
        "Description": "",
        "Category": "",
        "Publisher": "Tormont Publications Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "P. Allen Smith's Container Gardens: 60 Container Recipes to Accent Your Garden",
        "Authors": "By Smith, P. Allen, Colclasure, Jane (PHT), and Quinn, Kelly (PHT)",
        "Description": "Just as stylish accessories bring a room to life, gorgeous planted containers are the finishing touch for every garden home. With this book, America’s favorite gardener, P. Allen Smith, shows how to create a beautiful container garden in a matter of minutes, in an innovative recipe-style format complete with ingredients lists, step-by-step planting instructions, and advice on how to effectively display these colorful accents.Beautiful and versatile, these container designs are the perfect solution for decks, porches, balconies, and gardens that need a focal point or a splash of color. Each container recipe fulfills one of the 12 Principles of Design that Allen established in his first bestselling book, P. Allen Smith’s Garden Home. As a result, the container will wonderfully frame the view from a window, offer a welcoming reception in an entryway, help to establish a sense of rhythm along a walkway, or extend your home’s color and décor into the garden. Allen shares the secrets he uses to make his eye-catching arrangements, as well as special planting and display tips for placement in your garden. The designs range from sophisticated to casual, yet the instructions are so easy to follow that you can assemble these containers in no time at all—even with little or no gardening experience. There are recipes for every season of the year, to ensure that you can enjoy lush container gardens year-round.A special resource section includes a complete plant directory, tips on how to select the right container to complement your garden’s style, grooming and plant-care guidelines, and basic instructions for planting pots, window boxes, and hanging baskets. Lavishly illustrated with more than 150 photographs, this book is sure to inspire seasoned gardeners as well as beginners interested in enhancing the beauty of their Garden Home with P. Allen Smith’s signature container designs.",
        "Category": " Gardening , Container",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Survival Guide for Christians on Campus: How to be students and disciples at the same time",
        "Authors": "By Willimon, William H. and Campolo, Tony",
        "Description": "The contemporary college campus is filled with spiritual surprises, daily dilemmas, and difficult questions. Will the Christian faith hold up under the scrutiny of the new knowledge and ideas that bombarded students on the college campus?   Tony Campolo and Dr. Will Willimon -- college professors and seasons authors and speakers -- insist that the Christian faith is not threatened by tough questions. They maintain that some of the greatest minds the human race has produced have put hard questions to Jesus and come away more firm in their faith and more convinced of its truth than ever before.   Whether you are a committed Christian or one who is still exploring the Christian faith, this book will provide sound answers to difficult questions. Open this book and find the help and heart to walk into the jungle of campus life and walk out more than a conqueror.",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Practical Guide to Growing Vegetables Fruit and Herbs",
        "Authors": "By Richard Bird",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "40 Days Living the Jesus Creed",
        "Authors": "By McKnight, Scot",
        "Description": "\"Scot McKnight stirs the treasures of our Lord's life in an engaging fashion. He did so with The Jesus Creed, and does so again with 40 Days Living the Jesus Creed. Make sure this new guide for living is on your shelf.\"--Max Lucado\"Love the Lord your God with all your heart, with all your soul, with all your mind, and with all your strength. And...love your neighbor as yourself.\"Scot McKnight has come to call this vital teaching of our Lord the Jesus Creed. He recites it throughout the day every day and challenges you to do the same. You may find that, if you do, you will learn to love God more creatively and passionately, and find new ways to love those around you.",
        "Category": " Religion , Christian Living , Inspirational",
        "Publisher": "Paraclete Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Culture Shock: A Reader in Modern Cultural Anthropology",
        "Authors": "By Philip K. Bock",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Once Upon a Kiss",
        "Authors": "By Ryan, R. C., Roberts, Nora (EDT), Gregory, Jill, and Willman, Marianne",
        "Description": "#1 New York Times bestselling author Nora Roberts presents four stories of love, passion, and desire. It all begins with a kiss...In Nora Roberts' \"A World Apart,\" a ravishing medieval Demon Slayer arrives in 20th century New York to brave a strange new world—and a man who will be her destiny.In Jill Gregory's \"Impossible,\" the battle between two warring families becomes a battle of the sexes when a bewitching beauty finds herself kidnapped by her sworn enemy.In Ruth Ryan Langan's \"Sealed with a Kiss,\" a woman's father may have given her hand in marriage to a fearsome warlord, but it’s his trusted warrior who captures her heart.In Marianne Willman's \"Kiss Me, Kate,\" a lovely American inherits an English manor and her dreams of romance come true when she meets an enchanted prince. But is he her one true love?",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Easy Composting (Environmentally Friendly Gardening)",
        "Authors": "By Ball, James, Kourik, Robert, and Spieckerman, Roberta (PHT)",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Barbarian",
        "Authors": "By French, Judith E.",
        "Description": "Living a life of privilege amid the exotic luxuries of ancient Alexandria, Roxanne is a woman with no memory of her past, with only flashes of images of an extraordinary man and a tiny baby to torment her, until her chamber is invaded by a seductive and savage stranger who could hold the key to her past--and her future. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Bed & Breakfast and Unique Inns of Virginia (The Bed & Breakfast and Unique Inns)",
        "Authors": "By Davis, Lynn Matthews",
        "Description": "",
        "Category": "",
        "Publisher": "John F Blair Pub",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Winning Low-Limit Hold'em (2nd Edition)",
        "Authors": "By Jones, Lee",
        "Description": "For the last ten years, Winning Low Limit Hold?em has been the reference standard introduction to Texas Hold?em. Experienced hold?em players give this book to their friends who want to learn the game. Recently updated and expanded to include coverage of online poker and no-limit hold?em single-table tournaments, this is the one book that you need to start your hold?em career. \"I always thought poker was a game of luck. After reading Lee's book and applying the techniques recommended, it was as if I were in The Matrix. It all came clear to me. I simply saw the truth at the poker table.\" - Antonio \"The Magician\" Esfandiari, Winner, 2004 L.A. Poker Classic and 2004 World Series of Poker $2000 Pot Limit Hold'em event. \"I wish this book had been out when I started playing hold?em, because it is a great way to learn the game. If you want to put yourself on the path to becoming a top hold'em player, Lee's book is the place to start.\" - Greg Raymer, Champion, 2004 World Series of Poker.",
        "Category": " Games , Card Games , Poker",
        "Publisher": "Conjelco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Fox All Week (Penguin Young Readers, Level 3)",
        "Authors": "By Marshall, James (ILT) and Marshall, Edward",
        "Description": "Fox is all ready for another exciting week. Will he get to go on a field trip, play games, and read books? Or will he have to eat tuna and wear a tie? The inimitable Fox has a different adventure for every day of the week in this Easy-to-Read paperback picture book.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Sculpture: Principles and Practice (Dover Art Instruction)",
        "Authors": "By Slobodkin, Louis",
        "Description": "\"Instruction and appreciation become one in this book.\" — School ArtsSculpture: Principles and Practice is one of the most authoritative and comprehensive books on the creation of sculpture. Unlike other instructional guides by people who have never had their fingers wet with clay, this book is the accumulation of many years of practical knowledge and experience by a noted American sculptor and art instructor.Mr. Slobodkin starts with the very basics of the art and leaves no area uncovered. He advises the novice what type of material is best to work with, and in a step-by-step process shows how to begin with elementary forms and proceed to the more complex, used for creating human figures, portrait heads, bas reliefs, and other forms of sculpture. Helpful instruction and diagrams of the proper procedure for constructing armatures and the proper methods for the use of tools are passed on to the reader along the way.When the use of clay and plasteline are well in hand, Mr. Slobodkin moves to the handling of more difficult materials. Plaster casting, wood carving, stone carving, terra cotta, metal sculpture, and architectural sculpture are all covered with hundreds of drawings and progressive photographs to add clarity. A most welcome aspect of this book is the author's witty and readable style. Technical passages never become oppressive, and words of encouragement and inspiration are offered frequently. One is well aware that the author was once a novice and facing the same difficulties himself. For the beginner this book is invaluable, but even those who have been sculpting for years will find the latter chapters full of helpful hints and useful information.",
        "Category": " Art , Sculpture & Installation",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "Palm OS Developer's Guide",
        "Authors": "By Jamsa, Kris A.",
        "Description": "Presents techniques for extending PC-based solutions to the Palm OS environment.  The author explains how to create Palm query applications (PQAs) that provide Palm OS device users with access the web-based content, simulate JavaScript operations within a Palm OS application to perform front-end processing for web clippings, retrieve PC-based e-mail without the need for Hotsync, display Adobe Acrobat PDF files on a Palm device, and integrate SQL databases and query operations within web clippings. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Hardware , Personal Computers , General",
        "Publisher": "McGraw-Hill Professional",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Our Amazing Sun (The Question and Answer Book)",
        "Authors": "By Boyd, Patti (ILT) and Adams, Richard Craig",
        "Description": "Questions and answers provide basic information about the central body of the solar system, including its distance from the earth, solar storms, and sunspots.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Censored 2007: The Top 25 Censored Stories (Censored: The News That Didn't Make the News -- The Year's Top 25 Censored Stories)",
        "Authors": "By Tomorrow, Tom (ILT), Phillips, Peter, Project Censored, and Jensen, Robert (INT)",
        "Description": "“Buy it, read it, act on it. Our future depends on the knowledge this collection of suppressed stories allows us.”—San Diego Review “Devastating evidence of the dumbing down of mainstream news in America. . . . Required reading for broadcasters, journalists, and well-informed citizens.”—Los Angeles Times “A terrific resource.”—Library Journal “For the smart and courageous news manager, this annual report is a virtual road map for the coming year’s news schedule. Many of these stories should, in an ideal news world, prompt deep and lengthy investigative efforts.”—The Village Voice “A distant early warning system for society’s problems.”—American Journalism Review The best-selling Censored series highlights the year’s twenty-five most important underreported news stories, alerting readers to deficiencies in corporate media and the resurgence of alternative media. Among the top censored stories of the year, Censored 2007 highlights the environmental and economic repercussions of Hurricane Katrina, the newest findings on global warming, escalating trends in human trafficking, and the use of napalm in Iraq.",
        "Category": " Reference , Yearbooks & Annuals",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Censored 2008: The Top 25 Censored Stories of 2006#07 (Censored: The News That Didn't Make the News -- The Year's Top 25 Censored Stories)",
        "Authors": "By Roth, Andrew (EDT), Phillips, Peter (EDT), Project Censored (EDT), and Loo, Dennis (INT)",
        "Description": "“Carefully orchestrated. . . . This well-researched work is highly recommended for most libraries.”—Library Journal (starred review)“Buy it, read it, act on it. Our future depends on the knowledge this collection of suppressed stories allows us.”—The San Diego Review“Required reading for broadcasters, journalists, and well-informed citizens.”—Los Angeles TimesThe best-selling Censored series highlights the year’s twenty-five most important underreported news stories, alerting readers to negligence of corporate media and the resurgence of alternative media. Peter Phillips, director of Project Censored, is an associate professor of sociology at Sonoma State University. He is known for his pieces in the alternative press and independent newspapers nationwide, such as Z Magazine and Social Policy. Project Censored, founded in 1976 by Carl Jensen, has as its principal objective the advocacy for and protection of First Amendment rights and the freedom of information in the United States.",
        "Category": " Reference , Yearbooks & Annuals",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Janette Oke's Reflections on the Christmas Story",
        "Authors": "By Oke, Janette",
        "Description": "A unique look at the birth of Christ through the eyes of a novelist reveals that the story of Christmas has all the ingredients of classic fiction--drama, suspense, love, conflict, tragedy, even a little humor. IP.",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    }
]