[
    {
        "Title": "A Piece of Cake",
        "Authors": "By Purdy, Susan Gold and Martin, Susan (ILT)",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Cakes",
        "Publisher": "Wiley",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Israel's fateful hour",
        "Authors": "By Harkabi, Yehoshafat",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "7.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Family Health and Emergency Guide (Time-Life Medical Guides)",
        "Authors": "By",
        "Description": "Gives step-by-step instructions for responding to everything from bleeding to poisoning to seizures, while guiding you through the causes, symptoms, and methods of healing for the most common illnesses",
        "Category": " Medical , Emergency Medicine",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Joy of Pasta (Barron's Educational Series)",
        "Authors": "By Famularo, Joe and Imperiale, Louise",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "501 German Verbs: Fully Conjugated in All the Tenses",
        "Authors": "By Strutz, Henry",
        "Description": "Includes a list of conjugated verbs, weather and idiomatic expressions, and an English-German index",
        "Category": "",
        "Publisher": "Barron's",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Omega Rx Zone: The Miracle of the New High-Dose Fish Oil",
        "Authors": "By Sears, Barry",
        "Description": "The Next Generation of the Zone!Dr. Barry Sears is one of the world's most trusted voices on health, diet, and nutrition. Over  the past decade, millions of people worldwide have followed his prescriptions for healthy  living through his bestselling books. He introduced the world to the Zone, a state of improved hormonal control that has helped a generation of people lose excess body fat, reverse the aging process, and fight heart disease and diabetes.In The Omega Rx Zone, Dr. Sears reveals a revolutionary new technological advance that helps treat chronic disease, improves athletic performance, and more. Never before available to the public, pharmaceutical-grade fish oil has the potential to make you a more emotionally stable, healthier person by allowing your brain to work at peak efficiency and controlling the hormonal responses that ultimately govern your body and mind. Drawing upon his own research as well as recently published studies, Dr. Sears shares new understanding of heart disease, cancer, depression, Alzheimer's, attention deficit disorder, chronic pain, Type 2 diabetes, infertility, and multiple sclerosis. Used in conjunction with the Zone program, these findings can help you to:Increase brain vitality and longevityMaximize physical performance Lose weight—and keep it offReverse chronic disease",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Art of Teaching Writing",
        "Authors": "By Calkins, Lucy McCormick",
        "Description": "When Lucy Calkins wrote the first edition of The Art of Teaching Writing, the writing workshop was a fledgling idea, piloted by a few brave innovators. Now, as she brings us this new edition, the writing workshop is at the foundation of language arts education throughout the English-speaking world. This new edition, then, could easily have been a restatement, in grander, more confident tones, of the original classic. Instead, it is an almost entirely new book.  Clearly, during the time in which Calkins's original ideas have spread like wildfire, her focus has not been on articulating and defending those ideas, but on developing and rethinking them. Respecting and responding to the questions which have arisen as thousands of teachers establish writing workshops in their classrooms, and drawing upon the latest knowledge in the field and her own intimate understanding of classroom life, Calkins has re-thought every line and every facet of her original text.  In this new edition, Lucy has major new chapters on assessment, thematic studies, writing throughout the day, reading/writing relationships, publication, curriculum development, nonfiction writing and home/school connections. More than this, she has deepened her understanding of the writing process itself: \"When I wrote the first edition, I saw writing as a process of choosing a topic, turning the topic into the best possible draft, sharing the draft with friends, then revising it. But I've come to think that it's very important that writing is a process not only of recording, but also of developing a story or an idea. Now, in this new edition, I describe writing episodes that do not begin with a topic and a draft but instead with something noticed or something wondered about. When writing begins with something that has not yet found its significance, it is more apt to become a process of growing meaning.\"",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Heinemann",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Fondue Cookbook",
        "Authors": "By Steer, Gina",
        "Description": "Fondue has enjoyed a rebirth of popularity among culinary trendsetters. This cookbook goes beyond the traditional bread-and-cheese routine--its 80 recipes feature fresh flavors from around the world, beautifully presented in mouthwatering color photos. The Fondue Cookbook is the perfect gift for hosts and hostesses, gourmet cooks, and even novice cooks.",
        "Category": " Cooking , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "InVision Guide to a Healthy Heart, The",
        "Authors": "By Tsiaras, Alexander",
        "Description": "Introducing the InVision Health Guides, the dramatic new way to look at our health. This groundbreaking book brings heart health insights to readers more vividly than most medical professionals have seen. While other heart books are text–heavy with standard images of the heart, this book offers a fabulous, full–color journey through the cardiovascular system using what author Alexander Tsiaras calls \"the science of visualization\" a groundbreaking visual technology that sees into body tissue in many dimensions and at multiple points in time. The result: stunning visuals that are not merely reflections of the surface of an object (a blood cell, artery, or a heart valve), but are dimensional renderings.  In this visually–driven health book, we see the heart in all its miraculous function, view what can go wrong, and learn options for achieving cardiovascular health. It reveals: o The development of the cardiovascular system from conception to birth o The marvel of the adult cardiovascular system and how it works o How hypertension and other risk factors insidiously damage this beautiful, powerful system o Surgical, medical, and lifestyle strategies for cardiovascular health By showing the astonishing beauty of the heart in action, this inspiring book makes the urgency of maintaining heart health real and relevant as never before.",
        "Category": " Health & Fitness , Diseases , Heart",
        "Publisher": "WmMorrowPB",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The United States Pony Club Manual of Horsemanship: Basics for Beginners - D Level (Book 1)",
        "Authors": "By Harris, Susan E.",
        "Description": "This book is written and illustrated for youngsters who want to learn to ride, especially those who are members of the U.S. Pony Clubs, Inc. and want to meet the USPC's Standards of Proficiency. If you are that youngster, you will be able to read this book on your own. It will show you how to become a careful, thoughtful rider and how to communicate with and understand your pony. Some sections, however, are meant to be read by an adult (a parent or riding instructor), so you can get the extra help you may need to reach your goals. By the time you have read this book you will know a lot about:* riding in a ring and in the open* beginning jumping* pony care and handling* safety* having fun and meeting challengesYou will also feel good knowing that you are on your way to being a horseman and not just a rider.",
        "Category": " Pets , Horses",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "A Traveler's Guide to Mars",
        "Authors": "By Hartmann, William K.",
        "Description": "In this extraordinary Baedeker—accessible, up-to-date, and prodigiously illustrated with photographs from Mariner 9, Viking, Pathfinder, the Hubble Space Telescope, and the ongoing mars Global Surveyor spacecraft—visitors will encounter:Olympus Mons, the largest volcano in the solar system, rising three times as high as Mount Everest and covering an area the size of MissouriTharsis Planitia, the \"high plains of Mars,\" with plains rising 29,000 feet—wide enough to cover Europe.Valles Marineris, an equatorial canyon so vast that America's Grand Canyon would be a mere tributary.Plus: the \"face\" on Mars, the White Rock, the \"Canals\" of Xanthe—and the first possible evidence of an ancient Martian life-form.",
        "Category": " Science , Astronomy",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Mars Pathfinder Approach to Faster-Better-Cheaper",
        "Authors": "By Pritchett, Price and Muirhead, Brian",
        "Description": "",
        "Category": "",
        "Publisher": "Pritchett, LP",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Best of Sunset: Over 500 All-Time Favorite Recipes from the Magazine of Western Living",
        "Authors": "By Sunset Books",
        "Description": "Gathers recipes for appetizers, soups, salads, meat, poultry, fish, shellfish, eggs, cheese, vegetables, pasta, sauces, dressings, preserves, breads, and desserts",
        "Category": " Cooking , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "I Always Look Up the Word Egregious by Nurnberg, Maxwell (1998) Hardcover",
        "Authors": "By Nurnberg, Maxwell",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Fruit Book",
        "Authors": "By Judy Bastyra, Julia Canning",
        "Description": "",
        "Category": "",
        "Publisher": "Bedford Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Glamour's Gourmet on the Run",
        "Authors": "By Kirby, Jane (EDT)",
        "Description": "Gathers quick, international style recipes for soups, sandwiches, salads, meat, poultry, rice, fish, shellfish, and desserts",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Villard",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "10 Essentials of Highly Healthy People",
        "Authors": "By Larimore, Walter L. and Mullins, Traci",
        "Description": "A must-have resource for pursuing wellness, coping with illness, and developing a plan to care for the health needs of life.For Yourself and Those You LoveExpert, current, and full of surprises. Medically reliable. Biblically sound.10 Essentials of Highly Healthy People is like having your very own health mentor to guide you in your total health picture, from treating illness and navigating the health care system to developing a proactive approach to vibrant health.You’ll see how to balance the physical, emotional, relational, and spiritual parts of your life to help you achieve maximum health. Whether you’re eighteen or eighty, you can become healthy—highly healthy.· Master 10 powerful principles for improving your well-being. · Discover the secret to becoming your own health care quarterback. · Chart your plan to improved health using the numerous self-assessments provided. · Learn the right questions to ask your doctors. · Gain the confidence to hire and fire your health care providers. · Explore the most reliable Internet resources available.The 10 principles in this book have made a life-changing—and in many cases a life-saving—difference for countless people. They can for you, too.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Sharon O'Connor's Menus and Music Before Dinner: A cookbook of hors d'oeuvres, Vol. 2",
        "Authors": "By O'Connor, Sharon",
        "Description": "",
        "Category": "",
        "Publisher": "Audio Partners",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Lust in Translation: The Rules of Infidelity from Tokyo to Tennessee",
        "Authors": "By Druckerman, Pamela",
        "Description": "An irreverent and hilarious journey around the world to examine how and why people cheat on their spouses; this global look at infidelity reveals that Americans are uniquely mixed up about being faithful.  It's an adulterous world out there. Russian husbands and wives don't believe that beach-resort flings violate their marital vows. Japanese businessmen, armed with the aphorism \"If you pay, it's not cheating,\" flock to sex clubs where the extramarital services on offer include \"getting oral sex without showering first.\"  South Africans may be the masters of creative accounting: Pollsters there had to create separate categories for men who cheat, and men who only cheat while drunk.  In America, however, there is never a free pass when it comes to infidelity.  According to our national moral compass, cheating is abominable no matter what the circumstances. But do we actually behave differently than everyone else?  Pamela Druckerman, a former foreign correspondent for The Wall Street Journal, decided to delve into this incredibly taboo topic.  She interviews people all over the world, from retirees in South Florida to Muslim polygamists in Indonesia; from Hasidic Jews in Brooklyn to the men who keep their mistresses in a \"concubine village\" outside Hong Kong.  Druckerman talks to psychologists, sex researchers, marriage counselors, and most of all, cheaters and the people they've cheated on, and concludes that Americans are the least adept at having affairs, have the most trouble enjoying them, and suffer the most in their aftermath.  Lust in Translation is a voyeuristic, statistics-packed, sometimes shocking, often hysterical, worldwide glimpse into the endlessly intriguing world of extramarital sex. It may be politically incorrect to say so, but who knew infidelity could be this fascinating?",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "World Food Thailand (World Food Series)",
        "Authors": "By Williams, Judy",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Thai",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Rats: All About Selection, Husbandry, Nutrition, Breeding and Diseases, With a Special Chapter on Understanding Rats (Complete Pet Owner's Manual)",
        "Authors": "By Skogstad, Karin (PHT), Daly, Carol Himsel, and Himsel, Carol A.",
        "Description": "Offers practical advice on keeping rats as pets, and includes information on their housing and health care",
        "Category": " Pets , Reference",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Down the Road",
        "Authors": "By Lewis, Earl B. (ILT) and Schertle, Alice",
        "Description": "Mama and Papa agree that eggs for breakfast would be nice, but they’re too busy to go to the store. So they decide that Hetty is old enough to go by herself. Although she practices walking smoothly up the hill so she won’t break the precious eggs, she can’t help running all the way down. Young readers will hold their breath as Hetty tries her very best to get those eggs home safely. “The story is remarkable for its evocative imagery, and the loving interchange between the characters sets a charming tone. The words are perfectly complemented by Lewis’s dazzling, impressionistic watercolors that show the joyous power of love and depict a warmly supportive world in which Hetty ventures forth toward independence. A fine book that speaks straight to the heart.”--Booklist",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The History Of American Sailing Ships",
        "Authors": "By Chapelle, Howard Irving",
        "Description": "As Hilary's home life deteriorates, her adventures with the book characters she reads about increases to the point where she knows she must learn to control her talents and involve herself more in the real world",
        "Category": " Science , General",
        "Publisher": "Bonanza Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Clueless in the Kitchen: A Cookbook for Teens and other Beginners (The Clueless series)",
        "Authors": "By Raab, Evelyn and Walker, George (ILT)",
        "Description": "You're young, you're hungry, you're clueless    The kitchen looms before you like something from a bad horror film. There's food in there, but then what? It'll have to be cooked... or at least peeled. Probably both. It's enough to scare even the foolhardy, but then so is a diet of macaroni and cheese. And you can't afford to keep ordering pizza. Aaarghh!    Relax! You're not alone. Author Evelyn Raab (mom to two teenage sons) understands that the kitchen is alien territory, and she is going to teach you everything you need to know to produce something deliciously edible out of actual ingredients -- in other words, cook -- and live to tell the tale.    Incredibly thorough, never condescending, and with a dash of humor, Clueless in the Kitchen leads culinary neophytes through the entire range of kitchen experience -- from cleaning a stove and            outfitting a first kitchen (cheaply), to unplugging a drain and identifying that stuff in the bulk-food bins. Two hundred easy-to-follow recipes show how to make all kinds of simple and scrumptious dishes for every meal and occasion, beginning with \"Breakfast: A Cruel Joke\" and ending with Snacks and Munchies.\" There's even a chapter devoted exclusively to the \"Vehemently Vegetarian.\"    And there's more! Each recipe is coded with an icon symbolizing vegetarian meals, cheap eats, couch potato, mom, or family food, food to impress, and snacks and munchies. And useful menu planners will help you tailor the perfect meal to every guest, whether that guest is your shallow but fun boy/girlfriend, your aunt Gladys, or (gasp!) your entire family.    Whether you're living on your own for the very first time or you're just on your own for dinner, Clueless in the Kitchen will be the first and -- hopefully -- only             guide you will ever need. You may never eat macaroni and cheese again!",
        "Category": " Cooking , Reference",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Banana Lover's Cookbook",
        "Authors": "By Lindquist, Carol",
        "Description": "Includes over eighty recipes for breads, breakfasts, appetizers, condiments, soups, salads, dressings, sandwiches, desserts, and main dishes made from bananas, as well as banana trivia and buying tips",
        "Category": " Cooking , Specific Ingredients , Fruit",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "What Cats Are",
        "Authors": "By Beals, Sharon and Beals, Sharon (PHT)",
        "Description": "With the same wit and captivating photography that made What Dogs Do such a success, Sharon Beals now turns her attention to cats. In these thirty playful images and one-word captions, Beals captures the essence of feline existence -- from \"dedicated\" (an industrious Burmese chomping a cardboard box) to \"adventurous\" (two kitties plumbing the depths of a full refrigerator) to \"dangerous\" (a slinky black beauty extending fierce-looking claws) -- making this a perfect and affordable gift or keepsake for any cat lover. Called \"shamelessly charming\" by American Photo, Beals's work will also entice any photography enthusiast with a soft spot for the small and furry.",
        "Category": " Pets , Cats , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Guinea Pigs a Complete Introduction",
        "Authors": "By Elward, Margaret",
        "Description": "",
        "Category": "",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "A Treasury of Peter Rabbit and Other Stories",
        "Authors": "By Potter, Beatrix",
        "Description": "A gift collection of the author's timeless classic works includes the tales of Peter Rabbit, Benjamin Bunny, Squirrel Nutkin, Two Bad Mice, and Jeremy Fisher.",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "A Newbery Halloween : A Dozen Scary Stories by Newbery Award-Winning Authors",
        "Authors": "By Greenberg, Martin Harry and Waugh, Charles G.",
        "Description": "A collection of thirteen scary stories by Newbery Medalists Beverly Cleary, Madeleine L'Engle, Paul Fleishman, Eleanor Estes, and E. L. Konigsbury, among others, provides thrills and chills, ghosts and witches, to make any Halloween perfectly spooky.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.91",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Younger Next Year: A Guide to Living Like 50 Until You're 80 and Beyond",
        "Authors": "By Crowley, Chris and Lodge, Henry S.",
        "Description": "Turn back your biological clock. A breakthrough book for men--as much fun to read as it is persuasive--Younger Next Year draws on the very latest science of aging to show how men 50 or older can become functionally younger every year for the next five to ten years, and continue to live like fifty-year-olds until well into their eighties. To enjoy life and be stronger, healthier, and more alert. To stave off 70% of the normal decay associated with aging (weakness, sore joints, apathy), and to eliminate over 50% of all illness and potential injuries. This is the real thing, a program that will work for anyone who decides to apply himself to \"Harry's Rules.\"Harry is Henry S. Lodge, M.D., a specialist in internal medicine and preventive healthcare. Chris Crowley is Harry's 70-year-old patient who's stronger today (and skiing better) than when he was 40. Together, in alternating chapters that are lively, sometimes outspoken, and always utterly convincing, they spell out Harry's Rules and the science behind them. The rules are deceptively simple: Exercise Six Days a Week. Eat What You Know You Should. Connect to Other People and Commit to Feeling Passionate About Something. The science, simplified and demystified, ranges from the molecular biology of growth and decay to how our bodies and minds evolved (and why they fare so poorly in our sedentary, all-feast no-famine culture). The result is nothing less than a paradigm shift in our view of aging.Welcome to the next third of your life--train for it, and you'll have a ball.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Total Wellness: Improve Your Health by Understanding the Body's Healing Systems",
        "Authors": "By Pizzorno, Joseph E.",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The Hillier Gardener's Guide to Trees and Shrubs",
        "Authors": "By Kelly, John A. (EDT)",
        "Description": "More than three thousand photographs are included in a reference guide to matching the right trees and shrubs with the right conditions and climate, accompanied by helpful tips on how to pick out the healthiest plants at the local nursery.",
        "Category": " Gardening , Trees",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.4",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Diabetes: Prevention And Cure",
        "Authors": "By Broadhurst, C. Leigh",
        "Description": "A geochemist plumbs the diet of our hunter-gatherer forebears for the secret to preventing and treating the modern epidemic of diabetes through a return to a healthier, more natural nutritional balance that can reverse the damage caused by diabetes. Original.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Cooking Light: Cookbook 1993",
        "Authors": "By Leisure Arts, Oxmoor House",
        "Description": "Presents a nutrition and calorie conscious guide to preparing food that includes more than 400 recipes, tips to lighten existing recipes, and consumer updates",
        "Category": " Cooking , Reference",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "The Home Workshop Planner: A Guide to Planning, Setting Up, Equipping, and Using Your Own Home Workshop (BETTER HOMES AND GARDENS WOOD)",
        "Authors": "By Schnaser, Gene",
        "Description": "A guide to starting or improving a home workshop includes money-saving tips and five sample floor plans",
        "Category": " Technology & Engineering , General",
        "Publisher": "Wood Books",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Best of Gourmet, 1988: All of the Beautifully Illustrated Menus from 1987 Plus over 500 Selected Recipes",
        "Authors": "By Gourmet (EDT)",
        "Description": "An anthology culled from issues of Gourmet magazine features menu plans for intimate and formal entertaining, and recipes for hors d'oeuvres, breads, soups, main dishes, side dishes, sauces, and desserts, as well as special presentations on the foods of specific areas",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The Rejection Collection: Cartoons You Never Saw, and Never Will See, in The New Yorker",
        "Authors": "By Diffee, Matthew (EDT) and Mankoff, Robert (FRW)",
        "Description": "Each week about fifty New Yorker cartoonists submit ten ideas, yielding five hundred cartoons for no more than twenty spots in the magazine. Arguably the most brilliant single-panel-gag cartoonists in the world create a bunch of cartoons every week that never see the light of day.   These rejects were piling up in the dusty corners of studios all over the country. Sam Gross, who has been contributing since 1962, has more than 12,000 rejected cartoons. (Seriously. He's been numbering every single cartoon he's ever submitted to The New Yorker since the very beginning.) Enter editor Matthew Diffee. He tapped his fellow cartoonists, asking them to rescue these hilarious lost gems. From the artists' stacks of all-time favorite rejects, Diffee handpicked the standouts -- the cream of the crap -- and created The Rejection Collection, a place where good ideas go when they die. Too risqué, silly, or weird for The New Yorker, the cartoons in this book offer something no other collection has: They have never been seen in print until now.   With a foreword by New Yorker cartoon editor Robert Mankoff that explains the sound judgment, respectability, and scruples not found anywhere in these pages, and handwritten questionnaires that introduce the quirky character of each artist, The Rejection Collection will appeal to fans of The New Yorker...and to anyone with a slightly sick sense of humor.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Essential Philosophy. Everything You Need to Understand the World's Greatest Thi",
        "Authors": "By james-mannion",
        "Description": "",
        "Category": "",
        "Publisher": "Adams Media Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Capital medicine, a tradition of excellence: An illustrated history of the Medical Society of the District of Columbia",
        "Authors": "By Paull, Nancy B",
        "Description": "",
        "Category": "",
        "Publisher": "Josten Pub. Group",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "20-Minute Yoga Workouts",
        "Authors": "By Christensen, Alice",
        "Description": "Would you like to have a shapelier, stronger, more flexible body?More energy? Better concentration? Less stress? Inner poise and contentment?Those goals are within the reach of everyone who will take a few minutes a day to practice the simple but powerful exercises in this book. 20-Minute Yoga Workouts enables everyone, from the busiest executive to the elderly, to enjoy the rewards of a Yoga practice. This easy-to-understand book, clearly illustrated with photographs, will teach you how to do:-- Powerful Yoga breathing exercises-- Gentle Yoga warm-ups-- Classic Yoga asans-- Deep relaxation and meditationIn addition to the basic 20-minute workout, there are also special workouts:-- For women during PMS, pregnancy, menstruation, and menopause-- For people in weight-loss programs and athletes-- For office and travel-- For seniors and those convalescing-- For people with physical ailments such as back and neck problems, high blood pressure and heart disease, chronic fatigue syndrome, asthma, and substance abuse problems",
        "Category": " Health & Fitness , Yoga",
        "Publisher": "Wellspring/Ballantine",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Home Food: 44 Great American Chefs Cook 160 Recipes on Their Night Off",
        "Authors": "By Shore, Debbie, Townsend, Catherine, Roberge, Laurie, and Share Our Strength (COR)",
        "Description": "A unique collection of previously unpublished recipes from forty-two of America's foremost chefs includes more than 150 delectable recipes, accompanied by cooking tips, ingredient information, and other tricks of the culinary trade. 25,000 first printing.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "My Sunday Best",
        "Authors": "By Fleischer, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Victory Era in Color! Rare Color Photographs of the World War II Years",
        "Authors": "By Ethell, Jeff",
        "Description": "At last, the lighter side of WWII in living color. Photos by soldiers, sailors, marines, and airmen offer a look at military training, entertainers and world leaders, and scenes from North Africa, Italy, China, Burma, and the Pacific theater, showing women and blacks in the armed forces and depicting life on the home front as well as homecoming scenes. For general readers and war buffs. Published by Reminisce Books, P.O. Box 990, Greendale, WI 53129. (800) 558-1013. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Motorbooks International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Porches & Sunrooms: Your Guide to Planning and Remodeling (Better Homes and Gardens(R))",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "One hundred full-color photographs complement a complete guide to planning, remodeling, and decorating a porch or sunroom space for the home, accompanied by dozens of inspirational ideas, construction tips, and decorating suggestions. Original. 90,000 first printing.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Fireplaces & Wood Stoves",
        "Authors": "By Sunset Books",
        "Description": "Explains the considerations for selecting, installing, and using fireplaces and wood stoves, and includes tips on selecting firewood and cutting your own supply",
        "Category": " Technology & Engineering , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "How to Grow African Violets",
        "Authors": "By Clark, David E.",
        "Description": "",
        "Category": "",
        "Publisher": "Lane",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Malcolm Hillier's Herb Garden",
        "Authors": "By Hillier, Malcolm",
        "Description": "Through the centuries, herbs have been cultivated in the kitchen garden for their flavors and healing properties. Here, in The Herb Garden, Malcolm Hillier reveals how these rewarding plants can be grown in traditional ways - or in the decorative garden, contributing an exciting range of colors, forms, and fragrances.Use Malcolm Hillier's imaginative - yet completely practical - layouts to unlock the design potential of these enchanting plants. His plans give gardeners a tremendous range of creative ideas for planting herbs in borders and containers, between paving stones and alongside paths, against walls or fences, and over arbors and arches.The fully illustrated directory at the back of the book recommends the author's 50 favorite herbs, those he uses most frequently in his own plantings. Each is illustrated in full color and described in concise notes that include information on herbal uses as well as all the essential cultivation instructions you need to grow these herbs. Let Malcolm Hillier help you turn your garden into a beautiful and useful herb garden.",
        "Category": " Gardening , Herbs",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "A Skating Life: My Story",
        "Authors": "By Hamill, Dorothy",
        "Description": "The dazzling smile, the signature haircut, the staple spin. \"America's Sweetheart\" Dorothy Hamill grew up on the ice, working toward the dream she was to accomplish by age nineteen: winning Olympic gold in figure skating. But life was not the picture of perfection it appeared to be. Dorothy faced a painful inner struggle from the time she was a young girl that followed her into adulthood--though she would not know about the depression that ran in her family until much later in life. Weeks and months away from home to train and compete took a difficult toll, yet little reprieve could be found in the tumultuous and fragile relationship she had with her parents. Dorothy went on to marry the man of her dreams, only to have the partnership end in heartache and a tragedy that almost pushed her to her breaking point. Then, just when a light at the end of the tunnel finally began to appear, a second failed marriage tried and tested Dorothy's trust and strength yet again--a travesty that could have led her to give up. But, she found a remarkable strength in what she did have--her greatest love, her daughter Alexandra. \"Thank goodness, I had my skating. There was certainly a pattern to my life. When times were tough, I went skating. It was only while I was out on the ice, enjoying the freedom of movement and my love of music, that I was able to escape from my bottomless heartache.\" In her deeply moving and honest memoir, Dorothy opens up for the first time about love, family, courage, and what it means to truly win both on and off the ice.",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Age of Recovery: The Fifteenth Century",
        "Authors": "By Johnson, Jerah",
        "Description": "",
        "Category": "",
        "Publisher": "Cornell University Press",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "Family Album: Knitting for Children and Adults (Taunton Books & Videos for Fellow Enthusiasts)",
        "Authors": "By Lovi, Steve (PHT), Fassett, Kaffe, and Hunt, Zoe",
        "Description": "In this combination how-to and inspirational book, Kaffe Fassett collaborates with fellow knitwear designer Zoe Hunt to create colorful garments for the whole family. There are 33 basic patterns grouped by motifs, which include squares and plaids, circles and dots, flowers, bows, and more. Eighty variations are fully illustrated; most are in stockinette stitch and easy to knit. Each chapter has a lively introduction by Fassett in which he describes the inspiration for the designs and gives advice on how to make a better finished garment.",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "I Love You, Mom: A Blue Mountain Arts Collection About Life's Greatest Gift...Having a Mom Like You",
        "Authors": "By Morris, Gary (EDT)",
        "Description": "",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Legal Briefs: Short Stories by Today's Best Thriller Writers",
        "Authors": "By Bernhardt, William (EDT)",
        "Description": "A collection of original and recently published short stories by eleven of America's most popular writers of courtroom thrillers includes the story of a guilty doctor by John Grisham and Richard North Patterson's tale of a young lawyer's loyalty to his mentor.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "A Picture Tour of the Smithsonian",
        "Authors": "By Lopez Ds",
        "Description": "",
        "Category": " Business & Economics , Museum Administration & Museology",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Weapons: An International Encyclopedia From 5000 B.C. to 2000 A.D.",
        "Authors": "By Diagram Group",
        "Description": "This definitive guide covers the entire history of weapons, from the earliest, most primitive instruments up to remarkable advances in modern defense and warfare, including:Riot-control devicesElectrified nightsticksInfantry weaponsMultiple-launch rocketsFiber-optic misslesWire-guided torpedoes\"Stealth\" technology",
        "Category": " Reference , Encyclopedias",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Say It in Russian (Revised) (Dover Language Guides Say It Series)",
        "Authors": "By Stepanoff, N. C.",
        "Description": "Contains over 1,000 useful sentences and phrases for travel or everyday living abroad: food, shopping, medical aid, courtesy, hotels, travel, and other situations. Gives the English phrase, the foreign equivalent, and a transliteration that can be read right off. Also includes many supplementary lists, signs, and aids. All words are indexed.",
        "Category": " Foreign Language Study , Russian",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The Lore of the Train",
        "Authors": "By Ellis, C Hamilton",
        "Description": "",
        "Category": "",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Islam and the West",
        "Authors": "By Lewis, Bernard",
        "Description": "Hailed in The New York Times Book Review as \"the doyen of Middle Eastern studies,\" Bernard Lewis has been for half a century one of the West's foremost scholars of Islamic history and culture, the author of over two dozen books, most notably The Arabs in History, The Emergence of Modern Turkey, The Political Language of Islam, and The Muslim Discovery of Europe. Eminent French historian Robert Mantran has written of Lewis's work: \"How could one resist being attracted to the books of an author who opens for you the doors of an unknown or misunderstood universe, who leads you within to its innermost domains: religion, ways of thinking, conceptions of power, culture--an author who upsets notions too often fixed, fallacious, or partisan.\"    In Islam and the West, Bernard Lewis brings together in one volume eleven essays that indeed open doors to the innermost domains of Islam. Lewis ranges far and wide in these essays. He includes long pieces, such as his capsule history of the interaction--in war and peace, in commerce and culture--between Europe and its Islamic neighbors, and shorter ones, such as his deft study of the Arabic word watan and what its linguistic history reveals about the introduction of the idea of patriotism from the West. Lewis offers a revealing look at Edward Gibbon's portrait of Muhammad in Decline and Fall of the Roman Empire (unlike previous writers, Gibbon saw the rise of Islam not as something separate and isolated, nor as a regrettable aberration from the onward march of the church, but simply as a part of human history); he offers a devastating critique of Edward Said's controversial book, Orientalism; and he gives an account of the impediments to translating from classic Arabic to other languages (the old dictionaries, for one, are packed with scribal errors, misreadings, false analogies, and etymological deductions that pay little attention to the evolution of the language). And he concludes with an astute commentary on the Islamic world today, examining revivalism, fundamentalism, the role of the Shi'a, and the larger question of religious co-existence between Muslims, Christians, and Jews.    A matchless guide to the background of Middle East conflicts today, Islam and the West presents the seasoned reflections of an eminent authority on one of the most intriguing and little understood regions in the world.",
        "Category": " Social Science , Islamic Studies",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Student Pilot's Flight Manual: Including Night Flying and Emergency Flying by Reference to Instruments: From First Flight to the Private Certifica",
        "Authors": "By Kershner, William K",
        "Description": "Advice on taking the FAA exam accompanies reviews of aerodynamic theory, navigation principles, instrument flying, weather analysis, and other aspects of private plane piloting",
        "Category": "",
        "Publisher": "Iowa State University Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "1979"
        }
    },
    {
        "Title": "Illustrated Encyclopedia Of The Worlds Steam Passenger Locomotives",
        "Authors": "By Hollingsworth, Brian",
        "Description": "Describes the historical development, operations, and technical specifications of the world's great steam passenger locomotives",
        "Category": " Science , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Secrets of the Royals",
        "Authors": "By Winter, Gordon and Kochman, Wendy",
        "Description": "Presents a compilation of facts, trivia, dates, and gossip about the lives and deaths of royalty",
        "Category": " History , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The Ancestor's Tale: A Pilgrimage to the Dawn of Evolution",
        "Authors": "By Dawkins, Richard and Wong, Yan",
        "Description": "With unparalleled wit, clarity, and intelligence, Richard Dawkins, one of the world's most renowned evolutionary biologists, has introduced countless readers to the wonders of science in works such as The Selfish Gene. Now, in The Ancestor's Tale, Dawkins offers a masterwork: an exhilarating reverse tour through evolution, from present-day humans back to the microbial beginnings of life four billion years ago. Throughout the journey Dawkins spins entertaining, insightful stories and sheds light on topics such as speciation, sexual selection, and extinction. The Ancestor's Tale is at once an essential education in evolutionary theory and a riveting read.",
        "Category": " Science , Life Sciences , Evolution",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "England For Dummies (Dummies Travel)",
        "Authors": "By Olson, Donald S.",
        "Description": "Great Britain is the top European destination for Americans, with some 4.8 million visitors making the trip across the Atlantic last year. England for Dummies will help you make the most of your stay, with information on the country's best and most unique experiences. This complete guide is your passport to the pubs of London, the stately homes and castles of Kent, the rugged coastline of Cornwall, and more. Whether you're a garden lover or a history buff, traveling solo or with a family, England for Dummies  pares down this vast country and helps you plan the trip that's right for you.England For Dummies is the recipient of a prestigious Lowell Thomas Award. Presented by the Society of American Travel Writers, the award recognizes outstanding publications in the field of travel journalism.",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The 3-Day Energy Fast: Cleanse Your Body, Clear Your Mind, and Claim Your Spirit",
        "Authors": "By Serure, Pamela",
        "Description": "Are you longing to change your life? To detoxify your body, to be renewed and replenished, but feel as if you don't have the time or the money? Now you don't have to go to a posh spa to rejuvenate -- you can restore yourselfin your own home in just three days.  Pamela Serure's The 3-Day Energy Fast makes available for the first time her legendary ultimate life detox program -- an integrated body, mind and spirit health plan that will help you get your juices flowing and feel physically renewed and spiritually replenished.Every one of us needs cleansing because we live in a world that is becoming increasingly toxic -- environmentally, chemically, physically, emotionally and spiritually. From the polluted air we breathe to the chemically laced food we eat, from the unfiltered water we drink to the negative relationships we tolerate, we are filled with toxins, but youcan  change the quality of your health. You can detoxify your body, and you can start doing it today.With The 3-Day Energy Fast you can clean yourself out, top to bottom -- mind, body and spirit. Say good-bye to all the chemicals and toxins trapped in your body, the negative ideas that are lodged in your head and the destructive behavior patterns that are ingrained in your psyche. Serure's program allows you to break with the past and create new beginnings.She offers an easy-to-follow three-part approach: \"The Fast\" shows how to make simple combinations of fruit and vegetable juices, along with easy vegetable mineral broths for the evenings; \"Meditating and Breathing\" offers exercises specifically oriented to the process of cleaning out emotional, spiritual and physical toxins, finding quick energy, calming down, balancing the body and spirit and helping to support fasting and healing; and \"Creating Ritual and Discipline in Your Life\" teaches you how to set up your own \"sacred space\" to which you can surrender your fears and dreams, and to schedule daily meditation and journal writing.By following this extraordinary plan, you will experience a new dimension of health, vitality, beauty and clarity, including a healthy body, clearer skin, brighter eyes, weight loss, enhanced energy, minimal anxiety and maximum creativity.The 3-Day Energy Fast  lights the path to an approach to food, wellness and spirituality that can last a lifetime.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Basic Horsemanship (Revised) (Doubleday Equestrian Library)",
        "Authors": "By Prince, Eleanor F. and Collier, Gaydell M.",
        "Description": "The first paperback edition of a popular standard guide to horsemanship, from first mount to competitive riding, plus all the key facts about horse care, feeding and grooming, English and Western tack, and more.B & W photographs and line drawings throughout.",
        "Category": " Sports & Recreation , Equestrian",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Entangled (Portraits Series #5)",
        "Authors": "By Peterson, Tracie",
        "Description": "Candidate in a heated election race, Cara Kessler, a young widow, relies on Lieutenant Harry Oberlin, a state trooper, for support",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Science at the Bedside: Clinical Research in American Medicine, 1905-1945",
        "Authors": "By Harvey, Abner McGehee",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "The Beanie Baby Handbook: 1998 Edition",
        "Authors": "By Fox, Sue and Fox, Les",
        "Description": "Describes Ty Inc.'s Beanie Babies characters and their hang tags, and charts their values",
        "Category": " Antiques & Collectibles , Teddy Bears & Stuffed Animals",
        "Publisher": "West Highland Publishing Co. , Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Taylor's Pocket Guide to Flowering Shrubs (Taylor's Pocket Guides)",
        "Authors": "By Taylor, Norman and Reilly, Ann (EDT)",
        "Description": "This guide will help gardeners choose the perfect shrub for particular climates and different soils. Growing tips are included for each of the 79 shrubs, as well as advice on transplanting and pruning.",
        "Category": " Gardening , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "The One-Minute (Or So) Healer: More Wisdom from the Sages, the Rosemarys, and the Times",
        "Authors": "By Ullman, Dana",
        "Description": "",
        "Category": " Medical , Alternative & Complementary Medicine",
        "Publisher": "Hay House Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Keeping Watch (Folly Island)",
        "Authors": "By King, Laurie R.",
        "Description": "Acclaimed as one of the most original talents to emerge in the last decade, award-winning author Laurie R. King returns to Folly Island to deliver her most stunning achievement yet--a breathtaking novel of suspense that explores the very essence of good and evil.Allen Carmichael came back from Vietnam a lifetime ago--but only now was he ready to return home. For years, he’s lived on the fringes of the law, using a soldier’s skills to keep watch over those too young to defend themselves.  Some consider him nothing but a kidnapper for hire--the best in the business; others call him a hero.  His specialty has been rescuing children from abusive parents and escorting them to loving homes.  But after twenty-five years, he is ready to take on his final case--a case that could destroy him. The boy’s name is Jamie: He believes his father is going to kill him. Allen is convinced that the twelve-year-old is right and devises a strategy to save him. His last job done, Allen heads back to Folly Island, where he plans to settle into a quiet life.  But not long after his return, a small plane piloted by the boy’s father’s crashes, leaving behind debris--but no body. Now it is up to Allen to resolve whether Jamie’s father is dead or alive--and to make sure Jamie himself stays out of harm’s way. But a series of ominous events leads Allen to question whether Jamie’s father is really the enemy after all. Or if the real threat is far more unspeakable...and the killer unimaginable.Riveting, harrowing, and unforgettable, Keeping Watch takes psychological suspense to its most dizzying heights and proves again why Laurie R. King has been called by both readers and critics an undisputed master of suspense.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Sometime Lofty Towers: A Photographic Memorial of the World Trade Center",
        "Authors": "By Rajs, Jake (EDT) and Hutchinson, Robert (EDT)",
        "Description": "Combines photographs of the Twin Towers taken at different times of day and from many viewpoints with similar photographs taken after their destruction that highlight their absence.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "See notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Knopf Collector's Guides: Silver & Pewter (The Knopf Collectors' Guides to American Antiques)",
        "Authors": "By Hausherr, Rosmarie and Fennimore, Donald L.",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "From Flappers to Flivvers...: We Helped Make the '20s Roar! (Reminisce Books Series)",
        "Authors": "By Bettina Miller",
        "Description": "",
        "Category": " Social Science , Customs & Traditions",
        "Publisher": "Reiman Assoc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Everest: Triumph and Tragedy on the World's Highest Peak",
        "Authors": "By Dickinson, Matt",
        "Description": "This book brings the world's mightiest peak alive in a way no traditional book can. Readers can chart a route on an early map of Everest, hold a Tibetan prayer flag like the ones generations of mountaineers have left at Everest's summit, and examine a dossier (complete with survival tips) for commercial clients attempting to climb the mountain. The pre–war attempts, the dangerous conditions, the recent discovery of long–lost climber George Mallory's body are featured, along with the history of the mountain, its geography, and the myths and legends which surround it.",
        "Category": " Sports & Recreation , Mountaineering",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Selected Poems and Two Plays of William Butler Yeats",
        "Authors": "By Yeats, W. B.",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Southern Africa in crisis",
        "Authors": "By O'Meara, Patrick (EDT) and Carter, Gwendolen M. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Indiana University Press",
        "Price Starting With ($)": "6.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Bedrock",
        "Authors": "By Alther, Lisa",
        "Description": "Successful photographer and urbanite Clea Shawn searches for the serenity and sobriety to cope with a sterile marriage, grown children, and years of empty affairs, as well as an understanding of herself and her feelings, in the rural town of Roches Ridge, Vermont",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "The Robot Builder's Bonanza: 99 Inexpensive Robotics Projects",
        "Authors": "By McComb, Gordon",
        "Description": "Describes useful tools, materials, and techniques and practical advice on power supply, robot locomotion, arm systems, grippers, optical sensors, sound detection, and collision avoidance",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "The Heiress Bride (Bride Trilogy)",
        "Authors": "By Coulter, Catherine",
        "Description": "After overhearing the handsome Scottish earl of Ashburnham complain that he must wed a wealthy woman, Joan Winthrop Sherbrooke introduces herself to the earl as an heiress. 50,000 first printing. $35,000 ad/promo.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Gel Candles: Creative & Beautiful Candles to Make",
        "Authors": "By Rankin, Chris",
        "Description": "All you need to do to work with this medium is melt and pour. The excitement is in the embellishing: tinting, scenting, or imbedding something surprising in the gel. Make a Christmas snow globe, wedding and birthday gifts, even glow-in-the-dark candles. Inspiring projects range from fun to funky—like a candle in a martini glass garnished with an olive—to simply beautiful (with gold angels inside).",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Strong Women Stay Young (Revised Edition)",
        "Authors": "By Wray, Wendy (ILT), Nelson, Miriam E., and Wernick, Sarah",
        "Description": "Turn back the clock in just two at-home sessions per week!This scientifically proven strength-training program:Replaces fat with muscleReverses bone lossImproves energy and balanceRevised--new streamlined program!The scientifically proven strength-training program that turns back the clock for women aged 35 and up--from the famed research labs of Tufts UniversityMiriam E. Nelson's research created worldwide news when the results were published in the Journal of the American Medical Association. After a year of strength training twice a week, women's bodies were 15 to 20 years more youthful. They had less fat and more muscle; bone loss was prevented or reversed; their strength and energy increased dramatically; and they showed surprising gains in balance and flexibility. No other program--whether diet, medication, or aerobic exercise--has ever achieved comparable results.Strong Women Stay Young shows how any woman can achieve the same benefits at home, in a program tailored to her individual needs. A bestseller in its first edition, it has now been revised to be even easier to use. It features eight streamlined exercises with fully illustrated instructions; new supplemental moves for the back, abs, and more; a complete program to do at the gym; plus an all-new chapter for men. Significant improvements are seen after just four weeks.Filled with inspiring quotes from women aged 35 to 92 who transformed their lives with this program, Strong Women Stay Young provides the information and motivation to make a real difference in women's lifelong health.Now revised, this new edition will include:A streamlined program for new readersNew state-of-the-art scientific informationNew options and more than a dozen supplemental exercises for expanding and individualizing the programSome information for men interested in this dynamic programAll the original reader-friendly aspects remain.  STRONG WOMEN STAY YOUNG is fully illustrated, and the step-by-step instructions are accessible and clear. Inspiring stories of women of all ages who transformed their lives with strength training are sprinkled throughout. Strong women do stay young--and reverse bone loss, increase energy, improve balance and flexibility--and this is the book to tell them how. -->",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Kingfisher Visual Factfinder",
        "Authors": "By n/a",
        "Description": "Illustrated articles provide information on stars and planets, the Earth, the living world, science and technology, world history, and countries of the world.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Kingfisher Books",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Lie by Moonlight",
        "Authors": "By Quick, Amanda",
        "Description": "Hired to tutor four orphaned girls at remote, ramshackle Aldwick Castle, Miss Concordia Glade is pleased to find her pupils both eager and bright. Indeed, they are bright enough to have noticed some oddities about their situation. Provided for by an unseen benefactor, they are surrounded at all times by hard-eyed guards in the guise of gardeners - and their previous tutor, she learns, disappeared under mysterious circumstances.Stepping into this uncertain atmosphere, Concordia sees at once what must be done. The plan is daring in scope and execution, but with the help of her four students, the great escape stands a good chance of success. Of course, even the best-laid plans can go awry ... and even the most independent, strong-minded lady must occasionally accept an offer of help.During an investigation into a woman's death, private inquiry agent Ambrose Wells finds himself on the castle grounds - and in the middle of chaos. The building is in flames. People are dead. And a woman and four girls are fleeing on horseback. A confirmed loner, Ambrose nevertheless finds himself taking Concordia and her students under his wing. His past has made him eminently suitable to protect them from the person behind the events at Aldwick Castle: a notorious London crime lord who will stop at nothing to destroy those who know his secrets.Their lives at risk, Concordia and the girls must remain saftely in hiding until Ambrose is able to unravel the dark conspiracy. But if the girls have learned anything from Miss Glade, it is the value of curiosity - a quality their teacher possesses in great abundance. She has never been one to sit back quietly and let others take care of her. As the danger cirlces ever closer, Ambrose and Concordia must work together to discover a way out of the darkness. In the process, they will learn a few lessons themselves - about stubbornness, courage, and love.",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Straight Herblock",
        "Authors": "By Block, Herbert",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "More Than a Mistress/No Man's Mistress",
        "Authors": "By Balogh, Mary",
        "Description": "More Than a MistressHe is the greatest matrimonial prize in all of Christendom, the scandalous Duke of Tresham.  When a young servant, Jane Ingleby, interferes with his duel, causing him to get shot, the duke enlists her as his nurse.  But Jane, far too bold and far too beautiful for her own good, questions the duke’s every move, scolds his bad manners, and touches his soul.  When he offers to set her up in his London town house, love is the last thing on his mind.  And hers. Their arrangement is strictly business- until suddenly everything changes…No Man's MistressFerdinand Dudley is accustomed to getting what he wants…that is, until he appears at the door of Pinewood Manor, attempting to claim his rightful estate, and is met by the bewitching fury of Lady Viola Thornhill.  She refuses to cede him the home she calls her own.  He refuses to leave.  So the contest begins between these two foes to force one to acknowledge the others claim.  Nor will they acknowledge the passion brewing between them.  But Viola knows it is a game she cannot afford to lose.  Marriage is out of the question and she will be no man’s mistress…",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Delta",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "A Question of Blood: An Inspector Rebus Novel",
        "Authors": "By Rankin, Ian",
        "Description": "There is no mystery. Lee Herdman stormed into a private school just north of Edinburgh and killed two boys. He was a loner, a creep, an army veteran who got kicks out of terrifying local teenagers on his speedboat - just the sort of shady character to commit a random and heinous crime. It's a simple case of a man gone mad.But how random were the killings at Port Edgar Academy? Why did Herdman open fire only in the student lounge, bypassing the swarm of students outside the school? What exactly was his relationship with the school's misfits? Why are military detectives snooping around the murder scene? And why is the only survivor of the attack, recuperating in the hospital, reluctant to talk?There is indeed a mystery - only this time, it's why.When Detective Inspector John Rebus is called out of his jurisdiction to investigate the killings, he is relieved to have the distraction. His entire precinct is abuzz with rumors of his involvement in the death of Martin Fairstone, an ex-con who had been menacing Rebus's partner, Detective Sergeant Siobhan Clarke.For weeks Fairstone tormented Siobhan: followed her home, left her cryptic messages, even threatened violence. But her woes didn't end when Fairstone died in a fire that consumed his apartment. Now Siobhan has a new worry - the morning after Fairstone's body was found, Rebus appeared with bandages on his severely burned hands. No one, not even Siobhan, can ignore the coincidence.Immersing himself in the Port Edgar killings does little to help Rebus avoid everyone's suspicion, but an unexpected family tie draws him deeper into the case. With his superiors at police headquarters breathing down his neck, his partner's trust diminishing, and the key witness to the entire private school inquiry staying silent in a hospital bed, Rebus finds himself up against what may become insurmountable odds, asking himself what drives a man to kill - is it a matter of revenge, or a question of blood?",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Coping with Prednisone (and Other Cortisone-Related Medicines): It May Work Miracles, but How Do You Handle the Side Effects?",
        "Authors": "By Zukerman, Eugenia and Ingelfinger, Julie R.",
        "Description": "Approximately one million Americans per year take high doses of prednisone and related drugs (glucocorticoids) to treat serious illnesses and conditions ranging from asthma to rheumatoid arthritis to kidney disease to organ transplantation. Wile these medicines may have unpleasant, even devastating side effects, including gastrointestinal problems, intense mood swings, changes in hair and skin, and increased susceptibility to infection, they may also be the only treatment available for serious or life-threatening illnesses.When the world-renowned flutist Eugenia Zuckerman was prescribed prednisone to combat a rare lung disease, she teamed up with her sister, Julie R. Ingelfinger, a well-known specialist in pediatric nephrology and hypertension at Massachusetts General Hospital in Boston, to write the first ever, comprehensive guide for patients undergoing this difficult treatment.Packed with everything your doctor didn't have time to tell you, including recipes, exercises, and tips based on personal experience, Coping with Prednisone is an invaluable handbook for health-care workers, caregivers, and especially for patients themselves.",
        "Category": " Medical , Drug Guides",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "His Dark Materials: The Amber Spyglass (Book 3)",
        "Authors": "By Pullman, Philip",
        "Description": "HIS DARK MATERIALS IS SOON TO BE AN HBO ORIGINAL SERIES STARRING DAFNE KEEN, RUTH WILSON, JAMES McAVOY, AND LIN-MANUEL MIRANDA!The unforgettable His Dark Materials trilogy that began with The Golden Compass'the modern fantasy classic that Entertainment Weekly named an \"All-Time Greatest Novel\" and Newsweek hailed as a \"Top 100 Book of All Time\"'and continued with The Subtle Knife, reaches its astonishing conclusion in The Amber Spyglass.Throughout the worlds, the forces of both heaven and hell are mustering to take part in Lord Asriel's audacious rebellion. Each player in this epic drama has a role to play'and a sacrifice to make. Witches, angels, spies, assassins, tempters, and pretenders, no one will remain unscathed.Lyra and Will have the most dangerous task of all. They must journey to a gray-lit world where no living soul has ever gone and from which there is no escape.As war rages and Dust drains from the sky, the fate of the living'and the dead'comes to depend on Lyra and Will. On the choices they make in love, and for love, forevermore.A #1 New York Times BestsellerWinner of the Whitbread AwardWinner of the British Book Award (Children's)Published in 40 Countries \"Masterful.... This title confirms Pullman's inclusion in the company of C.S. Lewis and Tolkien.\" 'Smithsonian Magazine\"Pullman has created the last great fantasy masterpiece of the twentieth century. An astounding achievement.\" 'The Cincinnati Enquirer\"War, politics, magic, science, individual lives and cosmic destinies are all here . . . shaped and assembled into a narrative of tremendous pace by a man with a generous, precise intelligence. I am completely enchanted.\" 'The New York Times Book Review\"Breathtaking adventure . . . a terrific story, eloquently told.\" 'The Boston Globe Don't miss Philip Pullman's epic new trilogy set in the world of His Dark Materials!** THE BOOK OF DUST **La Belle SauvageThe Secret Commonwealth",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Gentle Ben",
        "Authors": "By John Schoenherr",
        "Description": "Traces the friendship between a boy and a bear in the rugged Alaskan Territory.Fearing for his pet's life, young Mark Anderson tries to return a young bear to the Alaskan wilderness",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Martha Speaks",
        "Authors": "By Meddaugh, Susan",
        "Description": "When Helen Finney feeds alphabet soup to Martha, her dog, Martha begins to speak, jabbering throughout Helen's favorite television programs and asking embarrassing questions.",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "If... (Questions For The Game of Life)",
        "Authors": "By McFarlane, Evelyn, Saywell, James, and Rosenthal, David (EDT)",
        "Description": "In an elegant, two-color format, punctuated with intriguing drawings, If . . . poses hundreds of questions ranging from practical to maddening, moral to hilarious.If you could spend one whole night alone with anyone in history, whom would you choose? If you could suddenly possess an extraordinary talent in one of the arts, which would you like it to be? If you could commit one crime without being caught, what crime would you commit? If your plane were about to crash and you had time to write one quick note, to whom would you write, and what would you say? If you could run any single company, institution, or organization in the world, which would you choose? These are but a few of the five hundred provocative queries from If . . . (Questions for the Game of Life).If . . . can be a wonderful after-dinner parlor game; it can serve as an icebreaker between new acquaintances; it can even help you better understand yourself, your dreams and aspirations, and the mysteries of life. After the hours of inquisitive thoughts and revelations inspired by If . . . (Questions for the Game of Life), you'll wonder, “If I had never picked up this book, what would have happened to me?”",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Mistress of Alderley: A Novel of Suspense (Barnard, Robert)",
        "Authors": "By Barnard, Robert",
        "Description": "Robert Barnard, one of the great contemporary masters of classic mystery, returns with a brilliant new tale of passion and deception.  Well-known actress Caroline Fawley has given up a successful stage and television career for love and life in the country. International business titan Marius Fleetwood can't marry her. He already has a wife, though he claims they are \"just friends.\" But Marius has done something very special for Caroline: he has \"bought\" her Alderley, an elegant country home. If he should die, he's arranged to leave her enough money to maintain the extensive house and gardens.  Of course, some inquisitive villagers would be happier if Caroline and Marius were respectably wed. People in small towns know all, and they will talk, especially about a glamorous actress. Caroline's adolescent children, Stella and Alexander, seem to accept Marius's weekend visits without distress. And older daughter Olivia, an opera singer on the rise, is too involved in her own career and romantic intrigues to express much interest in her mother's personal life.  Caroline is happy and the world is good. Until one day when Caroline's life begins to fall apart. First, a mysterious young man backpacking his way through the countryside arrives at the door. He says his name is Peter Bagshaw, but Caroline sees instantly that he must be related to Marius; perhaps he's even his son.  What else has Marius hidden from Caroline? Who is this man, Marius Fleetwood? Is everything about him a lie?  When a murder occurs, detectives Mike Oddie and Charlie Peace must probe the lives of numerous suspects who had good reason to kill. As always in a Barnard mystery, the fun is in the details, the characters, the twists. With big houses, wealth, opera, and obsessive devotion as some of his ingredients, Robert Barnard gives us a witty, richly nuanced novel worthy of the crime-writing star that he is.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Natural Cures and Gentle Medicines (That Work Better Than Dangerous Drugs or Risky Surgery)",
        "Authors": "By Frank W Cawood",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A Medical Publishing",
        "Price Starting With ($)": "5.95",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Secrets of Longevity: Hundreds of Ways to Live to Be 100",
        "Authors": "By Ni, Maoshing",
        "Description": "Looking to live a longer, happier, healthier life? Try eating more blueberries, telling the truth, and saying no to undue burdens. These are just a few of the hundreds of tips profiled in Secrets of Longevitya simple, no-nonsense approach to living longer. Dr. Maoshing Ni, doctor to Hollywood stars and a Tai Chi master specializing in longevity, brings together simple and unusual ways to live longer in this beautifully designed, chunky paperback, putting at the fingertips a host of proven ways to make anyone's stay on earth much, much happier.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Moments in Leadership: Case Studies in Public Health Policy and Practice",
        "Authors": "By DeBuono, Barbara, Ana Rita Gonzalez, Sara Rosenbaum (editors)",
        "Description": "",
        "Category": "",
        "Publisher": "Pfizer",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Anxiety, Phobias, & Panic: A Step-by-Step Program for Regaining Control of Your Life",
        "Authors": "By Peurifoy, Reneau Z.",
        "Description": "",
        "Category": " Self-help , Stress Management",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Time: D-Day: 24 Hours That Saved the World",
        "Authors": "By Time Magazine (EDT) and Hanks, Tom (INT)",
        "Description": "Personal eyewitness accounts of soldiers who participated combine with memorable combat photographs to provide a compelling look at the events of June 6, 2004, celebrating a pivotal battle in the history of World War II. 40,000 first printing.",
        "Category": " History , Military , World War II",
        "Publisher": "Time",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Take a Load Off Your Heart: 109 Things You Can Actually Do to Prevent, Halt and Reverse Heart Disease",
        "Authors": "By Piscatella, Joseph C. and Franklin, Barry A.",
        "Description": "Increase the odds of living longer with this bold, broad approach to cardiac health. A medically up-to-the-minute and easy-to-implement program, Take a Load Off Your Heart sets our four key steps to cardiovascular fitness, from assessing risk to managing stress, from improving diet to making a habit of exercise. It demystifies predictive markers such as trigylcerides and Syndrome X, and offers 109 simple, practical lifestyle tips - #22 Breathe deeply, #96 Drink black tea, #3 Increase your HDL level, #54 Walk briskly, #75 Give up dieting - for preventing, stabilizing and, yes, reversing heart disease.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "And Then You Die...",
        "Authors": "By Johansen, Iris",
        "Description": "Iris Johansen is a master storyteller whose thrilling novels go straight to the heart of suspense.  Now the celebrated New York Times bestselling author of Long After Midnight and The Ugly Duckling returns with her most nerve-shattering novel ever, a story of deadly greed and global terror.  A seasoned photojournalist, Bess Grady has honed her craft in the trouble spots of the world.  But witnessing the horrors of Somalia and Sarajevo hasn't prepared her for what awaits in a small-town paradise--as an easy assignment turns into a desperate journey into fear.Sunlight bathes the town square.  A balmy breeze is blowing.  Yet nothing else is as it should be.  The unimaginable has happened here, and Bess Grady and her sister Emily have unwittingly stumbled right into the middle of it.  As chaos and confusion reign, Emily disappears, Bess is taken captive--and escape seems impossible.  But when rescue comes from a totally unexpected source, Bess is unprepared for the chilling truth.Tenajo was a testing ground--the first stage in a twisted game plan designed to spread terror, at the cost of countless innocent lives.  It is the brainchild of ruthless conspirators whose next target may be the heartland of the United States.Now Bess must join forces with the intimidating stranger who led her out of Tenajo, a man whose motives are suspect, whose alliances are unclear, and whose methods have a way of leaving bodies in his wake.  For she will do anything--risk everything--to find her sister, to keep her family safe, and to stop the conspirators from completing their carefully orchestrated plan of destruction.Drawn from today's news and tomorrow's headlines, And Then You Die...  is top-flight suspense and hard-hitting entertainment, a surefire combination that will keep your pulse rate racing long after the last page is turned.  Iris Johansen, who has more than eight million copies of her books in print, has won many awards for her achievements in writing.  The bestselling author of The Ugly Duckling and Long After Midnight lives near Atlanta, Georgia, where she is currently at work on a new novel.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Global Shift: Reshaping the Global Economic Map in the 21st Century",
        "Authors": "By Dicken, Peter",
        "Description": "Now in a fully revised and expanded fourth edition, this comprehensive work is the definitive text on globalization. Students gain a solid understanding of the economic, political, and technological processes that are creating global shifts in economic activity and affecting local communities in highly uneven ways. Examined are the actions and interactions of two major groups of actors--transnational corporations and states--set within a volatile technological environment. Of special utility are detailed case studies of key global industries and more than 200 fully updated figures and tables. The fourth edition has been extensively rewritten to reflect the latest empirical and theoretical developments, and several entirely new chapters are included.New in the Fourth Edition*Increased attention to the globalization and anti-globalization debates*A new case study on the distribution industries: logistics, retailing, and e-commerce*Expanded coverage of developmental, environmental, and governance issues*Definitions and cross-referencing of key terms*Many additional maps, graphs, tables, and diagrams",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    }
]