[
    {
        "Title": "Past Joys",
        "Authors": "By Botto, Ken",
        "Description": "Metal cars and people and other toys from America's past are photographed in settings that accentuate their ability to evoke fantasies",
        "Category": "",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "Chieftain (MIRA)",
        "Authors": "By Ryan, Nan",
        "Description": "Leading his people to a reservation in Fort Sill, Oklahoma, where they will be safe, fierce Comanche warrior Shanaco finds himself captivated by Maggie Bankhead--a proud beauty from Virginia who has dedicated her life to teaching English to his people. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Black and Decker Advanced Home Plumbing: Hundreds of Step-by-step Photos",
        "Authors": "By The Editors of Creative Publishing Inter, Creative Publishing International",
        "Description": "• Reflects current Uniform Plumbing Code requirements; • Demonstrates steps to upgrade and add amenities; • Over 390 detailed, full-color photos and illustrations; • Easy-to-follow step-by-step instructions; • Learn to install new plumbing for a variety of situations; • Discover the most efficient methods for replacing old plumbing; • Select the best tools and materials; and • Master professional techniques and tips.",
        "Category": " House & Home , General",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Master of Wolves (Mageverse, Book 5)",
        "Authors": "By Knight, Angela",
        "Description": "Hailed as “exhilarating,”* “ passionate and hot,”** USA Today bestselling author Angela Knight’s supercharged romances combine heated passion with non-stop action. And she’s back with more werewolves and vampires—in a story too hot to handle… Jim London is outraged over the death of his friend, a fellow bounty hunter and werewolf—and thinks the police department of nearby Clarkston cooked up a phony story about Tony’s murder. The only way to find out is to go undercover. And, in his wolf form, Jim can do that better than anybody...There’s one complication, though. The new police-dog handler, Faith Weston, is sexy enough to bring out the animal in any man…",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Defining Moments: A Novel",
        "Authors": "By Thomas, Jacquelin",
        "Description": "From the Essence bestselling author of The Prodigal Husband comes an inspiring novel about one woman's spiritual journey to overcome the mistakes of her past-and face the truths of an inescapable future. A year ago, successful career woman Sheila Moore left her home on the South Carolina coast to escape the pain of loving a man who would never love her back-her married business partner, Jake. Now Sheila has returned to Charleston and the past, into the guarded lives of Jake and his suspicious wife, Tori, and into an unexpected journey to find peace, joy, and love.",
        "Category": " Fiction , Religious",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The New Hide or Seek: Building Confidence in Your Child",
        "Authors": "By Dobson, James C.",
        "Description": "From the moment they are born, children experience an unfortunate value system that reserves respect and esteem for a select few. Those who fail to measure up end up resigning themselves to a lifetime of feeling inadequate and inferior.Over the past twenty-five years, more than a million parents and teachers have benefited from Dr. James Dobson's insightful counsel in his classic Hide and Seek. Now revised and updated, and in paperback, this book provides a new generation of parents with practical pointers for raising self-confident, healthy children.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The ADVENTURES OF PINOCCHIO (DELUXE EDITION)",
        "Authors": "By Collodi, Carlo and Chiesa, Carol Delia (TRN)",
        "Description": "A wooden puppet full of tricks and mischief, with a talent for getting into and out of trouble, wants more than anything else to become a real boy",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "What I Did for Love (Wynette, Texas, 5)",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "“Writing with both sharp wit and terrific emotional warmth, Phillips delivers another of her supremely satisfying contemporary romances.”—Chicago Tribune Perennial New York Times bestselling author Susan Elizabeth Phillips is easily one of the most beloved authors of women’s fiction in America—and with her wonderfully witty What I Did for Love, she works her magic once again. Turning her satirical eye on Hollywood and the messy love triangles of its major superstars (think Jennifer Aniston, Brad Pitt, and Angelina Jolie), the incomparable Susan delivers a treasure of a romantic comedy that the Detroit Free Press calls “a laugh-out-loud tale,” and Publishers Weekly calls a “massively entertaining romp.” Read What I Did for Love and discover why Susan Elizabeth Phillips has won more Favorite Book of the Year Awards from the Romance Writers of America than any other author, including Nora Roberts.",
        "Category": " Fiction , Women",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Blue & White in Your Home",
        "Authors": "By Skolnik, Lisa and Victoria (New York, N. Y.) (EDT)",
        "Description": "Offers suggestions for using the colors blue and white in interior decoration in simple, formal, traditional, and modern settings.",
        "Category": " House & Home , Decorating",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Book of Short Stories 1",
        "Authors": "By Gorky, Maksim",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart & Winston",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1939"
        }
    },
    {
        "Title": "Conquering Adversity",
        "Authors": "By Novak, Christopher",
        "Description": "",
        "Category": "",
        "Publisher": "CornerStone Leadership Institute",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Knockdown",
        "Authors": "By Francis, Dick",
        "Description": "Jonah Dereham, English jockey turned horsebuyer, buys a steeplechaser at Ascot Sales for Mrs. Kerry Sanders and a tie-in with a horse-trading racket and murder for himself",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Marriage For Keeps",
        "Authors": "By Wilkins, Gina and Young, Karen",
        "Description": "Wedding bells ring in full force in this delightful trio of original romances that includes Karen Young's Jilted!, in which Rachel Winthrop's betrothed runs off with someone else the night before their wedding and she finds comfort in the arms of his brother. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Plan B 3.0: Mobilizing to Save Civilization (Substantially Revised)",
        "Authors": "By Brown, Lester R.",
        "Description": "In this updated edition of the landmark Plan B, Lester Brown outlines a survival strategy for our early twenty-first-century civilization. The world faces many environmental trends of disruption and decline, including rising temperatures and spreading water shortage. In addition to these looming threats, we face the peaking of oil, annual population growth of 70 million, a widening global economic divide, and a growing list of failing states. The scale and complexity of issues facing our fast-forward world have no precedentWith Plan A, business as usual, we have neglected these issues overly long. In Plan B 3.0, Lester R. Brown warns that the only effective response now is a World War II-type mobilization like that in the United States after the attack on Pearl Harbor.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Sleepers of Erin",
        "Authors": "By Gash, Jonathan",
        "Description": "Lovejoy, the antiques connoisseur stays one step ahead of homicidal antique dealers and braves assault, false arrest, kidnapping, blackmail, and murder in his madcap search for an ancient treasure",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "Do Black Leather Shoes Really Reflect Up?",
        "Authors": "By John R. Powers",
        "Description": "",
        "Category": "",
        "Publisher": "Popular Library",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "How To Draw Funny People - Pbk (How to Draw (Troll))",
        "Authors": "By McKay, Bob",
        "Description": "",
        "Category": "",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Government giveaways for entrepreneurs",
        "Authors": "By Lesko, Matthew",
        "Description": "Presents 300 government programs and 9,000 sources of free information, and offers tips on such topics as applying for money, getting help from a bureaucrat, the Freedom of Information Act, finding information on companies, and women entrepreneurs",
        "Category": "",
        "Publisher": "Information USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Time After Time: A Novel",
        "Authors": "By Hooper, Kay",
        "Description": "New York Times bestselling author Kay Hooper spins a tale of ageless love and the power of fate, in which dreams from the distant past imperil one woman’s search for a passion that transcends history.They first met in a darkened loft, in the middle of a blackout, but the power of attraction supplied all the juice that Alex Bennet and Noah Thorne required. Noah was Alex’s match in every way, while the onetime lion tamer turned world-class interior designer possessed just the air of wildness that Noah preferred in a woman. Inexorably, they found themselves drawn together. So why was each haunted by dreams of the other that seemed to hint at secret lives in bygone times and places–and a relationship fated to end in separation? For Alex, the solution may lie in a Gypsy fortune-teller’s prophecy. To repeat the past is the one thing neither of them wants–but how do you overcome the pull of a destiny that is stronger than time itself?",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Christmas Pearl",
        "Authors": "By Frank, Dorothea Benton",
        "Description": "Still spry at ninety-three, Theodora has lived long enough to see her family grow into an insufferable bunch of truculent knuckleheads. Having finally gathered the whole bickering brood together for the holidays at her South Carolina home, the grand matriarch pines wistfully for those extravagant, homey Christmases of her childhood. How she misses the tables groaning with home-cooked goodies, the over-the-top decorations, those long, lovely fireside chats with Pearl, her grandmother's beloved housekeeper and closest confidante. These days, where is the love and the joy . . . and the peace?But this is, after all, a magical time. Someone very special has heard Theodora's plea—and is about to arrive at her door with pockets full of Gullah magic and enough common sense to transform this Christmas into the miracle it's truly meant to be.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Stand-in Groom: A Novel",
        "Authors": "By Brockmann, Suzanne",
        "Description": "With a rare blend of humor, erotic tension, and dead-on emotional truth, New York Times bestselling author Suzanne Brockmann weaves this delightful romance of a man and woman brought together by chance, bound by choice, and in trouble deeper than they realize.Like a knight in a fairy tale, he appeared from out of nowhere and rescued her at the last moment. Now, sizing up the man who’d saved her purse and driven off her attackers, aspiring Boston entrepreneur Chelsea Spencer considered that this good-looking stranger could fit another role—not to mention a tuxedo—equally well. By the end of the week, Chelsea was scheduled to get married as a condition for earning the inheritance necessary to save her fledgling business. There was only one problem: She was short a groom.Johnny Anziano would have been satisfied with a date, but the woman he’d dashed in to save during a street mugging had proposed much more than that. For two weeks’ “work,” he’d earn $75,000 and a luxurious tropical island vacation. By saying a simple, meaningless “I do,” he could save Chelsea one more time. But this time they were facing something a lot more dangerous than a gang of street thugs—their attraction for each other.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Just One More Story",
        "Authors": "By Steer, Dugald and Moseng, Elisabeth (ILT)",
        "Description": "One story is never enough for this mother pig's group of little ones in a colorfully illustrated tale, which includes five mini books of bedtime tales bound onto the pages of the book.",
        "Category": " Juvenile Fiction , Animals , Pigs",
        "Publisher": "Dutton Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Dave Miller's Homebrewing Guide: Everything You Need to Know to Make Great-Tasting Beer",
        "Authors": "By Miller, David G.",
        "Description": "In this comprehensive guide to homebrewing, Dave Miller offers expert advice on the entire brewing process. With up-to-date techniques, simple definitions for unfamiliar terminology, and helpful diagrams demonstrating proper equipment layouts and methods, Miller includes everything you need to know to brew great-tasting beer at home. Clear enough for the novice, yet thorough enough to earn a home in the libraries of accomplished brewmasters, Dave Miller’s Homebrewing Guide is packed with useful information that will inspire you to take your beer to the next level.",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Worth the Risk: Partners\\The Art of Deception",
        "Authors": "By Roberts, Nora",
        "Description": "PartnersMatthew Bates had wanted Laurel Armand for years, but he was her professional nemesis, and the sultry Southern belle has always kept him at a safe distance. But when the rival reporters are forced to work together on a case of murder and madness down in steamy New Orleans, the sparks fly. Determined to get their story, Matt and Laurel find themselves in the path of a deranged killer, putting love and life on the line!The Art of DeceptionSupposedly he had come to her father's estate looking for respite. But was handsome Adam Haines really the man he pretended to be? Kirby Fairchild couldn't be sure. What she did know was that as the days and nights wore on, the attraction she felt for him was building, whether she'd wanted it to or not. Was she in danger of falling hard for a stranger who was even more practiced in the art of deception than she was?",
        "Category": " Fiction , Romance , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Countess Confidential",
        "Authors": "By Smith, Barbara Dawson",
        "Description": "New York Times bestselling author Barbara Dawson Smith mesmerizes readers once again in her latest novel of a woman forced to enter the aristocratic world she despises—only to find a man she can’t live without…Dear Reader,          This is the story of how I, a penniless upstart, became a countess.          I never set out to be the heroine in a romantic tale of derring-do. As a spinster of five-and-twenty, I was much too practical to imagine myself tracking a dangerous criminal or falling prey to ardent nonsense. Nor did I ever envision myself entering the gilded ballrooms of society where indolent aristocrats nibbled cake and traded gossip. But that was before my father was wrongfully imprisoned as a jewel thief.           Determined to uncover the true criminal, I posed as an impoverished widow and secured a post in the grand household of a noble family – the very family that had cruelly cast out my mother many years ago. Of course, they knew not who I was. To them, I was merely a servant, an invisible hireling. And little did I know, my daring plan would throw me into the path of Simon Croft, the almighty Earl of Rockford.           Arrogant, charming, and too handsome for his own good, he might have walked straight off a pedestal in a museum. I had no use for such a rogue, yet from the moment of our first meeting, he tempted my unruly heart. And soon, he threatened my schemes as well, for Simon had secrets of his own….           —Claire, the Countess of Rockford",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "daniel boone: hunter, trapper and indian fighter",
        "Authors": "By Lilian Moore",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "The New Professional Chef",
        "Authors": "By Culinary Institute of America",
        "Description": "The textbook details areas of professional food preparation and provides instruction, menus, and recipes for both the apprentice chef and the veteran",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "49.95",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Ansel Adams: Letters and Images, 1916-1984",
        "Authors": "By Adams, Ansel, Alinder, Mary Street, and Stillman, Andrea Gray",
        "Description": "Portrays the life of photographer Ansel Adams through his letters and works",
        "Category": " Photography , General",
        "Publisher": "Bulfinch Pr",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Diary of a Fly",
        "Authors": "By Cronin, Doreen and Bliss, Harry (ILT)",
        "Description": "This is the diary...of a fly. A fly who, when she's not landing on your head or swimming in your soup, is trying to escape her 327 brothers and sisters who are driving her crazy! Even though she's little -- just like her best friends Worm and Spider -- Fly wants to be a superhero. And why not? She walks on walls, sees in all directions at once, and can already fly! Doreen Cronin and Harry Bliss, the team behind the New York Times bestsellers Diary of a Worm and Diary of a Spider, reach hilarious heights with their story of a little fly who's not afraid to dream big. Really big.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "The Traffickers (Badge of Honor)",
        "Authors": "By Griffin, W. E. B. and Butterworth, William E., IV",
        "Description": "Griffin's popular Badge of Honor police series returns, with a story of murder and lawlessness as compelling as today's headlines. J ust as with his remarkable military novels, millions of readers have been captured by the rich characters and vivid realism of W. E. B. Griffin's police dramas. \"Griffin has the knack,\" writes The Philadelphia Inquirer. \"He sets his novel before you in short, fierce, stop-for-nothing scenes. Before you know it, you've gobbled it up.\" Homicide Sergeant Matthew Payne is used to murder, but lately there's been an awful lot of it in Philadelphia. A gangland shooting in a popular tourist location has left six dead, most of them innocent bystanders, and days later the body of a headless Latina turns up in the Schuykill River. Everybody assumes they're not related, but Payne can't shake the hunch that there's something more to it-and that hunch leads him far from the City of Brotherly Love to the Texas-Mexico border. There, he finds a world where the lines of law and order are murkier than he ever imagined possible, and the daily question is \" O Plato o Plomo?\" Silver or lead. Cash or death. Which will Matt Payne take? Or will he just go home, glad to be alive . . . ? Filled with authentic color and detail, this is a riveting novel of the men and women who put their lives on the line, from the cop on the beat to the commissioner himself. It's a story of fears, dangers, courage, loyalty, and genuine heroism: storytelling at its best.",
        "Category": " Fiction , War & Military",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Wrecker (An Isaac Bell Adventure)",
        "Authors": "By Cussler, Clive and Scott, Justin",
        "Description": "In The Chase, Clive Cussler introduced an electrifying new hero, the tall, lean, no-nonsense detective Isaac Bell, who, driven by his sense of justice, travels early-twentieth-century America pursuing thieves and killers . . . and sometimes criminals much worse. It is 1907, a year of financial panic and labor unrest. Train wrecks, fires, and explosions sabotage the Southern Pacific Railroad?s Cascades express line and, desperate, the railroad hires the fabled Van Dorn Detective Agency. Van Dorn sends in his best man, and Bell quickly discovers that a mysterious saboteur haunts the hobo jungles of the West, a man known as the Wrecker, who recruits accomplices from the down-and-out to attack the railroad, and then kills them afterward. The Wrecker traverses the vast spaces of the American West as if he had wings, striking wherever he pleases, causing untold damage and loss of human life. Who is he? What does he want? Is he a striker? An anarchist? A revolutionary determined to displace the ?privileged few?? A criminal mastermind engineering some as yet unexplained scheme? Whoever he is, whatever his motives, the Wrecker knows how to create maximum havoc, and Bell senses that he is far from done?that, in fact, the Wrecker is building up to a grand act unlike anything he has committed before. If Bell doesn?t stop him in time, more than a railroad could be at risk?it could be the future of the entire country. Filled with intricate plotting and dazzling set pieces, The Wrecker is one of the most entertaining thrillers in years.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "The Super So Fat, Low Fat, No Fat Cookbook",
        "Authors": "By Rohde, Betty",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Hunter, The Hammer, and Heaven: Journeys to Three Worlds Gone Mad",
        "Authors": "By Pelton, Robert Young",
        "Description": "The author recounts his travels in three war-torn areas of the globe. In Sierra Leone he witnesses the ravages of civil war and profiles the mercenaries, militias, and profit seekers that seek to use the war for their own goals. He visits another country's \"War on Terrorism\" as he travels the mujahedeen trails in Chechnya and witnesses the Russian attacks on Grozny. Finally, on the small South Pacific island of Bougainville, he seeks out the elusive leader of the guerilla movement seeking independence from Papua New Guinea. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Theory and Problems of Genetics (Schaum's Outline Series)",
        "Authors": "By Stansfield, William D.",
        "Description": "A systematic program of exercises provides instruction in aspects of genetics, such as heredity, the structure of DNA, evolution, and chromosome mapping",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Photographic Possibilities",
        "Authors": "By Hirsch, Robert",
        "Description": "Professional photographers and advanced students seeking to expand their skills will discover in this book both classic and progressive methods of creating and manipulating photographic images.  It is a single, reliable source for techniques, ideas, and images involving the contemporary use of alternative photographic processes.Photographic Possibilities provides a single, reliable resourse for techiques, ideas, and images involving the contemporary use of alternative photographic procesesses.  Professional Photographers and advanced students seeking to expand their skills will discover both modern and classic methods of creating and manipulating the photographic image.Works by almost 100 of North America's top contemporary photographers illustrate the techniques disussed.  Photographic Possibilitites offers the reader both the information and the inspiration to create great photographs.This book offers the best of all worlds; it is inspired by fine art and its approach is down to earth and practical.  Step by step instructions on historic and progressive processes are covered thouroughly and cocisely.",
        "Category": " Photography , Techniques , Digital",
        "Publisher": "Focal Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Termination Point (Super Bolan)",
        "Authors": "By Pendleton, Don",
        "Description": "Mack Bolan prepares for the ultimate confrontation with the sinister cult called the Path as the maniacal fanatics set their sights on destroying the visiting Russian president, with the help of two stolen nuclear warheads. Original.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Windfall: ImpulseTemptation",
        "Authors": "By Roberts, Nora",
        "Description": "ImpulseFor once in her life, Rebecca Malone decided to follow her impulses, jettison the familiar and head to Greece to find adventure! So when a sexy stranger began to romance her, she couldn't resist playing the sophisticated, well-traveled woman. However, falling in love with Stephen Nickodemus was not part of the plan! How on earth could she explain to the man she'd given her heart to that she wasn't the woman he'd believed her to be? And then convince him that she was still the woman he loved….TemptationSocialite Eden Carlborough didn't expect running a girls' camp to be easy, but she never thought she'd literally be run up an apple tree by the little monsters. She was equally surprised to come crashing down into the capable arms of orchard owner Chase Elliot. While her handsome neighbor's overbearing ways were highly irritating, his touch ignited feelings she'd never known. She never imagined she'd be so very…tempted!",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Crystal Flame",
        "Authors": "By Krentz, Jayne Ann",
        "Description": "Determined to avenge the deaths of her father and brother at the hands of Quintel, head of a rival house, Kalena falls in love with Ridge, the \"Fire Whip,\" who owes his loyalty to Quintel",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Southern Lights: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Danielle Steel sweeps us from a Manhattan courtroom to the Deep South in her powerful  new novel—at once a behind-closed-doors look into the heart of a family and a tale  of crime and punishment.  Eleven years have passed since Alexa Hamilton left the  South behind, fleeing the pain of her ex-husband’s betrayal and the cruelty of his  prominent Charleston family. Now an assistant D.A. in Manhattan, Alexa has finally  put her demons to rest, making a name for herself as a top prosecutor, handling the  city’s toughest cases while juggling her role as devoted single mom to a teenage  daughter.   But everything changes when Alexa is handed her latest case: the trial  of accused serial killer Luke Quentin. Sifting through mountains of forensic evidence,  Alexa prepares for a high-stakes trial…until threatening letters throw her private  life into turmoil. The letters are addressed to her beautiful seventeen-year-old  daughter, Savannah, whom Alexa has been raising alone since her divorce. Alexa is  certain that Quentin is behind the letters—and that they are too dangerous to ignore.  Suddenly she must make the toughest choice of all—and send her daughter back to the  very place she swore she would never return to: the place where her marriage ended  in heartbreak…her ex-husband’s world of southern tradition, memories of betrayal,  and the antebellum charm of Charleston.  Now, while Alexa’s trial builds to a climax  in New York, her daughter is settling into southern life, discovering a part of her  family history and a father she barely knows--from the ice-cold stepmother who stole  him away to a fascinating ancestry and a half-sister and half-brothers she comes  to love. As secrets are exposed and old wounds are healed, Alexa and Savannah, after  a season in different worlds, will come together again—strengthened by the challenges  they have faced, changed by the mysteries they have unraveled, and with Savannah  now at home in the southern world her mother fled.  In this masterfully told tale,  Danielle Steel creates a stunning array of contrasts: from the gritty chaos of Manhattan’ s criminal court system to the seductive gentility of the South, from the rage of  a hardened criminal to the tender bond between a mother and daughter—and a loving  father who has welcomed Savannah home at last. A novel that will catch you off guard  at every turn, Southern Lights is Danielle Steel at her electrifying best.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Taste of Home 2009 Annual Recipes",
        "Authors": "By Bretl, Michelle",
        "Description": "",
        "Category": "",
        "Publisher": "Taste of home",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Discovering Enzymes",
        "Authors": "By Dressler, David and Potter, Huntington",
        "Description": "",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "The American Heritage College Dictionary",
        "Authors": "By American Heritage",
        "Description": "Our best-selling dictionary. With more than 200,000 clear definitions; over 20,000 new words; more than 2,500 illustrations; a style manual; 400 usage notes; regionalisms; an Appendix of Indo-European Roots; and biographical and geographic entries.",
        "Category": "",
        "Publisher": "Houghton Mifflin (T)",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Specialist: Revelations of a Counterterrorist",
        "Authors": "By Rivers, Gayle",
        "Description": "",
        "Category": "",
        "Publisher": "Charter",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "The Tax Inspector",
        "Authors": "By Carey, Peter",
        "Description": "The members of the Cathprice family--eighty-six-year-old matriarch Frieda; her daughter, Cathy; her son, Mort; and her grandson, Benny--find their way of life threatened when the tax inspector arrives for an audit",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Strategic Planning for Public and Nonprofit Organizations: A Guide to Strengthening and Sustaining Organizational Achievement (Jossey Bass Public Administration Series)",
        "Authors": "By Bryson, John M.",
        "Description": "Shows leaders and managers of public and nonprofit organizations both how and why they should use strategic planning to improve the performance of their organizations. This expanded edition includes many examples to illustrate both successful and unsuccessful planning efforts, while new chapters address planning implementation, strategy evaluation and reassessment, and key leadership roles vital to effective strategic planning. In addition, the author presents a planning process used successfully by many public and nonprofit organizations--the Strategy Change Cycle--along with detailed guidance on its application.",
        "Category": " Business & Economics , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.96",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Taste of Home Quick Cooking Annual Recipes 2009",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Taste of Home Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Cooking Light Annual Recipes 2005",
        "Authors": "By Averett, Heather (EDT)",
        "Description": "Offers a new ninth compilation of more than nine hundred recipes from the pages of Cooking Light magazine, enhanced by step-by-step instructions, colorful illustrations, nutrient analyses, food facts and trends, ingredients guidelines, and menu suggestions. 100,000 first printing.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Blogs, Wikis, Podcasts, and Other Powerful Web Tools for Classrooms",
        "Authors": "By Richardson, Will",
        "Description": "For both novice and experienced \"techies,\" this practical resource shows how to use blogs and other new Web tools for innovative, interactive teaching and motivated learning.",
        "Category": " Education , Computers & Technology",
        "Publisher": "Corwin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "A Short History of Old Wye Church, Two-Hundred and Fiftieth Anniversary",
        "Authors": "By Perry, William Graves",
        "Description": "",
        "Category": "",
        "Publisher": "Old Wye Church",
        "Price Starting With ($)": "8.86",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Leadership in Organizations (4th Edition)",
        "Authors": "By Yukl, Gary A.",
        "Description": "Focusing on managerial leadership, the author presents a broad survey of theory and research intended to please both academics and practitioners.  New chapters discuss leading teams, leading change, follower-based approaches to leadership, and developing leaders. Other updates include expanded information on topics such as strategic leadership, influence processes, self-managed teams, distributed leadership, and being a good follower; and more practitioner guidelines to help managers apply the theory and research findings. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The How To Grants Manual: Successful Grantseeking Techniques for Obtaining Public and Private Grants Third Edition (AMERICAN COUNCIL ON EDUCATION/ORYX PRESS SERIES ON HIGHER EDUCATION)",
        "Authors": "By Bauer, David G.",
        "Description": "Author David G. Bauer answers questions on proposals and funding opportunities in his new edition of the best-selling \"How To\" Grants Manual.The third edition of The \"How To\" Grants Manual clearly addresses the methods, new techniques, and procedures that will create a proactive grantseeking effort. At the same time, the reader will gain more understanding of the intricacies involved in winning grants and managing awarded funds. Bauer reveals how proposal writers can locate funding sources with like ideals, and how proposals can be written to link the interests of the funding source with those of the writer's organization, project, or program.The most recent changes in corporate philanthropy are discussed in this new edition, as are the best methods for approaching private and government funding sources - and the importance of following up on unsuccessful proposals. More sample letters and other documents have been included in this edition, as well as additional worksheets to help grantseekers write better proposals in less time.The \"How To\" Grants Manual also includes a special list of the best grants sources for beginning the process.",
        "Category": " Business & Economics , Nonprofit Organizations & Charities",
        "Publisher": "Praeger",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Quick and Easy Microwaving Secrets",
        "Authors": "By unknown",
        "Description": "Provides recipes for simple microwave dishes, demonstrates methods for melting, defrosting and reheating, and includes tips for all the important techniques of basic microwaving",
        "Category": " Cooking , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Food Processor Cooking: Quick and Easy",
        "Authors": "By Patent, Greg",
        "Description": "Presents over 150 recipes for food processor cooking, including appetizers, soups, pastas, quiches, salads, entrees, desserts, and more",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Beyond the Bestseller; a literary agent takes you inside the book business",
        "Authors": "By Curtis, Richard",
        "Description": "New York literary agent Curtis tells writers what they must know to get published and to not get taken advantage of by agents, publishers or the IRS. He discusses literary agencies, agent clout, movies into books, multibook deals, advances, book clubs, taxes, publication dates, and the matter of fees, royalties and expenses. No bibliography or index. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "New American Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Lonely Planet Paris (Paris, 2nd Ed)",
        "Authors": "By Robinson, Daniel and Wheeler, Tony",
        "Description": "Offers advice on theatre, music, entertainment, shopping, galleries, museums, restaurants and accomodations in Paris",
        "Category": " Travel , Europe , France",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Gifts for the Cookie Jar: Cookie Recipes for Ingredients in a Jar",
        "Authors": "By Wilson, Lia",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "Cookbook Resource, LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "New Webster's dictionary and Roget's thesaurus",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Book Essentials",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Holt Handbook",
        "Authors": "By Kirszner, Laurie G. and Mandell, Stephen R.",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Harcourt College Publishers",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The World Book of Word Power",
        "Authors": "By World BokEncycloprdia",
        "Description": "",
        "Category": "",
        "Publisher": "World Book Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Behind the Mask (MIRA)",
        "Authors": "By Hingle, Metsy",
        "Description": "Escaping to New Orleans after her husband tries to kill their young son, Lily Webster finds her new life shattered by the arrival of bounty hunter Michael Sullivan, who has been hired by her husband to find them, but when Michael realizes that he has put their lives in grave danger, he vows to protect them no matter what the cost. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Anchor Essay Annual: The Best of 1997",
        "Authors": "By Lopate, Phillip",
        "Description": "Anchor Books proudly launches an annual essay series.  Acclaimed essayist Phillip Lopate has selected the most surprising, important, and exquisite pieces published during the last twelve months.  Bringing together materials from both periodicals and books, The Anchor Essay Annual 1997 also includes essays never before published, as well as translations from abroad.  The result is as rich and unique as it is cosmopolitan.In her brilliantly frank \"Revelation\", Mary Gaitskill recounts the religious epiphany that changed her life.  Hilton Als explores the \"Negressity\" of his soul in \"My Pin-Up\".  In his dazzling \"The Laying Off of Desire\", Jean Baudrillard sets forth a flamboyant dissection of human sexuality.  Hubert Butler ruminates on the stunted life of his handicapped grandchild in \"Little K.\"  We relive the glories and disappointments of the Borscht Belt in Vivian Gornick's evocative group portrait, \"The Catskills Remembered\".  And we ride a rollercoaster of cultural insight in Daniel Harris's \"A Psychosexual History of the Homosexual Body\".  A a whole, this superb collection is a heady cocktail indeed.All of this exciting new work is placed in context with an illuminating introduction from Phillip Lopate, \"the house authority on the genre and its greatest practitioner\" (Washington Times).  With generous selections from over twenty-five writers from around the world, The Anchor Essay Annual 1997 is the first in what is sure to become a series widely anticipated and highly acclaimed, every October, for years to come.",
        "Category": " Literary Criticism , Reference",
        "Publisher": "Knopf Doubleday Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Duchess of Windsor",
        "Authors": "By Le Vien, Jack and Mosley, Diana",
        "Description": "An intimate biography examines the character of the enigmatic woman who was the object of such unsurpassed devotion from the Duke of Windsor that he renounced his family and country in order to stay with her",
        "Category": "",
        "Publisher": "Stein & Day Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "New York Times Dictionary of Misunderstood, Misused, & Mispronounced Words",
        "Authors": "By Urdang, Laurence",
        "Description": "Featuring over 10,000 of the most difficult and interesting words in the English language, this practical and unique volume is great for students and adults, fans of word games, linguaphiles, and linguaphobes.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Scarpetta Factor (A Scarpetta Novel)",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "From the world's #1 bestselling crime writer comes the extraordinary new Kay Scarpetta novel.    It is the week before Christmas. A tanking economy has prompted Dr. Kay Scarpetta-despite her   busy schedule and her continuing work as the senior forensic analyst for CNN- to offer her services pro bono to New   York City's Office of the Chief Medical Examiner. In no time at all, her increased visibility seems to precipitate a   string of unexpected and unsettling events. She is asked live on the air about the sensational case of Hannah Starr,   who has vanished and is presumed dead. Moments later during the same telecast, she receives a startling call-in   from a former psychiatric patient of Benton Wesley's. When she returns after the show to the apartment where she   and Benton live, she finds an ominous package-possibly a bomb-waiting for her at the front desk. Soon the   apparent threat on Scarpetta's life finds her embroiled in a surreal plot that includes a famous actor accused of an   unthinkable sex crime and the disappearance of a beautiful millionairess with whom Lucy seems to have shared a   secret past. Scarpetta's CNN producer wants her to launch a TV show called The Scarpetta   Factor. Given the bizarre events already in play, she fears that her growing fame will generate the illusion that   she has a \"special factor,\" a mythical ability to solve all her cases. She wonders if she will end up like other TV   personalities: her own stereotype. The Scarpetta Factor, the seventeenth in the series, finds the   familiar cast of characters together again in New York. Marino is working for the NYPD; Benton Wesley uses his   forensic psycho­logical expertise at Kirby and Bellevue; and Lucy continues to dazzle with her expertise in forensic   computer investigations as she works yet another case with NY prosecutor Jaime Berger.    Watch a Video",
        "Category": " Fiction , Crime",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "What A Gentleman Wants",
        "Authors": "By Linden, Caroline",
        "Description": "Two virtual strangers are swept into a sizzling, spellbinding world of daring deception and unexpected passion in Caroline Linden's thrilling new romance. . .What A Gentleman Wants Marcus Reese, Duke of Essex, has spent most of his life pulling his twin brother out of trouble. An occasional thank you would suffice; instead, his resentful sibling forges his name to a marriage license and presents him with an unwanted wife. She's a vicar's widow with a mind of her own who may be the first person in Marcus's well-ordered life to make him feel. . .completely out of control.Hannah can't help but curse her own idiocy. Dire straits have led her to the altar with a gentleman she hardly knows. Played for a fool, she's embarrassed, furious, and worse, married to an equally outraged stranger--an exasperating man who unleashes all manner of emotions in Hannah, not to mention unwanted desire. Reluctantly, she agrees to play the wife until he can sort out the mess. But the nearness of the undeniably attractive Duke and the passion in his black eyes unsettles her well-guarded heart--making her want to do so much more than \"act\" the role of blissful bride. . . Praise for Caroline Linden's What a Woman Needs \"A skillful blend of scorching sensuality and the tenderness that tempers passion. . .don't miss it!\" --Eloisa James,New York Times bestselling author",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "A STITCH IN TIME: A COCK ROBIN MYSTERY",
        "Authors": "By Lathen, Emma",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan and Co.",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The 30-Minute Writer",
        "Authors": "By Emerson, Connie",
        "Description": "A guide for aspiring writers with limited amounts of time discusses how to write personal essays, humor, opinion pieces, reviews, anecdotes, and other short works for specific markets and suggests a plan for using time efficiently",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Taking Sides: Clashing Views on Controversial Moral Issues (Taking Sides Clashing Views on Controversial Moral Issues, 6th ed)",
        "Authors": "By Satris, Stephen (EDT)",
        "Description": "",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "McGraw-Hill College",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Personality and Politics: Problems of Evidence, Inference, and Conceptualization.",
        "Authors": "By Greenstein, Fred I.",
        "Description": "",
        "Category": "",
        "Publisher": "Markham Publishing Co.",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "I Choose To Stay: A Black Teacher Refuses to Desert the Inner City",
        "Authors": "By Thomas-El, Salome and Murphey, Cecil",
        "Description": "The challenges of working in an urban school are not for every teacher. Some get burnt out fast. Some lose sight of why they started teaching in the first place. Some find their calling in other neighborhoods...with other kids. But not Salome Thomas-El. A Teacher at Roberts Vaux Middle School in Philadelphia's inner city, he chose to stay. Gripping, poignant, and homest, this is his blistering real-life tale of mentoring and making a difference—and how the reformation of America's educational system can start with just one school.Praise for I Choose To Stay\"An intensely moving story of loyalty and courage and a deeply pewrsonal tribute to the great potential of our inner-city kids, so frequently dismissed and denigrated by American society. The redemptive power of a teacher's love shines through these pages with prophetic grace. I am grateful to the author for the lesson of essential decency he teaches us\" --Jonathan Kozol\"This book is about courage. It is a story about determination, about compassion, love and the ultimate fight. This is the fight against the odds, against the 'system' and years of cultural, social and economic factors that would have allowed this group of inner-city kids to become nothing more than a set of statistics. But Salome Thomas-El would not let that happen. He would not give up. He saw the potential in them and he fought for them. he used a board game as a weapon in this figth.\" --From the forward by Arnold Schwarzenegger\"A powerful story about what an inspirational teacher can do to open new horizons for economically disadvantaged young people\" --William H. Gray, III, President, United Negro College Fund\"This book shows how one dedicated educator who believes in th potential of all our kids can make a huge difference and how, under teh proper circumstances, urban education can work.\" --Edward G. Rendell, former mayor of Philadelphia, Chairman of the Democratic National Convention\"An eloquent example of how commitment and innovation can better the lives of inner-city children.\" --Kirkus Reviews",
        "Category": " Education , Multicultural Education",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "At The Corner Of Love And Heartache",
        "Authors": "By Matlock, Curtiss Ann",
        "Description": "A heartwarming sequel to Cold Tea on a Hot Day follows Marilee James, who is engaged to Tate Holloway, the new editor of the Valentine Voice, as she begins having second thoughts about getting re-married, forcing her to make some tough decisions in order to find true happiness. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Vamps and the City (Love at Stake, Book 2)",
        "Authors": "By Sparks, Kerrelyn",
        "Description": "Who says a vamp can't have it all?  Darcy Newhart thought it was a stroke of genius—the first–ever reality TV show where mortals vie with vampires for the title of The Sexiest Man on Earth. As the show's director, Darcy's career would be on track again. And she can finally have a life apart from the vampire harem. Okay, so she's still technically dead, but two out of three's not bad. Now she just has to make sure that a mortal doesn't win. If only she wasn't so distracted by a super–sexy and live contestant named Austin...  But Darcy doesn't know the worst of it. Austin Erickson is actually a vampire slayer! And he's got his eye on the show's leggy blond director. Only problem is, he's never wanted any woman—living or dead—as badly. But if he wins her heart, will he lose his soul? And if it means an eternity of hot, passionate loving with Darcy, does that really matter anyway?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Breach of Faith: Hurricane Katrina and the Near Death of a Great American City",
        "Authors": "By Horne, Jed",
        "Description": "Hurricane Katrina shredded one of the great cities of the South, and as levees failed and the federal relief effort proved lethally incompetent, a natural disaster became a man-made catastrophe. As an editor of New Orleans’ daily newspaper, the Pulitzer Prize—winning Times-Picayune, Jed Horne has had a front-row seat to the unfolding drama of the city’s collapse into chaos and its continuing struggle to survive.As the Big One bore down, New Orleanians rich and poor, black and white, lurched from giddy revelry to mandatory evacuation. The thousands who couldn’t or wouldn’t leave initially congratulated themselves on once again riding out the storm. But then the unimaginable happened: Within a day 80 percent of the city was under water. The rising tides chased horrified men and women into snake-filled attics and onto the roofs of their houses. Heroes in swamp boats and helicopters braved wind and storm surge to bring survivors to dry ground. Mansions and shacks alike were swept away, and then a tidal wave of lawlessness inundated the Big Easy. Screams and gunshots echoed through the blacked-out Superdome. Police threw away their badges and joined in the looting. Corpses drifted in the streets for days, and buildings marinated for weeks in a witches’ brew of toxic chemicals that, when the floodwaters finally were pumped out, had turned vast reaches of the city into a ghost town.Horne takes readers into the private worlds and inner thoughts of storm victims from all walks of life to weave a tapestry as intricate and vivid as the city itself. Politicians, thieves, nurses, urban visionaries, grieving mothers, entrepreneurs with an eye for quick profit at public expense–all of these lives collide in a chronicle that is harrowing, angry, and often slyly ironic.Even before stranded survivors had been plucked from their roofs, government officials embarked on a vicious blame game that further snarled the relief operation and bedeviled scientists striving to understand the massive levee failures and build New Orleans a foolproof flood defense. As Horne makes clear, this shameless politicization set the tone for the ongoing reconstruction effort, which has been haunted by racial and class tensions from the start.Katrina was a catastrophe deeply rooted in the politics and culture of the city that care forgot and of a nation that forgot to care. In Breach of Faith, Jed Horne has created a spellbinding epic of one of the worst disasters of our time.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Webster's Dictionary",
        "Authors": "By .",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Man from Wyoming",
        "Authors": "By Coolidge, Dane",
        "Description": "",
        "Category": " Fiction , Westerns",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Seven Keys to Spiritual Renewal (Spiritual Renewal Products)",
        "Authors": "By Arterburn, Stephen and Stoop, David A.",
        "Description": "Seven tools to help readers face their weaknesses and overcome them through Christ.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "199 Promises of God (Value Books)",
        "Authors": "By Publishing, Barbour",
        "Description": "Take These Promises to the Bank!What is it that keeps God&#39;s children hopeful in a hopeless world? What guarantees can a person cling to on the most difficult of days?  Readers will find dozens of God&#39;s most uplifting guarantees in 199 Promises of God. This compact book offers real and powerful promises from the Creator of the universe and true refreshment for the spirit and a renewed sense of God&#39;s commitment to His children. As you make your way through a challenging world, find your guidance in the promises of God, who does not lie (Titus 1:2). You have His word!",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Value Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "The Bible Promise Book: New Life Version",
        "Authors": "By Publishing, Barbour",
        "Description": "Barbour's Bible Promise Books are perennial best-sellers, with millions of copies in print. Now, the Bible Promise Book is available in the most readable Bible text, the New Life Version! Containing the same topics found in Barbour's original Bible Promise Book--Anger, Contentment, Forgiveness, Hope, Obedience, Salvation, Worry, Worship, and dozens more--The Bible Promise Book-New Life Version offers hundreds of encouraging scriptures in language that even the youngest reader can clearly understand.",
        "Category": " Religion , Inspirational",
        "Publisher": "Barbour Publishing, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Restaurant Language:  A Survival Vocabulary",
        "Authors": "By Richey, Jim",
        "Description": "",
        "Category": "",
        "Publisher": "Janus Book Pub/Alemany Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Bed of Roses (Book Two in The Bride Quartet)",
        "Authors": "By Nora Roberts",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Dumbing Down: Essays on the Strip Mining of American Culture",
        "Authors": "By Thornton, John F. (EDT), Washburn, Katharine (EDT), Simon, John (INT), and Simon, John (EDT)",
        "Description": "The American scene, once so full of richness, promise, vitality, and achievement, now strikes many critics as a dispiriting carnival of follies, a spectacle of decline. In every area of our lives - including, but not limited to, education, politics, journalism, literature, ethics, film, religion, popular culture, jurisprudence, psychiatry, and even cuisine - one can observe an ominous slippage, a shift towards the bizarre, the third-rate, the purely opportunistic. How did such a vibrant legacy of knowledge, tradition, and competence come to be so rapidly squandered in so short a time? And can this pan-cultural \"dumbing down\" be halted or reversed?This volume collects twenty-three essays - most of them written for this book - that confront such developments with vigor, wit, learning, common sense, and urgency. Contributors include such superb critics and commentators as Philip Lopate, Cynthia Ozick, Michael Vincent Miller, Joseph Epstein, Sven Birkerts, George F. Kennan, Brad Leithauser, and John Simon. Various in their styles, concerns, and political allegiances, they are united in their dismay about a culture in the throes of dismantling itself. The essays in Dumbing Down, whether well-modulated or cries from the heart, are a call to action and renewal.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "A Gentle Giving",
        "Authors": "By Garlock, Dorothy",
        "Description": "Willa Hammer has nothing left after narrowly escaping the lynch mob that unjustly hanged her foster father except her dog, her faith, and the protection of a secretive family. She joins their wagon train heading West, never realizing she is traveling to the wilds of Bighorn Mountain, where a rundown ranch and the arms of an untamed, hardened cowboy await her.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Oxford Companion to English Literature",
        "Authors": "By Harvey, Paul H. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "November",
            "Year": "1967"
        }
    },
    {
        "Title": "The Woman Who Is Always Tan And Has a Flat Stomach: And Other Annoying People",
        "Authors": "By Allison, Lauren and Perry, Lisa",
        "Description": "You know that overprotective PTA mom who needs to be resuscitated after she finds out you fed her son a hotdog? Or that couple who sends out the annual holiday letter about how their little Timmy came up with an alternative to fossil fuels while you're proud of simply replacing the lint catcher in your dryer once a year? You'll meet them again in Lauren Allison and Lisa Perry's laugh-out-loud compendium. Allison and Perry take on soccer moms, video dads, rabid gardeners, and grating couples in this collection of short, punchy essays. Less-than-perfect moms and dads everywhere will be sure to relate to the authors' portraits of the most annoying people around!",
        "Category": " Humor , Form , Essays",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Latin American--United States Relations",
        "Authors": "By Gil, Federico Guillermo",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Harcourt College Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "Her Little Majesty: The Life of Queen Victoria",
        "Authors": "By Erickson, Carolly",
        "Description": "With her customary deft mastery of historical narrative, Carolly Erickson reveals the inner contradictions of the resolute, highminded, often cantankerous woman who became queen at the age of eighteen and reigned until her death sixty-four years later. The short, stout Victoria, diminutive in form yet dominating in spirit, emerged as the defining symbol of her age. Seeing herself as a soldier's daughter first and foremost, Victoria stood her ground, armed with her own fortitude, while the forces of social, economic, and religious change swirled about her.In a time when women were becoming redefined as weak and inferior creatures, unfit even to govern themselves and in need of male rule and protection, the sturdy queen convinced herself that she too was in desperate need of a strong man. She found him in Albert, her handsome, well-intentioned, dutiful prince consort. Following the conventions of the time, Victoria stepped back and let Albert appear to be in charge - yet she never let the reins of power fall from her own hands, and after Albert's early death, his grieving widow discovered, much to her surprise, that she had been the stronger one all along.Victoria's emotional ordeal after Albert's death was the worst crisis of her life, and a crucible of self-discovery. Thrown back on her own emotional resources, Victoria faltered, then resurged as her empire grew and Britain's global influence enlarged. Queen, empress, elder stateswoman, matriarch of Europe, Victoria lived on and on, decade after decade, until she came to seem an immemorial presence on the world stage.",
        "Category": " History , Europe , Great Britain , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Time and Telling Time",
        "Authors": "By Wiley, Bertha M.",
        "Description": "",
        "Category": "",
        "Publisher": "Lake Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1967"
        }
    },
    {
        "Title": "My Picture Dictionary",
        "Authors": "By Green, Robyn, Snowball, Diane (EDT), and Rowe, Jeannette (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Reference , Dictionaries",
        "Publisher": "Mondo Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Quick to Fix Mainstays (Betty Crocker Picture Cookbook)",
        "Authors": "By Betty Crocker",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Illustrated Reverse Dictionary",
        "Authors": "By Reader's Digest Association",
        "Description": "The Illustrated Reverse Dictionary is an ingenious word-finder that helps you locate the precise word you want when you know generally what you mean but can't recall the exact term. With an ordinary dictionary, you look up the word to find its meaning. With the Illustrated Reverse Dictionary, you do just the opposite: you look up the meaning to find the word.The Illustrated Reverse Dictionary works like a thesaurus, which gives you words that are similar in meaning, but it does more. You start with an idea, a description of the term you're looking for, and the Illustrated Reverse Dictionary leads you through associated words to the exact one you want. Moreover, each synonym is defined, and you get antonyms (word opposites) and etymologies (word histories), which a thesaurus does not offer.Containing over 400,000 words - in more than 70,000 main entries, with over 130 detailed color illustrations, and more than 160 charts, the Illustrated Reverse Dictionary offers quick and accurate reference.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Heaven's Reach (The Second Uplift Trilogy #3)",
        "Authors": "By Brin, David",
        "Description": "Winner of the Nebula and Hugo Awards, David Brin brings his bestselling Uplift series to a magnificent conclusion with his most imaginative and powerful novel to date--the shattering epic of a universe poised on the brink of revelation...or annihilation.The brutal enemy that has relentlessly pursued them for centuries has arrived. Now the fugitive settlers of Jijo--both human and alien--brace for a final confrontation. The Jijoans' only hope is the Earthship Streaker, crewed by uplifted dolphins and commanded by an untested human.Yet more than just the fate of Jijo hangs in the balance. For Streaker carries a cargo of ancient artifacts that may unlock the secret of those who first brought intelligent life to the Galaxies. Many believe a dire prophecy has come to pass: an age of terrifying changes that could end Galactic civilization.As dozens of white dwarf stars stand ready to explode, the survival of sentient life in the universe rests on the most improbable dream of all--that age-old antagonists of different races can at last recognize the unity of all consciousness.",
        "Category": " Fiction , Science Fiction , Space Opera",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Moral Imagination: Confronting the Ethical Issues of Our Day",
        "Authors": "By Tivnan, Edward",
        "Description": "When it comes to the most controversial moral questions of our lives - abortion, euthanasia, suicide, capital punishment, racial justice, and affirmative action - there is a right and wrong, but no one owns the truth. This book guides us through the opposing arguments on these profound issues, opening up ways for our pluralistic society to think about them.How does one make up one's mind about the difficult, yet everyday, inescapable social and moral problems we all face? The public debate often degenerates into name-calling and even violence. Conservatives and liberals alike act as if there is only one way to think.In a format that is accessible, anecdotal, and concrete, Edward Tivnan lays out the best arguments on all sides of these visceral topics. He explores the most sophisticated thinking from philosophy, theology, medicine, and the law, as well as examples from the emotional complexities of everyday life, and carefully mediates between opposing ideals - not to lead us to a position of convenience, but to help us toward independent decisions of conviction.Tivnan's analysis, therefore, does not dictate answers, but calls for an effort to understand and respect why people believe so strongly in their own values. Only by facing up to our differences of opinion can we make progress, expand our moral imagination, and achieve a decent and respectful society.In concluding chapters, Tivnan describes the peculiar nature of American democracy, invented by men who knew that freedom would breed conflicting values and expected that such differences would secure the nation's future as a republican democracy. The first premise of a decent, free society, Tivnan writes, is tolerance; \"the first sparks of tolerance and decency reside in the imagination - what I want to call the moral imagination.\" He concludes that expanding our moral imagination \"will cleanse debate of hatred and moral arrogance.\"",
        "Category": " Philosophy , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The new university,",
        "Authors": "By Lawlor, John",
        "Description": "",
        "Category": "",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Personnel Policy Handbook for Growing Companies: How to Create Comprehensive Guidelines, Procedures, and Checklists (Adams Business Advisors)",
        "Authors": "By McWhirter, Darien A.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Adams Media Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "True Blue: To Protect and Serve",
        "Authors": "By Sutton, Randy",
        "Description": "Lieutenant Randy Sutton’s fascinating collection of stories and memories, solicited from law enforcement officers across the country, offers a broad and insightful look at the many facets of police life: courage, exhilaration, frustration, loss, and even humor, from the everyday to the career-defining moments on the job. Told by the cops that lived them, these stories show what it truly means to protect and serve.Readers will come to recognize the faces behind the badge, as they witness officers charge into the unknown on The Beat, honor and mourn friends in The Fallen, hear the War Stories spread in police locker rooms and bars, discover the unbreakable line between civilian and cop in the Line of Duty, and feel the blood-boiling adrenaline during those life-altering moments when a cop must use Deadly Force. TRUE BLUE: To Protect and Serve is a funny, exciting, haunting compilation of true stories written by active and retired police officers, most of whom have never written before, alongside published officers from all over the United States. A portion of the royalties for this book will be donated to The National Law Enforcement Officers Memorial Fund.",
        "Category": " True Crime , General",
        "Publisher": "St Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Overnight Guide to Public Speaking: The Ed Wohlmuth Method",
        "Authors": "By Wohlmuth, Ed",
        "Description": "",
        "Category": "",
        "Publisher": "Running Press Book Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Arctic Drift (Dirk Pitt)",
        "Authors": "By Cussler, Clive and Cussler, Dirk",
        "Description": "Oceanographer Dirk Pitt traces a lost ship's mysterious cargo to a scientific discovery that could reverse the dangers of climate change in this novel in the #1 New York Times-bestselling action adventure series.When an act of sabotage aims to slow down a technological breakthrough in American clean energy, it puts the United States on the brink of war with one of its closest allies. Tension boils on the homefront, too, as gas prices surge to an all-time high. To prevent global catastrophe, Dirk Pitt and his children, Dirk Jr. and Summer, must piece together what little records remain of the initial experiment. They may not know how it was done, but they know what their scientists were trying to accomplish: a solution for global warming.  Their only real clue might just be a mysterious silvery mineral traced to a long-ago expedition in search of the fabled Northwest Passage. But no one survived from that doomed mission. And if Pitt, his family, and his buddy Al Giordino aren't careful, the very same fate may await them…and the world.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Berkley Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Enhancing Professional Practice: A Framework for Teaching",
        "Authors": "By Danielson, Charlotte",
        "Description": "The framework for teaching is a research-based set of components of instruction that are grounded in a constructivist view of learning and teaching. The framework may be used for many purposes, but its full value is realized as the foundation for professional conversations among practitioners as they seek to enhance their skill in the complex task of teaching. The framework may be used as the foundation of a school's or district's recruitment and hiring, mentoring, coaching, professional development, and teacher evaluation processes, thus linking all those activities together and helping teachers become more thoughtful practitioners.",
        "Category": " Education , Professional Development",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Robert's Rules of Order Revised: Seventy-fifth Anniversary Edition",
        "Authors": "By Henry M. Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Scott, Foresman and Comapny",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Reagan's Disciple: George W. Bush's Troubled Quest for a Presidential Legacy",
        "Authors": "By Cannon, Carl M. and Cannon, Lou",
        "Description": "George W. Bush ran for office promising to continue what  conservative icon Ronald Reagan started, and two years into  his first term, Bush was still being described as \"Reagan's  son.\" Today, with the Iraq War spinning out of control and  the Democrats in charge of Congress, Republicans and the  conservative movement have all but abandoned George W.  Bush. What happened? Did Bush change, or did his party's  perceptions? Has the war and Bush's performance on other  issues derailed the larger goals of the Reagan Revolution?  and even undermined its foundations? Or does the nation  remain on a conservative path despite Bush's low standing  with his fellow Americans?  In Reagan's Disciple, two widely respected reporter/  historians provide an authoritative and concise investigation  into these issues. They describe the essence of the 40th  and the 43rd presidencies, and compare them to shed new  light on the history of the past three decades. They show  both how extraordinary a leader Reagan was, and how preposterous  the expectations for Bush were from the beginning.  As Americans look toward choosing a new leader in  2008, Reagan's Disciple will serve as an instructive tale for  Republicans, Democrats, and independents alike.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    }
]