[
    {
        "Title": "The Wind from America, 1778-1781 (Age of the French Revolution)",
        "Authors": "By Manceron, Claude",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Golf Basics: Learn the Game and Lower Your Handicap (Pyramid Paperbacks)",
        "Authors": "By McColl, Graham",
        "Description": "At least 2 million men and women take up golf each year in the USA. Millions more continue to play at a level far below their potential. All those novices and duffers can find a respectable single-figure handicap within reach, thanks to the practical, realistic approach of Golf Basics. There are answers to all the pertinent questions: How long does it take to become proficient? When will the grip start to feel comfortable? How do you stop slicing the ball? And players will learn how to avoid the most treacherous hazard of all: the search for perfection. You don't need a flawless technique to achieve a game you can be truly proud of.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Hamlyn",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Life in the Water (Child's First Library of Learning)",
        "Authors": "By Gakken",
        "Description": "Questions and answers present information about aquatic animals such as sharks, crabs, fish, frogs, and barnacles. Includes an activities section.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Did I Kiss Marriage Goodbye?: Trusting God with a Hope Deferred",
        "Authors": "By Harris, Joshua (FRW) and Mcculley, Carolyn",
        "Description": "Through anecdotes and careful examination of Scripture, McCulley challenges single women to regard their singleness not as a burden, but as a gift from God that allows them to perform a unique role in the body of Christ.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Crossway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Checklists for Life: 104 Lists to Help You Get Organized, Save Time, and Unclutter Your Life",
        "Authors": "By Lagatree, Kirsten M.",
        "Description": "A Handbook For An Organized LifeIf you've ever wished for a class in Coping 101, or a guide to living more efficiently and with less stress, this book is for you! Over 100 sensible checklists offer quick tips and expert advice to make your life easier at work, at home, and through all of life's ups and downs.Arranged by subject, from Personal Safety to Home Maintenance to Social Life, these lists will help you know what to ask, what to do, and what to have on hand in any situation.What to do when your wallet is stolenHow to stock a barQuestions to ask when hiring a contractorWhat to keep in your medicine cabinetFrequently overlooked tax deductionsHow to be friends with your computerThe best and worse places to hide valuablesWhat to keep in a safe deposit boxSix steps of bare minimum houseworkHow to organize your file cabinetHow to cure your dying houseplantsTips for writing an effective complaint letterTipping: who and how muchA countdown to moving day",
        "Category": " Reference , General",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Suite Scarlett",
        "Authors": "By Johnson, Maureen",
        "Description": "Scarlett Martin has grown up in a most unusual way. Her family owns the Hopewell, a small hotel in the heart of New York City. Her nineteen-year-old brother, Spencer, is an out of work actor facing a family deadline to get his career in order. Eighteen-year-old Lola has the delicate looks of a model, the practical nature of a nurse, and a wealthy society boyfriend. Eleven-year-old Marlene is the family terror with a tragic past. When the Martins turn fifteen, they are each expected to take over the care of a suite in the once elegant, now shabby Art Deco hotel. For Scarlett’s fifteenth birthday, she gets both a room called the Empire Suite, and a permanent guest named Mrs. Amberson. Scarlett doesn’t quite know what to make of this C-list starlet, world traveler, and aspiring autobiographer who wants to take over her life. And when she meets Eric, an astonishingly gorgeous actor who has just moved to the city, her summer takes a second unexpected turn. With Mrs. Amberson calling the shots, Spencer’s career to save, Lola’s love life to navigate around, and Marlene’s prying eyes everywhere, things won’t be easy. Before the summer is over, Scarlett will have to survive a whirlwind of thievery, Broadway glamour, romantic missteps, and theatrical deception. The show, as they say, must always go on . . . .  Scarlett, Are you still asleep? I can hear you in there, snoring away. I need the following: White plum tea (whole leaf, loose, organic)Yerba maté lotionDance tightsLaptop computer (I’ll leave it to you to pick one out)A book on how to write a bookA spicy tuna roll (brown rice)A list of all plays currently on BroadwayMatches $4000 should be enough. I’ve shoved the money under your door (see it?). I need these things by noon. I’m meditating now. I want my change, but feel free to take cabs if the purchases are too heavy. Get the sushi last, obviously. And wake up! We have work to do! - Mrs. A",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "Point",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Killing Thyme",
        "Authors": "By Abresch, Peter E.",
        "Description": "Senior citizen James P. Dandy and his friend Dodee Swish do not expect their second trip to a Baltimore, Maryland elderhostel class to be filled with the murder and mayhem of their previous bonsai class, but they find they are quite wrong when chefs start dying all around them",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Write Way Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Slaves Of Sleep",
        "Authors": "By Hubbard, L. Ron",
        "Description": "",
        "Category": "",
        "Publisher": "Lancer",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Dodecahedron: A Washington Memory",
        "Authors": "By Conant H. Emmons",
        "Description": "",
        "Category": "",
        "Publisher": "WorldComm",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "500 More Fat-Free Recipes",
        "Authors": "By Schlesinger, Sarah",
        "Description": "With 500 More Fat-Free Recipes, Sarah Schlesinger has created an even more diverse collection that should make every meal of the day a healthy and delicious success.Beginning with a much expanded list of ingredients - reflecting the greater variety of foods now available on supermarket shelves - Schlesinger has drawn inspiration from cuisines around the world - Italian, Mexican, Chinese, Thai, Indian, and more. Wonderful, often underused flavors like curry, lemongrass, fresh ginger, rose water, and balsamic and wine vinegars brighten dishes that are a far cry from the bland, repetitive meals people often associate with the restrictions of fat-free cooking.Schlesinger makes steamed dumplings with wonton wrappers, and blends blueberries and seltzer water to make a frozen fruit ice. Robust vegetable stews are made more interesting with barley, bulgur, and couscous. She moistens and enriches cake batter with prune puree in place of butter or shortening and makes crumb crusts from fat-free cookies. And in her variation on chocolate-covered strawberries, cocoa powder, which has no fat, replaces the melted chocolate.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Villard",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Jesus confronts life's issues",
        "Authors": "By Ban, Joseph D",
        "Description": "",
        "Category": "",
        "Publisher": "Judson Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Alpine Uproar: An Emma Lord Mystery (Emma Lord Mysteries)",
        "Authors": "By Daheim, Mary",
        "Description": "The picturesque little town of Alpine in the foothills of Washington’s Cascade Mountains is no longer the rough-and-ready logging camp of yesteryear. So when a drunken brawl at the Icicle Creek Tavern leaves a loner named Alvin De Muth dead, the residents feel as if they’ve gone back to the Bad Old Days.The inquiry into the unfortunate incident should be a no-brainer. There are plenty of witnesses to the fatal fight, but since most of them were half-tanked at the time, Sheriff Milo Dodge is left scratching his head over a fistful of conflicting stories. Luckily for Emma Lord, editor and publisher of The Alpine Advocate, the news breaks just before the paper’s Wednesday deadline, so for once she can give the radio station some real competition. But soon she has an even bigger story to report: a heartbreaking highway accident that leaves two people dead and a likable young local on life support.From Front Street to River Road, from Stella’s Styling Salon to the Burger Barn, rumors are flying. Are the two tragedies linked in some inexplicable way? Was De Muth a mentor or a menace to Alpine’s teenage boys? What compels an ethereal female to visit Emma and insist that De Muth’s self-confessed killer is innocent? And (much to Emma’s chagrin) is it true that the sheriff is about to rewed his ex?Emma senses that there’s a story behind the story and is determined to uncover the truth. Assisted by that human bulldozer Vida Runkel, the Advocate’s House & Home editor, Emma goes for the gold.Welcome to another Daheim masterpiece that will challenge the cleverest reader–and a warmhearted world of small-town life, as richly addictive as it is dangerous.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "A Modern Girl's Guide to Bible Study: A Refreshingly Unique Look at God's Word",
        "Authors": "By Hatmaker, Jen",
        "Description": "Written specifically for today’s busy women, this book offers user-friendly advice on how to get the most from personal Bible study time. Transform the academic nature of Bible study into a fresh, simple format that will radically change the way you interact with Scripture forever. This great leader’s resource can be used with the Modern Girl’s Bible Study series or as a tool for discipleship ministry.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "NavPress",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Watcher in the Piney Woods (American Girl History Mysteries)",
        "Authors": "By Jones, Elizabeth McDavid",
        "Description": "In 1865, while helping her family keep their Virginia farm going through the end of the Civil War, twelve-year-old Cassie meets a Confederate deserter and a Yankee prisoner of war and tries to discover who has been stealing from the farm.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Mrs. Cole on an Onion Roll (Aladdin Picture Books)",
        "Authors": "By Adinolfi, Joann (ILT) and Dakos, Kalli",
        "Description": "Complete with lively full-color illustrations throughout, this book offers beginning readers an amusing collection of more than thirty poems relating to everyday school events and happenings. Reprint.",
        "Category": " Juvenile Nonfiction , Poetry , Humorous",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "11.05",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "My Grandma & Me (Picture, Play & Tote Book)",
        "Authors": "By North, Merry",
        "Description": "",
        "Category": "",
        "Publisher": "Playhouse Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Dream of the Blue Room: A Novel",
        "Authors": "By Richmond, Michelle",
        "Description": "Jenny and Amanda Ruth were best friends in a small Alabama town until eighteen-years-old Amanda Ruth was murdered. Now, fourteen years later, Jenny has traveled with her husband to China to scatter Amanda Ruth’s ashes and finally fulfill her friend’s dream of visiting her Chinese father’s homeland. It’s also, Jenny hopes, an opportunity to repair her own troubled marriage. But as she journeys through a foreign landscape, the guilty secrets of Jenny’s past rise up and her life will be inexorably altered.From the New York Times bestselling author of The Year of Fog (“Highly recommended [for fans of] authors like Jodi Picoult and Jacquelyn Mitchard” —Library Journal, starred review) andNo One You Know (“Luminous . . . will keep you thinking long after the last page has been turned”—Family Circle), Michelle Richmond’s stunning novel captivates with its depiction of the powerful intimacies of marriage, friendship, and family that shape our paths and the bonds of home that buoy us—wherever home may be.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Gods Gift for Mothers",
        "Authors": "By Nelsonword",
        "Description": "",
        "Category": "",
        "Publisher": "Nelsonword Publishing Group",
        "Price Starting With ($)": "5.91",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Judaism for Beginners (Beginners Series)",
        "Authors": "By Szlakmann, Charles",
        "Description": "Traces the history of the Jews and the development of their beliefs and traditions",
        "Category": " Humor , General",
        "Publisher": "Writers & Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "I'm Going to Read® (Level 2): I'm Going to New York to Visit the Lions (I'm Going to Read® Series)",
        "Authors": "By Ziefert, Harriet, Linn, Margo, and Roitman, Tanya (ILT)",
        "Description": "Come along on our journey to New York. It's a special trip, just to visit the lions. Which lions could that be? The ones in the zoo?  Toy lions in the store? Not at all: come see the lions who live at the New York Public Library. Margo Linn and Tania Roitman have provided a perfect introduction to the library for the newest readers.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Springtime of the Soul: A Season of Spiritual Renewal and Growth",
        "Authors": "By Carole Hamm",
        "Description": "",
        "Category": "",
        "Publisher": "Daffodil Hill Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Who Killed Health Care?: America's $2 Trillion Medical Problem - and the Consumer-Driven Cure",
        "Authors": "By Herzlinger, Regina E.",
        "Description": "In the battle for U.S. health care, patients and doctors are losing. Who Killed Health Care? shows how to win the war. One of the nation's most respected health care analysts, Regina Herzlinger exposes the motives and methods of those who have crippled America's health care system-figures in the insurance, hospital, employment, governmental, and academic sectors. She proves how our current system, which is organized around payers and providers rather than the needs of its users, is dangerously eroding patient welfare and is pushing costs out of the reach of millions.Who Killed Health Care? then outlines Herzlinger's bold new plan for a consumer-driven system that will deliver affordable, high-quality care to everyone. By putting insurance money in the hands of patients, removing the middleman in the doctor-patient relationship, and giving employers cost relief, consumers and physicians will be empowered to make the system work the way it should. Herzlinger describes in precise detail how her innovative program will provideSmaller, disease-focused medical facilities that provide complete care for patientsA national system of medical records that provides privacy with confidential access by approved practitionersMandatory performance evaluations of all hospitals and all other medical organizationsMandatory health insurance with subsidies for those who cannot afford itWho Killed Health Care? is a call to arms that must be answered; the welfare of every American hangs in the balance.“A brilliant analysis… A must-read.” – Bill George, Professor, Harvard Business School and Former CEO of Medtronic“As it becomes more and more obvious to everyone that our current health care system is unsustainable, this is the book that had to be written.” – Daniel H. Johnson, Jr. MD, former president of the American Medical Association“Regina Herzlinger’s ideas to tackle the crisis of the U.S. health care system are based on keen knowledge of the system’s existing difficulties along with insights that introduce the reader to new streamlined choices that have the potential of getting both quantity and cost under control.” – Joseph Kennedy, founder, chairman, and president, Citizens Energy Corporation, CEO, Citizens Health Care, former representative (D-Mass)“Regina Herzlinger… offers a vision of the way things can be, should be, and will be sooner or later. The only question is: how long do we have to wait?” – Greg Scandlen, founder, Consumers for Health Choices“Regi Herzlinger has brilliantly articulated a better way – embracing the principles of competition and innovation that cause every other sector of our economy to thrive. Discharging American health care from the ICU can only happen by putting individual  Americans – not politicians and bureaucrats – back in charge of their health care decisioins.” – U.S. Senator Tom Coburn (R-Okla), M.D. “Following on the heels of her landmark Market-Driven Health Care, Herzlinger lays it on the line with her expose of what many who work in the health care industry have felt in their gut. Now it is articulated in an entertaining and must-read portrayal, with you and me as the only way out.” – Dennis White, executive vice president for strategic development, National Business Coalition on Health“A wonderful Orwellian romp through issues which carry a deadly irony. The killers of health care are, of course, the third parties, each of which has an itchy palm and a commitment to profit or power which exceeds the commitment to service, with each engaging the others within a politically shaped box. Rarely has the case for the public been made with so much force, foresight, and wit, and a better way forward shown so clearly.” – James F. Fries, MD, Professor of Medicine, Stanford University School of Medicine “You can practically hear the war chants as Professor Herzlinger sets out her view of what’s wrong with the health care system and how to fix it. You’d best read it so you can decide which side you will be on when the battle is joined.” – Paul Levy, CEO, Beth Israel Hospital, Boston, MA “Regina Herzlinger, the nation’s leading expert on consumer-driven health care, has given us a brilliant analysis of the flaws in our health care system and what it will take to get it back on track. Her latest book is a must-read.” – Bill George, Professor of Management Practice, Harvard Business School, Former CEO, Medtronic, and author of Authentic Leadership“You don’t have to agree with her diagnosis and prescription for the U.S. health care system, but you do have to read her book. Once again, Professor Herzlinger has put together a well researched, well written, and very provocative blueprint for the future of health care.” Peter L. Slavin, MD, President, Massachusetts General Hospital",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Walter Rauschenbusch: American Reformer",
        "Authors": "By Minus, Paul",
        "Description": "Chronicles the life of an influential Baptist minister in New York's Hell's Kitchen slum who shaped a theology of social activism that moved religion to fight for life as it tries to save souls",
        "Category": " Religion , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Harvard Medical School Guide to Lowering Your Blood Pressure (Harvard Medical School Guides)",
        "Authors": "By Benson, Herbert, Casey, Aggie, and O'neill, Brian E.",
        "Description": "An innovative approach to lowering blood pressure that builds on the national bestseller The Relaxation ResponseFor the 100 million people worldwide dealing with high blood pressure, bestselling author Dr. Herbert Benson and cardiac wellness expert Aggie Casey have created a proven plan for lowering blood pressure. Based on the groundbreaking work done at the Mind/Body Medical Institute, the authors' program goes beyond advice about nutrition and exercise to incorporate a proven stress-management program--including the relaxation response.",
        "Category": " Health & Fitness , Diseases , Heart",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Teach Me to Pray",
        "Authors": "By Murray, Andrew",
        "Description": "Contemporary Christians know that God answers prayer and that praying is important, but most also wish their prayer life could be more effective. Murray instructs readers from Scripture and the life of Jesus that prayer is the root and strength of all work for God, that God intends to answer every prayer, and that prayer is meant to be a way of life.  These thirty-one classic meditations, written in 1885, have been edited and clarified for new readers.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Depths of God: Walking Ancient Paths into His Presence",
        "Authors": "By Chen, Pat",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Prayers for a Woman of Faith (Women of Faith Bible Study)",
        "Authors": "By Joy Marple",
        "Description": "Prayers, promises of joy, words of wisdom, words of faith, and psalms and proverbs for a woman of faith  from the New International Version of the Bible have been collected into these topically arranged volumes to inspire women on their spiritual journey.  Features foil-stamping on cover and a one-color interior design.",
        "Category": " Religion , Inspirational",
        "Publisher": "Inspirio",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "How to Buy a Diamond, 5E: Insider Secrets for Getting Your Money's Worth",
        "Authors": "By Cuellar, Fred",
        "Description": "Newly revised, and completely updated, How to Buy a Diamond is the only book on the market to include wholesalers' secret pricing charts that you, the public, never get to see! The charts are broken down by carat, clarity and color-including the various grades of color, for the first time ever.This valuable resource gives the information you need to get a stone that won't leave you feeling cheated.",
        "Category": " Reference , Consumer Guides",
        "Publisher": "Sourcebooks Casablanca",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Promises of Love for a Woman of Faith",
        "Authors": "By Detweiler, Molly",
        "Description": "One of the recurring commands in Scripture is 'remember.' Remember what God has done. Remember who God is. Remember what he promises to do. All these reminders point out the fact that we are a people who forget. Trials come into our lives and we panic. We forget we have an all-powerful, loving God. Promises of Love for a Women of Faith is a gift book of topical readings from the New International Version- 100% promises from Scripture. It&apos;s beautiful reminder in gift book form of God&apos;s great love for us and his concern for every aspect of our lives. Created in the same format as our Words of Wisdom for a Woman of Faith, with a lovely pink and purple four-color design, it&apos;s a perfect gift for a friend or a for someone who needs encouragement.",
        "Category": " Religion , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "God's Promises to a Woman's Heart",
        "Authors": "By Jane L. Fryar",
        "Description": "",
        "Category": "",
        "Publisher": "CTA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "A Lie for a Lie (Ministry is Murder Mystery)",
        "Authors": "By Richards, Emilie",
        "Description": "When pastor's wife Aggie Sloan-Wilcox  is asked to babysit a narcissistic actor who has arrived in the town of Emerald Springs to judge the local talent show, she gets more than she bargained for when he is murdered and his ex-wife, a woman surrounded by controversy, is accused of the crime. Original.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Krups Encyclopedia of Coffee and Espresso",
        "Authors": "By Krups",
        "Description": "",
        "Category": "",
        "Publisher": "Trendex International, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Master Of Oakwindsor",
        "Authors": "By Hall, Douglas Kent.",
        "Description": "",
        "Category": "",
        "Publisher": "Jove Books 1977",
        "Price Starting With ($)": "10.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Discovering the Bible: Archaeologists Look at Scripture",
        "Authors": "By Dowley, Tim (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Sarah's Choice (Brides of Lehigh Canal, Book 3)",
        "Authors": "By Brunstetter, Wanda E.",
        "Description": "Slip into romance in this eagerly anticipated book 3 of bestselling author Wanda E. Brunstetter’s Brides of Lehigh Canal series. Widowed Sarah Turner has her hands full, raising three young children, tending the lock on the canal, baking bread, and washing clothes for boatmen. Although she’s not looking for love, she’s vowed not to lose her heart to a boatman. Yet she didn’t count on meeting Captain Elias Brooks. Will she follow her heart where it leads or accept the proposal of a handsome land-loving blacksmith?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "The Jesus of Suburbia: Have We Tamed the Son of God to Fit Our Lifestyle?",
        "Authors": "By Erre, Mike",
        "Description": "Like the first-century Pharisees, we've reduced Christianity to a set of propositional beliefs. Truth is, we've gotten away from what it really means to be a Christian. In The Jesus of Suburbia, Mike Erre reveals that we've created a Jesus in our own image. In a fresh, startling manner, Erre helps us understand that the real Jesus is calling us to live, act, and think in ways that overturn the status quo.\"Expect no sugar-coated sweetness about 'felt needs' and in-church coffee bars from Erre, pastor of teaching at Rock Harbor Church in Costa Mesa, Calif. Expect instead compelling discussion of how the Christian church has lost sight of the revolutionary teaching and love of Jesus. 'Much of the message of American Christianity presents Jesus as the purveyor of the American Dream,' he says. American Christians, he claims, have reduced Jesus to a study of risk management; we want him to be 'predictable and safe.' Erre also uses the adjectives 'insecure, threatened, naive, simplistic, mean and shortsighted' to describe many of today's churches. He lambastes our love of theology instead of Jesus, our contentment with 'simply knowing about him instead of knowing him.' While this protest continues in the vein of other recent books that take a hard look at Jesus and the church (Jesus Mean and Wild; Out of Your Comfort Zone), it offers a fresh look at how the American church must begin 'demonstrating the message of Christ,' not merely explaining it. After all, says Erre, 'if you follow Jesus, you follow the most radical man who ever existed.'\"--Publishers Weekly",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Wait For Me: Rediscovering the Joy of Purity in Romance",
        "Authors": "By St. James, Rebecca and Reeves, Dale",
        "Description": "\"Darling, did you know that I dream about you . . .\"Everyone longs to be loved deeply by someone, and Rebecca St. James is no different, as demonstrated by her hit song \"Wait for Me.\" But while Rebecca shares the same desires as other young people, her resolve to remain sexually pure until marriage is not as common in our society.Using Scripture, pop culture, and her own experience as a point of reference, Rebecca paints a relevant and appealing picture of the value of waiting. But Rebecca also reaches out with compassion to those who have already made mistakes and reveals the mercy and healing that God brings.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "More Perfect Union A",
        "Authors": "By Peters, William",
        "Description": "Describes the creation of the U.S. Constitution, and discusses the people and issues that shaped it",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "When the Heart Beckons",
        "Authors": "By Gregory, Jill",
        "Description": "Traveling through Arizona Territory as a private detective, spirited Annabel Brannigan meets up with rugged gunslinger Roy Steele and learns that they are hunting the same man. Original.",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "A Life of Prayer : A Prayer Journal Created Exclusively for Crossings Members",
        "Authors": "By Crossings Book Club",
        "Description": "",
        "Category": "",
        "Publisher": "Crossings Book Club",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Teachers Touch Lives",
        "Authors": "By Hallmark",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Underhanded Bridge",
        "Authors": "By Jerry Sohl -",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1975"
        }
    },
    {
        "Title": "Fairfax County: A Contemporary Portrait",
        "Authors": "By Netherton, Nan and Netherton, Ross",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Walsworth Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Sacrifice and Delight: Spirituality for Ministry",
        "Authors": "By Jones, Alan W.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "39.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Gracias: A Latin American Journal",
        "Authors": "By Nouwen, Henri J. M.",
        "Description": "Nouwen's journal records his experiences during six months in Peru and Bolivia as well as reflecting on the meaning of Christianity, the nature of faith, the contemporary Catholic Church, and the ecclesiastical vocation",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Come and worship",
        "Authors": "By Coleman, Michael and Lindquist, Ed",
        "Description": "",
        "Category": "",
        "Publisher": "Chosen Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "A Slippery Deck (The Little Mermaid's Treasure Chest)",
        "Authors": "By M. C. Varley",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Books by Mail",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Preaching Pastor",
        "Authors": "By Charles F. Kemp",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Mother Goose (A Little Golden Book)",
        "Authors": "By Walt Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Western Publishing",
        "Price Starting With ($)": "7.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Wild About Harry",
        "Authors": "By Miller, Linda Lael",
        "Description": "Sinfully sexy Harry Griffith, her late husband's best friend, shows up on Amy's doorstep determined to woo the reluctant widow, and, with the able aid of her ghostly spouse, her resistance soon surrenders to Harry's suave smile and tender ways as he pursues her day and night. Reissue.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Everything Counts",
        "Authors": "By Chambers, Oswald and Case, Steve L.",
        "Description": "For generations, people all over the world have been touched by the godly insights of Oswald Chambers. Now Everything Counts presents his work in a new and fresh form especially designed to speak to today’s generation. Writer Steve Case has distilled and expanded the truth, wisdom, and spiritual insight so that a new generation will be moved by these soul-stirring revelations. The new format builds upon the verses for each day. It excerpts the essence of Chambers’ memorable reflections and summarizes them in the section called “Just Between God and You.” Then it encourages students to process these spiritual truths and apply them in their lives.",
        "Category": " Juvenile Nonfiction , Religious , Christian , General",
        "Publisher": "Zondervan/Youth Specialties",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Boy Mechanic Makes Toys: 159 Games, Toys, Tricks, and Other Amusements",
        "Authors": "By Popular Mechanics (EDT) and Petersen, C. J. (PRD)",
        "Description": "",
        "Category": " Crafts & Hobbies , Woodwork",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Sharing Your Story and God's Story--Student Edition: 6 Small Group Sessions on Evangelism (Life Together)",
        "Authors": "By Fields, Doug and Eastman, Brett",
        "Description": "IMAGINE a group of students sharing this goal—to know Jesus Christ deeper and to make him known to others!IMAGINE them doing as the disciples did—fellowshipping, growing, serving, sharing, and worshiping together!IMAGINE yourself in this kind of caring, committed community—revolutionizing your life and those in the group!The Life Together series is the beginning of a relational journey, from being a member of a group to being a vital part of an unbelievable spiritual community. These books will help you think, talk, dig deep, care, heal, share…and have the time of your life! Life…together! Sharing Your Story and God’s Story sets the stage for you and your small group community to play an exciting part in Jesus’ Great Commission. This volume of the Life Together series will show you many ways to share your faith. Whether you are shy or outgoing, a new Christian or full of Bible verses, these six wild sessions spell out new descriptions of evangelism you never knew! God’s Word is not just for you and not for your small group alone. Do life together…with the world that Jesus died for. Here’s how.YOUTH LEADERS the Life Together series is a revolutionary small group resource that will change the lives of your students. Six related books overflow with Bible-based sessions to encourage and equip them. Check out the incredible Life Together DVD resources!  Doug Fields and Brett Eastman share tips and approaches based on the books’ contents, and about communicating with kids. Also on each DVD are Bible teachings, directly related to passages in the books’ sessions, conducted by the most respected names in youth ministry—Doug Fields, Mike Yaconelli, Duffy Robbins, Efrem Smith, Helen Musick, and Marv Penner. 12 “conversations” with Doug and Brett, 12 detailed Bible teachings—these clips are invaluable resources for anyone seeking to share God's Word effectively to teenagers. Each DVD has almost three hours of the best small group teaching for youth you can imagine!",
        "Category": " Young Adult Nonfiction , Religious , Christian , Devotional & Prayer",
        "Publisher": "HarperChristian Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Home Free (Sisterhood)",
        "Authors": "By Michaels, Fern",
        "Description": "The vigilantes of the Sisterhood reorganize as a secret group called the CIC that is dedicated to serving their friend, the president of the United States, Martine Connor.",
        "Category": " Fiction , Women",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "A Handbook for Classroom Instruction That Works",
        "Authors": "By Marzano, Robert J. (EDT), Norford, Jennifer S. (EDT), Paynter, Diane E. (EDT), Pickering, Debra J. (EDT), and Gaddy, Barbara B. (EDT)",
        "Description": "Provides instructional strategies to improve student achievement.",
        "Category": " Education , Classroom Management",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Ideals Liberty Issue (Vol. 33, #1)",
        "Authors": "By Hooper Tonn, Maryjane",
        "Description": "",
        "Category": "",
        "Publisher": "Milwaukee, WI, Ideals, 1976",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Essentials of Sociology --2007 publication.",
        "Authors": "By James M. Henslin",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Custom Publishing",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Paragons: Twelve Master Science Fiction Writers Ply Their Craft",
        "Authors": "By Wilson, Robin Scott (EDT)",
        "Description": "Show, don't tell is the first thing a fiction writer learns. The dozen masters assembled here each take one of their own stories and show exactly how they crafted a particular aspect of it - the style, the theme, the characters, the plot, the setting, or the point of view.Included in this volume are a dozen award-winning masters of the short story: Greg Bear, Pat Cadigan, Karen Joy Fowler, Joe Haldeman, James Patrick Kelly, John Kessel, Nancy Kress, Pat Murphy, Kim Stanley Robinson, Lucius Shepard, Bruce Sterling, and Howard Waldrop. Each brings great insight into the art of writing fiction. Greg Bear asserts that characters shouldn't just be individuals - they should address larger questions of characterizing nations, species, or entire worlds - while Pat Murphy treats characters as imaginary friends who evolve during the writing process. Lucius Shepard discusses the ways in which tiny details evoke a setting and Howard Waldrop assesses the ways in which a literary chameleon can adapt his or her writing style from story to story.Rounding out the book is Bruce Sterling's wonderful \"Workshop Lexicon,\" in which he sums up the most common flows in beginner's fiction. For example: \"Signal from Fred,\" in which the author's subconscious, alarmed by the poor quality of the work, makes unwitting critical comments like \"This sounds like a bad movie.\"",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "18.77",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "How Sweet the Sound",
        "Authors": "By George Beverly Shea",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Great Expectations?: Preparing for Evangelism Through Bible Study",
        "Authors": "By Marshall, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Cowley Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Episcopacy: Lutheran-United Methodist Dialogue II",
        "Authors": "By Tuell, Jack M and Fjeld, Roger W. (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Augsburg Fortress Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Measuring Intelligence: A Guide to the Administration of the New Revised Stanford-Binet Tests of Intelligence (Riverside Textbooks in Education)",
        "Authors": "By Lewis Madison Terman, Maud A. Merrill",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "26.28",
        "Publish Date": {
            "Month": "January",
            "Year": "1937"
        }
    },
    {
        "Title": "Writing and Reading Across the Curriculum",
        "Authors": "By Laurence Behrens, Leonard J Rosen",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "10.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "God's Simple Gift: Meditations on Friendship and Spirituality",
        "Authors": "By Kessler, Diane Cooksey",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Judson Pr",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Laurel (Orphan Train West, Book 1)",
        "Authors": "By Peart, Jane",
        "Description": "Although she had been adopted by a loving couple following her mother's death, Laurel searches for her biological roots before finally finding her \"real\" home.",
        "Category": " Juvenile Fiction , Love & Romance",
        "Publisher": "Fleming H. Revell Co",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Swift Justice: Murder and Vengeance in a California Town",
        "Authors": "By Farrell, Harry",
        "Description": "Describes the kidnapping of the son of a San Jose, California, department store owner, and tells how a band of vigilantes stormed the town jail and hanged the kidnappers in the town square as ten thousand people watched",
        "Category": " Social Science , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "10.24",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Creative Scrapbooking: Over 300 Cutouts, Patterns, & Ideas to Embellish & Enhance Your Treasured Memories",
        "Authors": "By Genovese, Sandi",
        "Description": "“Sandi is probably one of the foremost authorities on the topic of scrapbooking and the use of die cuts. Sandi outlines clearly the materials and steps required ...discusses everything from techniques, tools and papers, to the assembly of the finished project....Each is well photographed.”—Craft Digest.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Sterling/Chapelle",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Old Bear Tales",
        "Authors": "By Hissey, Jane",
        "Description": "These toy animal adventure stories star the popular Old Bear and Little Bear and such new characters as Teddy No-Nose, Sunshine Sam, and Henry Isaiah",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Philomel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "AMAZING ANIMAL FACTS (Eyewitness Juniors)",
        "Authors": "By Maynard, Christopher",
        "Description": "Enhanced by 150 close-up animal photographs and dozens of illustrations, this question-and-answer reference offers more than five hundred different facts about animals ranging from tiny insects to the big cats.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Handbook for Clinical Memory Assessment of Older Adults",
        "Authors": "By Poon, Leonard W. (EDT)",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Amer Psychological Assn",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Over the Hedge: Stuffed Animals",
        "Authors": "By Fry, Michael and Lewis, T.",
        "Description": "The Burb Boys are back for phase four, just in time for a spring movie tie-in!Over the Hedge chronicles the suburban lives of the critters who lived there first. When urban sprawl encroaches on their wild home, mischievous raccoon RJ and his sensitive best-buddy turtle Verne (aided by frenetic squirrel Sammy and a bevy of wacky rodents and marsupials) choose to take this rude incursion . . . with open arms. They critique suburbia's indulgences while exploiting its Dish TV, dishy lawn furniture, and deep-dish goulash of gar-baaage.DreamWorks Animation is bringing the vision of Hedge creators Michael Fry and T Lewis to life in a feature film in Spring 2006, starring the voices of Bruce Willis as RJ and Garry Shandling as Verne. Other star voices in the computer-animated movie include Steve Carrell, Eugene Levy, Nick Nolte, William Shatner, Wanda Sykes, and singer Avril Lavigne.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Power of One: Stand Up, Be Counted, Make a Difference",
        "Authors": "By Luce, Ron",
        "Description": "",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "A Creed in Stone Creek (The Creed Cowboys)",
        "Authors": "By Miller, Linda Lael",
        "Description": "When single attorney Steven Creed becomes guardian of an orphaned five-year-old boy, he trades his big-city law firm for a ranch near his McKettrick kin in the close-knit community of Stone Creek, Arizona. Taking care of little Matt and fixing up his run-down ranch house with its old barn loosens something tightly wound inside him. But when Steven takes on the pro bono defense of a local teen, he meets his match in the opposing counsel&#151;beautiful, by-the-book county prosecutor Melissa O'Ballivan. It'll take one grieving little boy, a sweet adopted dog and a woman who never expected to win any man's heart to make this Creed in Stone Creek know he's truly found home.",
        "Category": " Fiction , Romance , Western",
        "Publisher": "HQN Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "The American Film Institute Desk Reference: The Complete Guide to Everything You Need to Know about the Movies",
        "Authors": "By Ochoa, George, Eastwood, Clint (INT), and Corey, Melinda (EDT)",
        "Description": "The only source of movie history any fan will want to read. Presented by the American Film Institute, the nation's preeminent organization dedicated to advancing and preserving the art of the moving image, the American Film Institute Desk Reference is the most comprehensive reference book on filmmaking ever published. Providing detailed information on the world of film, its history and its personalities, this single volume is loaded with enough facts and trivia to satisfy any movie buff. Highlighting filmmakers and costume designers, financiers and actors, this complete guide is packed with more than 500 photographs and illustrations, a year by year chronology of film, and many special annotated lists, including the AFI's celebrated list of the 100 Best Films of the Past 100 Years.",
        "Category": " Performing Arts , Film , Reference",
        "Publisher": "Dorling Kindersley Publishing, Inc.",
        "Price Starting With ($)": "8.09",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "A Parting Gift",
        "Authors": "By Erickson, Ben",
        "Description": "Josh is 17 years old when he is enlisted to help an old man write his memoirs. Beautifully evoking ordinary life, A Parting Gift explores such fundamental puzzles as how to live one's life, the reason for existence and the nature of God.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Foolish Turtle, Level 2 (Lightning Readers)",
        "Authors": "By Wilson, Anna and Gordon, Mike (ILT)",
        "Description": "When a child is learning to read, every word counts! Terry the turtle wants to fly. But will he find the courage to try, even though his friends think it is a silly idea?The Foolish Turtle is an innovative Lightning Reader that        features a controlled word count to give readers practice with essential sight words. This leveled reader for grades K-1 features a 150 words or less and has been professionally leveled by reading experts to ensure that the language and vocabulary are age-appropriate. Word lists and comprehension questions at the back of the book reinforce fundamental reading concepts used in classrooms nationwide!This title is also available in a Spanish version! Children ages 2 to 8 will love to learn to read with our Lightning        Readers series! Over 30 titles feature humorous, high-interest        stories in a variety of styles including, fantasy, fable, and rhyme,        which will appeal to both reluctant and enthusiastic readers.         Controlled word counts in this one of a kind series help to build the        word foundation for a lifetime of reading! Check out the other titles        in this series!Each title is available in an English and Spanish version!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Brighter Child",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "McCormick/Schilling's New Spice Cookbook",
        "Authors": "By Felton, Jack",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Benjamin Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Miniature desserts",
        "Authors": "By Dotter, Pam",
        "Description": "",
        "Category": "",
        "Publisher": "WEIDENFELD & NICOLSON",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Moments of Celebration (Just Because)",
        "Authors": "By Rice, Helen Steiner",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fleming H. Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Great Shipwrecks of the 20th Century",
        "Authors": "By Bonsall, Thomas E.",
        "Description": "Describes the worst shipwrecks during each decade of the current century, including several worse than the Titanic",
        "Category": " Social Science , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Quick & Easy Microwaving Snacks & Appetizers (Quick & Easy Microwaving Library, 3)",
        "Authors": "By Microwave Cooking Institute",
        "Description": "Provides recipes for preparing whole chickens, chicken pieces, soups, stews, and salads, gives suggestions for coatings for chicken pieces and utilizing leftovers, and includes basic microwaving tips",
        "Category": " Cooking , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Recipes from a French Herb Garden",
        "Authors": "By Holt, Geraldene",
        "Description": "A guide to French country cooking presents dishes, including tomato tartlets with oregano, salmon with dill, cheese brioche, and mint chocolate mousse",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Complete Comfort Food",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "JG Press",
        "Price Starting With ($)": "6.92",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Book of Powerful Secrets",
        "Authors": "By American Publishing Corp.",
        "Description": "",
        "Category": "",
        "Publisher": "American Publishing Corporation",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Three Minutes a Day: Volume 39",
        "Authors": "By Dennis Heaney (Multiple Authors)",
        "Description": "",
        "Category": "",
        "Publisher": "The Christophers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "A Good Indian Wife: A Novel",
        "Authors": "By Cherian, Anne",
        "Description": "Handsome anesthesiologist Neel is sure he can resist his family’s pleas that he marry a \"good\" Indian girl. With a girlfriend and a career back in San Francisco, the last thing Neel needs is an arranged marriage. But that’s precisely what he gets. His bride, Leila, a thirty-year-old teacher, comes with her own complications. They struggle to reconcile their own desires with others’ expectations in this story of two people, two countries, and two ways of life that may be more compatible than they seem.",
        "Category": " Fiction , Romance , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Cinema: Year by Year, 1894-2003",
        "Authors": "By Karney, Robyn (EDT), Finler, Joel W. (EDT), and Bergan, Ronald (EDT)",
        "Description": "From the birth of the film industry to the present day, this updated, year-by-year history of the movies combines material from film, promotional posters, newspaper articles, reviews, and movie stills to chronicle the major developments in the world of movie entertainment and has been updated to include the latest Oscar winners.",
        "Category": " Performing Arts , Film & Video , General",
        "Publisher": "DK",
        "Price Starting With ($)": "10.0",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "White Horse, Dark Dragon",
        "Authors": "By Fleet, Robert C.",
        "Description": "In Central Europe to study the environmental impact of a planned mining operation, scientist Jim Marlowe encounters a village witch with a mysterious past and an ancient myth come to life. Original.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Guinness Book of World Records, 2004",
        "Authors": "By Folkard, Claire (EDT)",
        "Description": "With hundreds of new records and dramatic new design, the favorite annual reference features more tales of heroism, survival, and feats of daring, from balloon flights around the world to robotic vehicles, as well as sections on recent technological innovations, sports, human achievement, and more.",
        "Category": " Reference , Trivia",
        "Publisher": "Guinness",
        "Price Starting With ($)": "7.12",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Praying With Elizabeth Seton (Companions for the Journey)",
        "Authors": "By Alderman, Margaret and Burns, Josephine",
        "Description": "",
        "Category": " Religion , Prayer",
        "Publisher": "Word Among Us Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Lady Alex",
        "Authors": "By Creel, Catherine",
        "Description": "Australian convict Alexandra Sinclair, an English aristocrat accused of crime she did not commit, is irresistibly drawn to arrogant, rakish American Jonathan Hazard, who rescues her from the factory prison but who has passionate plans for his captive. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Faye Levy's Sensational Chocolate",
        "Authors": "By Levy, Faye",
        "Description": "Gathers over two hundred recipes for cakes, pies, pastries, souffles, custards, puddings, crepes, frozen desserts, cookies, brownies, mousses, ice creams, and candies that feature chocolate",
        "Category": " Cooking , Courses & Dishes , Chocolate",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Baking: Cakes, Cookies, Breads, Pastries",
        "Authors": "By Zabert, Arnold",
        "Description": "Gathers recipes for croissants, breads, buns, pies, pastries, cupcakes, cookies, fruit cakes, tarts, pizzas, fillings, and frostings, and provides information on baking techniques, equipment, and ingredients",
        "Category": " Cooking , General",
        "Publisher": "HP Books",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Managers As Facilitators: A Practical Guide to Getting Work Done in a Changing Workplace",
        "Authors": "By Weaver, Richard G. and Farrell, John D.",
        "Description": "Offers a practical, effective program to help transform leaders and managers in all types of organizations into skilled facilitators Teaches managers the facilitation skills they need to help their organizations improve productivity Includes real-life examples from manufacturing, telecommunications, health care, education, retail and other service businesses, and government and other non-profit organizations Today&apos;s managers are confronted with increasing pressure to produce more with fewer resources. In this pressure-packed environment, managers are finding that the old \"direct-and-control\" model simply does not work. People need more freedom to make decisions, respond quickly to their customers, and work together more effectively. Successful managers have learned how to use the role of facilitator to help people exercise this freedom to produce the results needed by their organizations. Managers As Facilitators presents a new, easy-to-understand model of facilitation that focuses on getting work done. It provides practical guidance for managers and leaders who need to be successful in this new role. Weaver and Farrell show managers how to use themselves in new ways, capitalize on group dynamics, and build effective work processes. They explain that to become a successful facilitator, one must recognize and use the four key elements of the facilitation model: 1. Task: Facilitators are clear about the work that groups must complete; task drives the actions of effective facilitators. 2. Self: Facilitators learn how to use themselves to help groups complete their tasks; facilitators do this by both using their own personal thoughts and feelings as a \"barometer\" for groups and modeling the types of behavior expected from others. 3. Group: Facilitators help groups understand the difference between normal interactions and those that are a problem; facilitators also help groups capitalize on conflict, rather than be disabled by it. 4. Process: Facilitators use three fundamental processes to help groups: planning, solving problems, and completing work; facilitators are skilled with a number of facilitation tools, using them to help groups run effective meetings, finish projects, etc. Managers As Facilitators offers readers practical ways to manage change and organizational boundaries to achieve the results they want. The authors explain how individuals, groups, and organizations experience change and work with boundaries-and what facilitators do to help. The book&apos;s final chapter synthesizes all the material by presenting \"Quick Fixes\" to common problems.",
        "Category": " Business & Economics , Management",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Wild Rose",
        "Authors": "By Mortman, Doris",
        "Description": "Determined to realize the dream her father never could--to have a successful career in music--Katalin Gaspar travels through New York, Washington, and Kentucky and searches for the love who was separated from her when the Soviets entered Budapest in 1956",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Wilt On High",
        "Authors": "By Sharpe, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "Pan Books Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Kara: The Lonely Falcon",
        "Authors": "By Girzone, Joseph F.",
        "Description": "",
        "Category": " Fiction , Religious",
        "Publisher": "Richelieu Court Pubns",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Cooking for Two (St Michael Cookery Library)",
        "Authors": "By rosemary-wadey",
        "Description": "",
        "Category": "",
        "Publisher": "Sundial Books Ltd.",
        "Price Starting With ($)": "6.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Kitchen Storage",
        "Authors": "By Sunset Books",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "From the \"S\" File",
        "Authors": "By Anonymous",
        "Description": "",
        "Category": "",
        "Publisher": "Playboy Press",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    }
]