[
    {
        "Title": "Giant Jetliners",
        "Authors": "By Norris, Guy and Wagner, Mark",
        "Description": "See today's jumbo jets in action, in the air, on the ground, and in a variety of color schemes. This colorful book tells of the design and development history (including prototypes never built), safety features, and the future of today's jetliners.",
        "Category": " Transportation , Aviation , General",
        "Publisher": "Crestline",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Color Schemes Made Easy (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books (EDT) and Ingham, Vicki (EDT)",
        "Description": "Answers to help home decorators make their favorite colors work in any space.Innovative color ideas that incorporate paints, fabrics, and accessories.Color basics and how-to techniques for every room in the house boost decorating confidence.Unique color scheme recipes and color swatches accompany inspirational photos.Easy-to-navigate chapters are organized by color.Interior designers and color experts answer questions on common color dilemmas.Special quiz provides home decorators insight to color personalities.One-of-a-kind, 16-page insert gives readers take-along color recipes for buying paint, fabric, and accessories.",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "New Kidspace Idea Book: Rooms That Grow Up * Quick Makeovers* Outdoor Pl (Taunton Home Idea Books)",
        "Authors": "By Jordan, Wendy A. and Erikson, Christine (ILT)",
        "Description": "The New Kidspace Idea Book presents fresh and fun ideas for designing a child's room that will also solve parents' space and storage problems. The new book complements the original with 100 percent new photographs showing completely new ideas for bedrooms, playrooms, bathrooms, and outdoor spaces. Topics include tailoring designs to suit the interests of the individual child, customizing a plain room, making the most of unusual spaces, adapting spaces to children's changing needs, and creating safe spaces for active play. Shared rooms, storage solutions, and what to do with computers and televisions are all treated. The book's simple and accessible approach emphasizes quick fixes involving paint and off-the-shelf products, weekend projects that kids can take part in, and makeovers as children grow older. New Kidspace Idea Book is written for parents but will spark kids' own creative ideas too.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Yoga: A basic guide",
        "Authors": "By Kent, Howard",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Civil War in the American West",
        "Authors": "By Josephy, Alvin M.",
        "Description": "A history of the Civil War as it was fought in the West discusses the Indian uprising in Minnesota, the campaigns the North lost in Western Louisiana and Texas, the war against the Native Americans on the Western plains, and more",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Compleat Angler (Barre)",
        "Authors": "By Walton, Izaak and Cotton, Charles",
        "Description": "",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Smoothies: 50 Recipes for High-Energy Refreshment",
        "Authors": "By Barber, Mary Corpening, Narlock, Lori Lyn, Corpening, Sara, Neunsinger, Amy (PHT), and Whiteford Corpening, Sara",
        "Description": "Any time and any place: that's when and where to enjoy a smoothie. It takes just minutes to blend one - making them the perfect treat for any moment of a busy day. And nothing is more healthful and refreshing than the daily dose of fresh fruit they provide. Smoothies is full of creative suggestions for adventurous mixtures of fruits and nectars, sorbets and ice creams, yogurts and soy milks, and for special occasions, a little champagne or rum!Complete with nutritional information for all recipes and illustrated with delightful photographs, Smoothies is the perfect guide to deliciously healthful indulgences.",
        "Category": " Cooking , Beverages , Juices & Smoothies",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Count of Monte Cristo (Great Illustrated Classics)",
        "Authors": "By Dumas, Alexandre",
        "Description": "Set against the tumultuous years of the Post-Napoleonic era, Dumas's grand historical romance recounts the swashbuckling adventures of Edmond Dantes, a dashing young sailor falsely accused of treason. The story of his long imprisonment, dramatic escape, and carefully wrought revenge offers up a vision of France that has become immortal.",
        "Category": " Juvenile Nonfiction , Antiques & Collectibles",
        "Publisher": "Abdo Pub Co",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Abigail Adams: Girl of Colonial Days (Childhood of Famous Americans)",
        "Authors": "By Wagoner, Jean Brown and Ponter, James J. (ILT)",
        "Description": "A biography focusing on the early years of the parson's daughter who became the wife of our second president",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Principles of Macroeconomics (Study Guide)",
        "Authors": "By Mankiw, Gregory and Hakes, David R.",
        "Description": "To accomplish your course goals, use this study guide to enhance your understanding of the text content and to be better prepared for quizzes and tests.  This convenient manual helps you assimilate and master the information encountered in the text through the use of practice exercises and applications, comprehensive review tools, and additional helpful resources.",
        "Category": " Business & Economics , Economics , Macroeconomics",
        "Publisher": "South-Western College Pub",
        "Price Starting With ($)": "5.12",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "DK Guide to Dinosaurs",
        "Authors": "By Lambert, David and Hutt, Steve",
        "Description": "Uptotheminute information and sensational graphics depict how dinosaurs lived and died, covering such topics as habitats, size, hunting techniques, selfdefense, courtship, and family life.",
        "Category": " Juvenile Nonfiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "DK CHILDREN",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Happy Birthday to You!",
        "Authors": "By Seuss, Dr.",
        "Description": "Bigger than New Year’s, the Fourth of July, and Halloween all rolled into one, birthdays are for celebrating with Dr. Seuss in his first all-color picture book, Happy Birthday to You! Fly with the Great Birthday Bird in this fantastical commemoration of YOU! And make the most of your special day, which only comes once a year!  “Today you are you! That is truer than true! There is no one alive who is you-er than you!” The ultimate birthday gift for ages one to 101—from the one and only Dr. Seuss!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Birthdays",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "8.76",
        "Publish Date": {
            "Month": "August",
            "Year": "1959"
        }
    },
    {
        "Title": "Disney's Atlantis: The Lost Empire (Disney's Wonderful World of Reading)",
        "Authors": "By Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Perfecting Your Golf Swing: New Ways to Lower Your Score",
        "Authors": "By Heuler, Von Oliver and Heuler, Oliver",
        "Description": "This all-color guide presents a systematic approach to developing the perfect golf  swing. Examine all the aspects of preparing a shot and the basic body movements. Work on backswing, downswing, and follow-through, each of which is broken down into its component parts. Analyze the most common mistakes, including hooking, slicing, insufficient distance, and inconsistency. Warm-up exercises to help prevent injuries as well as increase mobility in the joints and improve overall coordination.    144 pages (all in color), 8 1/4 x 10 1/4.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "World-Class Tennis Technique",
        "Authors": "By Roetert, Paul, Ph.D. (EDT) and Groppel, Jack L. (EDT)",
        "Description": "",
        "Category": " Sports & Recreation , Tennis",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Home Grown",
        "Authors": "By De Saulles, Denys",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Sporting News Chronicle of Baseball",
        "Authors": "By John D. Rawlings",
        "Description": "",
        "Category": "",
        "Publisher": "BDD Promotional Books Company",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "The Development of Language (5th Edition)",
        "Authors": "By Gleason, Jean Berko",
        "Description": "The fifth edition of The Development of Language is written and contributed by leading researchers and covers language acquisition and development from infancy through adulthood.    With its organization based on developmental stages of language, this book is especially well suited for courses that take a developmental approach. It covers every aspect of language acquisition and development from a lifespan perspective, beginning with the earliest attempts to communicate and ending with the language and communication concerns of the aged.  The book thoroughly explores syntax, morphology, semantics, phonology, and pragmatics. It examines atypical development, presents strong coverage of individual differences, how and why they occur, and provides contemporary references and the most recent research findings. The panel of expert authors provides readers with cutting-edge research knowledge in an interesting and highly readable format.    For anyone interested in language development across the age span.",
        "Category": " Psychology , Developmental , General",
        "Publisher": "Pearson",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Fury and Dark Reunion (The Vampire Diaries)",
        "Authors": "By Smith, L. J.",
        "Description": "New York Times bestselling seriesThis special paperback bind-up contains The Fury and Dark Reunion, the third and fourth books in L J. Smith’s New York Times bestselling series The Vampire Diaries. Elena Gilbert has risen from the dead as a powerful vampire. But she still finds herself caught in a deadly love triangle with Stefan and Damon. Tormented by losing Elena, Stefan is determined to end his feud with his brother Damon once and for all--whatever the cost. And Damon at last possesses Elena, but his thirst for revenge against Stefan poisons his triumph. But when the oldest, most vile evil force threatens Fell’s Church, all three must band together to save the town.Binge-read the third and fourth books in the New York Times bestselling series that inspired the hit CW TV show The Vampire Diaries.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The Tranquil Home",
        "Authors": "By Baskett, Mickey",
        "Description": "To turn your living space into a center of calm, start by leafing through these beautiful photos that show what truly tranquil rooms look like.  The secret is to bring the harmonies of nature into your life by blending wood, fire, earth, water, and metal in proper balance.  A sampling: furniture decorated with designs from nature, wall mosaics, plants and flowers, indoor and outdoor fountains, natural bath products, candles, natural room fresheners, wind chimes.",
        "Category": " House & Home , Decorating",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "An Ornament a Day (25 Sparkling Holiday Trims to Make)",
        "Authors": "By Carol Field Dahlstrom",
        "Description": "",
        "Category": "",
        "Publisher": "Brave Ink Press/Carol Field Dahlstrom Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Blood Red Horse (The deGranville Trilogy, 1)",
        "Authors": "By Grant, K. M.",
        "Description": "You need three things to become a brave and noble knight: A warhorse. A fair maiden. A just cause. Will has a horse-a small chestnut stallion with a white blaze in his brow. Ellie is a fair maiden, but she's supposed to marry Will's older brother, Gavin. And as for the cause, King Richard is calling for a Crusade. The Knights of England must go to the Holy Land to fight. Will and Gavin will go. Blood will be shed. Lives will be taken. But through it all, two things will be constant-Ellie, and a blood-red horse called Hosanna. . . .",
        "Category": " Young Adult Fiction , Historical , Medieval",
        "Publisher": "Bloomsbury USA Childrens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Uncle Tom's Cabin (Barnes & Noble Classics Series)",
        "Authors": "By Stowe, Harriet Beecher and Claybaugh, Amanda",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RUncle Tom's Cabin&&L/I&&R, by &&LB&&RHarriet Beecher Stowe&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RNearly every young author dreams of writing a book that will literally change the world. A few have succeeded, and &&LB&&RHarriet Beecher Stowe&&L/B&&R is such a marvel. Although the American anti-slavery movement had existed at least as long as the nation itself, Stowe’s &&LI&&RUncle Tom’s Cabin&&L/I&&R (1852) galvanized public opinion as nothing had before. The book sold 10,000 copies in its first week and 300,000 in its first year. Its vivid dramatization of slavery’s cruelties so aroused readers that it is said Abraham Lincoln told Stowe her work had been a catalyst for the Civil War. &&L/P&&R&&LP&&RToday the novel is often labeled condescending, but its characters—Tom, Topsy, Little Eva, Eliza, and the evil Simon Legree—still have the power to move our hearts. Though “Uncle Tom” has become a synonym for a fawning black yes-man, Stowe’s Tom is actually American literature’s first black hero, a man who suffers for refusing to obey his white oppressors. &&LI&&RUncle Tom’s Cabin&&L/I&&R is a living, relevant story, passionate in its vivid depiction of the cruelest forms of injustice and inhumanity—and the courage it takes to fight against them. &&L/P&&R&&LP&&R&&LB&&RAmanda Claybaugh&&L/B&&R is Assistant Professor of English and Comparative Literature at Columbia University.&&L/P&&R&&L/DIV&&R",
        "Category": " Fiction , Classics",
        "Publisher": "Barnes & Noble Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Traditional Patchwork Patterns: Full-Size Cut-Outs and Instructions for 12 Quilts",
        "Authors": "By Grafton, Carol Belanger",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1975"
        }
    },
    {
        "Title": "Face-Off (Hannah Montana #2)",
        "Authors": "By Alfonsi, Alice",
        "Description": "Hannah Montana, a.k.a. Miley Stewart, is the face of a worldwide campaign for Magic Glow Skin Cream--everyone's favorite zit zapper! But when the billboard shows Hannah with a zit the size of an extra-large pizza, Miley is horrified! Will she remember that it's what's inside that counts? Plus, Miley and Lilly get back to nature--on a school camping trip!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Canterbury Tales (Puffin Classics)",
        "Authors": "By Chaucer, Geoffrey and McCaughrean, Geraldine (RTL)",
        "Description": "Introduces students to a story about a group of pilgrims going to Canterbury and the various tales that they relate to one another",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Fresh-Water Fisherman's Bible, The",
        "Authors": "By Evanoff, Vlad",
        "Description": "Describes the habitat, distribution, and physical characteristics of more than thirty fish species, and details the equipment and techniques used to land each of them",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1980"
        }
    },
    {
        "Title": "Spies and Espionage, a Directory",
        "Authors": "By Hearn, Chester G.",
        "Description": "Step into the cloak-and-dagger world of the spy, where secret missions, code names, and undercover operations are all part of the job description. Uncover the secrets of legendary spies throughout history, from Mata Hari to Allan Pinkerton. Spies and Espionage, a Directory  is a thrilling account of legendary spies throughout history, including Allan Pinkerton, the \"Godfather of Sleuths\" and founder of the first detective agency, and Nancy Wake, \"The White Mouse,\" who was Number One on the Gestapo’s Most Wanted List with a price of five-million francs on her head. Each spy’s deep, dark secrets are revealed with plenty of fascinating biographical information, while archival photographs help shed light on these shadowy individuals. A unique graphic feature is the Spy Dossier, which details each spy’s affiliations, code names, and secret data. This is a must-have for Mata Haris and James Bonds everywhere.",
        "Category": " Political Science , Intelligence & Espionage",
        "Publisher": "Thunder Bay Press",
        "Price Starting With ($)": "8.61",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "My Invisible Kingdom : Letters from the Secret Lives of Teens",
        "Authors": "By Scott Fried",
        "Description": "",
        "Category": "",
        "Publisher": "Unknown",
        "Price Starting With ($)": "6.69",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Robert Frost: A Pictorial Chronicle",
        "Authors": "By Morrison, Kathleen",
        "Description": "",
        "Category": "",
        "Publisher": "Holt Rinehart and Winston",
        "Price Starting With ($)": "8.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Thoughts and Reflections on Billy Graham's Life Principles",
        "Authors": "By Zondervan",
        "Description": "A commemorative 2005 crusade edition featuring life principles that have guided Billy Graham over the past fifty years in his ministry of reaching people worldwide for Christ. Filled with photos from various stages of Billy Graham's life, this book also includes quotes from Billy Graham and those close to him.",
        "Category": " Religion , Faith",
        "Publisher": "Inspirio",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Physics of Immortality",
        "Authors": "By Tipler, Frank J.",
        "Description": "Frank J. Tipler is a major theoretician in the field of global general relativity, the rarefied branch of physics created by Stephen Hawking and Roger Penrose. Like most modern scientists, Tipler was an atheist who gave little thought to questions of theology. Yet, in devising a mathematical model of the end of the universe, Tipler came to a stunning conclusion: Using the most advanced and sophisticated methods of modern physics, relying solely on the rigorous procedures of logic that science demands, he had created a proof of the existence of God.Tipler's model of the universal end-time is called the Omega Point Theory. For the last seventeen years, Tipler has explored the implications of the Omega Point Theory, one of which is even more astonishing than the evidence of God's existence: It is not only possible, but likely, that every human being who ever lived will be resurrected from the dead. As Tipler writes in his preface, he arrived at his proofs of God and immortality \"in exactly the same way physicists calculate the properties of the electron.\"In The Physics of Immortality Tipler guides the general reader through the details of his exhilarating discoveries. Displaying an awesome command of disciplines as diverse as computer science, economics, particle physics, cosmology, and evolutionary biology, Tipler constructs a stunningly plausible argument for God and the universal resurrection.Lucid in style, audacious in aim, breathtaking in scope, powerfully argued, and, finally, deeply moving, this is a book that will change the way you think. No reader, whether skeptic or believer, will look at the universe in the same way after encountering this remarkable work.",
        "Category": " Religion , Eschatology",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Bedrooms: Creating the Stylish, Comfortable Room of Your Dreams",
        "Authors": "By Madden, Chris Casson, Hill, Nancy E. (PHT), and Hill, Nancy E.",
        "Description": "The author of A Room of Her Own showcases her best ideas for decorating the most intimate room of the house, offering a wide array of styles, from country and classic to Victorian and contemporary. 40,000 first printing.",
        "Category": " House & Home , Decorating",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Burger Meisters",
        "Authors": "By Desaulniers, Marcel and Grand, Michael (PHT)",
        "Description": "Winner of the James Beard Award for Best Cookbook on a Single Subject  \"Never again will a burger be just a burger.\" That's what one reviewer in the World of Cookbooks newsletter wrote about these extraordinary, mouth-ravishing, soul-satisfying, deliciously tempting versions of America's favorite food.  From a Classic Grilled Hamburger on a toasted homemade bun to a fabulous southwestern Chili Grill Burger with spicy Chipotle Mayonnaise to Shrimp Boulette Po' Boy with Creole Sauce, here is the ultimate source for a burger to tempt anyone.  In the words of editor Marcel Desaulniers, award-winning author of Death by Chocolate and chef and co-owner of the Trellis Restaurant, \"Contemporary American chefs have staked a claim in culinary history by revitalizing -- not reinventing -- American regional foods.\" In this lushly illustrated volume, 46 amazing chefs turn their professional imagination to the humble burger. What results is a fabulous collection of more than 130 recipes for delectable burgers and side dishes. Enjoy the luxury of a Salmon Burger served with Fennel and Red Onion Salad and Sweet Potato Fries, or surprise your guests with an Aztec Burger for dessert-assembled with Chocolate Buns and Rubblechuck Fries, and served with Raspberry Relish, it is a chocoholic's dream!  Desaulniers has gathered expert chefs, all graduates of the renowned Culinary Institute of America, from all across the United States -- New York to Charleston, Atlanta to Chicago, Dallas to Phoenix, Las Vegas to Sonoma -- to collaborate on this delicious journey of the imagination and palate. Throughout this beautiful book, his editorial touch is evident in the crystal-clear instructions, helpful tips on preparation, and expert techniques for the home cook.  You will definitely agree that a burger will never again be just a burger.",
        "Category": " Cooking , Regional & Ethnic , American , California Style",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Essential Guide to Decorating",
        "Authors": "By Lee, Vinny",
        "Description": "",
        "Category": " House & Home , Decorating",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Gift of Grandparenting",
        "Authors": "By Wiggin, Eric",
        "Description": "“Well-researched, well-written and greatly appreciated homespun advice flows from this loving heart of a grandfather on every page.” —Woodrow Kroll, President, Back To The BibleFrom passing on the family history and imparting spiritual wisdom to sharing special times and fun activities,The Gift of Grandparenting encourages grandparents to take an active role in creating strong spiritual and emotional family ties. Whether the grandchildren live around the corner or around the country, this book gives every grandparent new ways to enjoy the marvelous gift of grandparenting. “There is no greater joy or higher privilege than to be a grandparent. Read this wonderful book to laugh, weep, and plan to be a greater grandparent than ever. I commend it fully.” —Adrian Rogers, Senior Pastor, Bellevue Baptist Church“Every grandparent and grandparent-to-be needs to read this book! Grandparents play a significant role in their grandchildren's lives.” —Beverly LaHaye, Chairman, Concerned Women for America“Filled with tips, tidbits, and insight for a modern world, Eric Wiggin's The Gift of Grandparenting should be on every family bookshelf.” —Angela Hunt, Novelist“If you have found yourself even less prepared for the uniqueness of this trip than you were for your “first round” of kids, you'll feel with us how greatly rewarding it is to have help like Eric Wiggin offers us here.” —Jack W. Hayford, Founding Pastor, The Church On The Way, Van Nuys, CA “In these days of so much divorce and single parenting, grandparents may be the only touch of listening love some children seem to have. This book will give you the tools to be the best grandparent you can be.” —Florence Littauer, Speaker and Author(Personality Plus, Silver Boxes) “This splendid work, written from the viewpoint of a dedicated Christian, blends principle and precept with practical experience. Heartily recommended for grandparents of all ages and all persuasions.” —D. James Kennedy, Ph.D., Senior Minister, Coral Ridge Presbyterian Church “As the grandparents of 13 very lively grandkids, we know we have much to learn. This comprehensive book will be most helpful to us and to countless others who, like us, are learning grandparenting by the seat of their pants!” —Stuart and Jill Briscoe, Ministers-at-Large, Elmbrook Church, Brookfield, WI",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "Focus on the Family",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Proposals That Work: A Guide for Planning Dissertations and Grant Proposals",
        "Authors": "By Locke, Lawrence F., Spirduso, Waneen Wyrick, and Silverman, Stephen J.",
        "Description": "Previous editions of this best-selling book have helped over 100,000 students and professionals write effective proposals for dissertations and grants. The expanded Fourth Edition successfully covers all aspects of the proposal process, from the most basic questions about form and style to the task of seeking funding. The authors update their previous work with: a discussion of the effects of new technologies and the Internet on the proposal process; a new chapter on funding for student research; a totally revised chapter on qualitative research; and two completely new specimen proposals.Clear, accessible and reader-friendly the book provides both practical advice for the would-be writer and lengthy examples that show how effective proposal writing can be done.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Tales of Beedle the Bard, Standard Edition (Harry Potter)",
        "Authors": "By Rowling, J. K.",
        "Description": "The Tales of Beedle the Bard, a Wizarding classic, first came to Muggle readers&#39; attention in the book known as Harry Potter and the Deathly Hallows. Now, thanks to Hermione Granger&#39;s new translation from the ancient runes, we present this stunning edition with an introduction, notes, and illustrations by J. K. Rowling, and extensive commentary by Albus Dumbledore. Never before have Muggles been privy to these richly imaginative tales: \"The Wizard and the Hopping Pot,\" \"The Fountain of Fair Fortune,\" \"The Warlock’s Hairy Heart,\" \"Babbitty Rabbitty and Her Cackling Stump,\" and of course \"The Tale of the Three Brothers.\" But not only are they the equal of fairy tales we now know and love, reading them gives new insight into the world of Harry Potter. This purchase also represents another very important form of giving: From every sale of this book, Scholastic will give its net proceeds to Lumos, an international children’s charity founded in 2005 by J. K. Rowling. Lumos is dedicated to ending the institutionalization of children, a harmful practice that affects the lives of up to eight million disadvantaged children around the world who live in institutions and orphanages, many placed there as a result of poverty, disability, disease, discrimination and conflict; very few are orphans. Lumos works to reunite children with their families, promote family-based care alternatives, and help authorities to reform their systems and close down institutions and orphanages. www.wearelumos.org",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Children's High Level Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Tale of Despereaux Movie Tie-In Storybook: The Mouse and the Princess",
        "Authors": "By DiCamillo, Kate",
        "Description": "In this full-color storybook, Despereaux, the brave gentleman-mouse meets and falls instantly in love with Pea, the princess who is beautiful but prisoner to her father's grief. After Pea is kidnapped, Despereaux discovers he is the only one who can rescue her.and that even the tiniest mouse can find the courage of a knight in shining armor. Kate DiCamillo's literary classic about Despereaux Tilling has enchanted children and adults around the globe. In this tale of bravery, forgiveness and redemption, one small creature teaches a kingdom that it takes only a little light to show the truth: What you look like doesn't equal what you are.  Published in 23 languages, with more than 2 million copies in print, a New York Times #1 bestseller and winner of the Newbery Medal, The Tale of Despereaux is now animated adventure from Universal Pictures. THE TALE OF DESPEREAUX is a trademark and copyright of Universal Studios. Licensed by Universal Studios Licensing LLLP.  All Rights Reserved.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "WALT DISNEY PRODUCTIONS - THE LOVE BUG",
        "Authors": "By Gordon Bulford",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic Book Services",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Hellman's Mayonnaise Best Foods Over 100 Ways to Bring Out the Best (Favorite Recipes)",
        "Authors": "By Favorite Recipes",
        "Description": "",
        "Category": "",
        "Publisher": "CPC International",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Small ceremonies: A novel",
        "Authors": "By Shields, Carol",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Ryerson",
        "Price Starting With ($)": "31.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Best of the Best from Texas: Selected Recipes from Texas' Favorite Cookbooks",
        "Authors": "By McKee, Gwen (EDT) and Moseley, Barbara (EDT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Quail Ridge Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "The Great Race (Step-Into-Reading, Step 1)",
        "Authors": "By Milliron, Kerry, Lapadula, Thomas (ILT), and Binder, Eric (ILT)",
        "Description": "Bertie the Bus wants to race, and Thomas happily takes up the challenge. Bertie takes an early lead, but a patient Thomas proves there are advantages to riding on tracks instead of roads. Beginning readers will delight in this charming adaptation of the classic Thomas the Tank Engine story Thomas and Bertie.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Moments for Graduates (Moments to Give)",
        "Authors": "By Strand, Robert",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "New Leaf Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Moments for Grandparents (Moments to Give Series)",
        "Authors": "By Strand, Robert",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "New Leaf Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "How to Get Into the Bible",
        "Authors": "By Miller, Stephen and Gross, Paul",
        "Description": "In today's media-driven culture, how do you introduce the Bible to people who are used to movies, comic books, and USA Today?  You give them How to Get Into the Bible, a fast-paced, action-packed look at the main characters, events, and meanings of the Old and New Testament. Using with the reader-friendly Contemporary English Version, this book makes it even easier for adults who are unfamiliar with the Bible to get into the Scriptures.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Angels and Alchemy: A Mystical Love Story",
        "Authors": "By Gatti, Donna Wolfe",
        "Description": "",
        "Category": "",
        "Publisher": "Angel Academy Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Mike, Mike & Me (Red Dress Ink Novels)",
        "Authors": "By Markham, Wendy",
        "Description": "Fifteen years after choosing to marry one of the two Mikes in her life, Beau is living contentedly in the suburbs with her husband, until suddenly the other Mike, the one she did not choose, contacts her out of the blue, putting a strain on her marriage and forcing her to come to terms with her choices. Original. 60,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Working Mother's Guide to Life: Strategies, Secrets, and Solutions",
        "Authors": "By Mason, Linda",
        "Description": "After you’ve made the decision to return to work following the birth of a child, you may still wonder, “Am I doing the right thing for my family?” and “How on earth do I make this work?” Now, The Working Mother’s Guide to Life sets out to offer you hundreds of answers to these types of questions, from nuts-and-bolts advice, such as finding top-notch child care and stress-free ways to manage your household, to more complex issues like separating from your child without feeling guilty and creating a rich, strong family culture that will thrive regardless of whether or not you are working.Author Linda Mason—herself a working mom and founder of an award-winning company that cares for the children of working parents across the country—provides a reassuring, practical, and comprehensive guide based on interviews with more than 100 successful working mothers from diverse backgrounds. Here are countless strategies and tips from these experts on everything from household chores and returning to work with a newborn to finding communities of support.• Building the Three Pillars of Success: A supportive workplace, a “partner-in-parenting,” and excellent child care• Running a household, holding down a job, and thriving while keeping it all together—from getting food on the table to getting out the door in the morning • Setting your priorities, including nurturing your family, satisfying your employer, and taking care of your own needs • Tips from caregivers on how to help your children blossom and grow in a variety of child care settings",
        "Category": " Family & Relationships , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Spiritual Questions for the Twenty-First Century: Essays In Honor Of Joan D. Chittister",
        "Authors": "By Chittister, Joan (EDT) and Snyder, Mary Hembrow (EDT)",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Orbis Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Cheesecakes Sweet and Savory (Creative Cuisine)",
        "Authors": "By Maher, Barbara",
        "Description": "Shares recipes for crusts, pastries, crepes, sauces, tortes, cheesecakes, tarts, shortcakes, brownies, terrines, flans, vegetable molds, strudels, souffle rolls, and pizzas",
        "Category": " Cooking , General",
        "Publisher": "HP Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Destroyers",
        "Authors": "By Preston, Antony",
        "Description": "Photographs and cut-away drawings embellish an account of the deployment, actions, and fates of the great destroyers of all maritime powers during the two world wars",
        "Category": " Political Science , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Cooking Light 5 Ingredient 15 Minute Cookbook",
        "Authors": "By Oxmoor House (COR) and Cain, Anne Chappell (EDT)",
        "Description": "For busy home cooks, getting a meal on the table in 15 minutes or less, and with few ingredients, means more time with their family and less cost on their grocery bills. The Cooking Light 5-Ingredient 15-Minute Cookbook meets those needs and delivers-with big flavor and nutritious dishes. And instead of just giving you recipes, we're giving you meals-94 in all! Each meal features a main-dish recipe and either a short recipe to go with it or suggestions for commercial side items. Plus there's a photograph of every meal! Grocery Shopping SolutionsWith each meal plan, you get a grocery list of everything you need to complete the meal. Stock up on the ingredients from the Stress-Free Grocery List, and you can make one-third of the recipes in this book. No WorriesThe nutrient analysis with every recipe gives you values for calories, fat, protein, carbohydrate, fiber, cholesterol, and sodium. You can use the exchange values to fit the recipes into your meal plan.All This with Only 5 Ingredients?You'll be surprised at all the recipes you can make using only 5 ingredients: Chicken Alfredo Pasta, Deep-Dish Pizza Casserole, Speedy Chicken Cacciatore, Teriyaki Roast Chicken, Barbecue Pork Chops ...just to name a few.Avoid the Rush HourWhen you have only 15 minutes to get dinner on the table, try these recipes: Cajun-Style Swordfish, Fresh Tomato Pizza, Ground Beef Stroganoff, Chili Bacon Burgers, Teriyaki-Ginger Pork Tenderloin, Zesty Fettuccine and Shrimp.Added ValueCreate 5 different desserts or salads from different combinations of the same 5 ingredients. Start with easy-to-make recipes in the Mix & Match chapter like Three-Bean Salad, Tex-Mex Salad, Strawberry Shortcakes, and Brownie Sundaes.Slow Down to Speed UpLearn how to let a slow cooker do the work for you. All with 5 ingredients or less, these recipes are worth coming home to: Chili Grande, Chicken Pepper Pot, Italian Pot Roast, Glazed Turkey.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Rand Mcnally Classroom Atlas",
        "Authors": "By Rand McNally (COR)",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Knitting into the Mystery: A Guide to the Shawl-Knitting Ministry",
        "Authors": "By Jorgensen, Susan S. and Izard, Susan S.",
        "Description": "Knitters there are 38 million of them in the United States alone - are part of a long and quiet tradition that's both plainly practical and deeply spiritual. With needles clicking, they weave together not just garments to warm the body but also comfort and companionship to nurture the soul. This tradition is flowering today through knitting ministries, a worldwide ecumenical movement of small groups of women who gather to pray and knit for those in need. As they create shawls for people burdened with illness and sorrow, their handiwork becomes an expression, not only of their love and concern, but also of the loving care of the God who works through them.In this beautifully illustrated book, the authors - a United Church of Christ minister and a Roman Catholic laywoman - share stories of how the knitting ministry has touched lives and hearts around the world. They offer directions for knitting the shawls and for starting a parish or community knitting ministry. The book also provides a selection of prayers, written from many faith traditions, to offer along with each completed shawl.",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "Morehouse Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Pleasure of Chinese Cooking",
        "Authors": "By Grace Zia Chu",
        "Description": "",
        "Category": "",
        "Publisher": "Cornerstone Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "A short history of painting in America;: The story of 450 years",
        "Authors": "By Richardson, Edgar Preston",
        "Description": "",
        "Category": "",
        "Publisher": "Crowell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Never Tell a Lie: A Novel of Suspense",
        "Authors": "By Ephron, Hallie",
        "Description": "It all started with the yard sale. Ivy was eight months and one week pregnant when she insisted that she and her husband, David, clean out the junk they'd inherited with the old Victorian house they'd bought three years before. Call it nesting, call it nerves she just wanted it all gone: the old electrical fixtures, the boxes of National Geographies from the 1960s, the four black wool greatcoats.Neither she nor David recognized the woman at first. But it turned out that the customer asking about the lime-green glass swan dish - the woman who looked just about as pregnant as Ivy - was none other than Melinda White, a former high school classmate of David and Ivy's. When Melinda was a child she used to play in their new house, she explained. It looked like they'd been doing some work. Would it be all right if she took a look around? David took Melinda inside. And she never came out.Now David's under police suspicion, and Ivy finds herself digging deep into the past to clear his name. But David's history, she begins to discover, is not necessarily the history she remembers, and before long Ivy has uncovered a twisted web of deceit, betrayal, and lies, both the ones we tell those we love and the ones we tell ourselves...Relentlessly fast-paced and disturbingly creepy, Never Tell a Lie is a page-turning thrill ride about how well we know the people we love, and how far we are willing to go to protect the secrets of our past.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Look Again",
        "Authors": "By Scottoline, Lisa",
        "Description": "When reporter Ellen Gleeson gets a “Have You Seen This Child?” flyer in the mail, she almost throws it away. But something about it makes her look again, and her heart stops—the child in the photo is identical to her adopted son, Will. Her every instinct tells her to deny the similarity between the boys, because she knows her adoption was lawful. But she’s a journalist and won’t be able to stop thinking about the photo until she figures out the truth. And she can’t shake the question: if Will rightfully belongs to someone else, should she keep him or give him up? She investigates, uncovering clues no one was meant to discover, and when she digs too deep, she risks losing her own life—and that of the son she loves. Lisa Scottoline breaks new ground in Look Again, a thriller that’s both heart-stopping and heart-breaking, and sure to have new fans and book clubs buzzing.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Mr. and Miss Anonymous",
        "Authors": "By Michaels, Fern",
        "Description": "Two teenage boys are missing and their disappearance may be linked to a shady fertility clinic Peter Kelly and Lily Madison visited in college as penniless students. When Pete and Lily learn that one of the missing boys looks exactly like Pete, they set out to discover what really went on at the clinic all those years ago.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "To Love Again: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "In Rome, Isabella and her husband, Amadeo, have created an idyllic marriage and the House of San Gregorio, the most exciting name in European high fashion.  But in an act of terrorism, Amadeo is kidnapped and taken from Isabella forever.  Fleeing to New York, she fights to build a new life for herself and her son, as they discover new worlds and a new life together.",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Delta: America's Elite Counterterrorist Force (Power)",
        "Authors": "By Griswold, Terry and Giangreco, D. M.",
        "Description": "The war that may never end is the war on terror, and the most elite U.S. counterterrorism force are the DELTA troops. They receive intense, specialized training at Fort Bragg in North Carolina and are deployed worldwide to help thwart terrorist activities. This new and expanded edition of DELTA is a fascinating look into the world of the DELTA trooper. Its detailed text and 100 photos take the reader inside the closed Special Operations Training Facility at Fort Bragg. This book shows how these elite counterterrorists are recruited, selected and trained, and the tactics they use to fight the ongoing war on terror.",
        "Category": " History , Military , United States",
        "Publisher": "Zenith Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Biggest Loser Success Secrets: The Wisdom, Motivation, and Inspiration to Lose Weight--and Keep It Off!",
        "Authors": "By Greenwood-Robinson, Maggie",
        "Description": "Millions of viewers have watched the contestants on The Biggest Loser, NBC's hit show, radically transform their bodies and their lives. In turn, many of those inspired fans have shed countless pounds on their own by following The Biggest Loser weight-loss program.  But as anyone who has tried to get in shape knows, the hardest part of any regimen isn't the battle of the bulge--it's the battle of the mind! Now, the contestants share their diet and exercise success secrets and confess what helped them overcome their biggest challenges. Through their astonishingly candid revelations, you'll learn how to:-Find the time and energy to work out-Overcome powerful cravings for your favorite foods-Avoid slipping back into unhealthy-but comfortable-habits-Power through weight-loss plateaus-Overcome the temptation to quit and regain focus-Maintain weight after reaching your goal  Staying healthy is a daily battle-and The Biggest Loser contestants have learned what it takes to win! Discover how their tried-and-true diet and exercise tips, insider wisdom, and personal stories can help you achieve your goals and live the life you've always wanted.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Johnny U: The Life and Times of John Unitas",
        "Authors": "By Callahan, Tom",
        "Description": "In a time “when men played football for something less than a living and something more than money,” John Unitas was the ultimate quarterback. Rejected by Notre Dame, discarded by the Pittsburgh Steelers, he started on a Pennsylvania sandlot making six dollars a game and ended as the most commanding presence in the National Football League, calling the critical plays and completing the crucial passes at the moment his sport came of age.Johnny U is the first authoritative biography of Unitas, based on hundreds of hours of interviews with teammates and opponents, coaches, family and friends. The depth of Tom Callahan’s research allows him to present something more than a biography, something approaching an oral history of a bygone sporting era. It was a time when players were paid a pittance and superstars painted houses and tiled floors in the off-season—when ex-soldiers and marines like Gino Marchetti, Art Donovan, and “Big Daddy” Lipscomb fell in behind a special field general in Baltimore. Few took more punishment than Unitas. His refusal to leave the field, even when savagely bloodied by opposing linemen, won his teammates’ respect. His insistence on taking the blame for others’ mistakes inspired their love. His encyclopedic football mind, in which he’d filed every play the Colts had ever run, was a wonder.In the seminal championship game of 1958, when Unitas led the Colts over the Giants in the NFL’s first sudden-death overtime, Sundays changed. John didn’t. As one teammate said, “It was one of the best things about him.”",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Sharp focus watercolor painting: Techniques for hot-pressed surfaces",
        "Authors": "By Shook, Georg",
        "Description": "",
        "Category": "",
        "Publisher": "Watson-Guptill Publications",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Skylark (Sequel to \"Sarah, Plain and Tall\") Harper Trophy",
        "Authors": "By MacLachlan, Patricia",
        "Description": "The second book in the series that began with the Newbery Medal–winning Sarah, Plain and Tall by Patricia MacLachlan.My mother, Sarah, doesn't love the prairie. She tries, but she can't help remembering what she knew first.Sarah came to the prairie from Maine to marry Papa. But that summer, a drought turned the land dry and brown. Fires swept across the fields and coyotes came to the well in search of water. So Sarah took Anna and Caleb back east, where they would be safe. Papa stayed behind. He would not leave his land.Maine was beautiful, but Anna missed home, and Papa. And as the weeks went by, she began to wonder what would happen if the rains never came. Would she and Caleb and Sarah and Papa ever be a family again?",
        "Category": " Juvenile Fiction , Family , Blended Families",
        "Publisher": "Harper Trophy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "SilverFin (Young Bond, No.1)",
        "Authors": "By Higson, Charlie",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Hit and Run",
        "Authors": "By McDaniel, Lurlene",
        "Description": "If no one meant for it to happen, should someone be guilty?Analise: She knows the roads and feels secure riding her bike.Laurie: When asked out by Quin, Laurie is happy. Then his car hits something. Later, Laurie realizes there is a way to get Quin to date her.Quin: Because Quin is athletically gifted, his father expects him to get a scholarship. Nothing is to get in his way of college, athletics, money, and success. When he realizes what has happened, he decides he must not let it ruin his future.Jeremy: It's been the perfect relationship with Analise. Little does Jeremy realize that the beautiful wood he carves will be used for something for Analise.As the lives of people who never wanted to hurt others intersect, harsh realities of choices that cannot be changed are explored.",
        "Category": " Young Adult Fiction , Social Themes , Death, Grief, Bereavement",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Monster House: There Goes the Neighborhood...: A Novelization Based on the New Movie",
        "Authors": "By Hughes, Tom (ADP)",
        "Description": "Twelve-year-old DJ Walters always knew there was something strange about the house across the street: toys mysteriously disappeared when they wound up on its lawn, and Mr. Nebbercracker himself acted like he had a secret to hide. But this Halloween the house has become a living, breathing monster, and people have started to disappear! The trouble is that no one believes DJ and his friends. So they vow to find out what's inside the house and how to defeat it. But can they do it before it destroys the entire neighborhood and gobbles up every trick-or-treater in sight?",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Studies of nature on the coast of Arran",
        "Authors": "By George Milner",
        "Description": "",
        "Category": "",
        "Publisher": "London : Longmans, Green, and Co.",
        "Price Starting With ($)": "61.07",
        "Publish Date": {
            "Month": "January",
            "Year": "1894"
        }
    },
    {
        "Title": "Leucaena promising forage and tree crop for the Tropics",
        "Authors": "By National Academy of Sciences",
        "Description": "",
        "Category": "",
        "Publisher": "National Academy of Sciences",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Tangled Web: The Making of Foreign Policy in the Nixon Presidency",
        "Authors": "By Bundy, William P",
        "Description": "His diverse career as editor of Foreign Affairs magazine, and in intelligence and foreign policy positions under several administrations positions Bundy in a unique vantage point to challenge Nixon-Kissinger foreign policy \"successes\" in regard to establishing relations with China, initiating detente with the USSR, and ending US participation in the Vietnam War. He faults patterns focusing on short-term domestic gains and deceptive tactics many perceived only in a Watergate context. Includes several b&w photographs and maps. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Hill & Wang Pub",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "GOD'S PROMISES for YOU: Scripture Selections from Max Lucado",
        "Authors": "By Lucado, Max and Gibbs, Terri (Ed)",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark Cards, Inc./J. Countryman/Thomas Nelson, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The True Book of Bacteria",
        "Authors": "By Anne Frahm",
        "Description": "",
        "Category": "",
        "Publisher": "Children's Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "The Heritage Copernicus: Theories \"Pleasing to the Mind\"",
        "Authors": "By Neyman, Jerzy (EDT)",
        "Description": "From the Preface: This book represents the implementation of a decision adopted by the Council of the National Academy of Sciences relating to the celebration of the 500th anniversary of the birth of Nicholas Copernicus. From the outset it was intended that this Copernican volume would describe a number of Copernican-type intellectual revolutions that have taken place in recent centuries. Such revolutions are characterized by the abandonment of widely held concepts and replacement by dramatically new conceptualizations that resulted in deepened understanding of natural processes.It was the original intention of the Academy's Council that the essays would be addressed to the general educated public, including teaching staffs of colleges and high schools and college students. The combination of the intended broad coverage and the contemplated readership presented considerable difficulties and affected the choice of incidents in the history of modern science which could be discussed. As it has turned out, the material presented is quite rich and, while there is an unavoidable variation in the amount of specialized knowledge expected from the reader, we hope that the summaries preceding particular chapters are sufficient to create a broad perspective and make the whole understandable. To the extent that our goals have been approached, the help of numerous scientists is gratefully acknowledged.The introductory chapter describes the circumstances and the essence of the initial intellectual revolution due to Copernicus himself. The subsequent six parts present in turn: (1) several revolutions in astronomy-cosmology, all in the twentieth century and one of them still in progress; (2) a number of deep revolutionary changes in the biological sciences, one of them made twenty years ago by an inspired contribution of a graduate student; (3) several revolutionary changes in the physical sciences; (4) revolutions in the thinking of mathematicians; (5) the emergence of a \"pluralistic\" point of view in scientific research; and (6) revolutions in technology.The epoch when it was possible for individuals to acquire a reasonably detailed view of practically all of science is now far behind us. It was followed by a prolonged period of compartmentalization of research, with specialists in one domain becoming increasingly ignorant of developments in another. In the present epoch the pendulum appears to be moving in the opposite direction. The many problems faced by modern society depend for their solution on interdisciplinary studies and on participation of individuals with wide horizons. It is hoped that the publication of the present volume will serve not only to commemorate the achievements of Nicholas Copernicus but also to stimulate and accelerate this trend.",
        "Category": " Science , Physics",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1974"
        }
    },
    {
        "Title": "The Assassin King (The Symphony of Ages)",
        "Authors": "By Haydon, Elizabeth",
        "Description": "The Assassin King opens at winter's end with the arrival by sea of a mysterious hunter, a man of ancient race and purpose, who endlessly chants the names of the pantheon of demons that are his intended victims, as well as one other: Ysk, the original name of the Brother, now known as Achmed, the Assassin King of Ylorc. At the same moment of this portentous arrival, two gatherings of great import are taking place. The first is a convocation of dragons, who gather in a primeval forest glade--the site of the horrific ending of Llauron, one of the last of their kind. They mourn not only his irrevocable death, but the loss of the lore and control over the Earth itself that it represents. The ancient wyrms are terrified for what will come as a result of this loss.The second gathering is a council of war held in the depths of the keep of Haguefort: Ashe and Rhapsody, rulers of the alliance that protects the Middle Continent; Gwydion, the new Duke of Navarne; Anborn, the Lord Marshall; Achmed, the King of Ylorc, and Grunthor, his Sergeant-Major. Each brings news that form the pieces of a great puzzle. And as each piece is added it becomes quite clear: War is coming, the likes of which the world has never known.Cataclysm, both large and small, await in this sixth volume of the USA Today bestselling fantasy series, The Symphony of Ages. A twisting, fast-moving tale,The Assassin King promises endless surprises--most of which lead to pain.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Command Decision (Vatta's War, Book 4)",
        "Authors": "By Moon, Elizabeth",
        "Description": "With the Vatta’s War series, award-winning author Elizabeth Moon has claimed a place alongside such preeminent writers of military science fiction as David Weber and Lois McMaster Bujold. Now Moon is back–and so is her butt-kicking, take-no-prisoners heroine, Kylara Vatta. Once the black-sheep scion of a prosperous merchant family, Kylara now leads a motley space force dedicated to the defeat of a rapacious pirate empire led by the mysterious Gammis Turek. After orchestrating a galaxy-wide failure of the communications network owned and maintained by the powerful ISC corporation, Turek and his marauders strike swiftly and without mercy. First they shatter Vatta Transport. Then they overrun entire star systems, growing stronger and bolder. No one is safe from the pirate fleet. But while they continue to move forward with their diabolical plan, they have made two critical mistakes.Their first mistake was killing Kylara Vatta’s family.Their second mistake was leaving her alive.Now Kylara is going to make them pay.But with a “fleet” consisting of only three ships–including her flagship, the Vanguard, a souped-up merchant cruiser–Kylara needs allies, and fast. Because even though she possesses the same coveted communication technology as the enemy, she has nowhere near their numbers or firepower.Meanwhile, as Kylara’s cousin Stella tries to bring together the shattered pieces of the family trading empire, new treachery is unfolding at ISC headquarters, where undercover agent Rafael Dunbarger, estranged son of the corporation’s CEO, is trying to learn why the damaged network is not being repaired. What he discovers will send shock waves across the galaxy and crashing into Kylara’s newly christened Space Defense Force at the worst possible moment.",
        "Category": " Fiction , Science Fiction , Space Opera",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Alien Crimes",
        "Authors": "By Resnick, Mike (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Science Fiction Book Club",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "PA Breweries: 3rd Edition (Breweries Series)",
        "Authors": "By Bryson, Lew",
        "Description": "A new and updated tour of 53 of Pennsylvania's breweries and brewpubs. Beer writer and connoisseur Lew Bryson brings new establishments to the list, revisits some old favorites, relates some of the history of brewing in the state, and gives information for each site on tours, beers brewed, food served, and nearby lodging and attractions, along with his pick of favorite beer for each brewery.",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Night of the New Magicians (Magic Tree House #35)",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "Merlin sends Jack and Annie on a mysterious mission to Paris, France, over a 100 years ago. There they must find four magicians and give them an urgent message from Merlin himself. When Jack and Annie land in Paris, they make their way to the 1889 World’s Fair. Below the Eiffel Tower, built especially for the fair, there are thousands of exhibits from all over the world. But how will Jack and Annie find the magicians in the crowds of people? And who are the magicians anyway? Jack and Annie are about to find out in another adventure filled with history, magic, and amazing surprises!",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Stanley, Flat Again!",
        "Authors": "By Pamintuan, Macky (ILT) and Brown, Jeff",
        "Description": "Is Stanley flat again!?Stanley Lambchop has had his share of unusual adventures. But being flat was one thing he thought he was through with forever. Then one morning, he discovers he was wrong. Still, there is so much that a boy who is only one inch thick can do that a round person can’t. Maybe this time, all it will take is one amazing event for everything to finally make sense.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "How To Play Dirty Tennis -",
        "Authors": "By Lardner, Rex",
        "Description": "",
        "Category": "",
        "Publisher": "HAWTHORN BOOKS, INC.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "God's Promises Spirit Of America",
        "Authors": "By Countryman, Gibbs",
        "Description": "",
        "Category": " Bibles , King James Version , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Preparing for a Healthy Baby: A Pregnancy Book",
        "Authors": "By Kendis Moore Drake",
        "Description": "",
        "Category": "",
        "Publisher": "Trimester, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2021"
        }
    },
    {
        "Title": "CliffsNotes on Shakespeare's Hamlet (Cliffsnotes Literature Guides)",
        "Authors": "By Stockton, Carla Lynn",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.Something may be rotten in the state of Denmark, but your grades will be sweet when you rely on CliffsNotes on Hamlet as you digest Shakespeare&#39;s tragic masterpiece. In this play, Hamlet explores the meaning of life, death, eternity, relationships, hypocrisy, truth, the existence of God, and almost anything else that concerns mankind.Character studies shed new light on Prince Hamlet, his father King Hamlet, the malevolent Claudius, the troubled Ophelia—and the rest of the cast. You&#39;ll also explore the life and times of William Shakespeare, and unlock the play&#39;s themes and literary devices. Count on CliffsNotes on Hamlet for detailed summaries and commentaries on every scene to help you appreciate the complexity of the play.Other features that help you study include Character analyses of major playersA character map that graphically illustrates the relationships among the charactersCritical essaysA review section that tests your knowledgeClassic literature or modern-day treasure—you&#39;ll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Literary Criticism , Reference",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Annable's Treasury of Literary Teasers",
        "Authors": "By Annable, H. D.",
        "Description": "Trivia for the literati. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Secrets of the Samurai: The Martial Arts of Feudal Japan",
        "Authors": "By Ratti, Oscar and Westbrook, Adele",
        "Description": "Traces the history of the martial arts of Japan from the feudal period, illustrating implements and characteristic dress",
        "Category": " Sports & Recreation , General",
        "Publisher": "Tuttle Publishing",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "The Ex-Debutante",
        "Authors": "By Lee, Linda Francis",
        "Description": "When Carlisle Wainwright Cushing left her native Texas to start a new life in Boston, she had no regrets. The former Texas debutante, who never felt at home in her Southern skin, had found liberation--or so she thought. Until the day she gets an urgent call from her mother, reporting that: one, the Symphony Association Debutante Ball, which Carlisle's family has sponsored for years, is about to be called off; Two, her mother's divorce has the whole town talking; And three, the family's good name is at stake and Carlisle is the only one who can fix it all. So Carlisle takes a leave of absence from her law firm and goes to Texas to help. Her fiance, who has no idea she's an heiress, can't know that she's organizing the ball, handling the dramas of the girls involved, settling her mother's suit--and coming face to face with the true love of her life, whom she ran out on when she left Texas. Her trip home challenges Carlisle's sense of herself and brings the pieces of her past togther, so that when she finally re-meets the man of her dreams, she's in a perfect place to tempt fate.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Pocket Daring Book for Girls: Things to Do",
        "Authors": "By Buchanan, Andrea J., Peskowitz, Miriam B., and Seabrook, Alexis (ILT)",
        "Description": "A portable, pocket-sized take on the bestselling phenomenon,The Daring Book for Girls, this book is filled with many favorite activities from the original, plus some exciting new games, crafts, and projects. Whether following tips for riding a skateboard, learning how to run faster, or making a skirt out of a pillowcase, the most daring of girls will be occupied all season long. The Pocket Daring Book for Girls: Things to Do also includes the long-awaited chapter, \"Make Your Own Zip Line,\" along with classic instructions for activities like Fourteen Games of Tag, Marco Polo, How to Be a Spy, Washing the Car and Building a Campfire. It would be remiss not to mention that the book teaches girls a skill not found in the original DARING BOOK FOR GIRLS, namely, how to make a fifteen-foot backyard geyser from a concoction of Mentos and Diet Coke, and that the book holds the definitive answer to the age-old question, Can you really fry an egg on the sidewalk?Join girls everywhere who are pursuing these delightful activities and living out the Daring Girls credo: Enjoy yourself. Learn new things. Lead an Interesting Life.",
        "Category": " Young Adult Nonfiction , Reference",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Are You Ready!: Take Charge, Lose Weight, Get in Shape, and Change Your Life Forever",
        "Authors": "By Harper, Bob",
        "Description": "The world-renowned fitness coach on the hit TV show The Biggest Loser presents his winning approach to lasting weight loss by showing how to get at the root of your overeating problem, followed by a nutritionally savvy diet and unique exercise plan.On The Biggest Loser, Bob Harper gives contestants the practical tools and psychological insights they need to get into the best shape of their lives. The key to his success is the emotional connection he makes with each participant, and he brings that same spirit to Are You Ready! Harper starts with a four-step strategy for getting at the root of negative thought patterns and destructive behaviors, replacing both with a clear way to build self-worth and confidence. With these tools in place, people are empowered to make real, lasting changes in their lives. In an easy-to-follow eating plan, he provides lists of foods that are nutrient-dense and naturally low in calories, more than twenty sample menus, and tips on eating on the run, in restaurants, and on vacation. His fitness plan is geared to making exercise an integral part of daily life with workouts (ranging from 20 to 60 minutes) based on training techniques that tone and strengthen, burn calories, and reshape the body.Woven throughout Are You Ready! are true-life success stories that will keep readers engaged and motivated; bulleted tips, tools, and coping strategies; and sidebars debunking common myths about food and fitness. Whether your goal is losing ten pounds or a hundred, you will find Harper’s message inspiring and his methods a proven path to finally achieving your dream of weight loss and fitness.",
        "Category": " Health & Fitness , Weight Loss",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Introduction to Chemistry for Biology Students, An (8th Edition)",
        "Authors": "By Sackheim, George I.",
        "Description": "This workbook uses a novel approach in which the text is composed of short statements on the basic rules and facts of chemistry followed by numerous questions that test the student's knowledge and understanding. The result is a thorough, systematic review of basic chemistry for students of biology. Sackheim is emeritus professor of chemistry at the U. of Illinois in Chicago. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Science , Chemistry , General",
        "Publisher": "Benjamin Cummings",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Angel Blessings: A Touch of Love from Heaven Above",
        "Authors": "By Kuck, Sandra (ILT)",
        "Description": "",
        "Category": " Religion , Christianity , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Of a Fire on the Moon",
        "Authors": "By Mailer, Norman",
        "Description": "",
        "Category": "",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Ophelia's Mom: Women Speak Out About Loving and Letting Go of Their Adolescent Daughters",
        "Authors": "By Shandler, Nina and Shandler, Sara (FRW)",
        "Description": "Mothers of adolescent girls speak out on the challenges, frustrations, and concerns of dealing with teenagers, discussing such topics as love and sex, friends, drugs and alcohol, menstruation and menopause, divorce, rejection, separation, feminism, and other changes in their daughters' and their own lives. 50,000 first printing.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Dazzle the Dinosaur",
        "Authors": "By Marcus Pfister",
        "Description": "",
        "Category": "",
        "Publisher": "North-South Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Why a Daughter Needs a Dad: A Hundred Reasons",
        "Authors": "By Lang, Gregory E. and Lankford-Moran, Janet",
        "Description": "A Girl's Constant Hero, No One Treasures a Daughter Quite Like a Dad To a daughter, no one is stronger or braver than Dad. Whether someone to laugh with or a shoulder to cry on there's no place safer than in her father's arms.  Dad's love is a steadfast guide as his little girl becomes the woman she's destined to be. A Daughter Needs a Dad... —to tell her truthfully that she is the most beautiful of all. —to be the safe spot she can always turn to. —to teach her what it means to always be there.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Cumberland House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Monster Garage Monster Nation Jr. - The Coolest Custom Cars From Coast to Coast",
        "Authors": "By Holcomb, Carrie E.",
        "Description": "",
        "Category": "",
        "Publisher": "Discovery Channel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "American Oak Furniture",
        "Authors": "By McNerney, Kathryn",
        "Description": "Shows antique frames, telephones, fern stands, tables, chairs, sideboards, cabinets, wardrobes, beds, dressers, commodes, benches, chests, and desks, and lists their current value",
        "Category": " Antiques & Collectibles , Furniture",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Fit & Pregnant: The Pregnant Woman's Guide To Exercise",
        "Authors": "By Butler, Joan Marie",
        "Description": "Discusses physical fitness for women during and after pregnancy, details the safety aspects of exercise during pregnancy, and looks at sports including skiing, running, cycling, and weight training",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Vitesse Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    }
]