[
    {
        "Title": "Better Homes and Gardens: Salads (Cooking for Today)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Offers advice on preparing salads and shares recipes featuring beef, pork, lamb, poultry, fish, and seafood",
        "Category": " Cooking , Courses & Dishes , Salads",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Vegetable Gardener's Journal",
        "Authors": "By Oliver E. Allen",
        "Description": "",
        "Category": "",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "William Shakespeare Sonnets",
        "Authors": "By William Shakespeare",
        "Description": "",
        "Category": "",
        "Publisher": "Lowe & B. Hould",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Sh*t Happens: The Book",
        "Authors": "By Lazarus, Debbie",
        "Description": "The lure of the morbid. The fascination of really bad news. The strange thrill of things going spectacularly wrong. Tragic, sensational, spine-chilling, and addictively entertaining, it’s The Darwin Awards meets The Stupidest Things Ever Said. In story after story we meet the star-crossed, the extremely unlucky, and the fatally foolish. Sure—it’s grim, sometimes ghastly. But isn’t it nice to know that someone, somewhere, had a worse day than you?Sh*t happens.Sometimes it’s natural: A driver goes for the ride of his life when a 100-mph gust blows his truck off the Verrazano Narrows Bridge in New York. (He survives the steep plunge into the Hudson River.Sometimes it’s supernatural: The woman who peels an artichoke only to have it explode in her hand.Short-sighted: A rattlesnake owner kisses his beloved pet, and discovers that the affection isn’t mutual.Delightful: A tanker truck carrying liquid chocolate splits open in a traffic accident, drawing children from miles around.Unexpected: A folding bed traps and nearly kills a man.Heartbreaking: Art restorers accidentally dissolve the ink off a newly discovered Da Vinci drawing.Gross: From the brain of a man complaining of mental instability, doctors remove a four-inch worm.And grosser: A diner discovers—in the most revolting way possible—a rodent along with his fried chicken.And even, seemingly, cosmic justice: An incensed homeowner catches a mouse and decides to teach it a lesson by tying a kerosene-soaked rag to its tail and setting it on fire. The mouse flees; the man’s house burns down.",
        "Category": " Humor , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Grave Surprise (Harper Connelly Mysteries)",
        "Authors": "By Harris, Charlaine",
        "Description": "At the request of anthropology professor Dr. Clyde Nunley, Harper Connelly and her stepbrother Tolliver come to Memphis to give a demonstration of Harper's unique talent. And what better place to have that demonstration than in a very old cemetery?Dr. Nunley doesn't bother to hide his skepticism, especially when Harper stands atop a grave and senses two bodies beneath her - one of a centuries-dead man and the other of a young girl, recently deceased. When the grave is opened, Harper's claim is proven true. The dead girl is Tabitha Morgenstern, an eleven-year-old abducted from Nashville two years previously - a child whom Harper had tried, and failed, to find. The coincidence raises suspicions about her among the police - so she and Tolliver undertake their own hunt to find the killer. The make a nocturnal visit to the cemetery, hoping that Harper can sense something further about the murder. And then the next morning, a third dead body is found in the grave.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "BERKLEY PRIME CRIME",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Castle Dor",
        "Authors": "By Sir Arthur Quiller-Couch, Daphne Du Maurier",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "The Class Of 1846: From West Point To Appomattox - Stonewall Jackson, George Mcclellan And Their Brothers",
        "Authors": "By Waugh, John C",
        "Description": "Follows the West Point class of 1846--including such famous military leaders as George McClellan, Stonewall Jackson, and George Pickett--through their military careers. 17,500 first printing. History Bk Club Main. BOMC Alt.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Beneath a Harvest Sky (Desert Roses #3)",
        "Authors": "By Peterson, Tracie",
        "Description": "As a Harvey tour guide, Rainy Gordon spends her days in the magnificent landscape of New Mexico. Having already fled a tainted past, Rainy is alarmed when she becomes a suspect in an investigation of stolen Hopi Indian artifacts. The man she loves has been secretly asked to assist the law enforcement groups in finding the thief. When all evidence points in her direction, will the truth be revealed in time?",
        "Category": " Fiction , Religious",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "11.48",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Going Too Far",
        "Authors": "By Echols, Jennifer",
        "Description": "HOW FAR WOULD YOU GO?    All Meg has ever wanted is to get away. Away from high school. Away from her backwater town. Away from her parents who seem determined to keep her imprisoned in their dead-end lives. But one crazy evening involving a dare and forbidden railroad tracks, she goes way too far...and almost doesn't make it back.   John made a choice to stay. To enforce the rules. To serve and protect. He has nothing but contempt for what he sees as childish rebellion, and he wants to teach Meg a lesson she won't soon forget. But Meg pushes him to the limit by questioning everything he learned at the police academy. And when he pushes back, demanding to know why she won't be tied down, they will drive each other to the edge -- and over....",
        "Category": " Young Adult Fiction , Social Themes , Dating & Sex",
        "Publisher": "MTV Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Forgiving Solomon Long",
        "Authors": "By Well, Chris",
        "Description": "",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Arizona Brides: Land of Promise/Refining Fire/Road to Forgiveness (Heartsong Novella Collection)",
        "Authors": "By Cox, Carol",
        "Description": "Historical Romance: Hard work and difficult circumstances are a way of life for these three pioneer women. Elizabeth gladly sets off for the newly formed Arizona Territory until she discovers the truth behind her awful arrangement. Will she ever be able to find the independence she longs for? Jenny isn't able to trust anyone after being abandoned and mistreated as a child. Will she open up her heart to romance and ultimately God? Hallie's impatient but well-meaning father sabotages her quest for a happily ever after with Jacob. Somehow she must help her father face his own demons and allow room for romance.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Publishing, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Riding the Bull:: My Year in the Madness at Merrill Lynch",
        "Authors": "By Stiles, Paul",
        "Description": "The author tells how he left small-town life for a harrowing year at Merrill Lynch, where he learned the methods--and the back-stabbing--behind the madness of Wall Street and found himself changing for the worse. 25,000 first printing.",
        "Category": " Business & Economics , Investments & Securities",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The One Year Book of Devotions for Boys",
        "Authors": "By Tyndale (COR)",
        "Description": "Both boys and girls will be eager to read these devotionals created just for them from the same people who created the One Year Book of Devotions for Kids #1-3. A variety of themes relevant to today’s elementary school-age boys and girls will encourage and challenge them to personalize lessons from Scripture. FEATURES:365 daily devotionalsBible passages to set up each day’s themeA contemporary story to apply each passage to today’s boys and girlsDaily memory verse“Key” for each devotional summarizing the applicationComplete topic, Scripture reading, and memory verse indexes",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "Tyndale Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Getting Naked Again: Dating, Romance, Sex, and Love When You've Been Divorced, Widowed, Dumped, or Distracted",
        "Authors": "By Sills, Judith",
        "Description": "You are divorced, you're widowed, or maybe you've just been busy with other things. Lately though you might be ready (are you?) to meet (but where, and how?) another romantic partner.  In GETTING NAKED AGAIN, clinical psychologist and New York Times bestselling author Judith Sills, PhD, leads readers through each stage of the process, offering sophisticated advice and sharing insightful stories about women like you, who have experienced relationship loss and are successfully pursuing new romance. Sills offers a frank, funny, and unusually savvy look at midlife dating-  including smart sexual strategies, predictable new relationship patterns, financial manuvering, and interpersonal finesse. Be prepared:  This is not your daughter's dating guide.  Judith Sills is a regular contributor and relationship expert on the Today show and in other national media outlets. She is the author of many bestselling books, including Excess Baggage, A Fine Romance, and The Comfort Trap.",
        "Category": " Family & Relationships , Divorce & Separation",
        "Publisher": "Grand Central Life & Style",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The New Virginia One-Day Trip Book: From the Mountains to the Sea, Six Geographical Regions Offer 375 Scenic, Historic and Recreational Delights",
        "Authors": "By Ockershausen, Jane",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Epm Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Competitiveness Through Total Cycle Time: An Overview for Ceo's",
        "Authors": "By Thomas, Philip R.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Witch & Wizard",
        "Authors": "By Patterson, James and Charbonnet, Gabrielle",
        "Description": "The world is changing: the government has seized control of every aspect of society, and now, kids are disappearing. For 15-year-old Wisty and her older brother Whit, life turns upside down when they are torn from their parents one night and slammed into a secret prison for no reason they can comprehend. The New Order, as it is known, is clearly trying to suppress Life, Liberty, and the Pursuit of Being a Normal Teenager. But while trapped in this totalitarian nightmare, Wisty and Whit discover they have incredible powers they'd never dreamed of. Can this newly minted witch and wizard master their skills in time to save themselves, their parents--and maybe the world?",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "jimmy patterson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Meco Barbecue and Smoker Cookbook",
        "Authors": "By Southern Living",
        "Description": "",
        "Category": "",
        "Publisher": "Meco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "A New Owner's Guide to Yorkshire Terriers",
        "Authors": "By Jackson, Janet",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Twice And For Always",
        "Authors": "By Thacker, Cathy Gillen",
        "Description": "After enrolling her child, a fraternal twin, in Forrester Day Care, Meg Bassett is stunned to discover that her ex-husband, who she has not seen in five years and who has custody of the other twin, is enrolled there as well, an uncomfortable situation that leads to a second chance at love. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The English Breakfast Murder (A Tea Shop Mystery)",
        "Authors": "By Childs, Laura",
        "Description": "It is a truly exhilarating experience for Indigo Tea Shop owner Theodosia Browning-helping Charleston's Sea Turtle Protection League shepherd hundreds of tiny green loggerheads safely into the sea. But just as she's about to celebrate all her hard work, she spots a dead body bobbing in the waves. Now it's up to Theo to get to the bottom of the murder before the culprit's greed stirs him to kill again.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Chicken and Poultry (Step-By-Step Cooking Series)",
        "Authors": "By Barron's",
        "Description": "Describes how to choose, prepare, and carve poultry and presents a variety of recipes including chicken cordon bleu, turkey tetrazzini, roast duck, and pheasant pie",
        "Category": " Cooking , General",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "Current Issues in International Communication (Communications)",
        "Authors": "By Martin, L. John and Heibert, Ray Eldon (EDT)",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Addison-Wesley Longman Ltd",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Pain Erasure",
        "Authors": "By Prudden, Bonnie",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Stone Soup: A Tale of Cooperation",
        "Authors": "By Mary Rowitz",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Queen of Demons",
        "Authors": "By Drake, David",
        "Description": "Queen of Demons follows the travels and adventures of memorable characters: Garric, his sister Sharina, their friend Cashel and Cashel's sister Ilna, and Tenoctris. Their journey takes them across the world of the Isles toward a confrontation with contending forces of evil, as the confluence of magic is reaching a millennial peak. The thousand-year-old sorcerer, The Hooded One, has been defeated after a great supernatural battle, but there remain a living king and queen in power - both bent on seizing control of the known world.Queen of Demons reveals some of the dark powers of the evil queen of the Isles, and includes enough powerful magical conflict to satisfy even the most jaded fantasy reader.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Star Kist Tuna for Today: Tempting New Ideas (Favorite All Time Recipes)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "StarKist Seafood Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Be an Angel!: Heavenly Hints for Angelic Acts from Your Guardian Spirits",
        "Authors": "By Reynolds, Dana and Blessen, Karen",
        "Description": "Suggests acts of kindness towards children, travelers, the sick, the aging, the homeless, friends, and family members",
        "Category": " Religion , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "America the Beautiful in the Words of Henry David Thoreau",
        "Authors": "By Thoreau, Henry David",
        "Description": "",
        "Category": "",
        "Publisher": "Country Beautiful Corporatio",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Who Killed Society?",
        "Authors": "By Amory, Cleveland",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Brothers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Currier & Ives Four Seasons Cookbook",
        "Authors": "By OTTENHEIMER PUBLISHERS",
        "Description": "",
        "Category": "",
        "Publisher": "Ottenheimer Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "His own people,",
        "Authors": "By Booth Tarkington",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday, Page.",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1907"
        }
    },
    {
        "Title": "Train Up a Mom: A Bible Study for Mothers (Life and Ministry of Jesus Christ)",
        "Authors": "By Sanders, Vollie",
        "Description": "As mothers, we’re to train our children in the way they should go. But exactly how do we do that? And who trains us?This Bible study provides women with the information they need for training themselves in godliness. Learn:• how to claim God’s promises for your children • practical ways to affirm your child’s unique personality • how to be a godly mother even when your kids aren’t turning out as planned• how to recognize life experiences as training for motherhood • ways to study children by comparing them with biblical characters",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "California Scenic Highway No. 1: Hearst Castle, Monterey, Carmel, Big Sur",
        "Authors": "By Penelope P. Massey",
        "Description": "",
        "Category": "",
        "Publisher": "Colourpicture Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Log Homes Made Easy, 2nd Edition",
        "Authors": "By Cooper, Jim",
        "Description": "Third edition of the best-selling guide to building log homes. Explores the myths and realities of log home construction, with tips on choosing an architect, planning the site, controlling costs, and more. Includes detailed diagrams and additional resources for getting started.",
        "Category": " House & Home , Reference",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Khufra Run",
        "Authors": "By Higgins, Jack",
        "Description": "Freelance flyer Jack Nelson makes a living peddling his talents to the highest bidder...and now he has a chance to pull off the heist of a lifetime. There are millions in sunken treasure for the taking in a go-for-broke caper tailor-made for Nelson&#151;and all he has to do to collect the loot is live through it.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "London: a Compact Guide in English",
        "Authors": "By Storti, Amadeo",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Benacci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Zero Hour",
        "Authors": "By Miller, Benjamin E.",
        "Description": "Antarctica. Deep below the frozen surface of the Ross Sea, a sub-glacial volcano erupts. Above it, a geothermal power plant faces certain destruction. Heading the disaster-relief team is USAF Colonel Tom Reed, who must use every technological tool at his disposal to keep environmental conditions under control. But as the waters heat up, a global disaster of apocalyptic proportions is brewing-a hurricane that could literally tear the earth apart. Between technology and nature, it's war. For Colonel Reed and his crew, it's a suicide mission.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Onyx",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Not a Sparrow Falls",
        "Authors": "By Nichols, Linda",
        "Description": "Fleeing the men who have led her away from the practices of her faith, Mary Bridget Washburn finds herself in Alexandria, where she hopes to bring happiness to a troubled widowed pastor and his three children.",
        "Category": " Fiction , Literary",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "THE MULBERRY BUSH. A Start-Right Elf Book. No. 8159",
        "Authors": "By Dorothy Grider, Illustrator",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Me and My Little Brain (Great Brain, Book 3)",
        "Authors": "By Fitzgerald, John D. and Mayer, Mercer (ILT)",
        "Description": "This third book in the series is a great combination of The Adventures of Tom Sawyer and The Terrible Two series, and is perfect for fans of Roald Dahl.Tom a.k.a. the Great Brain, is off to boarding school.  Now his little brother, J.D., is free to follow in Tom's ingenious, conniving, and profitable footsteps.  All of J.D.'s attempts at turning a profit fail miserably, and he soon realizes that he just doesn't have that crafty Great Brain knack.  But when his younger brother is kidnapped, J.D. finds that his little brain may not be so ordinary after all . . .",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Skeleton Inside You",
        "Authors": "By Balestrino, Philip",
        "Description": "",
        "Category": "",
        "Publisher": "Harper Trophy, 1971",
        "Price Starting With ($)": "5.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Mind-Sharpening Lateral Thinking Puzzles",
        "Authors": "By Harshman, Edward J.",
        "Description": "",
        "Category": " Games , Logic & Brain Teasers",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Sing a Song of Holidays (Learn With Piggyback Songs Series)",
        "Authors": "By Burris, Priscilla (ILT), Warren, Jean, and Lustig, Jill",
        "Description": "",
        "Category": "",
        "Publisher": "Totline Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "La chatte perdue =: The missing cat (Berlitz kids love to learn) (French Edition)",
        "Authors": "By Demarest, Chris L.",
        "Description": "",
        "Category": "",
        "Publisher": "Berlitz Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Playskool Toddler's Busy Play Book: Over 500 Creative Games, Activities, Crafts and Recipes for Your Very Busy Toddler",
        "Authors": "By Mcclure, Robin",
        "Description": "500 fun-filled activities, crafts, and games to inspire, amuse, entertain, and capture your growing toddler's imagination! Keeping up with an active toddler can be a full-time job. Where do parents turn when they run out of ideas to keep their on-the-go toddler busy and entertained? The Playskool Toddler's Busy Book is packed with 500 toddler-sized activities perfect for every occasion:-Travel time - so much fun that kids may forget to ask, \"Are we there yet?\"-Play dates - what to do when your house is full of rambunctious youngsters-Calm and quiet - how to keep toddlers busy and quiet when you're out and about or having quiet time at home.-Fun with the family - great ideas for quality time with loved ones that will get the whole family involved-Smart zone -games to stimulate the mind and teach toddlers new skills -Sick days - keep toddlers from getting fidgety as they rest and recuperate-Holiday fun - From January through December, a full year's worth of holiday-themed activities-Parents' night out - fun crafts and activities to play with the babysitter when mom and dad get a night offWith games, crafts, and recipes for any situation and every day of the year, The Playskool Toddler's Busy Book is sure to educate and engage your growing toddler for hours!",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Changing Your Child's Heart",
        "Authors": "By Sherbondy, Steve",
        "Description": "Tough-love “power tools”to win the battle of wills without losing a child's heart. Parents of all aged childred will be given loving, biblical, unique examples of how to change their child's attitude and not just their behavior. Instead of avoiding conflict, parents are encouraged to embrace it as the pathway to true relationship.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Putting Your Passion Into Print: Get Your Book Published Successfully! (Essential Guide to Getting Your Book Published: How to Write)",
        "Authors": "By Sterry, David Henry",
        "Description": "You have an idea. A great idea. Now what? Whether you dream of having your name on the cover of a successful book (and 81% of Americans believe they have a book in them), or you’re a seasoned yet frustrated veteran of the publishing jungle, this nuts-and-bolts guide demystifies every aspect of the publishing process. Husband-and-wife team Arielle Eckstut and David Henry Sterry, who developed the enormously popular Putting Your Passion into Print seminar at Stanford University, are known to their students as “the Click and Clack of publishing.” Whether the thought is large (how does one deal with rejection) or small (why is it that a “special pen” works such magic), they cover all the bases. How to: Choose a top-of-the-heap idea;Come up with a blockbuster title;Craft an attention-getting pitch;Create a selling proposal;Find the right agent, publisher and editor;Understand a book contract and royalty statements;Enhance presentation skills;Develop sales, marketing, and publicity savvy;and, if necessary, self-publish (as did Irma Rombauer for The Joy of Cooking and James Redfield for The Celestine Prophesy).  No matter if you’re a literary fiction writer, a romance novelist, an academic looking to reach a popular audience, or a memoirist wanting to publish your life story, Putting Your Passion to Printshares a wealth of experience and insight from people who’ve been there and done that. Includes interviews with hundreds of publishing insiders—agents, editors, authors, and booksellers; side boxes featuring real-life publishing success stories; sample proposals, query letters, a resource guide, and more.",
        "Category": " Language Arts & Disciplines , Authorship",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Closer Walk: 365 Daily Devotionals That Nurture a Heart for God (Walk Thru the Bible)",
        "Authors": "By Wilkinson, Bruce H., Hodges, Mickey R., and Kirk, Paua (EDT)",
        "Description": "Closer Walk has been developed to help you attain a closer walk with God. The 365 daily readings will guide you through the entire New Testament in one year. · Each daily reading is designed specifically to draw you into God’s Word and enhance your fellowship with Him. · Each devotion features a quote from an outstanding Christian writer of the past—John Calvin, Dwight L. Moody, Hannah Whitall Smith, Martin Luther, Charles Spurgeon, and many others. · Each daily page contains a personal worship portion to help you focus your prayer and meditation. A book that feeds and strengthens faith, Closer Walk will help you develop your heart for God.",
        "Category": " Religion , Christian Life , Devotional",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Peer Gynt : A Dramatic Poem",
        "Authors": "By Ibsen, Henrik and Watts, Peter (TRN)",
        "Description": "This high-spirited poetical fantasy, based on Norwegian folklore, is the story of an irresponsible, lovable hero. After its publication, Ibsen abandoned the verse form for more realistic prose plays.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Drama , European , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1966"
        }
    },
    {
        "Title": "NRSE'S MAN OF LAB & DIAG TSTS",
        "Authors": "By Cavanaugh, Bonita Morrow",
        "Description": "Covering 25 categories of tests, this guide presents information to enhance patient care planning and implementation. For each type of test, information is provided on anatomic, physiological, and pathophysiological understandings of procedures; reference values, including variations related to age and gender; interfering factors; and contraindications. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Medical , Nursing , Assessment & Diagnosis",
        "Publisher": "F.A. Davis Company",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "SLEEPYTIME TALES: LG",
        "Authors": "By Golden Books",
        "Description": "There's nothing like a Little Golden Book--and everyone's favorites can be found in this deluxe, affordable compilation. Beautifully bound, this volume of bedtime stories features such unforgettable stories as The Poky Little Puppy, The Sleepy Book, and Good Night, Little Bear in their entirety . . . as well as some new favorites, too!",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The ULTIMATE Career Guide for Nurses: Practical Advice for Thriving at Every Stage of Your Career",
        "Authors": "By Donna Wilk Cardillo RN MA",
        "Description": "",
        "Category": "",
        "Publisher": "Gannett Healthcare Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "A History of US: Book 3: From Colonies to Country (A History of US, 3)",
        "Authors": "By Hakim, Joy",
        "Description": "Covers American history from the French and Indian War to the Constitutional Convention",
        "Category": " Juvenile Nonfiction , History , United States , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.81",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The Lost Army of Cambyses",
        "Authors": "By Sussman, Paul",
        "Description": "In 523 BC, the Persian pharaoh Cambyses dispatched an army across Egypt’s western desert to destroy the oracle at Siwa. Legend has it that somewhere in the middle of the Great Dune Sea his army was overwhelmed by a sandstorm and lost forever. Two and a half millennia later a mutilated corpse is washed up on the banks of the Nile at Luxor, an antique dealer is savagely murdered in Cairo, and a British archaeologist is found dead at the ancient necropolis of Saqqara.The incidents appear unconnected, but Inspector Yusuf Khalifa of the Luxor police is suspicious, as is the archaeologist’s daughter, Tara Mullray. Lured into a labyrinth of intrigue, violence, and betrayal by a mysterious hieroglyphic fragment and rumors of a mythic lost tomb, what began as a search for the truth becomes a race for survival. Confronted by both present day adversaries and ghosts from their pasts, Khalifa and Mullray find themselves on a trail that leads into the desert’s unforgiving, burning heart, and the answer to one of the greatest mysteries of the ancient world.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Bialosky and the Big Parade Mystery (A Big Little Golden Book)",
        "Authors": "By Justine Korman",
        "Description": "",
        "Category": "",
        "Publisher": "Western Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Understanding Islam, 2nd Edition",
        "Authors": "By Emerick, Yahiya",
        "Description": "An up-close and up-to-date look at an often misunderstood faith.         This completely revised and updated guide explores the tenets of the Qu’ran (a.k.a. Koran), examines the history of the religion and its relationship to Christianity and Judaism, and features an expanded section on the true story behind “jihad.” It explores Islamic views on war and terrorism, including the Muslim perspective on the tragic events of September 11, and the subsequent U.S. presence in both Afghanistan and Iraq.         •Excellent sales for the first edition    •Islam is the fastest growing religion in America, with more than six million devoted followers    •Features an expanded section on women in Islam, including their status within the Taliban, and the Islamic practice of polygamy",
        "Category": " Reference , Questions & Answers",
        "Publisher": "Alpha",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Complete Book of American Fish and Shellfish",
        "Authors": "By Bjornskov, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Jacob's Way",
        "Authors": "By Morris, Gilbert",
        "Description": "'The army makes a man hard sometimes. I remember a young girl no more than ten who gave me a glass of buttermilk just outside of Chancellorsville. I still remember that. I guess that’s all my life is. Some pictures fading out behind me, and there’s not much before me.'Reisa listened as he spoke. She knew that he was a man who longed for goodness, and longed for friends, and perhaps even a wife and family. Finally she said, 'I hope you find your way, Ben. God is real, and love is real.'Fleeing a bloody pogrom that threatens their tiny Russian village, Reisa Dimitri and her grandfather, Jacob, sail the ocean to a new life in America. They are swiftly embraced by New York’s Jewish community. But God has other plans that will call them far from the familiar warmth and ways of their culture. Accompanied by their huge, gentle friend, Dov, Reisa and Jacob set out to make their living as traveling merchants in the post-Civil-War South. There, as new and unexpected friendships unfold, the aged Jacob searches for answers concerning the nature of the Messiah he has spent a lifetime looking and longing for. And there, the beautiful Reisa finds herself strangely drawn to Ben Driver--a man with a checkered past, a painful present, and a deadly enemy who will stop at nothing to destroy him.Fast-paced and tender by turn, Jacob’s Way is a heartwarming novel about human love, divine faithfulness, and the restoration of things that had seemed broken beyond repair.",
        "Category": " Fiction , Historical",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Smithsonian Handbooks: Mammals",
        "Authors": "By Wilson, Don E. (EDT) and Clutton-Brock, Juliet (EDT)",
        "Description": "The most visually appealing guides to the natural world that one can buy. Packed with superb full-color photography, detailed descriptions, and highlights of key facts, Mammals is the latest addition to the Smithsonian Handbook series. Including more than 500 profiles each with its own spread, there isn't a more reliable identification guide on the market.",
        "Category": " Nature , Animals , Mammals",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Web Design for Teens",
        "Authors": "By Sethi, Maneesh",
        "Description": "Your Web site is a way to communicate who you are to the world-your style, your interests, your voice. \"Web Design for Teens\" gives you the skills you need to create your first Web site. You don't need any coding experience to begin. You'll cover everything from how to write the code to how to create a cool design. Begin by learning HTML as you move from the basics to advanced coding topics. Then it's on to design as you conquer the fine points of color and navigation systems. Wrap things up as you learn how to put your Web site online, advertise it, and attract visitors.",
        "Category": " Computers , Programming , General",
        "Publisher": "Cengage Learning PTR",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Down Santa Claus Lane (Christmas Remembered ; Bk. 8)",
        "Authors": "By Childs, Anne Van Wagner (EDT)",
        "Description": "",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "The Elegant Knitter: Simple Techniques for Beautiful Results",
        "Authors": "By Macris, Gina",
        "Description": "Ready to take your knitting to the next level? From a lacy leaf-patterned scarf to a dazzling ribbon yarn evening clutch, these designer projects set new highs in style. There are a stunning variety of accessories to choose from—even a few for your favorite pooch. Some of the projects will catch your eye with their intricate stitch patterns; others will attract you with their glorious colors. And every one is small enough to take with you wherever you go. Easy-to-follow diagrams and comprehensive instructions help you master the techniques, and expert tips make stitching easy. So get started on a wide-brimmed felt cloche, mittens with a “flip top” to turn them into gloves, a brilliantly colorful clutch, and more!",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "Union Square & Co.",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Cat Who Wished to Be a Man (Anytime Book)",
        "Authors": "By Alexander, Lloyd",
        "Description": "A wizard agrees to turn Lionel into a man just long enough for him to experience the excitement of city life.",
        "Category": " Juvenile Fiction , Historical , Europe",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "While We Wait: Living the Questions of Advent",
        "Authors": "By Redding, Mary Lou",
        "Description": "While We Wait takes group participants deeper into their own journey toward God by providing weekly readings and group session plans. The first two chapters focus on the questions asked by Tamar, Zechariah, and Ruth, while the later chapters focus on the questions of Elizabeth, Mary, and the Magi. Coming from a fresh angle, While We Wait provides new territory for connecting readers with their own faith questions.While We Wait addresses Advent as God's deepening search for us. The chapters move readers into the different levels in which we engage God. Redding helps readers understand that real-life struggles and questions are a legitimate part of Advent's spiritual exploration.While We Wait takes group participants deeper into their own journey toward God by providing weekly readings and group session plans. A complete Advent study, While We Wait offers readers a unique perspective, clear instructions for small-group use, daily scripture accompanied by questions, and spiritual disciplines.",
        "Category": " Religion , Biblical Meditations , General",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Simply Scones: Quick and Easy Recipes for More than 70 Delicious Scones and Spreads",
        "Authors": "By Albright, Barbara, Weiner, Leslie, and Nelson, Janet (ILT)",
        "Description": "Scones make delectable treats for afternoon tea, breakfast, lunch, even midnight snacks. Simply Scones features more than seventy luscious recipes for scones and spreads certain to delight both traditional and adverturesome palates:Sweet Scones: Oat Current, Triple Chocolate Chunk, Jam-Filled Walnut, Pistachio Fig SconesSavory Scones: Cheese, Hearty Grain, Pesto, Tex-Mex SconesSpreads: Apple Butter, Clotted Cream, Yogurt Cheese, Chocolate Nut Butter, Raspberry Cream Cheese SpreadPlus dozens more. Special sections tell how to make perfect scones, and how to serve a scrumptious afternoon tea. If you've never indulged in a batch of fresh-baked scones, there's no reason to miss out now!",
        "Category": " Cooking , Reference",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Memories of the Heart",
        "Authors": "By Anglund, Joan Walsh",
        "Description": "A collection of short poems explores the nature of love, wisdom, friendship, faith, and peace",
        "Category": "",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "1000 Classic Recipes: The Complete Cookbook for Every Meal and Any Occasion",
        "Authors": "By Anne Sheasby",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes 2",
        "Price Starting With ($)": "9.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Writing in the Disciplines: A Reader for Writers, Fourth Edition",
        "Authors": "By Kennedy, Mary Lynch, Smith, Hadley M., and Kennedy, William J.",
        "Description": "This combination rhetoric/anthology shows readers how to read academic volumes effectively and how to use them as sources for papers in a variety of disciplines. Throughout, readers learn how to work individually and collaboratively as they move through the entire process of writing from sources?from reading the original source to planning, drafting and revising essays.  The rhetoric section teaches readers the fundamental strategies for all phases of academic writing?critical reading, paraphrasing, summarizing, quoting, organizing, drafting, revising, editing, synthesizing, analyzing, researching, and developing arguments. The anthology section offers engaging reading selections that introduce readers to the issues and the methods of study in the sciences, social sciences, and humanities, and that serve as idea banks for their writing assignments.  For individuals interested in a comprehensive treatment of academic writing.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Awesome Facts About Sharks",
        "Authors": "By Llewellyn, Claire",
        "Description": "",
        "Category": "",
        "Publisher": "Flying Frog Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "A Spread of Over 40's Jokes: 9781850153511",
        "Authors": "By Exley, Helen (EDT) and Stott, Bill (EDT)",
        "Description": "",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "Helen Exley Gift Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "100  Years of Women's Wisdom",
        "Authors": "By Freeman, Angela Beasley (EDT)",
        "Description": "",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Walnut Grove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "DK Geography of the World",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "Packed with more than five hundred stunning illustrations, charts, diagrams, one thousand photographs, and superb up-to-date maps, this reference offers the ultimate illustrated guide to landscape, culture, peoples, climate, and facts about everyday life.",
        "Category": " Juvenile Nonfiction , Social Science , General",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Spelling Activity Workbook Grade 2 3",
        "Authors": "By Demetra Georgopoulos",
        "Description": "",
        "Category": "",
        "Publisher": "Beaver Books Publishing",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Draw 50 Buildings and Other Structures: The Step-by-Step Way to Draw Castles and Cathedrals, Skyscrapers and Bridges, and So Much More...",
        "Authors": "By Ames, Lee J.",
        "Description": "Demonstrates each of the basic steps for drawing fifty of the world's most famous buildings and structures, including the Taj Mahal, the Leaning Tower of Pisa, and the Empire State Building",
        "Category": " Art , Techniques , Drawing",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Kitchen science: A compendium of essential information for every cook",
        "Authors": "By Hillman, Howard",
        "Description": "",
        "Category": "",
        "Publisher": "Consumers Union",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Bathroom Planner (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "Dozens of improvement ideas to restyle or add new bathrooms.How to add spa qualities to ordinary bathrooms.Tips to make any bath more functional.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Esquire Things a Man Should Know About Handshakes, White Lies and Which Fork Goes Where: Easy Business Etiquette for Complicated Times",
        "Authors": "By Allen, Ted and Omelianuk, Scott",
        "Description": "With wit and wisdom, this to-the-point handbook advises you on such things as what topics to discuss during a plane flight with the boss; when you should shake a woman’s hand; and why sometimes it’s best to stretch the truth. You’ll put your best face forward in any business situation.",
        "Category": " Humor , Topic , Business & Professional",
        "Publisher": "Hearst",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Semi-Homemade Cooking: Quick, Marvelous Meals and Nothing is Made from scratch",
        "Authors": "By Lee, Sandra",
        "Description": "Presenting a shortcut approach to delicious, homemade meals, this practical cookbook features more than one hundred mouthwatering recipes for breakfast, dinner, appetizers, soups, salads, and desserts, all of which can be prepared in less than thirty minutes using a combination of fress ingredients with those that are preprared and store-bought. 100,000 first printing.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Small Dog Breeds",
        "Authors": "By Rice, Dan",
        "Description": "The pocket-sized pooch makes an ideal household companion, especially for apartment dwellers or others who must keep a pet that will adapt to a confined space. However, author Dan Rice stresses that different small breeds have different personalities&#151;a fact that should be kept in mind when prospective owners are first acquiring their canine pet. If the animal's and owner's lifestyles fail to match, trouble will follow. Described in this book are more than 50 small breeds, with information on their personalities, hereditary traits, nutritional needs, potential health problems, and more. Bichon Frise, Chihuahua, Jack Russell Terrier, Pomeranian, Shih Tzu, Toy Poodle, and many others are discussed in detail. Web addresses of breeders' clubs are also provided as sources of additional information. Appealing full-color photos throughout.",
        "Category": " Pets , Dogs , General",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Basic Drawing Techniques (Basic Techniques)",
        "Authors": "By Wolf, Rachel (EDT), Albert, Greg, and Rubin Wolf, Rachel",
        "Description": "This is one of the most comprehensive and easy-to-use books you'll ever own, giving all the information you need to get started in drawing. Here seven outstanding artist share their drawing techniques and teach you how to use popular drawing mediums.",
        "Category": " Art , Techniques , General",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Custom Enrichment Module: The Museum Experience",
        "Authors": "By Douglass, Scott",
        "Description": "This practical handbook will enrich any student's museum visit, providing everything from a primer on museum etiquette to preparation tips on how to make the visit more constructive and enjoyable. THE MUSEUM EXPERIENCE includes: end-of-chapter activities that apply the principles learned in each chapter to online examples of renowned artwork; useful checklists covering the essential notes a student should take on a trip to the museum and revision 'musts' when writing a research paper or review; and diagrams showing students how to create an effective sketch. Other features include an appendix listing museums across the United States and around the world, a directory of art, architecture, and world culture Internet sites, and a glossary of art terms a student will encounter during a museum visit. This handy guide can be sold separately or bundled FREE with any new Wadsworth Cengage Learning Art/Humanities textbook.",
        "Category": " Art , Reference",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Taste of Home's Holiday & Celebrations Cookbook 2002",
        "Authors": "By Schnittka, Julie (EDT)",
        "Description": "",
        "Category": " Cooking , Holiday",
        "Publisher": "Reiman Media Group, Inc.",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Genealogy of Morals (Dover Thrift Editions)",
        "Authors": "By Nietzsche, Friedrich Wilhelm and Samuel, Horace Barnett",
        "Description": "Written in response to a book on the origins of morality by his erstwhile friend Paul Rée, the three essays comprising The Genealogy of Morals — all three advancing the critique of Christian morality set forth in Beyond Good and Evil — are among Nietzsche's most sustained and cohesive work.In the first essay — starting from a linguistic analysis of words such as \"good,\" \"bad,\" and \"evil\" — Nietzsche sets up a contrast between what he calls \"master\" morality and \"slave\" morality and shows how strength and action have often been replaced by passivity and nihilism. The next essay, looking into the origins of guilt and punishment, shows how the concept of justice was born — and how internalization of this concept led to the development of what people called \"the soul.\" In the third essay, Nietzsche dissects the meaning of ascetic ideals.It is not Nietzsche's intention to reject ascetic ideals, \"slave\" morality, or internalized values out of hand; his main concern is to show that culture and morality, rather than being eternal verities, are human-made. Whether or not you agree with all of his conclusions, his writing is of such clarity and brilliance that you will find reading The Genealogy of Morals nothing short of exhilarating.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Posh",
        "Authors": "By Jackson, Lucy",
        "Description": "Griffin is a preparatory school on Manhattan's Upper East Side, with the best students - and the wealthiest parent body - the city has to offer. The emotionally charged lives of the teenagers and adults that collide and intersect at Griffin include those of:Kathryn \"Lazy\" Hoffman, the headmistress at the Griffin School, who is in the midst of an affair she almost can't remember why she started. Lazy sneaks cigarettes and ministers to students, but her cross to bear is the parents - especially those who wonder why their precious children won't be going to Harvard.Michael Avery, smart, driven, and clearly on the fast track to Cambridge, but so profoundly troubled that he becomes a burden to his girlfriend.Julianne Coopersmith, a sweetly compassionate child of divorce who happily wears designer hand-me-downs from her best friend. She adores Michael even in the face of his neediness and meltdowns.Susan Avery, who is detached from her brilliant but tortured son, and finds it's easier to love her Chinese Crested Hairless than her own child.Dee Coopersmith, who sleeps alone on a pull-out couch in her living room and whose life couldn't be in starker contrast to the lives of the rest of the parent body at Griffin, but whose sense of self and fierce protection for her daughter have unexpected consequences.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "St Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "A Solitary Blue (The Tillerman Series #3)",
        "Authors": "By Voigt, Cynthia",
        "Description": "Jeff Greene was only seven when Melody, his mother, left him with his reserved, undemonstrative father, the Professor. So when she reenters his life years later with an invitation to spend the summer with her in Charleston, Jeff is captivated by her free spirit and warmth, and he eagerly looks forward to returning for another visit the following year.  But Jeff's second summer in Charleston ends with a devastating betrayal, and he returns to his father wounded almost beyond bearing. But out of Jeff's pain grows a deepening awareness of the unexpected and complicated ways of love and loss and of family and friendship -- and the strength to understand his father, his mother, and especially himself.  A NEWBERY HONOR BOOK AMERICAN LIBRARY ASSOCIATION CHILDREN'S NOTABLE BOOK AMERICAN LIBRARY ASSOCIATION BEST BOOK FOR YOUNG ADULTS AMERICAN LIBRARY ASSOCIATION BEST OF THE BEST FOR YOUNG ADULTS INTERNATIONAL READING ASSOCIATION TEACHERS' CHOICE INTERNATIONAL READING ASSOCIATION YOUNG ADULT CHOICE BOOKLIST EDITORS' CHOICE",
        "Category": " Young Adult Fiction , Family , Marriage & Divorce",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Flexibility Factor: Why People Who Thrive on Change are Successful, and How You Can Become One of Them",
        "Authors": "By Wonder, Jacquelyn and Donovan, Priscilla",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Richard Scarry's Funniest Storybook Ever!",
        "Authors": "By Scarry, Richard",
        "Description": "Presents one dozen humorous stories, including those in which Mr. Fixit finds something he can't repair, Tanglefoot tries to stop tripping and falling, and a loaf of bread says, \"Mamma!\"",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "August",
            "Year": "1972"
        }
    },
    {
        "Title": "Living With a Jack Russell Terrier",
        "Authors": "By Morningstar, Rani (EDT)",
        "Description": "Owners who have just acquired a pedigreed pup, and dog lovers planning to purchase a pet, will value Living With a Pet books for their in-depth presentation of the special characteristics and needs of the breed being considered. These books give readers detailed understanding of the animal's daily needs, adaptability to training, physical and personality traits, specific strengths and weaknesses, ability to learn, susceptibility to health problems, and more. Books are filled with full-color photos and attractive sidebar features. .Now Comes with Bonus DVD at No Added Cost!  The brand-new hour-long dog training instruction program is specially designed to help dog owners who have little or no experience in obedience training.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Speaking of Boys: Answers to the Most-Asked Questions About Raising Sons",
        "Authors": "By Thompson, Michael and Barker, Teresa",
        "Description": "My eight-year-old son is the only boy in his class who doesn't have a Gameboy. I don't want him to be ostracized for not having one, but I worry that it's addictive. What do you think?Our two sons are eleven and fourteen, and they are fiercely competitive. The tension around our house is awful. How can we help them get along better?We've worked very hard to keep our ten-year-old son in touch with his feelings. Sometimes it seems as if we've put him at a disadvantage, surrounded by tougher boys who can be pretty cruel with teasing. How can we help him protect himself when other boys start to tease?With his bestselling book Raising Cain, Michael Thompson, Ph.D., at last broke the silence surrounding the emotional life of boys and spearheaded an important national debate. His warmth and humor quickly made him a popular and respected international speaker and consultant. Now he directs his authority, insight, and eloquence to answering your questions about raising a son. With candid questions and thoughtful, detailed responses, Speaking of Boys covers hot-button topics such as peer pressure, ADHD/ADD, and body image as well as traditional issues such as friendship, divorce, and college and career development. This perceptive, informative, and passionate book will leave you not only with useful, practical advice but also with the comforting knowledge that other parents share the same concerns you do when it comes to raising our boys into well-adjusted, responsible men.",
        "Category": " Psychology , Developmental , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Hounds and the Fury: A Novel",
        "Authors": "By Brown, Rita Mae",
        "Description": "Critics and fans alike are wild about Rita Mae Brown’s richly imagined and utterly engaging foxhunting mysteries–and this latest novel promises more thrilling hunts, breathtaking vistas, and an all-new sinister scandal. Millions of dollars seem to be missing after a long-overdue audit of the local aluminum plant reveals a major accounting discrepancy. Company president Garvey Stokes finds himself at a loss–in more ways than one. He turns to his sharp-tongued, ornery bookkeeper, Iphigenia “Iffy” Demetrios, for an explanation, but she’s no help. Yet when the fuzzy math suddenly includes a body count, the figures can no longer be ignored. While the town sheriff tries to get to the bottom of the matter, leave it to “Sister” Jane Arnold, venerable master of the Jefferson Hunt Club, to rely on her keen horse-and-hound sense to follow the trail of murder and cover-up. Throwing her off the scent, however, is former hunt club donor and all-around cad Crawford Howard, who thinks he can go toe-to-toe with the beloved septuagenarian and outclass her club by grossly sidestepping hound- and-hunt etiquette. Against the backdrop of the Blue Ridge Mountains, a menagerie of friends, foes, and fresh new faces saddle up for the breakneck ride to unravel the conspiracy. Even the furry denizens in the fields and boroughs have a thing or two to say about these peculiar humans.Incomparable author Rita Mae Brown returns to the glorious hills of Virginia and its genteel foxhunting society, where how much money you have in the bank is not nearly as important as how long your family has lived on the land–and where nearly everyone has something to hide. As Sister muses, “The little secrets leak out. The big ones, well, some escape like evils from Pandora’s box. And others we’ll never know.”",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "A Country Christmas Treasury",
        "Authors": "By Bragdon, Allen D.",
        "Description": "Explains how to create Christmas toys, decorations, tree ornaments, gifts, and other craft items in traditional American folk designs",
        "Category": " Art , General",
        "Publisher": "Arco Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Fractals, Googols, and Other Mathematical Tales",
        "Authors": "By Pappas, Theoni",
        "Description": "A treasure trove of stories that make mathematical ideas come to life. Explores math concepts and topics such as real numbers, exponents, dimensions, the golden rectangle in both serious and humorous ways. Stories such as the parable of p, the number line that fell apart, Leonhard the magic turtle and many others offer an amusing and entertaining way to explore and share mathematical ideas regardless of age or background. The reference section following each story is designed as enrichment information for the concepts presented in each story.",
        "Category": " Mathematics , History & Philosophy",
        "Publisher": "Wide World Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Measure for Measure (The Pelican Shakespeare)",
        "Authors": "By Shakespeare, William and Crewe, Jonathan V. (EDT)",
        "Description": "The acclaimed Pelican Shakespeare series edited by A. R. Braunmuller and Stephen Orgel   The legendary Pelican Shakespeare series features authoritative and meticulously researched texts paired with scholarship by renowned Shakespeareans. Each book includes an essay on the theatrical world of Shakespeare’s time, an introduction to the individual play, and a detailed note on the text used. Updated by general editors Stephen Orgel and A. R. Braunmuller, these easy-to-read editions incorporate over thirty years of Shakespeare scholarship undertaken since the original series, edited by Alfred Harbage, appeared between 1956 and 1967. With definitive texts and illuminating essays, the Pelican Shakespeare will remain a valued resource for students, teachers, and theater professionals for many years to come.   For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Eyewitness: Civil War",
        "Authors": "By Stanchak, John",
        "Description": "Examines many aspects of the Civil War, including the issue of slavery, secession, the raising of armies, individual battles, the commanders, Northern life, Confederate culture, the surrender of the South, and the aftermath.",
        "Category": " Juvenile Nonfiction , History , Military & Wars",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Birds of the Northeast",
        "Authors": "By Williams, Winston",
        "Description": "",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "World Pubns",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Encyclopedia of Window Fashions",
        "Authors": "By Randall, Charles T.",
        "Description": "",
        "Category": "",
        "Publisher": "Randall International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Really Sinister Savage Shark (Really Horrible Guides)",
        "Authors": "By Taylor, Barbara",
        "Description": "Presents the characteristics of a selection of feared marine animals including shark, squid, octopus, stingray, and puffer fish",
        "Category": " Juvenile Nonfiction , Animals , Marine Life",
        "Publisher": "DK Children",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Extraordinary Girls",
        "Authors": "By Ajmera, Maya, Omolodun, Olateju, and Strunk, Sarah",
        "Description": "EXTRAORDINARY GIRLS celebrates girlhood with all its joys and challenges. With a spirited foreword by Isabel Carter Stewart, director of Girls Incorporated®, EXTRAORDINARY GIRLS strives to empower girls' attitudes about themselves and their world.Maya Ajmera, the author of CHILDREN FROM AUSTRALIA TO ZIMBABWE and TO BE A KID, joins Sarah Strunk and Olateju Omolodun to introduce girls from all over the world who live extraordinary lives. EXTRAORDINARY GIRLS explores the special talents, relationships, and dreams that make every girl unique. In short chapters focusing on religion, sports, education, friendship, and more, girls from around the world are pictured growing and becoming active and integral members of their communities. EXTRAORDINARY GIRLS tells the stories of a few specific girls who have met and exceeded their dreams at very young ages. Meet Alexandra Nechita of Romania, an unusually gifted painter who had a book of her works published when she was merely eleven years old. Also, meet Aubyn Burnside of the United States, who at the age of eleven rallied together local organizations to collect over 10,000 suitcases to distribute to foster children to help with their moves. These stories, and an inspirational text that paints a glorious portrait of girlhood, are sure to inspire girls of all ages to strive to achieve their highest potential.A tremendous collection of beautiful photographs works together with the comprehensive text creating a portrayal of girlhood that is as vibrant and active as girls themselves. Contributions from various photographers, including Peace Corps volunteers, adorn each page with brilliant pictures of girls from around the globe.",
        "Category": " Juvenile Nonfiction , Girls & Women",
        "Publisher": "Charlesbridge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Would You Climb a Banana? (Reading, Rhymes, and Riddles)",
        "Authors": "By Woodworth, Viki",
        "Description": "A rhyming verse describes the joys of exercise.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "The Childs World Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    }
]