[
    {
        "Title": "Where the Heart Leads (Casebook of Barnaby Adair, 1)",
        "Authors": "By Laurens, Stephanie",
        "Description": "New York Times bestselling author Stephanie Laurens knows Regency London, and outside the exclusive enclave in which the aristocracy lived in wealth and comfort, lay another world . . .An intriguing manHandsome, enigmatic, and deliciously dangerous, Barnaby Adair has made his name by solving crimes within the ton. When Penelope Ashford appeals for his aid, he is moved by her plight—and captivated by her lush beauty.An undaunted womanMore than a pretty face in a satin gown, Penelope has devoted her will and intelligence to caring for London's orphans. But now her charges are disappearing. She turns to Adair for help, never dreaming she'll discover in him a man who matches her appetite for life and passion.Where the heart leadsAs Barnaby and Penelope unravel the mystery of the missing children, they uncover a shocking trail that leads to the upper echelons of society, and a ruthless criminal who is ready to destroy all they hold dear, including their newfound understanding of the irresistible intrigues of the heart.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Simply Magic (Simply Quartet, Book 3)",
        "Authors": "By Balogh, Mary",
        "Description": "On a splendid August afternoon Susanna Osbourne is introduced to the most handsome man she has ever seen . . . and instantly feels the icy chill of recognition. Peter Edgeworth, Viscount Whitleaf, is utterly charming—and seemingly unaware that they have met before. With his knowing smile and seductive gaze, Peter acts the rake; but he stirs something in Susanna she has never felt before, a yearning that both frightens and dazzles her. Instantly she knows: this brash nobleman poses a threat to her heart . . . and to the secrets she guards so desperately.From the moment they meet, Peter is drawn to Susanna’s independence, dazzled by her sharp wit—he simply must have her. But the more he pursues, the more Susanna withdraws . . . until a sensual game of thrust-and-parry culminates in a glorious afternoon of passion. Now more determined than ever to keep her by his side, Peter begins to suspect that a tragic history still haunts Susanna. And as he moves closer to the truth, Peter is certain of one thing: he will defy the mysteries of her past for a future with this exquisite creature—all Susanna must do is trust him with the most precious secret of all. . . .",
        "Category": " Fiction , Literary",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Elusive Flame (The Birmingham Family)",
        "Authors": "By Woodiwiss, Kathleen E.",
        "Description": "A woman in desperate straits ... A fearless man ... A marriage of convenience on turbulent waters ...Cerynise Kendall has been left destitute and in dire need following the death of her doting patron and protectress. A brilliant young artist tossed from her home with only the clothes on her back, Cerynise must now turn to a childhood companion for assistance --- the dashing sea captain Beauregard Birmingham --- and beg him to provide her with passage to the Carolinas. She seeks a new home and a new life across the waters, but all depends upon the kindness of a charming adventurer who was once the object of her youthful infatuation.Beneath Birmingham's rugged exterior beats a heart as large and wild as the Atlantic, and Beau readily agrees to aid Cerynise --- even offering her his name in marriage, albeit temporarily, to protect his longtime friend from scandal. But perilous secrets, determined enemies and tempests of the sea and soul threaten their future and safe passage even as bonds of camaraderie are miraculously reforged as bonds of desire ... and affection becomes passion and love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "God's Promises of Prophecy",
        "Authors": "By Impe, Jack Van",
        "Description": "What does the word of God have to say about the times we are living in? Plenty, says Dr. Jack Van Impe, one of America's most trusted authorities on Bible prophecy. In this captivating gift book, Van Impe examines 50 prophetic subjects and demonstrates their Scriptural foundation with specific Biblical references.",
        "Category": " Religion , Inspirational",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Choosing to Change: The 1st Place Challenge",
        "Authors": "By Lewis, Carole",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Swarm (Justice League)",
        "Authors": "By Augustyn, Brian",
        "Description": "",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Dalmatian Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Murder in the House (Capital Crimes)",
        "Authors": "By Truman, Margaret",
        "Description": "He died beneath the Statue of Freedom, clutching a 9-mm pistol in his hand. But as dawn rose, the politician would die again--in a hail of rumor and character assassination.Now one man suspects the shattering truth: that the congressman's suicide was a carefully planned murder. In the heart of the free world, a furious struggle begins: to reclaim a man's innocence, expose a woman's lie, and stop a chilling conspiracy of murder that reaches halfway around the world. . . .",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Germs Make Me Sick! (Let's-Read-and-Find-Out Science 2) (Reading Rainbow book)",
        "Authors": "By Berger, Melvin and Hafner, Marylin (ILT)",
        "Description": "How are you feeling?Most of the time you feel fine, but sometimes you get sick. Sometimes a germ catches up with you.Germs are all around you, but they are too small for you to see. Many germs are harmless, but two kinds, viruses and bacteria, can make you sick. Read and find out about germs, how they can make you sick, and how your body works to fight them off and keep you healthy.",
        "Category": " Juvenile Nonfiction , Health & Daily Living , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Batman: The Copycat Crime (Scholastic Reader, Level 3)",
        "Authors": "By Grayson, Devin, Byrne, John (ILT), and Kane, Bob",
        "Description": "This early chapter book has forty-eight pages and full-color illustrations based on the original Batman art of the 1970's.This early chapter book will inspire kids to read while engaging their imaginations. The book will include intriguing stories that are accompained by full-color illustrations based on the original Batman art of the 1970's. The simple art and easy-to-follow text will make this an enjoyable reading experience for kids while creating a level of suspense and exicitement. Robin, the Joker, and all of the original cast will be included in these fun-filled, action-packed readers.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "DK Readers L2: Starry Sky (DK Readers Level 2)",
        "Authors": "By Hayden, Kate",
        "Description": "Learn fascinating information about stars with this fact-filled children’s book that includes stunning photographs. Find out how a star is born and how it dies. Watch the stunning sky as it changes during the day. Discover the names of constellations with an exclusive telescope view of your favorites!  Explore the vastness of outer space and distant galaxies! All you need is a little imagination.Stunning photographs combine with lively illustrations and engaging, age-appropriate stories in DK Readers, a multilevel reading program guaranteed to capture children's interest while developing their reading skills and general knowledge. With DK Readers, children will learn to read—then read to learn!",
        "Category": " Juvenile Nonfiction , Science & Nature , Astronomy",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Snowball (Step-Into-Reading, Step 1)",
        "Authors": "By Armstrong, Jennifer and Pidgeon, Jean (ILT)",
        "Description": "With big, bold illustrations and large type, children will delight in this easy-to-read book about a giant snowball tumbling down a hill, picking up everything and everybody in its path. Simultaneous.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Sweet Revenge (Goldy Schulz)",
        "Authors": "By Davidson, Diane Mott",
        "Description": "Goldy Schulz is thrilled to be catering a holiday breakfast feast for the staff of the Aspen Meadow Library. But little does she know that on the menu is a large helping of murder. While setting up at the library, Goldy spots a woman lurking in the stacks who bears a striking resemblance to Sandee Brisbane—the Sandee Brisbane who killed Goldy's ex-husband, the Jerk. But Sandee is supposed to be dead . . . or so everyone believes.Goldy's suspicions mount when the body of Drew Wellington, a former district attorney, is found in a corner of the library, with a map worth thousands of dollars stashed in his clothing. Goldy is convinced that Sandee, a confessed felon, is involved. But the holiday madness is only just beginning for Goldy. Soon she's drawn into the dangerous, double-crossing world of high-end map dealing. And like the ghost of Christmas past, Sandee keeps making an appearance. Could she be out to prove that revenge is oh-so-sweet?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Spiders' Secrets (DK Readers Level 3)",
        "Authors": "By Platt, Richard",
        "Description": "Written by leading children's authors and compiled by leading experts in the field, DK Readers are one of the most delightful ways to capture children's interest and help children learn. Learn the truth about six creepy spiders -- from hairy tarantulas with real fangs to eight-eyed jumping spiders! The 48-page Level 3 books, designed for children who can read on their own, contain more complex sentence structure and more detail. Young readers will devour these kid-friendly titles, which cover high-interest topics such as sharks, and the Bermuda Triangle, as well as classics like Aladdin. Information boxes highlight historical references, trivia, pronunciation, and other facts about words and names mentioned. Averaging 2,400 to 2,800 words, these books offer a 50/50 picture-to-text ratio. The Dorling Kindersley Readers combine an enticing visual layout with high-interest, easy-to-read stories to captivate and delight young bookworms who are just getting started. Written by leading children's authors and compiled in consultation with literacy experts, these engaging books build reader confidence along with a lifelong appreciation for nonfiction, classic stories, and biographies. There is a DK Reader to interest every child at every level, from preschool to grade 4.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "DK Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Indigo Dying (China Bayles Mystery)",
        "Authors": "By Albert, Susan Wittig",
        "Description": "In the small town of Indigo, Texas, to teach a workshop, herbalist China Bayles and her best friend Ruby help investigate the murder of resident Casey Ford, whose plans to sell his mining rights would have destroyed the town forever. Reprint.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Lavender Lies (China Bayles Mystery)",
        "Authors": "By Albert, Susan Wittig",
        "Description": "As former lawyer-turned-herbalist China Bayles prepares for her upcoming wedding, the festivities are interrupted by the most uncooperative corpse of local real-estate mogul and blackmailer Edgar Coleman. By the author of Chile Death. Reprint.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Best American Short Stories 2007 (The Best American Series ®)",
        "Authors": "By Pitlor, Heidi (EDT) and King, Stephen (EDT)",
        "Description": "In his introduction to this volume, Stephen King writes, Talent does more than come out; it bursts out, again and again, doing exuberant cartwheels while the band plays 'Stars and Stripes Forever' . . . Talent can’t help itself; it roars along in fair weather or foul, not sparing the fireworks. It gets emotional. It struts its stuff. In fact, that’s its job.”Wonderfully eclectic, The Best American Short Stories 2007 collects stories by writers of undeniable talent, both newcomers and favorites. These stories examine the turning points in life when we, as children or parents, lovers or friends or colleagues, must break certain rules in order to remain true to ourselves. In T. C. Boyle’s heartbreaking Balto,” a thirteen-year-old girl provides devastating courtroom testimony in her father’s trial. Aryn Kyle’s charming story Allegiance” shows a young girl caught between her despairing British mother and motherly American father. In The Bris,” Eileen Pollack brilliantly writes of a son struggling to fulfill his filial obligations, even when they require a breach of morality and religion. Kate Walbert’s stunning Do Something” portrays one mother’s impassioned and revolutionary refusal to accept her son’s death. And in Richard Russo’s graceful Horseman,” an English professor comes to understand that plagiarism reveals more about a student than original work can.New series editor Heidi Pitlor writes, [Stephen King’s] dedication, unflagging hard work, and enthusiasm for excellent writing shone through on nearly a daily basis this past year . . . We agreed, disagreed, and in the end very much concurred on the merit of the twenty stories chosen.” The result is a vibrant assortment of stories and voices brimming with attitude, deep wisdom, and rare compassion.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Setting Limits: How to Raise Responsible, Independent Children by Providing Clear Boundaries (Revised and Expanded Second Edition)",
        "Authors": "By Mac Kenzie, Robert J.",
        "Description": "Start Setting Effective Limits — Now!Do your children misbehave? Do they repeatedly ignore or refuse your requests for proper behavior? Are you constantly fluctuating between permissive and authoritarian parenting, with little or no success? Are you convinced there has to be a better way? There is. Setting Limits will help you establish the positive, respectful, and instructional groundwork your children need for proper ethical and behavioral development In this revised and expanded edition of his popular book, Robert MacKenzie, Ed.D., demonstrates proven techniques and procedures that not only correct misbehavior but instill the cooperation and conduct you want and expect from your children. This book shows parents how to: ·Enforce clear, firm, and effective boundaries ·Put an end to conflicts and power struggles ·Establish rules that encourage cooperation ·Teach children important problem-solving skills ·Apply logical consequences of misbehaviorChildren need limits to guide their development. With MacKenzie's expert guidance, you will learn how to build and enforce the instructive boundaries necessary for a happy and rewarding family life.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "To Live Is Christ: Embracing the Passion of Paul",
        "Authors": "By Moore, Beth and McCleskey, Dale",
        "Description": "An acclaimed Bible teacher traces the life of one of the New Testament's most prominent characters, the apostle Paul, from his childhood to his martyrdom, demonstrating the obvious mercy of God that cause those who have failed him to repent and serve Him wholeheartedly and effectively.",
        "Category": " Religion , Biblical Studies , New Testament , General",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Making of Modern Japan (Problems in European Civilization)",
        "Authors": "By Pyle, Kenneth B.",
        "Description": "",
        "Category": " History , Asia , Japan",
        "Publisher": "D C Heath & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Midnight Voices: A Novel",
        "Authors": "By Saul, John",
        "Description": "The sudden, tragic death of her husband leaves Caroline Evans alone in New York City to raise her children with little money and even less hope. When she meets and marries handsome, successful Anthony Fleming, the charismatic man of her dreams, she believes her life is destined for happiness. She and her children move into her new husband’s spacious apartment in the legendary Rockwell on Central Park West. Despite her son’s instinctive misgivings about the building and its residents, Caroline dismisses the odd behavior of her neighbors as pleasant eccentricities. But after her daughter begins to experience horrifying nightmares and a startling secret emerges, Caroline realizes that the magnificence of her new home masks a secret of unimaginable horror. . . .",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Absolution by Murder (A Sister Fidelma Mystery) (Mystery of Ancient Ireland)",
        "Authors": "By Tremayne, Peter",
        "Description": "The King of Northumbria has requested the services of a wise counsel to decide the people's religious future. Among the select priests, elders, and scholars from Ireland and Rome is Sister Fidelma of Kildare. Trained as an advocate of the courts, she was expecting to rule on issues of law. Instead she was plunged into unholy murder.Dead was the Abbess étain, a leading Celtic speaker, her throat slashed. With the counsel in an uproar and civil war threatening, the desperate king has turned to the sharp-witted Sister Fidelma for help. With the aide of her dear friend Brother Eadulf and her faith in the truth, she must act in haste before the killer strikes again.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Story of the Conestoga Wagon (Cornerstones of Freedom)",
        "Authors": "By Richards, Kenneth G",
        "Description": "",
        "Category": "",
        "Publisher": "Children's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Awakening the Buddha Within: Tibetan Wisdom for the Western World",
        "Authors": "By Das, Surya and Das, Lama Surya",
        "Description": "Lama Surya Das, the most highly trained American lama in the Tibetan tradition, presents the definitive book on Western Buddhism for the modern-day spiritual seeker.The radical and compelling message of Buddhism tells us that each of us has the wisdom, awareness, love, and power of the Buddha within; yet most of us are too often like sleeping Buddhas.  In Awakening the Buddha Within, Surya Das shows how we can awaken to who we really are in order to lead a more compassionate, enlightened, and balanced life.  It illuminates the guidelines and key principles embodied in the noble Eight-Fold Path and the traditional Three Enlightenment Trainings common to all schools of Buddhism:Wisdom Training: Developing clear vision, insight, and inner understanding -- seeing reality and ourselves as we really are.Ethics Training: Cultivating virtue, self-discipline, and compassion in what we say and do.Meditation Training: Practicing mindfulness, concentration, and awareness of the present moment.With lively stories, meditations, and spiritual practices, Awakening the Buddha Within is an invaluable text for the novice and experienced student of Buddhism alike.",
        "Category": " Philosophy , Mind & Body",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Simple Taoism: A Guide to Living in Balance (Simple Series)",
        "Authors": "By Simpkins, C. Alexander, Ph.D. and Simpkins, Annellen M., Ph.D.",
        "Description": "Simple Taoism is designed to help the reader understand what Taoism is about and to help apply its best aspects to everyday living. Divided into three parts, the book outlines:  A clear explanation of Taoism and how to apply its best aspects to your daily life. Simple instructions for exercises to lead a fuller life—meditation, breathing, chi kung, and tai chi chuan. An informative discussion of key Taoist concepts, including wu-wei (nonaction), yin and yang, and Te (power virtue, life).",
        "Category": " Religion , Taoism",
        "Publisher": "Tuttle Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Igraine The Brave",
        "Authors": "By Funke, Cornelia",
        "Description": "",
        "Category": "",
        "Publisher": "Chicken House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Text/Atlas of Histology",
        "Authors": "By Lesson, C. Roland, Lesson, Thomas, and Paparo, Anthony",
        "Description": "Combines textual discriptions of histology with telling micrographs usually found in companion atlases.  Lavishly illustrated with over 400 4-color illustrations, this text/atlas stresses the relationship of tissue structure to function.  Features chapter objectives and chapter summary tables of cell classifications and functions.",
        "Category": " Medical , Histology",
        "Publisher": "Saunders",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Midnight Embrace",
        "Authors": "By Ashley, Amanda",
        "Description": "Plagued by loneliness and despair for the past four centuries, a vampire finds unexpected love with a beautiful young woman who stumbles upon his tomb of darkness. Original.",
        "Category": " Fiction , Gothic",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Irish Gold: A Nuala Anne McGrail Novel (Nuala Anne McGrail Novels)",
        "Authors": "By Greeley, Andrew M.",
        "Description": "Bestselling novelist Andrew M. Greeley outdoes his previous triumphs with Irish Gold, a contemporary, fresh and exciting novel of suspense and love. Nuala Anne McGrail, a student at Dublin's Trinity College, is beautiful the way a Celtic goddess is beautiful - not that Dermot Michael Coyne of Chicago has ever seen one of those in his twenty-five years - unless you count his grandmother Nell, who left Ireland during the Troubles with her husband Liam O'Riada, and who would never tell why they left. Somebody else remembers, though - or why is Dermot set upon by thugs?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Horse and His Boy",
        "Authors": "By Lewis, C. S. and Baynes, Pauline (ILT)",
        "Description": "A mass-market paperback edition of The Horse and His Boy, book three in the classic fantasy series, The Chronicles of Narnia, featuring cover art by Cliff Nielsen and black-and-white interior artwork by the original illustrator of Narnia, Pauline Baynes.On a desperate journey, two runaways meet and join forces. Though they are only looking to escape their harsh and narrow lives, they soon find themselves at the center of a terrible battle. It is a battle that will decide their fate and the fate of Narnia itself.The Horse and His Boy is the third book in C. S. Lewis&#39;s classic fantasy series, which has been drawing readers of all ages into a magical land where horses talk and destiny awaits for over sixty years. This is a novel that stands on its own, but if you would like to explore more of Narnia, read Prince Caspian, the fourth book in The Chronicles of Narnia.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Only by Your Touch",
        "Authors": "By Anderson, Catherine",
        "Description": "New York Times bestselling author Catherine Anderson takes readers to a quaint wilderness town, where a man and a woman find a second chance at life—and love…   Determined to give her son Jeremy the childhood he deserves, Chloe Evans has left a tough past behind and is starting fresh in the charming resort town of Jack Pine, Oregon. But protecting Jeremy becomes a dicey proposition when he seeks out the most dangerous man in town to heal his sick puppy. Chloe has been warned to stay away from Ben Longtree. But there’s something about the gentle, untamed loner that intrigues her…   Long ago, Ben accepted his role as town outcast. Rumored to have once killed a man, he lives in splendid isolation with his forgetful mother, secretly employing his skills as a veterinarian to heal  the wounded animals that mysteriously come to him. Now, Chloe’s sunny warmth and brave tenacity arouse desires he has long denied. And although Ben is notorious for his healing touch, it is Chloe’s hands—and heart—that have the power to save his battered soul.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Clifford's Day With Dad",
        "Authors": "By Bridwell, Norman",
        "Description": "Children will love this new Norman Bridwell story about all the fun activities Clifford and his dad do together!When Clifford visits his dad in the country, they spend a fun day fetching, digging and playing together!",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Mummies (Penguin Young Readers, Level 3)",
        "Authors": "By Milton, Joyce and Swan, Susan (ILT)",
        "Description": "Did you know that some mummies have glass eyes, and some have wings? And that there are cat mummies and bird mummies? And that some people ate powdered mummy? This book has a lot of amazing mummy facts!",
        "Category": " Juvenile Nonfiction , History , Africa",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Public Displays of Affection",
        "Authors": "By Donovan, Susan",
        "Description": "Charlotte Tasker has always been a good girl, so she married the most decent, reliable man she could find even though their love life was a bit on the predictable side. Thirteen years later, she's a widowed mom who runs her company, prepares three vegetarian meals a day for her children, and volunteers for just about every good deed in town. But no one knows that Charlotte has a secret weakness for squirt cheese, erotic poetry-and the mystery man she lost her virginity to in a reckless roadside tryst, moments before she got engaged. They never exchanged names, and even now, Charlotte can't stop fantasizing about that spectacular stranger...DEA agent Joe Bellacera isn't crazy about having to hide out in Minton, Ohio before testifying at the trial of a notorious drug lord. But he's handling it just fine...until he lays eyes on a fiery redhead and a hot little body he'd recognize anywhere. Joe's never had another woman like Charlotte since that day thirteen years ago. Now she's his neighbor-and strictly off-limits...Amid the balmy, honeysuckle-scented breezes of a Midwestern summer, sense and sensibility are about to be subverted by an ice cream-loving dog, conspiring kids, and nosy neighbors. And when the Widow Tasker's fantasies meet the rock-hard reality of Agent Bellacera, let the fireworks begin...",
        "Category": " Fiction , Romance , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "The Traveling Kind",
        "Authors": "By Janet Dailey",
        "Description": "The Traveling Kind by Janet Dailey released on Mar 25, 1981 is available now for purchase.",
        "Category": "",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "The Sweetest Thing",
        "Authors": "By Freethy, Barbara",
        "Description": "RITA Award-winning author Barbara Freethy's previous enchanting romances were hailed as \"irresistable\" (Susan Elizabeth Phillips) and \"terrific\" (Debbie Macomber),. With her deeply emotional stories of love and family, Barbara Freethy reminds us of everything that is imporatnt and joyful in life. Now, she brings us her latest enthralling tale of how one woman's heartfelt desire comes true.She Longed For A ChildAlone in the world, Faith Christopher had always yearned for love...and a man who'd make her heart pound. But her dreams of a place to call home were getting harder to hold on to...He Was Stubbornly SingleAlex Carrigan liked fast cars, fast women and fast deals-then a tough talking teenager arrived on his doorstep claiming she was his long-lost-daughter, and his meddling grandfather decided to move in. Suddenly, Alex has to face the family he never expected.But They Were Meant To Be...Enter Faith. Little did the outspoken and beautiful baker know that deep inside Alex was a well oftenderness...and that she might have the recipe to bring him true love-the sweetest thing life has to offer.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Picture Me Animals (Picture Me Learning Books)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Playhouse Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Holt McDougal Library, High School with Connections: Student Text Picture Bride 1997",
        "Authors": "By Holt Mcdougal (COR)",
        "Description": "",
        "Category": " Young Adult Fiction , People & Places , United States , Asian American",
        "Publisher": "MCDOUGAL LITTEL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Peace and Justice in the Scriptures of the World Religions: Reflections on Non-Christian Scriptures",
        "Authors": "By Carmody, John Tully and Carmody, Denise Lardner",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Kiss Me Forever",
        "Authors": "By Smith, Bobbi",
        "Description": "",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Fluids & Electrolytes Made Incredibly Easy!",
        "Authors": "By Springhouse Publishing",
        "Description": "",
        "Category": " Medical , Nursing , General",
        "Publisher": "Springhouse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Uncle Tom's Cabin (Bantam Classics)",
        "Authors": "By Stowe, Harriet Beecher",
        "Description": "Uncle Tom, Topsy, Sambo, Simon Legree, little Eva: their names are American bywords, and all of them are characters in Harriet Beecher Stowe's remarkable novel of the pre-Civil War South. Uncle Tom's Cabin was revolutionary in 1852 for its passionate indictment of slavery and for its presentation of Tom, \"a man of humanity,\" as the first black hero in American fiction. Labeled racist and condescending by some contemporary critics, it remains a shocking, controversial, and powerful work -- exposing the attitudes of white nineteenth-century society toward \"the peculiar institution\" and documenting, in heartrending detail, the tragic breakup of black Kentucky families \"sold down the river.\" An immediate international sensation, Uncle Tom's Cabin sold 300,000 copies in the first year, was translated into thirty-seven languages, and has never gone out of print: its political impact was immense, its emotional influence immeasurable.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The amazing book of magic & card tricks",
        "Authors": "By Tremaine, Jon.",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "On My Honor: Newbery Honor Book",
        "Authors": "By Bauer, Marion Dane",
        "Description": "When his best friend drowns while they are both swimming in a treacherous river that they had promised never to go near, Joel is devastated and terrified at having to tell both sets of parents the terrible consequences of their disobedience.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Yearling Newbery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Men of Bitter Creek",
        "Authors": "By Johnston, Joan",
        "Description": "From New York Times bestselling author and romance legend Joan Johnston come two favourite stories about true love and family, available together for the first time. The Man From Wolf Creek  Seeking restitution from the elderly ingrate who robbed him, a reclusive, huge and handsome ⡥ast⟯f a mountain man receives a most unorthodox compensation: the old thief's ⡥auty⟯f a daughter. Now this unlikely pair discovers that true love can find you when you least expect it. The Christmas Baby  Having wed to end the warring ways of their feuding Texas families, a reluctant bride and groom find life together and unending battle––until a beautiful arrival at Christmastime teaches them the true meaning of peace and joy and love.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2019"
        }
    },
    {
        "Title": "Sharp Edges",
        "Authors": "By Krentz, Jayne Ann",
        "Description": "Eugenia Swift is a young woman of singular sensibilities, and a connoisseur of beauty. As the director of the Leafbrook Glass Museum, she's been asked to travel to Frog Cove Island -- an artistic haven near Seattle -- to catalog an important collection of art glass. But thanks to unsavory rumors surrounding the collector's death, the museum insists that Eugenia take along Cyrus Chandler Colfax -- a rough-hewn private investigator whose taste in glass runs to ice-cold bottles filled with beers.  When Colfax declares they must pose as a couple, Eugenia protests in a manner as loud as his Hawaiian shirts. She fears that her secret mission will be discovered...while he hopes that she will be a mask for his own hidden agenda. But soon their very lives depend on making an utterely convincing couple. Because among the chic galleries of Frog Cove Island lurks a killer, and their only chance for survival is the boldest, most artful collaboration they can dare to imagine.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Art of Fiction: Notes on Craft for Young Writers",
        "Authors": "By Gardner, John",
        "Description": "",
        "Category": " Language Arts & Disciplines , Authorship",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "My First Prayers",
        "Authors": "By Gutmann, Bessie Pease, Akmon, Nancy C., and Akmon, Roni",
        "Description": "",
        "Category": "",
        "Publisher": "Blushing Rose Pub",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Witness in Death",
        "Authors": "By Robb, J. D.",
        "Description": "When a famous thespian is killed right before her eyes, New York detective Eve Dallas takes a new place in crime as both officer and witness to murder in this novel in the #1 New York Times bestselling In Death series.The opening night of the revival of Agatha Christie's \"Witness for the Prosecution\" at New York’s New Globe Theater turns from stage scene to crime scene when the leading man is stabbed to death right on center stage. Now Eve Dallas has a high-profile celebrity homicide on her hands. Not only is she lead detective, she’s also a witness—and when the press discovers that her husband owns the theater, there’s more media spotlight than either can handle. The only way out is to move fast. Question everyone and everything…and in the meantime, try to tell the difference between the truth—and really good acting…",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Loyalty in Death",
        "Authors": "By Robb, J. D.",
        "Description": "In this novel in the #1 New York Times bestselling series known for its tantalizing blend of romance, suspense, and futuristic police procedural, New York cop Eve Dallas faces her most ingenious foe: a “secret admirer” who taunts her with letters…and kills without mercy.An unknown bomber is stalking New York City. He is sending Eve Dallas taunting letters promising to wreak mass terror and destruction among the “corrupt masses.” And when his cruel web of deceit and destruction threatens those she cares for most, Eve fights back. It’s her city...it’s her job...and it’s hitting too close to home. Now, in a race against a ticking clock, Eve must make the pieces fit—before the city falls.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Divine Peacock: Understanding Contemporary India",
        "Authors": "By Murty, K. Satchidananda (EDT), Dasgupta, Amit (EDT), Indian Council for Cultural Relations (COR), and International Symposium on India Studies (1994  Kovalam, India) (COR)",
        "Description": "Compilation of papers presented to the International Symposium on India Studies held at Kovalam, India, Nov. 28-Dec. 2, 1994.",
        "Category": " History , Asia , Southeast Asia",
        "Publisher": "South Asia Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Dead Cert",
        "Authors": "By Francis, Dick",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Midnight Lady",
        "Authors": "By Rogers, Rosemary",
        "Description": "Kyla Van Vleet has journeyed from India with proof of her right to share in the late Duke of Wolverton's estate and repay the many kindnesses of the stepfather who raised her. But this ravishing young woman hasn't counted on the cold cunning of the Duke's acknowledged heirs--or the disarming gaze of the brash American who is next in line for the title. The charming but arrogant new Duke is Brett Banning, and to him Kyla is a gypsyish hoyden bent on besmirching the family name. But there is something about his commanding boldness that draws Kyla ever closer to a maelstrom of unbridled desire, even if her pounding heart leads her into the bedchamber of His Grace's country estate. Now this willful lady must gather her courage and dignity to command her own destiny. For the gossips of London keep no secrets, and a passion that blazes at midnight can either warm two hearts for a lifetime. . . or consume everything it touches.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Waiting Time",
        "Authors": "By Price, Eugenia",
        "Description": "Bostonian Abby Banes thought marrying much older Eli Allyn would be a romantic dream: he would make her the pampered mistress of a plantation on Georgia's glorious seacoast. But she wasn't prepared for the realities of slavery or aching loneliness. And when she finally reached out in friendship to her housekeeper Rosa Moon, she found a lifeline during the tragedy that made her a widow. Now, in a land being pulled apart by turmoil and change, Abby defies Southern tradition to run the plantation alone and to embrace a people's call for freedom. And she never expects the intense emotion that draws her to another man...or to be struck by a passion, fierce as lightning, that knows no bounds...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "I Need to Know Answers to Questions About God",
        "Authors": "By Anne Graham Lotz, Brennan Manning, Stormie Omartian, Jack Hayford, Andy Stanley, Charles Stanley, Joseph Stowell, Lee Strobel, Rick Warren, Bruce Wilk",
        "Description": "",
        "Category": "",
        "Publisher": "Family Christian Stores",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "A Church for the 21st Century",
        "Authors": "By Anderson, Leith",
        "Description": "Explores the changes established churches and ministry organizations must make to remain relevant and effective and to meet the challenges of the twenty-first century",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Colorful Lateral Thinking Puzzles",
        "Authors": "By Sloane, Paul and MacHale, Des",
        "Description": "Finally, a puzzle book as “bright” as its readers. Not only will puzzle-doers find wickedly tricky brainbusters on every page, but all the accompanying illustrations are in brilliant color too. And that makes unraveling these challenging conundrums even more fun. It will take some real smarts to figure this out: Diamonds are for never: Robbers knew that a woman had some very valuable diamonds. They waited until she was away on holiday and then burgled her house. They searched high and low but they could not find the diamonds. What had she done?The answer may seem hard at find at first, but solvers who can think unconventionally, and look past the obvious, will figure it out—and every other puzzle too.Answer: She froze each diamond in a separate section of a tray of ice cubes, where they were very hard to see.",
        "Category": " Games , Logic & Brain Teasers",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Brain Builders!: A Lifelong Guide to Sharper Thinking, Better Memory, and an Ageproof Mind",
        "Authors": "By Leviton, Richard",
        "Description": "",
        "Category": " Self-help , Personal Growth , Memory Improvement",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Keeping Counsel",
        "Authors": "By Forster, R. A.",
        "Description": "When her friend implores her to represent her boyfriend, attorney Tara Linley is shocked to find out that he is guilty of a heinous crime and must chose between being disbarred by revealing his confession or keeping him as a client with the chance that he could murder another innocent victim. Reprint.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The Girl Who Loved Tom Gordon",
        "Authors": "By King, Stephen",
        "Description": "The acclaimed #1 New York Times and undisputed King of Horror Stephen King offers a frightening suspense novel about a young girl who becomes lost in the woods as night falls.On a six-mile hike on the Maine-New Hampshire branch of the Appalachian Trail, nine-year-old Trisha McFarland quickly tires of the constant bickering between her older brother, Pete, and her recently divorced mother. But when she wanders off by herself, and then tries to catch up by attempting a shortcut, she becomes lost in a wilderness maze full of peril and terror.  As night falls, Trisha has only her ingenuity as a defense against the elements, and only her courage and faith to withstand her mounting fears. For solace she tunes her Walkman to broadcasts of Boston Red Sox baseball games and follows the gritty performances of her hero, relief pitcher Tom Gordon. And when her radio’s reception begins to fade, Trisha imagines that Tom Gordon is with her—protecting her from an all-too-real enemy who has left a trail of slaughtered animals and mangled trees in the dense, dark woods…",
        "Category": " Fiction , Psychological",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Voices from Vietnam",
        "Authors": "By Denenberg, Barry",
        "Description": "A retelling of the Vietnam War as experienced by the men and women who were there discusses the heated debates that surrounded the war, the hundreds of thousands who were physically and psychologically wounded, and the overall effects of the war",
        "Category": "",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Prince and the Pauper (Bantam Classics)",
        "Authors": "By Twain, Mark",
        "Description": "Rich with surprise and hilarious adventure, The Prince and the Pauper is a delightful satire of England’s romantic past and a joyful boyhood romp filled with the same tongue-in-cheek irony that sparks the best of Mark Twain’s tall tales. Two boys, one an urchin from London’s filthy lanes, the other a prince born in a lavish palace, unwittingly trade identities. Thus a bedraggled “Prince of Poverty” discovers that his private dreams have all come true—while a pampered Prince of Wales finds himself tossed into a rough-and-tumble world of squalid beggars and villainous thieves. Originally written as a story for children, The Prince and the Pauper is a classic novel for adults as well—through its stinging attack on the ageless human folly of attempting to measure true worth by outer appearances.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Irresistible (Berkley Sensation Historical Romance)",
        "Authors": "By Balogh, Mary",
        "Description": "Believing herself to be the kind of woman men prefer as a friend, Sophia Armitage agrees to help Sir Nathaniel find a wife and is astonished when they fall for each other, a situation she fears will compromise their friendship",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "A Promise to Cherish",
        "Authors": "By Spencer, LaVyrle",
        "Description": "Previously published with Forsaking All Others in Jove's A Heart Speaks, A Promise to Cherish is a story about falling in love, and finding the courage to follow your dreams.  Starting life over in a new city, Lee Walker falls head over heels for her new boss. Now, she must choose between protecting her bruised and battered heart--or trusting it to a man whose quiet strength just might heal it.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Jove",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Inner Bitch: Guide to Men, Relationships, Dating, Etc. / By Elizabeth Hilts",
        "Authors": "By Hilts, Elizabeth",
        "Description": "A handbook heralding the end of \"toxic niceness\" offers advice on living single, being true to one's self, and making better dating decisions",
        "Category": " Humor , General",
        "Publisher": "Hysteria Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Promises for Students",
        "Authors": "By Zondervan",
        "Description": "For students of all ages encountering the big questions of life, God&apos;s many promises of love, wisdom, and direction are the ideal place to turn for answers. Promises for Students is a collection of more than 1500 Scripture verses topically arranged to help students find the inspiration and encouragement to deal with the issues they face everyday. Feature Scripture from the New International Version-- the most trusted Bible translation available today.",
        "Category": " Religion , General",
        "Publisher": "Inspirio",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Private Concierge",
        "Authors": "By Forster, Suzanne",
        "Description": "L.A.'s rich and powerful rely on Lane Chandler's company, The Private Concierge, to anticipate their every whim...and to guarantee unparalleled discretion. But then one of Lane's celebrity patrons is found murdered in the most undignified manner imaginable. In rapid succession, three other prominent clients become embroiled in separate scandals, thanks to what looks like a security breach of TPC's communications systems. As word gets out, clients drop Lane like last week's gossip. She's bent on keeping TPC's name out of the papers, but when former police officer Rick Bayless starts nosing around, she has more to worry about than bad PR. Rick knows about Lane's shadowy past, and he's certain she's hiding new secrets. With no other options, Lane must face a dangerous conspirator who knows more about her every move than she does.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Hidden Honor",
        "Authors": "By Stuart, Anne",
        "Description": "While on the way to the convent, Elizabeth of Bredon is led astray from her path of righteousness by Prince William, a man known for his wicked and cruel ways, when their journey takes a dangerous turn. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Bel Air",
        "Authors": "By Stone, Katherine",
        "Description": "Set in the lavish homes of Bel Air, this novel of opulent living and romance among the privileged classes is rife with details of designer labels, elegant mansions, luxurious cars, and exclusive parties. Reissue.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Secrets (The Bragg Saga)",
        "Authors": "By Joyce, Brenda",
        "Description": "“For scorching sensuality and raw passion, Brenda Joyce is unrivaled.”—Romantic Times Brenda Joyce has a well-deserved reputation as one of the most sensuous voices in historical romance fiction. Anyone who doesn’t know it yet certainly will, once they are privy to Joyce’s steamy and sensational Secrets. This classic tale of duty, desire, and temptation from the New York Times and USA Today bestseller is back for a new generation to savor—and her intriguing story of an English earl’s daughter who has lost her memory and the rugged, breathtaking stranger compelled by honor and passion to wed her, will live in readers’ hearts for all time.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Forget Me Not",
        "Authors": "By Lowell, Elizabeth",
        "Description": "The terrible tragedy Alana Reeves suffered on Wyoming's Broken Mountain has vanished from her memory. Now nothing remains of those six lost days that cost her everything she held dear. But a man has appeared from the shadows of Alana's past -- a rugged outdoorsman who once dwelt in a wounded heart he is now sworn to heal. Like an answered prayer, Rate Winter has come to lead Alana out of the darkness -- and back to the scene of the nightmare she has erased from her mind. Alana must follow him -- for in Rate's powerful arms her fears can be conquered, and through his love hers can be reborn.",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Breakneck",
        "Authors": "By Spindler, Erica",
        "Description": "A remorseless killer. A string of innocent, clean-cut victims. Detectives M.C. Riggio and Kitt Lundgren must race against a cold-blooded predator who moves at breakneck speed in this heart-pounding thriller from New York Times bestselling author Erica Spindler.Hot on the heels of their last case, partners Mary Catherine (M.C.) Riggio and Kitt Lundgren, detectives in the police department's Violent Crimes Bureau in industrial, blue-collar Rockford, Illinois, are called out to a college student’s apartment where a young man with no criminal record, not even a noise complaint from his neighbors, appears to have been murdered in his sleep.The trail seems cold, until another victim turns up, and then another… each one striking closer to home for M.C. The growing list of seemingly emotionless kills leaves M.C. and Kitt little to follow—like the first victim, all the targets are young adults, kid-next-door types who’ve never taken a step outside the law. Meanwhile, the case starts to take its toll on M.C.’s personal life, setting her on edge with her partner and putting their hard-earned friendship in jeopardy. As M.C. and Kitt hunt a faceless killer, they are led deep into the cyberuniverse, where no one is who he seems and you never know who's watching.  At the heart of this mesmerizing thriller is the relationship between two headstrong women as they struggle to balance their dual roles, to learn to trust, and to walk the fine line between upholding the law—and taking it into their own hands.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "And One Wore Gray (Camerons Saga: Civil War Trilogy)",
        "Authors": "By Graham, Heather",
        "Description": "In this sensual Civil War romance from Heather Graham, the scars of battle are healed by a searing desire that crosses enemy lines. Callie Michaelson knows all too well the costs of war. Her husband gave his life on the battlefield, fighting for the North. Now Callie’s only defense is to hunker down and hope the war blazes right on past her Maryland farm. But when a dashing Confederate soldier falls on her land, Callie is inexplicably roused to help this desperate, surprisingly vulnerable, and heartbreakingly desirable man. After suffering the sting of defeat, Colonel Daniel Cameron wants nothing more than to heal his wounds and rejoin his retreating cavalry unit. But the look in the silver-gray eyes of the stunningly beautiful Yankee widow tells him to stay—at least for one night of passion. In Callie’s bed, Daniel forgets all about the horrors he has seen. He also forgets that he is too deep in Union territory to trust any woman. And soon enough Daniel discovers that wounds of the flesh are nothing compared to wounds of the heart.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Grand Finale",
        "Authors": "By Evanovich, Janet",
        "Description": "From the #1 New York Times bestselling author comes a revised, repackaged novel sure to please her many fans. She writes \"high speed comic mayhem\" (Detroit Free Press); she's \"a blast of fresh air\" (Washington Post); \"side-splitting funny\" (Publishers Weekly) and \"a winner\" (Glamour). In other words, she's Janet Evanovich.Berry Knudson had a talent for disaster, but when she climbed a tree to rescue a kitten, she wasn't prepared for the scrumptious hunk undressing in a nearby window, or her dive downward that smashed Jake Sawyer's pizza and won his heart! But was there room in her chaotic schedule for a risk-taking inventor with dreams? She took classes, delivered pizzas, and cared for three eccentric old ladies she rescued from the train station. But Jake thrived on a challenge, and he could be very inventive. Could he teach her there was time to make butterscotch pudding and let herself be loved?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Not in the Flesh: A Wexford Novel (Inspector Wexford Mystery)",
        "Authors": "By Rendell, Ruth",
        "Description": "A new Chief Inspector Wexford mystery from the author who Time magazine has called “the best mystery writer in the English-speaking world.” When the truffle-hunting dog starts to dig furiously, his master’s first reaction is delight at the size of the clump the dog has unearthed: at the going rate, this one truffle might be worth several hundred pounds. Then the dirt falls away to reveal not a precious mushroom but the bones and tendons of what is clearly a human hand.In Not in the Flesh, Chief Inspector Wexford tries to piece together events that took place eleven years earlier, a time when someone was secretly interred in a secluded patch of English countryside. Now Wexford and his team will need to interrogate everyone who lives nearby to see if they can turn up a match for the dead man among the eighty-five people in this part of England who have disappeared over the past decade. Then, when a second body is discovered nearby, Wexford experiences a feeling that’s become a rarity for the veteran policeman: surprise.As Wexford painstakingly moves to resolve these multiple mysteries, long-buried secrets are brought to daylight, and Ruth Rendell once again proves why she has been hailed as our greatest living mystery writer.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Key West",
        "Authors": "By Cameron, Stella",
        "Description": "In Key West during hurricane season, Sonnie Giacono, a woman who lost her husband, unborn child, and part of her memory eight months earlier, struggles to find the truth in a world where nothing is what it seems and only NYPD cop Chris Talon can save her from the brink of madness.  Reprint.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Zebra Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "High Stakes",
        "Authors": "By Brandewyne, Rebecca",
        "Description": "The secret heiress to the vast Marlowe fortune, Angelina Marlowe tries to unsort the mysteries of her past, only to become the target of the ruthless consortium responsible for the murders of her parents, and only Hawk Bladehunter can protect her. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Day of Atonement",
        "Authors": "By Alvarez, A.",
        "Description": "When their friend Tommy Apple dies leaving them a million dollars and unanswered questions about his drug dealings, Joe and Judy Constantine are pressured to cooperate both with Tommy's cronies and with federal agents. 12,500 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Sunset in St. Tropez: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "In her 55th bestselling novel, Danielle Steel explores the seasons of an extraordinary friendship, weaving the story of three couples, lifelong friends, for whom a month’s holiday in St. Tropez becomes a summer of change, revelation, secrets, surprises, and new beginnings . . . As Diana Morrison laid the table for six at her elegant Central Park apartment, there was no warning of what was to come. Spending New Year’s Eve together was a sacred tradition for Diana, her husband of thirty-two years, Eric, and their best friends, Pascale and John Donnally and Anne and Robert Smith. The future looked rosy as the long-time friends sipped champagne and talked of renting a villa together in the South of France the following summer. But life had other plans . . .Just two weeks after New Year’s, tragedy strikes the heart of their close circle, as Robert Smith suffers a sudden, unexpected loss. Without hesitation, Diana and Eric, Pascale and John rally to his side, united in their support, love, and shared grief. Convinced that a change of scenery is just what Robert needs, they urge him to join them on the Riviera in August. But as they soon discover, the ramshackle old mansion they rented in St. Tropez--sight unseen--is far different from the exquisite villa and sun-drenched gardens touted in the brochure. Cobwebs hang from the ceiling. Beds collapse beneath them. All while a would-be housekeeper in a leopard-skin bikini and six-inch heels sashays through the house with a trio of yapping poodles at her heels. But the biggest surprise of all is the woman Robert invites to the villa as his guest--a lovely, much-younger film actress with mile-long legs and a million-dollar smile. Diana and Pascale hate her on sight. But the men are dazzled. And amid the crumbling furniture and the glorious sunsets, the strained relationships and the acts of forgiveness, more surprises are in store for the villa’s occupants. With the last days of summer fast approaching, each couple finds themselves changing in unexpected ways, as old wounds are healed, new love discovered, and miracles unfold...all beneath the dazzling sun of St. Tropez.By turns wise and moving, heartbreaking and wickedly funny, Danielle Steel’s new novel is about forgiving without forgetting, about the sorrow that shadows our lives and the hope that saves us. And it is about once-in-a-lifetime friendships . . .the kind that heal, sustain, and change us forever.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Taste of Home's 2001 Quick Cooking Annual Recipes",
        "Authors": "By Lloyd, Heidi Reuter (EDT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Reiman Publications",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Best of Country Cooking 2000",
        "Authors": "By Steiner, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Taste of home",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Stanislaski Brothers (Two Complete Novels: Mikhail and Alex)",
        "Authors": "By Roberts, Nora",
        "Description": "Mikhail Stanislaski finds unexpected love with classy society princess Sydney Hayward in a tale of mismatched lovers, Luring a Lady, while sexy detective Alex Stanislaski meets the woman of his dreams, Bess McNee, when he mistakenly arrests her for solicitation, in Convincing Alex, in a pair of novels featuring the tempestuous Stanislaski family. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Easy One-Dish Meals",
        "Authors": "By Jones, Barbara C. (COM)",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Cookbook Resouces, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "More Than Memory",
        "Authors": "By Garlock, Dorothy",
        "Description": "Years after her short-lived teenage marriage to Luke Hanson ends in divorce, Nelda Hanson, a successful Chicago designer, returns to her Iowa hometown to sell the family farm, only to come to face to face with her old love, who reawakens old feelings in her. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Orphan",
        "Authors": "By Cameron, Stella",
        "Description": "The latest tale of romance in the delightful 7 Mayfair series follows Latimer More, known as England's \"Most Daring Lover\" who resides at 7A Mayfair Square, as he becomes enamored with penniless Scottish lass Jenny McBride, a courageous young beauty, but unbeknownst to Latimer, Jenny has a dark and dangerous secret that will change his life forever. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Baby Love (The Kendrick-Coulter Series, 1)",
        "Authors": "By Anderson, Catherine",
        "Description": "Desperate and determined, Maggie Stanley grabs her small baby and runs into the snowy Idaho night. In her loneliest, blackest hour, she unexpectedly finds a warmth and comfort she has never known in the tender compassion of a handsome, down-and-out stranger. In Rafe Kendrick, Maggie recognizes a soul wounded like her own—though she knows she must never trust any man ever again.Rafe is more than he seems—an enigmatic man of secrets who could give Maggie the moon, had he not vowed to spend his life alone. But sometimes love's flames can transform a cold world into paradise—and a man who's lost nearly everything, a woman who's forgotten how to dream, and the helpless child who needs them both can become that most wondrous creation: a family.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Mark: Jesus Christ, Love in Action",
        "Authors": "By Practical Christianity Foundation",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Green Key Books",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Chicken Soup for the Dog Lover's Soul: Stories of Canine Companionship, Comedy and Courage (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Becker, Marty (COM), Kline, Carol (COM), and Shojai, Amy (COM)",
        "Description": "For thousands of years, dogs have been cherished as devoted    companions and exuberant playmates—their unconditional love,  limitless affection and unwavering loyalty never fail to melt our  hearts. The stories in Chicken Soup for the Dog Lover’s Soul truly  capture the special joy these four-legged creatures bring to our lives  and hearts.  The family that learns the true meaning of Christmas    when their Lab needs medical care during the holidays.  The intimidating Doberman who becomes a loving    mother to an orphaned duckling.  The homeless man whose life is changed when he    meets a special dog.  The pocket-size assistance dog who dials 9-1-1. The crafty beagle-mix with the munchies who helps    himself from the refrigerator . . . and many more    unforgettable canine characters.From exciting and entertaining accounts of courage    and humor to heartwarming tales of healing and learning,    each touching story in this book will inspire dog    lovers to rejoice in the unique bond they share with    their canine companions.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Hci",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Courting Susannah",
        "Authors": "By Miller, Linda Lael",
        "Description": "When Susannah McKittrick leaves Nantucket for the boomtown of Seattle, she is hardly looking to strike it rich; she is headed west to care for a newborn left motherless after Susannah's cousin died. Although the rigorous trip depletes all of her savings, Susannah is certain she is doing the right thing. She is less sure when she meets the infant's father, wealthy businessman Aubrey Fairgrieve -- who seems embittered toward love and marriage, and indifferent toward the precious baby Susannah is so eager to care for.  Gradually, Susannah discovers that Aubrey's marriage to her cousin was far from perfect -- and she comes to see the brusque but handsome man in a new light. But when Aubrey makes her a most practical offer, it is a far cry from the heartfelt proposal Susannah desires. If he truly wants to win her hand, he will have to learn to trust once more -- and sweep her away with the bold passion of a man in love.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Book of Vices",
        "Authors": "By Hutchinson, Robert J. (EDT)",
        "Description": "Sloth. Avarice. Lust. Gluttony. Pride. Anger. Envy. While long denounced as the source of much of the evil in the world, the Seven Deadly Sins have also inspired the great classics of Western literature: Milton's Paradise Lost, all of Shakespeare's plays, and the works of Aristotle, Chaucer, Dante, Jane Austen, and Walt Whitman, to name just a few.The Book of Vices brings together some of the wittiest tributes to human weakness and temptation ever written, from Rabelais's \"In Praise of Debtors,\" to Benjamin Franklin's \"On Selecting a Mistress,\" to Ben Johnson's \"Hymn to the Belly.\" Ranging across the centuries, it includes the classic bawdy tales of Boccaccio and Apuleius, as well as tempting selections from such modern writers as Ogden Nash, John Updike, Fran Lebowitz, Tom Wolfe, and Lisa Alther.Poking good-natured fun at the new \"politics of virtue,\" The Book of Vices is an irresistible guide to the wild side of literature - and its tales of caution will provide edifying reading for the entire family.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Emma (Dover Thrift Editions)",
        "Authors": "By Austen, Jane",
        "Description": "When her former governess finds happiness as the bride of a local widower, the brilliant and beautiful Emma Woodhouse — one of Jane Austen's immortal creations — flatters herself that she alone has secured the marriage and that she possesses a special talent for bringing lovers together. The young heiress next busies herself with finding a suitable husband for her friend and protégé, Harriet Smith, setting off an entertaining sequence of comic mishaps and misunderstanding in this sparkling comedy of English-village romance. Beneath its considerable wit, the novel is also the story of a young woman's progress toward self-understanding.Emma abounds in the droll character sketches at which Jane Austen excelled. In addition to the well-intentional heroine and her hypochondriacal father, the village of Highbury during the Regency period is populated by an amusing circle of friends and family — kindhearted but tedious Miss Bates, a chatterbox spinster; ambitious Mr. Elton, a social-climbing parson; Frank Churchill, an enigmatic Romeo; Mr. Knightley, Emma's brother-in-law and the voice of her better nature; and a cluster of other finely drawn, unforgettable personalities.The author's skill at depicting the follies of human nature in a manner both realistic and affectionate elevates this tale of provincial matchmaking to the heights of scintillating satire. A classic of English literature that has delighted readers since its 1816 publication, the novel is now available in this high-quality, inexpensive edition sure to charm a new generation.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Pygmalion (Enriched Classics Series)",
        "Authors": "By Shaw, Bernard",
        "Description": "When George Bernard Shaw wrote Pygmalion more than a half century ago, no one could have predicted his play would eventually be converted into one of the great musicals of our time -- My Fair Lady -- and an Academy Award³-winning motion picture. Generations of readers and theatergoers have found relevance in Shaw's story of speech therapist Henry Higgins, who successfully transforms Liza Doolittle, a \"draggle-tailed guttersnipe,\" into a darling of high society who momentarily upsets his hard-edged reserve. The extraordinary wit of this master dramatist of the twentieth century cuts away at the artificiality of class distinctions to reveal that human clay can be molded into wondrous shapes.  Washington Square Press' Enriched Classics present the great works of world literature enhanced for the contemporary reader. This edition of Pygmalion includes the analysis of Eric Bentley from his book Bernard Shaw. Essential biographical and historical background is provided, together with notes, critical excerpts, and suggestions for further reading. A unique visual essay of period illustrations and photographs helps bring the play to life.",
        "Category": " Drama , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Hour of the Rose (Draycott Abbey Novels)",
        "Authors": "By Skye, Christina",
        "Description": "Secrets gather in the shadows of Britain's Draycott Abbey-intrigues of evil, unscrupulous men...and the astonishing mysteries of a star-crossed romance from centuries past.Dashing ex-Royal Marine Michael Burke has come to Draycott to unmask a treacherous conspiracy. Kelly Hamilton, a beautiful archeologist gifted with second sight, is searching for a priceless historical relic. But soon both are caught up in the magic of the moon-drenched abbey-unexpectedly united in desire and sensuous need...as they are drawn deeper and deeper into a dangerous web of deceit and betrayal. For only Michael and Kelly hold the key to the future and the past. And only their bold new passion can lay the abbey's ghosts to rest...by fulfilling the ancient promise of a rapturous love reborn.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "41 Stories (Signet Classics)",
        "Authors": "By Henry, O. and Raffel, Burton (CON)",
        "Description": "A classic anthology of short fiction by the acclaimed author gathers concise stories about New York City, confidence men, hoboes, the West, South America, and the American South, including such famed works as \"The Gift of the Magi\" and \"The Furnished Room.\" Reissue.",
        "Category": " Fiction , Classics",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Stardust of Yesterday (Haunted Hearts)",
        "Authors": "By Kurland, Lynn",
        "Description": "Inheriting a castle--and a ghost to go with it--Genevieve Buchanan finds herself falling in love with the spectre of Kendrick de Piaget, an arrogant thirteenth-century knight. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "One Perfect Knight",
        "Authors": "By O'Brien, Judith",
        "Description": "In her acclaimed Maiden Voyage, Judith O'Brien spun \"an extraordinary, enchanting tale\" (Rendezvous) of a love that crossed the centuries. Now, in a story that tingles with magic and wit, she sends a delightful contemporary heroine on a star-crossed quest in a long-ago land that may be more than just the stuff of fairy tales...  Madison Avenue advertising executive Julie Gaffney is on the lookout for a good man and a love that will last forever. But heroes are few and far between in New York City, and -- after one too many disastrous blind dates -- Julie has all but given up. Then, while chaperoning a children's birthday party in a suburban medieval theme restaurant, Julie suddenly falls into a cold faint...and awakens in fabled Camelot, face-to-face with the greatest hero of them all -- the legendary Lancelot.  Behind the suit of armor is a man of deep passion and sensuous masculinity, a loyal knight who is about to be ensnared in a web of royal deception that will tarnish his name for all time. Entranced by his azure eyes and mesmerizing voice, Julie realizes she has a mission to fulfill. Only she can divert the tragedy that dooms Camelot...and Lancelot. But in saving the kingdom and the knight she has come to love, Julie puts her own heart in great peril...",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Crazy for You",
        "Authors": "By Crusie, Jennifer",
        "Description": "On Wednesday, Quinn McKenzie changes her life. On Thursday, she tries to get somebody to notice. On Thursday night, somebody does.Quinn McKenzie is dating the world's nicest guy, she has a good job as a high school art teacher, she's surrounded by family and friends who rely on her, and she's bored to the point of insanity. But when Quinn decides to change her life by adopting a stray dog over everyone's objections, everything begins to spiral out of control. Now she's coping with dognapping, breaking and entering, seduction, sabotage, stalking, more secrets than she really wants to know, and two men who are suddenly crazy . . . for her.",
        "Category": " Fiction , Romance , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Tigers in the Snow",
        "Authors": "By Matthiessen, Peter and Hornocker, Maurice (PHT)",
        "Description": "Peter Matthiessen journeyed to the Russian Far East and other remaining tiger territory to witness for himself the species' present condition and to understand its possible fates. Bringing to his subject his deep knowledge and the instinct for the natural world that have made classics of his previous books, he allows us to participate in the battle for the future of one of the earth's most awesome creatures. Along the way, he tells the story of the species' origin and evolution, evoking as well its crucial, often totemic role in the cultures and mythologies of the peoples who came in contact with it.",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "North Point Pr",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Orchid Hunter",
        "Authors": "By Landis, Jill Marie",
        "Description": "The daughter of an  \"orchid hunter\" finds her exotic life turned upside down when she meets the twin sister she never knew she had and finds romance in the arms of a wonderful man. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "18 Best Stories by Edgar Allan Poe",
        "Authors": "By Poe, Edgar Allan",
        "Description": "A chilling compilation of some of Edgar Allen  Poe's best-loved stories, edited by Vincent Price and  Chandler Brossard and with an introduction by  Vincent Price, including: The Black  Cat - The Fall of the House of Usher - The Masque  of the Red Death - The Facts in the Case of M.  Valdemar - The Premature Burial - Ms. Found in a Bottle  - A Tale of the Ragged Mountains - The Sphinx -  The Murders in the Rue Morgue - The Tell-Tale Heart  - The Gold-Bug - The System of Dr. Tarr and  Prof. Fether - The Man That Was Used Up - The Balloon  Hoax - A Descent Into the Maelstrom - The  Purloined Letter - The Pit and The Pendulum - The Cask of  Amontillado",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1965"
        }
    },
    {
        "Title": "Danger On Panther Peak",
        "Authors": "By Wallace, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Minstrel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    }
]