[
    {
        "Title": "Legends, Lies, and Cherished Myths of American History",
        "Authors": "By Shenkman, Richard",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Granta 52: Food : The Vital Stuff",
        "Authors": "By Lanchester, John, Swift, Graham, Granta (EDT), and Coetzee, J M",
        "Description": "",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Granta Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Gardner's Art Through The Ages, Vol. 2: Renaissance And Modern Art, 8th Edition",
        "Authors": "By Gardner, Helen, de la Croix, Horst, Tansey, Richard G.",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Burgers",
        "Authors": "By Pickford, Louise and Brigdale, Martin (PHT)",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "Ryland Peters & Small",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Violets and Vinegar",
        "Authors": "By Cooper, Jilly and HARTMAN, Tom.",
        "Description": "",
        "Category": "",
        "Publisher": "Stein and Day",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Nakian",
        "Authors": "By O'HARA, Frank",
        "Description": "",
        "Category": "",
        "Publisher": "Museum of Modern Art, 1966",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Building Barbecues & Outdoor Kitchens",
        "Authors": "By Sunset Books (COR) and Vandervort, Donald W. (EDT)",
        "Description": "",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Beyond Acceptance: Parents of Lesbians & Gays Talk About Their Experiences",
        "Authors": "By Griffin, Carolyn Welch, Wirth, Marian J., and Wirth, Arthur G.",
        "Description": "\"Mom, Dad, I'm gay.\" When a parent hears these words, the initial shock is often followed by feelings ranging from anger and denial to fear and guilt. It's also the beginning of a difficult journey that, with understanding and emotional support, can lead to acceptance and beyond.Now fully revised and updated, Beyond Acceptance by co-authors Carolyn W. Griffin, Marian J. Wirth, and Arthur G. Wirth remains a ground-breaking book that provides  parents the comfort and knowledge they need to accept the gay children and build stronger family relationships. Based on the experiences of other parents, this book lets them know they are not alone and helps them through the emotional stages leading to reconciliation with their children.",
        "Category": " Social Science , LGBT Studies , Lesbian Studies",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Ronald Reagan: The Presidential Portfolio: History as Told through the Collection of the Ronald Reagan Library and Museum",
        "Authors": "By Cannon, Lou and Beschloss, Michael (INT)",
        "Description": "The Presidential Portfolio combines the unparalleled perspective of reporter and historian Lou Cannon with the vast holdings of the Reagan Library to create the second volume in the PublicAffairs Presidential Library Series. Lavishly illustrated with photos-many in full color-from the president's youth to his last days in office, hand-annotated documents, and everyday notes and doodles, and packaged with a 60minute CD containing the original recordings of some of Reagan's most memorable speeches, the book serves as a remarkable illustrated journey back in time. The journey starts with Reagan's childhood in Dixon, Illinois and includes his years in Hollywood; his marriage to Nancy Davis; his years as governor of California; the presidential campaigns; the assassination attempt; Reaganomics; his foreign policy; the Strategic Defense Initiative; the INF treaty; and Iran-Contra, and ends with Reagan's retirement and battle with Alzheimer's disease. A Gallup survey recently designated Reagan as the greatest president of all time, and Ronald Reagan: The Presidential Portfolio is a timely reference work and a beautiful gift.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Digital Scrapbooking: Using Your Computer to Create Exciting Scrapbook Pages",
        "Authors": "By Nerius, Maria Given",
        "Description": "It’s the next phase in the scrapbooking craze! And this creative resource is the first of its kind—the first to focus on the use of computer hardware and software to unlock an exciting range of creative possibilities. Crafters will explore the many ways digital elements can add pizzazz to their scrapbooks: they’ll learn to manipulate pictures with photo/image editing software, use scanners to create themed background papers, and draw on clip art for decorative accents. Going even further into the brave new world, there’s information on creating all-digital pages, putting together a slideshow on computer, and pooling various techniques to stage a “digital family reunion.”",
        "Category": " Computers , Computer Graphics",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Make It Again, Sam: A Survey of Movie Remakes",
        "Authors": "By Druxman, Michael B.",
        "Description": "",
        "Category": "",
        "Publisher": "A. S. Barnes",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Escape From War (My Side of the Story)",
        "Authors": "By Riordan, James",
        "Description": "Frank lives in London's East End. When his father is drafted and his neighborhood is bombed, Frank is evacuated to the countryside. There, he meets a German Jewish girl named Hannah and learns how much is at stake in the war with Nazi Germany.",
        "Category": " Juvenile Fiction , Historical , Military & Wars",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Best of Gourmet: The World at Your Table",
        "Authors": "By Gourmet Magazine Editors",
        "Description": "Nowadays, everyone who entertains is looking for outstanding casual fare that will allow them to spend more time with their guests. Dishes must be quick and easy to prepare (or able to be made ahead) and filled with the purest ingredients for optimum flavor. The Best of Gourmet, Featuring the Flavors of Thailand is filled with twenty-eight such menus-most are very relaxed, all are absolutely delicious.For example, after a chilly day on the slopes, you may want to treat your houseguests to A Ski House Dinner. Begin the evening around the fire with champagne and a large platter of ever-so-tender smoked salmon with cilantro cream. Later, roasted veal chops with shallots, tomatoes, and olive jus nestled on pillows of soft polenta make a rich, indulgent entrée. And before everyone retires, a heavenly warm chocolate raspberry pudding cake, made the day before and reheated, is served with a glass of cognac. When the summer heats up, why not spend A Weekend at the Shore with friends? You'll have three clever menus in hand that take advantage of the season's abundant fresh produce, include plenty of make-ahead dishes, and satisfy hearty seaside appetites. On Saturday morning you can serve Breakfast on the Beach with buttery-rich baked blueberry-pecan French toast. Lunch Indoors includes a serve-yourself composed salad of classic favorites and a lovely rhubarb rice pudding. Then, after a long day in the sun, Dinner on the Deck promises a seafood meal to remember with curry-marinated mussels, followed by grilled lobster with Southeast Asian dipping sauce. Or perhaps a last-minute Beyond Backyard Basics dinner is closer to what you had in mind? This little gem of a menu features ratatouille with penne-a heavenly jumble of roasted eggplants, onions, yellow squash, and red bell peppers, with plum tomatoes, garlic, thyme, parsley, and basil. For dessert, multicolored grapes perched atop pastry cream in puff pastry shells make a scrumptious and ever-so-pretty choice.So which menu will you try first? You'll find more than eighty pages of exquisite full-color photographs to help you decide. Altogether, this volume holds more than 350 recipes-including the very best recipes that appeared in Gourmet's food columns during 1999. There are hundreds of dishes that can be made in forty-five minutes or less (look for the clock symbol ð); plenty of leaner and lighter selections (look for the feather symbol F); seasonal ideas for everything from apples to zucchini; and an impressive array of tempting sweets and snacks.This year's Cuisines of the World section turns to the intriguing flavors of Thailand with a traditional dinner for eight and a collection of Thai snacks. Dishes such as steamed red snapper with ginger, grilled beef salad, fish cakes, and coconut ice cream demonstrate the sweet, sour, hot, and salty tastes of this fascinating country. Informative primers and exquisite full-color photos add further insight.Twenty-four more brand-new recipes appear in a special section featuring Unusual Pastas and Grains. From fresh rice noodles to Israeli couscous to wheat berries, and much more, these unique pantry items will undoubtedly expand your palette of flavors.Just when you thought you had tasted it all, along comes a cookbook that opens up a world of new possibilities-The Best of Gourmet",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Life's a Beach",
        "Authors": "By Cook, Claire",
        "Description": "By the bestselling author of Must Love Dogs, the story of two grown-up sisters who fight like cats and dogs--but call each other at least twice a day When Must Love Dogs was published, the Chicago Tribune called it \"pitch-perfect\" and the Washington Post declared, \"Readers will hope that Claire Cook will be telling breezy summer stories from the South Shore of Massachusetts for seasons to come.\" Luckily for her legions of fans, Cook returns with another sparkling romantic comedy that's reminiscent of Must Love Dogs in all the right ways, but very much its own animal--about a relationship-challenged single woman, her quirky-to-put-it-mildly extended family, and the summer the shark movie came to town. Life's a bit of a beach these days for Ginger Walsh, who's single at forty-one and living back home in the family FROG (Finished Room Over Garage). She's hoping for a more fulfilling life as a sea glass artist, but instead is babysitting her sister's kids and sharing overnights with Noah, her sexy artist boyfriend with commitment issues and a dog Ginger's cat isn't too crazy about. Geri, her BlackBerry-obsessed sister, is also nearly over the deep end about her pending fiftieth birthday (and might just drag Ginger with her). Toss in a dumpster-picking father, a Kama Sutra T-shirt-wearing mother, a movie crew come to town with a very cute gaffer, an on-again-off-again glassblower boyfriend, plus a couple of Red Hat realtors, and hilarity ensues. The perfect summer read, Life's a Beach is a warm, witty, and wise look at what it takes to move forward at any stage in life.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Voice",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Do You Know How to Flirt? Is Your Crush Crushing Back? What's you Ideal Guy Type?",
        "Authors": "By Alloy Books",
        "Description": "",
        "Category": "",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Trouble at the Mill (My Side of the Story)",
        "Authors": "By Wooderson, Philip",
        "Description": "Lizzy lives in a cramped mill worker's cottage and toils at a loom for fifteen hours a day. Her childhood friend Josh is the mill owner's son and leads a life of luxury. When Lizzy's father becomes involved in the reform movement, Lizzy and Josh's friendship is put to the test.",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Tie Me Up, Tie Me Down: Three Tales of Erotic Romance: Captivated by You / Promise Me Forever / Hunter's Right",
        "Authors": "By Kenyon, Sherrilyn (EDT), George, Melanie (EDT), and Black, Jaid (EDT)",
        "Description": "In this sexy erotica anthology, three hot authors reel you in with sizzling novellas about alpha heroes who will do anything to get the women they want -- even kidnap them!  Bestselling author Sherrilyn Kenyon presents \"'Captivated' by You,\" the second sexy story in her series featuring the Bureau of American Defense. Rhea Stevenson is a \"BAD\" agent who has just been handed her most challenging assignment. She must go undercover as a dominatrix to bring in a deadly terrorist. The only upside is that her fellow agent, \"Ace\" Krux, whom she has long desired, is her training partner. Almost immediately the roles of master and slave are wonderfully blurred and Rhea and Ace unleash a wealth of hidden desire.  From bestselling romance author Melanie George comes \"Promise Me Forever,\" the story of Savannah Harper, who has finally put her breakup with pro-football player Donovan Jerricho behind her. But when Tristan comes home to Mississippi on the eve of Savannah's wedding, he still wants her. And when he carries her off and holds her hostage, Savannah's surprised to find that the desire's deliciously mutual....  From Jaid Black comes \"Hunter's Right,\" the fantastical story of Corporal Ronda Tipton of the U.S. Army, whose chopper goes down in the Arctic Circle. The only survivor of the crash, Ronda happens upon a hidden civilization of Vikings -- where she must face the bridal auction block. Only Nikolas Ericsson, the man who found Ronda, can save her by claiming her as his own according to sacred rights. But will she and this primitive brute give in to the sparks made when their worlds collide?  Sensual and playful, these three novellas will carry you away!",
        "Category": " Fiction , Erotica , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Canaan",
        "Authors": "By Smith, Charlie",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Best of the Best from America: Preserving Our Food Heritage One State at a Time (Best of the Best Cookbook)",
        "Authors": "By McKee, Gwen (EDT) and Moseley, Barbara (EDT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Quail Ridge Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Joy of Entertaining",
        "Authors": "By Colton, Virginia",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam Pub Group",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "A Hummingbird in My House: The Story of Squeak",
        "Authors": "By Heidcamp, Arnette",
        "Description": "Anyone who has fallen under the spell of the hummingbird will treasure this lovable true story of a young ruby-throated hummingbird who becomes part of someone's household and life. 57 full-color photographs; 10 black-and-white drawings.",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "Crown",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Betty Crocker's Do-Ahead Cookbook (Recipes for the Freezer and the Refrigerator)",
        "Authors": "By Betty Crocker",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press / Western Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Fateless",
        "Authors": "By Kertesz, Imre, Wilson, Katharina M. (TRN), and Wilson, Christopher C.",
        "Description": "Winner, 2002 Nobel Prize for LiteratureOne of Publishers Weekly's Fifty Best Books of 1992Fateless is a moving and disturbing novel about a Hungarian Jewish boy’s experiences in German concentration camps and his attempts to reconcile himself to those experiences after the war. Upon his return to his native Budapest still clad in his striped prison clothes, fourteen-year-old George Koves senses the indifference, even hostility, of people on the street. His former neighbors and friends urge him to put the ordeal out of his mind, while a sympathetic journalist refers to the camps as \"the lowest circle of hell.\" The boy can relate to neither cliche and is left to ponder the meaning of his experience alone.George's response to his experience is curiously ambivalent. In the camps he tries to adjust to his ever-worsening situation by imputing human motives to his inhumane captors. By imposing his logic--that of a bright, sensitive, though in many ways ordinary teenager - he maintains a precarious semblance of normalcy. Once freed, he must contend with the \"banality of evil\" to which he has become accustomed: when asked why he uses words like \"naturally,\" \"undeniably,\" and \"without question\" to describe the most horrendous of experiences, he responds, \"In the concentration camp it was natural.\" Without emotional or spiritual ties to his Jewish heritage and rejected by his country, he ultimately comes to the conclusion that neither his Hungarianness nor his Jewishness was really at the heart of his fate: rather, there are only \"given situations, and within these, further givens.\"",
        "Category": " Fiction , Literary",
        "Publisher": "Northwestern University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Sensational Pasta",
        "Authors": "By Levy, Faye",
        "Description": "Shares recipes for salads, vegetable, cheese, poultry, and meat dishes, soups, and desserts that feature pasta",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Clutter's Last Stand: It's Time to De-Junk Your Life!",
        "Authors": "By Aslett, Don",
        "Description": "An updated guide to organization offers good-natured, practical guidance in ridding homes, offices, and lives of clutter and, thereby, enhancing one's relationships, emotional well-being, and personal growth. Original. 35,000 first printing.",
        "Category": " Self-help , Affirmations",
        "Publisher": "Marsh Creek Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "The Guardian (The O'Malley Series #2)",
        "Authors": "By Henderson, Dee",
        "Description": "A federal judge has been murdered. There is only one witness. And someone wants her dead. U.S. Marshal Marcus O'Malley thought he knew the risks of the assignment going in ... until he fell in love. Book number two in the popular O'Malley series brings back Marcus O'Malley from The Negotiator in a tense investigative thriller. Marcus has a case to solve, an assassin to stop, and a lady to convince he's right for her future. To do that he's going to have to walk back into his own past and wrestle with the complex matter of prayer -- and he's going to have to learn to trust again a sovereign God.",
        "Category": " Fiction , Literary",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Brown Bag: A Bag Full of Sermons for Children",
        "Authors": "By Jordan, Jerry Marshall",
        "Description": "",
        "Category": " Religion , Sermons , General",
        "Publisher": "Pilgrim Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Spring Training: Baseball's Early Season",
        "Authors": "By Grossfeld, Stan and Shaughnessy, Dan",
        "Description": "Before the purpose-pitch that zips inches from the batter's head, before greenfly autograph-seekers stalk hotel lobbies, before thousands of fans stand up and boo in 50,000-seat stadiums, before the proverbial dog days of summer and the pressure-packed moments of October . . . there is sweet spring. The long hello. Baseball's early season.The words spring training have long held special power over baseball fans. They signal the arrival of fresh air and sunshine after a long winter devoid of bare feet and box scores. The chance to see the game up close and personal, in beautiful slow motion. No other sport undergoes this slow, glorious unfolding. And no other book captures baseball's rite of passage in all its magic.Come on a wild ride through spring training's many attractions and peculiarities, from Florida to Arizona, the National to the American League, the dugouts to Section D. Glimpse retirees in Hawaiian shirts singing \"Take Me Out to the Ball Game,\" million-dollar players taking it easy on the field and in the bars, young rookies flashing their skills, grizzled vets going through the motions, wide-eyed children dressed from head to toe in their favorite team's garb.It's all here, from Alligator Alley to Cactus Way, sit-ups to sunblock, home runs to hangovers -- a lively tribute to America's favorite pastime in its purest, most wonderful form.",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "6.44",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Roller Hockey Radicals (Matt Christopher Sports Classics)",
        "Authors": "By Christopher, Matt",
        "Description": "After successfully winning a battle with the mayor over skating in an abandoned lot, the E Street Skates find they have an even more difficult challenge ahead as they are forced to play a game against the Bates Avenue Bad Boys. Simultaneous.",
        "Category": " Juvenile Fiction , Sports & Recreation , Hockey",
        "Publisher": "Little, Brown Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Marvin Redpost: Alone in His Teacher's House (Marvin Redpost, A First Stepping Stone Book)",
        "Authors": "By Louis Sachar",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Crashing the Boards (Super Hoops)",
        "Authors": "By Dan Weiss Hank Herman",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "A Spot of Bother",
        "Authors": "By Haddon, Mark",
        "Description": "A Spot of Bother is Mark Haddon’s unforgettable follow-up to the internationally beloved bestseller The Curious Incident of the Dog in the Night-Time. At sixty-one, George Hall is settling down to a comfortable retirement. When his tempestuous daughter, Katie, announces that she is getting married to the deeply inappropriate Ray, the Hall family is thrown into a tizzy. Unnoticed in the uproar, George discovers a sinister lesion on his hip, and quietly begins to lose his mind. As parents and children fall apart and come together, Haddon paints a disturbing yet amusing portrait of a dignified man trying to go insane politely.A Washington Post Best Book of the Year",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Men and Women Are From Eden: A Study Guide to John Paul II's Theology of the Body",
        "Authors": "By Healy, Mary",
        "Description": "Maybe you've heard of Pope John Paul II's theology of the body and wondered, vaguely, what it's all about. Maybe you've never heard of it until now and are asking, theology of the what? Maybe you're already familiar with the basics and are ready to incorporate this teaching on sex, love and marriage into your own life.     Whatever your level of understanding, you're probably ready for some good news about sex in a culture littered with the bad news of divorce, adultery, sexually transmitted disease, heartache and loneliness.     This guide is designed to help you appropriate the Pope's astonishing message: True, lasting love&#151;that which humanity enjoyed in the beginning, before the Fall&#151;is possible here and now. In nine straightforward lessons, Men and Women Are from Eden introduces the reader to the pope's warm, deeply biblical understanding of God's original plan for men and women, a plan that brings with it healing of mind in regard to sexuality and the body.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Servant",
        "Price Starting With ($)": "8.06",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Invitation to bridge",
        "Authors": "By Harkness, Kenneth",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "The Acts of the Apostles-Collegeville Bible Commentary #5",
        "Authors": "By Kurz, William S.",
        "Description": "",
        "Category": " Religion , Biblical Biography , General",
        "Publisher": "Liturgical Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "The Water That Caught on Fire: I Kings 17-18 for Children (Arch Books)",
        "Authors": "By Joann Scheck",
        "Description": "",
        "Category": "",
        "Publisher": "Concordia",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1969"
        }
    },
    {
        "Title": "Hoyle Up To Date Official rules for All Important Games",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Middle Church: Reclaiming the Moral Values of the Faithful Majority from the Religious Right",
        "Authors": "By Edgar, Robert",
        "Description": "A general secretary of the National Council of Churches of Christ and a six-term congressman cites the flaws in right-wing Christianity's uncompromising positions on such issues as abortion, gay marriage, and stem-cell research, arguing that moral concerns pertaining to such issues as poverty, peace, and the environment can mobilize mainstream people of faith. 40,000 first printing.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "JOHN WORK GARRETT AND HIS LIBRARY AT EVERGREEN HOUSE",
        "Authors": "By Garrett, John Work",
        "Description": "",
        "Category": "",
        "Publisher": "Privately printed",
        "Price Starting With ($)": "59.34",
        "Publish Date": {
            "Month": "January",
            "Year": "1944"
        }
    },
    {
        "Title": "Making More of Holy Week",
        "Authors": "By Flood, Edmund",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Sideshow",
        "Authors": "By Shawcross, William",
        "Description": "Details the Nixon administration's ignominious conduct in relation to Cambodia",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "34.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1979"
        }
    },
    {
        "Title": "Prodigal Soldiers: How the Generation of Officers Born of Vietnam Revolutionized the American Style of War",
        "Authors": "By Kitfield, James",
        "Description": "Documenting the transformation of the U.S. military from Vietnam to the Gulf War, a history of a generation of officers examines changing ideas about war, ending the draft, reducing racial tensions, and integrating women into the ranks.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "POTOMAC BOOKS",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Jim Henson's Muppets in Flip, Flap, Flop: A Book About Self-Esteem",
        "Authors": "By Stephanie St. Pierre",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The World Almanac of World War II: The Complete and Comprehensive Documentary of World War II",
        "Authors": "By Young, Peter",
        "Description": "Provides brief profiles of the war's military and political leaders, describes weapons, aircraft, and ships, and offers a chronology of battles and important events",
        "Category": "",
        "Publisher": "World Almanac Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Turkish Reflections: A Biography of a Place (DESTINATIONS)",
        "Authors": "By Settle, Mary Lee and Morris, Jan",
        "Description": "The author recounts her experiences living in Turkey for three years, and shares her observations on Turkish history, people, and culture",
        "Category": " Travel , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Danny And The Dinosaur (I Can Read Book)",
        "Authors": "By Hoff, Syd",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Flowers in the Rain & Other Stories",
        "Authors": "By Pilcher, Rosamunde",
        "Description": "A collection of short stories presents tales of joy and sorrow, filled with characters such as the mother conversing with her son on the morning of his wedding and a young girl first encountering love",
        "Category": " Fiction , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The Orgasmic Diet: A Revolutionary Plan to Lift Your Libido and Bring You to Orgasm",
        "Authors": "By Lindberg, Marrena",
        "Description": "For the millions of women unable to reach orgasm, or for those who want to improve their sex lives, here is an easy-to-follow diet and exercise plan to bring women to orgasm for the first time … and every time they have sex.In January, 2006, Elle magazine ran the feature “Happy Ending,” introducing Marrena Lindberg as the creator of The Orgasmic Diet. In this book, Lindberg offers a groundbreaking nutrition and exercise program designed to regulate a woman’s brain chemistry and body functioning and bring her to mind-blowing orgasm. The Orgasmic Diet includes four simple parts, including:· A diet low in carbohydrates that avoids “orgasm killers” like refined sugar and caffeine· High doses of fish oil supplements· Internal exercises that go far beyond Kegels· Maintenance of serotonin and dopamine levelsUnlike other orgasm books out there, which focus on new positions to try or psychological issues, here is the first-ever scientifically supported nutritional and exercise method to improve female libido and orgasmic ability, and a must-have guide for any woman looking to take her sex life to a whole new level.",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "Crown Archetype",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Hedgehog: An Owner's Guide to a Happy Healthy Pet (Happy Healthy Pet, 163)",
        "Authors": "By Wrobel, Dawn and Brown, Susan A.",
        "Description": "Hedgehogs are one of the hottest new pets around, and there's a lot of conflicting information about them. Here, a veteran hedgehog breeder, owner and advocate pairs with an exotic animals veterinarian to give first-time owners the help they need to share their homes with a hedgehog.",
        "Category": " Pets , Reference",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Miniature Schnauzer: An Owner's Guide to a Happy Healthy Pet",
        "Authors": "By Stark, Jeannette",
        "Description": "An Owner's Guide to a Happy Healthy Pet is the series to turn to when you want a basic reference that's reliable, up-to-date, and complete. These guides feature:Expert authors, plus renowned guest contributors on specialized topicsFull-color photos throughoutBasic information on the breed, species, or topicComplete coverage of care, health, grooming, training, and moreTips and techniques to make life with a pet more rewarding",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "IN THE AGE OF MANKIND PB",
        "Authors": "By Lewin, Roger",
        "Description": "Describes what is currently known about human evolution, loks at the work of anthropologists, and discusses the human traits of consciousness and language",
        "Category": " Science , General",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Evita: Musical Excerpts and Complete Libretto [Songbook]",
        "Authors": "By Rice, Tim and Webber, Andrew Lloyd",
        "Description": "",
        "Category": "",
        "Publisher": "Leeds Music Corporation",
        "Price Starting With ($)": "30.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Robo sapiens: Evolution of a New Species",
        "Authors": "By D'Aluisio, Faith and Menzel, Peter",
        "Description": "A field guide to our mechanical future, presenting the next generation of intelligent robots and their makers.Around the world, scientists and engineers are participating in a high-stakes race to build the first intelligent robot. Many robots already exist—automobile factories are full of them. But the new generation of robots will be something else: smart machines that act like living creatures. When they are brought into existence, science fiction will have become fact.What will happen then? With our prosthetic limbs, titanium hips, and artificial eyes, we are already beginning to resemble our machines. Equally important, our machines are beginning to resemble us. Robots already walk, talk, and dance; they can react to our facial expressions and obey verbal commands. When they take the next step and become fully autonomous, what will they do? Will we be partners or rivals? Could we meld into a single species—Robo sapiens?In Robo sapiens, Peter Menzel and Faith D'Aluisio present the next generation of intelligent robots and their makers. Accompanying brilliant photographs of more than one hundred robots is an account of the little-known, yet vitally important scientific competition to build an autonomous robot. Containing extensive interviews with robotics pioneers, anecdotal \"field notes\" with behind-the-scenes information, and easy-to-understand technical data about the machines, Robo sapiens is a field guide to our mechanical future.",
        "Category": " Photography , Individual Photographers , General",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Design Ideas for Bathrooms (Design Ideas Series)",
        "Authors": "By Hillstrom, Susan Boyle and Samu, Mark (PHT)",
        "Description": "Design Ideas for Bathrooms presents a range of ideas for creating an up-to-date bathroom for pampering or simple practicality. Readers will find many excellent examples of master baths, family baths, powder rooms, and accessible designs. There is complete coverage of the latest fixtures including desirable spa amenities such as jetted tubs and showers, steam devices and saunas, rain bars, and sprayers, plus a full representation of finishing materials from high-end looks in stone to affordable plastic laminates. Other targeted topics include vanities and storage, lighting, and ventilation. Additional helpful information explains how to make design decisions and product choices based on lifestyle needs. Lots of \"Smart Tips\" and \"Sidebars\" provide information at a glance.",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Out of this world; Across the Himalayas to forbidden Tibet",
        "Authors": "By Lowell Thomas, Jr.",
        "Description": "",
        "Category": "",
        "Publisher": "Greystone Press, NY",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "The Great Barbecue Companion: Mops, Sops, Sauces, and Rubs",
        "Authors": "By Bjorkman, Bruce",
        "Description": "This lively collection of sauces covers all the best flavors associated with barbecue: sweet, savory, hot, and spicy-sometimes mixing all four. Bruce Bjorkman, aka Mr. Barbecue, and veteran of hundreds of barbecue competitions, takes readers on a journey through the world of barbecue sauces, from Texas to the Carolinas to Cajun country, and from Asia to the Caribbean.More than 100 recipes, plus:Saucemaster tips.Barbecue lore and anecdotes.Mail-order sources of sauces and spices.Calendar of Kansas City Barbecue Society?É¬?sanctioned contests.",
        "Category": " Cooking , Methods , Outdoor",
        "Publisher": "Crossing Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Companion Guide to Healthy Cooking: A practical Introduction to Natural Ingredients",
        "Authors": "By Nigro, Natalie, Nigro, Shirley",
        "Description": "",
        "Category": "",
        "Publisher": "Featherstone & Brown",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Abraham Lincoln and the Second American Revolution",
        "Authors": "By McPherson, James M.",
        "Description": "James McPherson has emerged as one of America's finest historians. Battle Cry of Freedom, his Pulitzer Prize-winning account of the Civil War, was a national bestseller that Hugh Brogan, inThe New York Times Book Review, called \"history writing of the highest order.\" In that volume, McPherson gathered in the broad sweep of events, the political, social, and cultural forces at work during the Civil War era. Now, inAbraham Lincoln and the Second American Revolution, he offers a series of thoughtful and engaging essays on aspects of Lincoln and the war that have rarely been discussed in depth.McPherson again displays his keen insight and sterling prose as he examines several critical themes in American history. He looks closely at the President's role as Commander-in-Chief of the Union forces, showing how Lincoln forged a national military strategy for victory. He explores the importance of Lincoln's great rhetorical skills, uncovering how--through parables and figurative language--he was uniquely able to communicate both the purpose of the war and a new meaning of liberty to the people of the North. In another section, McPherson examines the Civil War as a Second American Revolution, describing how the Republican Congress elected in 1860 passed an astonishing blitz of new laws (rivaling the first hundred days of the New Deal), and how the war not only destroyed the social structure of the old South, but radically altered the balance of power in America, ending 70 years of Southern power in the national government.The Civil War was the single most transforming and defining experience in American history, and Abraham Lincoln remains the most important figure in the pantheon of our mythology. These graceful essays, written by one of America's leading historians, offer fresh and unusual perspectives on both.",
        "Category": " Literary Collections , American , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "25.98",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "The Palace",
        "Authors": "By Erdman, Paul Emil",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Courage To Be",
        "Authors": "By Tillich, P",
        "Description": "",
        "Category": "",
        "Publisher": "Collins",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Forever Ruined for the Ordinary: The Adventure of Hearing and Obeying God's Voice",
        "Authors": "By Dawson, Joy",
        "Description": "Joy Dawson describes what happened when she decided to follow God with an obedient heart: \"I was tuned in and turned on to God, the Creator and Sustainer of the universe. I took off on an adventure of a lifetime… hearing and obeying God's voice. I was forever ruined for the ordinary.\" Emphasizing God's commitment to be personally involved in our lives, Joy shares the lessons of a lifetime of faithful obedience to God. Through stories and biblical teaching, she helps readers discover the excitement of learning how to listen to God, joyfully obey Him, and see the wonder of the results that follow. The book includes the twenty-four ways God speaks to men and women, three characteristics of obedience, guidelines for seeking guidance, and secrets to a more intimate walk with God.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Family Therapy of Drug and Alcohol Abuse",
        "Authors": "By Kaufman, Edward, Kaufman, Pauline N.",
        "Description": "",
        "Category": "",
        "Publisher": "Psychology Press Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "Audubon: Natural Priorities",
        "Authors": "By Disilvestro, Roger and Palmer, Christopher (EDT)",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Turner Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Journey: How to live by Faith in an Uncertain World",
        "Authors": "By Graham, Billy",
        "Description": "",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Charles R. Swindoll.: Living Above the Level of Mediocrity.",
        "Authors": "By Charles R. Swindoll",
        "Description": "",
        "Category": "",
        "Publisher": "Guideposts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Monks of Tibhirine: Faith, Love, and Terror in Algeria",
        "Authors": "By Kiser, John W.",
        "Description": "The inspiration for the major motion picture \"Of Gods and Men\"In the spring of l996 armed men broke into a Trappist monastery in war-torn Algeria and took seven monks hostage, pawns in a murky negotiation to free imprisoned terrorists. Two months later their severed heads were found in a tree; their bodies were never recovered.The village of Tibhirine had sprung up around the monastery because it was a holy place protected by the Virgin Mary, revered by Christians and Muslims alike. But napalm, helicopters, and gunfire had become regular accompaniments to the monastic routine as the violence engulfing Algeria drew closer to the isolated cloister high in the Atlas Mountains.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Patches of Godlight: Father Tim's Favorite Quotes",
        "Authors": "By Karon, Jan",
        "Description": "In a touching novel by the author of A Common Life, Episcopal minister Father Tim Kavanagh seeks the wisdom of Mark Twain, C. S. Lewis, St. Paul, Wordsworth, and others to help him lead his flock.",
        "Category": " Fiction , Religious",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Conclave: The Politics, Personalities and Process of the Next Papal Election",
        "Authors": "By Allen, John L.",
        "Description": "A captivating insider’s guide to the politics and personalities that will have a tremendous impact on one of the world’s most secretive and important events–the election of a pope.The next time a conclave unfolds in Rome, some 6,000 journalists are expected to descend on the Eternal City to cover the death of John Paul II and report on the election of his successor. The man in white who emerges from the Sistine Chapel at its conclusion will automatically become one of the most important figures on earth, a leader who commands a unique combination of political and spiritual power. Depending on how he chooses to exercise that power, governments and political systems may rise or fall, religious wars may heat up or abate, and the Church may undergo a radical transformation–from changes in its stances on such issues as sexuality, the place of women in the Church, to the role of the papacy itself.Conclave is a fascinating look at the election process and at what this headline-making occasion will mean to the world. John L. Allen, Jr., takes readers behind the scenes to reveal the issues, parties, and people most likely to determine the outcome. Setting the election within a broader context, he explains why it matters who becomes pope, discusses their role in the modern world, and examines the issues that will form the agenda of the next papacy.Although the book is not intended as a “handicapper’s guide,” Allen does offer his own informed list of the “top twenty” contenders for the position. He creates, as well, a classification system that clarifies the differences among the informal political parties that exist within the College of Cardinals, the body of 130-plus men who will elect John Paul II’s successor. In conclusion, he presents a critical, independent-minded profile of each of those cardinals–for one of them will certainly be the new pope.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Image",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Furthermore! Memories of a Parish Priest",
        "Authors": "By Greeley, Andrew M.",
        "Description": "The best-selling novelist and Catholic priest shares his memories of life as a parish priest, his involvement in church politics and important contemporary issues, and his thoughts on the people he has met along the way, in the sequel to Confessions of a Parish Priest. 50,000 first printing. Tour.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Forge",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Resurrection: Release from Oppression",
        "Authors": "By Kelsey, Morton T.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Who Killed Joe McCarthy?",
        "Authors": "By Ewald, William Bragg",
        "Description": "Describes the secret efforts of the Eisenhower administration to stop McCarthy's Communist witch hunt by separating the Senator from his supporters",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "The Seasoning of a Chef: My Journey from Diner to Ducasse and Beyond",
        "Authors": "By Psaltis, Douglas and Psaltis, Michael",
        "Description": "The fascinating diner-to-Ducasse true story of a young New Yorker's meteoric rise from his grandfather's Greek diner in Queens to the kitchens of some of the world's greatest restaurants.Meet the man Alain Ducasse called “the best cook in my kitchen”—Doug Psaltis, a culinary Horatio Alger, whose stubborn passion for perfection and dogged idealism propelled him from humble beginnings to the pinnacle of the food world. Doug began working at his grandfather's diner in Jamaica, Queens, when he was just ten years old—barely big enough to haul a sack of potatoes. His next real restaurant job, following a brief stint in college and some time spent in Colorado kitchens, was in Huntington, Long Island, his hometown. Drivingly ambitious and hardworking, he would travel into Manhattan on his days off to work, often for twelve hours or more without pay, in some of New York’s premiere restaurants.He eventually was offered a regular job at David Bouley's new restaurant, Bouley Bakery, where he worked six days a week with double shifts at one of New York’s hottest and most acclaimed restaurants, often leaving the house before dawn and returning home to grab a couple of hours of sleep before taking the train back into the city. From there he went to Alain Ducasse New York, which eventually won four stars from theNew York Times. Doug caught Ducasse's eye and was selected as the first American chef in the Ducasse empire and the chef to lead the next Ducasse restaurant in New York, Mix. Running the kitchen of Mix was both a dream job and a formidable challenge. Doug guided the restaurant through many crises in the face of mounting pressure and tension from all sides—before an explosive conclusion. After leaving Mix, Doug was offered a job working for Thomas Keller at the French Laundry, arguably America's restaurant mecca, where he helped lead the kitchen with Keller. Today, just past thirty, he is starting a whole new chapter in a remarkable career—a seasoned chef at last.Filled with rampant egos, cutthroat kitchen politics, and settings ranging from Monte Carlo to Paris and Napa Valley,The Seasoning of a Chef is a real and rare glimpse into the food industry. More than anyone until now, Doug Psaltis reveals vividly and honestly the hardships, sacrifices, and dreams of glory that are all part of becoming a great chef.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "A Future Perfect: The Challenge and Hidden Promise of Globalization",
        "Authors": "By Micklethwait, John and Wooldridge, Adrian",
        "Description": "A Future Perfect is the first comprehensive examination of the most important revolution of our time--globalization--and how it will continue to change our lives. The authors, John Micklethwait and Adrian Wooldridge, correspondents for The Economist, won the Financial Times/Booz Allen Hamilton Global Business Book Award on Strategy and Leadership for their previous collaboration, The Witch Doctors. In A Future Perfect, Micklethwait and Wooldridge expand their field of vision in order to analyze, demystify, and expose the global forces reshaping our world, and they detail both the challenge and the hidden promise those forces hold for individuals, businesses, and governments.Do businesses benefit from going global? Are we creating winner-take-all societies? Will globalization seal the triumph of junk culture? What will happen to individual careers? Gathering evidence from the shantytowns of São Paolo to the boardroom of General Electric, from the troubled Russia-Estonia border to the booming San Fernando Valley sex industry, Micklethwait and Wooldridge mount a powerful, witty, levelheaded defense of globalization. Along the way, the authors introduce us to the cosmocrats--the members of the elite business, information, and diplomatic class who are creating the new world order. They also identify the three engines of globalization and describe how people are managing and governing in an increasingly global era. As they did in The Witch Doctors, the authors also brilliantly puncture myths and conventional wisdom, separating false hopes from emerging realities.Incisive, expansive, and optimistic, A Future Perfect is an illuminating tour of the global economy and a fascinating assessment of its potential impact.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "REVISED EDITION! The Rise of Brandenburg-Prussia to 1786",
        "Authors": "By Fay, Sidney B., revised by Klaus Epstein",
        "Description": "",
        "Category": "",
        "Publisher": "Holt Rinehart & Winston",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Horn Crown (Witch World, #14)",
        "Authors": "By Andre Norton",
        "Description": "",
        "Category": "",
        "Publisher": "DAW",
        "Price Starting With ($)": "6.23",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "Surviving Your Dog's Adolescence: A Positive Training Program",
        "Authors": "By Benjamin, Carol Lea, Lennard, Stephen, and Benjamin, Carol Lea (PHT)",
        "Description": "In Praise of Surviving Your Dog's Adolescence\"\"Carol Benjamin has brought her usual wit and insight to bear on what is one of the most troubling phases for dog owners.... Whether you're having difficulties with a youngster or have a puppy who will soon be an adolescent, you can't help but benefit from reading this book.\"\" Robert G. Maxwell President, The American Kennel Club\"\"A concise and practical guide Zthat] confronts almost every potential problem...with solid advice and good humor. It is destined to become a dog owner's next best friend.\"\" Roger A. Caras President, ASPCAA Howell Dog Book of Distinction",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Miracle Workout : The Revolutionary 3-Step Program for YOUR Perfect Body",
        "Authors": "By Davis, W. Jackson, Ph.D.",
        "Description": "An authority on exercise physiology introduces an innovative new three-step exercise program that reveals how to integrate diverse forms of exercise into one routine; explains how to enhance one's cardiovascular health, improve flexibility, and build strength; and describes how to build muscle through cardio exercise, without pain. 28,000 first printing.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Vision and Character: A Christian Educator's Alternative to Kohlberg",
        "Authors": "By Dysktra, Craig",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "The Art of Communicating, Revised (Fifty-minute Series)",
        "Authors": "By Decker, Bert",
        "Description": "This book provides you with nine behavioral skills that will develop your communication style, as well as help you find out how habits are formed and how you can change them, develop the techniques of persuasive communications, and learn to practice and apply these principles every working day.",
        "Category": " Language Arts & Disciplines , Communication Studies",
        "Publisher": "Crisp Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Richard Scarry's Things That Go",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Western Publishing Company",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "American Vistas: Volume 2: 1877 to the Present",
        "Authors": "By Jackson, Kenneth T. (EDT) and Dinnerstein, Leonard (EDT)",
        "Description": "Offering up-to-date coverage of America's social, political and diplomatic past, this anthology of articles by nationally renowned scholars introduces students to the excitement of American history.  With seven new selections, the seconde volume has been substantially revised to examine such topics as law and order in the American West, the role of women in the armed forces, American anti-semitism, and the rise of suburban culture centered around the mall.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "To a Very Special Friend (To Give and to Keep)",
        "Authors": "By Brown, Pam, Exley, Helen, and Clarke, Juliette",
        "Description": "",
        "Category": " Family & Relationships , Friendship",
        "Publisher": "Exley Giftbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Going the Distance",
        "Authors": "By Jones, Christina",
        "Description": "Maddy Beckett and her sister Suzy live in Milton St John, where horses, trainers and jockeys outnumber the rest of the inhabitants. Recovering from rejection by her boyfriend, Maddy meets Drew and falls instantly in love. But then Drew's wife appears, determined to bring him to heel.",
        "Category": " Fiction , General",
        "Publisher": "Orion Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Jade Green : A Ghost Story",
        "Authors": "By Naylor, Phyllis Reynolds",
        "Description": "Secrets  Orphaned fifteen-year-old Judith Sparrow brings two secrets to her uncle's house in South Carolina: one, that her grief-stricken mother died in a madhouse, the other that she has disobeyed the only condition to living in her uncle's home -- nothing green is allowed in the house.  Judith can't bear to part with the photograph of her mother in its lovely green silk frame. Surely this one small defiance will not jeopardize the happiness she finds in South Carolina -- with a family at last, and new friends, especially Zeke Carey, the miller's son.  But Uncle Geoffrey's house holds a secret of its own. And Judith's small picture frame, hidden away at the bottom of her trunk, unleashes a powerful force that seems determined to bring that secret into the open. Or is Judith simply following her mother down the path toward madness?",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Zia Summer",
        "Authors": "By Anaya, Rudolfo A.",
        "Description": "The place is Albuquerque. The time is now. The man is Sonny Baca, a small-time private eye with big-time dreams. A great-grandson of the fabled lawman Elfego Baca, Sonny always carries his forebear's Colt .45, but wonders if he also carries el Bisabuelo's courage. While the elder Baca gained fame by ridding Old New Mexico of dangerous desperadoes, Sonny ekes out a living investigating tacky divorces and dubious insurance claims ... until Gloria Dominic is found murdered in the most sensational fashion.Sonny is suddenly on the case with a vengeance. But then Gloria was his cousin, his beloved prima, and he has made a vow to her mother - and to himself - to find the killer.Neither flawless beauty nor marriage to a hot-shot politician had protected his cousin from a ghastly end. Her body had been drained of its blood, and around her novel an arcane insignia had been etched: the Zia sun symbol.\"This was no bungled break-in,\" says forensics. \"She knew her murderers.\" And Sonny knows that the sign of the sun is the work of brujas, of evil witches. He senses a mysterious connection between the past and present. The Aztecs, he reasons, used blood to feed the sun. Is Gloria's stolen blood likewise a gift to the sun? Could her bodily disfigurement be linked to the cases of cattle mutilation plaguing the area?Aided by his loyal girlfriend, Rita, and spurred on by the susto, the spirit, of Gloria, Sonny's search for truth leads him straight into Albuquerque's treacherous political arena - and a passionate environmental battle over nuclear waste transport and disposal.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Bible Cure for Weight Loss and Muscle Gain: Ancient Truths, Natural Remedies and the Latest Findings for Your Health Today (Bible Cure Ser)",
        "Authors": "By Colbert, Don",
        "Description": "OVER 3 MILLION BIBLE CURE BOOKS SOLDFROM THE NEW YORK TIMES BEST SELLING AUTHOR OF THE SEVEN PILLARS OF HEALTH AND I CAN DO THIS DIETThis book will share the insights of Dr. Colbert, as well as those of some of the top medical researchers in the world on the subject of weight loss. Dr. Colbert discusses new medical breakthroughs as well as the most recent weight loss and weight control strategies that work! He also explains the risks and consequences of obesity.",
        "Category": " Health & Fitness , Diet & Nutrition , Weight Loss",
        "Publisher": "Siloam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Manager's Pocket Guide to Generation X (Manager's Pocket Guide Series)",
        "Authors": "By Tulgan, Bruce",
        "Description": "",
        "Category": " Business & Economics , Management",
        "Publisher": "HRD Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Fast Feedback, Second Edition",
        "Authors": "By Tulgan, Bruce",
        "Description": "",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Human Resource Development Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Winnie-the-Pooh on Success: In Which, You, Pooh and Friends Learn about the Most Important Subject of All",
        "Authors": "By Milne, A. A., Allen, Roger E., and Allen, Stephen D.",
        "Description": "Are you as confused as Pooh about success and how to achieve it? Only decades ago, the definition of \"success\" was fairly straightforward: \"the attainment of wealth, position, honors, and the like.\" For Pooh it is as simple as acquiring more honey; for Piglet, it's far more serious: avoiding dangerous Heffalumps. But in these far more complicated times, people - as well as certain treasured animals of a certain forest - have all sorts of different ideas on the subject.Whatever your notion of success is, this captivating book by the celebrated authors of Winnie-the-Pooh on Management and Winnie-the-Pooh on Problem Solving will help you attain your goals. In addition to Pooh and Piglet, here are Eeyore, Roo, and the other endearing denizens of A. A. Milne's Hundred Acre Wood trying to make the art of living - and working - successfully far less befuddling. From understanding your own abilities to setting sensible objectives to defining and implementing a game plan to getting started, Winnie-the-Pooh on Success gives you the tools you need to be successful at any endeavor you choose.Whether you're a corporate manager, an entrepreneur, a student, a homemaker, or newly retired, this illuminating book by successful management consultants Roger E. Allen and Stephen D. Allen offers a wise, clear-headed, and commonsensical approach to business - and to life. Complete with a practical, accessible, and easy-to-follow plan for achieving the success you know can be yours, along with genuine Ernest H. Shepard illustrations, Winnie-the-Pooh on Success will take the Bother out of attaining your Very Important dreams, and help you get the pots of honey you deserve.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Sewing for Children (Singer Sewing Refrence Library)",
        "Authors": "By Staff Cy Decosse Inc.",
        "Description": "Features tips, techniques, and projects for sewing clothing for infants, toddlers, and children, with special sections on personalizing and on wardrobe planning",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Creative Publishing International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Presumed Alliance: The Unspoken Conflict Between Latinos and Blacks and What It Means for America",
        "Authors": "By Vaca, Nicolas C.",
        "Description": "As Latinos and African Americans increasingly live side by side in large urban centers as well as in suburban clusters, the idealized concept of a \"rainbow coalition\" would suggest that these two disenfranchised groups are natural political allies. Such a notion would be based on the presumption of a commonality between the two groups that serves as the glue for forming political and economic alliances on a mass level. However, contrary to this theoretical approach stands evidence that few formal or even informal coalitions exist between Latinos and African Americans. Many political insiders are asking themselves in private how one might interpret the taboo yet very real subjectof the often-frayed relations between African Americans and Latinos. Many who do not address this divisive issue fear that to acknowledge such a rift would invite adversaries to cast tension as a political weakness.Indeed, as the number of Latinos has increased dramatically over the last ten years, competition over power and resources has led to antagonism and a failure to cooperate. Many African Americans now view Latinos, because of their growing numbers, as a threat to their social, economic, and political gains. Conversely, Latinos do not view African Americans as an oppressed group in the same way other Americans do, and this often has negative results.In The Presumed Alliance, Vaca examines the historical context as well as the contemporary manifestations of the conflicts between Latinos and African Americans in an engaging, informative manner. Using case studies from New York, Los Angeles, Miami, Washington, D.C., Compton, and Houston, Vaca illustrates just how contentious the two groups have been toward each other, and what issues are at the root of such discord. With its discussions of language barriers, competition over affirmative action, and the overlooked contributions of Hispanics during the American Civil Rights movement, Vaca's narrative is both eye-opening and well informed. By daring to raise a topic that may upset so many, Vaca believes the issues surrounding these sometimes strained relations also may be resolved, if only they are addressed. This thought-provoking topic invites all to stop and think about important questions, and offers a glimpse at the future makeup of the American political landscape.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Rayo",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Limits Of Privacy",
        "Authors": "By Etzioni, Amitai",
        "Description": "Privacy is perhaps the most hallowed of American rights—and most people are concerned that new technologies available to governments and corporations threaten to erode this most privileged of rights. But in The Limits of Privacy, Amitai Etzioni offers a decidedly different point of view, in which the right to privacy is balanced against concern for public safety and health. Etzioni looks at five flashpoint issues: Megan’s Laws, HIV testing of infants, deciphering of encrypted messages, national identification cards, and medical records, and concludes that there are times when Amricans’ insistence on privacy is not in the best interests of society at large. He offers four clear and concise criteria which, when applied jointly, help us to determine when the right to privacy should be overridden for the greater public good.Almost every week headlines warn us that our cell phones are being monitored, our e-mails read, and our medical records traded on the open market. Public opinion polls show that Americans are dismayed about incursions against personal privacy. Congress and state legislatures are considering laws designed to address their concerns.Focusing on five flashpoint issues—Megan’s Law, mandatory HIV testing of infants, encryption of electronic documents, national identification cards and biometric identifiers, and medical records—The Limits of Privacy argues counterintuitively that sometimes major public health and safety concerns should outweigh the individual’s right to privacy. Presenting four concise criteria to determine when the right to privacy should be preserved and when it should be overridden in the interests of the wider community, Etzioni argues that, in some cases, we would do well to sacrifice the privacy of the individual in the name of the common good.",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Tears of the Moon",
        "Authors": "By Roberts, Nora",
        "Description": "",
        "Category": "",
        "Publisher": "Jove Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Daniel: Faithful Captive",
        "Authors": "By Heath, Lou",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Baptist Sunday School Board",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "May",
            "Year": "1977"
        }
    },
    {
        "Title": "The Race To The Bottom: Why A Worldwide Worker Surplus And Uncontrolled Free Trade Are Sinking American Living Standards",
        "Authors": "By Tonelson, Alan",
        "Description": "As evidenced by the WTO riots in Seattle in December 1999, there is a volatile debate among Americans over how the new world economy affects our standards of living and our country's chances for future prosperity. With giant multinational companies based in the U.S. and other wealthy countries transferring ever more factories and labs to poorer countries, the fear is that slave-wage workers overseas are undermining the bargaining power of labor in the industrialized world.In this book Alan Tonelson explains how a competition has emerged in which countries with the weakest workplace safety laws, the lowest taxes, and the toughest unionization laws win investment from American and European countries. Tonelson argues that this \"race to the bottom\" of labor standards has been the driving force behind the decline of American living standards for the past quarter century, and, as we have already begun to see, will cause even bigger problems for the worldwide economy as it continues.Tonelson analyzes how the entry of such population giants as China, India, and Brazil into the global market have added fuel to the eroding labor standards. He reveals how an ever larger share of the foreign competition faced by American laborers is hitting not just fields such as apparel and toys, but many of America's highest wage industries such as aerospace and software. And he describes how the reeducation and retraining programs that political leaders say is the remedy to the problem will do nothing to help most Americans cope with competition from the global workforce.A lively, provocative guide to the new global economy, The Race to the Bottom fills the gap of hard evidence in readable form in the globalization debate, providing the guidebook that American workers have been waiting for, and the indictment that our economic and policy establishments have been dreading.",
        "Category": " Business & Economics , Economic Conditions",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "How to Buy Your Own Home in 90 Days",
        "Authors": "By Garrison, Marc Stephen",
        "Description": "Tells how to assess net worth, determine one's housing needs, analyze the area, find the right home, arrange financing, negotiate a price, and handle the closing",
        "Category": " Business & Economics , General",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Volume Three: Middlesex County & Its People: A History.",
        "Authors": "By Conklin, Edwin P.",
        "Description": "",
        "Category": "",
        "Publisher": "Lewis Historical",
        "Price Starting With ($)": "8.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1927"
        }
    },
    {
        "Title": "Volume Four: Middlesex County & Its People: A History.",
        "Authors": "By Conklin, Edwin P.",
        "Description": "",
        "Category": "",
        "Publisher": "Lewis Historical",
        "Price Starting With ($)": "8.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1927"
        }
    },
    {
        "Title": "The Episode",
        "Authors": "By Pollak, Richard,",
        "Description": "After an episode of epilepsy and retrograde amnesia, reporter Daniel Cooper races to discover the truth behind the murder of an employee of a firm he has been attacking in his articles and the appearance of a gun in his hamper",
        "Category": " Fiction , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "A Manager's Guide to Operations Research",
        "Authors": "By Ackoff, Russell L.",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley & Sons Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1963"
        }
    }
]