[
    {
        "Title": "Mama Wears Two Aprons: Women in Farming and Farm Marketing",
        "Authors": "By Coleman, Margaret",
        "Description": "Women were not invented until the 1950s. Or so it seems to the archival reader, searching for accounts of early farm women. Primary sources, however, reveal a different picture. At the heart of every successful farm was a woman. In this unique history, Margaret Coleman explores women farmers in Montgomery County, Maryland, from the early days to the present.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "PublishingWorks",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Stay-at-Home Parent's Survival Guide",
        "Authors": "By Tinglof, Christina Baglivi",
        "Description": "Each year thousands of parents, yearning for more time with their children, put away their briefcases and laptops in favor of baby gear and Legos. Yet being home with the kids all day isn't easy! Some of us need a little extra help with the transition.  The Stay-at-Home Parent Survival Guide not only helps Moms and Dads survive the occasional stressful day--something every parent experiences now and then--but also inspires them with new ideas for indoor and outdoor activities, great places to take the kids, starting a playgroup, building a support system, and keeping connected in the adult community.  Even if you're a parenting pro, The Stay-at-Home Parent Survival Guide is a useful resource that offers unique ways to handle the day-to-day tasks of stay-at-home parenting, such as helpful tips for finishing the housework with the kids underfoot, meal and naptime strategies that work, skills for building a stronger marriage, managing your time effectively, beating the stay-at-home blues, and balancing household finances on a single income.  In addition to the expertise of author Christina Baglivi Tinglof and other stay-at-home parents, The Survival Guide includes valuable insights from a variety of experts, including:   Kathy Kristof, syndicated columnist, on how to set and reach financial goals Arlene Rossen Cardozo, author of Sequencing, on the evolution of the stay-at-home mom Dr. Sylvia Rimm, \"Today\" show parenting expert, on positive discipline Dr. Brian Ray, president of the National Home Education Research Institute, on homeschooling Elaine St. James, author of Simplify Your Life with Kids, on just that Ellen Parlapiano and Patricia Cobe, authors of Mompreneurs, on starting your own business from home   Christina Baglivi Tinglof is a stay-at-home mom of three young sons and the author of Double Duty: The Parents' Guide to Raising Twins. She and her family live in Los Angeles.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Forty Gospel Hymn Stories",
        "Authors": "By sanville, george",
        "Description": "",
        "Category": "",
        "Publisher": "The Rodeheaver Hall Mack Co",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1943"
        }
    },
    {
        "Title": "To Stand at the Pole: The Dr. Cook-Admiral Peary North Pole controversy",
        "Authors": "By Hunt, William R",
        "Description": "",
        "Category": "",
        "Publisher": "Stein and Day",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The French Revolution and Human Rights: A Brief Documentary History (Bedford Series in History and Culture)",
        "Authors": "By Hunt, Lynn (TRN)",
        "Description": "This brief documentary history includes 38 documents that explore the issue of rights and citizenship in Revolutionary France and the movement that helped define modern notions of civil rights.",
        "Category": " History , Europe , France",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Gestapo",
        "Authors": "By Crankshaw, Edward",
        "Description": "",
        "Category": " History , Military , World War II",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Grant: A Biography",
        "Authors": "By McFeely, William S.",
        "Description": "Traces the life of America's eighteenth president from his uneventful childhood, through his West Point education and extraordinary successes on the battlefield, to his failure in the world of politics",
        "Category": " History , United States , 19th Century",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "American National Security",
        "Authors": "By Jordan, Amos A., Taylor, William J., and Mazarr, Michael J.",
        "Description": "This fifth edition of American National Security is a timely update of a classic classroom text, providing contemporary perspectives on limited war, economic challenges to national security, and research and development. It reviews the changing security environment in key regions of the world: Russia, East Asia, the Middle East, Sub-Saharan Africa, Latin America, and Europe. And it identifies the issues that the United States must face in the next century: peace operations, conflict and arms control, and the widening array of missions undertaken by U.S. armed forces.\"We have chosen to emphasize 'power,' broadly defined, as the central dimension of international and national security. This is not to deny that various trends and forces are increasingly pressing states toward more cooperative, less confrontational behavior; rather it is to focus on the fact that on important issues many states -- including all the great powers -- apply a power calculus in dealing with other international actors.\" -- from the fifth edition of American National SecurityPraise for previous editions:\"A classic text, widely used in universities... It does an exemplary job of explaining the process of defining and implementing national security objectives. Hardly any significant subject is omitted from this very rich and readable volume.\" -- Foreign AffairsContentsForeword by Senator Sam NunnPart I -- National Security Policy: What Is It, and How Have Americans Approached It? 1. National Security: The International Setting2. Military Power and the Role of Force in the Post-Cold War Era3. Traditional American Approaches to National Security4. The Evolution of American National Security PolicyPart II -- National Security Policy 5. Presidential Leadership and the Executive Branch in National Security6. The Impact of Congress on National Security Policy7. Intelligence and National Security8. The Role of Military in the National Security Policy Process9. Defense Planning, Budgeting, and Management10. The National Security Decision-making Process: Putting the Pieces TogetherPart III -- Issues of National Strategy 11. Low-level Conflict12. Limited War13. Nuclear StrategyEconomic Challenges to National Security15. Research and DevelopmentPart IV -- International and Regional Security Issues 16. Russia17. East Asia18. The Middle East19. Sun-Sarahan Africa20. Latin America21. EuropePart V: Approaches to National Security for the Early Twenty-first Century 22. Peace Operations23. Conflict and Arms Control24. National Security Perspectives for the Early Twenty-first Century",
        "Category": " History , Military , General",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Rhyme and Verse - To Help Make a Point (Complete Speaker's and Toastmaster's Library)",
        "Authors": "By Jacob M. Braude",
        "Description": "",
        "Category": "",
        "Publisher": "Pretice-Hall, inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Webster's Instant Word Guide",
        "Authors": "By WEBSTER'S",
        "Description": "",
        "Category": "",
        "Publisher": "G. & C. Merriam Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1972"
        }
    },
    {
        "Title": "Under the Black Flag: The Romance and the Reality of Life Among the Pirates (Harvest Book)",
        "Authors": "By Cordingly, David",
        "Description": "\"This is the most authoritative and highly literate account of these pernicious people that I have ever read.\" -- Patrick O'BrianPirates are so much a part of legend that it is easy to forget they actually existed. UNDER THE BLACK FLAG tells their story in a rollicking account of the golden age of piracy that is packed with history, anecdote, and above all adventure. Here are the true stories of such bloodthirsty legends as Blackbeard and Captain Kidd, Anne Bonny, and the fearsome Mary Read. And here are rousing descriptions of what ships pirates sailed, what punishments they exacted, what they really wore, and how they flourished--or perished. From the smoky havoc of shipboard battle to the loneliness of a fugitive's life at sea, this spellbinding narrative vividly brings the brutal world of pirates to life.",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Old wives' Lore for Gardeners",
        "Authors": "By Boland, Bridget & Maureen",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Passage to Ararat (A Ruminator Find)",
        "Authors": "By Arlen, Michael J",
        "Description": "",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Ruminator Books",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Crisis of Church & State 1050-1300: With Selected Documents (A Spectrum Book-S102)",
        "Authors": "By Brian Tierney",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice-Hall, Inc.",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Jacqueline Kennedy Onassis: A Portrait of Her Private Years",
        "Authors": "By David, Lester",
        "Description": "Picking up from where A Woman Named Jackie left off, a celebration of her sixty-fifth birthday looks at the life of the former first lady since her marriage to Aristotle Onassis, her role as mother, and her resistance to the Kennedy clan. 50,000 first printing. $50,000 ad/promo. Tour.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Citadel",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The healing energies of music",
        "Authors": "By Lingerman, Hal A.",
        "Description": "",
        "Category": "",
        "Publisher": "Theosophical Pub. House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Peter Ashley",
        "Authors": "By Heyward, DuBose",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar & Rinehart, inc",
        "Price Starting With ($)": "43.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1932"
        }
    },
    {
        "Title": "Stay Me, Oh Comfort Me: Journals and Stories, 1933-1941",
        "Authors": "By Fisher, M. F. K.",
        "Description": "M.F.K. Fisher worked diligently, and against time, in the months just before her death to assemble her never-before-published journals, short stories, and correspondence, weaving them into two volumes. Continuing where she left off in To Begin Again, this book presents a candid and revealing portrait of the artist during what may have been the most traumatic period of her life.Fisher and her first husband, Al, had returned from France to California by 1933, but the Depression had reduced their hopes and frustrated their artistic aspirations. After a short stay, they left California for Switzerland, accompanied by their friend Dillwyn Parrish.This is Fisher's most open account of their complicated triangle, and in it she reveals the details behind her decision to divorce her husband and marry Parrish. A short time after their marriage, Parrish developed Buerger's disease, and Fisher chronicles their heartbreaking battle with this terrible degenerative illness. As fascism swept across Europe, they returned to California, remaining through Parrish's decline and ultimate suicide. This was an excruciating time for Fisher, who was forced to watch helplessly as the disease ravaged the man she would call \"the love of my life,\" just as the Nazis marched in to conquer her beloved France.\"When I write of hunger,\" says Fisher, \"I am really writing about love and the hunger for it... [and] the warmth and the riches and the fine reality of hunger satisfied... and it is all one.\" Stay Me, Oh Comfort Me documents, with arresting candor and emotion, the loves and longing that would shape the rest of Fisher's remarkable life and forever inform her work.",
        "Category": "",
        "Publisher": "Pantheon Books",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Adolescence: The Survival Guide for Parents and Teenagers",
        "Authors": "By Fenwick, Elizabeth and Smith, Tony",
        "Description": "Describes the changes and challenges that accompany the teenage years and offers advice to teenagers and their parents on working out problems",
        "Category": " Family & Relationships , Life Stages , Adolescence",
        "Publisher": "DK Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The PDR Family Guide to Prescription Drugs, 7th Edition",
        "Authors": "By Medical Economics Company, Inc. (EDT)",
        "Description": "The publishers of the Physician's Desk Reference offer the seventh edition of the their consumer guide based on the vital doctor's reference, with data on more than one thousand medications, up-to-date information on the latest drugs, and listings by brand name, generic name, and medical problem. Original. 35,000 first printing.",
        "Category": " Health & Fitness , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Bird House Book: How to Build Fanciful Bird Houses and Feeders, from the Purely Practical to the Absolutely Outrageous",
        "Authors": "By Woods, Bruce and Schoonmaker, David",
        "Description": "Includes plans for bird houses, and discusses siting, unwanted guests, and attracting particular species of birds",
        "Category": " Technology & Engineering , General",
        "Publisher": "Sterling Publishing (NY)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Pictorial Atlas of the World",
        "Authors": "By Mead, William R",
        "Description": "",
        "Category": "",
        "Publisher": "OTTENHEIMER PUBLISHERS, INC.",
        "Price Starting With ($)": "6.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Paint: Decorating With Water-Based Paints",
        "Authors": "By Sutcliffe, John and Twort, Andrew (PHT)",
        "Description": "Featuring three hundred color photographs, a decorating guide evaluates a wide variety of solvent-free emulsion paints, washes, varnishes, and homemade mixes, and illustrates such techniques as color-washing, distressing, spattering, and stenciling.",
        "Category": " Art , Techniques , Painting",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Paint your home",
        "Authors": "By Donegan, Francis",
        "Description": "Describes painting tools and equipment, and tells how to prepare rooms for painting, repair plaster, strip woodwork, refinish floors, and clean and store brushes",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Reader Over Your Shoulder: A Handbook for Writers of English Prose",
        "Authors": "By Graves, Robert and Hodge, Alan",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1979"
        }
    },
    {
        "Title": "Student Study Resource: Study Outlines, Solutions to Odd-Numbered Problems, Ready Notes for use with Accounting: What the Numbers Mean",
        "Authors": "By Marshall, David, McManus, Wayne W., and Viele, Daniel",
        "Description": "Accounting: What The Numbers Mean, 5e, was written to meet the needs of non-accountants who want a basic understanding of financial statements, and who want to learn how to use accounting information in the financial decision-making process. The reader is introduced to basic concepts supporting financial statements and managerial accounting information. Students learn what financial statements do and do not communicate.  A complete annual report is included in the appendix.",
        "Category": " Business & Economics , Accounting , General",
        "Publisher": "McGraw-Hill/Irwin",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Washington, D.C. to Washington Square",
        "Authors": "By Brademas, John",
        "Description": "",
        "Category": "",
        "Publisher": "Weidenfeld & Nicolson",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Low Carb Recipes:  Delicious Recipes for Enjoying a Low-Carb Diet",
        "Authors": "By Lauren Coles",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Fodor's Cityguide Washington, D.C. 2nd Edition: The Ultimate Source Book for City Dwellers (Fodor's Cityguides)",
        "Authors": "By Fodor's Travel Publications, Inc. and Kaufman, Deborah (EDT)",
        "Description": "Written by local experts and critics, Fodor's CITYGUIDE is the ultimate resident's guide to the city.  For newcomers and suburbanites, it's a shortcut to knowing the city like a native.  And, for urban know-it-alls, it's the perfect desktop reference and may even point out a few secrets you haven't uncovered yet!  Everyone will appreciate the comprehensive coverage, dead-on reviews, and the atlas of full-color maps.Hundreds of restaurants  Our dining gurus share their secrets: landmarks, trendsetters, political haunts, and cozy neighborhood finds in all price categories.Shops galore  Let our personal shopper show you the best and the latest in every category all over town. If it's sold in the city, you can read about it here.Before and after dark  Whether you're in the mood for smooth jazz, a night at the opera, or just a martini, we'll tell you where to unwind. All the places and pleasures  From favorite sights to offbeat attractions, museums to day spas, CITYGUIDE WASHINGTON, DC is loaded with bright ideas. Basics and beyond  Transportation and caterers, banks and ballroom dance, language schools and the cable guy–they're all inside. Color maps of every neighborhood  They're spectacular and easy to read–and every shop, restaurant, and sight is keyed to the maps. Plus, you'll find maps of the Mall, Kennedy Center, the Metro, and more.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Edwardian Life and Leisure",
        "Authors": "By Pearsall, Ronald",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "What to Name Your Dog",
        "Authors": "By Shook, Carrie and Senett, Michael",
        "Description": "Features a wide variety of potential names and their sources for your pet dog.",
        "Category": "",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "One for the Money (Stephanie Plum, No. 1) (Stephanie Plum Novels)",
        "Authors": "By Evanovich, Janet",
        "Description": "The dynamite blockbuster from Janet Evanovich that started it all—now a major motion picture starring Katherine Heigl as Stephanie Plum!ONE FINE MESSWelcome to Trenton, New Jersey, home to wiseguys, average Joes, and Stephanie Plum, who sports a big attitude and even bigger money problems (since losing her job as a lingerie buyer for a department store). Stephanie needs cash—fast—but times are tough, and soon she's forced to turn to the last resort of the truly desperate: family...ONE FALSE MOVEStephanie lands a gig at her sleazy cousin Vinnie's bail bonding company. She's got no experience. But that doesn't matter. Neither does the fact that the bail jumper in question is local vice cop Joe Morelli. From the time he first looked up her dress to the time he first got into her pants, to the time Steph hit him with her father's Buick, M-o-r-e-l-l-i has spelled t-r-o-u-b-l-e. And now the hot guy is in hot water—wanted for murder...ONE FOR THE MONEYAbject poverty is a great motivator for learning new skills, but being trained in the school of hard knocks by people like psycho prizefighter Benito Ramirez isn't. Still, if Stephanie can nab Morelli in a week, she'll make a cool ten grand. All she has to do is become an expert bounty hunter overnight—and keep herself from getting killed before she gets her man...",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Fun & Tricks with Your Dog",
        "Authors": "By Hodgson, Sarah",
        "Description": "Practical and entertaining, here is a complete step-by-step guide to fun and funny tricks you can teach your dog, from kiss to fetch the paper to find my keys.  There are also chapters on how to get involved in organized activities you can both enjoy, including agility competitions, tracking and herding and more formal dog shows.  Learn how to train your dog to take part in your activities as well, from vacationing to dog play groups, and how to get started in the rewarding activities of pet therapy.  There's also a quick guide to what to do in case of canine athletic injuries.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Keeshond (Kw Dog Breed Library)",
        "Authors": "By Weil, Martin",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "My Mother Gave Me The Moon",
        "Authors": "By Regan, Patrick, Kelly, Becky (ILT), and Kelly, Becky",
        "Description": "\"My mother made everyday days seem special. And made special days nothing short of magical.\"My mother gave me the moon ... the stars ... her time and attention ... and all the love her heart could hold. This heartfelt gift book from watercolor artist Becky Kelly captures the beautiful moments of motherhood with tender words and evocative artwork. Give back to your mother now with this perfect statement of your appreciation for her love and affection. In all the universe, there's no more deserving of gratitude than your mother.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Dog Tags of Courage: The Turmoil of War and the Rewards of Companionship",
        "Authors": "By Burnam, John C.",
        "Description": "",
        "Category": " History , Military , Vietnam War",
        "Publisher": "Lost Coast Press",
        "Price Starting With ($)": "19.67",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "A Short History of Planet Earth: Mountains, Mammals, Fire, and Ice (Wiley Popular Scienc)",
        "Authors": "By MacDougall, J. D.",
        "Description": "Four and a half billion years long, Earth's history is the fascinating, magnificent product of creation, transformation, evolution, and extinction. A Short History of Planet Earth chronicles this complex life story in an accessible and thoroughly engaging single volume that charts the geologic and biological life of our dynamic planet. A Short History of Planet Earth, the ideal, concise introduction to earth and life sciences, includes a handy glossary of geologic terms, and forty information-packed illustrations.",
        "Category": " Science , Earth Sciences , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Getting in: A Step-By-Step Plan for Gaining Admission to Graduate School in Psychology",
        "Authors": "By American Psychological Association, APA",
        "Description": "",
        "Category": " Study Aids , College Entrance",
        "Publisher": "American Psychological Association",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "City of Fire (Lena Gamble Novels)",
        "Authors": "By Ellis, Robert",
        "Description": "When a vibrant young woman is found in bed by her hotshot businessman husband, carved from belly to throat with a very sharp knife, the elite Robbery-Homicide division of the LAPD responds in full force. Best-case scenario for lead Detective Lena Gamble: Nikki Brant’s husband killed her, case closed, and on to the next crime scene before the ravenous Hollywood media can get their lurid tabloid machinery up and running.Unfortunately for Lena, though, she knows that best-case scenarios only happen in the movies. The murder is the first in a series of brutal crimes against beautiful women thought to be perpetrated by the same man, a killer dubbed Romeo in the press. It’s the case of a lifetime, and promises to either elevate Lena to the upper echelons of a publicity-hungry department in need of heroes, or bring about a very public and painful fall from grace. Lena has been in the public eye before, on the night her rock-star brother was gunned down on a dark street in Hollywood---an unsolved murder so grisly she’s never recovered. She knows the score when the press and the LAPD collide.As the investigation plays out and a massive forest fire blankets the city with acrid smoke, a cloud of conspiracy descends on Lena’s investigation, and she knows she’ll have to grind this one out . . .  because Nikki Brant’s death just breathed new life into more than one closed case . . . because the web of conspiracy is spun more intricately than she can possibly imagine . . . and because Lena knows there’s only one rock solid rule to murder in L.A.:  The bigger the spectacle, the deeper the horror.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Sundays at Tiffany's",
        "Authors": "By Patterson, James and Charbonnet, Gabrielle",
        "Description": "As a little girl, Jane has no one.  Her mother, the powerful head of a Broadway theater company, has no time for her.  She does have one friend-a handsome, comforting, funny man named Michael-but only she can see him.  Years later, Jane is in her thirties and just as alone as ever.  Then she meets Michael again-as handsome, smart and perfect as she remembers him to be.  But not even Michael knows the reason they've really been reunited.SUNDAYS AT TIFFANY'S is a love story with an irresistible twist, a novel about the child inside all of us-and the boundary-crossing power of love.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Abstinence Teacher: A Novel (Reading Group Gold)",
        "Authors": "By Perrotta, Tom",
        "Description": "\"Perrotta is that rare combination: a satirist with heart….Those who haven't curled up on the couch with this writer's books are missing a very great pleasure.\"—Seattle TimesStonewood Heights is the perfect place to raise children: it's got good schools, solid values and a healthy real estate market.  Parents in the town are involved in their children's lives, and often in other children's lives, too—coaching sports, driving carpool, focusing on enriching experiences.  Ruth Ramsey is the high school human sexuality teacher whose openness is not appreciated by all her students—or their parents.  Her daughter's soccer coach is Tim Mason, a former stoner and rocker whose response to hitting rock bottom was to reach out and be saved.  Tim's introduction of Christianity on the playing field horrifies Ruth, while his evangelical church sees a useful target in the loose-lipped sex ed teacher.  But when these two adversaries in a small-town culture war actually talk to each other, a surprising friendship begins to develop.\"Nobody renders the world of soccer moms and sprinklers and SUVs like Perrotta. He's the Steinbeck of suburbia.\"—Time\"Tom Perrotta is a truth-telling, unshowy chronicler of modern-day America.\"—The New York Times Book Review (in a front-page review)The Abstinence Teacher illuminates the powerful emotions that run beneath the placid surface of modern American family life, and explores the complicated spiritual and sexual lives of ordinary people. It is elegantly and simply written, characterized by the distinctive mix of satire and compassion that has become Perrotta's trademark.",
        "Category": " Fiction , Literary",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Double Homicide Boston/Santa Fe",
        "Authors": "By Jonathan Kellerman, Faye Kellerman",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The U.s Army War College Guide to the Battle of Gettysburg",
        "Authors": "By Luvaas, Jay and Nelson, Harold W. (EDT)",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Favorite Brand Name: Low-Carb Recipes (Favorite Brand Name Cookbook)",
        "Authors": "By Publications International Ltd., Favorite Brand Name Recipes",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Myths, Lies and Downright Stupidity: Get Out the Shovel - Why Everything You Know is Wrong",
        "Authors": "By Stossel, John",
        "Description": "&#149;   Singles have a better sex life than married people, right?  Wrong!  A University of Chicago study shows that married couples are having more sex--30% more--and better sex, than singles. But movies, TV shows, and other reporting about marriage never feature that fact.  &#149;   Do we have less free time than we used to? Countless news stories and anecdotes from friends and family make the overwhelming case that we're running ourselves ragged.  But when people actually keep track of their activities in a time diary, studies show that we have significantly more free time per day than in 1965.  So why is everyone out of time?&#149;   Surburban sprawl is ruining America. Huge subdivisions and massive highway construction is eating up our free space and affecting our quality of life. Isn't that what you always hear? So why do you never hear that 95% of America is undeveloped, or that so-called 'smart development' prices lower-income families out of property ownership?&#149;   Also:  Does shaving make your hair grow back thicker? Do girls feel more pressure to have sex than boys? Are gas prices really through the roof?  Is outsourcing bad for American workers?John Stossel takes on these and many more misconceptions, misunderstandings, and plain old stupidity in this collection that will offer much to love for old GIVE ME A BREAK fans, and show everyone why conventional wisdom--economic, political, or social--is wrong.",
        "Category": " Political Science , American Government , State",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "CliffsNotes on Twain's The Adventures of Tom Sawyer",
        "Authors": "By Thayer, Marion P. (EDT)",
        "Description": "Cliffs Test Preparation Guides help students prepare for and improve their performance on standardized tests ACT Preparation Guide CBEST Preparation Guide CLAST Preparation Guide ELM Review GMAT Preparation Guide GRE Preparation Guide LSAT Preparation Guide MAT Preparation Guide MATH Review for Standardized Tests MSAT Preparation Guide Memory Power for Exams Police Officer Examination Preparation Guide Police Sergeant Examination Preparation Guide Police Management Examinations Preparation Guide Postal Examinations Preparation Guide Praxis I: PPST Preparation Guide Praxis II: NTE Core Battery Preparation Guide SAT Preparation Guide SAT II Writing Preparation Guide TASP Preparation Guide TOEFL Preparation Guide with 2 cassettes Advanced Practice for the TOEFL with 2 cassettes Verbal Review for Standardized Tests Writing Proficiency Examinations You Can Pass the GED Cliffs Quick Reviews help students in introductory college courses or Advanced Placement classes Algebra I Algebra II Anatomy & Physiology Basic Math and Pre-Algebra Biology Calculus Chemistry Differential Equations Economics Geometry Linear Algebra Microbiology Physics Statistics Trigonometry Cliffs Advanced Placement Preparation Guides help high school students taking Advanced Placement courses to earn college credit AP Biology AP Calculus AB AP Chemistry AP English Language & Composition AP English Literature & Composition AP United States History Cliffs Complete Study Editions are comprehensive study guides with complete text, running commentary and glossary Chaucer's Prologue Chaucer's Wife of Bath Hamlet Julius Caesar King Henry IV, Part I King Lear Macbeth The Merchant of Venice Othello Romeo and Juliet The Tempest Twelfth Night See inside back cover for listing of Cliffs Notes titles Registered trademarks include: GRE, MSAT, the Praxis Series, and TOEFL (Educational Testing Service): AP, Advanced Placement Program, and SAT (College Entrance Examination Board); GMAT (Graduate Management Admission Council); and LSAT (Law School Admission Council.) The Adventures of Tom Sawyer",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1964"
        }
    },
    {
        "Title": "Julius Caesar Notes (Cliffs Notes)",
        "Authors": "By Cliffs Notes, Inc.",
        "Description": "",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1960"
        }
    },
    {
        "Title": "Selected Tales and Sketches (Penguin Classics)",
        "Authors": "By Hawthorne, Nathaniel and Colacurcio, Michael J.",
        "Description": "The short fiction of a writer who helped to shape the course of American literature. With a determined commitment to the history of his native land, Nathaniel Hawthorne revealed, more incisively than any writer of his generation, the nature of a distinctly American consciousness. The pieces collected here deal with essentially American matters: the Puritan past, the Indians, the Revolution. But Hawthorne was highly - often wickedly - unorthodox in his account of life in early America, and his precisely constructed plots quickly engage the reader's imagination. Written in the 1820s, 30s, and 40s, these works are informed by themes that reappear in Hawthorne's longer works: The Scarlet Letter, The House of the Seven Gables and The Blithedale Romance. And, as Michael J. Colacurcio points out in his excellent introduction, they are themes that are now deeply embedded in the American literary tradition.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "If... Questions for the Soul",
        "Authors": "By McFarlane, Evelyn and Saywell, James",
        "Description": "If you were God for a day, what would you do? If you had to remember the moment in your life when you felt the most alone, when would it be? If you were to name one event that most challenged your relationship with your family, what would you say? If your soul was a color, which color would it be? If you learned that there actually was a Heaven and Hell, what is the first thing you'd change in your life?        The ultimate task we face in life is the process of finding and accepting our true selves, our souls. It's often too scary, too overwhelming, or too time-consuming to begin the whole introspective process of self-discovery. So we often don't look. Instead, we do such things as work harder, spend money, eat and drink more, or maybe just clean the house. But what we forget--or maybe never knew--about soul-searching is that this process can be deeply rewarding, fun, and even entertaining.         In their bestselling series of If . . . books, If . . . (Questions for the Game of Life), If2 . . . (More Questions for the Game of Life), and If3 . . . (Questions for the Game of Love), authors Evelyn McFarlane and James Saywell have reintroduced the power of the question. These \"If . . . \" questions have served as icebreakers, after-dinner games, and a platform for intensifying relationships with one's friends, lovers, and self. Now, in If . . . : Questions for the Soul, they present a phenomenal collection of questions that will help you begin your soul search. These questions will inspire and challenge you and guide you to a deeper understanding of your soul.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "How Far Will You Go?: Questions to Test Your Limits",
        "Authors": "By McFarlane, Evelyn",
        "Description": "What is the strongest opinion you hold? What is the biggest lie you've ever told? What is the one thing you'd most like to change about the world? Who have you most feared in your life? What is the strongest craving you get? What have you lost that you would most like to retrieve? Where and when have you felt most uncomfortable being nude?        In , the bestselling authors of the If . . .  series  launch their signature format in a new direction: What and where are the limits that make each of us the personalities we are?        Five hundred thought-provoking questions, illustrated with compelling black-and-white photo-graphs, help you explore the world around you and relive your funniest, scariest, weirdest, greatest, and most indelible moments. Our answers to these queries reflect our priorities, define our limits, and probe the boundaries of who we truly are. Running the gamut from the worst boss to the most euphoric moment, these questions can help us discover more about ourselves, our friends, and our family members.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "For These Tough Times: Reaching Toward Heaven for Hope & Healing",
        "Authors": "By Lucado, Max",
        "Description": "When tragedy strikes, people desperately search for answers. Believers and unbelievers alike find themselves turning to God. Best-selling author and pastor Max Lucado points to the only real answer to tragedy and crisis: Prayer. In For These Tough Times, Lucado helps us understand how to pray despite our doubt and fear.",
        "Category": " Religion , Inspirational",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The elements of grammar: The essential guide to refining and improving grammar",
        "Authors": "By Shertzer, Margaret D.",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Fit Swimmer: 120 Workouts & Training Tips",
        "Authors": "By Brems, Marianne",
        "Description": "This book puts an end to the drudgery of merely counting laps by showing you how to create your own individual fitness program--and have fun doing it!  Learn how to:   Determine your own fitness level Choose an appropriate training program and build upon that program with a variety of innovative workouts Use a timing clock and interval training to increase your speed and endurance Use various training equipment, such as kick boards, hand paddles, and swimming fins to strengthen stroke technique Improve your cardiovascular fitness, muscle tone, and flexibility   Included for quick reference are tips for streamlining strokes, checklists for proper stroke execution, and a helpful glossary of training terms as well as a section on the joys and challenges of open water swimming.  \"I am constantly looking for new approaches which will do at least one of the following, and possibly all three:  give me a change from normal routine make me a faster swimmer challenge me to work harder  The Fit Swimmer addresses all these in an informative and entertaining way, making this book a valuable resource for all swimmers.\" -- James E. Counsilman Swimming Coach Indiana University  Marianne Brems is a Masters swimmer, coach of the San Mateo Master Marlins, author of Swim for Fitness and 101 Favorite Workouts, and a regular columnist for Swim Swim magazine.",
        "Category": " Sports & Recreation , Training",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Ten Apples Up On Top! (Bright & Early Board Books(TM))",
        "Authors": "By Seuss, Dr. and McKie, Roy (ILT)",
        "Description": "A lion, a dog, and a tiger are having a contest--can they get ten apples piled up on top of their heads? You better believe it! This first counting book works as a teaching tool as well as a funny story.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Walk with God",
        "Authors": "By Copeland, Gloria",
        "Description": "",
        "Category": " Religion , Christian Living , Spiritual Growth",
        "Publisher": "Kenneth Copeland Ministries",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Chicken Soup for the Christian Teenage Soul: Stories to Open the Hearts of Christian Teens (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Kirberger, Kimberly (COM), De Angelis, Barbara (COM), and Aubery, Patty (COM)",
        "Description": "For teens who make God an integral part of their lives, teens who are sorting through doubts about whether God really cares about them, and teens who don't know God at all, Chicken Soup for the Christian Teenage Soul may be one of the most influential books they'll ever read.These stories about love, friendship, forgiveness, making a difference, courage, dating (and lots more) show how God is at work in teenagers' lives. Teens share stories about how God has given them the courage to cope with the tough stuff, the joy to live a fulfilling life, the strength to persevere when they feel alone, and the love and confidence they need to feel good about themselves. This very special volume will also help them to use other teens' experiences to build a stronger relationship with God.For teens tempted to use drugs, alcohol or other substances, Chicken Soup for the Christian Teenage Soul can be a lifeline to God. They will know that God cares what they think when it feels as if no one else does, and that He loves them no matter what.",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "HCI Teens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Battle Cry of Freedom: The Civil War Era",
        "Authors": "By McPherson, James M.",
        "Description": "Covers the period of the Mexican War (1848) until the end of the Civil War in 1865, focusing in detail onthe military campaigns, including strategy and logistics, military leaders, and common soldiers",
        "Category": " History , Military , Wars & Conflicts (Other)",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The 12 Secrets of Highly Creative Women: A Portable Mentor",
        "Authors": "By McMeekin, Gail",
        "Description": "Revealing how women can break free of societal and psychological barriers, the author uses the examples of Shakti Gawain, Sarah Ban Breathnach, Cathleen Rountree, Chris Madden and other \"creatives\" to show how to overcome blocks to creativity. Original. 25,000 first printing.",
        "Category": " Self-help , Creativity",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Land of Promise (The Days of Laura Ingalls Wilder, Book 8)",
        "Authors": "By Tedrow, Thomas L.",
        "Description": "Laura and the other inhabitants of Mansfield, Missouri, face the problems of racism and a clash of cultures when Chinese immigrants try to settle in the pioneer community",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Killer Market",
        "Authors": "By Maron, Margaret",
        "Description": "A chilling misadventure begins when Deborah, hunting high and lowboy for lodging, is befriended by an eccentric old lady calling herself Mrs. Jernigan. Deborah follows the chiffon-clad Good Samaritan through rooms of French provincial and high-tech modern when the lady suddenly vanishes, leaving a sexy hunk of manhood dead and motionless on a pricey piece of \"motion\" furniture.Who is the mysterious Mrs. Jernigan and why is Deborah herself suspected of killing a furniture executive who specialized in making after-hours bedroom arrangements and cutthroat deals? To clear her name, Deborah has to table all other plans and investigate. But the knotty heart of this case is a secret well hidden behind a wall of silence about a woman's past. It will take all Deborah's courtroom experience and intuitive skills to strip through layers of deception to solve a whodunit that is strictly top-shelf...",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Love First: A New Approach to Intervention for Alcoholism & Drug Addiction (Hezelden Guidebook)",
        "Authors": "By Jay, Jeff and Jay, Debra",
        "Description": "If alcoholics and addicts won't accept help until they're ready, what gets them ready? This book provides an answer in clear, concise terms. Dispelling two damaging myths -- that an addict has to hit bottom and that intervention must be confrontational -- the authors' proven approach puts love first and shows families, step by step, what to do next.    \"A convincing new approach to intervention that puts love and respect first.\"  Jack Canfield, coauthor of Chicken Soup for the Soul Series    \"Building a team, choosing a chairperson, anticipating objections, using checklists, and rehearsing for the intervention itself -- the reader will find it all here!\"  Robert M. Morse, M.D., Professor emeritus, psychiatry, Mayo Medical School and Former director of Addictive Disorders Services, Mayo Clinic.    \"Love First is destined to become the new classic on intervention for alcoholism and drug addiction. The most comprehensive book available on the life-saving technique of intervention, Love First will save lives! A worthy successor to Vernon Johnson¿s I¿ll Quit Tomorrow.\"  --Kathy Ketcham, Coauthor, Beyond the Influence and The Spirituality of Imperfection    \"Love First provides the most detailed account yet of how intervention works. A significant contribution to intervention literature. An empowering antidote to the disease of addiction.\"  --William l. White, author Slaying the Dragon: The History of Addiction Treatment",
        "Category": " Self-help , Substance Abuse & Addictions , Alcoholism",
        "Publisher": "Hazelden",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "I Remember America",
        "Authors": "By Sloane, Eric",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1977"
        }
    },
    {
        "Title": "The Reach for Empire (The Third Reich)",
        "Authors": "By Time Life",
        "Description": "Recounts how Nazi Germany gained control of Austria, Czechoslovakia, and Poland",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Something Good (Munsch for Kids)",
        "Authors": "By Munsch, Robert N. and Martchenko, Michael (ILT)",
        "Description": "?Something good' is exactly what Tyya, Andrew and Julie want to put into their shopping cart. Tyya's dad won't buy anything good at the store?no ice cream, no candy, no cookies. But when the saleslady puts a price sticker on Tyya's nose, Daddy is finally forced to buy something good.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Annick Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Vegetarian Recipes (Cooking for Today)",
        "Authors": "By McConnell, Shelli (EDT)",
        "Description": "Information on preparing vegetarian dishes is accompanied by recipes for meatless entrees, soups, salads, and sandwiches, some of which contain eggs or dairy products",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The God Makers",
        "Authors": "By Decker, Ed",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "12.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Poems That Stir the Heart",
        "Authors": "By Lawrence, Mary Sanford (EDT)",
        "Description": "The classic poems of Joyce Kilmer, Emily Dickinson, and John Donne are represented in a collection of poetry that expresses love, friendship, faith, and inspiration",
        "Category": " Poetry , General",
        "Publisher": "A & W Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "Black Beauty (Book and Charm)",
        "Authors": "By Sewell, Anna",
        "Description": "A horse in nineteenth-century England recounts his experiences with both good and bad masters.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Jeffrey Gitomer's Little Green Book of Getting Your Way: How to Speak, Write, Present, Persuade, Influence, and Sell Your Point of View to Others",
        "Authors": "By Gitomer, Jeffrey",
        "Description": "Following in the bestselling footsteps of Little Red Book of Selling, Little Red Book of Sales Answers, Little Black Book of Connections, and The Little Gold Book of YES! Attitude, Jeffrey Gitomer's The Little Green Book of Getting Your Way digs deep into the 9.5 elements that make persuasion, and getting your way, happen. By breaking down the elements, the reader will begin to understand, take action, become proficient, and then master the ability to persuade. Because persuasion occurs in so many different areas of life and business, Gitomer leads the reader from mental readiness to the principles of getting your way and the power that persuasion offers. He challenges the reader to prepare before they present, to prepare before they try to persuade. He demonstrates how to change a presentation into a performance and shows how this can be done in any environment. But because persuasion most often takes place in business, he draws special emphasis to the reader's ability to write and sell persuasively. The book talks about the persistence that enables winning persuasion. He brings the Benjamin Franklin quote \"If at first you don't succeed, try, try again\" to the Gitomer level of \"You only fail when you decide to quit,\" and the book ends challenging the reader how to think about excellence and eloquence. It will be up to the reader to take advantage of the opportunity and harness the power.",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "Financial Times Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Recipes for the Pressure Cooker (Nitty Gritty Cookbooks)",
        "Authors": "By White, Joanna",
        "Description": "",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Nitty Gritty Productions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Onward Christian Soldiers?: The Religious Right In American Politics (Dilemmas in American Politics)",
        "Authors": "By Wilcox, Clyde",
        "Description": "They have money, influence, power—and they turn out to vote. They are credited with delivering a significant part of the Republicans’ stunning 1994 electoral success, foreshadowed their status as major players in the elections of 1996.“They” are groups like the Moral Majority, the Christian Coalition, and the religious right. But are they the greatest threat to liberty since Hitler or the last defenders of religious freedom and family values in America? In this book Clyde Wilcox tells us who they are, what their history has been in twentieth-century American politics, and how they might organize themselves for future political effectiveness. He tackles the sticky political dilemma of the proper role of religious groups in American politics and government while showing how the contemporary religious right does—and does not—fit into that context.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Westview Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Inside Delta Force: The Story of America's Elite Counterterrorist Unit",
        "Authors": "By Haney, Eric L.",
        "Description": "Now the inspiration for the CBS Television drama, \"The Unit.\" Delta Force. They  are the U.S. Army's most elite top-secret strike force. They dominate the modern  battlefield, but you won't hear about their heroics on CNN. No headlines can reveal  their top-secret missions, and no book has ever taken readers inside—until now. Here,  a founding member of Delta Force takes us behind the veil of secrecy and into the  action-to reveal the never-before-told story of 1st Special Forces Operational Detachment-D  (Delta Force). He is a master of espionage, trained to take on hijackers, terrorists, hostage  takers, and enemy armies. He can deploy by parachute or arrive by commercial aircraft.  Survive alone in hostile cities. Speak foreign languages fluently. Strike at enemy  targets with stunning swiftness and extraordinary teamwork. He is the ultimate modern  warrior: the Delta Force Operator. In this dramatic behind-the-scenes chronicle,  Eric Haney, one of the founding members of Delta Force, takes us inside this legendary  counterterrorist unit. Here, for the first time, are details of the grueling selection  process—designed to break the strongest of men—that singles out the best of the best:  the Delta Force Operator. With heart-stopping immediacy, Haney tells what it's really  like to enter a hostage-held airplane. And from his days in Beirut, Haney tells an  unforgettable tale of bodyguards and bombs, of a day-to-day life of madness and beauty,  and of how he and a teammate are called on to kill two gunmen targeting U.S. Marines  at the Beirut airport. As part of the team sent to rescue American hostages in Tehran,  Haney offers a first-person description of that failed mission that is a chilling,  compelling account of a bold maneuver undone by chance—and a few fatal mistakes. From fighting guerrilla warfare in Honduras to rescuing missionaries in Sudan and  leading the way onto the island of Grenada, Eric Haney captures the daring and discipline  that distinguish the men of Delta Force. Inside Delta Force brings honor to these  singular men while it puts us in the middle of action that is sudden, frightening,  and nonstop around the world.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Delta",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Compass American Guides : Arizona",
        "Authors": "By Cheek, Lawrence W.",
        "Description": "Created by local writers and photographers, Compass American Guides are the ultimate insider's guides, providing in-depth coverage of the history, culture and character of America's most spectacular destinations. Covering everything there is to see and do as well as choice lodging and dining, these gorgeous full-color guides are perfect for new and longtime residents as well as vacationers who want a deep understanding of the region they're visiting.Outstanding color photography, plus a wealth of archival imagesTopical essays and literary extractsDetailed color mapsGreat ideas for things to see and doCapsule reviews of hotels and restaurants",
        "Category": " Travel , United States , West , Mountain (AZ, CO, ID, MT, NM, NV, UT, WY)",
        "Publisher": "Compass America Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Journey to Jerusalem",
        "Authors": "By grace halsell",
        "Description": "",
        "Category": "",
        "Publisher": "The MacMillan Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Fragile Peace 1919-39 (The Eventful 20th Century)",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "A lively chronicle of world history between the two world wars examines the political, economic, social, and cultural factors that transformed the world; assesses the influence of such pivotal events as the Great Depression; analyzes innovations in the world of art and music; and explores the growth of new forms of popular entertainment.",
        "Category": " History , Military , General",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Mother Teresa: Her Essential Wisdom",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Summer of Naked Swim Parties: A Novel (P.S.)",
        "Authors": "By Blau, Jessica Anya",
        "Description": "Fourteen-year-old Jamie will never forget the summer of 1976. It's the summer when she has her first boyfriend, cute surfer Flip Jenkins; it's the summer when her two best friends get serious about sex, cigarettes, and tanning; it's the summer when her parents throw, yes, naked swim parties, leaving Jamie flushed with embarrassment. And it's the summer that forever changes the way Jamie sees the things that matter: family, friendship, love, and herself.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Looking At...Stegosaurus: A Dinosaur from the Jurassic Period (The New Dinosaur Collection)",
        "Authors": "By Amery, Heather and Gibbons, Tony (ILT)",
        "Description": "Describes the physical characteristics and probable behavior of this peaceful giant of the Jurassic.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Gareth Stevens Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Mrs. Jeepers In Outer Space (The Adventures Of The Bailey School Kids)",
        "Authors": "By Dadey, Debbie, Jones, Marcia Thornton, and Gurney, John Steven (ILT)",
        "Description": "Excited about their week away at space camp, the Bailey School kids are shocked to learn that their vampire teacher is coming along with them as well. Original.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "142.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "No Other Life",
        "Authors": "By Moore, Brian",
        "Description": "Father Paul Michel, a Canadian missionary on the desperately poor Caribbean island of Ganae, rescues a black child from abject poverty and sets him on a road toward a dramatic and dangerous future as a revolutionary Catholic priest and, later, as the first democratically elected leader in a land of dictators and despair.Jeannot, as Father Paul calls him, is young and brilliant, a messianic orator, who bravely urges his black brethren to rise against their oppressors. His actions alarm the Vatican in Rome, and make deadly enemies of the cynical Ganaean bishops, the light-skinned elite, and the ruling military junta.Even Father Paul, who tells this story, is unsure of Jeannot's true motives. His enemies will stop at nothing - assassination, arson, brutal repression - to destroy him.",
        "Category": " Fiction , General",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "On Life after Death",
        "Authors": "By Kubler-Ross, Elisabeth",
        "Description": "In this collection of inspirational essays, internationally known author Dr. Elisabeth K?Ç¬?bler-Ross draws on her in-depth research of more than 20,000 people who had near-death experiences, revealing the afterlife as a return to wholeness of spirit. With frank and compassionate advice for those dealing with terminal illness or the death of a loved one, ON LIFE AFTER DEATH offers a compelling message of hope to the living, so that they may grow stronger from tragedy and live life to the fullest. The classic collection of essays on death, dying, and the afterlife, by Dr. Elisabeth K?Ç¬?bler-Ross. Features a new foreword by Caroline Myss. Previous edition sold more than 200,000 copies. Reviews \"I am so grateful that I was given the opportunity to review such ground-breaking material on death and dying. This 85 page gem has made a huge difference in my life. This world renowned author will always be remembered for her clear and accurate account of the 5 stage dying process, and the impact her work has had will echo through the corridors of time. There are many excellent books out on the subject of near death experiences, and life after death experiences, but I had always been curious as I got older what the process of shedding my body suit was all about. Just about the time I thought I would even start looking for a book on the topic I would get a funny feeling in the pit of my stomach and decide maybe it wasn't a good idea after all. I would recommend this gentle honest helper to anyone who has a true desire to learn the many facet of such a natural part of life.\"-Riki Frahmann www.mysticlivingtoday.com",
        "Category": " Religion , Spirituality",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Illustrated Dictionary and Concordance of the Bible",
        "Authors": "By",
        "Description": "A single-volume Bible desk reference, based on the King James edition, features an alphabetical listing of important words with cross-referencing, illustrations, definitions of 3,500 biblical names, and more.",
        "Category": " Religion , General",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "11.55",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Basic Book of Sea Kayaking",
        "Authors": "By Hutchinson, Derek C.",
        "Description": "This concise introductory handbook is packed with expert advice and contains all the essential information a novice needs to hit the water while providing a quick reference for the more experienced paddler.",
        "Category": " Sports & Recreation , Kayaking",
        "Publisher": "Globe Pequot Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Best American Recipes 2001-2002",
        "Authors": "By McCullough, Fran (EDT) and Samuelsson, Marcus (FRW)",
        "Description": "The Best American Recipes has rapidly gained respect as the most discriminating, inspiring, and genuinely useful collection available ? truly the year’s best. This volume ranges further afield than ever, and with glorious results. Series editor Fran McCullough turns to a health insurance newsletter for a versatile side dish, to a women’s magazine for a family supper, to a travel Web site for a spectacular brunch, and to all the leading cookbooks and magazines.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Master the Media to Attract Your Ideal Clients: A Personal Marketing System for Financial Professionals",
        "Authors": "By Kinney, Derrick",
        "Description": "Praise for Master the Media to Attract Your Ideal Clients\"This book is a marketing masterpiece. It should be required reading for all financial professionals.\"-Janine Wertheim, Chief Marketing Officer Securities America, Inc.\"Marketing is the lifeblood of any practice. The media is the most effective and cost-efficient way to market. Unfortunately, most practitioners only dream of media attention. No more-Derrick Kinney delivers on his promise to help you 'master the media.'\"-Harold Evensky, CFP author, Wealth Management\"This fast-moving, practical book gives you a step-by-step process to multiply your results and dramatically increase your exposure and name recognition. A classic!\"-Brian Tracy, President, Brian Tracy International author, Create Your Own Future\"Kinney offers an easy and effective 'how-to' approach for financial producers to gain recognition and credibility by becoming media sources. If you want to take your business to the next level, this book can help you get there.\"-Gail S. Waisanen, CLU, Editor, Life Insurance Selling\"Derrick Kinney has built an effective marketing system that every advisor can use to help grow their business and attract more profitable clients.\"-John J. Bowen Jr., CEO, CEG Worldwide, LLC columnist for Financial Planning",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Desire of Ages..",
        "Authors": "By Ellen G. White",
        "Description": "",
        "Category": "",
        "Publisher": "Pacific Press Publishing Association",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1898"
        }
    },
    {
        "Title": "Science Fiction Emphasis 1",
        "Authors": "By Michael Bishop, Felix Gotschalk",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "April",
            "Year": "1974"
        }
    },
    {
        "Title": "Mollie Katzen's Vegetable Heaven: Over 200 Recipes for Uncommon Soups, Tasty Bites, Side Dishes, and Too Many Desserts",
        "Authors": "By Katzen, Mollie and Katzen, Mollie (ILT)",
        "Description": "Including more than twenty-five of the author's own paintings to illustrate her love of vegetables, this cookbook explores the possibilities for all courses of a meal in such recipes as Giant Mushroom Popovers, Jamaican Salsa-Salad, and Cherry Upside-Down Gingerbread. TV tie-in. 200,000 first printing. $250,000 ad/promo.",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "On Writing the College Application Essay: The Key to Acceptance and the College of your Choice",
        "Authors": "By Bauld, Harry",
        "Description": "Vital information for every college applicant. A former Ivy League admissions officer provides tough and funny advice on coming up with the best essay possible.",
        "Category": " Study Aids , General",
        "Publisher": "Collins Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Deep-Sea Tales: 6 Salty Sea Stories (SpongeBob SquarePants)",
        "Authors": "By O'Hare, Mark (ILT), Collins, Terry (EDT), Auerbach, Annie (EDT), and Banks, Steven (EDT)",
        "Description": "Ahoy, mateys!  Here are six absolutely absorbing stories about SpongeBob and all his friends in Bikini Bottom that are sure to tickle your nautical funnybone.  Included in this collection are:  Tea at the Treedome Naughty Nautical Neighbors Hall Monitor The World's Greatest Valentine SpongeBob Superstar Sandy's Rocket",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Kids Love Pennsylvania: A Parent's Guide to Exploring Fun Places in Pennsylvania With Children... Year Rould!",
        "Authors": "By Zavatsky, George and Zavatsky, Michele",
        "Description": "",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Kids Love Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Self Esteem the Power to Be Your Best",
        "Authors": "By Press, National",
        "Description": "",
        "Category": "",
        "Publisher": "National Press Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Real Food for Cats: 50 Vet-Approved Recipes to Please the Feline Gastronome",
        "Authors": "By Delmonte, Patti",
        "Description": "Kitties deserve to dine in style, too! This collection of 50 simple, veterinarian-approved recipes will have your cat rubbing your ankles faster than you can say “can opener.” Each easy-to-make meal is nutritionally balanced and emphasizes all-natural ingredients; a few are even designed to satisfy both the cats and the people in your household. Patti Delmonte considers any individual needs or dietary restrictions your furry friend might have, including diabetes and impaired kidney function. Keep your cat healthy and happy with delicious gourmet meals.",
        "Category": " Pets , Cats , General",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Tooth and Claw...and Other Stories",
        "Authors": "By Boyle, T. Coraghessan",
        "Description": "Since his first collection of stories, Descent of Man, appeared in 1979, T.C. Boyle has become an acknowledged master of the form who has transformed the nature of short fiction in our time. Among the fourteen tales in his seventh collection are the comic yet lyrical title story, in which a young man wins a vicious African cat in a bar bet; \"Dogology,\" about a suburban woman losing her identity to a pack of strays; and \"The Kind Assassin,\" which explores the consequences of a radio shock jock's quest to set a world record for sleeplessness. Muscular, provocative, and blurring the boundaries between humans and nature, the funny and the shocking, Tooth and Claw is Boyle at his best.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Return to the Gingerbread Inn",
        "Authors": "By Behringer, Betty Stewart",
        "Description": "",
        "Category": "",
        "Publisher": "Chestnut HIlls Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Book of Myself: A Do-It-Yourself Autobiography in 201 Questions",
        "Authors": "By Marshall, David and Marshall, Carl",
        "Description": "With one hundred amusing and charming prompts, such as \"The sweetest thing he said to me on our first date was,\" this gift book provides a record of romance for couples of all ages, from first date to honeymoon. 25,000 first printing.",
        "Category": " Self-help , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Painting Secrets: Tips & Tricks from the Nation's Favorite Painting Expert",
        "Authors": "By Schrock, Denny (EDT) and Santos, Brian",
        "Description": "Brian brings a bright new perspective to the principles of color, helping consumers make confident decisions. Unlike other paint books, the process of painting is emphasized. Clever \"\"Wall Wizard\"\" tips make painting simple and fun. For example, mix 1 gallon of warm water and 1/2 cup of fabric softener to clean brushes in 10 seconds. Decorative techniques for ragging, sponging, glazing, and using unusual tools for designer effects. Detailed coverage of tools and supplies, including varnishes, stains, and glazes.",
        "Category": " House & Home , Decorating",
        "Publisher": "Wiley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Beyond ADD: Hunting for Reasons in the Past and Present",
        "Authors": "By Hartmann, Thom",
        "Description": "A researcher of Attention Deficit Disorder explores the range of behavior covered by the disorder, its possible link to genetics and evolution, and challenges faced by its sufferers, especially gifted children. Simultaneous. 35,000 first printing. IP.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Underwood Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "FLOOD Pennsylvania - 1972 Collector's Edition",
        "Authors": "By Hoffman, Ed, Bryson Leidich, And Bill Martin (Photographs) and Jim Fulbright",
        "Description": "",
        "Category": "",
        "Publisher": "Timothy E. Euker and David Berner/TV Host",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "'Pass It On': The Story of Bill Wilson and How the A. A. Message Reached the World",
        "Authors": "By Alcoholics Anonymous",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Alcoholics Anonymous World Serv inc",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    }
]