[
    {
        "Title": "Home Fires: An Intimate Portrait of One Middle-Class Family in Postwar America",
        "Authors": "By Katz, Donald R.",
        "Description": "An account of one family's experiences in postwar America chronicles their cultural transformation through a flight to suburbia, materialism, and the sixties counterculture, describing where they are today. 50,000 first printing. $75,000 ad/promo.",
        "Category": " Social Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Supernatural Horizons from Glory to Glory",
        "Authors": "By hunter, charles and Hunter, Frances",
        "Description": "",
        "Category": "",
        "Publisher": "Hunter Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Totally U.S.",
        "Authors": "By Bond, Simon",
        "Description": "",
        "Category": "",
        "Publisher": "Salem House Publishers",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Favorite Brand Name Recipe Cookbook Reference Series",
        "Authors": "By Publications International",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "China Men",
        "Authors": "By Kingston, Maxine Hong",
        "Description": "",
        "Category": " History , Asia , China",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1980"
        }
    },
    {
        "Title": "BLUNDERING INTO DIASTER",
        "Authors": "By McNamara, Robert S.",
        "Description": "Discusses the dangers of the arms race and argues that a build-up of conventional weapons would provide greater security",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "You Wouldn't Believe What My Grandchild Did...",
        "Authors": "By Wyse, Lois",
        "Description": "A popular observer of today's energetic and demanding grandparenting offers a hilarious collection of wit, wisdom, anecdotes, lessons, and truths that capture the delights and hazards of a special time of life. 125,000 first printing. $125,000 ad/promo. Tour.",
        "Category": " Humor , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Silverhand (The Arcana, Book 1)",
        "Authors": "By Llywelyn, Morgan and Scott, Michael",
        "Description": "Chronicles the life of Silverhand, a man who has been destined to save a stricken world from the evil forces of Chaos and rebuild his people's home to the level of glory that survives only in their hearts and memories.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Pure & simple: Delicious recipes for additive-free cooking : an elegant & easy cookbook with up-to-date advice on avoiding ingredients that contain chemicals & preservatives",
        "Authors": "By Burros, Marian Fox",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Hunter's Moon",
        "Authors": "By Robards, Karen",
        "Description": "A young woman, who supports her younger siblings by grooming horses in a Louisville stable, joins forces with an FBI agent who has come to the area to investigate a racehorse-fixing scheme, and together they find both deadly danger and a mutual attraction. 75,000 first printing. $75,000 ad/promo.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Jian",
        "Authors": "By Lustbader, Eric",
        "Description": "\"Brilliant...Perhaps no other piece of fiction since SHOGUN illuminates the mind, machinations, and mores of Eastern peoles with the style and intensity of JIAN.\"THE MIAMI HERALDJake Maroc is the top agent for the Quarry, the secretive government agency. Nichiren, Jake's sworn enemy, is a cold killer with a deadly secret. Shi Zilin is a wily Communist minister, a survivor of eras in turmoil. Which one of them will emerge the true Jian--the consummate warrior, the man who excels, the supreme master of the arts of love and combat, strength and wisdom?Four ancient pieces of jade are the key to unlocking the grand scheme of the Jian. The price is Hong Kong--glittering jewel that sets the KGB, the Communist Chinese, and the Americans in a deadly battle.From the Paperback edition.",
        "Category": " Fiction , General",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "58.61",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "Three Blind Mice: How the TV Networks Lost Their Way",
        "Authors": "By Auletta, Ken",
        "Description": "Discusses the changing environment of modern communications media and how the American television networks have coped with the change",
        "Category": " Performing Arts , Television , History & Criticism",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Signs Of Life: The Language and Meaning of DNA",
        "Authors": "By Pollack, Robert",
        "Description": "The genetic age is upon us, yet most people have only a limited understanding of the wondrous chemical that encodes the formula for all living things. As DNA's secrets are revealed, they must be rescued from the obscuring language of science, and now Signs of Life does just that. Borrowing from the humanities, Robert Pollack offers an entirely fresh perspective: DNA, he argues, should be seen as a great work of natural literature, a three-billion-year-old, continuously evolving text.An award-winning scientist and teacher, Pollack displays both a sophisticated understanding of biology and a remarkable gift for metaphor. In elegant prose, he shows precisely how DNA provides the instruction book for life. He takes us deep inside a living cell - a teeming walled city - and explains how the genetic script at its heart governs all its operations. He opens the book containing the human genome and lucidly reveals the process by which biologists and physicians have begun to read its words and sentences.But the frontier of genetics now extends into troubling territory. Pollack identifies several areas of concern: the ambitious but flawed Human Genome Project, the widespread access to individual genetic data, the temptation to manipulate genetic codes to make them \"better.\" Given our still-crude ability to interpret these living texts, our eagerness to rewrite them is alarming. The power to change the human genome brings with it enormous responsibilities, and Pollack offers persuasive evidence that if we fail to achieve a fuller understanding of the multiple meanings of DNA, we risk disaster.Signs of Life is both a brilliant illumination of a biological text and a provocative meditation on our awesome new ability to alter it. With the grace of a born writer and teacher, Robert Pollack has written a book that will change the way people think about science, genetics, and the future of our species.",
        "Category": " Science , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Hoop Roots",
        "Authors": "By Wideman, John Edgar",
        "Description": "Hoop Roots is John Edgar Wideman’s memoir of discovering the game that has been his singular passion for nearly fifty years. It is equally, inevitably, the story of the roots of black basketball in America ? a story inextricable from race, culture, love, and home.   As a boy, Wideman lived in his grandparents’ worn but welcoming home in the ghettoized Homewood section of Pittsburgh. It was a world presided over by women, forever coddling, scolding, protective. One day John slipped away from their watchful gaze and escaped to a place where white factory workers shot hoops on their breaks. Then someone handed him a ball. That thrilling first shot was a turning point. Later he sneaked from his dying grandmother’s bedside to the courts where other black boys gathered. Here he really learned the game ? the African-American game, whose style and power would change him and our culture.   With Du Bois’s The Souls of Black Folk as his model, Wideman combines memoir with history, folklore, and commentary to create a magical evocation of his unique slice of American experience. He imagines the Harlem Globetrotters in 1927, on their way to the Illinois town where the only black resident will be lynched. A playground game in Greenwich Village conjures Larry Bird, Magic Johnson, and the sources of black minstrelsy. African-American language, culture, music, and sport brilliantly interweave in a lyrical narrative that glides from nostalgic to outraged, from scholarly to streetwise, from defiant to celebratory.   Like his previous memoirs, Wideman’s Hoop Roots is both deeply personal and fiercely resonant.",
        "Category": " Biography & Autobiography , Cultural Heritage",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Boiling Point: Democrats, Republicans, and the Decline of Middle-Class Prosperity",
        "Authors": "By Phillips, Kevin P.",
        "Description": "In the election of 1992, support for George Bush plunged to a level below Herbert Hoover's in 1932 as many middle-class suburbs voted Democratic and Ross Perot surged. In this book, Kevin Phillips shows how this populist explosion revealed a powerful new political force: widespread frustration over the decline of middle-class prosperity and the threat to the American dream.Teenage homelessness in the Chicago suburbs ... crumpled home values in Southern California ... the worst job market for college graduates in New York City since the Great Depression: It all added up to the sharpest economic decline in decades, provoking political unrest unequaled in sixty years. There had been declines before, but no previous postwar downturn so damaged the white middle class as a whole or raised such fears that Americans might lose the unique economic privileges that they have enjoyed since World War II. Boiling Point shows in dismaying detail what has happened to the middle class since the 1970s in disposable income, earnings, home values, job prospects, public services, assets and net worth, pension safety and health insurance, and the next generation's prospects of enjoying the same rising living standards and upward mobility as its parents had. And it was not a natural result of adverse global trends but of deliberate political choices.In the Reagan-Bush years American leaders who had once spoken up for the average family were celebrating investors, speculators, and the rich, shifting the burden of taxes from the wealthy to the middle class while starving public services and disregarding the growing debt that would punish future generations.The populist anger so vivid in 1992 is not a onetime phenomenon. It will persist, Phillips says, until the middle class resumes the road to prosperity under government policies that it considers fair. It is on this that the politics of the 1990s now depends.",
        "Category": " Social Science , General",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Needlework: Blocking and Finishing.",
        "Authors": "By Burchette, Dorothy.",
        "Description": "Complete illustrated instructions are given for finishing pieces of needlepoint, crewel, and embroidery in a simple and attractive manner",
        "Category": " Art , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1974"
        }
    },
    {
        "Title": "Out of the Blackout",
        "Authors": "By Barnard, Robert",
        "Description": "With the Nazis bombing London on a nightly basis, many families sent their children to the comparative safety of the countryside. When the Blitz ended, the families came for their kids, but no one ever came for Simon Thorn. His name appears on no evacuation list, and none of his belongings offer any clues to his origins. Now an adult, Simon is puzzled by an odd sense of familiarity when he walks down certain London streets. He remembers years of screaming nightmares that would terrify his bewildered foster parents. And he resolves to find out where he originally came from, even as everything he uncovers suggests that, really, he doesn’t want to know.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Mid-life: Notes From The Halfway Mark",
        "Authors": "By Kaye, Elizabeth",
        "Description": "In this stunning literary debut, Elizabeth Kaye offers her wry, sometimes biting perspective on entering mid-life. She observes that baby boomers, once convinced that no one over thirty could be trusted, are now entering a stage \"at which the essential question shifts from how much you can expect to how much you can endure.\" In Mid-life, she finally comes to terms with all the fullness of life and loss at the mid-point: love affairs, friendship, family, marriage, divorce, illnesses, death - and hope.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "His and Hers: The Fantasy World of the Neiman-Marcus Catalog",
        "Authors": "By Marcus, Stanley",
        "Description": "Traces the history of the Texas mail-order firm, shows highlights from each of its catalogs, and recounts which extravagant gifts sold well and which did not",
        "Category": " Business & Economics , General",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "How to Help Your Child Survive in Public School",
        "Authors": "By Schimmels, Cliff",
        "Description": "Examines the inner workings of the public-school system and discusses how to approach teachers with valid concerns and how to evaluate and cooperate with teachers",
        "Category": " Education , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Nobody Cared for Kate",
        "Authors": "By Thompson, Gene",
        "Description": "Seven members of a back-biting, glamourous Hollywood family are aboard a luxury canal barge in the south of France, one is a killer, and San Francisco attorney Dade Cooley must unravel a web of mystery",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Random House Inc (T)",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "New York Times Crossword Puzzle Dictionary",
        "Authors": "By Tom Pulliam~Clare Grundman",
        "Description": "",
        "Category": "",
        "Publisher": "New York : Times Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "The Smithsonian Book of Invention",
        "Authors": "By And Co Simonson~Smithsonian~Smithsonian Institutio",
        "Description": "Chronicles inventive artifacts and systems as related to technology, science and industry and analyzes the inventive spirit and process and its impact upon human civilization with future projections",
        "Category": " Technology & Engineering , General",
        "Publisher": "Smithsonian Exposition Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Screen World Vol. 39 1988",
        "Authors": "By Willis, John",
        "Description": "",
        "Category": " Performing Arts , Film , Reference",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Lord, I Need a Miracle",
        "Authors": "By Hinn, Benny",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Wheel Excitement: Revised And Updated/the Official Rollerblade(r) Guide To In-Line Skating",
        "Authors": "By Feineman, Neil",
        "Description": "Discusses the equipment and techniques of this type of roller skating, including conditioning, stunts, racing, and hockey",
        "Category": " Sports & Recreation , Roller & In-Line Skating",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "New Deal",
        "Authors": "By Conkin, Paul Keith",
        "Description": "",
        "Category": " History , United States , 20th Century",
        "Publisher": "Harlan Davidson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "I'd Kill For a Cookie: A Simple Six-Week Plan to Conquer Stress Eating",
        "Authors": "By Mitchell, Susan and Christie, Catherine, Ph.D.",
        "Description": "Is it a coincidence that desserts spelled backward is stressed? Maybe so, yet two of every three people react to the daily stressors in life by craving sweets or salt, bingeing, overeating, or, in some cases, not eating at all. This groundbreaking book, written by two prominent nutritionists, offers a simple plan that stops stress eating in its tracks. The innovative, easy-to-understand EAT (Energy-Action Team) Plan consists of six exciting \"stress-less\" strategies that teach you how to identify the stressors in your life and the corresponding reactions, and how to incorporate appropriate new behaviors into any kind of lifestyle. Planning strategies and time-management tips help you increase your daily energy levels and personal productivity while easing stress and avoiding the temptation to indulge.Questionnaires, checklists, goal plans, shopping schedules, stress-and-eating diaries, and self-tests to determine individual responses to different types of food all make I'd Kill for a Cookie a highly individualized and adaptable program that is supported by a collection of innovative recipes for quick, nutritious, and tasty meals.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Invisible Web: Gender Patterns in Family Relationships",
        "Authors": "By Walters, Marianne and Carter, Betty (CON)",
        "Description": "Bringing new focus to the subject, THE INVISIBLE WEB investigates the family from a feminist perspective. Using the lens of gender, connections between mothers and daughters, fathers and daughters, mothers and sons, and husbands and wives are analyzed and given new meaning. The authors evaluate and redefine family transitions such as divorce, single-parent and female-headed households, and remarried couples who are attempting to integrate their respective children with ex-spouses and complicated networks of extended kin. They also reexamine traditional and emerging roles for women in their early, middle, and later years. Written in an engaging format, each chapter features an in depth analysis of how gender shapes the relationship in question. This discussion is followed by fascinating vignettes of actual cases from each of the four authors, whose approaches reflect different orientations to therapy.",
        "Category": " Psychology , Psychotherapy , Couples & Family",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Sharkproof: Get the Job You Want, Keep the Job You Love...in Today's Frenzied Job Market",
        "Authors": "By MacKay, Harvey",
        "Description": "In his New York Times #1 bestselling book Swim with the Sharks Without Being Eaten Alive, Harvey Mackay told you how to outsell, outmanage, outmotivate, and outnegotiate your competition. In his second New York Times #1 bestseller, Beware the Naked Man Who Offers You His Shirt, he told you how to do what you love, love what you do, and deliver more than you promise. In Sharkproof, Harvey now shows you how to get the job you want and keep the job you love in today's frenzied and difficult job market. Sharkproof is filled with the colorful, practical, positive business advice that has become the Mackay hallmark.Striving to Get the Job You Want? Whether you find yourself starting out or starting over, Harvey will help you. You'll learn that getting a job is a job - ten surefire suggestions that will work to get your networking working; how to keep your head after you get the ax; how Lee Iacocca, Sally Jessy Raphael, and Luciano Pavarotti were fired and all went on to do their best work ever; how to use your head to get your foot in the door and give the interviewers the answers they want to hear; and what interviewers really want to know about you.Trying to Keep the Job You Love? Harvey's street-smart secrets will teach you to turn the troubles that plague your job into career opportunities; to make yourself indispensable to your boss; and to survive the downsize and start to upsize...by asking for a raise.Worried About Today's Frenzied Job Market? Only Harvey Mackay has the unique advice to guide you through a job market where only 2 percent of job hunters find new positions by sending unsolicited resumes; and terms like downsizing, destaffing, negotiated departure, and redundancy elimination have become real and terrifying to many thousands of people.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Long Live the King",
        "Authors": "By Rowe, John",
        "Description": "Fun-loving Prince George finds himself reigning monarch of Britain after the abdication of his ailing mother and the death of his older brother Richard in an IRA terrorist attack on Westminster Abbey during his coronation",
        "Category": "",
        "Publisher": "Stein & Day Pub",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "A Lover's Almanac",
        "Authors": "By Howard, Maureen",
        "Description": "Braving the mysteries of the heart's desire, Maureen Howard renders the heady madness of a first kiss while plumbing history, art, genetics, and astronomy to explore the inevitable morning-after question: Why do two people fall in love?The exhilarating flights and emotional depth of Howard's storytelling balance the fates of two young lovers in New York: Artie, a bastard, perhaps \"begot in the mud of Woodstock,\" now a boyish computer wizard; and Louise, a hot new painter out of the Midwest, seriously committed to her art. Their romance, seemingly shattered on the eve of the millennium, is played out against the tale of two old lovers lost to each other for a half century. These intertwined lives gather history and time itself into a narrative of intelligence and wit, where truth surfaces - as it will - both to wound and to heal. Woven into the stories of these young and old lovers are glimpses of the New York art scene and the uneasy cohabitation of art and technology. In seamless entries on the exploits of formative geniuses, from Ben Franklin to Robert Oppenheimer, the novel also brings the desire for progress into perspective with the limited dreams of private life.",
        "Category": " Fiction , Literary",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Know Your Rights: And How to Make Them Work for You",
        "Authors": "By Reader's Digest Association (COR)",
        "Description": "Know Your Rights Tells you what you're entitled to and shows you how to demand it. Covering hundreds of situations that you may encounter, it demonstrates how to avoid hassles, negotiate disputes, solve problems, and receive a fair shake. When you learn how to cut through red tape, assert your rights, take action, you'll find that getting results becomes the rule rather than exception in your life.Easy-to-read boxes appear on almost every page and provide you with checklists of steps to take or important facts you should know.Detailed charts allow you to compare important options - for example, in the types of life insurance policies you might buy.Sample letters and forms show you what to say and how to say it, whether you're making a complaint or resigning from a job.True-to-life scenarios reveal how other people cope with problems and take action.",
        "Category": " Law , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "The Five Minute Hair Stylist",
        "Authors": "By Moodie, Christine",
        "Description": "Combine the success of the \"five-minute\" format with the enormous popularity of Beautiful Braids and the result is this appealing collection of 30 simple, pretty, and sophisticated hairstyles that any woman can create with ease and confidence. 125 full-color photographs.",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Prince of Wales: A Biography",
        "Authors": "By Dimbleby, Jonathan",
        "Description": "For this remarkable study of the heir to the throne, Jonathan Dimbleby was given unprecedented access to his subject. As well as spending many hours in wide-ranging and candid conversation with Prince Charles, the author has interviewed at length scores of people, including his personal staff and close friends, most of whom have never talked openly about the Prince before. He has also drawn freely from the Prince's own archives, including more than 10,000 letters, private journals and diaries, none of which has hitherto been made public.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "More Needleplay",
        "Authors": "By Wilson, Erica",
        "Description": "Provides full instructions for creating articles that range from a harpooner's shirt to a set of Revolutionary War chessmen, with each project featuring a striking design and innovative needlework techniques",
        "Category": " Art , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "A Cold Heart: An Alex Delaware Novel",
        "Authors": "By Kellerman, Jonathan",
        "Description": "Jonathan Kellerman is a master at creating psychologically nuanced novels of suspense—an author whose name is synonymous with unrelenting action, intriguing plot twists, and penetrating insight into the criminal mind. Now he ventures into bold, new territory with his biggest and best novel yet. A Cold Heart features Kellerman’s brilliant signature style—but in this tour-de-force he mines even deeper the emotional landscape of his characters: psychologist-sleuth Alex Delaware, LAPD homicide detective Milo Sturgis, Milo’s colleague Petra Connor, and Alex’s ex-lover, Robin Castagna—bringing them all vividly to life as never before.“I’ve got a weird one, so naturally I thought of you,” says Milo Sturgis, summoning his friend Alex to the trendy gallery where a promising young artist has been brutally garroted on the night of her first major showing. What makes it “a weird one” is the lack of any obvious motive, and the luridly careful staging of the murder scene—which immediately suggests to Alex not an impulsive crime of passion . . . but the meticulous and taunting modus operandi of a serial killer. Delaware’s suspicion is borne out when he compares notes with Milo’s associate, Petra Connor, and her new partner, a strange, taciturn detective with a past of his own named Eric Stahl. The Hollywood cops are investigating the vicious death of Baby Boy Lee, a noted blues guitarist, fatally stabbed after a late-night set at a local club. What links Baby Boy’s murder with that of painter Juliet Kipper is the shadowy presence of an abrasive fanzine writer. This alias-shrouded critic’s love-the-art/disdain-the-artist philosophy and his morbid fascination with the murders leads Alex and the detectives to suspect they’re facing a new breed of celebrity stalker: one with a fetish for snuffing out rising stars.Tracking down the killer proves to be maddening, with the twisting trail leading from halfway houses to palatial mansions and from a college campus to the last place Alex ever expected: the doorstep of his ex-lover Robin Castagna, whose business association with two of the victims casts her as an unavoidable player in the unfolding case. As more and more killings are discovered, unraveling the maddening puzzle assumes a chilling new importance—stopping a vicious psychopath who’s made cold-blood murder his chosen art form.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Wild Christmas Reindeer",
        "Authors": "By Brett, Jan",
        "Description": "For two decades, readers have loved this classic Christmas story, which was one of the first children's books to hit the New York Times bestseller list. Now, this beautiful 20th anniversary edition, with a foil cover and a heartfelt note from Jan herself, makes a perfect introduction for new fans to this cherished yuletide story. Featuring the wintry northern setting and the border illustrations that have become a hallmark of Jan's work, readers will love watching Teeka's humorous attempts to control the rambunctious reindeer in time for their Christmas run.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "G.P. Putnam's Sons Books for Young Readers",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "House of Sand and Fog (Vintage Contemporaries)",
        "Authors": "By Dubus, Andre",
        "Description": "When a former colonel of the Iranian Air Force and his family purchase a small California home at auction, they are faced with a great conflict as the former owner and her police officer boyfriend fight to get it back at any cost.",
        "Category": " Fiction , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Legacy of Silence",
        "Authors": "By Plain, Belva",
        "Description": "",
        "Category": "",
        "Publisher": "Delacorte/Doubleday Direct",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Lovable gifts for babies (Better Homes and Gardens books)",
        "Authors": "By Gerald M. Knox",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Clare Booth Luce",
        "Authors": "By Sheed, Wilfrid",
        "Description": "Part memoir, part biography, this portrait of Clare Boothe Luce sketches a fascinating woman whose extensive, multi-faceted career encompassed the fields of magazine journalism, theater, politics, and diplomacy",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Fathers and Daughters",
        "Authors": "By Morgan, Jill M. (EDT)",
        "Description": "In this compilation, some of today's best-loved authors write about fathers they have known and fathers they have imagined (and sometimes, a little bit of both). Diana Gabaldon recalls the mix of optimism and hardheaded common sense bequeathed to her by her father, the youngest of fifteen children.Eileen Goudge tells a tale of suburban paranoia and unexpected heroism in \"My Father, the Communist.\" Faye Kellerman reminisces about her days spent underfoot in her dad's deli - where she eventually grew into a real working woman - in \"The Summer of My Womanhood.\" In \"Shadows of My Father,\" Carole Nelson Douglas, who lost her fisherman father at an early age, struggles to fill the missing puzzle pieces of memory.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Last Portrait of the Duchess of Alba: A Novel",
        "Authors": "By Larreta, Antonio",
        "Description": "The circumstances surrounding the 1802 murder of the Duchess of Alba are related by two of the men suspected of committing the crime--Manuel Godoy, first minister to the royal family, and court painter Francisco de Goya",
        "Category": "",
        "Publisher": "Woodbine House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Betty Crocker's Buffets",
        "Authors": "By General Mills, Inc.",
        "Description": "A practical guide to home entertaining features more than 260 imaginative recipes and over sixty innovative menus to suit every occasion--ranging from casual barbeques to formal receptions--and includes helpful tips on planning and preparation, decorations, and service",
        "Category": " Cooking , General",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "I'm Not Slowing Down: Winning My Battle with Osteoporosis",
        "Authors": "By Richards, Ann and Levine, Richard U., M.D.",
        "Description": "\"There was never any doubt in my mind that if I went after osteoporosis, I could control it and lead a healthy life. That's my message to other women: No one can do this for you-you've got to do it for yourself. And you can.\"  (Ann Richards)  Forty-four million Americans, thirty million of whom are women, will face osteoporosis in some form. Often triggered by hormonal changes that occur after menopause, osteoporosis results in the fracturing of bones, which can prove fatal to the elderly. One out of every six affected women will break her hip; only one out of three will regain her independence.  In 1994, after falling and fracturing her hand, Ann Richards went for a bone density test. She was diagnosed with osteopenia, an early stage of osteoporosis. After witnessing both of her grandmothers and her mother fall victim to the disease, Richards was determined to overcome its incapacitating effects. She began a physician-approved regimen of medication and dramatically changed her lifestyle.  In I'm Not Slowing Down, the former Texas governor, known for her saucy straight talk, and leading osteoporosis authority Sydney Lou Bonnick tell women what they need to know to combat this devastating disease.  Nearly a decade after her original diagnosis, Richards's bone density remains essentially stable. Readers will benefit from advice on everything from diet to exercise to the individual histories that must precede the implementation of any bone-building program if women are to begin the second act of their lives with strength, agility, and confidence.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Prince and the Pauper (Walt Disney's Wonderful World of Reading)",
        "Authors": "By Walt Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Jungle Book (Disney's Wonderful World of Reading)",
        "Authors": "By Disney, Walt",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Enterprises Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Tidings Of Comfort and Joy: A Tender Story Of Love, Loss, And Reunion",
        "Authors": "By Bunn, T. Davis",
        "Description": "As the questions begin, an extraordinary story unfolds. A story of love and loss and caring, of separation and reunion. Of small acts of heroism in a distant and war-weary English village, now half a century ago. As her grandmother shares this story with Marissa, the two discover that the most precious gift of Christmas is that of the present. And the season of giving is not limited to once a year.",
        "Category": " Fiction , Religious",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "God Inside of Me (Jump at the Sun Books)",
        "Authors": "By Reese, Della and Buchanan, Yvonne (ILT)",
        "Description": "In dealing with her misbehaving, frustrating toys and pondering what she has heard in Sunday School, Kenisha realizes that there is a piece of God in each of us and inside that piece of God is all the stuff we need",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Jump At The Sun",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Illustrated Bible for Children",
        "Authors": "By Ray Hughes",
        "Description": "",
        "Category": "",
        "Publisher": "Joshua Morris Publishing",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Live Longer Live Better",
        "Authors": "By Gram Jackson M.D.",
        "Description": "A guide to increasing longevity addresses the physical and emotional aspects of growing older and covers such areas at exercise, nutrition, stress management, disease prevention, the medical system, and personal relationships. 20,000 first printing.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "A Charmed Life (Little Mermaid's Treasure Chest)",
        "Authors": "By M. C. Varley",
        "Description": "Ariel discovers that the good things that happen to her are not caused by the four-leaf clover found by her friend Scuttle.",
        "Category": "",
        "Publisher": "Disney Books by Mail",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Pagemaster: Pop-Up Playset With Punch-Out Characters",
        "Authors": "By Krider, Karen",
        "Description": "",
        "Category": "",
        "Publisher": "Turner Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Walt Disney's Snow White and the Seven Dwarfs",
        "Authors": "By Walt Disney Company",
        "Description": "When the wicked queen puts a magic spell on Snow White, the handsome prince comes to the rescue",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Adaptations",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Saddam: King of Terror",
        "Authors": "By Coughlin, Con",
        "Description": "An unprecedented biography, drawn from the author's exclusive access to high-ranking defectors, intelligence officials, and even Saddam's own relatives -- fully illustrated with photos from his early life to the presentTwo weeks before September 11, 2001, Saddam Hussein placed his troops on their highest military alert since the Gulf War. As al-Qaeda terrorists set their attacks on America in motion, the Iraqi dictator was prepared to go to war for a second time with the United States. How did an illegitimate child from Tikrit become the West's greatest adversary, and one of the most dangerous and murderous dictators of modem times?Saddam: King of Terror is the most insightful and illuminating portrait of the Iraqi president to date-and a fascinating study of the making of a tyrant. Con Coughlin, executive editor of London's award-winning Sunday Telegraph, has covered the Middle East for decades -- on the front lines, narrowly escaping kidnapping and violence. He has cultivated exclusive contacts among the Western intelligence community and numerous defectors from Saddam's inner circles -- including former generals, political associates, and bodyguards as well as childhood friends. Coughlin knew immediately that American and British declarations of war against terrorism after the September 11th attacks would sooner rather than later encompass Saddam Hussein as well as Osama bin Laden. Coughlin shows that any operation against terrorism will be incomplete as long as Saddam remains in power -- that international policies will have to change from cautious tolerance to active intervention, a change that is already becoming a reality.Coughlin also provides the first complete portrait of Saddam's childhood ever published, compiled from the author's inter-views with Saddam's contemporaries and relatives who have never before spoken publicly about him According to Coughlin, Saddam has a younger sister no one knew about, and he idolizes his mother, although his childhood was deeply marred by his shame about being fatherless. From his earliest years, he looked to his mother's brother as a father figure, and Coughlin tells how it was this uncle who first introduced Saddam to a life of crime and political rebellion. Saddam: King of Terror meticulously traces Saddam's bloody rise to power, from Saddam's first murder and his time in prison, to an eyewitness account of Saddam storming Iraqs presidential palace in a tank, to his almost feral ruthlessness in disposing of his opponents, even dose friends and relatives, to create his regime -- a complex mechanism in which family and tribe are central, held together by Saddam's carefully orchestrated reign of fear.In Saddam: King of Terror, we see both the bizarre, almost pathological behavior of an international pariah and the unshakable power of a tyrant who has defied the world's censure and holds a nation in his grasp.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Ecco",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Smash Mouth: Two Years In The Gutter With Al Gore And George W. Bush -- Notes From The 2000 Campaign Trail",
        "Authors": "By Milbank, Dana",
        "Description": "Contrary to most media reports, negative campaigning is actually in decline, but our political system is no better off for it. Or so believes Washington Post political writer Dana Milbank, whose campaign book Smashmouth provides a witty yet ultimately very serious look at the sense and senselessness that occurred during the 2000 presidential campaign. What matters is not whether a campaign claim is positive or negative, but whether the claim is relevant,\" writes Milbank. \"The press should police outright falsehoods, of course, but otherwise let the candidates fight it out.\" Traveling by bus, plane and motorcade with the candidates, Milbank provides an indelible behind-the-scenes look at the brutal skirmishes that made up this century's first presidential campaign.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Obstetric nursing",
        "Authors": "By Olds, Sally B. and Et Al",
        "Description": "",
        "Category": "",
        "Publisher": "Addison-Wesley Educational Publishers Inc",
        "Price Starting With ($)": "11.2",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Managerial Accounting",
        "Authors": "By Hilton, Ronald W.",
        "Description": "",
        "Category": " Business & Economics , Accounting , Managerial",
        "Publisher": "McGraw-Hill College",
        "Price Starting With ($)": "33.95",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Human Exceptionality: 3rd Edition",
        "Authors": "By Michael L. Hardman, Clifford J. Drew, M. Winston Egan, Barbara Wolf",
        "Description": "",
        "Category": "",
        "Publisher": "Allyn and Bacon",
        "Price Starting With ($)": "7.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Hog Music",
        "Authors": "By Schindler, S. D. (ILT) and Helldorfer, Mary-Claire",
        "Description": "Great Aunt Liza sends a gift to her neice, Lucy, and as the box makes its way west by mail coach, each person who helps to get the package to where it is going adds something else to the box.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Witch Down the Street Carebears No. 3 (Tale from the Care Bears)",
        "Authors": "By Cooke, Tom (ILT) and Morgan, Stephanie",
        "Description": "Three Care Bears from the land of Care-a-lot help Melissa see that the woman she thought was a witch is just a lonely old lady.",
        "Category": "",
        "Publisher": "Parker Brothers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Endocrine Disorders (Nurse's Clinical Library Series)",
        "Authors": "By Springhouse Corporation",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Springhouse Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Gastrointestinal disorders (Nurse's clinical library)",
        "Authors": "By Cohen, Lisa S., Holmes, Nancy (EDT), and Shinehouse, Patricia Minard (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Springhouse Corp",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Bedford Introduction to Literature",
        "Authors": "By Meyer, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Bedford/st Martins",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Psychology",
        "Authors": "By Papalia, Diane E.",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Meeting Luciano: A Novel",
        "Authors": "By Esaki-Smith, Anna",
        "Description": "To Hanako Shimoda, recently divorced, Luciano Pavarotti is a god. To her daughter, Emily, this fixation on Pavarotti is a harmless fantasy, the byproduct of loneliness. Meeting Luciano is the story of what happens when Hanako acts on her fantasy and invites opera star Pavarotti to dinner in their Westchester County home. Emily, with no real career plan, has gone back after college to work at her old summer job - waiting tables at the local Japanese steakhouse. Even worse than wearing a fake kimono and obi is that she's living at home with her mother. At first, her mom seems pretty much her old self - still reliving her Japanese childhood; still affecting the airs of a European sophisticate; still brewing espresso, cooking Italian, and singing arias from Rigoletto while she cleans; still idolizing Luciano Pavarotti.  But when Hanako hires Alex, a handsome Greek, to renovate the kitchen, Emily begins to worry. And when Alex, who seems to be getting very cozy with her mother, spills the secret that the renovation is in preparation for a visit from Pavarotti, Emily is thrown into a wonderfully familiar quandary: how to deal with a parent who might be losing it. First-time novelist Anna Esaki-Smith has a wry, understated approach to the themes of assimilation, growing up, striking out on shaky ground, finding yourself - and loving your mother. Like a reflecting pool in a Japanese garden, Meeting Luciano gradually reveals the beauty of its subtle design.",
        "Category": " Fiction , Sagas",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "A Signature in Time: Contemporary Samplers to Stitch",
        "Authors": "By Vanessa-Ann",
        "Description": "A selection of sampler designs utilizing familiar components, a variety of fabrics and colors, and numerous techniques, with detailed instructions for each sampler",
        "Category": " Art , General",
        "Publisher": "Meredith Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Impacting Your World",
        "Authors": "By Cousins, Don",
        "Description": "Do you have difficulty sharing Christ with others? Do you have a hard time telling them how they can come to know God personally? God wants to help you have an impact in their lives. He doesn’t require you to resort to gimmicks or expect you to memorize pat answers to tough questions. In this guide you’ll discover a variety of styles of evangelism, and you’ll be able to determine the style that best fits you. This book completes the Walking with God series and provided practical helps to share your story…and his story…more effectively with others.",
        "Category": " Religion , Biblical Studies , Bible Study Guides",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Italian Cooking: Traditional Recipes for the Contemporary Cook",
        "Authors": "By Stewart, Jillian (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Ian Shoales' Perfect World",
        "Authors": "By Kessler, Merle and Shoales, Ian",
        "Description": "The author of \"I Gotta Go\" chronicles an imaginary day in the life of America's most cynical, fast-talking social critic, outlining his positions on what is right and wrong with America today",
        "Category": "",
        "Publisher": "Penguin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Heart Conditions",
        "Authors": "By Lewis, Sara",
        "Description": "A young woman, pregnant and between relationships, suddenly decides to keep her baby in this “funny and assured” first novel-”a journey of quiet surprises” (New Yorker) that’s “very, very good on the business of falling in and out of love” (Boston Globe).",
        "Category": " Fiction , General",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Mutiny on the Amistad: The Saga of a Slave Revolt and Its Impact on American Abolition, Law, and Diplomacy",
        "Authors": "By jones, howard",
        "Description": "This volume presents the first full-scale treatment of the only instance in history where African blacks, seized by slave dealers, won their freedom and returned home.  Jones describes how, in 1839, Joseph Cinqué led a revolt on the Spanish slave ship, the Amistad, in the Caribbean.  The seizure of the ship by an American naval vessel near Montauk, Long Island, the arrest of the Africans in Connecticut, and the Spanish protest against the violation of their property rights created an international controversy.    The Amistad affair united Lewis Tappan and other abolitionists who put the \"law of nature\" on trial in the United States by their refusal to accept a legal system that claimed to dispense justice while permitting artificial distinctions based on race or color.  The mutiny resulted in a trial before the U.S. Supreme Court that pitted former President John Quincy Adams against the federal government. Jones vividly recaptures this compelling drama--the most famous slavery case before Dred Scott--that climaxed in the court's ruling to free the captives and allow them to return to Africa.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Hard Courts",
        "Authors": "By Feinstein, John",
        "Description": "Presents an off-the-court look at what really goes on in the world of professional tennis, focusing on stars, old and new; umpires, ball boys, officials, and others; plus homosexuality, pay-offs, and egos",
        "Category": " Sports & Recreation , Tennis",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "High Elk's Treasure",
        "Authors": "By Sneve, Virginia Driving Hawk and Lyons, Oren (ILT)",
        "Description": "Caught in a raging storm, Joe High Elk and his sister, Marie, seek shelter in the cave of their ancestor, Steps High Like an Elk, where they learn their family history and discover High Elk's hundred-year-old forbidden treasure.",
        "Category": " Young Adult Fiction , People & Places , United States , Native American",
        "Publisher": "Holiday House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Gamer : An 11-Time All-Star's Inside Story of the Pain, Grit, Guts, and Glory of Life in the Majors",
        "Authors": "By Abraham, Ken and Carter, Gary",
        "Description": "The All-Star catcher for the Montreal Expos and New York Mets looks back on his eighteen-year major league career and shares his impressions of teammates and opponents",
        "Category": " Biography & Autobiography , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Complete Book of Natural & Medicinal Cures: How to Choose the Most Potent Healing Agents for over 300 Conditions and Diseases",
        "Authors": "By Prevention Magazine Health Books (EDT)",
        "Description": "What common fruit can help prevent cataracts?Which drug really works when it comes to battling migraines?Can vitamin supplements actually give you more energy?These questions and hundreds of others are answered in The Complete Book of Natural and Medicinal Cures. It's like having four books in one: Healing Foods, Herbal Remedies, Vitamins and Minerals and Medications.In each of these four \"books\" you will find practical, easy-to-digest information about healing agents that can turn your body into a nonstop health machine!You will discover why medical researchers are saying that onions can help fight cancer, licorice is good for a sore throat, vitamin C may help ward off cervical cancer and certain antacids are better than others for alleviating heartburn. You will also learn about the tiny apricot's huge ability to clobber cholesterol, how oregano can cure indigestion and how vitamin D can help heal fractures.Never before has so much useful health information been packed into a single volume. In every entry you will find specific advice on how to use a healing agent to its maximum healing advantage. You will also find crucial advice on avoiding drug side effects and interactions.For instance, did you know that certain medications for high blood pressure can become ineffective if taken with anti-inflammatory drugs? Or that fiber supplements taken wisely can help prevent constipation, but taken unwisely can actually make matters worse?As a special feature, boxes entitled \"Natural Alternatives\" divulge doctor-approved home remedies that can often work just as well - or better than - medications for battling such troubling ailments as diabetes, nausea, hemorrhoids, insomnia and psoriasis.This is the best book ever published to keep you informed of what your body needs to retain perfect health. Once you become acquainted with The Complete Book of Natural and Medicinal Cures, you'll recognize that you have found a friend for life!",
        "Category": " Health & Fitness , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "10 Feet Tall and Bulletproof",
        "Authors": "By Bane, Michael and Tritt, Travis",
        "Description": "Travis Tritt. He's the king of Nashville's new generation of outlaws. The youngest member ever inducted into the Grand Ole Opry. And one of country music's hottest new superstars.Now you can meet the real Travis Tritt, in the very words born of the same mind and soul that gave the world the packed-dirt honesty, no-chaser humor, and full-span lyricism of megahits like \"Here's a Quarter (Call Someone Who Cares),\" \"I'm Gonna Be Somebody,\" \"t.r.o.u.b.l.e.,\" \"The Whiskey Ain't Workin',\" and \"Put Some Drive in Your Country.\" Here is Travis Tritt telling you about his decidedly unglamorous years during which he went through two failed marriages, kept a job loading trucks, and began an unrewarding career in inside sales. Here is Tritt struggling to find his true vocation, lighting his way out of the narrow little box of prejudice that comes with the territory using the best weapon he has... his music.You'll witness Travis Tritt pay righteous dues to the godfathers of his distinctive brand of country and rock, crystal-clear bluegrass, and down-and-dirty blues - men like Waylon Jennings, Willie Nelson, and Hank Williams, both senior and junior. You'll be with him on his encounters - mostly friendly, sometimes feuding - with contemporary stars like Merle Haggard, Dolly Parton, Charlie Daniels, and Billy Ray Cyrus.Finally, you'll hear Travis Tritt on concerts and the road (\"Your microphone stands serve two functions - making music and de facto weapons\"), on his public and his women (\"All of a sudden, women are throwing themselves at me\"), and on the unending love-hate relationship with the country music circuit and the self-appointed keepers of the flame in Nashville (\"I pretty much had a reputation for being... the type of sleazeball who would actually type up his own contract\"). This is Travis Tritt, the stink of bars with chicken wire stages still on his dusty boots, the superstar singing of the loss and suffering and love that only a one-hundred-proof, New South good ole boy can know up close.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Ten Things I Wish I'd Known - Before I Went Out into the Real World",
        "Authors": "By Shriver, Maria",
        "Description": "The Peabody Award-winning television journalist reveals a personal list of things she wished she had known when she was a younger woman, candidly discussing marriage, motherhood, and career in the process. 225,000 first printing.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Break And Enter",
        "Authors": "By Harrison, Colin",
        "Description": "Successful Assistant DA Peter Scattergood finds his professional and personal integrity tested by his wife's desertion, a seductive older woman, high-level corruption in his office, and the most explosive case of his career",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Fellowship of the Stars",
        "Authors": "By Carr, Terry",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1974"
        }
    },
    {
        "Title": "Dead Ahead",
        "Authors": "By Horansky, Ruby",
        "Description": "Brooklyn detective Nikki Trakos is given three days by her chauvinistic boss to solve the murder of a small-time gambler with big-time connections or lose the case to a male colleague",
        "Category": " Fiction , General",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Mum's the Word",
        "Authors": "By Cannell, Dorothy",
        "Description": "When her husband, Ben, drags her to the States for a gourmet cooking competition, the nervous and pregnant Ellie Haskell encounters mystery and murder in the American Midwest",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "A Heart of Stone",
        "Authors": "By Velmans, Hester and Dorrestein, Renate",
        "Description": "A Dutch girl living in suburban Amsterdam, Ellen Van Bemmel begins to delve into her own past when a traumatic event shakes her idyllic family life. 25,000 first printing.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "DYING YOUNG",
        "Authors": "By Leimbach, Marti",
        "Description": "Death's inevitability and love's uncertainty underlie the romantic triangle of leukemia-stricken Victor, his caretaker Hilary, and the vital and alluring Gordon, in a tale set on the coast of Massachusetts",
        "Category": " Fiction , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Life Was Meant to Be Lived: A Centenary Portrait of Eleanor Roosevelt",
        "Authors": "By Lash, Joseph P.",
        "Description": "Commemorating the centenary of her birth, this book captures the full span of Eleanor Roosevelt's remarkable life and the fiber of her vibrant personality",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "The Billion Dollar Sure Thing",
        "Authors": "By Paul E. Erdman",
        "Description": "",
        "Category": "",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Aquitaine Progression",
        "Authors": "By Ludlum, Robert",
        "Description": "High-powered international lawyer Joel Converse is recruited to explode a plot to create world-wide chaos and take over the world, a conspiracy masterminded by Converse's personal enemy General Delavance and an international cabal of generals",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Saint Mike: A Novel (Harper Novel of Suspense)",
        "Authors": "By Oster, Jerry",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Haunts",
        "Authors": "By Douglas, John",
        "Description": "When a devastating flood in the Allegheny Mountains hits Shawnee and unearths an old skeleton, Detective Harter's investigation prompts a new murder that bridges the past and present",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "In A Year Of Grace",
        "Authors": "By Tracy, Honor Lilbush Wingfield",
        "Description": "",
        "Category": "",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "12.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Dead Giveaway",
        "Authors": "By Brett, Simon",
        "Description": "One of the stars of a new TV game show is murdered, and Charles Paris, an often out-of-work actor and part-time detective, is on hand to investigate",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "13.17",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Flood Tide",
        "Authors": "By Cussler, Clive",
        "Description": "Following the runaway success of his first nonfiction book, The Sea Hunters, Clive Cussler returns with his legendary fictional hero Dirk Pitt® -- in a masterfully crafted tale of villainy on the high seas and the Mississippi River that can only enhance his status as the grand master of adventure fiction. The coin of the realm for the wealthy, insatiably greedy Chinese smuggler who is Dirk Pitt's adversary in Flood Tide is human lives: much of his vast fortune has been made smuggling Chinese immigrants into countries around the globe, including the United States. Tracking the smuggler's nefarious activities leads Pitt from Washington State to Louisiana, where his quarry is mysteriously constructing a huge shipping port in the middle of nowhere. Why has he chosen this unlikely location? The trail then leads to the race to find the site of the mysterious sinking of the ship that Chiang Kai-shek filled with treasure when he fled China in 1949, including the legendary boxes containing the bones of Peking Man that had vanished at the beginning of World War I. As Pitt prepares for a final dramatic showdown, he is faced with the most formidable foe he has ever encountered. With a dozen consecutive New York Times bestsellers and over 70 million copies of his books in print, Clive Cussler is one of America's most popular novelists. His latest book is enthralling, intricately plotted, and supremely suspenseful.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "To Catch a King: A Novel",
        "Authors": "By Patterson, Harry",
        "Description": "In July 1940, Walter Schellenberg is ordered by Hitler to proceed to Lisbon to kidnap the Duke and Duchess of Windsor, a mission which thrusts him into an unlikely partnership with a beautiful American woman and a burgeoning anti-Nazi underground movement",
        "Category": "",
        "Publisher": "Stein & Day Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1979"
        }
    },
    {
        "Title": "SPORTS IN AMERICA",
        "Authors": "By Michener, James A.",
        "Description": "Originally published in 1976, James A. Michener’s explosive, spectacular Sports in America is a prescient examination of the crisis in American sports that is still unfolding to this day. Pro basketball players are banned for narcotics use, while a Major League pitcher is arrested for smuggling drugs across the Mexican border. The NFL’s “injury report” grows longer every Sunday. Corruption and recruiting violations plague collegiate sports as the “winning is everything” mentality trickles down to the Little League level. With his lifelong enthusiasm for sports in evidence, the incomparable Michener tackles this subject thoroughly and leaves us amazed and appalled by what we’ve learned, yet still loving the games we grew up on.BONUS: This edition includes an excerpt from James A. Michener's Hawaii.Praise for Sports in America“A comprehensive, controversial examination of sports as a major force in American life.”—Los Angeles Times“Michener’s life was saved by sports twice. In return, he has issued a long, lovingly critical, prodigiously researched account of the passions and politics of America at organized play. Rich in anecdote, source material and his own shrewd commentary.”—The New York Times Book Review“Like just about everything James Michener has produced, Sports in America is a thoughtful, well-written document that’s thoroughly researched. . . . For anyone interested in how the ball bounces in the U.S. of A., the answers are all here.”—The Wall Street Journal“Encyclopedic . . . amusing and sometimes alarming.”—The Washington Post",
        "Category": " Sports & Recreation , History",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "May",
            "Year": "1976"
        }
    },
    {
        "Title": "Cops: Their Lives in Their Own Words",
        "Authors": "By Baker, Mark",
        "Description": "Based on interviews with more than one hundred police officers, a cross-section representing male and female officers, small town and big city cops, Blacks and whites, patrolmen and anti-terrorist specialists, the author reveals the worlds of the police",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.61",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Tracy and Hepburn : An Intimate Memoir.",
        "Authors": "By Kanin, Garson",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Press BCE",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "1971"
        }
    },
    {
        "Title": "The Christmas Crimes at Puzzel Manor",
        "Authors": "By Brett, Simon",
        "Description": "The dead man lay to one side, between the front pew and the altar. On the wall above him, over a little ledge on which the Puzzel motto was carved, could be seen the discoloured cobwebbed outline of the shield which had fallen to kill him. It lay face down, obscuring the man's head. Two halves of its chain hung from rings on each side. At the end of one was a broken link.Jack Tarrant is a newly retired Scotland Yard detective recovering from a bullet wound and bored with doing nothing but crossword puzzles. His girlfriend Maria hopes that a festive holiday weekend at the snowbound Country House Hotel, Puzzel Manor, will lift his spirits. But Jack can't seem to get away either from his career or the puzzles he loves so much. Soon after he and Maria arrive for their weekend, they find a corpse - and a series of mysterious, fiendish puzzles pitting them against the unknown murderer.The game is murder and the rules are dead simple. To avert further bloodshed, Jack and Maria must find out who among the guests or staff is the Puzzel Manor murderer by following the trail of devious clues before it's too late.Each chapter ends with a puzzle - sometimes an anagram, sometimes a crossword or other word game, sometimes a logic puzzle - and each subsequent solution brings Jack and Maria (and the reader) closer to the murderer's identity.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "C.B. Greenfield: The Piano Bird",
        "Authors": "By KALLEN, Lucille",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "8.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Main-Dish Soups (Little Vegetarian Feasts)",
        "Authors": "By Shulman, Martha Rose and Drechsler, Debbie (ILT)",
        "Description": "Provides recipes for such soups as Provencal spinach and potato soup, garlic soup with fusilli and broccoli, sweet and spicy red cabbage and apple soup, tangy cream of sorrel soup, and intense mushroom broth",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    }
]