[
    {
        "Title": "Parting Company: How to Survive the Loss of a Job and Find Another Successfully",
        "Authors": "By Morin, William J. and Cabrera, James C.",
        "Description": "Suggests methods for coping with the emotional stress of being fired and discusses the re-examination of professional goals and organization of the search for a new job",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Women & Public Policy: A Revolution in Progress",
        "Authors": "By Conway, M. Margaret, Ahern, David W., and Steuernagel, Gertrude A.",
        "Description": "",
        "Category": "",
        "Publisher": "Cq Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Two Guys Four Corners: Great Photographs, Great Times, and a Million Laughs",
        "Authors": "By Imus, Don and Imus, Fred",
        "Description": "A collection of striking photographic images of the American Southwest are accompanied by Don Imus's trademark trenchant observations and witty commentary on modern life. 50,000 first printing.",
        "Category": " Travel , Pictorials",
        "Publisher": "Villard",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Effective Presentation Skills: A Practical Guide for Better Speaking (A Fifty Minute Series Book)",
        "Authors": "By Mandel, Steve",
        "Description": "Describes how to plan, prepare, and give a speech or other presentation, and discusses visual aids, including the use of computers, teleconferencing, and videoconferencing",
        "Category": " Business & Economics , Reference",
        "Publisher": "Crisp Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Ceo: Corporate Leadership in Action",
        "Authors": "By Harry Levinson, Stuart Rosenthal",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "Treating Children in Groups: A Behavioral Approach (The Jossey-Bass Behavioral Science Series)",
        "Authors": "By Rose, Sheldon D.",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Jossey-Bass Inc Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "Massachusetts Avenue Architecture, Vol. 1",
        "Authors": "By Carson, Jeffrey Et Al",
        "Description": "",
        "Category": "",
        "Publisher": "Commission of Fine Arts",
        "Price Starting With ($)": "62.65",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Recipes of Quality",
        "Authors": "By CHR. HEURICH Brewing Co.",
        "Description": "",
        "Category": "",
        "Publisher": "CHR. HEURICH Brewing Co., Washington, D.C.",
        "Price Starting With ($)": "26.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1912"
        }
    },
    {
        "Title": "Development of the United States Capital - Addresses Delivered In the Auditorium of the United States Chamber of Commerce Building April 25-26, 1929",
        "Authors": "By Andrew W. Mellon, Herbert Hoover, Reed Smoot, Milton B. Medary, Charles Moore, Edward H. Bennett, L. E. Atkins, Louis C. Cramton",
        "Description": "",
        "Category": "",
        "Publisher": "United States Government Printing Office",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1930"
        }
    },
    {
        "Title": "The Entertainment Weekly Seinfeld Companion",
        "Authors": "By Fretts, Bruce and Park, Jeannie (EDT)",
        "Description": "The hottest personality in network television is celebrated in this illustrated guide to Seinfeld, featuring the expressions, situations, and idiosyncracies beloved by fans of this top-ten-rated sitcom. Fretts has written extensively about Seinfeld for Entertainment Weekly. 100 photos.",
        "Category": " Humor , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The American House Styles of Architecture Coloring Book (Dover History Coloring Book)",
        "Authors": "By Smith, Albert",
        "Description": "Here is the grand sweep of American domestic architecture . . . from mud pueblos to solar-heated contemporaries, from log cabins to town houses, from sod huts to Greek Revival mansions. Spanning roughly 500 years, the dwellings reveal a remarkable variety of styles and approaches. Noted illustrator A. G. Smith has rendered over forty extant structures in crisp, detailed drawings. Ranging from the Taos Pueblo (New Mexico, pre-sixteenth century) to a striking contemporary design by John Milnes Baker, the houses represent a host of native and European-inspired styles: Spanish Colonial Revival, Georgian, High-Victorian Gothic, Italianate, Second Empire, Stick Style, Richardson Romanesque, Beaux-Arts Classical, Prairie, and many others. Rich, informative captions date and identify each house as well as describing important architectural features, methods, and materials of construction and historical background, and showing how Old World architectural styles were adapted and modified in America. In addition to many hours of coloring fun, this book offers students, cultural historians, and Americana enthusiasts a step-by-step overview of the evolution of American architecture — from its primitive origins to the technologically sophisticated homes of today.",
        "Category": " Juvenile Nonfiction , Architecture",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Educated Child: A Parents Guide From Preschool Through Eighth Grade",
        "Authors": "By Bennett, William J., Finn, Chester E., Jr., and Cribb, John T. E., Jr.",
        "Description": "If you care about the education of a child, you need this book. Comprehensive and easy to use, it will inform, empower, and encourage you.  Just as William J. Bennett's The Book of Virtues has helped millions of Americans teach young people about character, The Educated Child delivers what you need to take control. With coauthors Chester E. Finn, Jr., and John T. E. Cribb, Jr., former Secretary of Education Bennett provides the indispensable guide.  Championing a clear \"back-to-basics\" curriculum that will resonate with parents and teachers tired of fads and jargon, The Educated Child supplies an educational road map from earliest childhood to the threshold of high school. It gives parents hundreds of practical suggestions for helping each child succeed while showing what to look for in a good school and what to watch out for in a weak one.  The Educated Child places you squarely at the center of your young one's academic career and takes a no-nonsense view of your responsibilities. It empowers you as mothers and fathers, enabling you to reclaim what has been appropriated by \"experts\" and the education establishment. It out-lines questions you will want to ask, then explains the answers -- or non-answers -- you will be given. No longer will you feel powerless before the education \"system.\" The tools and advice in this guide put the power where it belongs -- in the hands of those who know and love their children best.  Using excerpts from E. D. Hirsch's Core Knowledge Sequence, The Educated Child sets forth a state-of-the art curriculum from kindergarten through eighth grade that you can use to monitor what is and isn't being taught in your school. It outlines how you can help teachers ensure that your child masters the most important skills and knowledge. It takes on today's education controversies from phonics to school choice, from outcomes-based education to teaching values, from the education of gifted children to the needs of the disabled. Because much of a youngster's education takes place outside the school, The Educated Child also distills the essential information you need to prepare children for kindergarten and explains to the parents of older students how to deal with such challenges as television, drugs, and sex.  If you seek high standards and solid, time-tested content for the child you care so much about, if you want the unvarnished truth about what parents and schools must do, The Educated Child is the one book you need on your shelf.",
        "Category": " Education , Elementary",
        "Publisher": "Free Press",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Perfecting Your Short Game: Cure Your Putting Problems (Play Better Golf Series)",
        "Authors": "By Lewis, Beverly",
        "Description": "",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Further Tales of the City: A Novel (Tales of the City, 3)",
        "Authors": "By Maupin, Armistead",
        "Description": "The third novel in the beloved Tales of the City series, Armistead Maupin’s best-selling San Francisco saga, soon to return to television as a Netflix original series once again starring Laura Linney and Olympia Dukakis.The calamity-prone residents of 28 Barbary Lane are at it again in this deliciously dark novel of romance and betrayal. While Anna Madrigal imprisons an anchorwoman in her basement, Michael Tolliver looks for love at the National Gay Rodeo, DeDe Halcyon Day and Mary Ann Singleton track a charismatic psychopath across Alaska, and society columnist Prue Giroux loses her heart to a derelict living in a San Francisco park.",
        "Category": " Fiction , LGBT , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Resonance (Baen Book)",
        "Authors": "By Dolley, Chris",
        "Description": "Allen Caine was too young to remember when the Earth had not been a conquered planet, one of many such in the huge and sprawling Rygril empire, but he knew of the legendary blackcollars, guerilla warriors trained to the limit of human speed and skill, then turned into nearly superhuman combatants by use of the now-lost backlash drug. Earth and its former colony worlds had been overwhelmed, but sparks of rebellion still smoldered, and the rebel underground on Earth had sent Caine on an undercover mission to the former Earth colony of Plinry, where there was a faint hope that a blackcollar unit still existed. The underground alone knew of a secret that might be humanity's ace in the hole. And if a remnant of blackcollar fighters still existed on Plinry, they were the only hope of playing that ace in a final bid for the freedom of humanity.  Publisher's Note: This book has appeared in parts as The Blackcollar and Blackcollar: The Backlash Mission. This is the first unified appearance of the complete book.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Insider's Guide to Buying a New or Used Car",
        "Authors": "By Leon, Burke and Leon, Stephanie",
        "Description": "Covers car loans, trade-ins, dealer costs, test drives, dealer tactics, negotiation, leases, used car ads, and selling a car",
        "Category": "",
        "Publisher": "Betterway Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "That's Not in My American History Book: A Compilation of Little-Known Events and Forgotten Heroes",
        "Authors": "By Ayres, Thomas",
        "Description": "Presents a collection of little-known or overlooked stories from American history, including an account of the communist invasion of Texas and the story of the men who flew before the Wright brothers.",
        "Category": " History , United States , General",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Hurried Child: Growing Up Too Fast Too Soon (Revised edition)",
        "Authors": "By Elkind, David",
        "Description": "Often with the very best intentions, Americans expose their children to overwhelming pressures, pressures that can lead to low self-esteem, to teenage pregnancy, and even to teenage suicide. By blurring the boundaries of what is age appropriate, by expecting&#151;or imposing&#151;too much too soon, we force our kids to grow up too fast, to mimic adult sophistication while secretly yearning for innocence.With the first edition of The Hurried Child, David Elkind emerges as the voice of reason, calling our attention to the crippling effects of hurrying. But in the decade since this book first appeared, a new generation of parents has inadvertently stepped up the assault on childhood, misled by the new and comforting rhetoric of childhood ”competence.”Now Dr. Elkind has thoroughly revised this enormously successful book to debunk the notion of ”competence” tha thas children racing off to early enrichment programs, burdened by the pressure to ”achieve,” and coming home alone to an empty house after school. He sees ”sompetence” as a notion meant to rationalize the needs of adults, not to serve the genuine needs of kids, a notion that has fourth graders dieting to fit into designer jeans and children of divorce asked to be the confidants of their troubled parents.In updating this new edition, Dr. Elkind takes a detailed and up-to-the-minute look at the world of today&#39;s kids in terms of education, movies, television, rock & roll, and social trends, to see where the hyrrying occurs and why. And as before, he offers parents and teachers insight, advice, and hope for encouraging healthy development while protecting the joy and feedom of childhood.",
        "Category": " Psychology , General",
        "Publisher": "Addison-Wesley Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "By the Political Sea, an Inside Account of Life With the Democrats By the Woman Who Knows Them All",
        "Authors": "By Katie Louchheim",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company Inc.",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "For As Long As We Both Shall Live",
        "Authors": "By Fritts, Roger",
        "Description": "We have come together to share in the joy and celebration of a marriage ...Here is the guide that will help you design the wedding ceremony that is perfect for you. Complete with all kinds of options for both traditional and nontraditional weddings, it includes all the basic parts of Protestant, Catholic, and Jewish ceremonies as well as ideas for readings from the Old and New Testaments and from Hebrew Scriptures, as well as from the works of writers and poets. In addition to the familiar traditional vows, you'll find personalized promises written by the bride and groom.Also included are services appropriate for interfaith marriages and passages that include families and children from previous marriages.In addition, you'll find valuable guidance on all aspects of wedding planning, including where to hold the ceremony, music, customs and traditions, wedding etiquette, and more.",
        "Category": " Reference , Weddings",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Better Homes and Gardens Country Desserts",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "MEREDITH",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Frontier on the Potomac",
        "Authors": "By Daniels, Jonathan",
        "Description": "",
        "Category": "",
        "Publisher": "The MacMillan Company",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "The News Manipulators: Why You Can't Trust the News",
        "Authors": "By Irvine, Reed",
        "Description": "",
        "Category": "",
        "Publisher": "Book Distribution Center, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Act of Violence",
        "Authors": "By Yorke, Margaret",
        "Description": "The quiet market town of Mickleburgh knows very little serious crime, and local solicitor Oliver Foxton's days are occupied with wills, and the occasional drunk and disorderly.So when four local schoolboys go on a rampage in Deerton and commit a shocking act of violence, the quiet calm of these idyllic country towns is shattered.Attempting to come to terms with what has happened, Oliver immerses himself in the renovation of an old doll house belonging to his friend Prudence Wilmot, a local author, and finds that the doll inhabitants increasingly become a symbol of his own troubled marriage and the tensions the tragedy has sparked within it.And all the time another hidden menace lurks in the background as a released murderer living nearby is enthralled with the crime - and, practicing as a counselor, stands poised to offer help.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Bondage of Love: A Life of Mrs. Samuel Taylor Coleridge",
        "Authors": "By Lefebure, Molly",
        "Description": "Traces the life of Samuel Coleridge, looks at her marriage to the difficult English poet and critic, and discusses how Coleridge's opium addiction affected their lives",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Star Trek: The Next Generation - Triangle: Imzadi II",
        "Authors": "By David, Peter",
        "Description": "Even in the 24th century, three is definitely a crowd.  Imzadi: to the people of the planet Betazed, including Counselor Deanna Troi of the Starship Enterprise?, it means \"beloved\" and denotes a special closeness that can never be truly broken. Or can it?  In his acclaimed earlier novel, Imzadi, bestselling author Peter David explored the special bond between Deanna Troi and Commander William T. Riker. It revealed new facets of their long and intimate relationship and put that bond to its ultimate test in a powerful and unforgettable story that remains one of the most popular Star Trek® adventures ever published. Imzadi was a New York Times bestseller in both hardcover and paperback.  Now David examines the heart of Deanna Troi from an altogether different perspective, as he reveals for the first time the full story of Troi's troubled romance with Lieutenant Commander Worf.  At first glance, they cannot be more different. She is an empath, gentle and acutely sensitive to the needs and feelings of others. He is a fierce Klingon warrior, dedicated to a harsh and warlike code of honor. Brought together, however, by a common need to care for Alexander, Worf's troubled, motherless son, they discover hidden reserves of courage and compassion within each other.  Soon mutual respect leads to much stronger emotions as they embark on an unexpected courtship, much to the surprise and discomfort of William Riker.  But does Worf's future truly lie with Deanna...or on a distant outpost called Deep Space 9?? And whom indeed shall Troi ultimately call \"imzadi\"?  Imzadi II is a compelling story, an untold chapter in the history of the Starship Enterprise?.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Weekend Houses",
        "Authors": "By Rowlands, Penelope and Darley, Mark (PHT)",
        "Description": "Home sweet home away from home...the weekend getaway is the perfect place to rejuvenate, a sanctuary for enjoying life's simpler pleasures. For those who already own a second home or dream of having one, this lovely volume of more than 200 lush photographs will transport sojourners from one beautiful retreat to another. From rustic cabins to grand farmhouses, from water's edge to country meadows and mountain glades, a weekend home is the perfect place to unwind. Taking an intimate tour of twenty-seven weekend escapes, revealing in wonderful detail both interior and exterior views, readers learn from the owners what makes each place special and why the perfect weekend home isn't limited to any one part of the country, nor is it defined by size or style of architecture. The real beauty of these houses lies in the casual, relaxed vacation lifestyle they inspire. A stunning photographic journey, Weekend Houses is the ultimate guide to leaving it all behind.",
        "Category": " Architecture , Buildings , Public, Commercial & Industrial",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Raising Adopted Children, Revised Edition: Practical Reassuring Advice for Every Adoptive Parent",
        "Authors": "By Melina, Lois Ruskai",
        "Description": "In this completely revised and updated edition of Raising Adopted Children, Lois Melina, editor of Adopted Child newsletter and the mother of two children by adoption, draws on the latest research in psychology, sociology, and medicine to guide parents through all stages of their child's development. Melina addresses the pressing adoption issues of today, such as open adoption, international adoption, and transracial adoption, and answers parents' most frequently asked questions, such as:How will my child \"bond\" or form attachments to me?When and how should I tell my child that he was adopted?What should schools be told about my child?Will adoption make adolescent upheavals more complicated?Up-to-date, sensitive, and clear, Raising Adopted Children is the definitive resource for all adoptive parents and concerned professionals.",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Duncan & Mallory",
        "Authors": "By Asprin, Robert",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Walsworth Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "What Can You Do with a Shoe?",
        "Authors": "By Sendak, Maurice (ILT) and De Regniers, Beatrice Schenk",
        "Description": "What can you do with a shoe? You can put it on your ear or wear it on your head or butter it like bread or use apple jam instead! What can you do with a hat? You can fill it up with pickles or with popcorn or with glue. An octopus could rest in it, a bird could build a nest in it, a turtle be a guest in it. Or would a horse look best in it? These are samples of the questions and wonderfully silly, laugh-provoking answers in a game played by a little girl and boy dressed up i their parents clothes. On every page of this whimsically playful book, there are enchanting watercolor illustrations by Maurice Sendak. Inspired by the infectiously funny pictures and text, children will soon begin to make rhymes of their own about everyday things. Richly imaginative and wholly in tune with children's high spirits and sense of play, What can you do with a show?, now issued in a new edition with full-color paintings, will be welcomed by young and old. It is a treasure.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "McElderry",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Feng Shui: How to Achieve the Most Harmonious Arrangement of Your Home and Office",
        "Authors": "By Thompson, Angel",
        "Description": "Feng shui (pronounced fung shway) is an ancient Chinese practice based on the idea that the auspicious placement and arrangement of buildings, walkways, doors, furniture, plants, and other objects can ensure a good life. Good feng shui allows cosmic energy or chi to flow freely, creating a harmonious environment and improving the health, love life, peace, even prosperity of those who live or work there. By carefully locating and orienting your residence and organizing its interior design to maximize good energy, you can promote success and happiness.In Feng Shui, Angel Thompson, a noted expert, explains how you can make small (or large) changes in your home or office environment to increase the flow of positive energy. Thompson's clear, practical approach provides dozens of helpful tips for making any size and type of space better.",
        "Category": " Body, Mind & Spirit , Feng Shui",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The TVP Cookbook: Using the Quick-Cooking Meat Substitute",
        "Authors": "By Bates, Dorothy R.",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Book Publishing Company (TN)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Myth of Separation: What Is the Correct Relationship Between Church and State?",
        "Authors": "By Barton, David",
        "Description": "",
        "Category": "",
        "Publisher": "WallBuilder Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "The Story of Florida's Seminole Indians",
        "Authors": "By Neill",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Great Outdoors Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "A Walking Guide to Historic Georgetown",
        "Authors": "By Foundation for the Preservation of Historic Georgetown",
        "Description": "",
        "Category": "",
        "Publisher": "Foundation for the Preservation of Historic George",
        "Price Starting With ($)": "11.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Towelhead: A Novel",
        "Authors": "By Erian, Alicia",
        "Description": "The year is 1991. When Jasira's mother finds out what has been going on between her boyfriend and her thirteen-year-old daughter, she has to make a choice -- and chooses to send Jasira off to Houston’ Texas, to live with her father. A remote disciplinarian prone to explosive rages, Jasira's father is unable to show his daughter the love she craves -- and far less able to handle her feelings about her changing body.  Bewildered by extremes of parental scrutiny and neglect, Jasira begins to look elsewhere for affection. Saddam Hussein has invaded Kuwait, and high school has become a lonely place for a \"towelhead.\" When her father meets, and forbids her to see, her boyfriend, it becomes lonelier still. But there is always Mr. Vuoso -- a neighboring army reservist whose son Jasira babysits. Mr. Vuoso, as Jasira discovers, has an extensive collection of Playboy magazines. And he doesn't seem to think there's anything wrong with Jasira's body at all.  Painfully funny, tender, and sexually charged, Towelhead is that rare thing: a gloriously readable novel unafraid to take risks. The story of a girl failed by her parents and by a conflicted America, Towelhead is an ultimately redemptive and moving work that none of us can afford to ignore.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Craft and Community: Traditional Arts in Contemporary Society",
        "Authors": "By Staub, Shalom D. (EDT)",
        "Description": "",
        "Category": " Art , Folk & Outsider Art",
        "Publisher": "Balch Inst for Ethnic Studies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Home Workshop (Home Repair and Improvement)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "The Safe Travel Book",
        "Authors": "By Savage, Peter",
        "Description": "Explains how to avoid being a terrorist target while abroad, acquire a visa on short notice, secure medical help, get through foreign customs, achieve safety and security in hotels, and arrange for communication with friends",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Lexington Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Agenda for the Nation",
        "Authors": "By Kermit Gordon",
        "Description": "",
        "Category": "",
        "Publisher": "The Brookings Institution",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Games, Crowdbreakers and Community Builders (Fresh Ideas Resource)",
        "Authors": "By Burns, Jim, Lusz, Joel, and Simone, Mark",
        "Description": "",
        "Category": "",
        "Publisher": "Gospel Light Pubns",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Our Man in Panama: How General Noriega Used the United States- And Made Millions in Drugs and Arms",
        "Authors": "By Dinges, John",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Flywheel, Shyster, and Flywheel: The Marx Brothers' Lost Radio Show",
        "Authors": "By Barson, Michael (EDT) and Marx Brothers (COR)",
        "Description": "Gathers transcriptions of the Marx Brothers radio show, and discusses the background of the show",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "The Complete Fawlty Towers",
        "Authors": "By Cleese, John and Booth, Connie",
        "Description": "The complete and unexpurgated scripts of one of the most celebrated comedy series ever. Published in its entirety for the first time and illustrated with a host of hilarious photographs, The Complete Fawlty Towers will appeal to the millions of fans who have suffered through endless PBS fundraisers waiting for the next episode -- and anyone who has survived a package holiday tour.Fawlty Towers is the hotel of every traveler's nightmare. Basil Fawlty -- ill-tempered, henpecked, and conniving -- tries in vain to be master of his house under the disapproving and ever-watchful eye of his wife, Sybil. The hotel offers service by Manuel, the incompetent Spanish waiter whose feeble grasp of English makes for hilarious misunderstandings, and Polly, the unflappable chambermaid who is Fawlty Towers' only sane employee. Meals are scorched in the kitchen while adulterers consort upstairs and chaos reigns all around. For countless fans, Fawlty Towers is the best-loved bad hotel in the world, and with publication of The Complete Fawlty Towers they will all have a chance to relive its outrageous awfulness.",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "The 8-Week Cholesterol Cure Cookbook: More Than 200 Delicious Recipes Featuring the Foods Proven to Lower Cholesterol",
        "Authors": "By Kowalski, Robert E.",
        "Description": "Applying the principles outlined in \"The Eight-Week Cholesterol Cure,\" the author presents more than two hundred imaginative and easy-to-prepare recipes that can contribute to lower cholesterol levels",
        "Category": " Cooking , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "The Crater",
        "Authors": "By Slotkin, Richard",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The African Elephant: Twilight in Eden (National Audubon Society Book)",
        "Authors": "By Disilvestro, Roger L. (EDT), Palmer, Christopher N., and Chichester, Page",
        "Description": "From The National Audubon Society, an internationally known organization working on behalf of environmental and wildlife conservation causes, comes this exquisite photographic essay on the African elephant. Using dozens of full-color photographs, it depicts the life and struggles of these majestic beasts--from their significance in Roman, Greek and Victorian society to Africa's current fight to save its elephants. Examines all facets of the African elephant's life and provides in-depth coverage of one of the most widely covered conservation issues of today: the poaching and slaughtering of African elephants for their ivory.",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "Wiley",
        "Price Starting With ($)": "7.12",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Psychology: Themes and Variations",
        "Authors": "By Weiten, Wayne",
        "Description": "No higher compliment need be paid than to say - as one reviewer recently did - that this is the text by which all others for the course are measured. Since the first edition of this book appeared, professors have praised Weiten's scholarship as exemplary and the accessibility of his prose as unparalleled.  This is the text that redefined the way Introductory Psychology is taught by using integrative themes to develop the connections among different areas of psychological research. And now, with this Fourth Edition, Weiten again raises the bar a notch higher for competitors. Not only has he continued to refine and improve his fine text, but Weiten has developed an exciting multimedia CD-ROM for the course, giving instructors a new, engaging way to teach and students an interactive way to learn. Now, Weiten not only explains the interdependent links between research and applications, but he gives students a fascinating way to explore psychological concepts through experiments and activities included on the \"PsycTrek\" CD-ROM.      Using integrative themes to emphasize connections among different areas of research in psychology, Weiten challenges students to grapple with the big issues and tough questions while mastering the basic concepts of psychology. Throughout the Fourth Edition, Weiten emphasizes the unity in psychology's intellectual heritage (the themes), as well as psychology's immense diversity (the variations). Long after your students have completed their final examinations, they will retain a genuine understanding of the basic ideas about psychology and behavior.",
        "Category": " Psychology , General",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "8.93",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Roget International Thesaurus Index 5E (Roget's International Thesaurus Indexed Edition)",
        "Authors": "By Chapman, Robert L. (EDT)",
        "Description": "Roget's International Thesaurus®, fifth edition, is the original -- now completely expanded, reorganized, revised and updated -- the definitive thesaurus for the 21st century.While retaining Dr. Peter Mark Roget's fundamental and brilliant category concept which groups all synonyms, antonyms and related words together for quick and easy comparison without all the needless repetition and cross referencing of alphabetical thesauruses, this new fifth edition is:the most up-to-date -- with 1073 categories including 31 entirely new ones concerning such topics as the body, fitness and exercise, substance abuse, all kinds of sports, books, motion pictures and computer sciencedefinitive -- based on extensive word association research into how words are actually used, resulting in the most current reflection of the language today and including the latest phrases, slang and commonly used foreign terms the most comprehensive thesaurus available -- 325,000 words and phrasesan invaluable source book with many additional features -- boldface type for the most commonly used words in a category, usage and foreign language labels throughout and a unique and useful feature of word lists including lists for measurements, gods and goddesses, manias and phobias, groups and movements, state mottos and moretime-tested -- this definitive, updated edition retains the original time-tested format that allows much more depth of information",
        "Category": " Reference , Thesauri",
        "Publisher": "Collins Reference",
        "Price Starting With ($)": "7.92",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "African Game Trails: An Account of the African Wanderings of an American Hunter-Naturalist",
        "Authors": "By Theodore Roosevelt",
        "Description": "",
        "Category": "",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "32.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1910"
        }
    },
    {
        "Title": "The Hundred Secret Senses",
        "Authors": "By Tan, Amy",
        "Description": "",
        "Category": "",
        "Publisher": "Putnams",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Rudy Giuliani: Emperor of the City",
        "Authors": "By Kirtzman, Andrew",
        "Description": "For three surreal weeks in the spring of 2000, Rudy Giuliani held the nation in suspense as he agonized over whether to continue in the race for the U.S. Senate against Hillary Clinton.  He'd been diagnosed with cancer; his marriage was crumbling amid reports of an extramarital affair; his wife tearfully lashed out at him in public.  It was an excruciating private crisis played out before a national audience, and by the time Giuliani finally announced his decision in an extraordinary public performance, the world was again captivated by the drama centering around this unusual man.This is the story of Rudy Giuliani's rise to power, from the moment he and a small squad of ex-prosecutors set out to capture New York City's mayoralty in 1989 to the dramatic turning point in his race against the First Lady of the United States.When Giuliani took over as mayor in 1994, New York was slowly sinking into an abyss of deteriorating living conditions:  It was the crime capital of the country, described by Time magazine as \"The Rotting Apple\"; it was filthy and dangerous, its streets and terminals overtaken by armies of homeless people.  The city was teetering on the edge of bankruptcy again.  Polls showed most New Yorkers wanted out.The public would soon get a taste of Giuliani's style.  Each week brought a new brawl, with the new mayor egging his adversaries on.  He threw Yasir Arafat out of Lincoln Center and sparked an international incident; he tried to evict the Brooklyn Museum after its directors staged an exhibition he deemed sacrilegious; he battled the Mafia, liberals, and leaders of his own party.  The mayor snarled at the very mention of his critics -- and their numbers seemed to grow by the hour.Some viewed him as a savior; others called him a tyrant.  But by the force of his will and little more, this man with no experience in municipal government ended up changing the face of his city.In this riveting portrait of his mayoralty, Andrew Kirtzman tells the story of Giuliani's zealous crusade to clean up, control, and shape New York City.  Based on interviews with more than two hundred of the mayor's closest aides and fiercest adversaries -- and the author's own experience covering him for eight years -- Rudy Giuliani:  Emperor of the City tells the behind-the-scenes story of his reign.Is Rudy Giuliani a hero, a danger, or both?  What's it worth to be led by a strong man?  How much power are we willing to give one person?  Rudy Giuliani: Emperor of the City offers some answers as it tells the tale of one man's historic rise -- in all its dramatic, outrageous, and ultimately poignant detail.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "WilliamMr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "British Dramatists from Dryden to Sheridan",
        "Authors": "By Nettleton, George Henry (EDT)",
        "Description": "Representative selections from Restoration and eighteenth-century drama, comedy, satire, tragedy, and farce are prefaced by descriptions of the theaters, acting styles, methods of play production, and audiences",
        "Category": " Performing Arts , Theater , Playwriting",
        "Publisher": "Southern Illinois University Press",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1975"
        }
    },
    {
        "Title": "The Compact History of the Catholic Church",
        "Authors": "By Schreck, Alan",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Servant Publications",
        "Price Starting With ($)": "14.95",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Lady on the hunt",
        "Authors": "By Calkins, Clinch",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "17.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Friends, Colleagues, and Neighbors: Jewish Contributions to American History",
        "Authors": "By Rausch, David A.",
        "Description": "Friends, Colleagues, and Neighbors is a tribute to American Jewish contributions in the history of the United States as well as a reflection of the author's personal journey along the path of knowledge and understanding. While neither attempting to glorify American Jews nor to have them appear smarter than other peoples, Rausch as a Gentile Christian takes a professional historical look at the significant contributions that the Jewish people have made that are integral to everyday life but have largely gone unnoticed in an age when peoplehoods are acknowledged and thanked.In a timely and thorough analysis, Friends, Colleagues, and Neighbors examines the history of famous men and women many Americans may not realize are from Jewish backgrounds. In addition, the book presents American Jews who are making an impact on the nation while remaining virtually unknown to the general public. Covering contributions of national import and civic responsibility, military service and philanthropy, scientific impact and medical breakthroughs, entertainment and commerce, Friends, Colleagues, and Neighbors is full of surprises and interesting details. Provocative and enlightening, the book underscores a diverse and dynamic peoplehood that has enhanced the culture, life, and livelihood of the United States.",
        "Category": " History , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Talent and Genius: The Fictitious Case of Tausk contra Freud.",
        "Authors": "By Eissler, K. R.",
        "Description": "",
        "Category": "",
        "Publisher": "Quadrangle Books",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Good Day for a Picnic: Simple Food That Travels Well",
        "Authors": "By Jackson, Jeremy",
        "Description": "Bored with traditional picnic fare? Coleslaw?Potato salad?  Soggy sandwiches? In Good Day for a Picnic, Jeremy Jackson offers up a collection of new recipe ideas for the park and the patio, the backyard and the beach, and beyond.This is not a book of \"classics\" -- after all, who needs another fried-chicken recipe? It's a fresh, flavorful (and funny) look at picnics. The 120 recipes include everything from drinks and starters to sandwiches, entrées, and desserts. There's Ginger Iced Tea and Fig Pâté, Lamb Pita Meze and Noodles with Walnut and Blue Cheese Pesto, Sour Cherry Mini-Crumbles and Strawberry Cupcakes. The dishes are simple, wholesome, and quick to prepare, with lots of make-aheads and tips on food transport.In Good Day for a Picnic, Jeremy Jackson gives dining alfresco the attention it deserves.  So whether you've found a sunny spot of grass or a cozy patch of carpet, it's time to spread out the food and dig in!",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Memories of the Ford Administration",
        "Authors": "By Updike, John",
        "Description": "Alfred Clayton, the hero of John Updike's fifteenth novel, has received a request from the Northern New England Association of American Historians for his memories and impressions of the Gerald Ford Administration (1974-77). \"Alf\" obliges with his memories of a turbulent period in his personal history, as well as pages of an unpublished book he was writing at the time, on the life of James Buchanan, the fifteenth President of the United States (1857-61). The alternating texts body forth an arresting contrast between the life-styles and social dictions of two American centuries. The contemporary characters include Clayton's wife, Norma, whom he thinks of as the Queen of Disorder, and his mistress, Genevieve Mueller, whom he thinks of as the Perfect Wife, as well as his various colleagues on the faculty of Wayward College in New Hampshire. The characters around Buchanan include his doomed fiancee, Ann Coleman, and such eloquent contemporary politicians as Andrew Jackson, Edwin Stanton, and (in his capacity as American Consul in Liverpool) Nathaniel Hawthorne. All come unsettlingly to life in Clayton's wide-ranging confessions, which bring us down to the year 1991.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The First Circus: Platt & Munk Co. No. 3100-C",
        "Authors": "By Platt & Munk Company",
        "Description": "",
        "Category": "",
        "Publisher": "The Platt & Munk Co., Inc.",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1932"
        }
    },
    {
        "Title": "John F. Kennedy: a sense of purpose",
        "Authors": "By Markmann, Charles Lam",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "No Excuses: One Man's Incredible Rise Through the NFL to Head Coach of Notre Dame",
        "Authors": "By Weis, Charlie and Carucci, Vic",
        "Description": "Weis was taught football by some of the best minds in the game: Bill Parcells and Bill Belichick. Parcells would give him a life-defining break in 1990 by hiring him as an assistant on the New York Giants staff. For a Jersey guy who loved sports, this was a dream come true, especially when Weis won his first championship in his debut year in the NFL. He'd always wanted to be a sports announcer—the next Marv Albert—but he'd caught the coaching bug and was now in a position to learn from the best. And he did, following Parcells to the New England Patriots and then to the New York Jets. Under enormous pressure and exacting standards, Weis flourished and later became offensive coordinator.When Parcells stepped down as coach of the Jets, Weis joined his colleague and friend Bill Belichick, who was the newly named Patriots head coach. Together they would thrive, building a storied franchise, a rare modern-day dynasty that won three Super Bowls in four years. Through it all, Weis designed offensive schemes that would befuddle even the best defenses in the NFL, and he coached a number of players to greatness, including Pro Bowlers Ben Coates, Curtis Martin, and, of course, Tom Brady.The chance of a lifetime arrived in December of 2004: Weis was offered the opportunity to lead one of the most prestigious football schools in the country, Notre Dame—home of coaching legends Knute Rockne, Frank Leahy, Ara Parseghian, Dan Devine, and Lou Holtz. And so began a new chapter in Weis's career. Weis took over a program in dire need of direction, and now he is in the process of building his own legacy with his unique vision.Off the field, Weis faced his other challenges. Seeking to improve his health and lose weight, he decided to get gastric bypass surgery. What he thought would be a routine procedure turned into a nightmare as he nearly bled to death, lapsed into a coma, and was read the last rites. It was a horrifying experience, yet he battled back in inspiring fashion and still demands nothing less of himself despite the long-lasting aftereffects.He has had his joys, too. Weis considers his wife, Maura, his best friend. They have two beautiful children: Charlie, his \"best buddy,\" and Hannah, who he and his wife consider their \"guiding angel.\" Hannah is developmentally delayed and has been the inspiration leading to the establishment of Hannah and Friends, a nonprofit foundation seeking to improve the quality of life for people with special needs. No Excuses is not only illuminating and insightful, it is an extraordinary look inside one of football's greatest minds who has helped shape today's game.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "It Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Odd Girl Out: The Hidden Culture of Aggression in Girls",
        "Authors": "By Simmons, Rachel",
        "Description": "When boys act out, get into fights, or become physically aggressive, we can't avoid noticing their bad behavior. But it is easy to miss the subtle signs of aggression in girls--the dirty looks, the taunting notes, or the exclusion from the group-that send girls home crying. In Odd Girl Out, Rachel Simmons focuses on these interactions and provides language for the indirect aggression that runs through the lives and friendships of girls. These exchanges take place within intimate circles--the importance of friends and the fear of losing them is key. Without the cultural consent to express their anger or to resolve their conflicts, girls express their aggression in covert but damaging ways. Every generation of women can tell stories of being bullied, but Odd Girl Out explores and explains these experiences for the first time.Journalist Rachel Simmons sheds light on destructive patterns that need our attention. With advice for girls, parents, teachers, and even school administrators, Odd Girl Out is a groundbreaking work that every woman will agree is long overdue.",
        "Category": " Psychology , Developmental , Adolescent",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Incredible Journey Through the Human Body",
        "Authors": "By Nicholas Harris",
        "Description": "",
        "Category": "",
        "Publisher": "orpheus books ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "I Shouldn't Even Be Doing This!: And Other Things that Strike Me as Funny",
        "Authors": "By Newhart, Bob",
        "Description": "The first book ever from an icon of American comedy--a hilarious combination of stories from his career and observations about lifeThat stammer. Those basset-hound eyes. That bone-dry wit. There has never been another comedian like Bob Newhart. His comedy albums, movies, and two hit television series have made him a national treasure and placed him firmly in the pantheon of comedy legends. Who else has a drinking game named after him And now, at last, Newhart puts his brilliant and hysterical world view on paper.Never a punch-line comic, always more of a storyteller, he tells anecdotes from throughout his life and career, including his beginnings as an accountant and the groundbreaking success of his comedy albums and The Bob Newhart Show and Newhart, which gave him fifteen years on primetime television. And he also gives his wry, comedic twist to a multitude of topics, including golf, drinking, and family holidays.Today, Newhart appears on Desperate Housewives, in hit movies such as Elf, and in theaters around the country. Reruns of his shows air constantly on Nick at Nite--have recently been released with great success for the first time ever on DVD. With this book, Bob Newhart gives his millions of fans a first ever opportunity to sample his unique brand of humor--including excerpts from some of his classic routines--on the printed page.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Diaries, 1949-1959",
        "Authors": "By Pearson, Drew",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Civil Procedure (The Little, Brown examples and explanations series)",
        "Authors": "By Glannon, Joseph W.",
        "Description": "",
        "Category": " Law , Civil Procedure",
        "Publisher": "Little Brown & Co Law & Business",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "My Story (And I'm Sticking to It)",
        "Authors": "By Hawkins, Alex",
        "Description": "",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "Algonquin Books of Chapel Hill",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Visual C++ 6 from the Ground Up",
        "Authors": "By Mueller, John",
        "Description": "",
        "Category": " Computers , Programming Languages , C++",
        "Publisher": "McGraw-Hill Osborne Media",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Leveling the Field: An Encyclopedia of Baseball's All-Time Great Performances as Revealed Through Scientifically Adjusted Statistics",
        "Authors": "By Thomas, G. Scott",
        "Description": "Who are the all-time greatest and why? This groundbreaking new method for ranking players and teams rewrites the record books and sets forth bold new answers to the age-old debates of baseball.  It is nothing less than a revolution in baseball statistics. G. Scott Thomas has developed a series of mathematically precise, computer-generated formulas that adjust the statistics of every team. The results \"level the field,\" creating a fair basis of comparison among generations of players-and the new picture that emerges is staggering. Here are just a few of the book's conclusions:  - Babe Ruth hit ninety-four home runs in a single season, shattering Bonds' record (Maris, McGwire, and Bonds don't even make the list).  - Pete Rose has still played more games than anyone in baseball history.  - Ricky Henderson never really broke Ty Cobb's record of runs scored.  - Cy Young holds the record for most wins (and most losses) of any pitcher.  - Lou Gehrig made the equivalent of $48,300,000 in 1931.Leveling the Field adjusts the statistics in all the major categories in which fans make comparisons, including the best performances, the best players, the best teams and adjusted career stats for 254 hitters and 177 pitchers. Thomas even assembles his twenty-six-man \"dream team\" of the sport's greatest players since 1901, and takes them through a simulated 162-game season.  Easy to follow and use, this book is sure to become a must-have for every die-hard baseball fan, and will undoubtedly change the nature of baseball debate forever.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Biology",
        "Authors": "By Johnson, George B. and Raven, Peter H.",
        "Description": "",
        "Category": "",
        "Publisher": "William C Brown Pub",
        "Price Starting With ($)": "10.13",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Inkspell",
        "Authors": "By Bell, Anthea and Funke, Cornelia Caroline",
        "Description": "The captivating sequel to INKHEART, the critically acclaimed, international bestseller by Cornelia Funke, an author who is emerging as a truly modern classic writer for children.Although a year has passed, not a day goes by without Meggie thinking of INKHEART, the book whose characters became real. But for Dustfinger, the fire-eater brought into being from words, the need to return to the tale has become desperate. When he finds a crooked storyteller with the ability to read him back, Dustfinger leaves behind his young apprentice Farid and plunges into the medieval world of his past. Distraught, Farid goes in search of Meggie, and before long, both are caught inside the book, too. But the story is threatening to evolve in ways neither of them could ever have imagined.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "The Chicken House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Prize: The Epic Quest for Oil, Money and Power",
        "Authors": "By Yergin, Daniel",
        "Description": "Follows the historic role of oil from the first oil well in Pennsylvania to the aftermath of the Persian Gulf War and comments on how the natural resource shaped the entire world economy and international politics in the last century",
        "Category": "",
        "Publisher": "Simom and Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "449 Stupid Things Republicans Have Said",
        "Authors": "By Rueter, Theodore",
        "Description": "Am I different? Yeah. Deep down, you know you want to wear wider bottoms; you're just not secure enough. . . . Do I do my hair with a weed whacker? I admit it. --Rep. James Traficant (D-Ohio, 1985-2002)Supposedly some of our brightest speakers, politicians say some pretty stupid things. Members of America's major political parties put out a roaring stream of downright dumb comments, pronouncements, and observations. For proof, look no further than Ted Rueter's 449 Stupid Things Republicans Have Said.449 Stupid Things Republicans Have Said includes subjects ranging from cloning and federal spending to foreign affairs and kissing. Asked what he and former British Prime Minister Tony Blair have in common, President George W. Bush remarked, Well, we both use Colgate toothpaste. According to then-Treasury Secretary Paul O'Neill, If you set aside Three Mile Island and Chernobyl, the safety record of nuclear energy is really very good.; Rueter catches the best of the best, whether the gaffes came from Bob Dole, Trent Lott, Arnold Schwarzenegger, or Strom Thurmond.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Zelda and Ivy: The Runaways: Candlewick Sparks",
        "Authors": "By Kvasnosky, Laura McGee and Kvasnosky, Laura McGee (ILT)",
        "Description": "Laura McGee Kvasnosky's newest trio of stories is an entertaining and genuine look at the ups and downs of sisterhood.\"You go, girls! . . . Three satisfying stories of two sisters create one rewarding read.\"  — THE HORN BOOK (starred review)The fabulous fox sisters return in three fresh, funny stories. This time around, Zelda and Ivy combat the injustice of cucumber sandwiches for lunch, decide what to leave the children of the future in their time capsule, and attempt to solve Zelda’s writer’s block, all to the amusement of both new and returning fans.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Madeline and the Gypsies",
        "Authors": "By Bemelmans, Ludwig",
        "Description": "Pepito, son of the Spanish ambassador, and Madeline, rescued by gypsies during a storm, travel and perform with their wandering friends until they again find Miss Clavel.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "7.01",
        "Publish Date": {
            "Month": "October",
            "Year": "1977"
        }
    },
    {
        "Title": "My Baptism Book",
        "Authors": "By Piper, Sophie and Kolanovic, Dubravka (ILT)",
        "Description": "Need a gift for a Baptism? This delightful keepsake may be the gift-of-choice for children baptized this Easter, and for kids on the occasion of First Communion, as a profound but simple way to remind them of the meaning of Baptism. My Baptism Book includes prayers that are easy to commit to memory and to say at bedtime, along with very simply expressed statements of Christian belief that are appropriate for the youngest of children. The message of My Baptism Book is one of God’s eternal love and care. For ages 0-8.",
        "Category": " Juvenile Nonfiction , Religious , Christian , Devotional & Prayer",
        "Publisher": "Paraclete Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Dragon Sword: Danger Boy Episode 2",
        "Authors": "By Williams, Mark London",
        "Description": "\"Set in 2019, this pulse-quickening series follows time traveler Eli Sands. . . . DRAGON SWORD teams him with King Arthur and Merlin.\"  — FAMILYFUNEli Sands is an ordinary kid with an extraordinary talent: the ability to travel through time. On his second adventure, he winds up in San Francisco at the start of World War II, where he’s thrilled to find his missing mother. Unfortunately, Margarite Sands is deeply involved in some dangerous intrigue of her own, and Eli and his cohorts are soon hurled far into the past, where they find new allies in the legendary King Arthur and Merlin. This second episode in a rich, action-filled fantasy series about a reluctant time-traveler and his unusual sidekicks is sure to keep readers on the edge of their seats.",
        "Category": " Juvenile Fiction , Science Fiction",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Windhorse Woman: A Marriage of Spirit",
        "Authors": "By Andrews, Lynn V.",
        "Description": "In Windhorse Woman, Lynn Andrews' spirit marriage to Windhorse marks the end of the journey she began in Medicine Woman, the story of her search for a marriage basket.",
        "Category": " Body, Mind & Spirit , Shamanism",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Merry Adventures of Robin Hood",
        "Authors": "By Pyle, Howard and Kestel, Deborah (ADP)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Antiques & Collectibles",
        "Publisher": "Baronet Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "American Painting Of The 19th Century: Realism, Idealism, And The American Experience, Second Edition",
        "Authors": "By Novak, Barbara",
        "Description": "This brilliant study of American art is again available with a new preface by the author, a few corrections in the text, and a revised and updated bibliography. Widely acclaimed for its perception and scholarship, the book concentrates on a number of leading artists, including Washington Allston, Thomas Cole, Asher B. Durand, Fitz Hugh Lane, William Sidney Mount, Winslow Homer, Thomas Eakins, and Albert Pinkham Ryder. Examining each artist in an individual essay, Barbara Novak presents key ideas on the nature of American art of the nineteenth century, framing these ideas with reference to the eighteenth and twentieth centuries and relating American art to American and European traditions. She draws provocative and original conclusions about the roles in American art of spiritualism and mathematics, analyzes not only the painting but nineteenth-century aesthetic theory as well, achieving a unique synthesis of art and literature. Brief biographies of forty-eight artists mentioned in the text are appended and furnish a valuable reference source.",
        "Category": " Art , American , General",
        "Publisher": "Westview Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "The Green Lifestyle Handbook",
        "Authors": "By Rifkin, Jeremy",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Holt & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "S/S/T and Sonic Boom Handbook",
        "Authors": "By Shurcliff, William A",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The De'Medici Kitchen (PBS Series)",
        "Authors": "By De' Medici Stucchi, Lorenza",
        "Description": "Contains a collection of recipes taken from the television show for first, middle, and main courses, vegetables, and desserts, and with illustrations and instructions when needed",
        "Category": " Cooking , General",
        "Publisher": "Collins Pub San Francisco",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The English Roses",
        "Authors": "By Madonna and Fulvimari, Jeffrey (ILT)",
        "Description": "The English Roses is a story of rivalry and friendship among schoolgirls in contemporary London. Four little girlsNicole, Amy, Charlotte, and Graceare eleven years old and the very best of friends. They have sleepovers, picnics and ice-skating parties that exclude Binah, a beautiful girl whose seemingly perfect life makes them \"green with envy.\" However, when a feisty, pumpernickel-loving fairy godmother takes them on a magical journey, they learn to their great surprise that Binah's life is not nearly as enviable as it had seemed. The English Roses is an inspiring story about the importance of compassion and the rewards of friendship.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Callaway Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Inside the Vatican",
        "Authors": "By McDowell, Bart and Stanfield, James L. (PHT)",
        "Description": "For almost a year, veteran National Geographic photographer Jim Stanfield captured nearly every corner of the Vatican, both the world’s smallest country and the center of the Roman Catholic Church. Along with author Bart McDowell, he provides an insider’s view into the history of this 108.7-acre enclave, from the first St. Peter’s, built in the fourth century, through the amazing reign of Pope John Paul II, and beyond. Rarely seen areas of the complex, such as the Pope’s personal quarters and the world-renowned libraries, and up-close views of the stunning and priceless art and architecture provide an unrivaled insider’s look into this amazing nation.In this revised trade paperback edition, Washington Post writer Howard Schneider brings the story of the Vatican up-to-date, including the death and funeral of Pope John Paul II and the selection and ordination of Pope Benedict XVI. Pope Benedict XVI’s recent trip to the United States is also documented in poignant words and images.",
        "Category": " Religion , History",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "The Heidi Chronicles: Uncommon Women and Others & Isn't It Romantic",
        "Authors": "By Wasserstein, Wendy",
        "Description": "The graduating seniors of a Seven Sisters college, trying to decide whether to pattern  themselves after Katharine Hepburn or Emily Dickinson. Two young women besieged by  the demands of mothers, lovers, and careers—not to mention a highly persistent telephone  answering machine—as they struggle to have it all. A brilliant feminist art historian  trying to keep her bearings and her sense of humor on the elevator ride from the  radical sixties to the heartless eighties.Wendy Wasserstein's characters are so  funny, so many-sided, and so real that we seem to know them from their Scene One  entrances, though the places they go are invariably surprising. And these three plays—Uncommon  Women and Others, Isn't It Romantic, and the Pulitzer Prize-winning The Heidi Chronicles—manage  to engage us heart, mind, and soul on such a deep and lasting level that they are  already recognized as classics of the modern theater.",
        "Category": " Drama , Women Authors",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Cleek's Government Cases",
        "Authors": "By Hanshew, Thomas W",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday, Page & Co.",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1917"
        }
    },
    {
        "Title": "Only a dog;: A story of the great war,",
        "Authors": "By Bertha Whitridge Smith",
        "Description": "",
        "Category": "",
        "Publisher": "E.P. Dutton",
        "Price Starting With ($)": "39.57",
        "Publish Date": {
            "Month": "January",
            "Year": "1917"
        }
    },
    {
        "Title": "James Beard's New Fish Cookery",
        "Authors": "By Cornelisen, Ann",
        "Description": "",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Important to me",
        "Authors": "By Johnson, Pamela Hansford",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Ranch: Portrait of a Surviving Dream",
        "Authors": "By Johnston, Moira and Witney, Dudley",
        "Description": "Presents a photographic portrait of ranches throughout North America",
        "Category": " Photography , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.96",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Great Ideas And Theories Of Modern Cosmology",
        "Authors": "By Singh, Jagjit",
        "Description": "",
        "Category": "",
        "Publisher": "Dover Publications Inc.",
        "Price Starting With ($)": "12.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Treacherous Journey : My Escape From Ethiopia",
        "Authors": "By Avraham, Shmuel and Kushner, Arlene",
        "Description": "",
        "Category": "",
        "Publisher": "Shapolsky Pub",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Chronic Fatigue, Fibromyalgia and Environmental Illness: An Alternative Medicine Guide",
        "Authors": "By Goldberg, Burton",
        "Description": "",
        "Category": " Medical , Alternative Medicine",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Network Protocol Handbook",
        "Authors": "By Naugle, Matthew G.",
        "Description": "Delivers detailed information on the most commonly used protocols implemented on today's LANs and WANs, and covers the theories and practicalities for network protocol stacks as well. The format is one-chapter-per-protocol, each chapter introducing a specific protocol and then explaining its subsets and covering key implementation issues. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Reference , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "23.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Not War but Murder: Cold Harbor 1864",
        "Authors": "By Furgurson, Ernest B.",
        "Description": "The battle of Cold Harbor was the most brutal defeat suffered by the Union army under their newly appointed commander Lieutenant General U.S. Grant. It was also, argues journalist Furgurson, the point at which the Civil War turned from a war of maneuver into a war of siege and from attack and defense tactics to digging and trench warfare. He discusses the strategies and tactics of both sides for the duration of the campaign. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , Military , Other",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Wagon Road",
        "Authors": "By Turney, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "Jack Turney",
        "Price Starting With ($)": "10.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Slim to Shore (Ships to Shore Cookbooks)",
        "Authors": "By Robinson, Jan",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Ship to Shore",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Future Search",
        "Authors": "By Weisbord, Marvin Ross and Janoff, Sandra",
        "Description": "Future Search is among the best-established and most effective methods for enabling people to make and implement ambitious plans. It has been used to redesign IKEA’s product pipeline in Sweden, develop an integrated economic development plan in Northern Ireland, and demobilize child soldiers in Southern Sudan. Written by the originators, this book is the most up-to-date account of this powerful change method. This third edition is completely revised, reorganized, and updated with nine new chapters. It contains new cases and examples, advice on combining Future Search with other methods, and a summary of formal research studies. The chapters on facilitating diversity provide a theory, philosophy, and method for working with any task group. Marvin Weisbord and Sandra Janoff offer specific guidance for Future Search sponsors, steering committees, participants, and facilitators and new ideas for sustaining action after the Future Search ends. They’ve added striking evidence of Future Search’s efficacy over time, examples of its economic benefits, guidelines for making Future Searches green, and much more. They include a wealth of resources—handouts, sample client workbooks, follow-up methods, and other practical tools. If you want to do strategic planning, product innovation, quality improvement, organizational restructuring, mergers, or any other major change requiring stakeholder engagement, this book is your guide.",
        "Category": " Business & Economics , Business Communication , Meetings & Presentations",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    }
]