[
    {
        "Title": "A Texas Legacy Christmas (Texas Legacy Series #4)",
        "Authors": "By Mills, DiAnn",
        "Description": "Zack Kahler heads back to Texas with a homeless eight-year-old pickpocket named Curly in tow. But soon Zack finds his hands full as he tries to run a newspaper, recover from a lost love, and keep his unruly charge out of trouble. Boardinghouse worker and life-long outcast Alice Hawkins has had her fair share of hurt and rejection. When Zack and Curly show up on her doorstep, more than one wounded heart is stirred with love. But soon a life-threatening illness and misunderstanding threaten to destroy all their hopes. Can the love of Christmas present a miracle to heal these Texan hearts? A Texas Legacy Christmas is part of the Texas Legacy series. Other books in the series include Leather and Lace: Book 1, Lanterns and Lace: Book 2, Lightning and Lace: Book3.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Publishing, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Encyclopedia of Guitar Picture Chords in Color",
        "Authors": "By Randall Wall Mark Bridges (Illustrator)",
        "Description": "",
        "Category": "",
        "Publisher": "Hal Leonard Corporation",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "No Grown-Ups Allowed (The Cul-de-Sac Kids #4)",
        "Authors": "By Lewis, Beverly and Birch, Barbara (ILT)",
        "Description": "Jason takes advantage of his parents' absence to sneak forbidden chocolates behind his babysitting grandmother's back, but a Bible verse and a talk with God help him understand the importance of good behavior",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Getting the Most from Your Scrapbook Tools",
        "Authors": "By Memory Makers",
        "Description": "Stencils. Templates. Decorative scissors. Punches. Craft knives. You've got the tools; Memory Makers has the tips and techniques for making the most of your investment in Getting the Most From Your Scrapbook Tools. Inside you'll find cutting-edge concepts for less-obvious and more innovative uses for popular tools you already own. This volume of outstanding pages is sure to jump-start your creativity, and is a must-have for scrapbookers who want to get the most bang for their buck.Here's a glimpse of what you'll find:Dozens of why-didn't-I-think-of-that ideas for tool usage developed by tool manufacturers, professional artists and scrapbookers like youIllustrated step-by-step instructions for alternative uses for stencils, templates, decorative rulers, cutting tools and punchesMore than one hundred beautiful scrapbook pages featuring the latest and greatest techniquesTips for proper tool maintenance and storageChallenge yourself to discover the wide and wonderful possibilities when you set out to squeeze the most from the tools in your scrapbooking arsenal. Getting the Most From Your Scrapbook Tools will lead the way.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Memory Makers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Idea Book for Scrapbooking",
        "Authors": "By Haglond, Jill and Tweety Jill Publications",
        "Description": "",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Tweety Jill Pubns",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Warning Label Book: Warning: Reading This Book May Cause Spontaneous, Uncontrollable Laughter",
        "Authors": "By Green, Joey, Nyberg, Tim, and X, Tony",
        "Description": "Warnings-they're everywhere.On toys. On hair dryers. On compact discs. On take-out coffee cups. Almost everything for sale today comes with a warning. Why? Now, most people have enough common sense not to take a bath with an electric blender, but thanks to a few morons out there who sued big companies and won huge settlements, products now come with warnings that treat consumers like a bunch of slack-jawed yokels.  So here's a collection of more than a hundred of the most ridiculous real warning labels on today's products.  For example:CAUTION: DO NOT ON USE THIS HAMMER TO STRIKE ANY SOLID OBJECT.Such as, perhaps, the head of the idiot who came up with this warning in the first place?In addition, the book includes two dozen hilarious peel-off fake warning labels you can stick on real products to keep you, your friends, and your loved ones safe.  Just don't read this book while driving a car or operating heavy machinery.",
        "Category": " Humor , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Knowledge Network",
        "Authors": "By Smart, Brian Hunter (EDT) and Whittaker, Bibby (EDT)",
        "Description": "A collection of interesting facts about topics such as fish courtship, snowboarding trickery, black holes, and the genius of Bach.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "Copper Beech",
        "Price Starting With ($)": "7.45",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Lives of a Bengal Lancer",
        "Authors": "By Yeats-Brown, Francis Charles Claypon",
        "Description": "",
        "Category": "",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "34.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1930"
        }
    },
    {
        "Title": "Captain's Purr",
        "Authors": "By Floyd, Madeleine",
        "Description": "Captain is a very handsome cat who lives his quiet cat life in a lovely house by the river. He does all the ordinary sorts of cat things that other cats do--like eating and sleeping and washing and purring. But Captain also has a secret. . . .  Lush watercolor illustrations and a lyrical text are certain to enchant readers and cat lovers young and old in this classic--yet unexpectedly fresh--picture book.",
        "Category": " Juvenile Fiction , Animals , Cats",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Incredible Water Show",
        "Authors": "By Frasier, Debra",
        "Description": "The kids from Debra Frasier's Miss Alaineus: A Vocabulary Disaster are back! This time they're putting on a neighborhood play starring the world's most astounding combination of atoms--H20! Filled to the brim with scientifically accurate facts about water and water conservation, here is one wet-and-wild celebration you won't want to miss.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "How to Paint Trees, Flowers and Foliage",
        "Authors": "By Seligman, Patricia",
        "Description": "",
        "Category": " Art , Techniques , Painting",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Alwyn Crawshaw Paints Oils",
        "Authors": "By Crawshaw, Alwyn",
        "Description": "",
        "Category": " Art , Techniques , Painting",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Oregon: Picture Memory",
        "Authors": "By Harris, Bill",
        "Description": "Presents the variety and splendor of Oregon, including wilderness areas, the countryside, the cities, and the seacoast",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Vanishing Wilderness: America's Last Wild Places",
        "Authors": "By Kraulis, J. A.",
        "Description": "",
        "Category": "",
        "Publisher": "Bbs Pub Corp",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Spies Revealed",
        "Authors": "By Gifford, Clive",
        "Description": "Spies Revealed uncovers the fascinating truth about real-life secret agents and the top-secret organizations they work for. From spymasters to moles, defectors to double agents, and sleepers to disguise experts, you'll discover who's who in espionage. See how real spies measure up to fictional secret agents. Read about secret codes and ciphers, cunning spy techniques, dead drops and special spy equipment. You can even become a spy yourself by following special missions that show you essential spy skills, including how to talk like a spy, how to track a target without being detected, and how to send secret messages.   From history's most famous spies to the future of spy technology - including robo-spies and cyborg counterespionage - this fact-packed book is the ultimate guide to the mysterious world of spying.",
        "Category": " Juvenile Nonfiction , History , Military & Wars",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Attack on Pearl Harbor: An Interactive History Adventure (You Choose: History)",
        "Authors": "By Lassieur, Allison",
        "Description": "\"Describes the attack on Pearl Harbor on December 7, 1941, as Japanese forces surprised Americans at the U.S. military base, and explains the significance of the attack today. The reader's choices reveal the historical details from the perspective of a Ja panese pilot, a U.S. sailor, and an American nurse\"--Provided by publisher.",
        "Category": " Juvenile Nonfiction , History , General",
        "Publisher": "Capstone Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "A Creative Step-by-step guide to Fruit and Vegetables",
        "Authors": "By Blackburn-Maze, Peter, and Neil Sutherland",
        "Description": "",
        "Category": "",
        "Publisher": "Coombe Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Fast Facts About the 50 States: Plus Puerto Rico and Washington, D.C. (America the Beautiful)",
        "Authors": "By Rozett, Louise (EDT)",
        "Description": "A quick reference to the United States provides ten fascinating facts about each state--covering the weird and wacky, strange and unusual tidbits about weather, people, history, geography and more--along with full-color maps and historic photographs. Original.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Geography",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Symbols of America: A Lavish Celebration of America's Best Loved Trademarks and the Products They Symbolize, Their History, Folklore, and Enduring Mystique",
        "Authors": "By Morgan, Hal",
        "Description": "",
        "Category": " Design , General",
        "Publisher": "Viking Penguin",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Small Arms From the Civil War to the Present Day",
        "Authors": "By Dougherty, Martin J.",
        "Description": "",
        "Category": "",
        "Publisher": "Amber Books Ltd",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Mickey's Magnet",
        "Authors": "By branley, franklyn",
        "Description": "",
        "Category": "",
        "Publisher": "Crowell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Hershey's Best-Loved Recipes",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hershey Foods Corporation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Attitude Measurement",
        "Authors": "By gene summers",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Asleep at Last (Jamie & Luke)",
        "Authors": "By Lipniacka, Ewa and Bogdanowicz, Basia (ILT)",
        "Description": "After a busy day, Mom wonders why it is taking Daddy so long to put Jamie and Luke to bed.",
        "Category": "",
        "Publisher": "Crocodile Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Pleas Chinese Ckg",
        "Authors": "By G chu",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "6.7",
        "Publish Date": {
            "Month": "April",
            "Year": "1969"
        }
    },
    {
        "Title": "You Can't Be President: The Outrageous Barriers to Democracy in America",
        "Authors": "By MacArthur, John R.",
        "Description": "\"This book lays bare the malfunctions of our democracy and the solutions in a superb literary style and a convincing manner.\" George McGovern, Democratic candidate for President, 1972It seems like an historic election: A woman almost won the nomination to run for President of the United states—losing to an African-American, who will run against the oldest candidate ever! It’s the realization of one of the core beliefs of our democracy: Anyone can be president.Or is it? What if a close analysis showed that the candidates were, for the most part, getting their financing from the same corporations and lobbyists … that they all went to the same schools … that their votes were remarkably similarly on most issues …?In a rollicking piece of journalism based on years of reporting, John R. MacArthur, the publisher of Harper’s Magazine, talks to truly independent candidates—including the first ever post-election interview of Joe Lieberman nemesis Ned Lamont—about what they were up against. He gives the most detailed breakdown yet of campaign financing sources. He analyzes the parameters of the two party system, what the Constitution has to say about that, and how the media treats independent politicians. And he also discusses how all this influences issues of local democracy.It’s an edgy, fascinating look at the system that’s a must-read to understand whether the most historic election in American history is really going to be about change … or not.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Melville House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Paris Chic & Trendy: Designers' Studios, Hip Boutiques, Vintage Shops",
        "Authors": "By Ribes-tiphaine, Adrienne and Alouf, Sandrine (PHT)",
        "Description": "How do those French women manage to look sophisticated, casual, and unique? It may be in the water, it may be in the gene pool . . . or they may have a copy of Paris Chic & Trendy, a savvy guide that describes fifty-four of the best boutiques, designers’ studios, and vintage stores in the French capital. Some are small studio-shops run by up-and-coming designers, featuring only their own work (and maybe that of a few creative friends). Other stores showcase a sophisticated edit of pieces from seasoned designers who supply French fashionistas with must-have items every season (think Jasmin Puech handbags, Agnes B. striped T-shirts, Repetto ballet flats). The pages of this pocket-size guide are overflowing with colorful photos of each shop and their merchandise: jewelry, lingerie, shoes, handbags, separates, dresses, sweater sets, stilettos and boots, trench coats, and LBDs: It’s all inParis Chic & Trendy, the go-to guide to find the most stylish shops in the most stylish city.",
        "Category": " Travel , Europe , France",
        "Publisher": "Little Bookroom",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Outdoor Navigation With GPS: Hiking, Geocaching, Canoeing, Kayaking, Fishing, Outdoor Photography, Backpacking, Mountain Biking",
        "Authors": "By Hinch, Stephen W.",
        "Description": "Whether you’re hiking, fishing, kayaking, cross-country skiing, or taking a mountain bike ride in the backcountry, a GPS receiver can help you reach your destination and return safely&#151;but only if you know how to use it! This is the most complete, easy-to-use GPS book available, is your guide to getting the most out of a receiver, from basic consumer advice to advanced techniques. Starting with essential definitions such as UTM coordinate systems, position formats, and map datums, and moving on to creating &#147;waypoints,” and using your GPS with a computer, long-time GPS instructor Stephen W. Hinch breaks down the jargon and teaches you what you really need to know. Includes illustrative screenshots using current popular receivers.",
        "Category": " Sports & Recreation , Equipment & Supplies",
        "Publisher": "Wilderness Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Nate the Great and the Lost List",
        "Authors": "By Sharmat, Marjorie Weinman",
        "Description": "These chapter books introduce beginning readers to the detective mystery genre. Perfect for the Common Core, kids can problem-solve with Nate, using logical thinking to solve mysteries! Although Nate the Great and his dog, Sludge, are on vacation, they just can't resist  a new case.  When his friend Claude's grocery list is lost, Nate sets out to find  it before lunch. But lunch draws nearer and the list is still missing.  Nate the  Great is worried: his reputation is at stake.  It looks as if list has vanished--unless  Rosamond's strange cat pancakes are somehow at the heart of the mystery.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "The Sunken Kingdom #1: Ghost Ship",
        "Authors": "By Wilkins, Kim and Cornish, D. M. (ILT)",
        "Description": "EVER SINCE EMPEROR Flood drowned their kingdom and overthrew their parents, Asa and Rollo have been hiding out in Two Hills Keep. Then a mysterious stranger tells them their baby sister wasn’t killed along with their mother and father. Instead, she was kidnapped by Flood’s half-sister and secreted away in a castle to the north. If Una is still alive, there’s only one thing for Asa and Rollo to do. They must take Northseeker, an invisible ship built of mist and shadows, and cross the danger-filled sunken kingdom.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Thunderstorms (True Book: Earth Science) (A True Book: Earth Science)",
        "Authors": "By Stiefel, Chana",
        "Description": "Discover how thunderstorms are formed and predicted, including information on how these storms affect plants, animals, and humans.A True Book: Earth Science series presents fascinating facts and fun activities that will engage the budding earth scientist, while exploring the fields of geology, meteorology, ecology, and more. This series includes an age appropriate (grades 3-5) introduction to curriculum-relevant subjects and a robust resource section that encourages independent study.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Weather",
        "Publisher": "Children's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Cover-up: Mystery at the Super Bowl (The Sports Beat, 3)",
        "Authors": "By Feinstein, John",
        "Description": "New York Times bestselling sportswriter John Feinstein tackles doping in the NFL in this exciting football mystery.The Super Bowl. America’s biggest sports spectacle. Over 95 million fans will be watching, but teen sports reporters Stevie and Susan Carol know that what they’ll be watching is a lie. They know that the entire offensive line of the California Dreams have failed their doping tests. They know the owner is trying to cover up the results. The only thing they don’t know is how to prove it.John Feinstein has been praised as “the best writer of sports books in America today” (The Boston Globe), and he proves it again in this fast-paced novel.",
        "Category": " Young Adult Fiction , Sports & Recreation , Football",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "A Thousand Never Evers",
        "Authors": "By Burg, Shana",
        "Description": "IN KUCKACHOO, MISSISSIPPI, 1963, Addie Ann Pickett worships her brother Elias and follows in his footsteps by attending the black junior high school. But when her careless act leads to her brother’s disappearance and possible murder, Addie Ann, Mama, and Uncle Bump struggle with not knowing if he’s dead or alive. Then a good deed meant to unite Kuckachoo sets off a chain of explosive events. Addie Ann knows Old Man Adams left his land to the white and black people to plant a garden and reap its bounty together, but the mayor denies it. On garden picking day, Addie Ann’s family is sorely tested. Through tragedy, she finds the voice to lead a civil rights march all her own, and maybe change the future for her people.",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "A Highlander Christmas",
        "Authors": "By Chapman, Janet",
        "Description": "Follow one of the beloved MacKeage sisters in New York Times bestselling author Janet Chapman’s popular Highlander series as she deals with a career crisis and the sexy man sent to snap her out of it in this “romantic, magical tale” (Romantic Times) during the holiday season.Camry MacKeage has absolutely no intention of telling her parents that she left her job as a NASA physicist for the small-town life of a dog-sitter—which is why she’s spending the holidays alone in coastal Maine with some furry friends. Unfortunately, her irresistibly handsome rival, scientist Luke Pascal, accidentally spilled the beans to her family. Now he’s on a mission from her mother to tempt Camry home for her family’s annual winter solstice celebration. But Luke is hiding a secret of his own, and he’ll need a little bit of magic to earn Camry’s trust...and a whole lot of mistletoe to seduce his way into her heart.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "50 Facts That Should Change The USA",
        "Authors": "By Fender, Stephen",
        "Description": "Are Americans being told the full story about what's going on in the United States today? In this book, you'll learn hard facts that will open your eyes and minds to a very different reality than the official versions.Following the popular 50 Facts That Should Change The World, this new book puts our nation under the microscope, telling us that:The United States of America is a country with fifty capital cities, few of which anyone can name/ a nation with 65 million gun owners and 35,000 gun deaths each year/ a place where there's one car for every adult/ and where twice as many people claim to go to church as actually do.One town in Kentucky elected a black Labrador as its mayor.The United States produces a quarter of global CO2 emissions, and has a population rising twice as fast as that of the European Union.German could have been the national language.Republican states are the most generous givers to charity.The United States boasts the largest welfare state in the world--our military.Stephen Fender presents a vibrant, proud, and yet critical portrait of the world's most powerful but least understood nation.",
        "Category": " Political Science , Censorship",
        "Publisher": "Disinformation Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Hero at Large",
        "Authors": "By Evanovich, Janet",
        "Description": "“[Evanovich] is funny and ceaselessly inventive.\"—Los Angeles Times Book Review Hero at Large is a delightful mix of laughter and romance—a newly revised classic from #1 New York Times bestseller Janet Evanovich, author of Metro Girl, The Grand Finale, and the sensational Stephanie Plum novels. Evanovich’s many fans will flock to this zany tale of a single-mom skating coach and the handsome “house husband” hunk she brings home…after breaking his arm and his toe!",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Edward Hopper (Getting to Know the World's Greatest Artists: Previous Editions)",
        "Authors": "By Venezia, Mike",
        "Description": "Meet Artist Edward Hopper!Getting to Know the World's Greatest Artists series combines a delightful mix of full-color historical reproductions, photos, and hilarious cartoon-style illustrations that bring to life the works of renowned artists, combining poignant anecdotes with important factual information for readers (Ages 8-9).This book examines the life and work of the American realist painter, describing and giving examples of his art.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Art",
        "Publisher": "Children's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "She's All That! (Mythlopedia)",
        "Authors": "By Bryant, Megan E.",
        "Description": "Love action, deception, romance, power struggles, and more!Mythlopedia is a series where the superstars of Greek myth meet the modern age--complete with profiles, headshots, and family trees; fascinating sidebars; and irreverent surprises, for readers (Ages 10-14).",
        "Category": " Juvenile Nonfiction , Social Science , Folklore & Mythology",
        "Publisher": "Franklin Watts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Da Vinci (Getting to Know the World's Greatest Artists)",
        "Authors": "By Venezia, Mike",
        "Description": "Traces the life of the Renaissance artist and analyses some of his paintings.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Art",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Oh My Gods! (Mythlopedia): A Look-It-Up Guide to the Gods of Mythology",
        "Authors": "By Bryant, Megan E.",
        "Description": "A thoroughly new series where the superstars of Greek myth meet the modern age--complete with profiles, headshots, and family trees; fascinating sidebars; and irreverent surprises, this series is for readers who love action, deception, romance, power struggles, and more!",
        "Category": " Juvenile Nonfiction , Social Science , Folklore & Mythology",
        "Publisher": "Franklin Watts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Sylvester Bear Overslept",
        "Authors": "By Wahl, Jan",
        "Description": "",
        "Category": "",
        "Publisher": "Parents' Magazine Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Bears Who Went to the Seaside",
        "Authors": "By Gretz, Susanna",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Wyvernhail: The Kiesha'ra: Volume Five",
        "Authors": "By Atwater-Rhodes, Amelia",
        "Description": "HAI HAS ALWAYS been an outsider. With a falcon mother and a deceased cobra father, she is considered a mongrel by most, an ally by some, and a friend by few. Hai's broken falcon wings are a painful reminder of the life she once led on the island of Ahnmik. And here in Wyvern's Court, the avian and serpiente royal family keep their distance, refusing to acknowledge her cobra bloodline. They know that Hai's magic is so volatile, she can barely control it, and images of the past and future threaten to overwhelm her.When Hai's cousin, Oliza Shardae Cobriana, abdicates the throne of Wyvern's Court, Hai has visions only of destruction: the serpiente king Salem, dying in her arms; the dutiful guard, Nicias, unable to save a generation of children; and Wyvern's Court engulfed in flames.Now Hai will do anything to protect her new home - even if it means betraying the very people who need her most.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Wal-Mart: The High Cost of Low Price",
        "Authors": "By Spotts, Greg and Greenwald, Robert (INT)",
        "Description": "This book describes the making of Robert Greenwald's documentary film Wal-Mart: The High Cost of Low Price. It also discusses how the film was linked to union campaigns targeting the powerful retail company and the strategies used by the company to suppress the impact of the critical film. Distributed by Consortium. Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Industries , Retailing",
        "Publisher": "Disinformation Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Irving and Me",
        "Authors": "By Hoff, Syd",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Concubine's Daughter",
        "Authors": "By Fai, Pai Kit",
        "Description": "An epic, heart-wrenching story of a mother and daughter's journey to their destiny.Lotus Feet. He would give his daughter the dainty feet of a courtesan. This would enhance her beauty and her price, making her future shine like a new coin. He smiled to himself, pouring fresh tea. And it would stop her from running away…When the young concubine of an old farmer in rural China gives birth to a daughter called Li-Xia, or \"Beautiful One,\" the child seems destined to become a concubine herself. Li refuses to submit to her fate, outwitting her father's orders to bind her feet and escaping the silk farm with an English sea captain. Li takes her first steps toward fulfilling her mother's dreams of becoming a scholar—but her final triumph must be left to her daughter, Su Sing, \"Little Star,\" in a journey that will take her from remote mountain refuges to the perils of Hong Kong on the eve of World War II.",
        "Category": " Fiction , Sagas",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "A history of the Pennsylvania State Forest School, 1903-1929",
        "Authors": "By Thomas, Elizabeth H",
        "Description": "",
        "Category": "",
        "Publisher": "Pennsylvania State Forest Academy/School Founders Society",
        "Price Starting With ($)": "29.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Scopes Trial: A Brief History with Documents (Bedford Series in History & Culture (Paperback))",
        "Authors": "By Morgan, Jeffery P. and Moran, Jeffrey P.",
        "Description": "The Scopes trial shocked America. Tennessee schoolteacher John Scopes brought the question of teaching evolution in schools to every dinner table, and it remains an essential topic in any course on American History, the History of Education, and Religious History. This volume’s lively interpretative introduction provides an analysis of the trial and its impact on the moral fiber of the country and the educational system, and examines the race and gender issues that shook out of the debate. The editor has excerpted the crucial exchanges from the trial transcript itself, and includes these along with reactions to the trial, taken from newspaper reports, letters, and magazine articles. Telling political cartoons and evocative photographs add a colorful dimension to this collection, while a chronology of events, questions for consideration, and a bibliography provide strong pedagogical support.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Pill Book (12th Edition)",
        "Authors": "By Silverman, Harold M. (EDT)",
        "Description": "For more than two decades, millions of consumers have trusted The Pill Book to provide official FDA-approved drug information plus guidelines from leading pharmacists. Each drug is profiled in a concise readable, and easy-to-understand entry, making The Pill Book the perfect reference when you have questions about the medications your doctor prescribes.The most up-to-date information about the more than 1,800 most commonly prescribed drugs in the United States: • Generic and brand-name listings that can help you save money• What the drug is for, and how it works• Usual dosages, and what to do if a dose is skipped• Side effects and possible adverse reactions,   highlighted for quick reference• Interactions with other drugs and food• Overdose and addiction potential• Alcohol-free and sugar-free medications• The most popular self-injected medications and their safe handling • Information for seniors, pregnant and breast-feeding   women, children, and others with special needs• Cautions and warnings, and when to call your doctor• 32 pages of actual-size color photographs of prescription pills",
        "Category": " Reference , Consumer Guides",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Heretic Queen: Heiress of Misfortune, Pharaoh's Beloved",
        "Authors": "By Moran, Michelle",
        "Description": "In ancient Egypt, a forgotten princess must overcome her family’s past and remake  history. The winds of change are blowing through Thebes. A devastating palace fire  has killed the Eighteenth Dynasty’s royal family—all with the exception of Nefertari,  the niece of the reviled former queen, Nefertiti. The girl’s deceased family has  been branded as heretical, and no one in Egypt will speak their names. A relic of  a previous reign, Nefertari is pushed aside, an unimportant princess left to run  wild in the palace. But this changes when she is taken under the wing of the Pharaoh’ s aunt, then brought to the Temple of Hathor, where she is educated in a manner befitting  a future queen. Soon Nefertari catches the eye of the Crown Prince, and despite  her family’s history, they fall in love and wish to marry. Yet all of Egypt opposes  this union between the rising star of a new dynasty and the fading star of an old,  heretical one. While political adversity sets the country on edge, Nefertari becomes  the wife of Ramesses the Great. Destined to be the most powerful Pharaoh in Egypt,  he is also the man who must confront the most famous exodus in history. Sweeping  in scope and meticulous in detail, The Heretic Queen is a novel of passion and power,  heartbreak and redemption.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Mrs. McTats and Her Houseful of Cats",
        "Authors": "By Capucilli, Alyssa Satin and Rankin, Joan (ILT)",
        "Description": "Mrs. McTats and her cat, Abner, are living happily together when some new cats come scratching at Mrs. McTats's door. By twos and threes, and then fours and more, the cats come, welcomed by Mrs. McTats (though Abner's not so sure about it all!). Just when it seems the house is full to bursting, the cats stop coming. Whew! So many cats! But Mrs. McTats can't help feeling that something -- or someone -- is missing. Then there's one more scratch at the door -- and Mrs. McTats finds just what the family needs to be complete.  Alyssa Capucilli's playful rhymes, which surprise with an alphabetic twist, combine with Joan Rankin's hilarious illustrations, which give each cat a distinct personality, to guarantee hours of reading pleasure.",
        "Category": " Juvenile Fiction , Animals , Cats",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Spirit of Women Entrepreneurs: Real-life Stories of Determination, Growth and Prosperity",
        "Authors": "By Compiled by Ginny Robertson",
        "Description": "",
        "Category": "",
        "Publisher": "Love Your Life Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Developing Microsoft ASP.NET Server Controls and Components (Pro-Developer)",
        "Authors": "By Kothari, Nikhil and Datye, Vandana",
        "Description": "Web Forms—the Page and Control Framework at the heart of ASP.NET—makes it easier to develop dynamic Web applications. But you can go beyond the controls that ship with ASP.NET—and power up your Web sites and applications—by creating your own server controls. You can also develop and distribute your own controls for commercial use. This comprehensive guide, direct from key insiders who really know the technology, combines conceptual and architectural details with practical, how-to information and real-world code samples to show exactly how to create custom, reusable, professional-quality server controls with rich design-time functionality. It also provides essential information about configuration and the HTTP runtime, packaging, deployment, debugging, and developing controls that incorporate XML Web services, plus other vital topics. And it introduces the ASP.NET Web Matrix tool for creating Web applications and for using server controls. Topics covered include:OVERVIEWASP.NET page programmingComponent programmingSERVER CONTROLSUser controlsImplementing propertiesView state managementRenderingControl life cycleEvents and PostbackStylesComposite, validator, and data-bound controlsClient-side behaviorDesign-time functionalityLocalization, licensing, and deploymentSERVER COMPONENTSXML Web servicesHTTP handlersSERVER CONTROL CASE STUDIESTemplated data-bound controlsDHTML-based server controls“[This book] is a must-have for all serious ASP.NET component developers.”–Scott Guthrie, Product Unit Manager, Microsoft ASP.NET Product Team",
        "Category": " Computers , Hardware , Personal Computers , General",
        "Publisher": "Microsoft Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "501 Quilt Blocks: A Treasury of Patterns for Patchwork & Applique (Better Homes and Gardens Cooking) (Better Homes and Gardens Crafts)",
        "Authors": "By Lewis, Joan and Chiles, Lynette",
        "Description": "A treasury of patterns for patchwork and appliquéHere, quilters will find 501 pieced and appliquéd quilt blocks, easily customized for unique, personalized themes. Plus, 40 step-by-step projects for using blocks in the form of wearables, personal accessories, and home and seasonal decorations are included as well as 500 full-color photos and 600 line drawings.",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Better Homes & Gardens",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Computer Security: 20 Things Every Employee Should Know",
        "Authors": "By Rothke, Ben",
        "Description": "It’s five o’clock, do you know where your confidential office document is? The truth is that many employees may not. This convenient handbook brings your workplace up to speed with 21st century security issues from computer passwords to hard copy document disposal. Covers technical issues and social engineering scenarios that put corporate security and data at risk.",
        "Category": " Computers , Security , General",
        "Publisher": "McGraw-Hill Osborne Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Professional IIS 7",
        "Authors": "By Cochran, Jeff, Schaefer, Ken, Forsyth, Scott, Baugh, Rob, and Everest, Mike",
        "Description": "As the first update to Microsoft's server operating system in nearly five years, Windows Server 2008 boasts the new Internet Information Services 7.0 (IIS 7), which is the largest departure from previous versions of IIS ever. Written by an author team that includes four Microsoft MVPs, this book shows you how to take advantage of these exciting new features of IIS 7. With a clear understanding of IIS 7, you'll learn to deploy, install, monitor, manage, and secure an IIS environment with confidence and ease.  Note: CD-ROM/DVD and other supplementary materials are not included as part of eBook file.",
        "Category": " Computers , Web , General",
        "Publisher": "Wrox",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Who's (oops whose) Grammar Book is This Anyway?",
        "Authors": "By C. Edward Good",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes and Noble Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "World-class Contracting: 100+ Best Practices For Building Successful Business Relationships",
        "Authors": "By Garrett, Gregory A",
        "Description": "",
        "Category": "",
        "Publisher": "ESI International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Do I Know God?: Finding Certainty in Life's Most Important Relationship",
        "Authors": "By Tchividjian, Tullian",
        "Description": "As the grandson of Billy and Ruth Bell Graham, Tullian Tchividjian grew up hearing the Christian faith preached to millions. Yet he struggled to come to faith personally. His first book, Do I Know God?captures the sincerity and intensity of his own spiritual quest, and shows the way for a new generation of seekers.Combining careful thinking, warm personal story, and an exceptional grounding in biblical truths, Tullian delivers trustworthy answers to the questions you’ve been asking:·Is it really possible to know God?·Is being “spiritual” or “religious” the same thing as having a relationship with God?·What is the relationship between saving faith and good works?·How does believing God’s promises assure me of salvation?·How do my feelings for God affect my relationship with him?·How can I trust that God is present when I feel only his absence?·Can a relationship with God assure me of a future with him in eternity?Do I Know God? was written with a wide range of readers in mind: those outside the Christian faith, newer Christ followers who feel confused about their relationship with God, and long-time Christians who have never gotten clarity on key questions like eternal security and assurance of salvation, faith and works.Tullian shows readers how to discover a genuine, vibrant and enduring relationship with God. And it all begins with the vital question:Do I Know God?",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Courtship Rite",
        "Authors": "By Donald Kingsbury",
        "Description": "",
        "Category": "",
        "Publisher": "Timescape Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Love or Perish",
        "Authors": "By Blanton, Smiley",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "I Meet Such People!",
        "Authors": "By Gurney Williams (ed)",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar, Straus",
        "Price Starting With ($)": "18.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "American Antique Furniture: A Book for Amateurs, Vol. 1",
        "Authors": "By Miller, Edgar George",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1966"
        }
    },
    {
        "Title": "Impetuous (Famous Firsts)",
        "Authors": "By Foster, Lori",
        "Description": "Grade school teacher Carlie McDaniels trades in her frumpiness for the look of an exotic harem girl, at least for one costume party. So long, spinsterhood&#151;and hello tall, dark and handsome Tyler Ramsey&#133;.Even after the best night of their lives, Tyler hasn't guessed the identity of his harem hottie&#133;and Carlie plans on keeping him in the dark. After all, a gorgeous guy like Tyler would never fall for his smart-talking best friend. And Carlie's not sure she wants to know what would happen if he ever unveiled the naked truth!",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin Famous Firsts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The Encyclopedia of Flower Gardening & Landscaping",
        "Authors": "By Janet Cave",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life Medical",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Discovering Kings and Queens",
        "Authors": "By Wickham, David Ernest",
        "Description": "",
        "Category": "",
        "Publisher": "Shire Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "The Complete Crossword Word Finder",
        "Authors": "By Spino, Emerson Diane and Spino, Diane Emerson (COM)",
        "Description": "A comprehensive listing of words with two to twenty letters including names of people and geographic names",
        "Category": " Games , Crosswords , Dictionaries",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Happiest Toddler on the Block: How to Eliminate Tantrums and Raise a Patient, Respectful, and Cooperative One- to Four-Year-Old: Revised Edition",
        "Authors": "By Spencer, Paula and Karp, Harvey",
        "Description": "Perfect for expecting parents who want to prepare themselves for the challenging toddler years (which starts around eight months of age), this essential guide, a national bestseller by respected pediatrician and child development expert Dr. Harvey Karp, not only helps reduce tantrums but makes happy kids even happier by boosting patience, cooperation, and self-confidence.This streamlined revision of the breakthrough bestseller by renowned child-development  expert Dr. Harvey Karp will do even more to help busy parents survive the “terrible  twos” and beyond....In one of the most revolutionary advances in parenting of the  past twenty-five years, Dr. Karp revealed that toddlers often act like uncivilized  little cavemen, with a primitive way of thinking and communicating that is all their  own. In this revised edition of his parenting classic, Dr. Karp has made his innovative  approach easier to learn—and put into action—than ever before.Combining his trademark  tools of Toddler-ese and the Fast-Food Rule with a highly effective new green light/yellow  light/red light method for molding toddler behavior, Dr. Karp provides fast solutions  for today’s busy and stressed parents. As you discover ways to boost your child’s  good (green light) behavior, curb his annoying (yellow light) behavior, and immediately  stop his unacceptable (red light) behavior you will learn how to soothe his stormy  outbursts with amazing success—and better yet, prevent these outbursts before they  begin! And the new thirty-item glossary of Dr. Karp’s parenting techniques will save  you valuable time when you need to instantly calm an out-of-control child. The result:  fewer tantrums, less yelling, and more happy, loving time for you and your child.",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Way to Start a Day",
        "Authors": "By Baylor, Byrd",
        "Description": "Beautiful paintings highlight a text depicting the ways various peoples from around the world welcome the sun and the start of a new day.",
        "Category": " Juvenile Fiction , People & Places , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Twelve Who Followed Jesus - Arch Books",
        "Authors": "By Fletcher, Sarah and Wheeler, Ron (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Concordia Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Big Halloween Scare (SPONGEBOB SQUAREPANTS READY-TO-READ)",
        "Authors": "By Banks, Steven and Martinez, Heather (ILT)",
        "Description": "It's Halloween, and SpongeBob is determined to scare everyone this year. All he has to do is dress up like the Flying Dutchman. But SpongeBob doesn't realize just how scary he can look. Join the gang from Bikini Bottom in this spooky Haloween tale!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Wonderful Winter Tree (Bambi)",
        "Authors": "By Elizabeth Spurr",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Swing Voter of Staten Island (Akashic Urban Surreal)",
        "Authors": "By Nersesian, Arthur",
        "Description": "&#147;Nersesian’s extravagantly imagined dystopia relies&#151;as did those in Philip Roth’s Plot Against America and Michael Chabon’s Yiddish Policemen’s Union&#151;on an alternate, counterfactual history.”&#151;The New York Times Book Review&#147;Combining sci-fi space/time-warping, Unabomber-style political ranting and an overall air of goose-bump paranoia, this is one turbo-charged trip. . . . A sharp, strange read: Imagine William Burroughs and Philip K. Dick sharing a needle.”&#151;Kirkus Reviews&#147;Brilliant.”&#151;Time Out New YorkArthur Nersesian’s six previous novels (including The Fuck-Up, MTV/Pocket Books, which has sold over 100,000 copies) have focused on the tragicomedy of fin de siècle New York City. Here, in his boldest novel to date, Nersesian has broken through into a new landscape that at once fuses the real with the surreal, the psychological with the psychedelic. He lives in New York City.",
        "Category": " Fiction , Alternative History",
        "Publisher": "Akashic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Embellishments: Adding Glamour to Garments (Star Wear)",
        "Authors": "By Kenzle, Linda Fry",
        "Description": "",
        "Category": " Crafts & Hobbies , Fashion",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Mountaineering: The Freedom of the Hills",
        "Authors": "By Graydon, Don (EDT)",
        "Description": "For over thirty years and through four editions, Mountaineering: The Freedom of the Hills has been the \"bible\" of the climbing world, initiating thousands of people to the joys and challenges of wilderness exploration. An essential teaching tool and resource for novice to advanced mountaineers, Freedom is the standard text for climbing courses throughout the United States and abroad, and even has been used as a training manual by the U.S. military.Completely updated and revised, the 5th edition redefines the basics with the latest information on climbing techniques, snow and glacier travel, weather, safety, first aid, and leadership. Expanded chapters on first steps, belaying, and aid climbing and pitoncraft, plus several new sections on rock climbing, help broaden skill and expertise. Freedom covers the latest in equipment, including plastic boots, specialized rock shoes, step-in/clamp-on crampons, interior-frame packs, modern spring-loaded camming devices, ice-climbing tools, and belay and rappel devices. A completely new chapter on winter and expedition climbing rounds out this exhaustive edition, making Freedom the most comprehensive and contemporary source available on mountaineering.More than 350 all-new illustrations, created from photographs of climbers demonstrating specific procedures, depict and clarify instructions in the text. And, in keeping with today's environmental concerns, Freedom emphasizes clean climbing and low-impact wilderness use.The 5th edition of Mountaineering: The Freedom of the Hills is a consensus of accepted, safe methods and principles of mountaineering. Written and coordinated by the Mountaineers, a Seattle-based outdoor organization founded in 1906, it draws upon the knowledge of active, experienced mountaineers within and outside the club. Freedom continues a tradition of excellence by gathering the wisdom, instruction, and experience of some of the world's best climbers into one indispensable volume.",
        "Category": " Sports & Recreation , Mountaineering",
        "Publisher": "Mountaineers Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Better Homes and Gardens Tasty Timesaving Cooking",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "A selection of quick, easy, appetizing dishes grouped as main dishes, side dishes, and desserts",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Encyclopedia of Everlastings: The Complete Guide to Growing, Preserving, and Arranging Dried Flowers",
        "Authors": "By Rogers, Barbara Radcliffe",
        "Description": "Explains the basic methods of plant preservation",
        "Category": " Gardening , General",
        "Publisher": "Weidenfeld & Nicholson",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "The Wonderful World of Archaeology",
        "Authors": "By Ronald Jessup",
        "Description": "",
        "Category": "",
        "Publisher": "Garden City",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "The Truman Administration; a Documentary History",
        "Authors": "By barton bernstein",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Put Your House on a Diet: De-Clutter Your Home and Reclaim Your Life",
        "Authors": "By Bykofsky, Sheree, Morrow, Ed, Byofsky, Sheree, Rosenkranz, Rita, and Morrow, Ed (ILT)",
        "Description": "A fresh, light-hearted approach to trimming away excess clutterIf your home is like most homes, it has been accumulating unwanted \"stuff\" that, like body fat, makes your life more difficult and less happy. Wouldn't it be nice if you could put your home on a diet? This humorous but wonderfully practical book tackles the clutter dilemma by drawing an analogy to the familiar struggle so many of us have to lose weight-and presents a clutter-reduction program that gives both immediate gratification and longer-term maintenance guidance.o Room by room, the book examines how clutter limits your lifestyle and creates problems-and offers simple ideas and solutions for eliminating unwanted possessions.o The authors suggest ways to change clutter-accumulating behavior; show how to efficiently organize the possessions you need; and examine dozens of ways to dispose of clutter.o Always the emphasis is on uncomplicated, inexpensive solutions that are easy to implement-and that produce life-changing results.Giving serious advice that doesn't take itself too seriously, Put Your House on a Diet will soon have your home slim, trim, and clutter-free.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Face Down Before Rebel Hooves",
        "Authors": "By Emerson, Kathy Lynn",
        "Description": "Susanna, Lady Appleton, is passing time with her new love, Nick Baldwin, in Hamburg when she is approached by her old friend Walter. Distraught over the discovery that his late wife, Eleanor, was conspiring in a plot to overthrow Queen Elizabeth and replace her with Mary, Queen of Scots, Walter beseeches Susanna to help him foil the plot. Since Eleanor's death is still a well-kept secret, Walter wants Susanna to take his wife's place among the traitors. Overcoming her misgivings, Susanna soon finds herself impersonating Eleanor so that she can join the ring of conspirators. Attempting to deliver a vital letter to the earl of Northumberland, a key player in the drama about to unfold, Susanna wonders how long she can conceal her true identity. Will the plot against the Queen proceed unchecked, or will it be thwarted by Susanna's sleuthing? In the sixth installment of this \"sparkling series\" (Publishers Weekly), Emerson seamlessly combines politics, history and suspense as she follows Susanna, Lady Appleton, on her latest adventure.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The New Knowledge of Dog Behavior",
        "Authors": "By Pfaffenberger, Clarence",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "*Howell Book House",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "Little Miss Shy (Mr. Men and Little Miss)",
        "Authors": "By Hargreaves, Roger",
        "Description": "When Little Miss Shy gets an invitation to Mr. Funny's party, she goes into hiding!",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Credo",
        "Authors": "By Coffin, William Sloane and Carroll, James (FRW)",
        "Description": "",
        "Category": " Religion , Christianity , General",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "You Were Made for Love: Embracing the Life You Were Meant to Live",
        "Authors": "By Carlson, Philip",
        "Description": "",
        "Category": "",
        "Publisher": "Life Journey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "And the Angels were Silent / Six Hours One Friday / No Wonder They Call Him the Savior",
        "Authors": "By Max Lucado",
        "Description": "",
        "Category": "",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "I'm Looking Through You: Growing Up Haunted: A Memoir",
        "Authors": "By Boylan, Jennifer Finney",
        "Description": "From the bestselling author of She’s Not There comes another buoyant, unforgettable memoir—I’m Looking Through You is about growing up in a haunted house...and making peace with the ghosts that dwell in our hearts.For Jennifer Boylan, creaking stairs, fleeting images in the mirror, and the remote whisper of human voices were everyday events in the Pennsylvania house in which she grew up in the 1970s. But these weren’t the only specters beneath the roof of the mansion known as the “Coffin House.” Jenny herself—born James—lived in a haunted body, and both her mysterious, diffident father and her wild, unpredictable sister would soon become ghosts to Jenny as well.I’m Looking Through You is an engagingly candid investigation of what it means to be “haunted.” Looking back on the spirits who invaded her family home, Boylan launches a full investigation with the help of a group of earnest, if questionable, ghostbusters. Boylan also examines the ways we find connections between the people we once were and the people we become. With wit and eloquence, Boylan shows us how love, forgiveness, and humor help us find peace—with our ghosts, with our loved ones, and with the uncanny boundaries, real and imagined, between men and women.",
        "Category": " Body, Mind & Spirit , Supernatural (incl. Ghosts)",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Reckoning:  The Heritage of Lancaster County 3",
        "Authors": "By Lewis, Beverly",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Berenstain Bears and the Baby Chipmunk (I Can Read Level 1)",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "The Bear family adopts a curious baby chipmunk. Brown Eyes explores Papa's desk, Mama's sewing basket, and Papa's pant leg –– all the way up to the knee! Ages 4 – 8",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Twentieth Century: A Brief Global History",
        "Authors": "By Goff, Richard, Moss, Walter, Terry, Janice, and Upshur, Jiu-Hwa",
        "Description": "",
        "Category": "",
        "Publisher": "Mcgraw-Hill College",
        "Price Starting With ($)": "6.01",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Me Too, Woody! (Step-Into-Reading, Step 1)",
        "Authors": "By RH Disney (COR), Atelier Philippe Harchy (ILT), and Kilgras, Heidi",
        "Description": "When Jessie tries to join in the fun and games with Woody and Buzz, she finds out that some games are simply meant for two . . . until the gang rounds up a game that everyone can play—including Jessie! In super-brief, super-simple text, this book promotes the power of inclusion.",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Debt Cures II \"they\" REALLY don't want you to know about.",
        "Authors": "By Kevin Trudeau",
        "Description": "",
        "Category": "",
        "Publisher": "Equity Press",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Imagination Ring (Fantastic Four (Marvel Paperback))",
        "Authors": "By Sudduth, Brent",
        "Description": "Two 8x8 storybooks feature classic images of the Fantastic Four as they battle evil villains for control of the world. Terrific art and storytelling will have kids reading both books over and over!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "A Hearth in Candlewood (The Candlewood Trilogy, Book 1)",
        "Authors": "By Parr, Delia",
        "Description": "With genteel grace and quiet fortitude, Emma Garrett presides over Hill House, a stately boardinghouse in the canal village of Candlewood, New York. She finds her purpose in caring for her guests, ministering to them with a generous dose of wisdom and humor. But when a \"runaway grandma\" lands on her doorstep, Emma's need to fix every wrong places her in the midst of a family feud. Emma's concerns heighten when her attorney, Zachary Breckenwith, delivers life-changing news, leaving Emma reeling from the implications. With her future suddenly uncertain, Emma longs to restore the peace of Hill House--for her guests and within her own heart.FIND A WELCOME RETREAT IN CANDLEWOOD AS YOU EXPERIENCE THE BEAUTY, FRIENDSHIP, AND FAITH IN THE LIVES OF ITS QUAINT AND COLORFUL CHARACTERS.",
        "Category": " Fiction , Historical",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Sewing for the Holidays (Singer Sewing Reference Library)",
        "Authors": "By Singer",
        "Description": "Gives creative suggestions for making crafts with a sewing machine, for Christmas, Easter, Halloween, and Thanksgiving",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Cowles Book Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The 7 Day Energy Surge: Get Ready to Energize Your Life Starting Now!",
        "Authors": "By Karas, Jim",
        "Description": "We all know what it feels like to be \"on\"—to wake up feeling refreshed and rested, to bound through the day feeling like you can conquer the world as you bounce between work, family, and friends, and go to bed feeling relaxed and satisfied with your accomplishments. What made all the difference during those highly productive days? It's simple—energy. You can't buy it at the store, but you can control your energy levels. Here for the first time is a simple program to increase your energy immediately—and keep it up throughout the day, every day. Through his work with more than 500 clients, Jim Karas has identified the 10 components that contribute to your personal balance-of-energy equation—and created the 7-Day Energy Surge to help you put all 10 to work for you. He exposes the bad habits that sabotage energy, lays out the principles for increasing your energy and offers simple strategies that are easily customizable for anyone to use anywhere . . . at any time. What's more, energy-positive habits also translate into weight loss. Plus, by maintaining that lower weight, exercising regularly, sleeping well, breathing deeply, and keeping a positive mind-set, you will not only experience a surge of energy but you will fight pain, fatigue, headaches, stress, depression, disease, and aging. In just a few minutes a day, you can jump-start your weight loss, reduce your stress, and enhance your sex life. Get ready for the 7-Day Energy Surge. It starts now. In no time, you will possess a huge bank of enriching energy—and feel better than you ever have before!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Changing Habits",
        "Authors": "By Macomber, Debbie",
        "Description": "A powerful novel of faith and self-discovery follows three very different women--all of whom join an order of nuns, and then leave--as they each embark on extraordinary and emotional journeys to discover their true place in this world and experience the wonders of love. 75,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Seasonal Wreaths from Caprilands: Holiday Celebrations With Herbal Wreath Lore and Design",
        "Authors": "By Simmons, Adelma Grenier",
        "Description": "",
        "Category": "",
        "Publisher": "Bdd Promotional Book Co",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "400 Sauces: Dips, dressings, salsas, jams, jellies & pickles",
        "Authors": "By Catherine and Christine France & Maggie May",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "6.81",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Object-Oriented Programming Using C++",
        "Authors": "By Pohl, Ira",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Benjamin-Cummings Pub Co",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    }
]