[
    {
        "Title": "Lorelei's Guiding Light: An Intimate Diary",
        "Authors": "By Chamberlin, Beth and Hills, Lorelei",
        "Description": "When Lorelei Hills, the tough, vivacious character from TV's beloved \"Guiding Light,\" wakes up in Mexico, she asks, \"who am I?\" What she wants and needs to know desperately is her name, where she's from and how she came to be in a stranger's bed.Lorelei's Guiding Light: An Intimate Diary is the inside story of one woman's struggle to come to terms with her identity and to emerge as a force to be reckoned with.  Here is the Lorelei that viewers of the show have never seen--the history and emotions, the hopes and dreams that have made her the star of an unforgettable human drama.  Learn all the hidden details about her lost days and nights in Mexico, her high-roller life in New York, her childhood in Virginia. And experience in-depth her innermost thoughts, schemes and desires that have never emerged on the screen. From the moment she teams up with the character you love to hate, Edmund Winslow, to impersonate Lorelei's late lookalike Beth Raines in order to claim Beth's fortune, family and very possibly her ex-husband (the deeply attractive Phillip Spaulding) this book is unputdownable, the ultimate record of a secret life, written in Lorelei's own impossible-to-imitate style.As written by Beth Chamberlin, the actress who portrays both Lorelei Hills and Beth Raines, this page turner is filled with intrigue, gossip, deceit and, of course, plenty of romance--in short, everything you expect from \"Guiding Light...\" and more.",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Last Good Night: A Novel",
        "Authors": "By Friedman, Fredrica S. (EDT) and Listfield, Emily",
        "Description": "Laura Barrett has it all - fame and success as coanchor of the national evening news, a charming husband, and a beautiful baby daughter. But it is all about to end. One night, a man approaches her outside the network studio and calls her \"Marta.\" And in that instant, Laura knows that her last good night is over and what she's feared for so long has finally arrived.Marta. A precocious teenager who did something terrible one night in a run-down Florida motel. It is an act that will haunt her no matter how far she runs, how different she looks, or how successful she becomes. For twenty-one years, Laura has been trying to erase Marta from her memory. Now a man from her past is confronting her, demanding answers. At first, Laura believes she can control the situation, despite the mounting threats. But suddenly, she's facing every mother's nightmare.Laura will have to risk her marriage, her career, her life, to save her baby. And finally face what happened that night so long ago...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Irish Art Now: From the Poetic to the Political",
        "Authors": "By O'Toole, Fintan and McGonagle, Declan",
        "Description": "Reflecting the seismic changes in Ireland's political, social, economic, and cultural realities of the 1990s, contemporary Irish artists have begun to redefine identities, raising questions about the relationships between male and female, urban and rural, North and South, history and the present. The struggle over identities, which used to marginalize Ireland and societies like it, has now become central to debates around the globe.This strikingly illustrated book presents a reading of Irish art in the 1990s and examines the repositioning of Irish identity in works drawn primarily from the collection of the Irish Museum of Modern Art, Dublin.The artists examined, including Kathy Prendergast, Willie Doherty, and Alice Maher, have initiated a dialogue with their own society and others beyond Ireland, using painting, photography, sculpture, video, and installation to explore subjects ranging from the personal and poetic to the political. Their concerns - and the way they are conveyed through non-traditional materials and new interpretations of more conventional media - link these works to new art being made elsewhere in the world.This publication accompanies an exhibition touring the United States and Canada.",
        "Category": " Art , European",
        "Publisher": "Merrell Pub Ltd",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Law against restraints of competition: Text and commentary in German and English",
        "Authors": "By Alexander Riesenkampff",
        "Description": "",
        "Category": "",
        "Publisher": "O. Schmidt",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Way of a Trout",
        "Authors": "By Van Gytenbeek, R. P.",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Comeback! Four True Stories (Step into Reading)",
        "Authors": "By O'Connor, Jim and Campbell, Jim (ILT)",
        "Description": "Easy-to-read profiles of four great sports figures--Catfish Hunter, Greg Lemond, Bart Connor, and Wilma Rudolph--reveal how these athletes refused to let injuries stand in the way of their sports success. Simultaneous.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Good Cook Book: 60 Heart Healthy Recipes",
        "Authors": "By Yves",
        "Description": "",
        "Category": "",
        "Publisher": "Yves Veggie Cuisine",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Skin",
        "Authors": "By Buckman, Robert",
        "Description": "Discusses topics such as how the skin functions, causes and treatments for a variety of skin conditions, and ways to prevent wrinkles",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "TV Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Pretender (Animorphs #23)",
        "Authors": "By Applegate, Katherine",
        "Description": "Attending the reading of his father's will, Tobias learns that his father was really the Andalite Prince Elfangor, but he is unable to reveal what he has discovered because of the continual presence of Visser Three. Original.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "9.67",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "When Mother Was Eleven-Foot-Four: A Christmas Memory",
        "Authors": "By Camery-Hoggatt, Jerry",
        "Description": "Three young boys learn a lesson in grace as they help their mother at Christmastime.",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "A Ceiling of Sky: Special Garden Rooms and the People Who Created Them",
        "Authors": "By Ross, Pat",
        "Description": "",
        "Category": " Gardening , Techniques",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Twilight at the Well of Souls (Saga of the Well World, Vol. 5)",
        "Authors": "By Chalker, Jack L.",
        "Description": "",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Ordinary Love and Good Will: Two Novellas",
        "Authors": "By Smiley, Jane",
        "Description": "\"Smiley's stories lucidly explore the complexities of contemporary sexual and dometic life...the emotional and moral complexity that she uncovers in the characters of these resonant novellas confirms Jane Smiley's singular talent. ORDINARY LOVE AND GOOD WILL is an extraordinary achievement.\"THE WASHINGTON POST BOOK WORLDORDINARY LOVEAt a reunion with her grown children, a woman recalls the long-ago affair that ended her relationship with their father--and changed all their lives irrevoccably.GOOD WILLDespite the carefully self-sufficient life he has designed for his small family, a man discovers that even the right choices have unexpected consequences--sometimes heart-breaking ones.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Pregnancy Pure & Simple",
        "Authors": "By Hotchner, Tracie and Leahy, Christine (ILT)",
        "Description": "An encouraging guide by the author of Pregnancy & Childbirth is designed to promote mother confidence and comfort, with an accessible format and coverage on everything from pre-pregancy health to charting a baby's weekly growth. Original.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Quill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Photography (The Complete Idiot's Guide)",
        "Authors": "By Woodson, R. Dodge",
        "Description": "You're no idiot, of course.  You pick the best vacation spots, plan the most exciting parties, and even have time to catch your breath and take a nature walk or witness an occasional solar eclipse.  But when it comes to making all of those memorable events in your life just as exciting and unforgetable on film, you feel like you're pointing your camera in the dark.  Jump back into the light!  The Complete Idiot's Guide to Photography provides you with step-by-step guidelines on everything from using simple point and shoot cameras to darkroom basics.  Feel confident about taking the very best vacation shots, family photos, nature panoramas, and more!   In this Complete Idiot's Guide, you get:",
        "Category": " Photography , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Bicycle Days: A Novel",
        "Authors": "By Schwartz, John Burnham",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Christie's Collectibles, Small Silver Tableware: The Connoisseur's Guide",
        "Authors": "By Helliwell, Stephen",
        "Description": "This broad-ranging selection of small silver tableware encompasses everything from Renaissance flatware to the most bizarre - and often most innovative - inventions of the 19th century. This guide will enable you to identify pieces that may have mystified you in antique markets and yard sales, in addition to offering a look at some of the most exquisite and finely crafted flatware ever made.",
        "Category": " Antiques & Collectibles , Silver, Gold & Other Metals",
        "Publisher": "Bulfinch Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Good 'N Healthy",
        "Authors": "By Ward, Brenda and Jarrell, Jane Cabaniss",
        "Description": "",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Turn Four: A Novel of the Superspeedways",
        "Authors": "By Morrisey, Tom",
        "Description": "'...Not only grabs a reader's attention; he teaches all you need to know about the inner world of stock-car racing. This book will surprise you with a treasury of life lessons.'--Dale Beaver, Nextel Cup Chaplain, Motor Racing OutreachThe unthinkable has finally happened. Can Chance Reynolds face a life without racing?Before he even had his driver's license, Chance Reynolds was racing---and winning. He worked his way up the racing ranks from go-carts to sprint cars to stock cars, exercising a natural talent that made him one of the best drivers in midwestern racing. Now he has captured the points lead in stock car racing's premiere series, and is a favorite to win the championship . . .. . . Until an off-track accident shatters his career and his life.Riddled with doubts and questions, Chance delves into the Bible, looking for answers, a clear path for the next turn in his life. The thought of leaving the racing world is mind- numbing---it's all he has ever known. Turn Four is an unforgettable ride through the realities of professional racing. Cloaked in the fanfare, it's a life of seeming comfort and glory. But underneath it all, people are searching for meaning in life, for love, for God. Buckle up and hold on tight.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Favorite Son",
        "Authors": "By Sohmer, Steve",
        "Description": "Aging FBI agent Mancusco and his ambitious young partner Ross pursue the assassin who killed Colonel Octavio Martinez and critically wounded Texas senator Terry Fallon, while Fallon's political career booms as a result of media attention",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Hawaii For Dummies (Dummies Travel)",
        "Authors": "By Leas, Cheryl Farr",
        "Description": "For newlyweds, singles, or families, Hawaii For Dummies covers everything necessary to plan the perfect trip:Charts and interactive quizzes to help determine which island to visitA wide assortment of planning tips and information on package tours, getting the best airfare, suitable accommodations, and moreThe best beaches, plus advice for enjoying water sports and other adventures and excursions",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Light His Fire",
        "Authors": "By Kreidman, Ellen",
        "Description": "Applying the principles of a six-week workshop on romantic relationships, this self-help guide explains how women can develop and maintain a long-term relationship filled with love, romance, excitement, and passion",
        "Category": " Self-help , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Beyond Prison Walls: The Jeris Bragan Story",
        "Authors": "By Bragan, Jeris E.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Review & Herald Pub Assn",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Prophecy of the Stones",
        "Authors": "By Bujor, Flavia and Coverdale, Linda",
        "Description": "In a magical realm, three teenage girls-Jade, Opal, and Amber-are chosen to fulfil an ancient prophecy. Although they meet as strangers, they must learn to trust one another with their lives as they embark on an epic journey, armed only with magical stones. On the day of their fourteenth birthdays, they set out on a quest that will require them to leave their homes and families to face fierce enemies in an effort to save an enchanted land called Fairytale, where magic reigns and evil is unknown. At the same time, in a parallel world, a young girl named Joa fights for her life in a hospital bed in Paris. While she is dreaming, she is transported to a magical realm where three young heroines fight a spectacular battle. Their success or failure will determine the fate of Fairytale.and Joa's survival. In 2002, Flavia Bujor became a media sensation around the world with this much heralded debut. Her novel has now been published in more than twenty-one countries and remains a bestseller in France and Germany. Her spontaneous, inspired voice and richly imagined world make The Prophecy of the Stones a truly enchanting fantasy.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Disney Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Arthur Fiedler and the Boston Pops",
        "Authors": "By Dickson, Harry Ellis",
        "Description": "A reminiscence told in anecdotal style encompasses the long career of the well-loved conductor and views the backstage workings of the orchestra he guided to the forefront of American popular music",
        "Category": " Music , Genres & Styles , Classical",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "FutureConsumer.Com: The Webolution of Shopping to 2010",
        "Authors": "By Feather, Frank",
        "Description": "Analyzes how online shopping will transform consumer behavior, forecasts online sales potential for twelve product categories, and speculates on which Web sites will dominate online shopping by 2010.",
        "Category": " Business & Economics , Structural Adjustment",
        "Publisher": "Warwick Publishing, Inc.",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Wildflower Designs for Needlework: Charts, Histories, and Watercolors of 29 Wildflowers",
        "Authors": "By Winter, Adalee",
        "Description": "Watercolor paintings and botanical information combine with charted graphs for embroidering or needlepointing twenty-nine wildflower patterns",
        "Category": " Art , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1979"
        }
    },
    {
        "Title": "Aging Well: A Guide for Successful Seniors",
        "Authors": "By Fries, James F.",
        "Description": "Gives sage advice for those planning on living a comfortable, healthy, contented, and successful life after 65",
        "Category": " Medical , General",
        "Publisher": "Perseus Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Go the Distance: The Making of a Promise Keeper",
        "Authors": "By Trent, John T. (EDT) and Colson, Charles W. (EDT)",
        "Description": "For Ingest Only - Data needs to be cleaned up for all products being loaded",
        "Category": " Religion , Faith",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Foods That Heal, Reverse Aging, and Extend Your Lifespan!",
        "Authors": "By American Medical Publishing Staff",
        "Description": "",
        "Category": "",
        "Publisher": "American Publishing Corp.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Ice Storm",
        "Authors": "By Moody, Rick",
        "Description": "As a freak winter storm bears down on an affluent, exclusive Connecticut suburb, two families, the Hoods and Williamses, struggle to cope with the emotional upheaval hidden below the surface of their select hometown. Reprint.",
        "Category": " Fiction , Literary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Encyclopedic Dictionary of English Usage",
        "Authors": "By Mager, N. H",
        "Description": "Defines more than fifteen thousand terms and expressions, offering notes on their accepted spellings and grammatical usage",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Better Homes and Gardens Eating Well: With the Food Guide Pyramid",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "A complete guide to the five basic food groups in the Food Guide Pyramid prepared by the USDA includes a wide variety of recipes for breakfast, lunch, dinner, and snack dishes, along with suggested menus, nutritional breakdowns, and tips on using the Food Guide Pyramid. Original. 25,000 first printing.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "44 Irish Short Stories",
        "Authors": "By Garrity, Devin A. (EDT)",
        "Description": "The Irish have always had a way with words.  Long ago they took on a language not their own and learned to re-word it into pure magic.  Nowhere is this magic more in evidence than in their short stories—stories that combine lyricism, humor and tragedy with rare imagination set in simple backgrounds, largely without props. The seemingly effortless art of the best Irish writers has an appeal that is naive and highly sophisticated at the same time; the disarming simplicity with which the tales are spun being somewhat misleading at first reading.  In this anthology there are gathered, for the first time in America, some of the more representative examples of Irish short fiction.  The emphasis is on variety.  All are a delight to read.  All have universal appeal.  Only 21 of the 44 have previously been published in this country.",
        "Category": " Fiction , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "More Redneck jokes",
        "Authors": "By Buford, Jim Bob",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Cockatiels Taming",
        "Authors": "By Teitler, Risa",
        "Description": "",
        "Category": "",
        "Publisher": "Thomasson Grant & Howell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "Jupiter: A Novel (The Grand Tour)",
        "Authors": "By Bova, Ben",
        "Description": "Grant Archer only wanted to study astrophysics. But the forces of the \"New Morality,\" the coalition of censorious do-gooders who run 21st-century America, have other plans for him. To his distress, Grant is torn from his young bride and sent to a research station in orbit around Jupiter, to spy on the scientists who work there. Their work may lead to the discovery of higher life forms in the Jovian system-with implications the New Morality doesn't like at all.What Grant's would-be controllers don't know is that his loyalty to science may be greater than his desire for a quiet life. But that loyalty will be tested in a mission as dangerous as any ever undertaken-a mission to the middle reaches of Jupiter's endless atmosphere, a place where hydrogen flows as a liquid, and cyclones larger than planets rage for centuries at a time.What lurks there is more than anyone has counted on...and stranger than anyone could possibly have imagined.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Science Fiction",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Helen Hayes: First Lady of the American Theatre",
        "Authors": "By Barrow, Kenneth",
        "Description": "Traces the life and career of one of America's foremost stage actresses, explains how she became involved in acting, and describes her major roles",
        "Category": " Performing Arts , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Blue Gold : A Novel from the NUMA Files",
        "Authors": "By Cussler, Clive and Kemprecos, Paul",
        "Description": "A Kurt Austin AdventureIn Serpent, his New York Times bestseller, Clive Cussler introduced Kurt Austin, a hero for the new millennium, and \"created a new bunch of NUMA supersleuths who infused his work with a...jolt of energy\" (The Denver Post). Now Austin and his crew slake their thirst for action as they attempt to drown an eco-extortionist's plan to control the world's freshwater supply.BLUE GOLDA Novel from the NUMA FilesFrom deep within the Venezuelan rain forest emanates the legend of a white goddess and a mysterious tribe with startling technical accomplishments. Few believe the tribe exists -- and even fewer suspect its deity may hold knowledge that can change the course of history.For National Underwater & Marine Agency crew leader Kurt Austin, an investigation into the sudden deaths of rare whales leads him to the Mexican coast, where someone tries to put him and his mini-sub permanently out of commission. Meanwhile, in South America's lush hills, a specially assigned NUMA crew turns up the white-goddess legend -- and a murderous cadre of bio-pirates intent on stealing medicinal secrets worth millions. Soon Austin and his crew realize they're working the opposite ends of the same grand scheme. A billionaire California tycoon is poised to rise to power by monopolizing the earth's vastly depleted freshwater reserves and ultimately dominate the world.Austin has a hunch Venezuela's mythical tribal goddess has some real roots in science, and may be the key to locating a secret formula that could turn vast amounts of seawater into fresh. But with each step into the bush, he and his NUMA team feel like fish out of water -- and must fight a deadly, twisting trail of enemies through a dense jungle of treachery, blackmail, and murder.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Certain Trumpets: The Call of Leaders",
        "Authors": "By Wills, Garry",
        "Description": "In his Pulitzer Prize- and National Book Critics Circle Award-winning Lincoln at Gettysburg, Garry Wills reframed our understanding of Lincoln the leader. Wills breathed new life into words we thought we knew and revealed much about a President so mythologized but often misunderstood. He showed how Lincoln's personality was less at issue than his followers' values and Lincoln's exquisite ability, in a mere 272 words, to reach them, to give the whole nation \"a new birth of freedom,\" and to weave a spell that has not yet been broken.Now Wills extends his extraordinary quality of observation and iconoclastic scholarship to examine the nature of leadership itself, perhaps history's most pivotal and emotionally charged topic. Almost the first thing people say about leaders is that we used to have them but now do not. Some blame this on the press, or on television, or on education. Others say we are manipulated, not led. Still others pore over book after book, searching for the perfect exemplar to imitate in order to achieve success.Wills offers a wide range of portraits drawn largely, but not exclusively, from American history and representing revolutionary, political, religious, business, artistic, sports, and military leaders - Franklin D. Roosevelt, Harriet Tubman, Eleanor Roosevelt, Andrew Young, Napoleon, King David, Ross Perot, George Washington, Socrates, Mary Baker Eddy, Carl Stotz, Martha Graham, Martin Luther King, Jr., Cesare Borgia, and Dorothy Day - each shown in the act of leading his or her followers. And after each example, Wills also provides an anti-type to help define the type better.He moves beyond the traditional study of elected officials and business giants, past the usual emphasis on glamour, forceful personality, or technique, to look at leaders of different scope and particular talents. Wills shows how leaders are shaped by the very circumstances in which they must shape others' actions. No one, after all, can be a leader without followers. Only the vital interplay of wills between leaders and followers can direct them both toward a goal.In Certain Trumpets leadership is not a static pose but becomes an exhilarating partnership. Once again Garry Wills has transformed the lens through which we see our leaders, our society, and ourselves.",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Straight Talk to Men and Their Wives (With Built-In Study Guide)",
        "Authors": "By Dobson, James C.",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "The New Grove Beethoven",
        "Authors": "By Kerman, Joseph and Tyson, Alan",
        "Description": "",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "The Duke Medical Center Book of Arthritis",
        "Authors": "By Trien, Susan Flamholtz and Pisetsky, David S.",
        "Description": "\"COMPREHENSIVE...A USEFUL SOURCE...RECOMMENDED.\"--Library JournalIf you are one of the nearly forty million people in the United States who suffers from some form of arthritis, you are probably confused by the myths and misinformation surrounding the illness. Arthritis is, in fact, not a single malady, but more than one hundred different diseases, each with its own cause, symptoms, characteristic progression, and treatment. Here, at last, from the world-renowned Duke University Medical Center, is an authoritative, complete, and fully up-to-date home reference for arthritis sufferers. It tells you:-- Who gets arthritis, and when-- How to identify arthritic diseases in their early stages-- What to expect at a complete examination-- How to become an active partner with your doctor in keeping your arthritis under control-- The actions and side effects of the primary drugs used to treat arthritis-- How to conduct an exercise program that is right for you-- How to alter your lifestyle and work habits to minimize your discomfortThe Duke Basic Arthritis Program is designed to relieve the symptoms of arthritis and prevent its complications. Taking into account your lifestyle, job, emotional make-up, and physical abilities, the Duke Basic Arthritis Program allows for an individualized treatment program based on the use of nonsteroidal anti-inflammatory drugs, daily rest, physical therapy, good health habits, and adjustments in your daily routines.Packed with up-to-the-minute information and written in a lucid, user-friendly style, this is an absolutely invaluable book for anyone with arthritis.",
        "Category": " Health & Fitness , Diseases , Musculoskeletal",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Fatal Victories",
        "Authors": "By Weir, William",
        "Description": "",
        "Category": " History , Military , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "365 Great Chocolate Desserts",
        "Authors": "By Haughton, Natalie",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Cakes & Cupcakes (Country Living Country Baker)",
        "Authors": "By Wing, Lucy (EDT)",
        "Description": "Shares recipes for traditional home-baked cakes, poundcakes, cupcakes, angel food and chiffon cakes, and cheesecakes",
        "Category": " Cooking , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Rodale's Sensational Desserts",
        "Authors": "By Bingham, Joan",
        "Description": "Discusses ingredients and storage, and shares recipes for cakes, cupcakes, cookies, pies, tarts, pastries, puddings, ice creams, waffles, pancakes, crepes, breads, muffins, coffee cakes, and diet desserts",
        "Category": " Cooking , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Healthy Home Cooking: Family Favorites Old and New for Today's Health-Conscious Cooks (Prevention Magazine's Quick & Healthy Low-Fat Cooking)",
        "Authors": "By Prevention",
        "Description": "Provides recipes for low-fat, low-cholesterol versions of popular comfort foods and related dishes such as Herbed Oven Fries, Country Captain Chicken, and Baked Chocolate Pudding",
        "Category": " Cooking , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Nutripoints: The Breakthrough Point System for Optimal Nutrition",
        "Authors": "By Matthews, Kathy and Vartabedian, Roy E.",
        "Description": "Outlines a simple program that evaluates the relative nutritional value of foods, assigns them a Nutripoint score, and helps Nutripoint users meet nutritional needs and avoid serious illnesses",
        "Category": " Medical , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Carcass Trade: A Smokey Brandon Mystery",
        "Authors": "By Ayres, Noreen",
        "Description": "Smokey's back, trying to discover the identity of a gruesomely destroyed corpse. Found in a burned car, it has no head, arms, or legs, and Smokey has the sneaking suspicion that it could be the remains of her ex-sister-in-law. As a former cop, Smokey is an easy choice to take the investigation further by going undercover into a cult world of nefarious business scams and outlaw bikers living on the edge. Putting evidence together through careful investigation and personal daring, she learns of another murder and finds herself witness to a third. Suddenly Smokey realizes she could be next.Carcass Trade is a ride through a California you never dreamed of at a temperature you wouldn't believe. It's a search for innocence that's lost and truth that's been forgotten. Among the dusty orange groves and crowded freeways of Southern California, deception is in the breeze. And only Smokey Brandon can clear the air. From the acclaimed author of A World the Color of Salt comes Carcass Trade, confirming Noreen Ayres's place as one of today's best writers of crime fiction.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "18.77",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Expectant Father: Facts, Tips, and Advice for Dads-To-Be",
        "Authors": "By Brott, Armin A. and Ash, Jennifer",
        "Description": "Describes the changes accompanying each month of pregnancy and covers financial concerns, emotions, ways to support one's partner, and preparation for fatherhood",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Abbeville Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "License Renewed",
        "Authors": "By Gardner, John",
        "Description": "Revived by adventure-writer John Gardner, Agent 007 returns in a new adventure, as he seeks the megalomaniac who has engineered the overrun of the world's nuclear plants",
        "Category": "",
        "Publisher": "Richard Marek Pubs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "The Carewise Guide: Self-Care from Head to Toe",
        "Authors": "By Smith, Ginny (editor), Weiss, Douglas (editor), and Reliance Medical Information, In",
        "Description": "",
        "Category": "",
        "Publisher": "Seattle, WA, U.S.A. : CareWise, Incorporated, 1996",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Certain Women: A Novel",
        "Authors": "By L'Engle, Madeleine",
        "Description": "A deftly woven drama that brings together elements of the theater, biblical narrative and the goings-on in unconventional families.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Social Crimes",
        "Authors": "By Hitchcock, Jane Stanton",
        "Description": "When her husband of twenty years dies under mysterious circumstances, leaving his fortune--and Jo's position in society--to a mysterious French countess, Jo Slater, once one of New York's leading grande dames, comes up with an ingenious scheme to seek revenge designed to recoup her fortune and reclaim her \"throne,\" with only a little murder standing in her way. Reprint. 75,000 first printing.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Miramax",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Search for Justice: A Defense Attorney's Brief on the O.J. Simpson Case",
        "Authors": "By Shapiro, Robert and Warren, Larkin",
        "Description": "From June 13, 1994, to October 3, 1995, Robert Shapiro stood in the middle of a drama that held millions of Americans in thrall. Now for the first time, the architect of the defense strategy tells the inside story of the O.J. Simpson trial from the beginning. In this book, the man who assembled the \"dream team\" answers the questions of fact, law, and ethics that were fired at him before and after the jury's verdict. With candor, wit, and compassion, Shapiro brings to light the details of what has been called \"the trial of the century,\" giving us revealing glimpses of the defendant and the others whose names became so familiar: Johnnie Cochran, F. Lee Bailey, Marcia Clark, Barry Scheck, Chris Darden, and Judge Lance Ito.At the heart of the book is the dramatic story of how Shapiro planned the defense strategy against what appeared to be overwhelming odds. Within minutes of his first meeting with O.J., he started \"thinking like the prosecution,\" lining up a powerful arsenal of lawyers, investigators, and expert witnesses to counter what the prosecution claimed was an open-and-shut case. In the midst of mounting the legal defense, Shapiro also had to deal with the tumult of a media circus, a fractious defense team, and his own priorities as a husband and father. Through it all, he maintained a steady hand and the quiet belief that justice would prevail. Confronting the prosecution's \"mountain of evidence,\" Shapiro and his defense team uncovered the elements of reasonable doubt in the faulty handling of blood samples and other mistakes made by the police as they rushed to erroneous conclusions.Robert Shapiro's reasoned and principled arguments about the Bill of Rights and the role and duty of a defense attorney will deepen our understanding of the verdict, the trial, and the place this story occupied in the American culture. Answering critics who charge that \"loopholes\" and legal tactics prevailed over justice, Shapiro convincingly demonstrates that the only possible verdict - even without the race card Johnnie Cochran flung on the table - was the conclusion of \"reasonable doubt\" reached by the jury.",
        "Category": " Law , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Social Security and Medicare: A Policy Primer",
        "Authors": "By Berkowitz, Edward D. and Kingson, Eric R",
        "Description": "Social Security and Medicare are of compelling concern to virtually all Americans because they impact lives so enduringly and directly through the protection they afford and the costs they entail. It is, indeed, the extraordinary social welfare commitment these programs represent and their concomitant expense that provoke such determined support and such fiscal concern. Kingson and Berkowitz provide a thorough, balanced, and highly accessible explanation of Social Security and Medicare. They explain the dilemmas facing policymakers and describe, through historical development, how the programs evolved and their present status. The authors superbly convey the complexity of issues while also clearly presenting the factual information essential to the understanding and discussion. Such key considerations as the adequacy of protection, the financing problems, issues of fairness, the response to disability, and the health care needs of the elderly are particularly focused on--the authors' are sensitive to the social welfare nature of the programs. A truly essential book not only for the classroom but the offices and living rooms of writers, administrators, planners, policymakers, social service practitioners, and the general public.",
        "Category": " Social Science , Social Work",
        "Publisher": "Praeger",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "What Men Want: Three Professional Single Men Reveal to Women What It Takes to Make a Man Yours",
        "Authors": "By Gerstman, Bradley, Pizzo, Christopher, and Seldes, Rich",
        "Description": "A Doctor, A Lawyer, and an Accountant tell You Everything You Need To Know About What Men Want.If you're like most women, you're in the dark about what men really think about love. This enormously helpful book takes you into the heart and mind of the single professional male to show you not only what but how he thinks about dating and being in love, about what turns him on, and what sends him running in the other direction.",
        "Category": " Family & Relationships , Dating",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "When Do Fish Sleep? and Other Imponderables of Everyday Life",
        "Authors": "By Feldman, David and Schwan, Kassie (ILT)",
        "Description": "The author draws on his store of unusual knowledge to respond to his readers' most challenging queries--such as Why are tennis balls fuzzy? and Why do fingernails grow faster than toenails?",
        "Category": "",
        "Publisher": "HarperPerennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Don't Know Much About Geography: Everything You Need to Know About the World but Never Learned",
        "Authors": "By Davis, Kenneth C.",
        "Description": "Don't Know Much About Geography by New York Times bestselling author Kenneth C. Davis is a fascinating and fun exploration of our planet. Geography is the hub from which other disciplines radiate: meteorology, ecology, geology, oceanography, demographics, cartography, agricultural studies, economics, and political science. In addition to presenting geographical trivia that’ll impress your friends, Davis explores 21st-century topics of global concern, including the role of the Internet and technology in transforming the lives of people around the world, how so-called developing nations develop, sustainability, and the debates over climate change and evolutionary science. This completely revised and updated version of Don't Know Much About Geography is an entertaining and illuminating grand tour of planet Earth.",
        "Category": "",
        "Publisher": "WmMorrowPB",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Moral Life of Children",
        "Authors": "By Coles, Robert",
        "Description": "Assesses the origins of moral consciousness in such diverse cultures as the United States, Brazil, Northern Ireland, South Africa, Poland, Southeast Asia, French Canada, and Nicaragua, examining children of a wide range of conditions and classes",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Atlantic Monthly Pr",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The King is Dead",
        "Authors": "By Shankman, Sarah",
        "Description": "While in Tupelo, Mississippi--home town of Elvis Presley--researching a book, Samantha Adams becomes involved in a murder investigation. By the author of Now Let's Talk of Graves. 50,000 first printing. $50,000 ad/promo.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Words of Inspiration (Private Prayers of Pope John Paul II) (v. 1)",
        "Authors": "By John Paul II, Pope",
        "Description": "AN OFFERING OF THE SELF  O Lord, may my soul be flooded with your light and know you more profoundly. Lord, give me so much love, that will unite me with you always. Lord, let me serve you and serve you well, on the paths that you wish to open to my existence here below.  Published under the authority of the Vatican, this remarkable volume brings together Pope John Paul II's inspiring reflections and illuminating words of hope, peace, love, compassion, and spirituality, in a beautiful edition to treasure.",
        "Category": " Religion , Prayerbooks , Christian",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Garfield on the Town",
        "Authors": "By Davis, Jim, Fentz, Mike (ILT), and Music, Lorenzo",
        "Description": "During a trip to the veterinarian, Garfield the cat escapes in the city, finds his mother, and discovers that his relatives are members of an unsavory gang of mousers",
        "Category": " Juvenile Fiction , Comics & Graphic Novels , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Melatonin: The Anti-Aging Hormone",
        "Authors": "By Levert, Suzanne",
        "Description": "TIME IN A BOTTLE One of Nature's powerful anti-oxidants immune system boosters, and anti-aging hormones, MELATONIN-a natural substance-has been researched to be safe and free from serious side effects. Not a prescription drug, it is inexpensive and available in most health food stores. The latest medical findings point out the many possibilities in using this amazing hormone: Slow down the aging processImprove sleepBoost our natural defenses against carcinogens, stress and other external toxinsRelieve depression and other mood disordersInhibit the development of cancer and act as an effective cancer treatmentReduce the risk of heart attack and strokeStem the progress of Alzheimer's diseaseAND MUCH MORETIME IN A BOTTLEOne of Nature's powerful anti-oxidants immune system boosters, and anti-aging hormones, MELATONIN-a natural substance-has been researched to be safe and free from serious side effects. Not a prescription drug, it is inexpensive and available in most health food stores. The latest medical findings point out the many possibilities in using this amazing hormone:Slow down the aging processImprove sleepBoost our natural defenses against carcinogens, stress and other external toxinsRelieve depression and other mood disordersInhibit the development of cancer and act as an effective cancer treatmentReduce the risk of heart attack and strokeStem the progress of Alzheimer's diseaseAND MUCH MORE",
        "Category": " Health & Fitness , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Sister Blood",
        "Authors": "By Haber, Karen",
        "Description": "Failing to capture the evil Yates Keller after conquering his empire, empath Kayla is forced to meet Keller when he claims to have captured her friends and fears she may be running into a trap. Original.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "DAW",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Leaning Tower of Babel and Other Affronts by the Underground Grammarian",
        "Authors": "By Mitchell, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Now Is the Time to Open Your Heart",
        "Authors": "By Walker, Alice",
        "Description": "The Pulitzer Prize–winning author of The Color Purple, Possessing the Secret of Joy, and The Temple of My Familiar now gives us a beautiful new novel that is at once a deeply moving personal story and a powerful spiritual journey. In Now Is the Time to Open Your Heart, Alice Walker has created a work that ranks among her ?nest achievements: the story of a woman’s spiritual adventure that becomes a passage through time, a quest for self, and a collision with love. Kate has always been a wanderer. A well-published author, married many times, she has lived a life rich with explorations of the natural world and the human soul. Now, at fifty-seven, she leaves her lover, Yolo, to embark on a new excursion, one that begins on the Colorado River, proceeds through the past, and flows, inexorably, into the future. As Yolo begins his own parallel voyage, Kate encounters celibates and lovers, shamans and snakes, memories of family disaster and marital discord, and emerges at a place where nothing remains but love. Told with the accessible style and deep feeling that are its author’s hallmarks, Now Is the Time to Open Your Heart is Alice Walker’s most surprising achievement.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "A Starter Garden: The Guide for the Horticulturally Hapless",
        "Authors": "By Merser, Cheryl and Dorell, Simon (ILT)",
        "Description": "Covers the basics of ornamental gardening, from what tools to buy and how to plant shrubs, perennials, herbs, annuals, and roses, to finishing touches and year-round maintenance",
        "Category": " Gardening , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Quakertown",
        "Authors": "By Martin, Lee",
        "Description": "An evocative novel set against the backdrop of 1920s Texas captures the lives of members of a flourishing African-American community segregated from its white neighbors as two families--one white and one black--become caught up in a shameful, real-life episode from north Texas's history. A first novel. 12,500 first printing.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Life-Span Development",
        "Authors": "By Santrock, John W.",
        "Description": "",
        "Category": "",
        "Publisher": "William C Brown Pub",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Hot, Hotter, Hottest!",
        "Authors": "By Hazen, Janet",
        "Description": "Fifty recipes based on five fiery ingredients ginger, horseradish, peppercorns, chilies, and mustard reveal the diversity and vivid flavors of spicy cuisine from around the world. Each recipe is rated by degree of heat and includes adjustments to increase or reduce spiciness. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Cooking , Reference",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Fifty Two Simple Things You Can Do to Be Pro-Life",
        "Authors": "By Pierson, Anne and Risser, Carol",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The Wordwatcher's Guide to Good Writing and Grammar",
        "Authors": "By Freeman, Morton S.",
        "Description": "Provides quick access to basic questions and problems encountered with English grammar and usage",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Creating a New Civilization: The Politics of the Third Wave",
        "Authors": "By Toffler, Alvin and Toffler, Heidi",
        "Description": "Describes the forces that are shaping the future, discusses changes in family life, business, technology, culture, and values, and looks at the state of democracy in the next century",
        "Category": " Social Science , General",
        "Publisher": "Turner Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "House",
        "Authors": "By Kidder, Tracy",
        "Description": "The author of \"The Soul of a New Machine\" analyzes the intimate details of building a new house from the point of view of those involved--from owners and architects to builders and carpenters",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Fire with Fire: The New Female Power and How It Will Change the 21st Century",
        "Authors": "By Wolf, Naomi",
        "Description": "The author of the best-selling The Beauty Myth argues that today's feminism is far out of sync with women's lives and offers a guide toward revitalization and inclusion. 100,000 first printing. $75,000 ad/promo. Tour.",
        "Category": " Social Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Hula",
        "Authors": "By Shea, Lisa",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Burpee American Gardening Series: Annuals",
        "Authors": "By Bales, Suzanne Frutig",
        "Description": "America's gardening authority for more than a century introduces a new series for the home gardener ? an invaluable reference for beginning and experienced gardeners alike Annuals Features:Detailed descriptions of more than 70 outstanding annuals, including recommended varieties and tips for design, color, and companion plantingComplete cultural information, advice on soil preparation, scores of tips, and essential information on both new and old-fashioned annual favoritesA superb \"plant portrait\" section ? every annual explained and fully illustrated with many entries showing multiple photos to distinguish confusing varietiesSpecial chapters include \"Designing an Annual Garden,\" \"The Annual Planting and Growing Guide\" and moreEach volume in the Burpee American Gardening Series features:Environmentally sound and organic gardening practicesThe authoritative review of Burpee's staff of horticulturists and plant breedersA full chapter devoted to questions most frequently asked of Burpee's Customer Service, with in-depth answersDown-to-earth, easy-to-follow adviceThorough cross-referencing with Latin and common names for easy useFabulous color photography throughoutThe newly revised USDA Plant Hardiness Map of the United StatesA Selection of the Book-of-the-Month Club",
        "Category": " Gardening , Flowers , Annuals",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Salty Seagull: A Tale of an Old Salt (No. 12 in Suzanne Tate's Nature Series)",
        "Authors": "By Tate, Suzanne and Melvin, James (ILT)",
        "Description": "The tale of an old bird whose wise ways save his flock teaches children respect of elders",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Nags Head Art, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The Nature of Human Consciousness: A Book of Readings",
        "Authors": "By Ornstein, Robert E. (COM)",
        "Description": "",
        "Category": "",
        "Publisher": "W.H. Freeman",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Microsoft DOS 6 (Quick Reference Guide)",
        "Authors": "By Schwartz, Karl",
        "Description": "",
        "Category": "",
        "Publisher": "D D C Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Secrets of Spiritual Stamina",
        "Authors": "By Briscoe, Stuart",
        "Description": "",
        "Category": "",
        "Publisher": "Billy Graham Evangelistic Assoc. / Harold Shaw",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Smart Speaking: 60-Second Strategies for More than 100 Speaking Problems and Fears",
        "Authors": "By Yudkin, Marcia and Schloff, Laurie",
        "Description": "A guide to effective speech offers to-the-point, practical advice on breaking into a conversation, keeping cool in front of a group, getting past a protective secretary on the telephone, keeping meetings on track, and more. Reprint.",
        "Category": " Psychology , Cognitive Psychology & Cognition",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Newt: Leader of the Second American Revolution",
        "Authors": "By Williams, Dick",
        "Description": "Profiles the Speaker of the House of Representatives and presents the Republican legislator's views on current political, economic, and social issues",
        "Category": "",
        "Publisher": "Longstreet Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Becker scandal,: A time remembered",
        "Authors": "By Delmar, Vina",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt, Brace & World",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Conversations in the Raw; Dialogues, Monologues, and Selected Short Subjects",
        "Authors": "By Reed, Rex",
        "Description": "",
        "Category": "",
        "Publisher": "The World Publishing Company",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Forrest Gump: My Favorite Chocolate Recipes: Mama's Fudge, Cookies, Cakes, and Candies",
        "Authors": "By Groom, Winston",
        "Description": "Forrest Gump always said that the most wonderful scent there ever was comin' from the kitchen was somethin' chocolate cookin' in the oven.He said it from the time he was a small boy in braces, \"'cause I knew I was gonna get to lick the spoon.\" The smell of chocolate cookin' puts Forrest in mind of his Mama. And nothin' is as important to Forrest as his Mama and what she taught him about life and love. You can take a chocolate, Forrest learned, and when you bite down, it may not be the one you wanted. But it's yours from then on. And you need to remember to enjoy it. \"Life ain't so much different,\" says Forrest. And his Mama never let him forget it.If Forrest wasn't lovin' his Mama's shrimp, he was lovin' her chocolate. Forrest already said grace over The Bubba Gump Shrimp Co. Cookbook. So now he's takin' time to give his blessing to his Mama's chocolate recipes. His Mama always knew the place to go for great recipes was her favorite magazine, Southern Living, which practically invented the best-ever chocolate desserts. Each one of these recipes was tested in their own kitchens for extra goodness.You talk about chocolates! Wait'll you taste Forrest's Fudge Cake or Real Good Chocolate Caramels or Mighty Nice Chocolate Pastry Cake or Chocolate-Pecan Torte or (if you're gonna get fancy) Chocolate-Mint Truffles or plain old Candy Bar Brownies or Alabama Ice Cream Squares or, oh goodness!, an Almond-Macaroon Tart. You may have to put this book down and go cook somethin' before you get a faintin' spell.Just remember what Forrest learned from his Mama: You never know what you're gonna get when you pick up a chocolate. But you do know this - if it comes from this book, it's gonna be plenty good.",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Super snacks",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Along Martin Luther King: Travels on Black America's Main Street",
        "Authors": "By Tilove, Jonathan, Falco, Michael (PHT), and Falco, Michael",
        "Description": "Over the course of two years, Jonathan Tilove and freelance photographer Michael Falco traveled along some of the 650 Martin Luther King Jr. streets, avenues, and boulevards across the country--in Harlem; Belle Glade, Florida; Atlanta; Selma, Alabama; Jackson and Canton, Mississippi; Chicago; Oakland, California; Portland, Oregon; and nearly a score of cities and towns throughout Texas, Louisiana, Arkansas, Oklahoma, and Kansas.As this journey reveals, life along King is at once tightly conjoined and kaleidoscopically diverse. And that is precisely what Tilove has lyrically portrayed in the writing of this book, and what Falco has so superbly illumined with his rich photographs of the people along Martin Luther King.We meet Annie Williams, who lives  and works on Belle Glade’s Martin Luther King Jr. Boulevard, managing the Sudsy City Laundromat, and who likes the idea that every black community she visits now has a main street with a common name; and Marion Tumbleweed Beach, a seventy-three-year-old teacher, writer, poet, reporter, editor, and activist who lives on Martin Luther King Street in Selma, Alabama, but finds the phenomenon a source of dismay: “I say they still get us with trinkets. We go cheap. I resent it.”Tilove writes of the King streets: “Map them and you map a nation within a nation, a place where white America seldom goes and black America can be itself. It is a parallel universe with a different center of gravity and distinctive sensibilities, kinship at two or three degrees of separation, not six. There is no other street like it.”",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Random House",
        "Price Starting With ($)": "12.64",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "By the beautiful sea: The rise and high times of that great American resort Atlantic City",
        "Authors": "By Funnell, Charles E.",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf; [distributed by Random House",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Ronald Reagan: The Pictorial Biography",
        "Authors": "By Gallick, Sarah",
        "Description": "More than 130 black-and-white and full-color photographs highlight an informative pictorial biography of America's fortieth president, detailing his life from his childhood, through his Hollywood career, to the presidency.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Puerto Vallarta Squeeze",
        "Authors": "By Waller, Robert James",
        "Description": "The author of the blockbuster The Bridges of Madison County blends passion and adventure in the story of an American novelist in Mexico and his young lover, who take a trip with a killer. National ad/promo. Tour.",
        "Category": " Fiction , Literary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Commitment to Love",
        "Authors": "By Jerry B. Jenkins and Deanna McClary",
        "Description": "",
        "Category": "",
        "Publisher": "Clebe McClary Evangelistic Association",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "My Sergei: A Love Story",
        "Authors": "By Gordeeva, Ekaterina and Swift, E. M.",
        "Description": "The Olympic gold medalist offers a poignant, loving account of her life with her long-time partner and beloved husband, Sergei Grinkov, from their first introduction and successive world pairs skating championships, to their storybook romance and marriage, to the fatal heart attack that took Sergei's life. Tour.",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Twenty One Days to a Trained Dog",
        "Authors": "By Maller, Dick",
        "Description": "No one is more qualified to teach you how to train your dog than Dick Maller, president of the U.S. Professional Dog Trainers' Association and operator of the famous Maller School for Dogs, whose dogs have won over 100 awards and have appeared in movies and on television. Here is his easy-to-follow, effective, and above all, humane approach to training your puppy or full-grown dog in only 21 days. Using \"operant conditioning\" and \"positive reinforcement\" as the two basic training techniques, the author shows you:  * how to housebreak your puppy quickly and painlessly * how to break your dog's bad habits (barking, chewing, chasing cars and bicycles, jumping up on visitors, howling when left alone) * how to train your dog to follow simple commands (sit, heel, turn, stay, lie down and come) * how to teach your dog to fetch, jump, catch, carry or retrieve an object.  The simple Maller method is your guide to raising a happy, obedient dog -- one who follows your orders not out of fear (as in traditional training methods), but out of delight in pleasing you -- every time.",
        "Category": " Pets , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "In All His Glory: The Life of William S. Paley : The Legendary Tycoon and His Brilliant Circle",
        "Authors": "By Smith, Sally Bedell",
        "Description": "A portrait of television's greatest tycoon draws from hundreds of interviews, capturing the man behind the scenes",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Low-Fat Living for Real People, Updated & Expanded: Educates lay people on making sound nutritional decisions that will stay with them for a lifetime. --American Dietetic Association",
        "Authors": "By Levy, Linda and Grabowski, Francine",
        "Description": "A comprehensive dietary guide distinguishes between good and bad fats and offers a wealth of nutritional advice, along with simple, low-fat recipes, information on reading food labels, strategies for eating out, and more. Original. Tour.",
        "Category": " Health & Fitness , Diet & Nutrition , Food Content Guides",
        "Publisher": "Lake Isle Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Footnote Washington: Tracking the Engaging, Humorous, and Surprising Bypaths of Capital History",
        "Authors": "By Rash, Bryson B.",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Epm Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "The Science Digest Book of Halley's Comet",
        "Authors": "By Tullius, John",
        "Description": "Describes the characteristics and structure of comets, traces the history of Halley's Comet, and tells how to observe it during its 1985 appearance",
        "Category": " Science , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    }
]