[
    {
        "Title": "Reverse Diabetes Now",
        "Authors": "By Neal D. Barnard",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "A Tribe Apart: A Journey into the Heart of American Adolescence (Ballantine Reader's Circle)",
        "Authors": "By Hersch, Patricia",
        "Description": "For three fascinating, disturbing years, writer Patricia Hersch journeyed inside a world that is as familiar as our own children and yet as alien as some exotic culture--the world of adolescence. As a silent, attentive partner, she followed eight teenagers in the typically American town of Reston, Virginia, listening to their stories, observing their rituals, watching them fulfill their dreams and enact their tragedies. What she found was that America's teens have fashioned a fully defined culture that adults neither see nor imagine--a culture of unprecedented freedom and baffling complexity, a culture with rules but no structure, values but no clear morality, codes but no consistency.Is it society itself that has created this separate teen community? Resigned to the attitude that adolescents simply live in \"a tribe apart,\" adults have pulled away, relinquishing responsibility and supervision, allowing the unhealthy behaviors of teens to flourish. Ultimately, this rift between adults and teenagers robs both generations of meaningful connections. For everyone's world is made richer and more challenging by having adolescents in it.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "General Chemistry (Available 2010 Titles Enhanced Web Assign)",
        "Authors": "By Ebbing, Darrell D.",
        "Description": "Known for its carefully developed, thoroughly integrated approach to problem solving, this market-leading text emphasizes the conceptual understanding and visualization skills essential for first-year chemistry and science majors. The new technology program reinforces the approach of the text and provides a complete solution for teaching and learning.The Eighth Edition retains the hallmark pedagogical features of the text and builds upon the conceptual focus and art program. Students also benefit from online homework in the technology program, which features an extensive database of questions drawn from the text.",
        "Category": " Science , Chemistry , General",
        "Publisher": "Brooks Cole",
        "Price Starting With ($)": "8.82",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "CliffsStudySolver Chemistry",
        "Authors": "By Henrickson, Charles",
        "Description": "The CliffsStudySolver workbooks combine 20 percent review material with 80 percent practice problems (and the answers!) to help make your lessons stick.CliffsStudySolver Chemistry is for students who want to reinforce their knowledge with a learn-by-doing approach. Inside, you’ll get the practice you need to learn Chemistry with problem-solving tools such asClear, concise reviews of every topicPractice problems in every chapter — with explanations and solutionsA diagnostic pretest to assess your current skillsA full-length exam that adapts to your skill levelA glossary, examples of calculations and equations, and situational tasks can help you practice and understand chemistry. This workbook also covers measurement, chemical reactions and equations, and matter — elements, compounds, and mixtures. Explore other aspects of the language includingFormulas and ionic compoundsGases and the gas lawsAtomsThe mole — elements and compoundsSolutions and solution concentrationsChemical bondingAcids, bases, and buffersPractice makes perfect — and whether you're taking lessons or teaching yourself, CliffsStudySolver guides can help you make the grade.Author Charles Henrickson received his Ph.D. in chemistry from the University of Iowa. He has authored and coauthored several widely used learning aids and laboratory manuals in chemistry as well as a textbook. He is a professor of chemistry, emeritus at Western Kentucky University in Bowling Green.",
        "Category": " Science , Chemistry , General",
        "Publisher": "Cliff Notes",
        "Price Starting With ($)": "5.65",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "If..., Volume 2: (500 New Questions for the Game of Life) (If Series)",
        "Authors": "By McFarlane, Evelyn and Saywell, James",
        "Description": "If you found out for certain there is a Heaven and a Hell, how would you change your life? If you had to name the one thing that most frightens you about growing old, what would it be? If you could have only one part of your body massaged every day, what part would you choose? If you could have any view in the world visible from your bed, what would it be? If you could suddenly find out that one work of fiction was actually true, what book would you select? If you could name the sexiest words anyone could say to you, what would they be? If you could put anyone you know on Prozac, who would you choose? If you could be the house cat or lap dog of any person on earth, whose would you choose to be?If...(Questions for the Game of Life) was a bestselling sensation with readers around the world. If 2 is a collection of 500 completely new and tantalizing, provocative questions that really make you think. It's an excellent source for party games, office water-cooler conversation, family dinners, and nights out at the local tavern. Crack open the secret dreams, the hidden desires, and the real personalities of your friends, your family, your lovers--and even yourself--with If 2...",
        "Category": " Psychology , Creative Ability",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Cook Right 4 Your Type: The Practical Kitchen Companion to Eat Right 4 Your Type",
        "Authors": "By Whitney, Catherine and D'Adamo, Peter J.",
        "Description": "After nearly twenty years of research, Dr. Peter J. D’Adamo revealed the connection between blood type, diet, and health in Eat Right 4 Your Type. Now, with a team of chefs, he helps you design a total health program that’s right for your blood type. Cook Right 4 Your Type is the essential guide for living with a sensible diet individualized for you that allows you to eat food that seems like a major indulgence. With possibilities ranging from lamb stew to lemon squares, and braised vegetables to delicious soups, you'll barely notice you’ve started a regimen designed to optimize your health, your weight, and your total well-being. Cook Right 4 Your Type includes:• Individualized 30-day meal plans for each blood type• More than 200 great-tasting recipes• Food lists and shopping guides• An easy-to-follow food program",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Complete Book of Les Miserables",
        "Authors": "By Behr, Edward",
        "Description": "Shows scenes from the popular musical based on Victor Hugo's novel, traces the development of the show, and includes the libretto",
        "Category": " Music , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Costing the Earth: The Challenge for Governments, the Opportunities for Business",
        "Authors": "By Cairncross, Frances",
        "Description": "",
        "Category": " Business & Economics , Government & Business",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Right Turns: From Liberal Activist to Conservative Champion in 35 Unconventional Lessons",
        "Authors": "By Medved, Michael",
        "Description": "Nationally syndicated talk-radio host and noted film critic Michael Medved has taken an extraordinary journey from liberal activist to outspoken conservative. Along the way he has earned millions of admirers—and more than his share of enemies—with his disarming wit and slashing arguments on issues of pop culture and politics.In the candid, illuminating Right Turns, Medved chronicles the lessons and adventures that changed him from a Vietnam protest leader to an optimistic promoter of American patriotism, from secularism to religion, from adventurous single guy to doting husband and father. He skewers leftist orthodoxy, revealing why the Right is right and why his former colleagues on the Left remain hopelessly wrong on every cultural, political, and social issue.",
        "Category": " Biography & Autobiography , Editors, Journalists, Publishers",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Social Welfare: a History of the American Response to Need",
        "Authors": "By Axinn, June",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Meg Mackintosh and the Mystery at the Medieval Castle - title #3: A Solve-It-Yourself Mystery (3) (Meg Mackintosh Mystery series)",
        "Authors": "By Landon, Lucinda",
        "Description": "Meg and her classmates visit a medieval castle and become eyewitnesses to the theft of a priceless silver chalice. The reader is asked to solve the mystery before Meg, using clues found in the text and illustrations.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Secret Passage Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Art and History of Venice (Bonechi Art & History Collection)",
        "Authors": "By casa-bonechi",
        "Description": "",
        "Category": "",
        "Publisher": "Casa Editrice Bonechi",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Listen Up, Honey: Good News for Your Soul!",
        "Authors": "By Wells, Thelma",
        "Description": "Thelma Wells is a mentor and a friend.  Catch her on the run at a Women of Faith conference, or spend a year in her mentoring class, and you're going to be nourished by someone who understands real life and a real relationship with God.As a child, she suffered abuse; as an adult, she is the personal manifestation of love and acceptance.  Inspired by the bumblebee who works hard to sweeten the lives of others, Thelma is the queen bee.  With bite-sized morsels of wit and reality-based wisdom, flavored always with kindness and grace, Listen Up, Honey! brings sweetness to life without sugar-coating it.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Henry And Mudge In The Sparkle Days",
        "Authors": "By Rylant, Cynthia",
        "Description": "Henry and his dog Mudge experience the sparkly joys of winter in this fifth Ready-to-Read book of their adventures.Henry and his 180-pound dog Mudge are best friends forever. And they're ready for a snowy winter!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Blue Zone: A Novel",
        "Authors": "By Gross, Andrew",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Daddy's Girl",
        "Authors": "By Scottoline, Lisa",
        "Description": "Natalie Greco loves being a law professor, even though she can't keep her students from cruising sex.com during class and secretly feels like Faculty Comic Relief. She loves her family, too, but as a bookworm, doesn't quite fit into the cult of Greco football, headed by her father, the team captain. The one person she feels most connected to is her colleague, Angus Holt, a guy with a brilliant mind, a great sense of humor, a gorgeous facade, and a penchant for helping those less fortunate. When he talks Nat into teaching a class at a local prison, her comfortably imperfect world turns upside down.A violent prison riot breaks out during the class, and in the chaos, Nat rushes to help a grievously injured prison guard. Before he dies, he asks her to deliver a cryptic message with his last words: \"Tell my wife it's under the floor.\"The dying declaration plunges Nat into a nightmare. Suddenly, the girl who has always followed the letter of the law finds herself suspected of a brutal murder and encounters threats to her life around every curve. Now not only are the cops after her, but ruthless killers are desperate to keep her from exposing their secret. In the meantime, she gets dangerously close to Angus, whose warmth, strength, and ponytail shake her dedication to her safe boyfriend.With her love life in jeopardy, her career in the balance, and her life on the line, Nat must rely on her resources, her intelligence, and her courage. Forced into hiding to stay alive, she sets out to save herself by deciphering the puzzle behind the dead guard's last words . . . and learns the secret to the greatest puzzle of all&#8212herself.Filled with the ingenious twists, pulse-pounding narrative drive, and dynamic, flesh-and-blood characters that are the hallmarks of her bestsellers, Daddy's Girl is another wild, entertaining ride about love, family, and justice from the addictively readable Lisa Scottoline.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Guerrilla P.R.",
        "Authors": "By Levine, Michael",
        "Description": "The manifesto for waging a street-smart publicity campaign with no- or low-cost strategies from one of Hollywood's most successful publicists.",
        "Category": " Social Science , Media Studies",
        "Publisher": "HarperPb",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Nature (Discover Hidden Worlds)",
        "Authors": "By Amery, Heather",
        "Description": "Featuring things usually too small to be seen by the human eye, a collection of photographs showcasing the diversity of nature includes magnified images of seashells, eggshell pores, snowflakes, sand, plant life, and examples from the animal world.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Human Body (Discover Hidden Worlds)",
        "Authors": "By Amery, Heather and Songi, Jane",
        "Description": "Startling pictures of eyes, hair, nails, skin, bones, and blood magnified thousands of times, along with informative text and humorous cartoons, help children learn about the many activities going on all it once inside the human body.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Yani: The Brush of Innocence",
        "Authors": "By Ho, Wai-Ching",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Hudson Hills Pr",
        "Price Starting With ($)": "14.93",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "This Book Will Change Your Life",
        "Authors": "By Benrik, Delehag, Henrik, and Carey, Ben",
        "Description": "Is the year ahead looking much the same as the last? Another 365-day grind of meetings, dinner dates, and deadlines? If so, try this book.   Part instruction manual, part therapy, part religious cult, part sheer anarchy, This Book Will Change Your Life will help you poke a stick in the spokes of your routine.   It's not the soft-hearted kind of book that's interested in what you have to say; rather it contains 365 daily orders, each one of which could turn your humdrum existence into a daily free-fall.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "QuarkXPress 6 for Windows & Macintosh",
        "Authors": "By Weinmann, Elaine and Lourekas, Peter",
        "Description": "If you're like most designers and publishers who work with QuarkXPress, you've been waiting a long time for this release. In fact, you're probably one of the last people on your block to start using Mac OS X or Windows XP because you've been waiting for your most important application--QuarkXPress--to offer native support for either. Well, the wait is finally over, and here to get you up to speed on it quickly and easily isQuarkXPress 6 for Windows and Macintosh: Visual QuickStart Guide. In these pages, best-selling authors and veteran educatorsElaine Weinmann and Peter Lourekas use task-based, step-by-step instruction and loads of visual aids to provide a soup-to-nuts grounding in QuarkXPress 6, including all that's new in this ground-breaking release: project files containing multiple layouts, Synchronized Text, improved table creation, and more. Progressing from the basics of planning and designing layouts, working with text, and creating and importing graphics to more advanced topics like exporting documents as Web pages and adding hyperlinks, this indispensable reference covers it all.",
        "Category": " Computers , Desktop Applications , Desktop Publishing",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Ysabel",
        "Authors": "By Kay, Guy Gavriel",
        "Description": "Ned Marriner is spending six weeks with his father in France, where the celebrated photographer is shooting Saint-Sauveur Cathedral in Aix-en-Provence. Both father and son fear for Ned's mother - a physician with Doctors Without Borders, currently assigned to the civil war-torn country of Sudan. This is not the first time she's placed herself in harm's way to help alleviate suffering - and Ned has inherited her courage. He'll need it.While exploring the cathedral, Ned meets Kate Wenger, an American exchange student with a deep knowledge of the area's history. But even Kate is at a loss when she and Ned surprise a scar-faced stranger, wearing a leather jacket and carrying a knife, deep inside the cathedral. \"I think you ought to go now,\" he tells them. \"You have blundered into a corner of a very old story...\"In this ancient place, where the borders between the living and the long-dead are thin, Ned and his family are about to be drawn into a haunted tale, as mythic figures from conflicts of long ago erupt into the present, changing - and claiming - lives.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Roc Hardcover",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Religion for A New Generation (2nd Edition)",
        "Authors": "By Needleman, Jacob",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Pearson",
        "Price Starting With ($)": "6.19",
        "Publish Date": {
            "Month": "March",
            "Year": "1977"
        }
    },
    {
        "Title": "Perfect Weight America",
        "Authors": "By Rubin, Jordan",
        "Description": "Presents a sixteen-week, four-phase weight management plan that purports to burn fat, boost energy, improve digestion, reduce stress, and cleanse toxins from the body.",
        "Category": " Religion , General",
        "Publisher": "Siloam Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Bipolar Child: The Definitive and Reassuring Guide to Childhood's Most Misunderstood Disorder",
        "Authors": "By Papolos, Janice and Papolos, Demitri F., M.D.",
        "Description": "After almost three years in print and more than 100,000 copies sold, The Bipolar Child has made an indelible mark on the field of psychiatry and has become the resource that families rely on. Now in the first book about early-onset bipolar disorder is completely revised and expanded. Bipolar disorder--manic depression--was once thought to be rare in children. Now researchers are discovering that not only can bipolar disorder begin very early in life, but also that it is much more common than ever imagined. Yet the illness is often misdiagnosed or overlooked. Why?  Bipolar disorder manifests itself differently in children than in adults, and in children there is an overlap of symptoms with other childhood psychiatric disorders. As a result, these kids may be given any number of psychiatric labels: \"ADHD,\" \"Depressed,\" \"Oppositional Defiant Disorder,\" \"Obsessive-Compulsive Disorder,\" or \"Separation Anxiety Disorder.\" Too often they are treated with stimulants or antidepressants--medications that can actually worsen the bipolar condition.Since the publication of the first edition, thousands of families have gotten to the root of their children’s behaviors, and found the answers they were looking for in The Bipolar Child. Drawing upon recent advances in the fields of neuroscience and genetics, the Papoloses convey what is known and not known about the illness. They comprehensively detail the diagnosis, tell how to find good treatment and medications, and advise parents about ways to advocate effectively for their children at school. Included in these pages is the first Individual Education Plan--IEP--ever published for a bipolar child. The book also offers critical information about the stages of adolescence, hospitalization, the world of insurance, and the psychological impact the illness has on the child. New to this edition are information on promising new mood-stabilizing drugs and omega-3 fatty acids, more advice on getting appropriate school accommodations, and a full discussion about the complexities of family life when more than one family member has the illness. A critical new chapter deals with the deficits in the area of executive functions that have recently been identified as a common feature of a bipolar disorder. This chapter walks parents through a neuropsychological testing and–for the first time–recommends a specific battery of tests that should be administered to these children and adolescents. The Bipolar Child is rich with the voices of parents, siblings, and the children themselves, opening up the long-closed world of the families struggling with this condition. Already proven, in its original edition, to be an invaluable resource for parents whose children suffer from mood disorders, as well as the professionals who treat and educate them, this book will prove to have major public health significance.",
        "Category": " Family & Relationships , Children with Special Needs",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Seven Prayers That Will Change Your Life Forever",
        "Authors": "By Omartian, Stormie",
        "Description": "In Seven Prayers, best-selling author Stormie Omartian explains how praying seven simple prayers can bring dramatic and positive changes to your life. These prayers include: Prayer of Confession, Prayer of Salvation, Prayer of Pardon, Prayer of Promise, Prayer of Submission, Prayer of Praise, and Prayer for Blessing. This book holds the keys to a whole new way of living.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Jasmine: Soaring to the Stars",
        "Authors": "By Grace Windsor",
        "Description": "",
        "Category": "",
        "Publisher": "Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Cinderella, an Evening to Remember (my princess collection book two)",
        "Authors": "By Grace Windsor",
        "Description": "",
        "Category": "",
        "Publisher": "Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Magnificent Seven: The Authorized Story of American Gold",
        "Authors": "By Kleinbaum, N. H.",
        "Description": "These are the seven young women vaulted to Olympic glory by becoming the first United States gymnasts ever to win team gold. Now The Magnificent Seven: The Authorized Story of American Gold tells each gymnast's story, based on exclusive interviews.These young women's incredible talent, determination, and spirit electrified the more than sixty million television spectators who watched as the team didn't miss a beat. Starting on the uneven bars, the gymnasts performed one flawless routine after another. The beam was the same awesome story. Then came the dazzling tumbling passes during the floor exercises, followed by the unforgettable high drama of the vaults.Throughout, the crowd's thunderous chants of \"U.S.A.! U.S.A.!\" filled Atlanta's Georgia Dome. The Magnificent Seven - magnificent to the end - epitomized the grace and courage of all American champions and of all athletes. Together Amanda Borden, Amy Chow, Dominique Dawes, Shannon Miller, Dominique Moceanu, Jaycie Phelps, and Kerri Strug delivered the most magical and dazzling night of the Centennial Olympic Games - and together they have become America's golden sweethearts.In The Magnificent Seven: The Authorized Story of American Gold, each gymnast tells how it felt on that dream-come-true Olympic night; how she got started in the sport; how she trained intensely for years; and all about her coaches, her family, her post-Olympic plans, and much more.",
        "Category": " Sports & Recreation , General",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "LOW BLOOD SUGAR Hypoglycemia: The 20th Century Epidemic?",
        "Authors": "By Budd, Martin",
        "Description": "\"A lucid explanation of what hypoglycemia is and how a low blood-sugar level manifests itself in physical symptoms as well as personality traits.... Cites research linking low blood sugar to migraine headaches, asthma and hay fever, arthritis, and diabetes.... Methods of diagnoses are detailed.... A useful text.\"--Booklist.    128 pages, 5 1/2 x 8 1/2.",
        "Category": " Health & Fitness , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Postillion Struck by Lightning",
        "Authors": "By Bogarde, Dirk",
        "Description": "",
        "Category": "",
        "Publisher": "Triad/Panther & Penguin",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Schaum's Outline of Theory and Problems of Statistics (Schaum's Outline Series)",
        "Authors": "By Murray R. Spiegel",
        "Description": "",
        "Category": "",
        "Publisher": "Schaum Pub Co",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "The Best of the Great Smoky Mountains National Park: A Hiker's Guide to Trails and Attractions (Tag-Along Books) (German Edition)",
        "Authors": "By Manning, Russ and Jamieson, Sondra",
        "Description": "",
        "Category": " Travel , Parks & Campgrounds",
        "Publisher": "Mountain Laurel Place",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Clinical Neuroanatomy Made Ridiculously Simple (MedMaster Series)",
        "Authors": "By Goldberg, Stephen",
        "Description": "",
        "Category": " Medical , Neurology",
        "Publisher": "MedMaster",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "You Are What You Say: Cure for the Troublesome Tongue",
        "Authors": "By Mains, Karen Burton",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Finding Peace Within",
        "Authors": "By White, E. G.",
        "Description": "",
        "Category": "",
        "Publisher": "IBE, INC.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Hyper-chondriac: One Man's Quest to Hurry Up and Calm Down",
        "Authors": "By Frazer, Brian",
        "Description": "Does your blood pressure surge if the car in front of you turns without signaling? Do your neck veins pulsate when a cashier takes too long to ring you up? Does relaxing seem like it'll have to wait until you're dead? Then your name could very well be Brian Frazer.On paper, Frazer is the world's healthiest guy. He eats right, exercises regularly, gets plenty of sleep, has never smoked and has missed only one day of flossing in the last five years. But inside he's a swirling vortex of angst, capable of contracting a new malady every month. Once Frazer realized that all his ills were tied to stress, he went on a quixotic quest for calm, venturing into everything from Tai Chi, serotonin blockers and Kabbalah to an unfortunate incident involving pineapple-chicken curry at a Craniosacral therapy session. Never has the road to wellville taken so many unforeseen turns.Achingly funny, uncomfortably true and always entertaining, Hyperchondriac is just the medicine for anyone who wants to take it down a notch.",
        "Category": " Medical , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Seven Sins for a Life Worth Living",
        "Authors": "By Housden, Roger",
        "Description": "“Conventional wisdom,” says Roger Housden, “tells us that nobody goes to heaven for having a good time.” Seven Sins for a Life Worth Living, then, is a refreshing, liberating, and decidedly welcome dose of unconventional wisdom that awakens us to the simple delights and transformative joys of the world around us.With elegance, gentle humor, and remarkable openness, Housden takes us along as he recalls his personal journey toward an appreciation of what he calls the Seven Pleasures: The Pleasure of All Five Senses, The Pleasure of Being Foolish,The Pleasure of Not Knowing, The Pleasure of Not Being Perfect, The Pleasure of Doing Nothing Useful, The Pleasure of Being Ordinary, and The Pleasure of Coming Home.Housden writes, for instance, of submitting to the ultimate folly of falling in love, of celebrating our imperfections, of coming to understand the virtues of the Slow Food movement while enjoying an all-afternoon lunch in a small French village, and of discovering in a Saharan cave that, however extraordinary our surroundings, “we are human, a glorious nothing much to speak of”—and learning to be at peace with the notion.Such pleasures may be suspect in today’s achievement-driven, tightly scheduled, relent-lessly self-improving, conspicuously consumptive culture, but surely the greater sin lies in letting them slip away moment by precious moment. “The purpose of this book,” says Housden, “is to inspire you to lighten up and fall in love with  the world and all that is in it.” Reading it is a pleasure indeed.“When you die,God and the angels will hold you accountablefor all the pleasures you were allowed in life that you denied yourself.”Roger Housden, author of the bestselling Ten Poems series, presents a joyously affirmative, warmly personal, and spiritually illuminating meditation on the virtues of opening ourselves up to pleasures like being foolish, not being perfect, and doing nothing useful, the pleasure of not knowing, and even (would you believe it?) the pleasure of being ordinary.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Pocket Dictionary Of Signing",
        "Authors": "By Flodin, Mickey and Butterworth, Rod R.",
        "Description": "The simplest, most convenient alphabetized pocket guide to American Sign Language (ASL). Arranged in an easy-to-use dictionary format, this edition contains more than 600 signing entries with accompanying directions and illustrations. Inside you’ll find many special highlights, including: ·         Over 600 signs –a selection of the most commonly used phrases ·         Detailed illustrations -- showing exact hand positions and movements ·         Fingerspelling -- to aid in communicating words for which there are no signs ·         Memory aids -- to assist in recalling how to form signs ·         Special sections -- on forming numbers, letters, and constructing word endings ·         Comprehensive Index -- of entries and their synonyms for easy cross-referencing The Pocket Dictionary of Signing is the most complete pocket guide to basic sign language -- and it’s portable enough to be carried anywhere in a pocket or purse.",
        "Category": " Reference , Dictionaries",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Martin's Mice",
        "Authors": "By King-Smith, Dick and Alborough, Jez (ILT)",
        "Description": "\"Martin, a kitten, is branded a `wimp' by his siblings for his friendly interest in mice.  He loves caring for them and can't understand their desire for freedom.  Only when he becomes the pet of a big city apartment dweller does he realize why his pets deserted him.  An engaging animal fantasy with plenty of humorous insight into the human condition, King-Smith's story has humor and a fast pace which will appeal to younger readers.\"--School Library Journal (starred review)",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Adversary Press",
        "Authors": "By",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Modern Media Institute",
        "Price Starting With ($)": "6.69",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "The Corsican: A Novel",
        "Authors": "By Heffernan, William",
        "Description": "In a novel that moves from Nazi-occupied France to contemporary Saigon, Pierre Sartene, grandson of the ruler of a financial empire founded on crime, searches for the man--a betrayer of the Sartene organization--who murdered his father",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "100 Things I'm Not Going to Do Now That I'm over 50",
        "Authors": "By Crisp, Wendy Reid",
        "Description": "Wise, witty, and whimsical, this list of \"things not to do\" is the work of a woman who knows that in order to make the most of being over 50, you have to remember those hard-earned life lessons - about the value of freedom, fun, and feeling good. She resolves not to...introduce body parts as topics of conversation. Wear a corsage. Talk like the kids. Miss an eclipse. And ninety-six other spirited refusals that will inspire anyone over 50 (and some under-50s too) to kick up their heels, kick up a fuss - and keep getting a kick out of life.",
        "Category": " Humor , General",
        "Publisher": "Tarcherperigree",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Telling the Truth About History (Norton Paperback)",
        "Authors": "By Hunt, Lynn, Appleby, Joyce Oldham, and Jacob, Margaret",
        "Description": "We have lost our grip on historical truth. Popular films depict subterranean conspiracies that shape historical events and public knowledge of those events. Best-selling narrative histories dissolve the border between fact and fiction, allowing the author's imagination to roam freely. Influential critics dissolve the author herself into one among many sources of meaning, reducing historical knowledge to a series of texts engaged with each other, not with the past. Powerful constituencies call for histories that affirm more than inform.This new book by three of our most accomplished historians engages the various criticisms that have fragmented the authority of historical knowledge. Although acknowledging degrees of legitimacy in the criticisms, the authors launch a pragmatic response that supports the historian, as they put it, in her long climb, notebook computer in tow, up the 300 stairs to the archives in Lyon. Even if historical truth is an ever-receding goal, the effort to approach it, they show, is legitimate, worthy, and governed by agreed-upon rules. And while affirming the claims of women and ethnic minorities to a rightful place in any narrative of American history, the authors insist on the accountability of history. They outline a coherent narrative of the American past that incorporates its multicultural dimension without special pleading.",
        "Category": " History , United States , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "1001 Timely Tips for Clutter Control: Knowing What to Keep, When to Toss, and How to Store Your Stuff",
        "Authors": "By Frank K. Wood",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Personal Finance for Seniors",
        "Authors": "By frank-w-cawood-and-associates-staf",
        "Description": "",
        "Category": "",
        "Publisher": "FC & A",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "An Inconvenient Truth: The Planetary Emergency of Global Warming and What We Can Do About It",
        "Authors": "By Gore, Albert",
        "Description": "An Inconvenient Truth—Gore's groundbreaking, battle cry of a follow-up to the bestselling Earth in the Balance—is being published to tie in with a documentary film of the same name. Both the book and film were inspired by a series of multimedia presentations on global warming that Gore created and delivers to groups around the world. With this book, Gore, who is one of our environmental heroes—and a leading expert—brings together leading-edge research from top scientists around the world; photographs, charts, and other illustrations; and personal anecdotes and observations to document the fast pace and wide scope of global warming. He presents, with alarming clarity and conclusiveness—and with humor, too—that the fact of global warming is not in question and that its consequences for the world we live in will be disastrous if left unchecked. This riveting new book—written in an accessible, entertaining style—will open the eyes of even the most skeptical.",
        "Category": " Nature , Ecology",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Starting Over: Fresh Hope for the Road Ahead",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Multnomah Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "On Beauty",
        "Authors": "By Smith, Zadie",
        "Description": "Howard Belsey, a Rembrandt scholar who doesn't like Rembrandt, is an Englishman abroad and a long-suffering professor at Wellington, a liberal New England arts college. He has been married for thirty years to Kiki, an American woman who no longer resembles the sexy activist she once was. Their three children passionately pursue their own paths: Levi quests after authentic blackness, Zora believes that intellectuals can redeem everybody, and Jerome struggles to be a believer in a family of strict atheists. Faced with the oppressive enthusiasms of his children, Howard feels that the first two acts of his life are over and he has no clear plans for the finale. Or the encore.   Then Jerome, Howard's older son, falls for Victoria, the stunning daughter of the right-wing icon Monty Kipps, and the two families find themselves thrown together in a beautiful corner of America, enacting a cultural and personal war against the background of real wars that they barely register. An infidelity, a death, and a legacy set in motion a chain of events that sees all parties forced to examine the unarticulated assumptions which underpin their lives. How do you choose the work on which to spend your life? Why do you love the people you love? Do you really believe what you claim to? And what is the beautiful thing, and how far will you go to get it?   Set on both sides of the Atlantic, Zadie Smith's third novel is a brilliant analysis of family life, the institution of marriage, intersections of the personal and political, and an honest look at people's deceptions. It is also, as you might expect, very funny indeed.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "18.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "1421: The Year China Discovered America",
        "Authors": "By Menzies, Gavin",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Getting Our Groove Back: How to Energize American Jewry",
        "Authors": "By Shay, Scott A.",
        "Description": "In his provocative book, Getting our Groove Back: How To Energize American Jewry (Devora Publishing, January, 2007), Scott Shay takes on the major obstacles facing American Jewry today. He examines the current state and future prospects of American Jewry and finds a Jewish community that is dangerously adrift and on an overall downward trajectory, due to a community-wide lack of shared purpose, focus, and mutual concern. To counter this downward spiral, the author presents a platform of ten practical and achievable mini-manifestos that can reinvigorate American Jewry as a whole.  Casting away conventional wisdom and political correctness, this book carefully brings to bear extensive research as it deals with the most controversial and essential issues facing American Jews.  Crafted to be practical, Getting Our Groove Back is also uplifting. For every question the author presents, he details his solutions in a pragmatic, doable fashion. It soon becomes clear that American Jewry is in a unique time and place at the nexus of promise and peril as it faces the choice of being an inspiration or irrelevant.   In these pages no punches are pulled and no issues are avoided.  Readers are challenged and enlightened, and forced to rethink their own pre-conceptions and conclusions about the state of American Jewry and its place in the world.",
        "Category": " Religion , Judaism , General",
        "Publisher": "Devora Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Hugs for the Holidays: Stories, Sayings, and Scriptures to Encourage and Inspire",
        "Authors": "By Weiss, Leann and Smith, John William",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Howard Publishing Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "And One More Thing Before You Go...",
        "Authors": "By Shriver, Maria",
        "Description": "Graduating from high school is a big step for any girl. She is leaving her childhood behind and beginning the rest of her life. She is also leaving her mother's protective circle of love and guidance. One of the greatest gifts a mother can give her daughter at this pivotal moment in her life is good counsel. In And One More Thing Before You Go...Maria Shriver, bestselling author, acclaimed journalist, First Lady of California, and mother of two daughters, provides a loving and heartfelt guide for girls as they go off to college.Expanded from a speech given to her young friend Ally's graduating class, Maria writes as a wiser, more experienced girlfriend, but also as both the daughter of a mother whose advice she still seeks and as the mother of daughters for whom she wishes a fulfilling and happy life. In this stirring and inspiring guide, Maria talks to young women about how to find abundance and emotional richness, and how not to overlook life's most special gifts. Her ten rules -- told in a witty and poignant anecdotal style -- offer a firm grasp on what's really important in life. And One More Thing Before You Go...is a book that transcends age groups, a book that will make you laugh, cry, and open your eyes to a new way of looking at life. Thoughtful, compassionate, and above all, filled with love, And One More Thing Before You Go...is a book that will make every mother cry and every daughter stop and think about her mother's words.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Taylor's Pocket Guide to Ground Covers for Sun",
        "Authors": "By Taylor, Norman and Reilly, Ann (EDT)",
        "Description": "This pocket guide features ground covers for areas consistently exposed to direct sun. The different species included will grow on dry slopes, control erosion, grow between stones, and flourish in summer's dry heat. The climate map and hardiness ratings will help each gardener decide which plants are right.",
        "Category": " Gardening , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Now We Are Sixty",
        "Authors": "By Matthew, Christopher",
        "Description": "A.A. Milne's childhood rhymes are rewritten for sixty-year-olds covering such topics as middle-age-spread, pensions, inflation, traffic jams, and cell phones.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Hormones, Health, and Happiness: A Natural Medical Formula for Rediscovering Youth",
        "Authors": "By Hotze, Steven F., M.D. and Griffin, Kelly",
        "Description": "Built around a regimen of biologically identical hormones and other natural treatments, Dr Hotze's model will help you obtain and maintain health and wellness naturally so that you can enjoy a better quality of life.  In  Hormones, Health, and Happiness you are shown how to reach and maintain optimal cell, tissue, and organ functioning so that you will feel at your peak physically, mentally, and emotionally.  After your twenties, your hormone levels have already peaked and begun a slow, inexorable decline that may cause you to lose energy and gain weight.  You may experience mood problems or have difficulty with thinking, concentration, and short-term memory.  Your immune system is likely to become less efficient, leaving you vulnerable to infectious diseases.  Dr Hotze reveals how you can restore hormones to their optimal levels using natural, biologically identical hormones in a safe, effective way that preserves vitality as you mature.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Forrest Publishing",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Star Wars: Star Pilot (DK READERS)",
        "Authors": "By Buller, Laura",
        "Description": "DK Reader Level 3: Star Wars®: Star Pilot features a lively, fact-packed narrative about the spaceships and vehicles ofStar Wars. What is the biggest spaceship? What is a Jedi starfighter? This exciting book has all the answers!Level 3 is for children able to read on their own. The stories are exciting and captivating in order to develop the child's own desire to read. More text and more complex sentence structure are presented, with information spreads to help develop the reader's general knowledge. The choice of subject widens to match the broadening of children's experiences and interests.© & TM 2015 LUCASFILM LTD.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "If You Lived 100 Years Ago",
        "Authors": "By McGovern, Ann and Divito, Anna (ILT)",
        "Description": "From food to fashion, this colorfully illustrated picture book explores the ways in which people of different social classes lived one hundred years ago in New York City. Original.",
        "Category": " Juvenile Nonfiction , History , General",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Baby Alligator (Penguin Young Readers, Level 3)",
        "Authors": "By Clarke, Ginjer L. and Twinem, Neecy (ILT)",
        "Description": "Deep in the swamp, a baby alligator crawls out of its broken shell. What's in store for this little reptile? Follow it through its first adventures, and get a glimpse into the world of these amazing creatures. The easy-to-read text describes how alligators live, from what they eat to how they swim so quickly. You'll also find fun facts about alligators' dinosaur-hunting ancestors and their more contemporary cousin, the crocodile.",
        "Category": " Juvenile Fiction , Animals , Alligators & Crocodiles",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Con Mi Hermano / With My Brother",
        "Authors": "By Casilla, Robert (ILT), Roe, Eileen, and Mintzer, Jo",
        "Description": "A little boy admires his big brother and aspires to be like him when he is older",
        "Category": " Juvenile Fiction , People & Places , United States , Hispanic & Latino",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Dinosaurs Close Up",
        "Authors": "By Walker, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Silverdale Books",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Gods of War (Emperor, Book 4)",
        "Authors": "By Iggulden, Conn",
        "Description": "The year is 53 B.C. Fresh from victory in Gaul, Julius Caesar leads battle-hardened legions across the Rubicon river–threatening Rome herself.  Even the master strategist Pompey is caught unprepared by the strike, and forced to abandon his city.  The armies of Rome will face each other at last in civil war, led by the two greatest generals ever to walk the seven hills. Thus begins Conn Iggulden’s towering saga of Julius Caesar as he approaches his final destiny—a destiny that will be decided not by legions but by his friend Brutus and an Egyptian queen named Cleopatra, who will bear his only son....For Caesar, the campaign against Pompey will test his military genius and his appetite for glory to their limits, as the greatest fighting machine the world has ever seen divides against itself in a bloody conflict that will set brother against brother until victory or death.   But for Caesar, another kingdom beckons—a world of ancient mysteries and languid sensuality, where a beautiful, bewitching woman waits to snare his heart.      The Gods of War follows Julius Caesar through politics and passion, ruthless ambition and private grief, and into the corruption of power itself.  Those he has loved will play a part in his triumphs—as will the jealousy and hatred of his enemies.From the spectacles of the arena to the whispered lies of conspirators, Conn Iggulden brings to life a world of monumental drama. And at its heart is one extraordinary friendship—marked by fierce loyalty and bitter betrayal, with dark events shrouded in noble ideals.From the Hardcover edition.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The Complete Guide to Software Testing",
        "Authors": "By Hetzel, William",
        "Description": "",
        "Category": "",
        "Publisher": "QED Information Sciences",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Twas the Night Before: A Christmas Allegory",
        "Authors": "By Jenkins, Jerry B.",
        "Description": "Investigating the origins of Santa Claus, a cynical reporter comes to believe that his fiancee, whom he spurned for believing in Santa, may have been right, in a warm-hearted tale of Christmas wonder and love. 75,000 first printing. Crossings Bk Club. Tour.",
        "Category": " Fiction , Religious",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Thorns in the Garden Planet/Meditations on the Creator's Care",
        "Authors": "By Shaw, Vera C.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "A Short Guide to Writing About Film (Short Guide Series)",
        "Authors": "By Corrigan, Timothy",
        "Description": "",
        "Category": " Performing Arts , Film & Video , History & Criticism",
        "Publisher": "Addison Wesley Longman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "A Passion for Golf: Celebrity Musings About the Game",
        "Authors": "By Liguori, Ann",
        "Description": "Liguori interviewed more than 30 celebrities who have a deep interest in golf to compile this book, filled with quotes, quips, and reflections. Professional athletes, Hollywood stars, famous musicians, renowned businessmen, and politicians discuss a variety of issues, including discrimination in the game, the frustrations and exhilarations of the sport, and using the game as a means to get ahead in the business world.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Great Book of Mind Teasers & Mind Puzzlers",
        "Authors": "By Summers, George J.",
        "Description": "Huge collection of tantalizing logic puzzles offers hints when you're stuck, plus step-by-step solutions, imaginatively teaching problem-solving skills. \"Will challenge and delight.\"--Mathematics Teacher. \"Fun for puzzle fans of all ages.\"--Booklist. 256 pages, b/w illus. throughout, 5 3/8 x 7 3/4.",
        "Category": " Games , Logic & Brain Teasers",
        "Publisher": "Puzzlewright",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Listening Hearts: Discerning Call in Community",
        "Authors": "By Farnham, Suzanne G., Gill, Joseph P., McLean, R. Taylor, and Ward, Susan M.",
        "Description": "This seminal work in the Listening Hearts series draws on centuries of classic Christian literature and “the silence of prayerful listening” to show how to recognize and define God’s call. It explains how to eliminate barriers and prepare one’s heart to receive that call - whether it is emphatic, subtle, or seemingly obscure.The authors address the challenge of remaining faithful and attentive to God’s call and tell how a faith community can be a source of spiritual, psychological, physical, and financial support.Listening Hearts is designed for use in prayer and meditation and as the basis for group discussion. It provides suggestions on forming discernment groups and ministries, questions to raise in discerning call, as well as an informal history of the ministry and its research methods.",
        "Category": " Religion , Christianity , Episcopalian",
        "Publisher": "MOREHOUSE PUBLISHING",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Coming Anarchy: Shattering the Dreams of the Post Cold War",
        "Authors": "By Kaplan, Robert D.",
        "Description": "Robert Kaplan, bestselling author of Balkan Ghosts, offers up scrupulous, far-ranging insights on the world to come in a spirited, rousing, and provocative book that has earned a place at the top of the reading lists of the world's policy makers. The end of the Cold War has not ushered in the  global peace and prosperity that many had anticipated.  Volatile new democracies in Eastern Europe, fierce tribalism in Africa, civil war and ethnic violence in the Near East, and widespread famine and disease—not to mention the brutal rift developing as wealthy nations reap the benefits of seemingly boundless technology while other parts of the world slide into chaos—are among the issues Kaplan identifies as the most important for charting the future of geopolitics. Historical antecedents in Gibbon's Decline and Fall and in the legacies of statesmen such as Henry Kissinger contribute to this bracingly prophetic framework for addressing the new global reality. Bold,  erudite, and profoundly important, The Coming Anarchy is a compelling must-read by  one of today's most penetrating writers and provocative minds.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Big House: A Century in the Life of an American Summer Home",
        "Authors": "By Colt, George Howe",
        "Description": "Faced with the sale of the century-old family summer house on Cape Cod where he had spent forty-two summers, George Howe Colt recounts returning for one last stay with his wife and children in this stunning memoir that was a National Book Award Finalist and a New York Times Notable Book of the Year.This poignant tribute to the eleven-bedroom jumble of gables, bays, and dormers that watched over weddings, divorces, deaths, anniversaries, birthdays, breakdowns, and love affairs for five generations interweaves Colt’s final visit with memories of a lifetime of summers. Run-down yet romantic, The Big House stands not only as a cherished reminder of summer’s ephemeral pleasures but also as a powerful symbol of a vanishing way of life.",
        "Category": " Social Science , Customs & Traditions",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Too Soon for A Midlife Crisis",
        "Authors": "By Exley, Helen (EDT) and Barnes-Murphy, Rowan",
        "Description": "",
        "Category": " Reference , Quotations",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Trappings of Power: Ballistic Missiles in the Third World",
        "Authors": "By Nolan, Janne E.",
        "Description": "Since the beginning of the crisis precipitated by Iraq's invasion of Kuwait in August 1990, the threat posed by Iraq's arsenal of ballistic missiles has been the focus of international attention. In the opening days of the U.S.-led military counteroffensive beginning on January 16, 1992, Iraq launched ballistic missiles against population centers in Israel and military bases in Saudi Arabia. The attacks intensified the terror of the war and prompted renewed efforts by the multinational force to destroy Saddam Hussein's military machine.The countries aligned against Iraq were prepared for attacks by chemically armed missiles, but Iraq's missile force proved to be of little military consequence. The missiles that survived the opening hours of Operation Desert Storm were conventionally armed, inaccurate and unreliable. Most of those that were actually launched either were intercepted by American antimissile defenses or failed to hit vital targets.But the political impact of the missiles was inestimable. The strikes symbolized Iraq's determination to prosecute the war no matter what the cost. By threatening to involve Israel, they created severe tensions and posed the risk that multinational military coalition would be dissolved, and they underscored the potential vulnerability of all the states in the region to Iraqi aggression.In this book, Janne E. Nolan argues that the use of missiles is a harbinger of the altered international security environment confronting the Untied States and its allies in the late twentieth century. Long believed to be a distant prospect, the adoption of technological resources to missile development is already occurring in over a dozen developing countries, many of them long-standing regional antagonists. These capabilities present complicated challenges to American interests and foreign policy, challenges that have only begun to be explored as a result of the Iraqi crisis.The author examines the evolution of the international technology market, surveys third world missile programs, and analyzes the military significance of ballistic missiles in potential third world combat. She also discusses the way in which domestic and international policy decisions are made to promote or restrain the export of military technology, and assesses the strengths and weaknesses of current policy. Finally, she emphasizes the need for institutional reforms to balance the requirements of protecting the technological edge on which the United States relies for its own security against the growing pressures of international miniaturization.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Friends",
        "Authors": "By Heine, Helme",
        "Description": "Goods friends always stick together. Charlie Rooster, Johnny Mouse, and Percy the pig are the best of friends. They do everything together. They ride their bike together, play games together, and even do their chores together. Because that's what good friends do. When night falls, though, and it's time to go to bed, they learn that sometimes friends have to be apart. But that's okay, because true friends always find each other, even if it's just in their dreams.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Music of the Heart: The Roberta Guaspari Story",
        "Authors": "By Warren, Larkin and Guaspari-Tzavaras, Roberta",
        "Description": "The author recounts her experiences teaching music in New York City and helping start the East Harlem Violin Program",
        "Category": " Biography & Autobiography , Educators",
        "Publisher": "Hyperion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Betty Crocker's Best Recipes for Appetizers (Betty Crocker's Red Spoon Collection)",
        "Authors": "By Crocker, Betty",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Betty Crocker",
        "Price Starting With ($)": "14.44",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "An Educated Slice",
        "Authors": "By Schulz, Charles M.",
        "Description": "Snoopy goes to golf camp, leads the French Foreign Legion through sand traps, and plays in a tournament, while Peppermint Patty and Marcie work hard as caddies",
        "Category": " Humor , General",
        "Publisher": "Pharos Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "George W. Bush",
        "Authors": "By Rosenberg, Jeffrey",
        "Description": "Provides a close-up look at George W. Bush's first year as president of the United States, from his victory in one of the most controversial elections in American history, through such turbulent events as the Chinese spy plane incident and September 11, 2001 terrorist attack, and beyond.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Silenced: The Wrath of God Descends",
        "Authors": "By Jenkins, Jerry B.",
        "Description": "Enter the continuing story of double agent Paul Stepola as he works to protect his fellow believers from the government that is trying to eliminate Christians. The underground church is in mortal peril following the apocalyptic events in Los Angeles, which have only cast further suspicion upon Christians. Meanwhile, Paul struggles with how to tell his family about his newfound faith without raising the suspicions of his ruthless father-in-law. A gripping, futuristic thriller that will keep you glued to the page.",
        "Category": " Fiction , Religious",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Don't Kiss Them Good-bye",
        "Authors": "By DuBois, Allison",
        "Description": "\"Death is a funny thing. It brings out the best and worst in people. It casts light on the truth and makes life blindingly clear.\"  Her visions have helped solve crimes; her instincts have helped find missing people; she can predict future events and sense your thoughts.  These are some of the extraordinary gifts that define the remarkable Allison DuBois, the real-life medium, wife, and mother whose life is the inspiration for the hit NBC television series Medium.  When she was six years old, Allison's deceased great-grandfather came to her with a message for her mother: \"I am okay, I am still with you. Tell your mom there's no more pain.\" Allison shared his comforting words with her mother and thus began a lifetime of creating connections between loved ones and those they have lost. The purpose of her gifts became clearer when Allison worked as an intern in the homicide bureau of the district attorney's office and found that she visualized the crime as she handled the evidence. Allison now works as a profiler on criminal investigations.  In this stunning book, Allison shares fascinating stories of her encounters with people who have passed and her adventures as a profiler for various law enforcement organizations. With wit and compassion, Allison shows us what it is like to live with these special gifts and talents and also  tells about her struggle to live a normal life as a devoted wife and mother. She shows how learning to accept her own gifts has helped her accept the unique gifts of others and how her compelling desire to relieve the pain of others has helped define her own life, a life committed to the search for ultimate truth.  If you have ever questioned whether there is an afterlife, this book will help you see that there is a living energy beyond death.",
        "Category": " Body, Mind & Spirit , Parapsychology , ESP (Clairvoyance, Precognition, Telepathy)",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "From Sea to Shining Sea for Children: Discovering God's Plan for America in Her First Half-Century of Independence, 1787-1837",
        "Authors": "By Marshall, Peter, Manuel, David, and Fishel, Anna Wilson",
        "Description": "Reexamines the history of the United States of America",
        "Category": " Juvenile Fiction , Historical , United States , Colonial & Revolutionary Periods",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Buzz: 7 Power-Packed Scriptures to Energize Your LIfe (Women of Faith (Publishing Group))",
        "Authors": "By Wells, Thelma",
        "Description": "Using her signature bumblebee analogy (bees are scientifically not supposed to fly!), Thelma Wells buzzes through the Scriptures, capturing special meaning for women who are struggling to find hope and purpose in life.She teaches that women can BEE whatever God calls them to BEE, no matter what their circumstances. Her personal stories, applications and prayers of affirmation present these powerful verses designed to buzz straight into the heart of every woman.An attractive interior design with \"Bee Facts\" enhances the bumblebee theme, as will a special foreword written by Grammy Award Winning vocalist CeCe Winans.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Accidental Empires: How the Boys of Silicon Valley Make Their Millions, Battle Foreign Competition, and Still Can't Get a Date",
        "Authors": "By Cringely, Robert X.",
        "Description": "Computer manufacturing is--after cars, energy production and illegal drugs--the largest industry in the world, and it's one of the last great success stories in American business. Accidental Empires is the trenchant, vastly readable history of that industry, focusing as much on the astoundingly odd personalities at its core--Steve Jobs, Bill Gates, Mitch Kapor, etc. and the hacker culture they spawned as it does on the remarkable technology they created. Cringely reveals the manias and foibles of these men (they are always men) with deadpan hilarity and cogently demonstrates how their neuroses have shaped the computer business. But Cringely gives us much more than high-tech voyeurism and insider gossip. From the birth of the transistor to the mid-life crisis of the computer industry, he spins a sweeping, uniquely American saga of creativity and ego that is at once uproarious, shocking and inspiring.",
        "Category": " Business & Economics , Industries , General",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Toughest Show on Earth: My Rise and Reign at the Metropolitan Opera",
        "Authors": "By Volpe, Joseph and Michener, Charles",
        "Description": "A fascinating, anecdote-filled behind-the-scenes look at more than forty years of the highlights, successes, and day-to-day inner workings—all about productions, the divas, and backstage dramas—of New York’s Metropolitan Opera House, by Joseph Volpe, the only general manager to have risen through the ranks. This book is the story of Volpe’s years leading up to those at the Met, from his first job as a stagehand at the Morosco Theater to the odd jobs he picked up moonlighting: setting up a searchlight or laying down a red carpet for a movie premiere, changing titles on the marquees at the Astor, Victor, and Paramount theaters. It is his Met years—from apprentice carpenter to general manager—that give us a story about New York and the business of culture. Volpe looks at the Met today, an institution full of vast egos and complicated politics, as well as its glittering past—the old Met at Thirty-ninth and Broadway, and the political and artistic intrigues that exploded around its move to Lincoln Center. With stunning candor, he writes about the general managers he worked under, including Rudolf Bing and Anthony Bliss; his own embattled rise to the top; the maneuverings of the blue-chip board; his bad-cop, good-cop collaboration with the conductor James Levine; and his masterful approach to making a family of such highly charged artist-stars as Luciano Pavarotti, Placido Domingo, Teresa Stratas, and Renée Fleming, and such visionary directors as Franco Zeffirelli, Robert Wilson, and Julie Taymor.",
        "Category": " Music , Genres & Styles , Opera",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Heartsaver CPR",
        "Authors": "By Aha",
        "Description": "",
        "Category": "",
        "Publisher": "American Heart Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Mercy Seller: A Novel",
        "Authors": "By Vantrease, Brenda Rickman",
        "Description": "In the fifteenth century, with religious intolerance spreading like wildfire across Europe, English-born Anna Bookman and her grandfather, Finn, earn a living in Prague by illuminating precious books, including forbidden translations of the Bible. Finn subscribes to the heresy that people ought to be able to read the Word of God for themselves, without having to pay a priest for the privilege, but holding that belief is becoming more and more hazardous. When the authorities start burning books and slaughtering heretics---including the man Anna was to marry---Finn urges her to seek sanctuary in England, but her passage abroad will be anything but easy. In London, Friar Gabriel dutifully obeys church doctrine by granting pardons . . . for a small fee. But then he is sent undercover on a spying mission to France, where Anna has set up a temporary stall as a bookseller. Anna has no way of knowing that the wealthy young merchant frequenting her stall is actually a priest---just as Gabriel does not know he has met the woman who will cause him to doubt his vows.As Anna continues her journey to England, where the movement to stamp out heresy is growing ever fiercer, Brenda Rickman Vantrease brings us a richly imagined and immensely rewarding novel of love, faith, and dangerous secrets.",
        "Category": " Fiction , Historical",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Cyndy Szekeres' Counting Book (Golden Sturdy Book)",
        "Authors": "By Szekeres, Cyndy",
        "Description": "Children learn numbers as they count the mice walking, running, dancing, jumping, singing, sleeping, climbing, yawning, nibbling, and tickling",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "The Act of Marriage: The Beauty of Sexual Love",
        "Authors": "By LaHaye, Tim F. and Lahaye, Beverly",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan Publishing House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "F-Plan Diet,the",
        "Authors": "By Eyton, Audrey",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Eat to Win: The Sports Nutrition Bible",
        "Authors": "By Dr. Robert Haas",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Improve Your Reading",
        "Authors": "By Fry, Ronald W.",
        "Description": "Provides students with techniques for improving reading comprehension and getting more out of reading assignments",
        "Category": "",
        "Publisher": "Career Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Christmas Letters",
        "Authors": "By Smith, Lee",
        "Description": "In The Christmas Letters, three generations of women reveal their stories of love and marriage in the letters they write to family and friends during the holidays. It's a down-home Christmas story about tradition, family, and the shared experiences of women.  Here, in a letter of her own, Lee Smith explains how she was inspired to write this celebrated epistolary novel:  Dear Friends,  Like me, you probably get Christmas letters every year. I read every word and save every letter. Because every Christmas letter is the story of a life, and what story can be more interesting than the story of our lives? Often, it is the story of an entire family. But you also have to read between the lines with Christmas letters. Sometimes, what is not said is even more important than what is on the page.  In The Christmas Letters, I have used this familiar format to illumine the lives, hopes, dreams, and disappointments of three generations of American women. Much of the story of The Christmas Letters is also told through shared recipes. As Mary, my favorite character, says, \"I feel as if I have written out my life story in recipes! The Cool Whip and mushroom soup years, the hibachi and fondue period, then the quiche and crepes phase, and now it's these salsa years.\"  I wrote this little book for the same reason I write to my friends and relatives every holiday--Christmas letters give us a chance to remember and celebrate who we are.  With warmest greetings, Lee Smith",
        "Category": " Fiction , Literary",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Kaya and the River Girl (American Girls Short Stories)",
        "Authors": "By Graef, Renee (ILT), Shaw, Janet Beeler, Farnsworth, Bill (ILT), and McAliley, Susan (ILT)",
        "Description": "Kaya becomes jealous of a girl from another tribe until they are forced to work together in a dangerous situation; includes historical notes on Indian trading along the Columbia River in 1764, as well as instructions for creating a petroglyph.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "No Humans Involved (Women of the Otherworld)",
        "Authors": "By Armstrong, Kelley",
        "Description": "In her acclaimed Women of the Otherworld series, bestselling author Kelley Armstrong creates a present day in which humans unwittingly coexist with werewolves, witches, and other supernatural beings. Now, in this spellbinding new novel, a beautiful necromancer who can see ghosts must come to terms with her power—and with an evil she never thought possible.It’s the most anticipated reality television event of the season: three spiritualists gathered together in one house to raise the ghost of Marilyn Monroe. For celebrity medium Jaime Vegas, it is to be her swan song—one last publicity blast for a celebrity on the wrong side of forty. But unlike her colleagues, who are more show than substance, Jaime is the real thing. Reluctant to upstage her fellow spiritualists, Jaime tries to suppress her talents, as she has done her entire life. But there is something lurking in the maze of gardens behind the house: a spirit without a voice. And it won’t let go until somehow Jaime hears its terrible story. For the first time in her life, Jaime Vegas understands what humans mean when they say they are haunted. Distraught, Jaime looks to fellow supernatural Jeremy Danvers for help.As the touches and whispers from the garden grow more frantic, Jaime and Jeremy embark on an investigation into a Los Angeles underworld of black magic and ritual sacrifice. When events culminate in a psychic showdown, Jaime must use the darkest power she has to defeat a shocking enemy—one whose malicious force comes from the last realm she expected. . . .In a world whose surface resembles our own, Kelley Armstrong delivers a stunning alternate reality, one where beings of the imagination live, love, and fight a never-ending battle between good and evil.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Exploring the Levels of Creation",
        "Authors": "By Browne, Sylvia",
        "Description": "Have you ever wondered about life and Creation? Is there life after death? Why do we have to go through these trials and tribulations? Why do we have thoughts and dreams that run from the sublime to those that are nightmarish and bizarre? Why do goodness and evil go hand in hand in life … or do they?The answers to these questions and more are brought to light by author and spiritual teacher Sylvia Browne. She once again shares her psychic gifts and years of research in order to enlighten us and give us more insights into God and the realities of life.This time she tackles the structure of Creation by showing us that there is purpose and order in our sometimes seemingly chaotic world and existence. She outlines the structural levels of Creation of not only life as we know it; but the reality of the afterlife and the heretofore-unexplored structure of the Lower Levels of Creation. From the beautiful and perfect life of the Other Side to the wondrous, weird, and strange Lower Levels, to the everyday intricacies of life on this planet, Sylvia takes us on another journey of exploration and truth.",
        "Category": " Philosophy , General",
        "Publisher": "Hay House Inc.",
        "Price Starting With ($)": "5.1",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Blue Screen",
        "Authors": "By Parker, Robert B.",
        "Description": "Sunny Randall, the Boston P.I. with a personal life as tangled as that of her clients, is hired on as bodyguard to an up-and-coming starlet, and discovers some ugly truths behind her glossy facade.Buddy Bollen is a C-list movie mogul who made his fortune producing films of questionable artistic merit. When Buddy hires Sunny Randall to protect his rising star and girlfriend, Erin Flint, Sunny knows from the start that the prickly, spoiled beauty won't make her job easy. And when Erin's sister, Misty, is found dead in the lavish home they share with sugar daddy Bollen, there doesn't seem to be a single lead worth pursuing.But then Sunny meets Jesse Stone, chief of police in Paradise, Massachusetts, under whose jurisdiction the case falls. It immediately becomes clear that Jesse and Sunny have much in common. While searching for the killer, they learn an awful lot about each other - and themselves.Tracking Misty's murderer reveals a host of seedy complications behind Erin's glamorous lifestyle as well as Buddy Bollen's entertainment empire, made up of shady film deals and mobsters out for revenge.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Short Straw (Ed Eagle Novel)",
        "Authors": "By Woods, Stuart",
        "Description": "Short Straw reintroduces Santa Fe lawyer Ed Eagle, who first appeared in Stuart Woods's 1992 thriller, Santa Fe Rules. In his first adventure, Ed fell in love with the seductive Barbara Kennerly, and married her-against his better judgment.  Turns out that Ed should have listened to his intuition. Ed Eagle awakens the morning after his fortieth birthday to find that Barbara has vanished, and Ed's money-from his business, his bank, and his brokerage accounts-has been wired to the Cayman Islands. Barbara, it appears, had drugged his birthday wine, neatly cleaned him out and then fled to Mexico, from where she can't be extradited. And as if that weren't bad enough, when Ed arrives at work that morning he discovers that he's been assigned a new client who looks like nothing but trouble-Joe Big Bear, a part-time mechanic charged with a triple homicide. Ed hires two slightly shady investigators to search for his wife. But when they track Barbara down in Puerto Vallarta, they discover that Joe Big Bear may also be embroiled in Barbara's plot. Ed soon finds himself caught in a scheme that is much more far reaching-and deadly-than anyone would have expected.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Jim Cramer's Mad Money: Watch TV, Get Rich",
        "Authors": "By Cramer, James J. and Mason, Cliff",
        "Description": "Bestselling author Jim Cramer shows investors how to use the information and advice in his top-rated CNBC showto make money in the stock market.\"Investing well isn't easy, but it is possible. My goal in life is to make it easier for you to make money.\"Jim Cramer is the champion of the middle-class investor. Every night on Mad Money, he provides valuable information about stocks, steering investors away from danger zones and leading them to the investments that can turn a lackluster portfolio into a powerhouse of profit. In his new book, he shows investors how to take the advice on his TV program and put it into action.Cramer walks investors through the key decisions they have to make: understanding their tolerance for risk and defining their goals, doing the essential homework on a stock, and knowing how to buy and sell stocks the right way -- the Cramer way. This is a true nuts-and-bolts guide to investing, from Cramer's detailed discussion of the sort of homework investors must do to his own guidelines for knowing when and how to sell stocks.Mad Money is a hugely entertaining television program, but it also offers valuable information that can be the basis for a winning portfolio. Cramer shows how to turn the \"Lightning Round\" into a terrific tool for investing; it's stock-market strength training. He reveals how he can assess a stock in only seconds -- a valuable skill that every investor can acquire and put to good use. He explains what to look for in his CEO and CFO interviews, and how to use those conversations to make successful investment decisions. He reviews some of his best calls made on Mad Money, as well as some of his worst ones, to extract ten lessons from each that can profit every investor. And for theMad Money junkies who just can't get enough, Cramer goes behind the scenes to explain everything from the reason behind his deliberate mispronunciations to his notorious chair abuse to the zany props and buttons that keep things humming.From the first \"Booyah\" to the last roar of the bull, Mad Money is every investor's favorite television program, and Jim Cramer'sMad Money is the book that can turn a TV program into a top-notch stock portfolio.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Alexander's Care of the Patient in Surgery",
        "Authors": "By Marie J. Rhodes, Barbara J. Gruendemann, Walter F. Ballinger",
        "Description": "",
        "Category": "",
        "Publisher": "C. V. Mosby Co",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    }
]