[
    {
        "Title": "An Old-Fashioned Christmas: Gifts to Make for Family & Friends",
        "Authors": "By Mansour, Diana",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Montana Creeds: Logan (The Montana Creeds, 1)",
        "Authors": "By Miller, Linda Lael",
        "Description": "Descendants of the legendary McKettrick family, the Creeds are renowned in Stillwater Springs, Montana&#151;for raising hell&#133;After years of wandering, Logan Creed, a cowboy with a dusty law degree, has returned home. To put down roots, to restore his family's neglected ranch&#133;to have kids of his own proudly bearing the Creed name.Divorced mom Briana Grant has heard the stories about her gorgeous neighbor. So Logan's kindness with her young boys is a welcome surprise, especially when her ex reappears. And when an unknown enemy vandalizes her home, Logan shows Briana&#151;and the folks of Big Sky country&#151;just what he's made of.",
        "Category": " Fiction , Romance , Western",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Secrets of Surrender (Rothwell)",
        "Authors": "By Hunter, Madeline",
        "Description": "First he’ll learn her most intimate secrets. Then he’ll arouse her deepest passions. He’s the lover she’s been waiting for: the man who can rescue her from her wicked past–for a price–in Madeline Hunter’s tale of sin, seduction, and irresistible, impossible love.He catches her eye across the dining room–a handsome stranger who stands out among the lewd noblemen and bawdy painted women. But their worlds are about to collide in a way Roselyn Longworth could never have imagined. For before the night is out, she will be auctioned off to the highest bidder…and Kyle Bradwell will lead her from one kind of hell to another. Yet from the moment he wins her, Kyle treats Rose with a gentleness she hasn’t known since a family scandal destroyed her reputation. And when she finally learns what is really driving Kyle, it’s too late. For Rose has fallen for the man who knows her most intimate secrets. Now he has stunned her with a proposal of marriage–the first step in a seduction that will demand nothing less than her complete surrender.…",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Isle of Dogs (Andy Brazil)",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "Patricia Cornwell’s novels of big-city police have taken this classic genre to a new level. Now, with this #1 New York Times bestselling novel, she outdoes herself, with a wry tale of life and turmoil behind the blue wall.Chaos breaks loose when the governor of Virginia orders that speed traps be painted on all streets and highways, and warns that speeders will be caught by monitoring aircraft flying overhead. But the eccentric island of Tangier, fourteen miles off the coast of Virginia in Chesapeake Bay, responds by declaring war on its own state. Judy Hammer, newly installed as the superintendent of the Virginia State Police, and Andy Brazil, a state trooper and Hammer’s right hand and confidant, find themselves at their wits’ end as they try to protect the public from the politicians—and vice versa—in this pitch-perfect, darkly comic romp.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Not Even for Love",
        "Authors": "By Brown, Sandra",
        "Description": "When she catches the eye of a wealthy businessman, Jordan Hadlock's future is all planned out . . . until a hunky photographer ignites a new passion in her one stormy night.Jordan Hadlock seems to have it all: a great job and Helmut Eckherdt, a rich industrialist intent on marrying her -- even though she hasn't said yes. What more could she want? A clap of thunder and a pounding on her door soon give her an answer.  Reeves Grant appears seeking shelter from a sudden downpour, but the real storm is inside Jordan and the passion they share. And the timing couldn't be worse: soon after that fateful night, Helmut publicly announces his plans to marry Jordan -- at the very same moment she spies Reeves snapping pictures of her new \"fiancé.\"  Now Jordan is moving toward the altar with a man she likes but doesn't love, with Reeves only a few inches away. Soon, she'll have to choose between them -- or risk losing both.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "To Rescue A Rogue",
        "Authors": "By Beverley, Jo",
        "Description": "Lady Mara St. Bride has never backed down from a good adventure, which was how she wound up roaming the streets of London in the middle of the night, wearing nothing but a shift and corset beneath an old blanket. Luckily, her brother’s oldest friend, the devilishly sexy Lord Darius Debenham, answered her plea for help. Now she intends to repay the favor... Before he was wounded at Waterloo, Dare had embraced everything life had to offer. Forever changed by the war, he now believes nothing—not even the interference of a lovely young minx like Mara—can rescue him from his demons. But Mara is determined to reignite his warm smile, and enlists the help of all the Rogues to offer Dare a temptation he cannot resist...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Camelot 30K",
        "Authors": "By Forward, Robert L.",
        "Description": "When humankind discovers intelligent life in the Oort Cloud, the first humans to venture beyond the planetary system make contact with an incredibly strange race and their mysterious world. Reprint.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "And the Desert Blooms (Sedikhan)",
        "Authors": "By Johansen, Iris",
        "Description": "#1 New York Times bestseller Iris Johansen pairs an exotic locale with an irresistible man in this classic love story that proves anything is possible when a woman knows in her heart that it’s right….Don’t look for me. I’ll come back when I’m ready. Pandora Madchen wrote those words when she ran off six years ago. In that time she’d become a sensation with the rock group Nemesis, toured the world, and grown up, but she never forgot the promise she made herself. Now Pandora was ready to return to the desert state of Sedikhan and the man she’d loved too soon and too much. Sheik Philip El Kabbar was a businessman whose power and influence extended throughout the world—but for six long years he’d been unable to find the woman he still considered it his duty to protect. She’d come back on her own terms and to take the kind of erotic gamble that Philip always won. Only this time he wasn’t sure that in winning they wouldn’t both lose what matters most. Or that in loving her, he wouldn’t be hurting them both.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "A Colton Family Christmas (STP - Sil Collection)",
        "Authors": "By Christenberry, Judy, Turner, Linda, and Zane, Caroly",
        "Description": "A delightful trio of brand new stories, centering around the legendary Colton family, follows Jesse Colton as he falls for a mysterious beauty, SWAT team leader Kurt Hoffman as he is reunited with his ex-wife during a hostage situation, and Ian Rafferty as he saves the life of Juliet Cosgrove during a wedding. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Dream Hunter",
        "Authors": "By Kinsale, Laura",
        "Description": "Searching for a legendary mare known as String of Pearls, restless wanderer Lord Winter discovers the disguised Zenia Stanhope, the daughter to the Queen of the Desert, who longs to reach the bloodless lands in England. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Wine Bible",
        "Authors": "By MacNeil, Karen",
        "Description": "THE MOST COMPLETE WINE BOOK EVER. A must for anyone who loves wine, whether they are a pro or an amateur. Thorough, authoritative, and entertaining. (Robert Mondavi, founder and chairman emeritus of the Robert Mondavi Family of Wines)\"The most informative and entertaining book I've ever seen on the subject.\" (Danny Meyer, co-author ofThe Union Square Cafe Cookbook)The essentials: The romance and intrigue of Burgundy of sauvignon blanc and the surprising elegance of Spain's top Riojas. Italy, one of wine's most enchanting and ancient homelands. What makes a great wine great? The reason behind Champagne's bubbles. The precise and food-friendly wines of Germany. California, wine's Camelot. The lip-smackingly good wines of Australia. The complexities of Port revealed. How a vineyard profoundly affects a wine's character.Plus, matching wine with food - and mood. The secrets of professional wine tasters and how to expand your wine-tasting vocabulary. And everything else you need to know to buy, store, serve, and enjoy the world's most captivating beverage.The shimmering elegance of Veuve Clicquot, affordable luxury in a glass, page 185.Ravishing, elegant, and rich, Petrus in Ingrid Bergman in red satin, page 156.Some wines are like people... they get better as they get older, pg. 64.Sherry, the world's most misunderstood and underappreciated wine, page 437.",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Project Princess (The Princess Diaries, Vol. 4 1/2)",
        "Authors": "By Cabot, Meg",
        "Description": "A novella in the #1 New York Times bestselling series by Meg Cabot.Set in between Princess Diaries Volume IV: Princess in Waiting and Princess Diaries V: Princess in Pink, this is a 64-page interstitial novella in bestselling Princess Diaries series by Meg Cabot.Hammer in hand, Princess Mia embarks on an epic adventure for one so admittedly unhandy: Along with her cohorts from school, she's off to build houses for the less fortunate. It doesn't take Mia long to realize that helping others -- while an unimpeachably noble pastime -- is very hard work. Will her giving spirit prevail? Will the house collapse due to royally clumsy construction? And most importantly, will Michael stop working long enough to kiss her?Project Princess is an interstitial novella set in between the fourth and fifth books, Princess Diaries Volume IV: Princess in Waiting and Princess Diaries V: Princess in Pink, in the beloved, bestselling series that inspired the feature film starring Anne Hathaway and Julie Andrews. Beautifully repackaged in paperback, this title will appeal to new readers as well as fans looking to update their collection.",
        "Category": " Young Adult Fiction , Royalty",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Guermantes Way: His Remembrance of Things Past",
        "Authors": "By Proust, Marcel",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Shrug: Trudeau in Power",
        "Authors": "By Stewart, Walter",
        "Description": "",
        "Category": "",
        "Publisher": "New Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Starting from Scratch",
        "Authors": "By Whitman, John",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1978"
        }
    },
    {
        "Title": "Bed of Roses",
        "Authors": "By Stone, Katherine",
        "Description": "As beautiful actress Cassandra Winter lies in intensive care, the victim of a brutal attack, Chase Tessier sits by her side, reliving their eight-year-old love affair against the backdrop of the Tessier winery and vows to win back her love, while a dangerous enemy waits in the shadows to destroy Cassandra. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Jumbo Hocus Pocus Show",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hausemann",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Basic Photo Book",
        "Authors": "By Davis, Phil",
        "Description": "This book provides the basic knowledge needed to make effective, attractive photographs in black and white. It focuses on the essential steps in camera handling, film, exposure and development, printing and presentation. A great number of photographs are used as examples and illustrate various process steps. The chapters are short, easy to follow, and devoted to specific subjects. A full glossary is also included.",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "War Slang: American Fighting Words and Phrases from the Cival War to the Gulf War",
        "Authors": "By Dickson, Paul",
        "Description": "Defines slang military terms used by Americans in each military action since the Civil War",
        "Category": " Reference , Dictionaries",
        "Publisher": "Atria",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "One Day of the Civil War: April 10, 1863:  America in Conflict",
        "Authors": "By Willett, Robert L.",
        "Description": "Focuses on April 10, 1863 as a microcosm of American life during the Civil War, detailing battles, train raids, military blunders, illnesses, boredom, homesickness, and courage",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Reflections on the Civil War",
        "Authors": "By Catton, Bruce and Leekley, John",
        "Description": "The eminent historian's posthumous summation of the Civil War's causes and effects illuminates crucial events and personalities and is complemented by rare, on-the-scene sketches kept by a Union soldier",
        "Category": " History , General",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Old Magic",
        "Authors": "By Curley, Marianne",
        "Description": "Jarrod Thornton is mesmerizing,but Kate Warren doesn't know why.The moment the new guy walks into the room, Kate senses something strange and intense about him. Something supernatural. Her instincts are proven correct a few minutes later when, bullied by his classmates, Jarrod unknowingly conjures up a freak thunderstorm inside their classroom.Jarrod doesn't believe in the paranormal. When Kate tries to convince him that he has extraordinary powers that need to be harnessed, he only puts up with her \"hocus pocus\" notions because he finds her captivating. However, the dangerous, uncontrolled strengthening of his gift finally convinces Jarrod that he must take Kate's theories seriously. Together, they embark on a remarkable journey -- one which will unravel the mystery that has haunted Jarrod's family for generations and pit the teens against immense forces in a battle to undo the past and reshape the future.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Amish Crib Quilts",
        "Authors": "By Pellman, Rachel T. and Pellman, Kenneth",
        "Description": "Vintage 1985 softcover quilt book - Amish Crib Quilts by Rachel and Kenneth Pellman. 96 pages. This beautiful book bursts with a wonderful collection of antique Amish crib quilts. Told from an Amish child's point of view, this colorful volume details the variety, beauty and stories of Amish crib quilts. Lovely full-color photographs.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Good Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2013"
        }
    },
    {
        "Title": "The Nobel Book of Answers: The Dalai Lama, Mikhail Gorbachev, Shimon Peres, and Other Nobel Prize Winners Answer Some of Life's Most Intriguing Questions for Young People",
        "Authors": "By Carter, Jimmy (INT), Stiekel, Bettina (EDT), Angelis, Paul De (TRN), and Kaestner, Elisabeth (TRN)",
        "Description": "IF YOU COULD ASK A NOBEL PRIZE WINNER ANYTHING YOU WANTED...Since 1901, the Nobel Prize has honored the world's great geniuses in the most important fields: physics, chemistry, medicine, literature, economics, and world peace. What if children could ask these creative thinkers about some of life's most intriguing mysteries, such as \"Why can't I live on french fries?\" and \"What is love?\" The answers from the Dalai Lama, Mikhail Gorbachev, Shimon Peres, Desmond Tutu, and seventeen other Nobel Prize laureates are rich with surprise, humor, and of course, wisdom. Every single answer will make you think...and learn something new.WHAT IS LOVE?The Dalai LamaWHY CAN'T I LIVE ON FRENCH FRIES?Richard J. RobertsWHAT IS POLITICS?Shimon PeresWHY IS THE SKY BLUE?Mario J. MolinaWHY DO I FORGET SOME THINGS AND NOT OTHERS?Erwin NeherWHY DO WE HAVE TO GO TO SCHOOL?Kenzaburo OeWHY IS THERE WAR?Desmond TutuWHY DO WE FEEL PAIN?Günter BlobelHOW DO I WIN THE NOBEL PRIZE?Mikhail GorbachevWHY ARE SOME PEOPLE RICH AND OTHERS POOR?Daniel L. McFadden...AND ELEVEN OTHER RESPONSES",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "Chemical Heritage Foundation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Andrea (Heartsong Books #1)",
        "Authors": "By Chisholm, Gloria",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Marriage Minutes",
        "Authors": "By Moeller, Bob and Moeller, Cheryl",
        "Description": "Got a minute? It seems like such a short amount of time. What can we do in a minute? According to the experiences of Bob and Cheryl Moeller, a minute spent with God and your spouse every day can change your marriage and your life.God's got a beautiful plan for your marriage. Have you discovered it? See what God has to say about your marriage by spending a minute each day with Marriage Minutes. Each devotional is centered around a particular subject related to marriage and a couple's walk with the Lord and contains a pertinent Scripture passage. The Moellers share the Bible's truth on many topics in your marriage, including:CommunicationSexualityHaving fun togetherHandling conflictWhether your marriage is in perfect health, just plodding along, or shipwrecked on the rocks, this book is for you. All of heaven is on the side of your marriage succeeding. Now is the time to start building and protecting the gift God gave you in your marriage. One minute can change a lifetime.",
        "Category": " Religion , Devotional",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "They Overcame: True Life Testimonies of Victory Over Drug Addiction",
        "Authors": "By Richard E. Omohundro, Jr.",
        "Description": "",
        "Category": "",
        "Publisher": "TCNE Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Real Jesus: The Misguided Quest for the Historical Jesus and the Truth of the Traditional Go",
        "Authors": "By Johnson, Luke Timothy",
        "Description": "The Real Jesus—the first book to challenge the findings of the Jesus Seminar, the controversial group of two hundred scholars who claim Jesus only said 18 percent of what the Gospels attribute to him—\"is at the center of the newest round in what has been called the Jesus Wars\" (Peter Steinfels, New York Times). Drawing on the best biblical and historical scholarship, respected New Testament scholar Luke Timothy Johnson demonstrates that the \"real Jesus\" is the one experienced in the present through faith rather than the one found in speculative historical reconstructions. A new preface by the author presents his point of view on the most recent rounds of this lively debate.",
        "Category": " Religion , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Prize Winning Recipes from the Golden Harvest Kitchens (A Pivot Original Health Book)",
        "Authors": "By Beatrice Trum Hunter",
        "Description": "",
        "Category": "",
        "Publisher": "Pivot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "It's Not Mean If It's True: More Trials From My Queer Life",
        "Authors": "By Ford, Michael Thomas",
        "Description": "",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "Alyson Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Without Precedent: The Inside Story of the 9/11 Commission",
        "Authors": "By Hamilton, Lee H., Kean, Thomas H., and Rhodes, Benjamin D.",
        "Description": "In the words of the commission’s co-chairmen, this is the compelling inside story of how the National Commission on Terrorist Attacks Upon the United States—more commonly known as the 9/11 Commission—managed to succeed against all odds in producing a report that made clear what went wrong and why.The mandate of the 9/11 Commission was daunting and all-encompassing. In its investigation of the events leading up to and including September 11, 2001, the commission had to examine U.S. diplomacy, military policy, intelligence agencies, law enforcement, border and aviation security, and congressional oversight, as well as the immediate response to the terrorist attacks, while also investigating the lethal enemy al Qaeda. The creation of the 9/11 Commission was blocked for months by the Bush administration, and after its inception in December 2002 the commission spent months mired in a series of controversies—the resignation of its first chairman, Henry Kissinger, and vice-chairman, George Mitchell; an inadequate budget; an extraordinarily polarized atmosphere leading up to the 2004 presidential election; the conflicting demands of various interest groups; the distrust of the victims’ families; difficulties in obtaining access to highly classified documents and to al Qaeda detainees; and a media eager to record stumbles and gaffes. The obstacles were great, and the expectations for a blue-ribbon panel are never high—yet somehow the 9/11 Commission overcame everything that might have thwarted it and succeeded beyond anyone’s greatest expectation, holding a series of hearings that riveted the nation, producing a unanimous and widely heralded report that became a national best seller, and issuing recommendations that led to the most significant reform of America’s national security agencies in decades. The 9/11 Commission report slaked the national thirst for accountability. Here for the first time is the story of how the commission came together to produce its landmark document.",
        "Category": " Political Science , Political Freedom & Security , Terrorism",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Tao Of Chess: 200 Principles to Transform Your Game and Your Life",
        "Authors": "By Kurzdorfer, Peter",
        "Description": "The real secrets to winning the game of chess - and the game of lifeChess mastery has been recognized since ancient times as an unparalleled way to learn political strategy, but until now no book has explored the life lessons chess teaches and how they can transform lives. In The Tao of Chess, the author seamlessly blends the wisdom of a time-honoured spiritual quest for truth with 200 principles that will improve anyone's chess game. By following the author's principles, readers not only come to enjoy the game more, they develop a habit of seeking underlying truth - whether in a chess game or a real-life situation.The Tao of Chess is full of conscise advice, such as:Understanding is more important than memoryFortune favors the braveWhen you see a good move, wait and look for a better moveMistakes tend to come in bunchesTrust your intuition; it's usually rightAuthoritative and easy to follow, this book will turn every reader into a master strategist.",
        "Category": " Games & Activities , Chess",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Bridge-Head: The Drama of Israel",
        "Authors": "By Waldo Frank",
        "Description": "",
        "Category": "",
        "Publisher": "George Braziller",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Best Friends, Worst Enemies: Understanding the Social Lives of Children",
        "Authors": "By Thompson, Michael, Grace, Catherine O'Neill, and Cohen, Lawrence J., Ph.D.",
        "Description": "\"With uncommon sensitivity and intelligence... [this] book offers parents a window into their kids' often tumultuous relationships with classmates.\" - TimeFriends broaden our children’s horizons, share their joys and secrets, and accompany   them on their journeys into ever wider worlds. But friends can also gossip and betray,   tease and exclude. Children can cause untold suffering, not only for their peers   but for parents as well. In this wise and insightful book, psychologist Michael Thompson,   Ph.D., and children’s book author Catherine O’Neill Grace, illuminate the crucial   and often hidden role that friendship plays in the lives of children from birth through   adolescence. Drawing on fascinating new research as well as their own extensive   experience in schools, Thompson and Grace demonstrate that children’s friendships   begin early–in infancy–and run exceptionally deep in intensity and loyalty. As children   grow, their friendships become more complex and  layered but also more emotionally   fraught, marked by both extraordinary intimacy and bewildering cruelty. As parents,   we watch, and often live through vicariously, the tumult that our children experience   as they encounter the “cool” crowd, shifting alliances, bullies, and disloyal best   friends. Best Friends, Worst Enemies brings to life the drama of childhood relationships,   guiding parents to a deeper understanding of the motives and meanings of social behavior.   Here you will find penetrating discussions of the difference between friendship and   popularity, how boys and girls deal in unique ways with intimacy and commitment,   whether all kids need a best friend, why cliques form and what you can do about them. Filled with anecdotes that ring amazingly true to life, Best Friends, Worst Enemies probes the magic and the heartbreak that all children experience with their friends.   Parents, teachers, counselors–indeed anyone who cares about children–will find this   an eye-opening and wonderfully affirming book.\"Relevant and compelling... Parents will be wiser for reading.\" - The Boston Globe\"The stories in this book come from many perspectives - those of therapists, educators, and parents. The wise, kind authors give us a fresh and cogent analysis of this critically important issue.\" - Mary Pipher, Ph.D., author of Reviving Ophelia",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Darkness in El Dorado: How Scientists and Journalists Devastated the Amazon",
        "Authors": "By Tierney, Patrick",
        "Description": "A finalist for the 2000 National Book Award in non-fiction. What Guns, Germs, and Steel did for colonial history, this book will do for present-day anthropology. Darkness in El Dorado is an explosive account of how ruthless journalists, self-serving anthropologists, and obsessed scientists placed one of the Amazon basin's oldest tribes on the cusp of extinction. First coming to prominence in the 1960s, the \"savage\" Yanomami Indians were the subject of anthropologist Napoleon Chagnon's multi-million-copy bestseller Yanomamo: The Fierce People and many award-winning films. These exemplars of human ferocity, however, did not arrive at such dispositions naturally. Patrick Tierney describes how the Yanomami's internecine warfare was triggered by repeated visits of leading anthropologists from around the world as well as by the Atomic Energy Commission, which wished to use Yanomami blood in radiation studies in the mid-1960s. This is an epic, compelling work, sure to shake the very foundations of American anthropology.",
        "Category": " Social Science , Anthropology , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "The Better of McSweeney's, Volume 1",
        "Authors": "By Eli Horowitz, Dave Eggers",
        "Description": "This book collects some of the best stories from the first ten issues of  McSweeney's Quarterly Concern,  the literary journal that has become one of the country's most important and influential publications.  McSweeney's  began as a small collection of work rejected by other magazines, but it soon began to publish pieces primarily written for the journal, and to attract some of the finest writers in the country. Contributors to  Best of McSweeney's, Volume One  include Jonathan Lethem, Glen David Gold, A. M. Homes, David Foster Wallace, Dave Eggers, Amanda Davis, George Saunders, Paul Collins, and William Vollmann, as well as many talented newcomers. Stories included here have been selected for  The O. Henry Prize Stories  and  The Best American Short Stories,  and one was performed in a regional musical theater.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "McSweeney's",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Sister to the Sioux: The Memoirs of Elaine Goodale Eastman, 1885-91 (The Pioneer Heritage Series, Vol. 7)",
        "Authors": "By Eastman, Elaine Goodale and Graber, Kay",
        "Description": "\"It was held a distinct adventure back in the demure 1880s for a properly brought-up New England girl to open a day school in a primitive Sioux village,\" Elaine Goodale Eastman recalled in later years. With boundless energy and dedication she had set out to teach the white man's ways to the Sioux. The Indian women called her \"little sister\" as she entered wholeheartedly into village activities.She watched the emergence of the Ghost Dance religion, visited with Sitting Bull shortly before his death, and was at Pine Ridge during the last month of 1890—\"a time of grim suspense.\" There she met her future husband, Dr. Charles Eastman, the agency physician and a mixed-blood Sioux. A short time later they shared in the heart-wrenching job of caring for the survivors of the Wounded Knee massacre.",
        "Category": " History , Native American",
        "Publisher": "University of Nebraska Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Japan Color",
        "Authors": "By Tanaka, Ikko (EDT) and Koike, Kazuko (EDT)",
        "Description": "Discusses the cultural significance of various colors in Japan and shows how colors are used in posters, advertisements, decorative objects, and food preparation",
        "Category": " Art , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.16",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Drawn to the Civil War",
        "Authors": "By Lang, J. Stephen, Caplanis, Michael (ILT), and Caplanis, Michael",
        "Description": "",
        "Category": " Art , Techniques , Drawing",
        "Publisher": "John F Blair Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Prevention's Health Guaranteed Cookbook: Custom-Tailored Eating Plans for Men, Women and Dieters",
        "Authors": "By Prevention Magazine Health Books (COR), Prevention Magazine Health Books (EDT), and Joachim, David (EDT)",
        "Description": "It's all here. A complete guide to healthy living. A foolproof eating plan. Great-tasting recipes.Prevention, America's leading health magazine, teamed up with the University Hospitals Synergy health clinic - and their state-of-the-art culinary school - to create a remarkable new kind of cookbook. Chefs made the food taste great. Nutritionists made it supergood for you.Featuring 80 full-day menu plans - including Thanksgiving, Christmas, Easter, and the Fourth of July; special menus from culinary giants Graham Kerr, Wolfgang Puck, Diana Shaw, and Lora Brody; customized plans for men and women - plus dieters; 6 foolproof steps to permanent weight loss; easy ways to boost your intake of antioxidants and fiber; and timesaving shopping tips.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Jesus I Never Knew Study Guide",
        "Authors": "By Yancey, Philip and Quinn, Brenda",
        "Description": "Voted Book of the Year Philip Yancey’s bestselling book The Jesus I Never Knew peeled away popular stereotypes to present a brilliant and fascinating portrait of Christ. Now individuals and groups can join Yancey in this probing look at Jesus Christ—his teachings, his miracles, his death and resurrection, and ultimately, who he was and why he came. This study guide helps readers press beyond the traditional picture to uncover a Jesus who is brilliant, creative, challenging, fearless, compassionate, unpredictable, and ultimately satisfying. Each chapter begins with Yancey’s reflections on rediscovering Jesus. Questions that stimulate journaling follow, with note-writing sections that assist the reader in·         Seeing Jesus through Scripture·         Looking at Jesus Within and Without·         Being Seen by Jesus·         Further Glimpses of Jesus·         Gazing on Jesus This Week Also included are Yancey’s suggestions for viewing Hollywood films on Jesus, with optional directions about film usage in studying The Jesus I Never Knew.",
        "Category": " Religion , Christian Living , Personal Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Befriending: A Self-Guided Retreat for Busy People",
        "Authors": "By Payne, Joseph A.",
        "Description": "",
        "Category": " Religion , Christian Theology , Ethics",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Anatomy of Deception",
        "Authors": "By Goldstone, Lawrence",
        "Description": "A mesmerizing forensic thriller that thrusts the reader into the operating rooms, drawing rooms, and back alleys of 1889 Philadelphia, as a young doctor grapples with the principles of scientific process to track a daring killerIn the morgue of a Philadelphia hospital, a group of physicians open a coffin and uncover the corpse of a beautiful young woman.  What they see takes their breath away.  Within days, one of them strongly suspects that he knows the woman’s identity…and the horrifying events that led to her death.  But in this richly atmospheric novel–an ingenious blend of history, suspense and early forensic science–the most compelling chapter is yet to come, as young Ephraim Carroll is plunged into a maze of murder, secrets and unimaginable crimes....Dr. Ephraim Carroll came to Philadelphia to study with a leading professor, the brilliant William Osler, believing that he would gain the power to save countless lives.  As America hurtles toward a new century, medicine is changing rapidly, in part due to the legalization of autopsy–a crime only a few years before.   But Carroll and his mentor are at odds over what they glimpsed that morning in the hospital’s Dead House.  And when a second mysterious death is determined to have been a ruthless murder, Carroll can feel the darkness gathering around him–and he ignites an investigation of his own.Soon he is moving between the realm of elite medicine, Philadelphia high society, and a teeming badlands of criminality and sexual depravity along the city’s fetid waterfront. With a wealthy, seductive woman clouding his vision, the controversial artist Thomas Eakins sowing scandal, and the secrets of the nation’s powerful surgeons unraveling around him, Carroll is forced to confront an agonizing moral choice–between exposing a killer, undoing a wrong, and, quite possibly, protecting the future of medicine itself….",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Culture Shock! Thailand (Culture Shock! A Survival Guide to Customs & Etiquette)",
        "Authors": "By Cooper, Robert George and Cooper, Nanthapa",
        "Description": "Whether you travel for business, pleasure, or a combination of the two, the ever-popular \"Culture Shock!\" series belongs in your backpack or briefcase. Get the nuts-and-bolts information you need to survive and thrive wherever you go. \"Culture Shock!\" country guides are easy-to-read, accurate, and entertaining crash courses in local customs and etiquette. \"Culture Shock!\" practical guides offer the inside information you need whether you're a student, a parent, a globetrotter, or a working traveler. \"Culture Shock!\" at your Door guides equip you for daily life in some of the world's most cosmopolitan cities. And \"Culture Shock!\" Success Secrets guides offer relevant, practical information with the real-life insights and cultural know-how that can make the difference between business success and failure.Each \"Culture Shock!\" title is written by someone who's lived and worked in the country, and each book is packed with practical, accurate, and enjoyable information to help you find your way and feel at home.",
        "Category": " Travel , Asia , Southeast",
        "Publisher": "Graphic Arts Center Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Crossing Over: One Woman's Escape from Amish Life",
        "Authors": "By Garrett, Ruth Irene and Farrant, Rick",
        "Description": "A work Booklist called ଯving and life–affirming, Crossing Over is the true story of one woman&#39;s extraordinary flight from the protected world of the Amish people to the chaos of contemporary life.Ruth Irene Garrett was the fifth of seven children raised in Kalona, Iowa, as a member of a strict Old Order Amish community. She was brought up in a world filled with rigid rules and intense secrecy, in an environment where the dress, buggies, codes of conduct, and way of life differed even from other Amish societies only 100 miles away. This Old Order community actively avoided all interaction with ೨e Englishߜ&#39;96 everyone who lived on the outside. As a result, Ruth knew only one way of life, and one way of doing things.This compelling narrative takes us inside a hidden community, offering a striking look as one woman comes to terms with her discontent and ultimately leaves her family, faith and the sheltered world of her childhood. Unsatisfied, she bravely crosses over to contemporary life to fully explore the foreign and frightening reality in hope of better understanding her emotional and spiritual desires. What emerges is a powerful tale of one woman&#39;s search for meaning and the extraordinary lessons she learns along the way.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Silent Thunder",
        "Authors": "By Johansen, Iris and Johansen, Roy",
        "Description": "Number-one bestselling author Iris Johansen teams up with Edgar Award winner Roy Johansen and the result is an explosive, tour-de-force thriller. . . . It was the assignment of a lifetime. . . . Brilliant marine architect Hannah Bryson has been given the job of a lifetime. A U.S. maritime museum has just acquired the decommissioned Soviet submarine Silent Thunder for public exhibition. It’s Hannah’s job to make sure that every single inch of the legendary nuclear attack sub is safe for the thousands of visitors anticipated. Enlisting the aid of her brother, Connor, they examine the enormous vessel and delve into its long---and lethal---history. But is it really a trap? In the course of their investigation, Connor discovers a mysterious message behind one of the ship’s panels. But before he can figure out what it means, there’s a deadly assault on Silent Thunder. . . .     Though the U.S. government tries to warn Hannah away, she’ll stop at nothing to find the ruthless mastermind behind her brother’s death. Even if it means joining forces with a mysterious man who may be even more dangerous than the enemy she has sworn to bring down. As Hannah finds herself in the crossfire of an epic standoff, her only hope for survival is to unravel the sub’s explosive secret. But someone’s willing to kill to make sure Silent Thunder stays silent. . . . Brisk, exhilarating, and filled with authentic details, Silent Thunder is what you get when you team the biggest name in suspense with the stunning plot twists of an Edgar Award--winning author. Get ready for a page-turning thrill ride!",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Vitamins Minerals Supplements",
        "Authors": "By Griffith, H. Winter",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Vitamins",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Marching Toward Hell: America and Islam After Iraq",
        "Authors": "By Scheuer, Michael",
        "Description": "When Michael Scheuer first questioned the goals of the Iraq War in his 2004 bestseller Imperial Hubris, policymakers and ordinary citizens alike stood up and took notice. Now, Scheuer offers a scathing and frightening look at how the Iraq War has been a huge setback to America's War on Terror, making our enemy stronger and altering the geopolitical landscape in ways that are profoundly harmful to U.S. interests and security concerns. Marching Toward Hell is not just another attack on the Bush administration. Rather, it sounds a critical alarm that must be heard in order to preserve the nation's security. Scheuer outlines the ways that America's foreign policy since the end of the Cold War has undermined the very goals for which we are fighting and played right into bin Laden's hands. The ongoing instability in Iraq, for example, has provided al Qaeda and its allies with the one thing they want most: a safe haven from which to launch operations across borders into countries that were previously difficult for them to reach. With U.S. forces and resources spread thinner every day, the war has depleted our strength and brought al Qaeda a kind of success that it could not have achieved on its own. A twenty-plus-year CIA veteran, Scheuer headed the agency's Osama bin Laden unit, managed its covert-action operations, and authored its rendition program. Scheuer spent his career developing strategies to keep America safe, by any means deemed necessary by the presidents he served. It was his job to take available intelligence and devise plans to protect Americans, without considering bias, position, or even existing alliances. In Marching Toward Hell, Scheuer takes on the questions of \"What went wrong?\" and \"How can we fix this?\" and proposes a plan to cauterize the damage that has already been done and get American strategy back on track. He lists a number of painful recommendations for how we must shift our ideological, military, and political views in order to survive, even if that means disagreeing with Israeli policy or launching more brutal campaigns against terrorists. America holds its destiny in its hands, Scheuer says, yet not nearly enough has been done to defend America and destroy its Islamist enemies. This is an eye-opening, alarming, contentious, and ultimately fascinating examination of how far off track the War on Terror has gone, and a critical read in understanding what we must do to save it.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Weekly Reader Children's Book Club presents Nana upstairs & Nana downstairs",
        "Authors": "By De Paola, Tomie",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Wall of Silence: The Untold Story of the Medical Mistakes that Kill and Injure Millions of Americans",
        "Authors": "By Kern, Rosemary Gibson, Gibson, Rosemary, and Singh, Janardan Prasad",
        "Description": "Medical mistakes occur with alarming frequency in this country. Nightly newscasts and daily newspapers tell of botched surgeries, mistaken patient identities, careless overdoses, and neglected diagnoses. You may have dismissed these stories as unfortunate mistakes, misunderstandings, or just isolated incidents with the occasional bad doctor.Wall of Silence reveals that these medical mistakes are not rare incidents with the occasional bad doctor. In fact, the real-life stories in this book show that medical mistakes are increasing in frequency&#151;and worse, that the system is designed more to cover up these errors than prevent them.",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "LifeLine Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Introduction to Humanities",
        "Authors": "By Smiley",
        "Description": "",
        "Category": "",
        "Publisher": "Scott Foresman & Co",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Great Little Madison (Unforgetable Americans)",
        "Authors": "By Fritz, Jean",
        "Description": "In the days before microphones and TV interviews, getting people to listen to you was not an easy task. But James Madison used his quiet eloquence, intelligence and passion for unified colonies to help shape the Constitution, steer America through the turmoil of two wars, and ensure that our government, and nation, remained intact.u?An excellent, fascinating, indispensable resource.? --Kirkus Reviews, pointer review?The book is rich in the sort of detail that illuminates the man, but is not limited to personal information; a great deal of government history is woven into the biography.? --Horn Book, starred review?Fritz has given a vivid picture of the man and an equally vivid picture of the problems that faced the leaders of the new nation in the formative years.? --The Bulletin of the Center for Children?s Books, starred review?Young readers will feel like they know the ?Great Little Madison? very well.? --School Library Journal",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Political",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Angel Answers: Creating Heaven on Earth",
        "Authors": "By Ramer, Andrew",
        "Description": "First Came Ask Your Angels. Now the angels speak for themselves with a message of healing and love.  For all of us who learned how to  Ask Your Angels, here is the next step to enlightenment and joy -- Angel Answers, a handbook for living in a new millennium. In these pages the angels themselves provide answers to our most pressing personal questions, showing us how to bring happiness into our lives, attract love, be true to our values and create heaven on earth.  \"This Book is a guide for listening, not just to the angels, but to the highest wisdom you carry within your heart.\"  Angels have come into our lives to help us see the luminous beauty that is our birthright, and now Andrew Ramer shares with us the knowledge that his own companion angel has revealed to him. We have always asked the angels for heavenly guidance and inspiration, but never before has there been a sourcebook of angel advice and instruction that we can turn to in moments of need or just to celebrate our connection to the angels. In these pages, you will discover heavenly opinions on gratitude, the ego, sorrow, friendship, death, and prayer. You will learn, from the angels themselves, how to find your soul, how to understand the language of angels, how to talk to your body about healing, how to laugh, and the pleasures of sharing joy.  The angels answer with a message of true love, joy, ecstasy and bliss. Their guidance offers us all the power to transmute ourselves from fearful, limited, destructive beings into radiant children of God.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Billy Goat and His Well-Fed Friends",
        "Authors": "By Hogrogian, Nonny",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Best Ever 20 Minute Cookbook",
        "Authors": "By Jenni Fleetwood",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House, Annes Pub. Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Keeping Score",
        "Authors": "By Park, Linda Sue",
        "Description": "Both Maggie Fortini and her brother, Joey-Mick, were named for baseball great Joe DiMaggio. Unlike Joey-Mick, Maggie doesn’t play baseball—but at almost ten years old, she is a dyed-in-the-wool fan of the Brooklyn Dodgers. Maggie can recite all the players’ statistics and understands the subtleties of the game. Unfortunately, Jim Maine is a Giants fan, but it’s Jim who teaches Maggie the fine art of scoring a baseball game. Not only can she revisit every play of every inning, but by keeping score she feels she’s more than just a fan: she’s helping her team.Jim is drafted into the army and sent to Korea, and although Maggie writes to him often, his silence is just one of a string of disappointments—being a Brooklyn Dodgers fan in the early 1950s meant season after season of near misses and year after year of dashed hopes. But Maggie goes on trying to help the Dodgers, and when she finds out that Jim needs help, too, she’s determined to provide it. Against a background of major league baseball and the Korean War on the home front, Maggie looks for, and finds, a way to make a difference.Even those readers who think they don’t care about baseball will be drawn into the world of the true and ardent fan. Linda Sue Park’s captivating story will, of course, delight those who are already keeping score.",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Voyage of the Sanderling: Exploring the Ecology of the Atlantic Coast from Maine to Rio",
        "Authors": "By Stone, Roger D.",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "OBJECTS OF DESIRE: The Lives of Antiques and Those Who Pursue Them",
        "Authors": "By Freund, Thatcher",
        "Description": "This vivid journey into the world of antiques follows the fortunes of three eighteenth-century pieces of American furniture as they pass through the hands of twentieth-century pickers, dealers, restorers, and collectors, accruing new value while becoming objects of desire.Among the many desirable objects on offer during the 1991 Americana Week in New York - the annual high point of antiques sales - are three prized pieces. One stands in a spolight at the Winter Antiques Show: a pine blanket chest made for a farmer in the 1750s and still wearing its original coat of robin's egg blue paint. The asking price is $250,000. A few blocks away, on display at Sotheby's, is a rare Chippendale card table, created in Philadelphia in 1759. The auction house is hoping that bidding for the piece will reach one million dollars. Also on display at Sotheby's is an inlaid sofa table from the Federal period, valued at $100,000, one of the prized possessions of a collector forced by circumstance to sell his cherished objects.How these three pieces came to be at the apex of the American antiques market is the story of the evolution of the world of antiques: a world of bold enterprise, canny deal making, consuming aesthetic vision, and obsessive pursuit - all fueled by a passionate attraction to objects.",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Baskets: Design Ideas, Techniques and Materials, Step-By-Step Projects",
        "Authors": "By Kollath, Richard",
        "Description": "Demonstrates basic basket making techniques, tells how to customize store-bought baskets, and includes tips on decorating with baskets",
        "Category": " Art , General",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Meditation Year",
        "Authors": "By Hope, Jane",
        "Description": "In THE MEDITATION YEAR, Jane Hope introduces the reader to the traditional principles of meditation, using straightforward, practical approaches. Each chapter focuses on a particular month and carefully explains the many techniques necessary for successful daily meditation, from simple breathing techniques and postures to ways to achieve a more heightened state of mind using both symbolic images and words in meditative practice.",
        "Category": " Body, Mind & Spirit , Mindfulness & Meditation",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Reflections at Walden",
        "Authors": "By Henry david Thoreau",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark",
        "Price Starting With ($)": "23.52",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Combat and Survival 28 : What it Takes to Fight and Win (The Inside World of the Professional Soldier)",
        "Authors": "By Combat and Survival",
        "Description": "",
        "Category": "",
        "Publisher": "H. S. Stuttman",
        "Price Starting With ($)": "29.23",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Look-It-Up Book of Presidents",
        "Authors": "By BLASSINGAME, Wyatt",
        "Description": "A newly revised edition of a backlist favorite! This inexpensive, high-quality reference book that children have turned to for more than 20 years now contains a completely revised chapter on Bill Clinton, plus a brand-new chapter on the winner of the 2000 presidential election! Middle-graders can find out the answers to such questions as: When and why was the White House set on fire? Which president appears on the $5,000 bill? And who served only one month in office? All 43 presidents are arranged chronologically with short biographical sketches, exciting you-are-there action photos, cartoons, and campaign memorabilia. It's American history in a nutshell.",
        "Category": " Young Adult Nonfiction , Biography & Autobiography , Political",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "It's a Sure Thing: A Wry Look at Investing, Investors, and the World of Wall Street",
        "Authors": "By Metz, Robert, Stasen, George, and Martin, Henry (ILT)",
        "Description": "Across the nation, bookstore shelves are groaning under the weight of heavy investment tomes packed with dubious advice, incomprehensible jargon, and financial platitudes.On telephone lines from coast to coast, investment brokers are crooning seductively to their clients: \"It's a sure thing. It can't miss. Trust me.\"Now comes a smart, savvy, irreverent book that takes deadly aim at these and other financial prophets. As refreshing as it is informative, this no-nonsense, commonsense guide shows you how Wall Street and the markets really work, and how to decipher the often confusing or misleading predictions of \"experts.\" Written by a wise, witty, seasoned Wall Street observer and featuring a wealth of devastatingly clever and satiric cartoons by renowned New Yorker cartoonist Henry Martin, \"It's a Sure Thing\" puts you, the investor, squarely inside the Wall Street \"loop.\" Not only will you be entertained and amused - you'll also be taught the sophisticated, wary, and profitable approaches to playing the markets that you need to be a successful investor today. Among the subjects explored: how to choose a trustworthy broker ... and when even trustworthy brokers cannot be trusted; why stock market averages can be misleading, and what you should really look for in analyzing market performance; how to tell if your money is really working; why you should beware of companies that overpromote; how to balance investment risks against investment opportunity and figure out how much risk is too much for you; why investment charts have a way of appearing most convincing just as they are about to change direction; how to quickly spot misleading Wall Street euphemisms and sweeping Wall Street generalities, and avoid being taken in by either; how to stop focusing on stock market minutiae and concentrate on the \"big picture\"; plus advice on the ins and outs of portfolio turnover and diversification ... the \"fine print\" in annual reports ... stock splits ... mergers and acquisitions ... the laws of supply and demand ... and much more.Featuring the perfect blend of wit and wisdom as well as a 10-page stock selection guide, \"It's a Sure Thing\" sounds a welcome call for a much-needed return to plain common sense in equity investing.",
        "Category": " Business & Economics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Images of Bermuda",
        "Authors": "By Labrucherie, Roger A.",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Tuttle Pub",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Introduction to Spanish Poetry: A Dual-Language Book (Dover Dual Language Spanish)",
        "Authors": "By Florit, Eugenio (EDT)",
        "Description": "From the 12th-century Cantar de Mío Cid to the 20th-century poetry of García Lorca, Salinas, and Alberti, this book contains 37 poems by Spain's greatest poets. Selected by Professor Eugenio Florit, the poems are presented in the full original Spanish text, with expert literal English translations on the facing pages. Enjoy the poetic inspiration, imagery, insight, and wisdom of such masters as Lope de Vega, Miguel de Unamuno, Federico García Lorca, Margués de Santillana, Jorge Manrique, Garcilaso de la Vega, Fray Luis de León, San Juan de la Cruz, Francisco de Quevedo y Villegas, Gustavo Adolfo Bécquer, Antonio Machado, Rafael Alberti, Pedro Salinas, and many more. In addition to the poetic texts, Professor Florit has also provided a wealth of biographical and critical commentary, outlining the significance of the poets and their works in the long tradition of Spanish literature. Portraits of the poets are included where available.",
        "Category": " Poetry , European , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Deliverer (Foreigner Universe)",
        "Authors": "By Cherryh, C. J.",
        "Description": "In the aftermath of civil war, the world of the atevi is still perilously unstable. Tabini-aiji, powerful ruler of the Western Association, along with his son and heir, and his human paidhi, Bren Cameron, have returned to the Bu-javid, their seat of power. The usurper, Murini, has escaped to the lands of his supporters, but the danger these rebels pose is far from over. The world of the atevi has fragmented into two antagonistic political camps: the forward-thinking, pro-space, open-to-change Western Association, headed by Tabini, and the forces of traditional East: anti-space, opposed to change, distrustful of humans. Ilisidi, Tabini's grandmother, the aiji-dowager, has returned to her ancient castle in the East, for though she supports the rule of her grandson, she also has powerful ties in the lands of the rebels, and seeks to muster whatever support she can from among those enemy strongholds.In the heavily armed and tightly guarded Bu-javid, eight-year-old Cajeiri is horribly bored. The last two years of his life have been more fascinating than most children could imagine. Two years on an interstellar starship, surrounded by human children, a completely different environment, different culture, different mindset, new and different concepts and experiences, have left him craving excitement and the company of his peers - both human and atevi. Even Bren is too busy to spend much time with him. At loose ends and feeling deserted, Cajeiri resorts to playing pranks and causing mischief - two thing for which the already tense leaders at the Bu-javid have little patience.But unbeknownst to this dissatisfied youngster he has become a target for forces bent on destroying his father's rule and everything it stands for. There are those who are committed to ensuring that Cajeiri never lives to inherit the power his father now wields. Though still a child, Cajeiri embodies a unique threat to the venerable, tradition-defined lifestyle of his people. For this innocent young boy is the first atevi youth to have lived in a human environment, surrounded by human children. And after hundreds of years of fragile, tenuous atevi-human coexistence, Cajeiri may very well be the first atevi to ever truly understand the so similar yet so dangerously different aliens who share his home planet and threaten the hidebound customs of his race.",
        "Category": " Fiction , Science Fiction , Adventure",
        "Publisher": "DAW",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "A Wolf at the Table: A Memoir of My Father",
        "Authors": "By Burroughs, Augusten",
        "Description": "“As a little boy, I had a dream that my father had taken me to the woods where there was a dead body. He buried it and told me I must never tell. It was the only thing we’d ever done together as father and son, and I promised not to tell. But unlike most dreams, the memory of this one never left me. And sometimes…I wasn’t altogether sure about one thing: was it just a dream?”When Augusten Burroughs was small, his father was a shadowy presence in his life: a form on the stairs, a cough from the basement, a silent figure smoking a cigarette in the dark. As Augusten grew older, something sinister within his father began to unfurl.  Something dark and secretive that could not be named.  Betrayal after shocking betrayal ensued, and Augusten’s childhood was over. The kind of father he wanted didn’t exist for him. This father was distant, aloof, uninterested…And then the “games” began. With A Wolf at the Table, Augusten Burroughs makes a quantum leap into untapped emotional terrain: the radical pendulum swing between love and hate, the unspeakably terrifying relationship between father and son. Told with scorching honesty and penetrating insight, it is a story for anyone who has ever longed for unconditional love from a parent. Though harrowing and brutal, A Wolf at the Table will ultimately leave you buoyed with the profound joy of simply being alive. It’s a memoir of stunning psychological cruelty and the redemptive power of hope.",
        "Category": " Family & Relationships , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Unitarian Universalist Pocket Guide",
        "Authors": "By Schulz, William F.",
        "Description": "",
        "Category": "",
        "Publisher": "Skinner House Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Home Spa, Relax",
        "Authors": "By Glanville-Blackburn, Jo",
        "Description": "",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Ryland Peters & Small",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Seven Strange & Ghostly Tales",
        "Authors": "By Jacques, Brian",
        "Description": "A chilling collection of ghost stories features an unforgettable cast of characters, including Henry Mawdsley, who lies too much, Gilly Bodkin, who risks her life for her sweet tooth, and Allie Alma, a girl with a penchant for theft",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Camelot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "High-tech espionage",
        "Authors": "By TUCK, Jay",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "NTC's Beginner's French and English Dictionary",
        "Authors": "By Winders, Jacqueline, Etheredge, Lorrie, Conrad, Dennis",
        "Description": "Each of the 3,500 entries contains a clear pronunciation key, parts of speech, an exact English or French equivalent, and an example sentence.",
        "Category": " Foreign Language Study , French",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Betty Rosbottom's Cooking School Cookbook",
        "Authors": "By Rosbottom, Betty",
        "Description": "Provides recipes for appetizers, soups, souffles, pasta, seafood, poultry, meats, salads, vegetables, breads, cakes, tarts, pies, cookies, and sandwiches",
        "Category": " Cooking , Reference",
        "Publisher": "Workman Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Book for Boston",
        "Authors": "By Howland, Llewellyn",
        "Description": "",
        "Category": "",
        "Publisher": "David R Godine Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "The Arabs (A Pelican book)",
        "Authors": "By Mansfield, Peter",
        "Description": "Traces the history of the Arabs, surveys the modern Arab states, and looks at their religion, culture, traditions, and politics",
        "Category": " History , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Make It Easy In the Kitchen",
        "Authors": "By Grad, Laurie Burrows",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Smart Kids with Learning Difficulties: Overcoming Obstacles and Realizing Potential",
        "Authors": "By Weinfeld, Rich (EDT), Barnes-Robinson, Linda, Jeweler, Sue, and Shevitz, Betty Roffman",
        "Description": "Smart Kids With Learning Difficulties: Overcoming Obstacles and Realizing Potential is an engaging must-read for any parent, educator, or counselor of smart kids who face learning difficulties. The authors, who have more than 20 years experience working with and advocating for gifted and learning-disabled children, provide useful, practical advice for helping smart kids with learning challenges succeed in school.The purpose of Smart Kids With Learning Difficulties is to guide parents and educators toward identifying and planning for smart kids with learning challenges so that they will reach their true potential. This book deals with research and experience the authors have gained from working directly with students who are smart, but struggle in school. The authors present learning and teaching methods that have been applied successfully to both the gifted and talented and the learning-disabled populations. These methods can, and should, be used with all bright kids with learning difficulties, whether or not they have official labels.Topics covered in the book include identifying and recognizing gifted/learning-disabled students, what the law says about this population, planning and developing accommodations that empower these students, what works and doesn't work in the classroom, tools and checklists to build supportive learning environments, and the roles and responsibilities of parents, students, and school personnel.For additional information on gifted students with learning difficulties, see Distinguishing Characteristics of Gifted Students With Disabilities, Teaching Gifted Students With Disabilities, and Successful Strategies for Twice-Exceptional Students.Educational ResourceRead an Interview With the Smart Kids AuthorsThe Smart Kids authors, Rich Weinfeld, Linda Barnes-Robinson, Sue Jeweler, and Betty Roffman Shevitz, talk candidly about their experiences working with and teaching smart kids with learning difficulties. This interview offers a personal, insightful look into the lives and experiences of these leading experts from America's cutting-edge schools. To read a transcript of their interview, click here.Check Out a Sample Chapter from Smart Kids With Learning Difficulties\"Who Are Smart Kids With Learning Difficulties?\" is an engaging, interesting excerpt from the recently released book, Smart Kids With Learning Difficulties. This chapter looks at the gifted and learning-disabled population and offers definitions and characteristics of these students. To read the sample chapter, click here",
        "Category": " Family & Relationships , Children with Special Needs",
        "Publisher": "Prufrock Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Rules of Thumb 2",
        "Authors": "By Parker, Tom",
        "Description": "Gathers informal guidelines about writing poetry, proof reading, drinking wine, selecting glasses, watering a lawn, cooking a steak, wearing a wig, and making investments",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Microsoft Age of Empires II (EU-Inside Moves)",
        "Authors": "By Walker, Mark H.",
        "Description": "This latest edition to the \"\"Inside Moves\"\" series shows readers all the strategy gambits and tricks for winning Microsoft Age of Empires II. A historical real-time strategy game, Age of Empires shows gamers how to not only survive but thrive in the Middle Ages.",
        "Category": " Games , Video & Electronic",
        "Publisher": "Microsoft Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Summer of Roses",
        "Authors": "By Rice, Luanne",
        "Description": "Few novelists today write with the power to move our hearts, quicken our souls, and enrich our lives like Luanne Rice. In New York Times bestsellers such as Dance with Me, Beach Girls, and The Secret Hour, she vividly captures the dramas that make all the difference in love and families. Now, revisiting the remarkable characters introduced in her bestselling Summer’s Child, she brings full circle one of her most compelling explorations of the human heart…all the many ways it can be broken…and the magic that can make it whole again.Their lives were a tapestry woven together by love and loss, tragedy and hope. On the windswept coast of Nova Scotia, Lily and her eight-year-old daughter, Rose, are struggling to embrace a new life even as Lily tries to let go of painful memories of the past. Among the lives that will touch theirs are those of Liam Neill, a dedicated teacher living in self-imposed isolation; Maeve Jameson, mourning the loss of a granddaughter she devoted her life to protecting; and Mark Murphy, a dogged police detective obsessed with a woman who vanished years ago–who may or may not have found what he seeks in a tiny, out-of-the-way maritime village.During this eventful summer of roses, the paths–and fates–of these unforgettable characters will intersect in ways that none of them could ever expect–and shape a future none of them could possibly foresee. For each of them it will be a time of renewal and transformation that will circle inevitably to a past left behind, a mystery unsolved, and a love reclaimed. Summer of Roses is vintage Luanne Rice–a novel that celebrates the ties of family, the passion of lovers, and the deep, unbreakable bonds that hold us together through all the seasons of our lives.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The American Heritage Dictionary of Science",
        "Authors": "By Barnhart, Robert K",
        "Description": "With more than 16,000 entries from astronomy to zoology, this dictionary contains the most accurate, up-to-date, and understandable definitions currently available to the general reader.",
        "Category": " Science , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Jackie: Her Life in Pictures",
        "Authors": "By Spada, James",
        "Description": "A photographic biography of Jaqueline Bouvier Kennedy Onassis covers her entire life, accompanies its many pictures with anecdotal captions, and is largely made up of rarely or previously unpublished images. 50,000 first printing.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Diabetic's Healthy Exchanges Cookbook: 150 Quick and Delicious Recipes for Every Day and Special Occasions (Healthy Exchanges Cookbooks)",
        "Authors": "By Lund, JoAnna M.",
        "Description": "Real food for people living in the real world with diabetes.   Just because you’re on a “restricted diet” doesn’t mean you have to be a slave to the bland and boring. Now you can eat exciting, tantalizing foods, control your condition and weight, and stay heart-healthy, all with one comprehensive cookbook. JoAnna Lund’s Healthy Exchanges works because every one of these recipes must, according to her four basic rules, be:• Low in Fat and Sugar: A diabetic demands less sugar, less fat, and lower cholesterol.• Easy to Make: If it takes longer to cook than to eat, you won’t see it in this book.• Made from Ordinary Ingredients: If you can’t find it in a local supermarket, you won’t find it in this book. • As Tasty and Good as It Looks: If a dish doesn’t satisfy every sense, the way old family favorites do, it won’t get eaten—no matter how healthy it is!   The Diabetic’s Healthy Exchanges Cookbook features more than 150 kitchen- and family-tested recipes, complete with all diabetic and weight-loss exchanges, as well as information on calories and fat content, plenty of helpful hints, and a good dose of encouragement. “I recommend [JoAnna’s recipes] to my diabetic patients.”—Donna S. Conway, RN, BSN, MA, CDE   “. . . Creative, fun, EASY, very tasty . . . my diabetic patients’ favorites!”—Yvonne Guthrie, RD, CDE",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Transforming Congregational Culture",
        "Authors": "By Robinson, Anthony B.",
        "Description": "Many recent books have attempted to address the \"crisis\" in the mainline church. Anthony Robinson here makes a significant -- and in many ways unique -- contribution to this discussion by bringing his personal insights as a pastor to bear on the issue of renewing congregational life.Writing from twenty-five years of experience in four congregations of differing size, location, and ethnic makeup, Robinson prescribes concrete changes in the practice of ministry that have been tried, tested, and lived out to great success. At the heart of his framework for church renewal is what he calls \"cultural change.\" According to Robinson, technical or programmatic change is not sufficient to address the needs of the day. He argues for changing the veryculture of mainline congregations, which involves recognizing and fostering their particular gifts and genius rather than trying to remake them into something they are not. His fruitful strategies for renewal touch every aspect of congregational life, from personal spiritual formation to church leadership.",
        "Category": " Religion , Christian Ministry , Pastoral Resources",
        "Publisher": "Wm. B. Eerdmans Publishing Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Scandal of the Season: A Novel",
        "Authors": "By Gee, Sophie",
        "Description": "London, 1711. As the rich, young offspring of the city's most fashionable families þll their days with masquerade balls and clandestine court-ships, Arabella Fermor and Robert, Lord Petre, lead the pursuit of pleasure. Beautiful and vain, Arabella is a clever coquette with a large circle of beaus. Lord Petre, seventh Baron of Ingatestone, is a man-about-town with his choice of mistresses. Drawn together by an overpowering attraction, the two begin an illicit affair.Alexander Pope, sickly and nearly penniless, is peripheral by birth, yet his uncommon wit and ambition gain him unlikely entrance into high society. Once there, privy to every nuance and drama, he is a ruthless observer. He longs for the success that will cement his place in society; all he needs is one poem grand enough to make his reputation.As the forbidden passion between Arabella and Lord Petre deepens, an intrigue of a darker nature threatens to overtake them. Fortunes change and reputations -- even lives -- are imperiled. In the aftermath, Pope discovers the idea for a daring poem that will catapult him to fame and fortune.",
        "Category": " Fiction , Biographical",
        "Publisher": "Scribner",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Essentials of Negotiation",
        "Authors": "By Lewicki, Roy J., Saunders, David M., and Minton, John W.",
        "Description": "",
        "Category": "",
        "Publisher": "Richard d Irwin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "A Killer's Kiss",
        "Authors": "By Lashner, William",
        "Description": "You want to know what deceit tastes like? It's sweet. Like honey. Charged with electricity. Laced with amnesia. It's why adultery will never go out of fashion, why sincerity fails, why sex with strangers is more fun than ever it ought to be. It is the very taste of old love reclaimed, which might be the sweetest deceit of all.There's nothing easier—or more dangerous—than falling into bed with an old lover.Especially when you're Victor Carl.Once upon a time, Victor was engaged to a woman named Julia. She was beautiful and elegant and not the kind of woman to end up with a second-rate lawyer on the edge of insolvency. Victor always assumed she'd burn him, and she did.Now she's back, trailing an expensive perfume that reeks of trouble.Julia's husband has been murdered, her fingerprints are all over the crime scene, and $1.7 million in cash is missing. Julia is suddenly in desperate need of a fall guy. Is that why she turns up on Victor's doorstep on the night of the murder, with her lipstick fresh and her heels high? It's all enough to make Victor doubt the healing power of love.But in Victor's world lust trumps reason seven days a week. As he reaches for his old lover, he convinces himself that Julia truly wants to make amends for the past, that they might have a future together, and that the Beatles were right—all you need is love. Until two cops troop into his apartment and start fingering Victor for the murder.Suddenly, Victor Carl, a man who has spent a lifetime making bad decisions for the worst reasons, is no longer fighting to rekindle a lost love. He's fighting to save his life.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "I Can Cook, You Can Cook! Simply Great Maryland Recipes",
        "Authors": "By Brokke, Wayne",
        "Description": "Baltimore's favorite food personality is now gaining national recognition with his down-home style, no nonsense love of food, and recipes so simple and delicious folks everywhere will be saying: \"I can cook, what he cooks!\"  From his days as the proprietor of Baltimore's first casual restaurant to the popular Wayne's Bar-B-Que located on the Inner Harbor, Wayne Brokke is truly an American original. Now, more than 150 of Wayne's recipes are available to anyone who wants to enjoy simple, fast, and delicious home cooking that's more than just comfort food, it's comfort for the soul.  Peppered with Wayne's unique anecdotes, these easy-to-follow recipes also include Wayne's special hints for cooks that encourage experimentation and creativity. I Can Cook, You Can Cook! includes outstanding soups, salads, entrees, vegetable dishes, desserts, breakfast, and cool summer drinks, as well as helpful information Wayne has learned on his lifelong cooking odyssey.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "The Overlook Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Real Food for People with Diabetes",
        "Authors": "By Cross, Doris and Williams, Alice",
        "Description": "Provides recipes for diabetics, including muffins, breads, soups, salads, meat, poultry, pastas, and casseroles",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Defense Strategy for the Post-Saddam Era",
        "Authors": "By O'Hanlon, Michael E.",
        "Description": "The Brookings Institution has long produced an analysis of America's defense budgets and policies. The war on terror and the ongoing operations in Iraq and Afghanistan have forced upon this country soaring defense budgets and unprecedented challenges in policymaking. In the newest installment in this tradition, leading foreign policy expert Michael O'Hanlon offers policy recommendations for strengthening the ability of America's military to respond to international crises in a tumultuous world.  The United States can, for the foreseeable future, be confident that its armed forces will remain engaged in Iraq, as well as in Afghanistan and other theaters in the war on terror. It will also need to remain involved in deterrence missions in the western Pacific, most notably in Korea and the Taiwan Strait. It will wish to remain engaged in European security, since the capabilities and cohesion of the NATO alliance have important implications for the United States globally.  O'Hanlon reviews these priorities, asking tough questions and developing frameworks for answering them:  &#149; What military will the United States need in the future?  &#149; How much will it cost?  &#149; How can the U.S. increase the size of its ground forces without increasing the size of the defense budget?  &#149; In an era of apocalyptic terror threats, and at a time of $400 billion defense budgets and $400 billion federal budget deficits, how can this country protect its citizens while maintaining fiscal responsibility?",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Stop, Train, Stop! A Thomas the Tank Engine Story",
        "Authors": "By Awdry, W. and Bell, Owain (ILT)",
        "Description": "Illustrated in full color. When Thomas the Tank Engine decides to bypass his usual stops and speed directly to the end of the line, havoc ensues. Thomas is in such a hurry that the passengers can't get on or off, and everything gets bounced up and down in a wonderful jumble!",
        "Category": " Juvenile Fiction , Transportation , Railroads & Trains",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Manifesta: Young Women, Feminism, and the Future",
        "Authors": "By Baumgardner, Jennifer and Richards, Amy",
        "Description": "A powerful indictment from within of the current state of feminism, and a passionate call to armsFrom Lilith Fair to Buffy the Vampire Slayer to the WNBA--everywhere you look, girl culture is clearly ascendant. Young women live by feminism's goals, yet feminism itself is undeniably at a crossroads; \"girl power\" feminists appear to be obsessed with personal empowerment at the expense of politics while political institutions such as Ms. and NOW are so battle weary they've lost their ability to speak to a new generation. In Manifesta, Jennifer Baumgardner and Amy Richards show the snags in each feminist hub--from the dissolution of riot grrrls into the likes of the Spice Girls, to older women's hawking of young girls' imperiled self-esteem, to the hyped hatred of feminist thorns like Katie Roiphe and Naomi Wolf--and prove that these snags have not, in fact, torn feminism asunder. In an intelligent and incendiary argument, Baumgardner and Richards address issues instead of feelings and the political as well as the personal. They describe the seven deadly sins the media commits against feminism, provide keys to accessible and urgent activism, discuss why the ERA is still a relevant and crucial political goal, and spell out what a world with equality would look like. They apply Third Wave confidence to Second Wave consciousness, all the while maintaining that the answer to feminism's problems is still feminism.",
        "Category": " Social Science , Feminism & Feminist Theory",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Benjy and the Barking Bird",
        "Authors": "By Graham, Margaret Bloy",
        "Description": "Benjy, the family dog, attempts to do away with a visiting parrot that can bark better than he can",
        "Category": "",
        "Publisher": "HarperCollins Children’s Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Sesame Street Storybook",
        "Authors": "By Albert G. Miller",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1971"
        }
    },
    {
        "Title": "Female Chauvinist Pigs: Women and the Rise of Raunch Culture",
        "Authors": "By Levy, Ariel",
        "Description": "A classic work on gender culture exploring how the women’s movement has evolved to Girls Gone Wild in a new, self-imposed chauvinism. In the tradition of Susan Faludi’s Backlash and Naomi Wolf’s The Beauty Myth, New York Magazine writer Ariel Levy studies the effects of modern feminism on women today.Meet the Female Chauvinist Pig—the new brand of “empowered woman” who wears the Playboy bunny as a talisman, bares all for Girls Gone Wild, pursues casual sex as if it were a sport, and embraces “raunch culture” wherever she finds it. If male chauvinist pigs of years past thought of women as pieces of meat, Female Chauvinist Pigs of today are doing them one better, making sex objects of other women—and of themselves. They think they’re being brave, they think they’re being funny, but in Female Chauvinist Pigs, Ariel Levy asks if the joke is on them.  In her quest to uncover why this is happening, Levy interviews college women who flash for the cameras on spring break and teens raised on Paris Hilton and breast implants. She examines a culture in which every music video seems to feature a stripper on a pole, the memoirs of porn stars are climbing the bestseller lists, Olympic athletes parade their Brazilian bikini waxes in the pages of Playboy, and thongs are marketed to prepubescent girls. Levy meets the high-powered women who create raunch culture—the new oinking women warriors of the corporate and entertainment worlds who eagerly defend their efforts to be “one of the guys.” And she traces the history of this trend back to conflicts between the women’s movement and the sexual revolution long left unresolved.  Levy pulls apart the myth of the Female Chauvinist Pig and argues that what has come to pass for liberating rebellion is actually a kind of limiting conformity. Irresistibly witty and wickedly intelligent, Female Chauvinist Pigs makes the case that the rise of raunch does not represent how far women have come, it only proves how far they have left to go.",
        "Category": " Social Science , Feminism & Feminist Theory",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The All New Diabetic Cookbook",
        "Authors": "By Maynard, Kitty, Maynard, Lucian, and Duncan, Theodore",
        "Description": "Included are traditional recipes, from appetizers to desserts, and new vegetarian recipes using a variety of rice, grains, and vegetables.  With recipes for children, it is the perfect book for young and old alike.A complete guide to healthy eating, The All-New Diabetic Cookbook includes up-to-date and easy-to-understand information on eating out, traveling, and stress management.  In addition, it provides the ADA's new exchange lists and nutrition recommendations.Developed by a team uniquely qualified both in the medical care of those with diabetes and in cooking and meal planning.  The All-New Diabetic Cookbook includes menu plans that accommodate several levels of caloric intake, from 1.000 to 3,000 calories per day.  A detailed nutritional analysis of each dish, including the number of calories and percentage of calories that come from fat, follows each recipe.Beautifully illustrated with full-color photographs and containing more than 400 recipes, The All-New Diabetic Cookbook is a book doctors will recommend to their patients.  It is a thorough revision of Cooking for Diabetics, which has sold over 100,000 copies.",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Macmillan Dictionary for Children",
        "Authors": "By Costello, Robert B. (EDT)",
        "Description": "An updated edition of the popular reference includes thirty-five thousand entries, along with illustrations, photographs, and maps, as well as word histories, spelling notes, and cultural- and gender-inclusive definitions.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "8.11",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Shabby Chic",
        "Authors": "By Ashwell, Rachel and Costin, Glynis",
        "Description": "\"Shabby Chic is as unpretentious as its author, including thoughts about what works and what doesn't, tips on how to shop at a flea market, inspirational photographic illustrations and plenty of encouragement.\" —Los Angeles Daily News   Rachel Ashwell’s bestselling guide to home furnishings, flower arrangements, flea-market finds, tag-sale treasures, and more continues to bring American home decorating back to basics with its remarkably down-to-earth yet beautiful aesthetic, showing you how to capture “the aura of old money, cushy comfort, and crafted indifference.” With her keen eye for thrifty style, and a peerless sense of how to get the most for the least out of your adventures into interior decorating, Ashwell and Shabby Chic are your treasure map to a treasure-filled home.",
        "Category": " Social Science , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Dessert Every Night!",
        "Authors": "By Lund, JoAnna M. and Alpert, Barbara",
        "Description": "Luscious cream pies, mouth-watering cakes, rich puddings, sweet fruit salads, hearty cobblers - nothing finishes a meal like a great dessert. And in this all-new collection of more than 200 recipes, JoAnna Lund shows you how you can have your cake - or pie or pudding - and eat it too, without guilt.Discover the Healthy Exchanges way of eating, with the \"diet queen of Dewitt, Iowa,\" who has shown hundreds of thousands how to lose weight and regain health without sacrificing what they love most. And nowhere has JoAnna been more successful in exchanging the fat- and calorie-laden goodies for healthy choices than in her wide range of irresistible desserts.Joanna Lund gives you Dessert Every Night! - recipes that are easy to prepare, using readily available ingredients, low in calories and fat, and high in taste.",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    }
]