[
    {
        "Title": "Then Came You: A Novel",
        "Authors": "By Weiner, Jennifer",
        "Description": "An unexpected love story… Jules Strauss is a Princeton senior with a full scholarship, acquaintances instead of friends, and a family she’s ashamed to invite to Parents’ Weekend. With the income she’ll receive from donating her “pedigree” eggs, she believes she can save her father from addiction. Annie Barrow married her high school sweetheart and became the mother to two boys. After years of staying at home and struggling to support four people on her husband’s salary, she thinks she’s found a way to recover a sense of purpose and bring in some extra cash. India Bishop, thirty-eight (really forty-three), has changed everything about herself: her name, her face, her past. In New York City, she falls for a wealthy older man, Marcus Croft, and decides a baby will ensure a happy ending. When her attempts at pregnancy fail, she turns to technology, and Annie and Jules, to help make her dreams come true. But each of their plans is thrown into disarray when Marcus’ daughter Bettina, intent on protecting her father, becomes convinced that his new wife is not what she seems…  With startling tenderness and laugh-out-loud humor, Jennifer Weiner once again takes readers into the heart of women’s lives in an unforgettable, timely tale that interweaves themes of class and entitlement, surrogacy and donorship, the rights of a parent and the measure of motherhood.",
        "Category": " Fiction , Women",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Chicken Soup for the Couple's Soul (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Donnelly, Mark (COM), Donnelly, Chrissy (COM), and De Angelis, Barbara (COM)",
        "Description": "Whether single, separated or someone's spouse, everyone wants to find and keep this elusive thing called love.  Bestselling author and foremost relationship expert Barbara De Angelis teams up as a co-author of Chicken Soup for the Couple's Soul, a collection of heartwarming stories about how real people discovered true love with the person of their dreams.With chapters on finding each other, intimacy, commitment, understanding, and overcoming obstacles, readers will find inspiration whether they're beginning a new relationship, hoping to work through a difficult one, or trying to recognize extraordinary moments in their lives.A sweet spoonful of this enchanting Chicken Soup collection will warm the hearts of the romantic readers everywhere.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Chicken Soup for the Soul Healthy Living Series Menopause",
        "Authors": "By Health Communications (NA)",
        "Description": "This new series from Chicken Soup for the Soul - inspirational stories followed by positive, practical medical advice for caregivers and patients - is the perfect blend of emotional support and vital information about menopause including: Common mythsunknown factstalking with friends and familyfrom mood swings to \"mentalpause\" relieving symptoms spice up your life the truth about HRT alternative treatmentstaking charge of your healththe positive side of menopauseChicken Soup for the Soul partners with top doctors to give you the information you need to survive-and the positive inspiration to thrive. Each book features beautifully written stories plus information on diet, lifestyle, diagnosis, procedures, caregiving, emotional issues and alternative therapies from some of the world's foremost experts.",
        "Category": "",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "God's Word for Girls",
        "Authors": "By Richards, Larry (EDT), Richards, Sue (EDT), and Richards, Paul (ILT)",
        "Description": "This easy-to-read Bible also includes an introduction to each book of the Bible, brief devotionals, advice on worthwhile values for girls, and biographical sketches of Old and New Testament heroines.",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "World Pub",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Handbook for Today's Catholic Teen",
        "Authors": "By Auer, Jim",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Liguori",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The 7-Day Back Pain Cure: How Thousands of People Got Relief Without Doctors, Drugs, or Surgery",
        "Authors": "By Cannone, Jesse",
        "Description": "",
        "Category": " Health & Fitness , Alternative Therapies",
        "Publisher": "Lightning Source Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Antichrist",
        "Authors": "By Harper, Larry",
        "Description": "",
        "Category": "",
        "Publisher": "The Elijah Project",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Delicious Amish Recipes: People's Place Book No. 5",
        "Authors": "By Good, Phyllis Pellman",
        "Description": "A leading expert on Amish life and cooking traditions selects choice recipes which are favorites among these people, known for their plentifully spread tables. Delectable and bursting with flavor! Amish families gather around their long kitchen tables for three meals together every day. It may be routine, but the food they enjoy is beyond the ordinary. Delicious Amish Recipes includes Cracker Pudding, Fresh Meadow Tea, Potato Rolls, Baked Corn, Chicken Roast, Shoofly Pie, Whoopie Pies, and many, many more tasty favorites, all easy to prepare.           Here are some of their favorite recipes -- Baked Corn, Chicken Roast, Fresh Meadow Tea, Potato Rolls, Shoofly Pie, Cracker Pudding, and Whoopie Pies! Gathered by a leading expert on Amish life and cooking traditions.Skyhorse Publishing, along with our Good Books and Arcade imprints, is proud to publish a broad range of cookbooks, including books on juicing, grilling, baking, frying, home brewing and winemaking, slow cookers, and cast iron cooking. We’ve been successful with books on gluten-free cooking, vegetarian and vegan cooking, paleo, raw foods, and more. Our list includes French cooking, Swedish cooking, Austrian and German cooking, Cajun cooking, as well as books on jerky, canning and preserving, peanut butter, meatballs, oil and vinegar, bone broth, and more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
        "Category": " Cooking , Regional & Ethnic , American , Middle Atlantic States",
        "Publisher": "Good Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Science Book of Jets and Rockets",
        "Authors": "By Sharp, Elizabeth N.",
        "Description": "",
        "Category": "",
        "Publisher": "Science Materials Center",
        "Price Starting With ($)": "7.07",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Forest babies",
        "Authors": "By Parrish, Jean J",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "Snow White and The Seven Dwarfs  (Derrydale Fairy Tale Library)",
        "Authors": "By Brown, Kay and Embleton, Gerry (ILT)",
        "Description": "Retells the tale of the beautiful princess whose lips were red as blood, skin was white as snow, and hair was black as ebony.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Derrydale",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Why Men Don't Listen and Women Can't Read Maps : How We're Different and What to Do About It",
        "Authors": "By Pease, Barbara, Pease, Allan, and Dolby, Trevor (EDT)",
        "Description": "The classic international bestselling book. Allan and Barbara Pease spotlight the differences in the way men and women think.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Orion Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Home Song (Cape Light, Book 2)",
        "Authors": "By Kinkade, Thomas and Spencer, Katherine",
        "Description": "Cape Light is a small seaside hamlet where folks still enjoy a strong sense of community and care about their neighbors. It doesn't mean they don't have any problems. It just means that when they do, someone is there to help.  Cape Light mayor Emily Warwick has too much on her plate: the election, town conflicts, and a family feud between her mother and sister. She soon finds herself pulled in every direction, leaving no room for the dreams she enjoyed years ago. And as her sister's wedding draws nearer-and her mother's objections to the marriage grow stronger-it seems that family harmony is a hopeless dream. But in this quaint New England village, miracles do happen",
        "Category": " Fiction , Literary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Spanish for Educators",
        "Authors": "By Harvey, William C.",
        "Description": "Approaching language details informally and with a minimum of classroom-style presentation, author and educator Harvey offers practical instruction in Spanish basics. The focus is on conversational Spanish for teachers, counselors, administrators, and other employees at schools where Spanish is the first language of many students. Two opening chapters present fundamentals of Spanish speech and word order, and familiarize readers with often-used words and phrases that relate directly to school situations. The two following chapters pertain to Spanish that is most useful for communicating with younger students (pre-school through elementary grades) and older students (middle and high school grades). Remaining chapters offer help for counseling in Spanish in issues relating to health care, career guidance, college assistance, educational administration, special-needs, and extracurricular activities. A Spanish-English and English-Spanish glossary is also provided to help educators find the right word or phrase for a variety of situations.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "What Makes Popcorn Pop?: And Other Questions About the World Around Us (Library of First Questions and Answers)",
        "Authors": "By Myers, Jack",
        "Description": "Answers questions about food, such as \"Why does Swiss cheese have holes?\" \"Why do Bananas have peels?\" and \"Can I still eat an apple that turns brown?\"",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Why Are Wagons Red? (Time-Life Library of First Questions and Answers About Transportation)",
        "Authors": "By Daniels, Patricia (EDT)",
        "Description": "Answers questions about forms of transportation from tricycles to the space shuttle, including \"Why are wheels round?\" and \"What are all those knobs and dials for?\"",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Honey from the Rock: An Easy Introduction to Jewish Mysticism",
        "Authors": "By Kushner, Lawrence",
        "Description": "",
        "Category": "",
        "Publisher": "Jewish Lights Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Sisters in Crime 3",
        "Authors": "By Lilian Jackson Braun, Dorothy Salisbury Davis, Faye Kellerman, Sara Paretsky",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "BTH-SOFT FURNISHINGS (Home Sewing Library)",
        "Authors": "By Brumstead, Elaine",
        "Description": "Discusses fabric and equipment as well as describing techniques for making curtains, shades, bed linen, table linen, cushions, and chair covers",
        "Category": " House & Home , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Treasuring Emma (A Middlefield Family Novel)",
        "Authors": "By Fuller, Kathleen",
        "Description": "Emma always put the needs of others ahead of her own. When will it be her turn to be treasured?Adam was her first love and best friend. But then he went away. Determined to experience the freedom of living in the Englisch world, he left Emma heart-broken. How could he have chosen the world over her?Now Adam is back in Middlefield and Emma can't seem to keep him away from her family's farm. But this time she's determiend to guard her heart. It might be love that keeps him there . . . or perhaps just guilt.When a newcomer arrives in town and shows an interest in Emma, she dismisses Adam's insistence that she be cautious. All this attention is new to her and she doesn't know quite how to accept it. Emma knows her Heavenly Father treasures her. But will her new beau?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "The Tea Companion (Connoisseur's Guides)",
        "Authors": "By Pettigrew, Jane",
        "Description": "More and more people are turning to tea as their primary hot beverage, and connoisseurs are discovering the wondrous range of flavors to be found in different varieties from around the globesome of which command fantastic prices and are in great demand. This comprehensive, authoritative guide to understanding, purchasing, and serving the world’s finest teas is beautifully illustrated with full-color photographs of a variety of tea leaves and herbs, as well as their countries of origin. Learn how to store tea so its aromas last, brew it properly for fullest enjoyment, and appreciate the many nuances of flavor to be found in this extraordinary drink.",
        "Category": " Cooking , Beverages , Non-Alcoholic",
        "Publisher": "Running Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Hen's Pens (Easy Words to Read)",
        "Authors": "By Cox, Phil Roxbee, Cartwright, Stephen (ILT), and Tyler, Jenny",
        "Description": "Hen uses her colored pens to draw on any surface she can find on the farm, but what she likes best is to make zigzag patterns.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Affordable Weddings: How to Have the Wedding of Your Dreams on the Budget of Your Choice",
        "Authors": "By Clark, Lee and Curet, Robert (ILT)",
        "Description": "Offers practical advice concerning the ceremony, budget, locations, invitations, dress, flowers, music, decorations, food, photographs and videotapes, and the wedding cake",
        "Category": " Social Science , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.75",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Under a Desert Sky",
        "Authors": "By Mills, DiAnn",
        "Description": "When socialite Eva Fortier flees to the secluded area of Ghost Ranch, New Mexico from New York, Navajo doctor Tahoma Benally must honor a vow to help and protect her, even as an elusive killer stalks her, and his feelings for her begin to deepen.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Summerside Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Kentucky Weddings (Romancing America)",
        "Authors": "By Fowler, Terry",
        "Description": "Visit blue grass horse country and meet the three Truelove siblings who have big dreams concerning their careers that don’t include unlikely romances. Val wants to turn a horse farm into a wedding business, but each of her ideas is countered by an architect with a grudge. Heath wants to finally put his education to use, but the return of his first love makes him face long held fears. Opie wants it all, including a culinary career and a family, but a date with Paris’s most eligible bachelor shows her just how old-fashioned some men can still be about marriage.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Down to the Sea: An Epic Story of Naval Disaster and Heroism in World War II",
        "Authors": "By Henderson, Bruce",
        "Description": "This epic story opens at the hour the Greatest Generation went to war on December 7, 1941, and follows four U.S. Navy ships and their crews in the Pacific until their day of reckoning three years later with a far different enemy: a deadly typhoon. In December 1944, while supporting General MacArthur's invasion of the Philippines, Admiral William \"Bull\" Halsey neglected the Law of Storms, placing the mighty U.S. Third Fleet in harm's way. Drawing on extensive interviews with nearly every living survivor and rescuer, as well as many families of lost sailors, transcripts and other records from naval courts of inquiry, ships' logs, personal letters, and diaries, Bruce Henderson finds some of the story's truest heroes exhibiting selflessness, courage, and even defiance.",
        "Category": " History , Military , Naval",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Harcourt School Publishers Treasury of Literature: Library Book Grade 2-3 Two Of Everything",
        "Authors": "By Hong, Lily Toy (RTL)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Houghton Mifflin School",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Upland Passage: A Field Dog's Education",
        "Authors": "By Jones, Robert F. and Eppridge, Bill (PHT)",
        "Description": "It's the playfulness of the Labrador retriever - perhaps even more than its eagerness to please and learn - that has made Robert F. Jones an owner and enthusiast of the breed for nearly thirty years. While most upland bird hunters prefer a surefire pointing breed, Jones delights in the existential rhythm of working the fields with a good flushing dog - it's the spontaneity and the teamwork, not the number of kills, that mark the spirit of the hunt for him. During the past eleven years, Luke, a black Lab who's nearing retirement age, has been an invaluable companion both in the field and at home. But as Luke gets older, Jones realizes that it's time to train a new dog. That's when he decides to get Jake. And upon their first meeting, Bob can tell that this eight-week-old yellow Lab has all the makings of a beautiful, strong hunting dog.Accompanied by Bill Eppridge's lively photographs, Upland Passage is a wonderful weave of history, biography, and personal philosophy. Tracing the roots of the Labrador to its earliest ancestors, Robert Jones examines the relationship between man and dog, teaching us the elements of proper training, and showing us the lessons both man and dog stand to learn from each other.",
        "Category": " Sports & Recreation , General",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Illinois Weddings (Romancing America)",
        "Authors": "By Melby, Becky and Wienke, Cathy",
        "Description": "Settle in for an enjoyable escape as inspirational romance comes to Illinois through the stories of three amazing women. Angel’s life was on the fast track to success—until she turned it over to Jesus Christ. Can Wade help her discover the meaning of true success? Jeanie’s hope for the future crumbles when Steve reappears. If she tells him the truth will she lose him again? Ruby is learning how easy it is to be impulsive and spontaneous—especially with Burt. But will their joy disappear when others opinions intrude?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "Hope Rekindled (Striking a Match)",
        "Authors": "By Peterson, Tracie",
        "Description": "At long last, Deborah Vandermark is preparing for her own wedding...but the groom suddenly goes absent. Tragedy has befallen Christopher's family in Kansas City, upsetting the doctor's future with Deborah. With five siblings now under his care, can he return to Texas and impose a ready-made family on Deborah? Deborah herself finds her resolve faltering as her fears about marriage and career start to overwhelm her. How can she marry and be a mother to Christopher's siblings, and still be able to pursue her work and training as a physician? When an old adversary reveals a contract that may spell ruin for Vandermark Logging, Deborah's life seems to be spiraling out of control. How can God possibly work this for good? And can Christopher and Deborah find a way to claim the future they long to share when so much stands in their way?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "How to Select & Use Olympus SLR Cameras",
        "Authors": "By Carl Shipman",
        "Description": "",
        "Category": "",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Eliminate Chaos: The 10-Step Process to Organize Your Home and Life",
        "Authors": "By Leist, Laura",
        "Description": "Eliminate Chaos is a user-friendly system for organizing each room of the house, including the kitchen and pantry, closet, garage, home office, and childrens' rooms. The author’s ten-step system is presented in an easy-to-use, workbook-style layout. Full-color photos demonstrate the various stages of the organizing process, illustrating not just \"before and after,\" but the realistic, messy, all-important steps in between. Leist’s method is based on the underlying principle that “it’s not about the stuff.” She touches on the psychological reasons behind clutter and not letting go — such as procrastination, denial, thrift, and family history — but her underlying premise is that being organized is an on-going process, not a one-day event. By learning to sort, prioritize, and make fast, rational decisions about their household goods, readers become more efficient and functional not just at home, but in other areas of life as well.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Sasquatch Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The One Year Mini for Students",
        "Authors": "By Beers, Gilbert, Beers, Ron",
        "Description": "Take the One Year experience with you anytime, anywhere with The One Year Mini for Students. Inspirational One Year devotions for each day alongside brief passages from God's Word in a compact 4 × 6 size that fits effortlessly in a purse or pocket. Students will be encouraged to deepen and grow in their faith. Includes a ribbon so you can easily mark your place throughout the year.",
        "Category": " Religion , Devotional",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "How to clean everything;: An encyclopedia of what to use and how to use it",
        "Authors": "By Alma Chesnut Moore",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Hoyle's Rules of Games: Descriptions of Indoor Games of Skill and Chance with Advice on Skillful Play",
        "Authors": "By Mott-Smith, Geoffrey",
        "Description": "Provides a comprehensive guide to the rules, strategies, and odds for more than 250 games, including a wide variety of board, solitaire, parlor, card, children's, and computer games, such as Scrabble, Chess, Backgammon, Gin Rummy, Poker, Minesweeper, FreeCell, Contract Bridge, and more. Original.",
        "Category": " Games , Reference",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Enemies Among Us: A Thriller",
        "Authors": "By Hamer, Bob",
        "Description": "When undercover FBI agent Matt Hogan totals three vehicles in an out-of-policy Beverly Hills pursuit of a fleeing Arab drug runner, he incurs the wrath of the Bureau hierarchy. To avoid an almost certain suspension, he accepts a new assignment tracking terrorist cell groups while posing as a volunteer at a nonprofit charity. What he doesn't know is the ripples of danger from this case will threaten not only his life but the safety and security of the entire nation.\"A page-turning roller coaster that feels like Jack Bauer's 24 without sailing over the top.\"Publishers Weekly\"Bob Hamer's debut novel delivers realism only an undercover FBI agent can bring. Enemies Among Us will grab you from word one and stay with you long after you've read the last evocative page. Mitch Rapp has a new friend in the world of fictional heroes, FBI Special Agent Matt Hogan.\"Vince Flynn, New York Times #1 best-selling author\"Knowing Hamer 'walked the talk' as an FBI undercover agent gives this thriller a genuine edge that rings like a struck bell.\"Kevin Sorbo, producer/director and star of Hercules: The Legendary Journeys and Gene Roddenberry's Andromeda\"Hamer brings a realism to his writing few authors can.\"Karri Turner, actress from the CBS series JAG and recipient of the 2009 USO \"Heart of a Patriot\" Award* Winner of the San Diego Christian Writers Guild \"Best Fiction Award\"",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Discovering Home with Laurie Smith: Find Your Personal Style",
        "Authors": "By Smith, Laurie",
        "Description": "Laurie uses her own home, personal design journal, and classical training to teach design techniques.Inspirational, full-color photos capture Laurie’s before-and-after design process.Gives homeowners confidence to work with any home’s architectural \"bones.\"Strategies to arrange furniture, choose colors, and play with patterns to create rooms that reflect personal interests and tastes.Expert advice for window treatments, lighting, fabrics, color schemes, and accessories.",
        "Category": " House & Home , Decorating",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "PCs All-in-One Desk Reference For Dummies (For Dummies (Computer/Tech))",
        "Authors": "By Chambers, Mark L.",
        "Description": "Covers the most popular PC applications and tools available today, fully revised to include Windows XP, Office \"X,\" Works 7, and basic Internet, digital photography, and home networkingWalks the reader through setting up a computer, navigating the Windows desktop, using e-mail, exploring the Internet, and much moreConvenient minibook format makes it easy to find desired information quickly",
        "Category": " Computers , Hardware , Personal Computers , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "60-Second Commute, The: A Guide to Your 24/7 Home Office Life",
        "Authors": "By Orloff, Erica and Levinson, Kathy",
        "Description": "Discusses how to establish and run a home office, covering such topics as balancing work and home life, selecting the correct office equipment, and keeping records.",
        "Category": " Business & Economics , Small Business",
        "Publisher": "FT Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Celtic Names for Children",
        "Authors": "By Todd, Loreto",
        "Description": "",
        "Category": " Family & Relationships , Baby Names",
        "Publisher": "O'Brien Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Great Physician's Rx for Diabetes",
        "Authors": "By Rubin, Jordan and Brasco, Joseph",
        "Description": "Bestselling author Jordan Rubin, with  David Remedios, M.D., shows how to adopt the 7 Keys in The Great Physician's Rx for Health and Wellness to focus aggressively on diabetes and develop a game plan against it.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Five-Star Basketball Drills",
        "Authors": "By Garfinkel, Howard (EDT) and Klein, Will",
        "Description": "Over 5,000 talented players have completed the Five-Star program and received scholarships. Distinguished alumni include Isiah Thomas, Moses Malone, Dominique Wilkins, Michael Jordan, Mark Aguirre, John Paxson, Jim Paxson, Jeff Ruland, Darnell Valentine, and Mike O'Koren. Here, in print for the first time, is a compilation of 131 drills they practiced at the nation's premier basketball camp. The book includes the following:131 of the best drills used at the Five-Star campConditioning, one, two, and three player drills for men and womenProven regimens from a star-studded galaxy of NCAA and NBA coachesStep by step instructions with pictures and diagrams to maximize your potential and practice time\"Howard Garfinkel and Will Klein are as well organized in their presentation of drills as they are in their camp. This book is a great contribution to your basketball library.\" -- Bob Knight\"Owning one of the most varied sports libraries in the country, I consider myself an expert on sports books. Nowhere on my shelves is there anything approaching the value of these drills for youngsters and young coaches. It's the best drill book in America.\" -- George Raveling\"With the advent of the three-point shot, there's now a high priority on the skill parts of the game. This book will help the dedicated user become a fundamentally sound player.\" -- Mike Fratello\"A must for all young players and coaches who want to learn the game the way it should be taught.\" -- Rick Pitino\"Five-Star has done a great job helping kids. I admire the way they've emphasized teaching the concepts and maintained the personal touch in dealing with youngsters. This book carries on that great tradition.\" -- Mike Krzyzewski",
        "Category": " Sports & Recreation , Basketball",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Versed in Country Things",
        "Authors": "By Frost, Robert, King, B. A. (PHT), and Lathem, Edward Connery (EDT)",
        "Description": "Twenty of Frost's best poems have been chosen for this special book. Favorites such as \"After Apple-Picking,\" \"Birches,\" and \"In Time of Cloud Burst\" - mixed with poems not yet fully appreciated for their force and beauty - are complemented by B. A. King's eloquent and spare black-and-white images. These photographs evoke Frost's New England with their stone walls, stark farmhouses, snowy woods, and the simple poetry of a windswept tree.",
        "Category": " Poetry , General",
        "Publisher": "Bulfinch Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Favorite Holiday Traditions",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Pubg",
        "Price Starting With ($)": "6.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Alphabet Juice: The Energies, Gists, and Spirits of Letters, Words, and Combinations Thereof; Their Roots, Bones, Innards, Piths, Pips, and Secret ... With Examples of Their Usage Foul and Savory",
        "Authors": "By Blount, Roy, Jr.",
        "Description": "\"If everybody's first English teacher were Roy Blount Jr., we might still be trillions in debt, but we would be so deeply in love with words and their magic . . . that we'd hardly notice.\" —Chris Tucker, The Dallas Morning NewsAfter forty years of making a living using words in every medium except greeting cards, Roy Blount Jr. still can't get over his ABCs. In Alphabet Juice, he celebrates the juju, the crackle, the sonic and kinetic energies, of letters and their combinations. He has a strong sense of right and wrong, but he is not out to prescribe proper English. His passion is for questions such as these: Did you know that both mammal and matter derive from baby talk? Have you noticed how wince makes you wince?Three and a half centuries ago, Thomas Blount produced his Glossographia, the first dictionary to explore derivations of English words. This Blount's Glossographia takes that pursuit to new levels. From sources as venerable as the OED and as fresh as Urbandictionary.com, and especially from the author's own wide ranging experience, Alphabet Juice derives an organic take on language that is unlike, and more fun than, any other.\"Amusing, bemusing, and smart as hell.\" —Daniel Okrent, Fortune\"Danced in Blount's arms, English swings smartly.\" —Jack Shafer, The New York Times Book Review\"Gracefully erudite and joyous.\" —Katherine A. Powers, The Boston Sunday Globe",
        "Category": " Language Arts & Disciplines , Linguistics , Etymology",
        "Publisher": "Sarah Crichton Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Woman's Day Cookbook for Healthy Living",
        "Authors": "By Alston, Elizabeth",
        "Description": "If you're ready to feel great and take charge of your health (and your family's), then this book is for you. Relax! Just because the recipes in this book are \"healthy\" doesn't mean you have to give up the foods you love. This book offers a simple, enjoyable approach to delicious and healthful cooking that anyone can master. This is no diet book - the recipes are neither fat-free, sugar-free or sodium-free - rather, it is a daily guide to gradually changing your cooking habits to include a wide variety of nutritious foods: fruits and vegetables, meats and fish, whole grains and even sweets. Over time, you'll find that a positive transformation has taken place, without you even knowing it! You'll feel better, look better and save time while making fabulous meals the whole family will enjoy.The best approach to building a healthy lifestyle is a balanced approach - none of those restrictive fad diets, splurging on the latest workout equipment or popping the vitamin du jour. Nor must you deny yourself the occasional slice of chocolate cake. Instead, we'll help you make positive choices that support your lifestyle while gradually developing a healthier way of cooking and eating.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Filipacchi Publishing",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Log cabins for everyone",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "House of White Birches",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Mater's Tall Tales (Disney/Pixar Cars) (Cars toon)",
        "Authors": "By Berrios, Frank (ADP)",
        "Description": "Did you know that Mater was once the famous bulldozer fighter, El Materdor? Or that he was a daredevil named Mater the Greater? Or that he was a heroic rescue truck? Three of Mater’s tall tales are collected in one fantastic hardcover storybook featuring Mater, Lightning McQueen, and all their friends from Cars.",
        "Category": " Juvenile Fiction , Transportation , Cars & Trucks",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Floyd Clymer's Historical Scrapbook: Early Advertising Art",
        "Authors": "By Clymer, Floyd",
        "Description": "",
        "Category": "",
        "Publisher": "Bonanza Books",
        "Price Starting With ($)": "30.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Caring for Your Parents: The Complete Family Guide (AARP®)",
        "Authors": "By Delehanty, Hugh, Ginzler, Elinor, and Pipher, Mary (FRW)",
        "Description": "Drawing on AARP’s deep wellspring of expertise in the topic, AARP’s Caring for Your Parents offers both sensitive counsel and a practical road map through the complex emotional terrain many of us face as our parents age. This eye-opening book guides readers through a new, creative approach to caregiving that turns familial duty into a journey of emotional development and resolution.Based on a 32-page National Magazine Award-nominated special feature, Caring for Your Parents documents the innovative ways that real people cope with this age-old issue. Throughout the book you will find useful, field-tested recommendations from AARP’s staff of experts. Topics explored in depth run the gamut from locating quality health care and dealing with the bureaucracy of Medicare to avoiding consumer scams, organizing caregiving from afar, and planning the disposition of an estate. There are tips on designing your parents’ house to make it more elder-friendly, navigating the hidden dangers of assisted living, and dealing with the invisible sibling issue. A resource guide in each chapter lists help lines, websites, and consumer action groups.Thirty million Americans are looking for a new, more effective approach to eldercare. Caring for Your Parents is the answer.",
        "Category": " Family & Relationships , Eldercare",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Insight Guide Germany (Insight Guides)",
        "Authors": "By Halliday, Tony",
        "Description": "",
        "Category": " Travel , Europe , Germany",
        "Publisher": "Insight Guides",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Done.: What most religions don't tell you about the Bible",
        "Authors": "By Cary Schmidt",
        "Description": "",
        "Category": "",
        "Publisher": "Striving Together Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Escape Across the Potomac",
        "Authors": "By Whitehair, C. W.",
        "Description": "",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Infinity Publishing",
        "Price Starting With ($)": "6.63",
        "Publish Date": {
            "Month": "July",
            "Year": "2013"
        }
    },
    {
        "Title": "Texas Dawn (Lovegram)",
        "Authors": "By Vaughan, Vivian",
        "Description": "Texas blockade runner Stella Duval is held captive by Yankee Captain Logan Cafferty, the man she once planned to marry, and their passion rekindles even as the Civil War threatens to tear them apart",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Tales of Grt Dragons",
        "Authors": "By J. K. Anderson",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Bellerophon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "American Folktales, Myths, Legends",
        "Authors": "By Conron, Leslie, Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Madison Park Press",
        "Price Starting With ($)": "7.97",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Raising Happy Kids On a Reasonable Budget",
        "Authors": "By Gallagher, Patricia.",
        "Description": "",
        "Category": "",
        "Publisher": "[F&W Publications Inc]",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Cooking with the Diabetic Chef: Expert Chef Chris Smith Shares His Secrets to Creating More Than 150 Simply Delicious Meals for Peop",
        "Authors": "By Smith, Chris",
        "Description": "Many cookbooks for people with diabetes are written by nutritionists or dietitians, but while those books might present well-balanced and nutritional recipes, they often fail to focus on recipes that are flavorful and easy to prepare. Author Chris Smith is not only a trained restaurant chef and a graduate of the prestigious Culinary Institute of America--but he is also a person with diabetes.You will find more than 150 recipes--everything from appetizers to entrees to desserts--arranged by season so that the freshest ingredients can always be used. You will also discover a simple and convenient way to organize meals up to  a month in advance using the Diabetic Chef's unique meal planner.",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "American Diabetes Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Your Name in Print: A Teen's Guide to Publishing for Fun, Profit and Academic Success",
        "Authors": "By Harper, Elizabeth and Harper, Timothy",
        "Description": "Make Your MarkLooking for a way to express yourself? Need some extra spending money? Do you want to beef up that college application package? Look no further than this book.      With advice on how to write newspaper and magazine features, Web blogs, music and movie reviews, novels, graphic novels, short stories, and more, the father-daughter team of Timothy and Elizabeth Harper shows that it's possible for anyone who writes well to get published.      Topics include:·        How to find subjects to write about·        Learning productive research and writing habits·        Identifying the best market for your work·        Managing your career·        And so much more      With practical information on every step of the writing process, writing samples, personal anecdotes, tips from the pros, profiles on young authors such as Christopher Paolini and Zoe Trope, and a resource section, Your Name in Print has all the tools and advice young writers need to break into the writing world.",
        "Category": " Reference , Writing Skills",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Rocco's Five Minute Flavor: Fabulous Meals with 5 Ingredients in 5 Minutes",
        "Authors": "By DiSpirito, Rocco, Leutwyler, Henry (PHT), and Kurek, Kris",
        "Description": "Rocco DiSpirito blasts through the rash of meals-in-30-minutes cookbooks with a revolutionary book sure to rock kitchens across America. In Rocco's 5 Minute Flavor, every dish is ready in 5 minutes or less, using 5 ingredients, and all for under $5 per serving. This is fast food with all of Rocco's celebrated expertise with flavor; food that no one will believe didn't take hours of work. A James Beard Award, two restaurants, a network television show, and two cookbooks into his profession, Rocco left the day-to-day restaurant business after a long career and many, many hours behind the stove. He asked himself, \"Can a chef find happiness in New York City without a restaurant?\" The answer is yes. Rocco began exploring the good life, having dinner parties at home and cooking for himself, instead of chomping down leftovers at 2 A.M. He discovered the keys to liberating the busy home cook: shop smart, keep a few key pantry items on hand, and get the most out of your stove -- cooking over high heat is the secret to meals in 5 minutes.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Scribner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Interpol Imbroglio",
        "Authors": "By Grotenrath, Mary Jo",
        "Description": "",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "AuthorHouse",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Astronomer: A Novel of Suspense",
        "Authors": "By Goldstone, Lawrence",
        "Description": "1534, Paris. A student at the Catholic Collège de Montaigu, serving as a courier for the Inquisition, is murdered by members of an extreme Lutheran sect for the packet of letters he is carrying. His friend and fellow classmate Amaury de Faverges—the illegitimate son of the Duke of Savoy and an expert in astronomy and natural science—is recruited as his replacement and promised a decree of legitimacy if he can uncover the secret that threatens to overturn Catholicism and the reign of François I. Working undercover, Amaury journeys south to the liberal court of the king's sister, Marguerite of Navarre, the alleged heart of the conspiracy. The deeper he probes, the more Amaury is forced to confront his own religious doubts; and when he discovers a copy of Copernicus's shocking manuscript showing the sun at the center of the universe, he knows the path he must follow. Replete with characters and events from history—from the iconoclastic Rabelais to the burning of heretics in Paris to preacher John Calvin and Copernicus himself—The Astronomer is a powerful novel of love and betrayal, and a thrilling portrait of what might well have happened at a hinge point in history when science and ancient religious belief collided.",
        "Category": " Fiction , Historical",
        "Publisher": "Walker Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Rocco's Real-Life Recipes",
        "Authors": "By DiSpirito, Rocco",
        "Description": "• More than 175 of Rocco's best recipes for fast, flavorful main dishes, seasoned with his personal comments and favorite shortcuts.• Each recipe can be made in 30 minutes or less, using easy-to-find ingredients—perfect for busy weeknights—or anytime.• 32 pages of enticing color photos of delicious dishes.• Chapters feature the most popular choices for the center-of-the-plate, including beef, pork, lamb, chicken, tuna, salmon, shrimp, and eggs.• A judicious mix of fresh and prepared foods maximizes flavor while keeping prep work to a minimum.• A special chapter “Rocco's Reserve\" features 10 pull-out-all-the-stops menus for casual gatherings or special occasions.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Reconciliation: A Catechesis for Middle Grades (Sacramental Preparation)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "MacMillan-Benziger",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Lonely Planet Tramping in New Zealand (Lonely Planet Walking Guide)",
        "Authors": "By Dufresne, Jim and Williams, Jeff",
        "Description": "A guide to bushwalking in New Zealand, with information on trails, natural features, parks, and travel",
        "Category": " Travel , Europe , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Red Wolf: A Novel (The Annika Bengtzon Series)",
        "Authors": "By Marklund, Liza",
        "Description": "The inspiration for the hit film series, Annika Bengtzon: Crime Reporter, now available on Netflix. Beneath a dark winter sky. . .death waits patiently.  A journalist is murdered in the frozen white landscape of a northern Swedish town. Annika Bengtzon, a reporter at a Stockholm-based tabloid, was planning to interview him about a long-ago attack against an isolated air base nearby, and now she suspects that his death is linked to that attack.  Against the explicit orders of her boss, she begins to investigate the event, which is soon followed by a series of shocking murders. Annika knows the murders are connected. At the same time, she begins to suspect that her husband is hiding something, and nothing can counteract the loneliness that has crept into her life.  Behind everything lurks the figure of the Red Wolf, a cold-blooded killer with the soul of a lover. In the end, she must discover the truth not only about the murders but also about the lies that are destroying her own family.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Webster's Standard Dictionary",
        "Authors": "By",
        "Description": "",
        "Category": " Reference , Dictionaries",
        "Publisher": "Trident Reference Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "From Age to Age: How Christians Have Celebrated the Eucharist",
        "Authors": "By Foley, Edward and Faulkner, Robin (ILT)",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Liturgy Training Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "A Cartoon History of the Reagan Years",
        "Authors": "By Barnes, Fred",
        "Description": "Editorial cartoons offer a satiric look at Reagan's two terms as president",
        "Category": "",
        "Publisher": "Gateway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "I Can Read About Trucks and Cars",
        "Authors": "By Olson, Norman",
        "Description": "",
        "Category": "",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1973"
        }
    },
    {
        "Title": "Tales of mystery and terror (Illustrated classic editions)",
        "Authors": "By Poe, Edgar Allan",
        "Description": "",
        "Category": "",
        "Publisher": "Baronet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Like, Whatever: The Insider's Guide to Raising Teens (Capital Ideas for Parenting)",
        "Authors": "By Kahlenberg, Rebecca R. (EDT)",
        "Description": "Your teen may think he or she is almost an adult who doesn’t need your advice. Not!! You as a parent still have much influence over your kids during this last stage of childhood. In Like, Whatever, 15 experts who are also parents help you navigate through these challenging parenting waters, offering savvy and practical tips on a wide range of current teen-related issues: Money, sex, risky behaviors, health, athletics, faith, discipline, single and blended families, travel, games, generosity of spirit, and others. Each chapter features personal stories, interviews with experts, the latest research, and useful resources to help make these years more understandable, more bearable, and (gulp!) more fun for you as a parent.",
        "Category": " Family & Relationships , Life Stages , Adolescence",
        "Publisher": "Capital Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Linux Install and Configuration Little Black Book: The Must-Have Troubleshooting Guide to Installing and Configuring Linux",
        "Authors": "By Leblanc, Dee-Ann and Yates, Isaac-Hajime",
        "Description": "A problem-solving walk-through for power users who want to have Red Hat or Caldera Linux running quickly and smoothly while adhering to their particular specifications. Sets of task-oriented solutions guide readers through essential setup procedures  and custom configuration. For those familiar with system administration or Linux. LeBlanc is a technical writer and trainer specializing in Linux. Yates is an information technology technician. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Operating Systems , General",
        "Publisher": "Coriolis Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Container gardening: The complete practical guide to container gardening, indoors and outdoors",
        "Authors": "By Donaldson, Stephanie",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "How to Feel Great All the Time: A Lifelong Plan for Unlimited Energy and Radiant Good Health",
        "Authors": "By Saxion, Valerie",
        "Description": "",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Lion's Head Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Prophecies: 4,000 Years of Prophets, Visionaries, and Predictions",
        "Authors": "By Tony Allen",
        "Description": "",
        "Category": "",
        "Publisher": "Thorsons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Basic Legal Research: Tools and Strategies (Legal Research and Writing)",
        "Authors": "By Sloan, Amy E.",
        "Description": "",
        "Category": " Law , Research",
        "Publisher": "Aspen Law & Business",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Basic Elements of the Christian Life, Vol. 1",
        "Authors": "By Witness Lee & Watchman Nee",
        "Description": "",
        "Category": "",
        "Publisher": "Living Stream Ministry",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "My Father, Frank Lloyd Wright (Dover Architecture)",
        "Authors": "By Wright, John Lloyd",
        "Description": "\"An anecdotal reminiscence of America’s chief living genius by his son — short, unconventional, amusing and on the whole revealing.\" — Book Week.Frank Lloyd Wright is widely regarded as the twentieth century’s greatest architect — an unconventional genius who transformed both residential and commercial building design with his concept of “organic” architecture. During a long and productive life, Wright designed some 800 buildings, received scores of honors and awards, and left an indelible imprint on modern architectural theory and practice.In this charming, readable memoir, Wright the architect and father comes to life through the vivid recollections and firsthand knowledge of his son. John Lloyd Wright characterizes his father as “a rebel, a jolt to civilization, whose romantic theme — purposive planning and organic unity in inventing and combining forms — is an epoch in the architecture of the world.” His unique view of the “epoch” will intrigue architects, students, and all who admire the work of this visionary and uncompromising spirit. An added attraction of this volume is the inclusion of the complete text of William C. Gannet's The House Beautiful, an extremely rare work designed and printed by Frank Lloyd Wright.",
        "Category": " Architecture , Individual Architects & Firms , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Prayers for Expectant Parents",
        "Authors": "By Liturgy Training Publications",
        "Description": "",
        "Category": "",
        "Publisher": "Liturgy Training Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Absolute Beginner's Guide to Microsoft Windows XP (Absolute Beginner's Guides (Que))",
        "Authors": "By O'Hara, Shelley",
        "Description": "Covers connecting to the Internet, maintenance, applications, and multimedia features.",
        "Category": " Computers , Operating Systems , Windows Workstation",
        "Publisher": "Que",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Who's Loving You (Honey Diaries)",
        "Authors": "By Morrison, Mary B.",
        "Description": "With her sudden windfall, Honey Thomas has enough money to make a fresh start. Leaving her old life behind in Vegas, Honey sets out for Atlanta, where she opens a counseling center to help victimized women. But just when she thinks she's finally getting a break, Honey's past comes back to haunt her . . .\"Mix dirty red drama, relationship scandals, suspense, love and you get my girl Mary B. Morrison.\"—Vickie Stringer",
        "Category": " Fiction , African American , Urban",
        "Publisher": "Dafina",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "America-A Call To Greatness",
        "Authors": "By Chalfant, John W.",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Xulon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "PP Gingerbread Cookie Murder",
        "Authors": "By Fluke, Joanne, Meier, Leslie, and Levine, Laura",
        "Description": "Contains 3 novelettes. Hannah Swensen of the Cookie Jar in Lake Eden, Minn., discovers her neighbor's head bashed in; Jaine Austen's holiday stay at her parents' home in the Tampa Vistas retirement community is enlivened by the murder of an elderly lothario; and, Maine reporter Lucy Stone investigates a four-year-old boy's disappearance. Includes recipes.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Kensington Publishing Corp.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Putting Away Childish Things: A Tale of Modern Faith",
        "Authors": "By Borg, Marcus J.",
        "Description": "“We all know that Marcus Borg is a gifted teacher, biblical scholar, and writer of nonfiction, but it turns out that he’s a master storyteller, too.” — Brian D. McLaren, author of A New Kind of Christianity Bestselling author, Bible scholar, and theologian Marcus Borg (Meeting Jesus Again for the First Time, The Heart of Christianity, The Last Week) uses his core teachings on faith and the Bible to demonstrate their transformative power and potential in Putting Away Childish Things: the moving, inspirational story of a college professor, her students, and a crisis of faith.",
        "Category": " Fiction , Christian , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Veggie Meals: Rachael Ray's 30-Minute Meals",
        "Authors": "By Ray, Rachael",
        "Description": "An acclaimed television cooking teacher presents eighty-five delicious vegetarian recipes, all of which take thirty minutes or less to prepare, for such dishes as Portobello Burgers, Stuffed Baked Potatoes, Pasta Primavera, and Vegetarian Chili.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Lake Isle Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Mask of Troy: A Novel (Jack Howard)",
        "Authors": "By Gibbins, David",
        "Description": "Here is the most explosive adventure yet from the New York Times bestselling author of Atlantis and The Lost Tomb—a whiplash-inducing novel that sends marine archaeologist Jack Howard and his team on a treasure hunt . . . and a race against time to stop a terrifying threat. Greece, 1876. Renowned archaeologist Heinrich Schliemann unearths the tomb of legendary King Agamemnon and makes a mind-blowing discovery. Determined to keep it secret until the time is right, he dies before it can be revealed to the world.Germany, 1945. The liberation of a concentration camp reveals clues to the lost antiquities stolen by the Nazis. But the operation is covered up after a horrific secret surfaces. Northern Aegean, present day. Jack Howard, head of the International Maritime University, and his team discover the wreckage of the legendary Greek fleet from the Trojan War, sending shockwaves around the world. But the biggest surprise is yet to come, for Jack is on the trail not only of Agamemnon, but of Schliemann’s true discovery—and a mystery so explosive that it leads to the kidnapping of Jack’s daughter and a confrontation with a new and evil foe.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Dell",
        "Price Starting With ($)": "11.13",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Running Microsoft  Office 2000 Premium",
        "Authors": "By Halvorson, Michael and Young, Michael J.",
        "Description": "A one-stop reference and user guide to Microsoft Office 2000 Premium Suite. The book with its copious screen shots, shows users each step they need to make to accomplish their objectives. It is loaded with tips from the software experts on how to get the most from the Microsoft Office 2000 Premium Suite.",
        "Category": " Computers , Enterprise Applications , General",
        "Publisher": "Microsoft Press",
        "Price Starting With ($)": "10.68",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Harriet Lane Handbook: A Manual for Pediatric House Officers",
        "Authors": "By Siberry, George K., M.D. (EDT) and Iannone, Robert (EDT)",
        "Description": "The HARRIET LANE HANDBOOK is the essential resource for health care professionals who work with children. Diagnostic guidelines, recommended tests, therapeutics, and dosage schedules are presented in a readily accessible, pocket-sized format. The New Edition includes new chapters on Psychiatry, Surgery, and Oncology, fully updated drug information with lactation and safety in pregnancy information, and full trade name and generic name drug index.* Presents diagnostic guidelines, recommended tests, therapeutics and drug dosage schedules for a true one-stop reference of clinical pediatric information. * Includes more than 300 illustrations, table and charts for easy reference of key information. * Presents the latest guidelines, practices and recommendations in a style appropriate for busy clinical practice. * Features a comprehensive formulary with the latest approved drugs.  NEW TO THIS EDITION: * Includes three new chapters on Psychiatry, Surgery and Oncology. * Features thoroughly updated chapters with the latest pediatric information. * Includes lactation and safety in pregnancy information with the revised formulary for one easy-to-access, pocket-size reference. * Provides a trade name and generic name drug index.",
        "Category": " Medical , Pediatrics",
        "Publisher": "Mosby",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Men and Gardens: A Delightful Tour through Gardens & Garden Writing of the Past (Horticulture Garden Classic)",
        "Authors": "By Fairbrother, Nan.",
        "Description": "",
        "Category": " Gardening , Landscape",
        "Publisher": "Lyons & Burford",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Tell Me Everything: How You Can Heal from the Secrets You Thought You'd Never Share",
        "Authors": "By Meberg, Marilyn",
        "Description": "Women of Faith speaker, Marilyn Meberg, offers bold and straightforward insight and biblical teaching for the secret issues of women.A food addiction. That mistake in college. The petty bad habit. A relative we’d rather forget . . .Secrets come in all shapes and sizes, but we all have them. And nine times out of ten, we wish we didn’t. Wrapped in layers—often years—of fear, secrets are not so easily discarded.In Tell Me Everything, Marilyn Meberg offers hope for anyone struggling to find freedom in a world that loves living in the dark. With a master’s degree in counseling psychology, she understands how we tie ourselves up in knots. As a Christian and Bible teacher, she knows how we can escape the lies that keep us bound. With wit and wisdom, Marilyn offers advice, examples, and encouragement that will engage the mind and help unburden the heart.What would it take for you to share your deepest secrets? To be completely honest?“Cast all your anxiety on him because he cares for you.”—1 Peter 5:7How good would it feel to just let it all out—no fear, no condemnation?“Therefore there is now no condemnation for those who are in Christ Jesus.”—Romans 8:1Is there anyone you can trust that much?“Do not let your hearts be troubled. Trust in God; trust also in me.”—John 14:1And what would happen if you did open up? \"Come to me, all you who are weary and burdened, and I will give you rest.”—Matthew 11:28",
        "Category": " Religion , Christian Life , Women's Issues",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Writing to Learn Mathematics: Strategies That Work, K-12",
        "Authors": "By Countryman, Joan",
        "Description": "Investigating interesting problems about the world makes mathematics compelling and engaging, but many students experience math as simply a set of rules and procedures to memorize and repeat on tests. Writing, however, frees students of the idea that mathematics is a collection of right answers owned by teachers.  In Writing to Learn Mathematics, Joan Countryman demonstrates how you can dramatically improve students' reasoning capabilities using:  journals learning logs letters autobiographies investigations formal papers.   The text provides descriptions of writing activities that classroom teachers can use to enhance the learning of math and includes examples of student writing, from short journal entries to excerpts from longer research papers. Most helpful are the topics suggested to explore at different levels of the primary and secondary mathematics curriculum, including descriptions of student responses to these presentations.  Readers of Writing to Learn Mathematics will discover how writing can help students develop concepts and thinking skills as well as free them to recognize what they know--and what they want to explore.",
        "Category": " Education , Teaching Methods & Materials , Mathematics",
        "Publisher": "HEINEMANN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Keys to Starting a Small Business (Barron's Business Keys)",
        "Authors": "By Siegel, Joel G. and Shim, Jae K.",
        "Description": "",
        "Category": " Business & Economics , Small Business",
        "Publisher": "Barron's Educational Series, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Men, Women & Children: A Novel",
        "Authors": "By Kultgen, Chad",
        "Description": "The author of The Average American Male and The Lie returns with a shocking, salacious, and surprisingly subtle new novel of the average American family. Like Neil Strauss and Nick Hornby, Chad Kultgen has the capacity to enthrall and astonish even the most ardent readers of contemporary literary fiction. In Men, Women, and Children, his incisive vision, unerring prose, and red-light-district imagination are at their most ambitious and surprising, as he explores the sexual pressures of junior high school students and their parents navigating the internet’s shared landscape of pornography, blogs, social networking, and its promise of opportunities, escapes, reinvented identities, and unexpected conflicts.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "How To Do Civil War Research",
        "Authors": "By Sauers, Richard A.",
        "Description": "The demand by the general public for new material on the American Civil War has increased greatly in recent years. Information is being sought on projects ranging from researching the wartime service of ancestors to more accurate details for re-enacting and wargaming, to those who want to try their hand at writing a Civil War book or article.For many, a great deal of time, effort and money is often wasted before locating the proper resources, and many never do find information which may actually be readily available. Dr. Richard A. Sauers has drawn upon his many years of Civil War research experience to produce this handy guide that will aid in almost any Civil War project.Using government records, locating and utilizing specialized libraries and collections, touring battlefield sites, contacting and drawing on Civil War interest organizations, and making the best use of published collections are all covered, with many useful tips. Dr. Sauers is also very up-to-date on electronic Civil War sources, from Internet websites to massive collections that are now available and often easier to use in electronic form.",
        "Category": " History , Reference",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Proud Little Peacock (Little Animal Adventures)",
        "Authors": "By Christina Wildson",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Young Families",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "United States Army at War: 9/11 Through Iraq",
        "Authors": "By Berry, F. Clifton, Jr., Steele, Dennis, and Association of the United States Army (COR)",
        "Description": "A tribute to the US Defense Department and the US Army's exploits from 9/11 to the first months of Operation Iraqi Freedom. Resplendent with photographs of noble young soldiers cradling gurgling infants or receiving awards for bravery, beaming Iraqis welcoming the American troops, and President George Bush making heartwarming speeches while clutching the American flag. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , Military , Wars & Conflicts (Other)",
        "Publisher": "Naval Institute Press",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Three Seasons of Summer: Gardening With Annuals and Biennials",
        "Authors": "By Clarke, Ethne, Heuff, Marijke (PHT), and Heuff, Marijke",
        "Description": "",
        "Category": " Gardening , Flowers , General",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Grandfather's Cake",
        "Authors": "By McPhail, David",
        "Description": "Peter, Andrew, and their pony, Peaches, are stopped by a fox, a bear, and a masked bandit who want to rob them of the chocolate cake that they are taking to Grandfather, and, in the end, even Peter and Andrew find the cake very tempting",
        "Category": "",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "French Cheeses: The Visual Guide to More Than 350 Cheeses from Every Region of France",
        "Authors": "By Robuchon, Joel, Yamada, Tomoko, Maruyama, Yohei (PHT), and Masui, Kazuko",
        "Description": "A thoroughly revised and updated guide to one of the world's favorite foods decribes the history of 350 of the finest French cheese varieties and lists their locations of origin, ingredients, complementary wines, age span, and storing and serving suggestions.",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "DK",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    }
]