[
    {
        "Title": "Anna Is Still Here",
        "Authors": "By Vos, Ida, Edelstein, Terese, and Smidt, Inez",
        "Description": "With the end of World War II, Anna, a young Dutch Jew who had been in hiding during the Nazi occupation, can safely emerge from concealment, but she experiences great difficulty in adjusting once again to a normal life",
        "Category": " Juvenile Fiction , Historical , Holocaust",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Words by Heart",
        "Authors": "By Sebestyen, Ouida",
        "Description": "",
        "Category": " Juvenile Fiction , Social Themes , Prejudice & Racism",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "How to Make and Fly Stunt Kites",
        "Authors": "By Jeremy Boyce",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The State Sticker Book",
        "Authors": "By Korman, Justine and Connelly, Gwen (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "McClanahan Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Why Mosquitoes Buzz in People's Ears: A West African Tale",
        "Authors": "By Aardema, Verna",
        "Description": "\"In this Caldecott Medal winner, Mosquito tells a story that causes a jungle disaster. \"Elegance has become the Dillons' hallmark. . . . Matching the art is Aardema's uniquely onomatopoeic text . . . An impressive showpiece.\"-Booklist, starred review.Winner of Caldecott Medal in 1976 and the Brooklyn Art Books for Children Award in 1977.",
        "Category": " Juvenile Fiction , People & Places , Africa",
        "Publisher": "Puffin/Dial",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Who Painted The Porcupine Purple?",
        "Authors": "By Lael Littke",
        "Description": "",
        "Category": "",
        "Publisher": "MODERN CURRICULUM PRESS",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "More Card Tricks (Twenty 4 Sevens)",
        "Authors": "By Gordon Hill",
        "Description": "",
        "Category": "",
        "Publisher": "Tangerine Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Atlas of Endangered Animals (Environmental Atlas Series)",
        "Authors": "By Pollock, Stephen Thomas",
        "Description": "Using maps, pictures, symbols, and a glossary of terms, this volume describes the destructive behavior of humans toward the animal kingdom and what humans are doing to help endangered species.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Checkmark Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Mammals (Nature Company Discoveries Libraries)",
        "Authors": "By McKay, George (EDT) and Creagh, Carson",
        "Description": "Introduces mammals in categories such as egg-laying and pouched, insect-eaters and bats, primates, meat-eaters, grazers and browsers, burrowers and chewers, and mammals of the sea.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Dinosaurs (Nature Company Discoveries Libraries)",
        "Authors": "By Creagh, Carson, Milner, Angela, and End, Simone",
        "Description": "Explains what fossils can tell us about dinosaurs, describes different species, and speculates on how dinosaurs raised their young, kept warm, ate their food, defended themselves, and why they became extinct",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Clue of the Hissing Serpent (Hardy Boys, Books 53)",
        "Authors": "By Dixon, Franklin W.",
        "Description": "Why is a wealthy sportsman so frightened by the serpent design on a mysterious balloon that he begs Frank and Joe Hardy to protect him? And who stole the ancient life-size chess king which is to be presented to the winner of the world chess championship? Targets of diabolical enemies, Frank and Joe find a clue that leads them across the Pacific to Hong Kong to help the police smash an international criminal organization.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "6.23",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Slim Chance (Red Dress Ink (Numbered Paperback))",
        "Authors": "By Rose, Jackie",
        "Description": "Obsessed with fitting into a size 8 Vera Wang wedding dress for her big day, newly engaged Evelyn Mays, an adorable brunette, soon becomes a willowly blonde--a transformation that leads to chaos when she makes new friends who encourage her to have \"one last fling.\" Original. 150,000 first printing.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Alphabet Weekends: Love on the Road from A to Z",
        "Authors": "By Noble, Elizabeth",
        "Description": "Natalie and Tom have been best friends forever, but Tom wants them to be much more. When Natalie's longtime boyfriend walks out on her just when she thinks he's going to propose, Tom offers her a different and wildly romantic proposition. He suggests that they spend twenty-six weekends together, indulging in twenty-six different activities from A to Z, and at the end of that time Tom's convinced they'll be madly in love. Natalie, however, is not so sure.As Natalie's touring the alphabet with Tom, her mother's going through her own romantic crisis—while Tom's unhappily married sister-in-law, Lucy, struggles with temptation. And over the course of six amazing months, three generations of passionate dreamers are going to discover that, no matter how clever they are, love—and life—is never as easy as A, B, C . . .",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "A Trust Betrayed (Margaret Kerr of Perth)",
        "Authors": "By Robb, Candace M.",
        "Description": "It is the spring of 1297, and Margaret Kerr's husband has been missing since winter--believed to have become caught up in the Scottish rebellion against the English--and Margaret sets out alone to find Roger and uncover the truth about his cousin's murder. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "One Hundred and One Ways: A Novel",
        "Authors": "By Yoshikawa, Mako",
        "Description": "\"I have spent most of my life in New Jersey, but the blood of a geisha courses through me yet.\"If Kiki Takehashi's life is dramatically different from that of her reserved Japanese-American mother, it is light-years away from that of her grandmother, whom she knows only through old family stories. Kiki has recently become engaged to Eric, a handsome, successful New York City lawyer. But at the same time she is haunted--quite literally--by the memory of her friend Phillip, killed the previous year in a mountaineering accident.Kiki has never met her grandmother Yukiko, for whom she is named. Still, thoroughly American though she is, she feels a secret kinship with her. Kiki is swept up by the story of this strong, proud, passionate woman who, against all odds, in a time and place far different from her own, was sold by her impoverished family, became a famous geisha, and found the love that has so far eluded the rest of the Takehashi women.Lyrical, haunting, and stunningly evocative, One Hundred and One Ways introduces a powerful and exciting new voice in contemporary fiction.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Krakatoa: The Day the World Exploded: August 27, 1883",
        "Authors": "By Winchester, Simon",
        "Description": "Simon Winchester, New York Times bestselling author of The Professor and the Madman, examines the legendary annihilation in 1883 of the volcano-island of Krakatoa, which was followed by an immense tsunami that killed nearly forty thousand people. The effects of the immense waves were felt as far away as France. Barometers in Bogotá and Washington, D.C., went haywire. Bodies were washed up in Zanzibar. The sound of the island&#39;s destruction was heard in Australia and India and on islands thousands of miles away. Most significant of all -- in view of today&#39;s new political climate -- the eruption helped to trigger in Java a wave of murderous anti-Western militancy among fundamentalist Muslims, one of the first outbreaks of Islamic-inspired killings anywhere. Krakatoa gives us an entirely new perspective on this fascinating and iconic event.This P.S. edition features an extra 16 pages of insights into the book, including author interviews, recommended reading, and more.",
        "Category": " Science , Earth Sciences , Geology",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Officers and Gentlemen",
        "Authors": "By Waugh, Evelyn",
        "Description": "This is the second volume in the 'Sword of Honor' trilogy. The other volumes in this trilogy include: 'Men at Arms' and 'The End of the Battle'.",
        "Category": " Fiction , Classics",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Memoirs of an Ex-Prom Queen",
        "Authors": "By Shulman, Alix Kates",
        "Description": "Twenty-five years after its initial publication, this landmark book continues to fascinate readers with a frank, sardonic look at one woman's intellectual and sexual awakening. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Women, Art, and Society (World of Art)",
        "Authors": "By Chadwick, Whitney",
        "Description": "Describes the conditions women artists worked under from the Middle Ages to the present, and discusses women's relationship to, and involvement in, art",
        "Category": "",
        "Publisher": "Thames and Hudson",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Building a Better Vocabulary",
        "Authors": "By Shaw, Harry",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Inner Skiing",
        "Authors": "By Gallwey, W. Timothy and Kriegel, Robert",
        "Description": "Inner-game techniques are applied to the skills and strategies of skiing, showing novice and intermediate skiers how to overcome the obstacles of fear, self-consciousness, self-criticism, self-doubt, and poor concentration",
        "Category": " Sports & Recreation , Skiing",
        "Publisher": "Random House Inc (T)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Burn Journals",
        "Authors": "By Runyon, Brent",
        "Description": "Fans of Thirteen Reasons Why, Running with Scissors and  Girl, Interrupted will be entranced by this remarkable true story of teenage despair and recoveryIn 1991, fourteen-year-old Brent Runyon came home from school, doused his  bathrobe in gasoline, put it on, and lit a match.He suffered third-degree burns  over 85% of his body and spent the next year recovering in hospitals and rehab facilities.  During that year of physical recovery, Runyon began to question what he'd done, undertaking  the complicated journey from near-death back to high school, and from suicide back  to the emotional mainstream of life.",
        "Category": " Psychology , Suicide",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "U.S. History I (Cliffs Quick Review)",
        "Authors": "By Soifer, Paul and Hoffman, Abraham",
        "Description": "CliffsQuickReview course guides cover the essentials of your toughest classes. Get a firm grip on core concepts and key material, and test your newfound knowledge with review questions.CliffsQuickReview U.S. History I provides you with an overview of United States history from before the colonial period through the end of Reconstruction. You can use this in-depth reference as a supplement to your textbook and classroom lectures, or you can use it as an at-a-glance reference. As you work your way through this review, you'll be ready to tackle such concepts asExploring the \"New World\": Knowing the first inhabitants of the Western HemisphereExploration and early colonization: From Christopher Columbus's voyage to the early English settlementsColonial settlements of the 17th and 18th centuries: From Plymouth to the 13 original coloniesThe American Revolution: From early discontent to the War for Independence and the drafting of the U.S. ConstitutionThe development of a new nation: The early presidents, the institution of slavery, and the Civil WarThe Reconstruction: The freedom for slaves and the presidency of Ulysses S. GrantWith titles available for all the most popular high school and college courses, CliffsQuickReview guides are a comprehensive resource that can help you get the best possible grades.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "CliffsNotes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Italian At a Glance (At a Glance Series)",
        "Authors": "By Wald, Heywood, Costantino, Mario, and Pidoto-Reizis, Giovanna M.",
        "Description": "Designed primarily for international business and vacation travelers, this language phrasebook presents more than 1,500 words and expressions in both English and Italian. Phrases are the kind to help travelers make themselves understood in hotels, airports, train stations, restaurants, shops, and other places they are likely to visit as tourists or international business travelers. All of the newly revised  At a Glance  phrasebooks have useful city maps, updated information on train systems and timetables, availability of ATMs and faxes in major foreign cities and towns, and of course, countless helpful words and phrases in both languages.",
        "Category": " Foreign Language Study , Italian",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "CliffsQuickReview Biology",
        "Authors": "By Alcamo, I. Edward and Schweitzer, Kelly",
        "Description": "CliffsQuickReview course guides cover the essentials of your toughest subjects. Get a firm grip on core concepts and key material, and test your newfound knowledge with review questions.Whether you're new to elements, atoms, and molecules or just brushing up on your knowledge of the subject,CliffsQuickReview Biology can help. This guide carries biological studies into topics such as organic compounds, cellular respiration, transgenic animals, and human reproduction. You'll also tackle other concepts, includingThe process of photosynthesisMitosis and cell reproductionInheritance patternsPrinciples of evolutionThe unity and diversity of lifeCliffsQuickReview Biology acts as a supplement to your other learning materials. Use this reference in any way that fits your personal style for study and review — you decide what works best with your needs. You can flip through the book until you find what you're looking for — it's organized to gradually build on key concepts. Here are just a few other ways you can search for topics:Use the free Pocket Guide full of essential information.Get a glimpse of what you’ll gain from a chapter by reading through the Chapter Check-In at the beginning of each chapter.Use the Chapter Checkout at the end of each chapter to gauge your grasp of the important information you need to know.Test your knowledge more completely in the CQR Review and look for additional sources of information in the CQR Resource Center.Use the glossary to find key terms fast.With titles available for all the most popular high school and college courses, CliffsQuickReview guides are comprehensive resources that can help you get the best possible grades.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Why God Won't Go Away: Brain Science and the Biology of Belief",
        "Authors": "By Rause, Vince, Newberg, Andrew, M.D., and D'Aquili, Eugene G.",
        "Description": "Why have we humans always longed to connect with something larger than ourselves? Even today in our technologically advanced age, more than seventy percent of Americans claim to believe in God. Why, in short, won’t God go away? In this groundbreaking new book, researchers Andrew Newberg and Eugene d’Aquili offer an explanation that is at once profoundly simple and scientifically precise: The religious impulse is rooted in the biology of the brain.In Why God Won’t Go Away, Newberg and d’Aquili document their pioneering explorations in the field of neurotheology, an emerging discipline dedicated to understanding the complex relationship between spirituality and the brain. Blending cutting-edge science with illuminating insights into the nature of consciousness and spirituality, they bridge faith and reason, mysticism and empirical data. The neurological basis of how the brain identifies the “real” is nothing short of miraculous. This fascinating, eye-opening book dares to explore both the miracle and the biology of our enduring relationship with God.",
        "Category": " Science , Philosophy & Social Aspects",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Rasputin File",
        "Authors": "By Radzinsky, Edvard",
        "Description": "Based on documents long missing from KGB files, this fascinating account of Rasputin, a man who weilded unprecidented power over the last Czar of Russia, attempts to understand this enigmatic and charismatic figure.",
        "Category": " History , Russia & the Former Soviet Union",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Longman Reader, 7th Edition",
        "Authors": "By Nadell, Judith, Langan, John, and Comodromos, Eliza A.",
        "Description": "",
        "Category": " Language Arts & Disciplines , Rhetoric",
        "Publisher": "Longman",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "CliffsQuickReview Algebra I (Bk. 1)",
        "Authors": "By Bobrow, Jerry",
        "Description": "CliffsQuickReview course guides cover the essentials of your toughest classes. Get a firm grip on core concepts and key material, and test your newfound knowledge with review questions.Whether you're brushing up on pre-Algebra concepts or on your way toward mastering algebraic fractions, factoring, and functions, CliffsQuickReview Algebra I can help. This guide introduces each topic, defines key terms, and carefully walks you through each sample problem step-by-step. In no time, you'll be ready to tackle other concepts in this book such asEquations, ratios, and proportionsInequalities, graphing, and absolute valueCoordinate GeometryRoots and radicalsQuadratic equationsCliffsQuickReview Algebra I acts as a supplement to your textbook and to classroom lectures. Use this reference in any way that fits your personal style for study and review — you decide what works best with your needs. Here are just a few ways you can search for topics:Use the free Pocket Guide full of essential informationGet a glimpse of what you'll gain from a chapter by reading through the Chapter Check-In at the beginning of each chapterUse the Chapter Checkout at the end of each chapter to gauge your grasp of the important information you need to knowTest your knowledge more completely in the CQR Review and look for additional sources of information in the CQR Resource CenterUse the glossary to find key terms fast.With titles available for all the most popular high school and college courses, CliffsQuickReview guides are a comprehensive resource that can help you get the best possible grades.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliff Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Jacob's Ladder: A Story of Virginia During the War",
        "Authors": "By McCaig, Donald",
        "Description": "Duncan Gatewood and mulatto slave Maggie share a forbidden love, until she is sold south and Duncan is sent away to the Virginia Military Institute, but they are destined to meet again under the dark influence of the Civil War. Reprint.",
        "Category": " Fiction , Historical",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Letting Go of Shame: Understanding How Shame Affects Your Life",
        "Authors": "By Potter-Efron, Ronald T. and Potter-Efron, Patricia",
        "Description": "Exposes the source and nature of shame, and helps people heal themselves  by looking beyond the self-hatred to locate the self",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Paradise of Cities: Venice In the 19th Century",
        "Authors": "By Norwich, John Julius",
        "Description": "John Julius Norwich, the author of A History of Venice, traces the transformation of Venice from a proud independent state into a dazzling dreamscape that attracted artists, writers, and composers from around the world. In a strikingly effective departure from straight narrative history, he tells the story of Venice through the experiences and reactions of such famous nineteenth-century visitors as Napoleon Bonaparte, Lord Byron, John Ruskin, Henry James, Richard Wagner, James Whistler, and Robert Browning.Paradise of Cities is at once a history and a travel guide. Filled with vintage photographs and full-color reproductions of period paintings, it conveys both the misfortune of Venice's decline and the magnificence of its eternal beauty.",
        "Category": " History , Europe , Italy",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Invisible Made Visible: Angels from the Vatican",
        "Authors": "By Duston, Allen (EDT), Nesselrath, Arnold (EDT), and Sweeney, Jane (EDT)",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Art Services Intl",
        "Price Starting With ($)": "7.77",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Atlantis: Insights from a Lost Civilization",
        "Authors": "By Andrews, Shirley",
        "Description": "The legend of lost Atlantis turns to fact as Shirley Andrews synthesizes a wealth of information from more than one hundred classical and Atlantean scholars, scientists, and psychics to describe the country and its inhabitants. Review the scientific and geological evidence for an Atlantic continent, which refutes the popular notion that Atlantis was located in the Mediterranean. Follow the history of Atlantis from its beginnings to its destruction, and see a portrait of Atlantean society: its religion, architecture, art, medicine, and life style. Explore shamanism, the power of crystals, ancient techniques for health and healing, pyramid energy, ley lines, the influence of extraterrestrials and the origin of the occult sciences. Learn what happened to the survivors of Atlantis, where they migrated, and how the survivors and their descendants made their mark on cultures the world over.",
        "Category": " Body, Mind & Spirit , Ancient Mysteries & Controversial Knowledge",
        "Publisher": "Llewellyn Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Leonardo",
        "Authors": "By",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Taschen America Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Human Story Our History, From the Stone Age to Today",
        "Authors": "By Davis, James C.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper Collins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "English Passengers: A Novel",
        "Authors": "By Kneale, Matthew",
        "Description": "In 1857 when Captain Illiam Quillian Kewley and his band of rum smugglers from the Isle of Man have most of their contraband confiscated by British Customs, they are forced to put their ship up for charter. The only takers are two eccentric Englishmen who want to embark for the other side of the globe. The Reverend Geoffrey Wilson believes the Garden of Eden was on the island of Tasmania. His traveling partner, Dr. Thomas Potter, unbeknownst to Wilson, is developing a sinister thesis about the races of men. Meanwhile, an aboriginal in Tasmania named Peevay recounts his people’s struggles against the invading British, a story that begins in 1824, moves into the present with approach of the English passengers in 1857, and extends into the future in 1870.  These characters and many others come together in a storm of voices that vividly bring a past age to life.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Accounting for Governmental and Nonprofit Entities with City of Smithville Package",
        "Authors": "By Wilson, Earl R.",
        "Description": "This 12th edition has been streamlined to contain complete, accurate, and up-to-date coverage of all facets of accounting for governmental and nonprofit organizations.  Intended for readers concerned with the design and interpretation of financial statements and financial reports, this text reflects all major changes to authoritative pronouncements affecting Government and Nonprofit organizations through March 2000 .",
        "Category": " Business & Economics , Accounting , Governmental",
        "Publisher": "McGraw-Hill/Irwin",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Dark Angels: A Novel (Tamworth Saga)",
        "Authors": "By Koen, Karleen",
        "Description": "The long-awaited prequel to Koen’s beloved Through a Glass Darkly,   Dark Angels is a feast of a novel that sparkles with all the passion, extravagance,   danger, and scandal of seventeenth-century England. Alice Verney is a young woman intent on achieving her dreams. Returning to   England after a messy scandal forced her to flee to Louis XIV’s France, Alice is anxious to   re-establish herself by regaining her former position as a maid   of honor to Charles II’s queen and marrying the most celebrated duke of the   Restoration.  But all is not as it seems in the rowdy, merry court of Charles II. Since the Restoration,   old political alliances have frayed, and there are whispers that the king is moving   to divorce his barren queen, who some wouldn’t mind seeing dead. Alice, loyal   only to a select few, is devoted to the queen, and so sets out to discover who might   be making sinister plans—and if her own father is one of them. When a member of   the royal family dies unexpectedly, the stakes are raised.   As Alice steps up her efforts to find out who is—and isn’t—true to the queen, she learns   of shocking betrayals throughout court, and meets a man who she may fall in   love with—and who could spoil all of her plans. With the suspected arrival of a known   poison-maker, the atmosphere in the court electrifies, and suddenly the safety of   the king himself seems uncertain. Secret plots are at play, and war is on the horizon—but   will it be with the Dutch or the French? And has King Charles himself betrayed his   country for greed?  Unforgettable in its dramatic   force, here is a novel of love and  politics, of romance and betrayal, of power and   succession—and of a  resourceful young woman who risks everything for pride and status   in  an era in which women were afforded little of either.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Home on the Range",
        "Authors": "By Dickenson, James R.",
        "Description": "Home on the Range chronicles the epic drama of the settling and development of the High plains - a lyrical, nostalgic look at our rural past and its endangered future.The High Plains of the United States, where the buffalo once roamed, are being abandoned by many who once lived there, and, as a result, a culture and a way of life are being lost. Silhouetted against the violent dust storms and blizzards that often boil across the vast horizon, grain elevators, water towers, church steeples, and stark, tiny towns look as though they could be swallowed up without a trace. But, James R. Dickenson points out, the poignant irony is that these farms and towns are disappearing not through the ferocity of Mother Nature but due to the progression of technology and changes in life-styles. The railroad, the six-shooter, and barbed wire made the settlement and growth of this region possible, but technological advancements such as irrigation and computerized equipment are having a different effect.Home on the Range examines the past hundred years of life on the High Plains through the prism of the author's own hometown. The history of McDonald, Kansas (population now 200), is the story of hundreds of other Western towns. It's a moving and exciting portrait - including shootouts over land rights, lynchings, the chicanery of land agents, the adventures of bootleggers (Kansas was a dry state until 1948) - but also one of faith and community, with life revolving around the local school and church and the cycle of the harvest.The High Plains residents of today, Dickenson reminds us, are in the same position as their great-grandparents - on the verge of a great change. The question is whether the people of this area, who are on a social and economic rather than a physical frontier, can meet the challenge and create a viable society as their forbears did a century ago when they pioneered the vast untracked area once known as the Great American Desert.",
        "Category": " History , United States , State & Local , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Capturing the Landscape with Your Camera",
        "Authors": "By Caulfield, Patricia",
        "Description": "Discusses cameras and lenses, gives advice on composition, and tells how to photograph plants and flowers, and work under adverse weather conditions",
        "Category": " Photography , Subjects & Themes , Plants & Animals",
        "Publisher": "Amphoto Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Jacob's Ladder:",
        "Authors": "By McCaig, Donald",
        "Description": "A novel that resonates with the bitter glory and deep human shame of the Confederacy. Against the epic canvas of the Civil War, the people, black and white, of one Virginia plantation fulfill their unforgettable destinies. Duncan Gatewood, seventeen and heir to Gatewood Plantation, falls in love with Maggie, a mulatto slave, who conceives a son, Jacob. Maggie and Jacob are sold south, and Duncan is packed off by his irate father to the Virginia Military Institute. As a cadet, Duncan guards the gallows of John Brown; as a man he will fight for Robert E. Lee. Another Gatewood slave, Jesse--whose love for Maggie is unrequited--escapes to find her and is sheltered by a young white couple who are sentenced to prison for this crime. Jesse finds his freedom and enlists in Mr. Lincoln's army; in time he will confront his former masters. From the interlocked lives of masters and slaves, and from a wealth of carefully researched yet unobtrusive historical detail, Donald McCaig conjures a passionate and richly textured story in the heart of America's greatest war. The loves, letters, and struggles of the characters connect a Vicksburg brothel to a Richmond salon, the riches of a sleek blockade runner with scenes of dire poverty, and the nightmare of a confederate hospital to the lurid hell of the battlefields at Fredericksburg and Chancellorsville. The Civil War is the wellspring of much of our most notable literature, and from this rich, poignant material McCaig has fashioned an unusual and powerful tale, a Confederate masterpiece.",
        "Category": " Fiction , War & Military",
        "Publisher": "W. W. Norton & Company, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Rape of Midian: The Saga of Zipporah and Moses",
        "Authors": "By Hargrave, Thomas B.",
        "Description": "",
        "Category": " Fiction , Religious",
        "Publisher": "1st Book Library",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Crossroad (Amish Country Crossroads #2)",
        "Authors": "By Lewis, Beverly",
        "Description": "After writing a story in Amish country, New York journalist Philip Bradley returns to Lancaster County haunted by the memory of a soft-spoken widow he met there, but winning her heart is just the first step in long journey that will require him surrendering his own culture. Simultaneous.",
        "Category": " Fiction , Religious",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Stories of Bernard Malamud",
        "Authors": "By Malamud, Bernard",
        "Description": "",
        "Category": "",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Shooting Stars: Favorite Photos Taken by Classic Celebrities",
        "Authors": "By Zeitlin, David I. (EDT) and Zeitlin, Harriet (EDT)",
        "Description": "A glimpse at a by-gone era as seen through the eyes of some of its most famous people whom we regard today as classic icons. Celebrity shutterbugs such as Edgar Bergen, Harry Truman, Grace Kelly, Gypsy Rose Lee and many others lend insight into their legendary personalities by redirecting the camera at the world. The words accompanying the b&w photographs give insight into the diversity of these unique individuals. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Performing Arts , General",
        "Publisher": "General Pub Group",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Cathedral: The Story of Its Construction (Sandpiper)",
        "Authors": "By MacAulay, David",
        "Description": "Readers worldwide recognize Caldecott Medal winner David Macaulay's imaginary Cathedral of Chutreaux. This critically acclaimed book has been translated into a dozen languages and remains a classic of children's literature and a touchstone for budding architects. Cathedral's numerous awards include a prestigious Caldecott Honor and designation as a New York Times Best Illustrated Book of the Year for Macaulay's intricate pen-and-ink illustrations. Journey back to centuries long ago and visit the fictional people of twelfth-, thirteenth-, and fourteenth-century Europe whose dreams, like Cathedral, stand the test of time. This title has been selected as a Common Core text exemplar (Grades 6–8, Informational Texts: Science, Mathematics, and Technical Studies).",
        "Category": " Juvenile Nonfiction , Technology , How Things Work-Are Made",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "The Ultimatum (Steadfast Series #2)",
        "Authors": "By Moser, Nancy",
        "Description": "Annie and Cal McFay live a normal life with their eight-year-old daughter Avi in Steadfast, Kansas. Until another man comes into Annie's life - Jesus Christ. She tries to explain to Cal and Avi the difference Jesus has made in everything, but Cal isn't willing to \"give in\" to God and change his way of life. He gives Annie the ultimatum: Choose Jesus or me. Then the family is taken hostage by thieves. Negotiations get desperate. Annie can't let Cal risk his life for them, not when his salvation is uncertain. The situation comes to a climax, and the whole town of Steadfast is left to make sense of the ultimate sacrifice...Steadfast, Kansas, Population: 3,386 Annie McFay is a waitress with a calling far beyond burgers and fries. jered Manson is a runaway whose dad doesn't support his musical ambition.New Ways clash with the old. Annie's newfound faith should make her happy, but her husband sees it as a threat to their marriage. Jered is trying out a new friendship - a dangerous one. And his actions may jeopardize lives besides his own.When Annie and Jered come face-to-face in one desperate moment, their spiritual choices become harsh reality. Threatened with disaster, the entire town of Steadfast must band together to save them. Will the power of prayer be enough?",
        "Category": " Fiction , Religious",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Shoe Queen",
        "Authors": "By Davis, Anna",
        "Description": "Impulsively marrying a wealthy and conservative American businessman in order to escape her repressive family, English aristocrat Genevieve flagrantly spends her husband's money on designer clothes and shoes, enjoys the 1920s Parisian nightlife at the side of a new friend, and hides a painful secret. Original. 25,000 first printing.",
        "Category": " Fiction , Historical",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Memory of Running",
        "Authors": "By McLarty, Ron",
        "Description": "Every decade seems to produce a novel that captures the public’s imagination with a story that sweeps readers up and takes them on a thrilling, unforgettable ride. Ron McLarty’s The Memory of Running is this decade’s novel. By all accounts, especially his own, Smithson \"Smithy\" Ide is a loser. An overweight, friendless, chain-smoking, forty-three-year-old drunk, Smithy’s life becomes completely unhinged when he loses his parents and long-lost sister within the span of one week. Rolling down the driveway of his parents’ house in Rhode Island on his old Raleigh bicycle to escape his grief, the emotionally bereft Smithy embarks on an epic, hilarious, luminous, and extraordinary journey of discovery and redemption.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Bill Bryson's African Diary",
        "Authors": "By Bryson, Bill",
        "Description": "“Here is a man who suffers so his readers can laugh.” — Daily TelegraphBill Bryson travels to Kenya in support of CARE International. All royalties and profits go to CARE International.Bryson visits Kenya at the invitation of CARE International, the charity dedicated to eradicating poverty. Kenya is a land of contrasts, with famous game reserves and a vibrant culture. It also provides plenty to worry a traveller like Bill Bryson, fixated as he is on the dangers posed by snakes, insects and large predators. It is also a country with many serious problems: refugees, AIDS, drought, and grinding poverty. The resultant diary, though short in length, contains the trademark Bryson stamp of wry observation and curious insight.",
        "Category": " Travel , Africa , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Norman Rockwell's America",
        "Authors": "By Rockwell, Norman",
        "Description": "",
        "Category": "",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Amelia Takes Command",
        "Authors": "By Moss, Marissa",
        "Description": "After successfully commanding the Discovery shuttle mission at Space Camp, Amelia returns to fifth grade where she deals with the bully who has been making her life miserable",
        "Category": " Juvenile Fiction , Social Themes , Physical & Emotional Abuse",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Amelia's Best Year Ever: Favorite Amelia Stories from American Girl Magazine",
        "Authors": "By Moss, Marissa",
        "Description": "Follows Amelia through an entire year as she records and illustrates in her notebook her year-round adventures with family and friends. Simultaneous. 44,000 first printing.",
        "Category": " Juvenile Fiction , Social Issues , General",
        "Publisher": "Amer Girl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Professional Photographer's Guide to Shooting & Selling Nature & Wildlife Photos",
        "Authors": "By Zuckerman, Jim",
        "Description": "Practical and informed technical, creative, and marketing advice from a pro, illustrated with some 250 of his photos. Nicely designed and produced. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Photography , Techniques , General",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "John Burningham's France",
        "Authors": "By Burningham, John",
        "Description": "Drawings offer a humorous look at life in France, including restaurants, city life, the Tour de France, holidays, romance, concierges, and leisure activities",
        "Category": " Art , Individual Artists , General",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The New Humanists: Science at the Edge",
        "Authors": "By Brockman, John",
        "Description": "When John Brockman’s essay, “The New Humanists” appeared on his popular cutting-edge science website, EDGE (www.edge.org), he received a record number of responses from the intellectuals of the EDGE community.  In his essay, Brockman noted that the American intellectual had become proudly or defiantly ignorant of major scientific accomplishments.  According to Brockman, intellectual thought was becoming trapped in a “swelling spiral of commentary,” and often ignored the real world.  Citing C.P. Snow’s theory of two cultures: the literary intellectual and the scientist, Brockman predicted an “emerging third culture” where scientists and other empirical thinkers, through their work and writing, would redefine who and what we are.In The New Humanists: Science At the Edge, Brockman has assembled some of the top scientists of today: Jared Diamond, Steven Pinker, Daniel Dennett, Marvin Minsky, Lee Smolin, and others, and has them discuss the unique contributions each of them is making to the development of modern thought.  Some of these thinkers are in sync, others in dissent, but what emerges in The New Humanists is a dialogue that serves as a support to Brockman’s theory and an introduction to some of the best scientific minds of the 21st century.",
        "Category": " Science , Philosophy & Social Aspects",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Daytrading Like a Pro",
        "Authors": "By Sander, Jennifer Basye, Sander, Peter J., and Sander Basye, Jennifer",
        "Description": "You're no idiot, of course. You can surf the Web with the best of them, and check the stock market online.  You even did all your holiday shopping via the Internet.  But when it comes to trading stocks and bonds, and especially making day trades, you leave it to your broker to call the shots. Don't make another phone trade!  The Complete Idiot's guide to Day Trading Like a Pro shows you the secrets of going head-to-head with actual traders and brokers.  You'll learn where the best trades are made, how to gain direct access to markets, and how to use the strategies of the top market makers.  In this Complete Idiot's Guide, you get:",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Baby Loves",
        "Authors": "By Metropolitan Museum of Art (New York, N. Y.), Cassatt, Mary (ILT), and Lach, William",
        "Description": "baby cuddles baby hugs baby kisses bagby loves  Here is the perfect book to read and play with baby. In sixteen paintings, prints, and pastels by American Impressionist Mary Cassatt, baby feeds ducks, claps hands, drinks milk, stands up, and kisses mommy goodnight, alonside an irresistible rhyme that baby will love hearing and acting out over and over again.",
        "Category": " Juvenile Fiction , Family , New Baby",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Everything Psychology Book: Explore the Human Psyche and Understand Why We Do the Things We Do",
        "Authors": "By Bolton, Lesley and Warwick, Lynda L., Ph.D.",
        "Description": "In years past, psychology had been criticized as the stuff of \"head-shrinkers\" and \"quacks.\" Now the study of human behavior is universally accepted as a means for better understanding one's self and achieving inner peace and happiness.The Everything Psychology Book is an easy-to-follow guide to the experiments, theories, and principles that have shaped modern psychology and given us insights into human behavior.From learning and personality development to dreams and the unconscious, this straightforward primer explains how the brain works and how our enviroment affects thinking and behavior.In addition to the sceintific information, readers learn how to apply what we know about psychology to improve everyday lives.",
        "Category": " Psychology , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "A Shortened History of England",
        "Authors": "By Trevelyan, George MacAulay",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Captured by Grace: No One Is Beyond the Reach of a Loving God",
        "Authors": "By Jeremiah, David",
        "Description": "Grace—it’s a stained-glass, impersonal word until it happens to you . . .Until you have been broken beyond belief and need a miracle for your soul. Until you have betrayed a loved one and cannot bring him back. Until you have befriended every darkness and are desperate for the light.That’s when God’s relentless, amazing, very personalized grace finds you. It reached a slave trader onboard a ship raiding Africa’s coast in March 1748. He later gave the world its most beloved hymn.It struck the Christian church’s most treacherous enemy on a Damascus road in AD 45, and he became the gospel’s greatest messenger.And it can free you too . . . of any shameful memory, open wound, unthinking mistake, or willful choice.Encountering God’s grace changes lives forever. Let Dr. David Jeremiah show you how the transforming mercy that captured songwriter John Newton and the apostle Paul can awaken within you a fresh experience of the God who loves you fearlessly and pursues you with abandon.“Captured by Grace could just be the fresh experience of the love of God you’ve been waiting for.”John C. Maxwell, Best-Selling Author“You’ll never hear ‘Amazing Grace’ in the same way again.”John Tesh, Entertainer and TV Personality“One of the most interesting and compelling books I have ever read.”Tim LaHaye, Best-Selling Author",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Integrity Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Enlightened Stepmother: Revolutionizing the Role",
        "Authors": "By Norwood, Perdita Kirkness and Wingender, Teri",
        "Description": "Becoming a stepmother is a life-altering event in any woman's life. The issues are extraordinarily complex and women are overwhelmingly unprepared. Yet concerns usually focus on the effect remarriage has on the children. The Enlightened Stepmother approaches the subject from a totally new perspective -- that of the stepmother. Based on information --  sometimes controversial -- from stepmoms of all ages, occupations and lifestyles, who know from experience what works, what doesn't and why -- What you need to know about your new family before you become part of it.How to get off to the right start. (It's hard to change a relationship once you've taken the path of least resistance.)How to prevent, rather than cure, the stepmom's classic pitfalls.What you need to recognize about your relationship with your husband's children.How to handle relationships between your kids and his.Why you need to give your marriage top priority.How to make sure others are aware that this is your life too.Why you need to develop a working relationship with your stepchildren's mother.How to understand the inevitable stages every stepfamily passes through.How to overcome the guilt of not loving -- or even liking -- your stepchildren.How to avoid feeling guilty in circumstances over which you have no control.Why a successful stepfamily is as unique as every stepmom.AND MUCH MORE",
        "Category": " Family & Relationships , Parenting , Stepparenting",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Maisy Drives the Bus",
        "Authors": "By Cousins, Lucy and Cousins, Lucy (ILT)",
        "Description": "In this brand-new adventure familiar to children who watch Maisy on Nick Jr., Maisy and her friends act out the lively adventures young children have—or dream of having—every day. In MAISY DRIVES THE BUS, Maisy visits each bus stop to pick up passengers. Who's waiting at the stops? Preschool fans will be thrilled to climb aboard for the ride and find out. Here's another very good reason to be crazy for Maisy!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Insatiable: The Compelling Story of Four Teens, Food and Its Power",
        "Authors": "By Eliot, Eve",
        "Description": "Insatiable is an astonishingly moving story of four teenage girls whose shame, fear and confusion compel them to binge, purge and refuse to eat in misguided attempts to feel safe and in control of their lives. This incredible, imaginative story, written in episodic format, is based on real case histories and tells a true-to-life story through character-driven vignettes. Insatiable will envelop readers in the personal and seemingly tangible worlds of each of the main characters. What makes this novel so forceful and vibrant is the way Eliot weaves her story through dynamics that inform these friendships and the therapy that helps them address their pain and fears. For every teen trapped in this seemingly endless cycle, and those who simply enjoy reading about real life issues (i.e. teen bestsellers Speak and Smack), Insatiable is a must-read.",
        "Category": " Young Adult Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "HCI Teens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Spiral Staircase: My Climb Out of Darkness",
        "Authors": "By Armstrong, Karen",
        "Description": "Gripping, revelatory, and inspirational, The Spiral Staircase is an extraordinary account of an astonishing spiritual journey. In 1962, at age seventeen, Karen Armstrong entered a convent, eager to meet God. After seven brutally unhappy years as a nun, she left her order to pursue English literature at Oxford. But convent life had profoundly altered her, and coping with the outside world and her expiring faith proved to be excruciating. Her deep solitude and a terrifying illness–diagnosed only years later as epilepsy—marked her forever as an outsider. In her own mind she was a complete failure: as a nun, as an academic, and as a normal woman capable of intimacy. Her future seemed very much in question until she stumbled into comparative theology. What she found, in learning, thinking, and writing about other religions, was the ecstasy and transcendence she had never felt as a nun.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The End of Days: Fundamentalism and the Struggle for the Temple Mount",
        "Authors": "By Gorenberg, Gershom",
        "Description": "In this provocative work, seasoned journalist Gershom Gorenberg portrays a deadly mix of religious extremism, violence, and Mideast politics, as expressed in the struggle for the sacred center of Jerusalem. Known to Jews and Christians as the Temple Mount and to Muslims as the Noble Sanctuary, this thirty-five-acre enclosure at the southeast corner of Jerusalem's Old City is the most contested piece of real estate on earth. Here nationalism combines with fundamentalist faith in a volatile brew. Members of the world's three major monotheistic faiths--Judaism, Christianity, and Islam--hold this spot to be the key to salvation as they await the end of the world, and struggle to fulfill conflicting religious prophecies with dangerous political consequences. Adroitly portraying American radio evangelists of the End, radical Palestinian sheikhs, and Israeli ex-terrorists, Gorenberg explains why believers hope for the End, and why prominent American fundamentalists provide hard-line support for Israel while looking forward to the apocalypse. He makes sense of the messianic fervor that has driven some Israeli settlers to oppose peace. And he describes the Islamic apocalyptic visions that cast Israel's actions in Jerusalem as diabolic plots.The End of Days shows how conflict over Jerusalem and the fiery belief in apocalypse continue to have a potent impact on world politics and why a lasting peace in the Middle East continues to prove elusive.",
        "Category": " Religion , Theology",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Shapes Around Town (Chuck & Friends, Tonka Town)",
        "Authors": "By Hasbro",
        "Description": "",
        "Category": "",
        "Publisher": "Brendon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "STATIONS: An Imagined Journey",
        "Authors": "By Flanagan, Michael",
        "Description": "In Stations, Michael Flanagan's images and texts weave together a fictional archaeology of time and place, where the past asserts itself as an unfathomable mystery at the heart of everyday life. An album of lost photographs serves as our guide to the stops along two antiquated railroad lines winding through Virginia's Shenandoah Valley. In this ancient American landscape, marked by Civil War battles and earlier settlements, we follow album and railroad on a journey from past to present, as Lucius Caton pieces together his sister Anna's love affair with their cousin, the photographer Russell McKay, out of the fragmentary clues she embeds in the album. Anna is an artist, eccentric, elusive and beguiling, whose life remains a dark puzzle to Lucius. As the story of her romance with Russell unfolds, we catch a glimpse of Lucius's complicated feelings for his sister. Most compellingly, Stations is about the journey we each take along the tracks of memory where time and place intersect - the lost world of home.",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "African Art: An Introduction",
        "Authors": "By Willett",
        "Description": "Based on recent archaeological findings as well as contemporary examples, the author examines the origins, evolution, forms, and role of art in Africa",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Thames and Hudson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Zippity Zinger #4: The Zippity Zinger The Mostly True Confessions of the World's Best Underachiever (Hank Zipzer)",
        "Authors": "By Winkler, Henry, Oliver, Lin, and Heyer, Carol (ILT)",
        "Description": "Inspired by the true life experiences of Henry Winkler, whose undiagnosed dyslexia made him a classic childhood underachiever, the Hank Zipzer series is about the high-spirited and funny adventures of a boy with learning differences.  PS 87 is having multicultural week, and Ms. Adolf's class is putting on a \"Foods From Around the World\" luncheon. Hank makes enchiladas, and at the luncheon, Ms. Adolf piles her plate with lots of food. But after a few bites, her face turns bright red-one of the dishes is super-spicy! Ms. Adolf accuses someone of playing a mean practical joke and punishes the entire class with no recess until the guilty party comes forward. Hank realizes his trouble with numbers might have caused the problem-what if he accidentally used three cups of peppers instead of 1/3 cup? Will Hank be able to get recess back for everyone without getting detention for the rest of his life?  Illustrated by Carol Heyer.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "If Only My Family Understood Me",
        "Authors": "By Wegscheider, Don",
        "Description": "",
        "Category": "",
        "Publisher": "Compcare Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "It's Not About the Tapas: A Spanish Adventure on Two Wheels",
        "Authors": "By Evans, Polly",
        "Description": "Single, stressed, and living amid the hustle and hurry of modern Hong Kong, Polly Evans had a vision: of mountains and orange groves, matadors and promenades–and of a glorious, hassle-free journey across Spain by bicycle.  But like any decent dream, Polly’s came with its own reality: of thighs screaming with pain and goats trying to derail her, of strange local delicacies and overzealous suitors. In fact, like any great traveler, Polly had bitten off more than she could chew–and would delight in every last taste of it.Exploring the country that gave the world flamenco, chocolate, sherry, Franco, and Picasso, Polly takes us from the towering Pyrenees to the vineyards of Jerez de la Frontera, spinning tales of conquistadors and kings, vibrant history and mouthwatering cuisine.  In the end, this hilarious, irreverent, always engaging memoir of a journey on two wheels unveils a lot about one modern woman, even more about an utterly fascinating nation, and countless reasons why it’s better when you do it on a bike.",
        "Category": " Travel , Europe , Spain & Portugal",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Frommer's Ireland's Best-Loved Driving Tours",
        "Authors": "By Poole, Susan and Gallagher, Lyn",
        "Description": "Frommer's Driving Tours are packed with detailed, color-coded maps and stunning full-color photographs. Each guide outlines dozens of driving tour options and then helps you plan your route with exact directions, distances, and driving times. You'll see all the top sights and then have the flexibility to discover the hidden pleasures of each destination -- our suggested routes include scenic detours and stops for spectacular views, easy walks, shopping, dining, and fun breaks for travelers with children. We'll show you how to enjoy some of the world's most spectacular drives!",
        "Category": " Travel , Europe , Ireland",
        "Publisher": "Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Breaking and Mending: Divorce and Gods Grace",
        "Authors": "By Redding, Mary Lou",
        "Description": "",
        "Category": " Religion , Faith",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Rule of Benedict: Insights for the Ages",
        "Authors": "By Chittister, Joan D.",
        "Description": "Benedictine Sister and prominent author and speaker Joan Chittister contends that Benedictine spirituality is the most effective way to address the core issues of the 21st century: stewardship, relationships, authority, community, balance, work, simplicity, prayer, and spiritual and psychological development.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "The Crossroad Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Signs of Life",
        "Authors": "By Jeremiah, David",
        "Description": "Discover personal transformation that changes the world.Just as there are physical signs that determine the overall health and wellness of a patient, so too there are signs of life determining the extent to which a man or woman has been transformed into the image of Jesus. It's a smile, a simple lifestyle, compassion in the face of misfortune, willingness to commit random acts of kindness, benevolence, social justice, tears, words. In Signs of Life bestselling author David Jeremiah leads readers through a forty-day journey to a fuller understanding of what these signs are and how to be a person marked by them. This journey pursues a life characterized by relevancy, surrender, authenticity, generosity, and compassion-and in so doing, transforms individuals, communities, and nations. Whether new to the Christian faith or considered an old-timer, readers will discover what being transformed personally into the image of Jesus means and be equipped with a greater vision for the life they are freed to live.",
        "Category": " Religion , Spirituality",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Spiritual Shock Treatment: Get Real with Jesus Teen Devotional",
        "Authors": "By Ron Luce",
        "Description": "",
        "Category": "",
        "Publisher": "Asbury Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Jesus I Never Knew (Limited Edition)",
        "Authors": "By Yancey, Philip",
        "Description": "",
        "Category": " Religion , Education",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "When I'm On My Knees: Devotional Thoughts On Prayer For Women",
        "Authors": "By Donihue, Anita Corrine",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Barbour Publishing Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "All About Sound (The Question and Answer Book)",
        "Authors": "By Knight, David C. and Johnson, Lewis (ILT)",
        "Description": "Questions and answers provide basic information about sound, including its formation, pitch, variety, mode of travel, echo, and how ears receive sound waves.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "The Fig Tree Blossoms: Messianic Judaism Emerges",
        "Authors": "By Liberman, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Fountain Press, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1976"
        }
    },
    {
        "Title": "British cathedrals",
        "Authors": "By Johnson, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "W. Morrow",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Up, Down, Across: Elevators, Escalators, and Moving Sidewalks",
        "Authors": "By Goetz, Alisa",
        "Description": "",
        "Category": "",
        "Publisher": "Merrell Publishers Limited",
        "Price Starting With ($)": "42.15",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Wonder Of America",
        "Authors": "By Johnson, Derric",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Essential Jesus: Original Sayings and Earliest Images",
        "Authors": "By Crossan, John Dominic",
        "Description": "",
        "Category": " Religion , Biblical Studies , New Testament , General",
        "Publisher": "Castle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The balloon farm,",
        "Authors": "By Slicer, Margaret O",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The English Garden: Woman of Valor/Apple of His Eye/A Flower Amidst the Ashes/Robyn's Garden (Inspirational Romance Collection)",
        "Authors": "By Martin, Gail Gaymer, Y'Barbo, Kathleen, Mills, DiAnn, and Stengl, Jill (EDT)",
        "Description": "",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "How We Believe: The Search for God in an Age of Science",
        "Authors": "By Shermer, Michael",
        "Description": "At the beginning of the twentieth century, social scientists predicted that belief in God would decrease by the end of the century because of the secularization of society, but nothing could be further from the truth.  Recent polls show that 96% of Americans believe in God. Despite Nietzche's claim that God is dead, He has never been more alive for millions of believers who stand steadfast in their convictions.  Why is this? Why are people turning to religion in greater numbers than ever before? Why do people believe in God at all?In How We Believe, Michael Shermer presents the results of an exhaustive empirical study in which he asked 10,000 Americans how and why they believe and about details of their faith.  How We Believe offers fresh and startling insights into age-old questions and examines:• What it means to believe in God• \"Proofs\" of God and what they tell us about religious faith• The relationship between science and religion• How humans, as the storytelling animal, came to become Homo religious• How to find the sacred in the age of science This edition includes a new introduction by the author that brings readers up to date on recent studies on prayer and healing, on the changing religious attitudes and beliefs of Americans, and on the controversial debate about the relationship of science and religion that continues to grab headlines. Shermer also addresses his critics, both believers and atheists, on why belief or disbelief in God is not a question of evidence but of faith. Yet having been a believer and studied the history of science, Shermer is open-minded and inclusive throughout the book. He is most interested in knowing how and why, not in showing right or wrong. Thought provoking, comprehensive, and well researched, How We Believe is certain to spark lively debate among believers and nonbelievers alike.",
        "Category": " Religion , General",
        "Publisher": "W. H. Freeman & Co.",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Finding Favor With the King: Preparing For Your Moment in His Presence",
        "Authors": "By Tenney, Tommy",
        "Description": "Tenney takes readers to Esther's pre-Islamic Persia to uncover the secrets that helped her win the heart and gain the ear of the king and save her people from destruction. A Jewish girl of no royal heritage was chosen to become the Queen of Persia. Was it her beauty alone, or did she know an important and mysterious truth? Tenney challenges his readers to move beyond formal petitions or even \"storming the gates of heaven\" to that intimate embrace of worship where the bride's petitions move the King's heart and where kingdoms, people, and situations begin to shift like pawns on a divine chessboard.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "All the Pope's Men: The Inside Story of How the Vatican Really Thinks",
        "Authors": "By Allen, John L.",
        "Description": "A fascinating and enlightening look at the world’s oldest and most mysterious institution, written by an American journalist with unparalleled knowledge about the Vatican's past and present.The sexual abuse scandals that shook American and British Catholicism in 2002 brought to light a long-standing cultural gap between the English-speaking Catholic world and the Vatican. In Rome, the crisis was often seen as an attack on the Church mounted by money-hungry lawyers, a hostile press, and liberal activists who used it as a way to turn attention on such concerns as celibacy, women’s ordination, and lay empowerment. When the Vatican struck down the U.S. bishops’ draft for handling allegations of sexual abuse, many saw it as an attempt to curb an independent American Catholic church. Yet, as time passed, it became clear that the Vatican’s well-founded concerns about due process were shared by most liberal U.S. bishops and canon lawyers. ALL THE POPE’S MEN is a lucid, in-depth guide to the sometimes puzzling, often incomprehensible inner workings of the Vatican. It reveals how decisions are made, how papal bureaucrats think, and how careers in the Roman Curia are shaped. It debunks the myths that have fed the distrust and suspicions many English-speaking Catholics harbor about the way the Vatican conducts its business, explains who really wields the power, and offers entertaining profiles of the personalities, historical and present-day, who have wielded that power for good and for bad. A thoughtful analysis of the recent sexual abuse crisis sheds light on how the Vatican perceives the Church in the United States.  Balanced, lively, and filled with Vatican history and lore, ALL THE POPE’S MEN provides the general reader with an authoritative picture of the highly charged relationship between the Vatican and the richest, most influential national Catholic church in the world today.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Doubleday Religion",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Reflections for Managers: A Collection of Wisdom & Inspiration from the World's Best Managers",
        "Authors": "By Hyland, Bruce N. and Yost, Merle J.",
        "Description": "Reflections for Managers imparts the wisdom of some of the world's most successful executives and managers who were asked what they considered the top rules of effective management. Their responses reflect the basic laws of good conduct and human relationships - 64 wise, witty, bite-sized maxims that you can read and profit from in just a few moments each day. Each one will serve to remind you, no matter how busy or pressured you may be feeling, of just what matters - and what doesn't.Each maxim is supported by a penetrating analysis of its meaning and value ... and is then crystallized with a telling business story that illustrates the idea in action. Each concludes with a series of provocative, open-ended questions that encourage you to stop and reflect on the maxim's relevance to your own personal and professional life.",
        "Category": " Business & Economics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The Great Chinese Revolution: 1800-1985",
        "Authors": "By Fairbank, John King",
        "Description": "Examines the transformation of Imperial China to Communist China, discusses the social and cultural changes that have occurred, and looks at modern economic development in China.",
        "Category": " History , General",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.26",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "A Touch of Hope",
        "Authors": "By Kraft, Dean and Kraft, Rochelle",
        "Description": "A hands-on healer--whose powers have been tested in laboratory studies--reveals, with explicit instructions and line drawings, how ordinary people can help themselves and their loved ones through the \"laying on of hands.\" Reprint.",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "India: A Million Mutinies Now",
        "Authors": "By Naipaul, V. S.",
        "Description": "A look at India explores the ways different individuals have been affected by the numerous frictions present in Indian society, the contradictions and compromises of religious faith, and more. Reprint. NYT.",
        "Category": " History , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Molly's Pilgrim",
        "Authors": "By Cohen, Barbara and Deraney, Michael J. (ILT)",
        "Description": "Told to make a doll like a pilgrim for the Thanksgiving display at school, Molly's Jewish mother dresses the doll as she herself dressed before leaving Russia to seek religious freedom--much to Molly's embarrassment.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Lothrop Lee & Shepard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Case Closed: The Real Scoop On Detective Work",
        "Authors": "By Meltzer, Milton",
        "Description": "Offers readers a look at the detailed process by which criminal cases are reviewed, dissected, and solved by police officers and private agents, examining the history, changing technologies, and current challenges of a fascinating line of work.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Orchard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Holy War: The Crusades and Their Impact on Today's World",
        "Authors": "By Armstrong, Karen",
        "Description": "In 1095, with the tomb of Jesus still in the hands of infidels and the Byzantine empire overrun by Muslim Turks, Pope Urban II summoned Christian warriors to take up the cross and their swords against the Turks and then recover the holy city of Jerusalem from Islam. It was to be the first of the Crusades, a holy war that would focus the power of the European kingdoms against a common enemy. The Crusades became the stuff of romantic legend, but in reality they were a series of rabidly savage battles carried out in the name of Christian piety to advance the power of the Western Church. Their legacy of religious violence is felt today as the age-old conflict of Christians, Jews, and Muslims persists.",
        "Category": " History , Middle East , General",
        "Publisher": "Anchor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Message and the Kingdom",
        "Authors": "By Silberman, Neil Asher, Horsley, Richard A., and Siberman, Neil Asher",
        "Description": "Combining archaeology and social history to more clearly examine the context of early Christanity, two authors reveal how Jesus and Paul were actually rallying against the dominion of Rome and as such were promoting a kingdom with no earthly leader. 17,500 first printing.",
        "Category": " Religion , Christianity , History",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Noisy Seagull (Tubby Buddies)",
        "Authors": "By Parent, Nancy",
        "Description": "",
        "Category": "",
        "Publisher": "Paradise Press, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    }
]