[
    {
        "Title": "Beyond Tuesday Morning (September 11 Series #2)",
        "Authors": "By Kingsbury, Karen",
        "Description": "The hope-filled sequel to the bestselling One Tuesday Morning In this new novel by Karen Kingsbury, three years have passed since the terrorist attacks on New York City. Jamie Bryan, widow of a firefighter who lost his life on that terrible day, has found meaning in her season of loss by volunteering at St. Paul’s, the memorial chapel across the street from where the Twin Towers once stood. Here she meets a daily stream of people touched by the tragedy, including two men with whom she feels a connection. One is a firefighter also changed by the attacks, the other a police officer from Los Angeles. But as Jamie gets to know the police officer, she is stunned to find out that he is the brother of Eric Michaels, the man with the uncanny resemblance to Jamie’s husband, the man who lived with her for three months after September 11. Eric is the man she has vowed never to see again. Certain she could not share even a friendship with his brother, Jamie shuts out the police officer and delves deeper into her work at St. Paul’s. Now it will take the persistence of a tenacious man, the questions from her curious young daughter, and the words from her dead husband’s journal to move Jamie beyond one Tuesday morning. “Jamie Bryan took her position at the far end of the Staten Island Ferry, pressed her body against the railing, eyes on the place where the Twin Towers once stood. She could face it now, every day if she had to. The terrorist attacks had happened, the World Trade Center had collapsed, and the only man she’d ever loved had gone down with them. Late fall was warmer than usual, and the breeze across the water washed over Jamie’s face. If she could do this, if she could make this journey three times a week while Sierra was in school, then she could convince herself to get through another long, dark night. She could face the empty place in the bed beside her, face the longing for the man who had been her best friend, the one she’d fallen for when she was only a girl.”",
        "Category": " Fiction , Religious",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Edible Garden (Sunset)",
        "Authors": "By Sunset Books (EDT), White, Hazel (EDT), and Sanchez, Janet H. (EDT)",
        "Description": "A complete guide to growing food covers everything from fruits and vegetables to edible flowers and includes practical advice applicable to both large and small gardens, with more than three hundred photographs, quick and easy recipes, and kid-friendly activities. Original.",
        "Category": " Gardening , Vegetables",
        "Publisher": "Sunset Publishing Co.",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Romance of Flowers",
        "Authors": "By Poce, Pat",
        "Description": "Velvety soft roses nestled among seed pods and pumpkins. Calla lilies, celebrating purity and grace--so beautiful they need no embellishment other than a white lace handkerchief tied with a gossamer ribbon.  Petals of paradise, as vividly colored as a tropical sunset. Lush centerpieces that take the breath away.  Have a passion for flowers?  Bring their loveliness and sweetness into your home-and into the lives of those you cherish. Create the absolutely perfect present, make any occasion truly unforgettable, or assemble the ideal decoration for any occasion with the help of a professional designer.  Month-by-month, from summer party days to merry Christmases, mark every holiday with these blossom-rich, extravagant ideas (accompanied by lyrical photo essays) for unusual bouquets, surprising arrangements, and exquisite presentations.  With information on selecting, mixing, and preserving your flowers too.",
        "Category": " House & Home , Decorating",
        "Publisher": "Sterling/Chapelle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Majipoor Chronicles",
        "Authors": "By Silverberg, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "The Janissary Tree: A Novel (Investigator Yashim)",
        "Authors": "By Goodwin, Jason",
        "Description": "Jason Goodwin has unleashed his talent on a series of mysteries set in nineteenth-century Istanbul and starring the unlikeliest and most engaging of detectives: Yashim the eunuch.The Janissary Tree is the first in the series, and the year is 1836. Europe is modernizing, and the sultan of the Ottoman Empire feels he has no choice but to follow suit. But just as he's poised to announce sweeping political change, a wave of murders threatens the fragile balance of power in his court. Who is behind the killings? Deep in the Abode of Felicity, the most forbidden district of Topkapi Palace, the sultan - ruler of the Black Sea and the White, ruler of Rumelia and Mingrelia, lord of Anatolia and Ionia, Romania and Macedonia, Protector of the Holy Cities, steely rider through the realms of bliss - announces, \"Send for Yashim.\"Leading us through the palace's luxurious seraglios and Istanbul's teeming streets, Yashim places together the clues. He is not alone. He depends on the wisdom of a dyspeptic Polish ambassador, a transsexual dancer, and the Creole-born queen mother. He manages to find sweet salvation in the arms of another man's wife (this is not your everyday eunuch!). And he introduces us to the Janissaries. For four hundred years, they were the empire's elite soldiers. But they grew too powerful, and ten years earlier the sultan had them crushed. Are the Janissaries staging a brutal comeback? And if they are, how can they be stopped without throwing Istanbul into political chaos?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Sarah Crichton Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "A Cat is Watching",
        "Authors": "By Caras, Roger A.",
        "Description": "Offers a cats-eye-view of people, hunting, communication, and direction finding, and tells the stories of some remarkable cats",
        "Category": " Pets , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Before You Know Kindness",
        "Authors": "By Bohjalian, Christopher A.",
        "Description": "From the bestselling author of The Flight Attendant, here is a novel that examines wildly divisive American issues like gun control and animal rights with Chris Bohjalian’s trademark emotional heft and spellbinding storytelling skill. For ten summers, the Seton family—all three generations—met at their country home in New England to spend a week together playing tennis, badminton, and golf, and savoring gin and tonics on the wraparound porch to celebrate the end of the season. In the eleventh summer, everything changed. A hunting rifle with a single cartridge left in the chamber wound up in exactly the wrong hands at exactly the wrong time, and led to a nightmarish accident that put to the test the values that unite the family—and the convictions that just may pull it apart.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Courage Under Fire",
        "Authors": "By Duncan, Patrick Sheane",
        "Description": "The Gulf War was the first American war with women in combat command positions, and Captain Karen Emma Walden was one of the best. Yet when her Medevac, a Huey, was shot down over enemy territory, Captain Walden became a casualty, along with one of her men.Now the Army wants to give Captain Walden a medal - the kind fastened on so many men in wars past, but never before on a woman. And Lieutenant Colonel Nat Serling's investigation into Walden's career could help revive his own. He'd been a rising star in the war, but his command of a raid that accidentally fired on its own men has destroyed confidence in him. Now he has the chance to show what kind of job he can do with a delicate mission.Soon Serling discovers that this investigation is far from routine: he finds soldiers wounded more than just physically, stories that don't jibe, mysterious lapses of memory. He must navigate the codes of silence, honor, and loyalty to uncover the truth about the Captain's death - a truth that could destroy Walden's reputation but save Serling's career.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Jobs That Don't Suck: What Nobody Else Will Tell You About Getting and Succeeding in the Job of Your Dreams",
        "Authors": "By Drozdyk, Charlie",
        "Description": "\"I completely and totally remember what it's like graduating from college and having absolutely no clue what to do with my life.\"--Charlie DrozdykSound familiar? Then turn off the tube, get off the couch, and read this book. Why this book? Drozdyk isn't one of those so-called career experts who tells others how to get a job but hasn't gotten one himself in years. He has learned firsthand how to open doors that seem jammed shut and get an offer over hundreds of other applicants. His advice comes straight from the employment trenches. Here's his advice on: Deciding which job is right for you--and which ones will lead to a life of eternal misery Resumes and cover letters--what works, what sucks, what you can get away with Interviewing Hell--staying cool in the hot seat Successful  Getting your boss to love you--and giving good phone Moving up the ladder--from being an assistant to having oneFull of interviews with people in cool jobs, such as fashion editors, film producers, advertising copywriters, TV execs, and pop-culture critics, Jobs That Don't Suck shows you how to get ahead and stay ahead.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Texas",
        "Authors": "By Michener, James A.",
        "Description": "\"A book about oil and water, rangers and outlaws, Anglos and Hispanics, frontier and settlement, money and power...James Michener is something rare and valuable: an honorable craftsman doing honorable work....He manages to make history vivid and palatable to the reader.\"THE BOSTON GLOBETexas. A land of sprawling diversity and unparalleled richness; a dazzling chapter in the history of our nation, a place like no other on earth. Through the remarkable lives of four families, this epic saga spans four centuries and two continents and charts the dramatic formation of several great dynasties from the age of the conquistadors to the present day. A richly compelling novel of a proud people eager to meet the challenge of the land, TEXAS is James Michener's most magnificent achievement.From the Paperback edition.",
        "Category": " Fiction , Historical",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.57",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Like Father, Like Daughter: How Father Shapes the Woman His Daughter Becomes",
        "Authors": "By Fields, Suzanne",
        "Description": "An incisive analysis of the father-daughter relationship discusses the impact of the father on his daughter's life, work, values, and personal relationships",
        "Category": " Social Science , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Project Management: A Systems Approach to Planning, Scheduling, and Controlling, 6th Edition",
        "Authors": "By Kerzner, Harold",
        "Description": "A revised, updated, and reorganized text for undergraduate or graduate courses in both business and engineering, as well as for functional managers and upper-level executives who must provide continuous support to all projects. It explains the characteristics of every size and type of group, presents the basics of systems theory and organizational structure, and provides practical advice on how to conceive, staff, and guide a project management department for maximum effectiveness and cost efficiency. The new edition of this classic guide enables you to learn from the successes and failures of leading companies to explore new cost control and risk management techniques and to assess the impact of concurrent engineering. You'll also learn how to merge total quality management methods with effective project planning, master conflict resolution, predict project success and obtain the information needed to study for the PMI Certification exam.",
        "Category": " Business & Economics , Management",
        "Publisher": "Wiley",
        "Price Starting With ($)": "8.24",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Whispers",
        "Authors": "By Plain, Belva",
        "Description": "In Whispers, her stunning new novel, Belva Plain shows she has no equal as a chronicler of twentieth-century American life. Here she creates one of the most realistic portraits of a marriage in recent fiction, a tale of the nineties told with shocking authenticity. In it we are privy to the secret life of one outwardly perfect family, we hear the whispers about what goes on behind their closed doors, and we experience the triumph that comes when one person dares to tell the truth.It can happen in the best of families - even the Fergusons. When Lynn and Robert first meet, she is a bright, open-faced twenty-year-old; he is handsome, a little older, a charming young executive who is already rising fast in one of America's top corporations. From the start, they are deeply in love, thrilled by the discovery of their mutual desire. It is only on their honeymoon that the gold begins to tarnish when Robert's anger erupts into a physical attack, one Lynn blames on herself, for, after all, Robert is the love of her life. With a lovely home in an exclusive Connecticut community, the Fergusons are living the ultimate American Dream - a picture-perfect marriage, two beautiful children, parties at the country club, and wonderful friends. Yet Lynn, a devoted mother and model corporate wife, has never been able to piece together all the parts of her husband's past - his failed first marriage, and the son he never discusses. Somewhere in those mysterious years may be the key to understanding the violence that is tearing her family apart. But not even to their closest friends can Lynn bear to reveal what is really going on in the Ferguson household, the lies she has been telling, the pain she sees in her children's eyes, and the family secrets that are about to explode in a shattering and unforgettable climax.Written with extraordinary sensitivity and intelligence, whispers brings Belva Plain to a new level as an author. Holding a mirror up to modern life, she has written an inspiring and compelling story about a family's heartbreak, a woman's courage - and about a subject too long discussed only in whispers.",
        "Category": " Fiction , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Treasure of Khan (Dirk Pitt Adventure)",
        "Authors": "By Cussler, Clive and Cussler, Dirk",
        "Description": "Black Wind continued Dirk Pitt's meteoric career with one of Clive Cussler's most audacious, and well-received, novels yet: \"Black Wind more than maintains the supercharged Cusslerian danger\" (Kirkus Reviews). \"Thriller fans will revel in this action-packed yarn\" (Publishers Weekly). But now Cussler takes an extraordinary leap, with one of his most remarkable villains ever.  Genghis Khan-the greatest conqueror of all time, who, at his peak, ruled an empire that stretched from the Pacific Ocean to the Caspian Sea. His conquests are the stuff of legend, his tomb a forgotten mystery. Until now.  When Dirk Pitt is nearly killed rescuing an oil survey team from a freak wave on Russia's Lake Baikal, it appears a simple act of nature. When the survey team is abducted and Pitt's research vessel nearly sunk, however, it's obvious there's something more sinister involved. All trails lead to Mongolia, and a mysterious mogul who is conducting covert deals for supplying oil to the Chinese while wreaking havoc on global oil markets utilizing a secret technology. The Mongolian harbors a dream of restoring the conquests of his ancestors, and holds a dark secret about Genghis Khan that just might give him the wealth and power to make that dream come true.  From the frigid lakes of Siberia to the hot sands of the Gobi Desert, Dirk Pitt and Al Giordino find intrigue, adventure, and peril while collecting clues to the mysterious treasure of Xanadu. But first, they must keep the tycoon from murder-and the unleashing of a natural disaster of calamitous proportions. Filled with breathtaking suspense and brilliant imagination, his new novel is yet further proof that when it comes to adventure writing, nobody beats Clive Cussler.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Better Homes and Gardens Soups and Stews Cook Book",
        "Authors": "By Flora Szatkowski~Doris Eby",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Finite Mathematics: For Business Economics Life Sciences and Social Sciences",
        "Authors": "By Barnett, Raymond A., Ziegler, Michael R., and Byleen, Karl E.",
        "Description": "",
        "Category": " Mathematics , Finite Mathematics",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "7.81",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Java How to Program, Fifth Edition",
        "Authors": "By Deitel, Paul J. and Deitel, Harvey M.",
        "Description": "The Deitels' best-selling introductory Java book has been fully revised and updated to Java 2 Standard Edition (J2SE) 1.4. Like every How to Program book, \"Java How to Program, Fifth Edition\" features the Deitels' signature \"LIVE-CODE\" ? approach to teaching programming languages with thousands of lines of live code, explained with exceptional clarity by the renowned programming trainers at Deitel and Associates.  The Deitels cover all facets of the Java language, including object-orientation, multithreading, exception handling, the Java event programming model, GUI with Swing and AWT, graphics, and much more. You'll also find a set of core design patterns that are integrated throughout the text along with all new coverage of JDBC, SQL, n-tier, Web-application development with servlets and JSP, plus an introduction to XML processing with the Java XML library. The book also provides an optional, start-to-finish case study introducing Java object-oriented analysis and design with UML. It contains hundreds of tips, recommended practices and cautions (all marked with icons) for writing code that is portable, reusable and optimized for performance.  For all beginning programmers -- and developers experienced with traditional languages -- who want to master Java quickly.",
        "Category": " Computers , Programming Languages , Java",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "8.77",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Corn: 140 Recipes: Roasted, Creamed, Simmered & More",
        "Authors": "By Woodier, Olwen",
        "Description": "Nothing is more sublime than the taste of the first fresh corn of the season, steaming hot, slathered with butter, and lightly salted. Award-winning cookbook author Olwen Woodier explains how to best enjoy fresh corn, as well as how to freeze or preserve that farm-fresh taste so that corn lovers can add the nutritious goodness of corn and cornmeal to the menu all year long. Imagine steaming hot cornmeal porridge on a winter&#39;s morning, a savory bowl of corn chowder after that first day planting the garden, or a Cinco de Mayo fiesta complete with homemade tortillas.The texture, wholesome goodness, and flavor of corn make it a remarkably versatile grain, complementing everything from frittatas to Posole, souffles to Shepherd&#39;s Pie. In Corn, author Olwen Woodier celebrates this downhome, delicious, all-purpose comfort food through 140 easy-to-prepare recipes. There are Corn Starters: Tortilla Pizza, Blue Blazes Hush Puppies; Corn Soups: Tortilla Soup, Lobster and Corn Chowder; Corn Salads: Black Bean, Corn and Tomato Salad, Corn Pasta Salad with Roasted Garlic Dressing; Corn in the Main: Salmon with Corn Pancakes, Corn-Tortilla Crusted Fish, Corn and Cheese Tamales; and Corn Breads: Bacon-Scallion Muffins, Skillet Corn Bread.Woodier also includes a complete history of corn, a cook&#39;s primer on corn varieties, corn nutritional information, and special grower and chef profiles.",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Edward Curtis Folding Scn",
        "Authors": "By Marquand Co.",
        "Description": "",
        "Category": "",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "DEL-Healing Centers and Retreats: Healthy Getaways for Every Body and Budget",
        "Authors": "By Miller, Jenifer",
        "Description": "Profiles more than 200 healing centers, retreats, and spas in the United States and Canada",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Rick Steves",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Shyness: A Bold New Approach",
        "Authors": "By Carducci, Bernardo J., Ph.D.",
        "Description": "Shy FactsShy children are not destined to be shy adults.Shyness does not equal low self-esteem.Shyness is not a \"disease,\" personality deficit, or character flaw.Humans aren't the only species to experience shyness. Scientists have been studying shy cattle aswell as shy cats, shy fish, and shy dogs.Some of the world's most famous, richest, smartest and bravest people are shy.",
        "Category": " Psychology , Applied Psychology",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "English Spirituality in the Age of Wesley",
        "Authors": "By Jeffrey, David Lyle (EDT)",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Eerdmans Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Essentials of Bonsai",
        "Authors": "By Shofunotomo Editors",
        "Description": "",
        "Category": " Gardening , Ornamental Plants",
        "Publisher": "Timber Press, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "Looking for Georgia O'Keeffe and other Observations",
        "Authors": "By Masten, Ric",
        "Description": "",
        "Category": "",
        "Publisher": "Sunflower Ink",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "The Female Cyclist: Gearing Up a Level (Ultimate Training Series from Velopress, 3)",
        "Authors": "By Bernhardt, Gale",
        "Description": "Gale Bernhardt has been instructing and coaching athletes since 1974. In this book she shows women cyclists how to select and customize their bikes, design an optimal-performance plan, and meet their riding goals. She includes important information about women's health and nutritional needs, and tips to make cycling more comfortable.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Velo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Saving the Bay: People Working for the Future of the Chesapeake",
        "Authors": "By Byrnes, Ann E., Dorbin, Richard A. K. (PHT), Dorbin, Richard A. K., and Dorbin, Ann E.",
        "Description": "The author collects images from the current effort to save the Chesapeake Bay region from overdevelopment, portraying the teachers, engineers, writers, farmers, parents, and naturalists who are working in the movement.",
        "Category": " Science , Life Sciences , Ecology",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The New York Times Guide to Alternative Health",
        "Authors": "By Brody, Jane E. (EDT) and Grady, Denise (EDT)",
        "Description": "An indispensible resource for anyone interested in alternative medicine.Nearly half the American population has at some point consulted a practitioner of complementary medicine -- a chiropractor or a specialist in acupuncture, homeopathy, massage therapy, or herbal or Chinese medicine. The amount of money spent on treatments and products in these areas is staggering, yet we still know little about their efficacy.Adhering to the same high standards of investigation used by mainstream medical science, Jane Brody, Denise Grady, and the reporters of The New York Times take a hard look at the products, the research -- and the scams. They reveal the facts about unregulated dietary supplements, interactions between herbal and prescription medicines, and the many theories about the power of the mind over physical ailments. They evaluate claims about popular remedies like echinacea, ginkgo, and St. John's wort, and review the increasing body of scientific data on alternative treatments, including critical government case studies.Contributors to this timely and authoritative guide include star writers of the health, science, and business pages of The New York Times, whose articles are prized by those seeking practical, reliable, well-researched reporting on vital health issues.",
        "Category": " Business & Economics , Consumer Behavior",
        "Publisher": "Times Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "A World of Strangers",
        "Authors": "By Gordimer, Nadine",
        "Description": "The life of a young Englishman living in Johannesburg is transformed when he becomes the friend of a bitter Black African",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "The Skin of Our Teeth",
        "Authors": "By Wilder, Thornton",
        "Description": "",
        "Category": " Drama , American , General",
        "Publisher": "Samuel French Inc.",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "July",
            "Year": "2017"
        }
    },
    {
        "Title": "The Black Stallion and Flame",
        "Authors": "By Farley, Walter",
        "Description": "While flying to a race, Alec Ramsay and the Black’s plane crash-lands in the stormy Caribbean. Chance brings the Black to the hidden island home of the giant red stallion, Flame. Such a small island can only support one alpha male. But before the two can fight–a fight that can only result in the death of one–a new danger appears. Together, can the stallions defeat the deadly foe which threatens the lives of the entire herd of wild horses?",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "How to Toilet-Train Your Cat: 21 Days to a Litter-Free Home",
        "Authors": "By Kunkel, Paul and Mead, Kimble Pendleton (ILT)",
        "Description": "Paul Kunkel, who toilet-trained his first cat while in college and who has continued to train his own and his friends' cats ever since, presents a foolproof, 21-Day-Program for teaching any litter-trained cat between the ages of 6 months and 10 years to use a toilet instead of a litter box. (Older cats can still be trained, but the process will probably take longer.) Requiring nothing more than magazines and/or newspapers, masking tape, heavy-duty plastic wrap, and a supply of fresh litter, the plan begins with you placing the box next to the toilet and, after gradually raising it to the height of the seat, ends with the cat--well, using it like any other member of the family. For life.Along the way, concerned owners learn why toilet-trained cats may be happier and healthier cats. In well-researched, fact-filled text, Kunkel traces the history and behavior of this barely domesticated animal and proves why the box is bad for cats; why many cats equate the smell of a litter box with danger; and why the fragrances, deodorants, dyes, and disinfectants found in most litters are detrimental to your pet's well-being.",
        "Category": " Pets , Cats , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Interwoven Destinies: Cities and the Nation (American Assembly Series)",
        "Authors": "By American Assembly (COR) and Cisneros, Henry (EDT)",
        "Description": "A collection of essays assess the problems of America's major cities, including a shrinking economic base, rising minority problems, and decreasing share of government aid, and suggest practical solutions for rebuilding urban infrastructure and redesigning government and judicial systems.",
        "Category": " Social Science , Sociology , Urban",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Con 3 Controversy",
        "Authors": "By Philip nobile",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1971"
        }
    },
    {
        "Title": "Washington (Art in Focus)",
        "Authors": "By Reese, Nicholas",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Bulfinch Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Rune Poem",
        "Authors": "By Paul, Jim (TRN)",
        "Description": "In the dark forests of Northern Europe at the end of the last millenium, runes - ancient symbols of the natural world- were respected and feared as messages from gods and humbly consulted for divine guidance and predictions. Carved on jewelry, tools, weapons, and inscribed on boundary stones and markers, runes served as signs and talismans in a mysterious time.Originally written in Anglo Saxon in the early Middle Ages, The Rune Poem gives us an alphabet verse for these mystical inscriptions. Transcribed here into graceful modern English by poet Jim Paul, this ancient work is illustrated with richly textured carvings and lustrous illuminations. A beautiful and startling evocation, enhanced with informative contemporary notes, The Rune Poem, with its timeless power, links us to ages past and provides a key through which we may understand these primal symbols.",
        "Category": " Poetry , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Historic American Buildings Survey, District of Columbia Catalog",
        "Authors": "By Schwartz, Nancy B. (COM)",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Univ of Virginia Pr",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "Lady Windermere's Fan (Dover Thrift Editions)",
        "Authors": "By Wilde, Oscar",
        "Description": "Clever dialogue, fast-paced repartee, and pithy epigrams abound in this sparkling Victorian comedy of manners. The first of Oscar Wilde's dramas, the 1892 play attests to the author's legendary reputation as a wit and keen observer of ironic situations. In Lady Windermere's Fan, Wilde offers a splendidly satirical view of society's obsessive regard for appearances rather than reality.A paragon of morality, Lady Windermere firmly rejects the company of anyone exhibiting even the slightest deviation from the social code. Suspecting her husband of a dalliance with Mrs. Erlynne, a woman of dubious reputation, Lady Windermere rashly decides to abandon her secure position for the seductive charms of Lord Darlington. The voice of caution arises from an unexpected source when the mysterious Mrs. Erlynne reveals the calamitous effects of her own disregard for duty and virtue, and she augments her advice with an act of self-sacrifice. By laying claim to Lady Windermere's telltale fan, the woman from outside society shows the model of social propriety the difference between true morality and its semblance.More than a century after the play's debut, the luster of its humorous quips, merry bon mots, and thought-provoking paradoxes remains undimmed. This modestly priced edition of Wilde's scintillating comic masterpiece will delight lovers of drama and literature.",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2011"
        }
    },
    {
        "Title": "Happiness Quotations (Quotations Books)",
        "Authors": "By Exley, Helen (EDT)",
        "Description": "",
        "Category": " Reference , Quotations",
        "Publisher": "Helen Exley Gift Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Pets I Wouldn't Pick (Parents Magazine Read Aloud and Easy Reading Program Origina)",
        "Authors": "By Susan Alton Schmeltz",
        "Description": "",
        "Category": "",
        "Publisher": "Parents Magazine Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Wild Truth Journal for Junior Highers",
        "Authors": "By Oestreicher, Mak",
        "Description": "Meet 50 of the Bible's most outrageous and amazing people. You'll find out what happened when God went major rad with His Wild Truth--and you'll discover how God can do the same thing right now in your life. Check out some of the people you'll get to know: - Skipper (pulls off major animal style Rescue 911) - Hammerhead (gives a bad dude a permanent headache) - LAZ (a dead guy. . Until You-Know-Who comes along) - Moe's Mom (sends her son on THE river-rafting trip of all time) - Bad Luck Boils (overcomes major zit problem) . . .and dozens of other folks you've just gotta meet! Open up Wild Truth Journal - and dare to discover the power of God's love.",
        "Category": " Religion , Christian Ministry , Youth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "The Eentsy, Weentsy Spider: Fingerplays and Action Rhymes",
        "Authors": "By Tiegreen, Alan (ILT) and Cole, Joanna",
        "Description": "A companion to the best-selling Anna Banana: 101 Jump-Rope Rhymes, here is a collection of nearly forty fingerplays and action rhymes that have been chanted, sung, and enjoyed for generations. Children and their parents can join the eentsy, weentsy spider in its climb up the waterspout, pretend to pound in a nail while singing \"The Hammer Song,\" and tip their bodies over for \"I'm a Little Teapot.\"Included are such favorites as \"The Wheels on the Bus,\" \"This Old Man,\" \"This Is the Church,\" and \"Where Is Thumbkin?\" as well as such lesser-known rhymes as \"My Hat\" and \"Birthday Cake.\" So say them, sing them, act them out -- action rhymes are fun for everyone!",
        "Category": " Juvenile Nonfiction , Games & Activities , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "1634: The Galileo Affair (The Assiti Shards)",
        "Authors": "By Flint, Eric and Dennis, Andrew",
        "Description": "As the Thirty Years War continues to devastate Europe, the inhabitants of the American town mysteriously transported from the twentieth century to the seventeenth century confront a new foe, Cardinal Richelieu of France, who will do anything to stop a threat to his power, while working in Venice to prevent a plague and dealing with a Venetian artisan determined to rescue Galileo from a heresy charge.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Literature: Reading Fiction, Poetry, Drama, and the Essay",
        "Authors": "By Diyanni, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Companies",
        "Price Starting With ($)": "7.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "So Help Me God: The Ten Commandments, Judicial Tyranny, and the Battle for Religious Freedom",
        "Authors": "By Perry, John and Moore, Roy",
        "Description": "The Alabama former Chief Justice believes the state must acknowledge God's moral principles on which America was founded and can do so legally, despite the credible and legitimate tenet of the separation of church and state.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Broadman & Holman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Fueled by Faith: Living Vibrantly in the Power of Prayer",
        "Authors": "By Dean, Jennifer Kennedy",
        "Description": "Featuring Scripture passages and practical exercises, this guide to the true meaning of faith teaches Christian believers how to take a daily walk with God and revel in His power, His truth, and His divine love. 17,500 first printing.",
        "Category": " Religion , Inspirational",
        "Publisher": "New Hope Publishers - Impact",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Supreme Chaos: The Politics of Judicial Confirmation & the Culture War",
        "Authors": "By Pickering, Charles Willis",
        "Description": "President George W. Bush twice unsuccessfully sought to have Judge Pickering congressionally confirmed for the US Fifth Circuit Court of Appeals over the objections of a raft of civil rights, women's rights, and union groups, finally resorting to a recess appointment to temporarily place Pickering on the bench. Now retired from the bench, Pickering here offers his thoughts on the \"broken\" judicial confirmation process, echoing familiar right wing complaints about \"judicial supremacy\" on behalf of \"left wing special interest groups,\" the \"promotion of abortion,\" and \"radical secularism.\" He saves his account of his own experiences for an anticipated future volume. Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , History & Theory",
        "Publisher": "Stroud & Hall Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Thank You, President Bush: Reflections on the War on Terror, Defense of the Family, and Revival of the Economy",
        "Authors": "By Verjee, Aman (EDT), Shultz, George Pratt (EDT), and Martin, Rod D.",
        "Description": "Thank You, President Bush brings together the nation's leading conservative and libertarian policy makers and scholars to analyze every aspect of George W. Bush's presidency and to make the compelling case that he will be seen as one of the nation's great Presidents. This landmark anthology features contributions from George Shultz, Phyllis Schlafly, James Dobson, Art Laffer, William Bennett, Edwin Meese III, Gov. Mike Huckabee, Stephen Moore and Grover Norquist, and serves as a strong rebuttal to the legion of Bush-haters who seek nothing but to distort his ongoing record of achievement under trying conditions.",
        "Category": " Political Science , Comparative Politics",
        "Publisher": "World Ahead Publishing, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Competing on Value",
        "Authors": "By Hanan, Mack and Karp, Peter",
        "Description": "Presents a new approach to selling that emphasizes not competing on the basis of the best price, but the highest value i.e. demonstrating to current and prospective customers that using your products or services will either cut their costs or improve their revenues.  Distributed by Gale. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Business & Economics , Management",
        "Publisher": "Amacom Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Inheritance of Loss",
        "Authors": "By Desai, Kiran",
        "Description": "In a crumbling, isolated house at the foot of Mount Kanchenjunga in the Himalayas lives an embittered judge who wants only to retire in peace, when his orphaned granddaughter, Sai, arrives on his doorstep. The judge’s cook watches over her distractedly, for his thoughts are often on his son, Biju, who is hopscotching from one gritty New York restaurant to another. Kiran Desai’s brilliant novel, published to huge acclaim, is a story of joy and despair. Her characters face numerous choices that majestically illuminate the consequences of colonialism as it collides with the modern world.",
        "Category": " Fiction , Literary",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "On Agate Hill: A Novel",
        "Authors": "By Smith, Lee",
        "Description": "A dusty box discovered in the wreckage of a once prosperous plantation on Agate Hill in North Carolina contains the remnants of an extraordinary life: diaries, letters, poems, songs, newspaper clippings, court records, marbles, rocks, dolls, and bones. It's through these treasured mementos that we meet Molly Petree. Raised in those ruins and orphaned by the Civil War, Molly is a refugee who has no interest in self-pity. When a mysterious benefactor appears out her father's past to rescue her, she never looks back.Spanning half a century, On Agate Hill follows Molly’s passionate, picaresque journey through love, betrayal, motherhood, a murder trial—and back home to Agate Hill under circumstances she never could have imagined.",
        "Category": " Fiction , Historical , General",
        "Publisher": "A Shannon Ravenel Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "The True Story of Pocahontas (Step-Into-Reading, Step 3)",
        "Authors": "By Penner, Lucille Recht and Johnson, Pamela (ILT)",
        "Description": "Illus. in full color. Filled with suspense, romance, and historical details, here's a very young biography of the Powhatan Indian princess who played a vital role in early Colonial and Native American relations.",
        "Category": " Juvenile Nonfiction , People & Places , United States , Native American",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Flame Trees of Thika: Memories of an African Childhood",
        "Authors": "By Huxley, Elspeth Joscelin Grant",
        "Description": "The author recounts her life and adventures as a young girl on a farm in Kenya",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Wielding a Red Sword (Book Four of Incarnations of Immortality)",
        "Authors": "By Anthony, Piers",
        "Description": "Here in a fourth complete-in-itself novel of the Incarnations of Immortality, Piers Anthony again combines fascinating magic with a gripping, complex struggle between good and evil.Mym was a dutiful son, but his father the Rajah interfered in his love life once too often. Rather than wed without love, he took up the Red Sword, symbol of office of the Incarnation of War.At first he thought his efforts could ameliorate some of the suffering caused by Earth's constant petty wars. But he found that behind all his involvement were the clever traps of Satan.When seeming mischance placed him in Hell, Mym organized a great rebellion among the Damned. And Satan seemed to capitulate. But free again, Mym learned that Satan had been busy stirring up riots and war. Now it seemed things had gone too far and Satan must surely win. There was only one desperate chance. . . .",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Being a Green Mother (Book Five of Incarnations of Immortality)",
        "Authors": "By Anthony, Piers",
        "Description": "Orb had a rare gift--the magic which manifested whenever she sang or played her harp. No one could resist her music. But she knew that greater magic lay in the Llano, the mystic music that controlled all things. The quest for the Llano occupied Orb's life. Until she met Natasha, handsome and charming, and an even finer musician. But her mother Niobe came as an Aspect of Fire, with the news that Orb had been chosen for the role of Incarnation of Nature--The Green Mother. But she also warned of a prophecy that Orb was to marry Evil. Could she be sure that Natasha was not really Satan, the Master of Illusion, laying a trap for her...?",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Abnormal Psychology: An Experimental Clinical Approach",
        "Authors": "By Davison, Gerald C., Neale, John M.",
        "Description": "A new edition of the bestselling undergraduate text for courses in abnormal psychology. Continues its strong research and clinical emphases, with new cases added to the revision. New or expanded coverage is provided on cognitive behavior therapy, psychoanalytic therapy, borderline and narcissistic personality disorders, panic disorders, PTSD, type A, depression, cardiovascular disorders, bulemia, and agoraphobia.",
        "Category": "",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Romeo and Juliet (Cambridge School Shakespeare)",
        "Authors": "By Shakespeare, William and Gibson, Rex (EDT)",
        "Description": "This edition of Romeo and Juliet is part of the Cambridge School Shakespeare series. Like every other play in the series, it has been specially prepared to help all students in schools and colleges.This Romeo and Juliet aims to be different from other editions of the play. It invites you to bring the play to life in your classroom, hall or drama studio through enjoyable activities that will increase your understanding. Actors have created their different interpretations of the play over the centuries. Similarly, you are encouraged to make up your own mind about Romeo and Juliet, rather than having someone else's interpretation handed down to you.Cambridge School Shakespeare does not offer you a cut-down or simplified version of the play. This is Shakespeare's language, filled with imaginative possibilities. You will find on every left-hand page: a summary of the action, an explanation of unfamiliar words, a choice of activities on Shakespeare's language, characters and stories.Between each act and in the pages at the end of the play, you will find notes, illustrations and activities. These will help to increase your understanding of the whole play.",
        "Category": " Literary Criticism , Shakespeare",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Iliad (Dover Thrift Editions: Literary Collections)",
        "Authors": "By Butler, Samuel (TRN)",
        "Description": "Probably composed in the eighth century B.C. and based on an actual historical event of the thirteenth century B.C., Homer's Iliad is one of the great epics of the Western world. The poem unfolds near the end of the ten-year-long Trojan War, detailing the quarrel between the great warrior-hero Achilles and King Agamemnon, the battle between Paris and Menelaus for Helen of Troy, the Greek assault on the city and the Trojan counterattacks, the intervention of the gods on the part of their favorites, and numerous other incidents and events.Vast in scope, possessing extraordinary lyricism and poignancy, this time-honored masterpiece brilliantly conveys the inconsistencies of gods and men, the tumultuous intensity of conflict, and the devastation that results from war. This inexpensive edition reproduces the celebrated Samuel Butler prose translation, admired for its simple, unadorned style, clarity, and readability.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "M. C. Higgins, the Great",
        "Authors": "By Hamilton, Virginia",
        "Description": "As a slag heap, the result of strip mining, creeps closer to his house in the Ohio hills, fifteen-year-old M. C. is torn between trying to get his family away and fighting for the home they love.",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Seven Spears of the W'Dch'Ck",
        "Authors": "By Fenn, Lionel",
        "Description": "Longing to fight to preserve truth and justice, Jerico Dove embarks upon an irreverent journey to recover the Seven Holy Spears of the W'dch'ck and save the day",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Diner: The Best of Casual American Cooking (The Casual Cuisines of the World)",
        "Authors": "By Worthington, Diane Rossen and Rosenberg, Allan",
        "Description": "Offers recipes for classic American dishes commonly served at diners, including meat loaf, chicken pot pie, creamed spinach, and strawberry cheesecake",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Back in The Day 101 Things everyone used to know how to do.",
        "Authors": "By Powell, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Gusto Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Difficult People at Work",
        "Authors": "By Arthur H. Bell",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "If I Were in Charge of the World and Other Worries: Poems for Children and their Parents",
        "Authors": "By Viorst, Judith",
        "Description": "If you've ever had trouble apologizing or keeping a secret, had a crush or a broken heart, there's a poem here for you! Written with humor and understanding, Judith Viorst's poems are certain to delight children and adults alike -- and be read again and again.",
        "Category": " Juvenile Nonfiction , Poetry , Humorous",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "You're Officially a Grown-up: The Graduate's Guide to Freedom, Responsibility, Happiness, and Personal Hygiene",
        "Authors": "By Viorst, Judith and Preiss-Glasser, Robin (ILT)",
        "Description": "The perfect graduation gift: a wry look at the pleasures and anxieties of leaving home, penned with Judith Viorst's trademark blend of insight and humor.Millions of young people grew up with Viorst's bestselling children's book Alexander and the Terrible, Horrible, No Good, Very Bad Day. Now they can take her tongue-in-cheek advice for the next stage in their lives. Warm, funny, compassionate, and reassuring, You're Officially a Grown-Up describes -- in verse and illustrations -- all those terrifying but eagerly anticipated freedoms that go hand in hand with venturing out on your own and trying to make your way in the world.Ranging from the quandaries of giving up room, board, and the keys to the Ford to the thrills of playing by your own rules, Viorst will touch a nostalgic chord in those \"official\" grown-ups who have loved her other books about life's milestones. This special keepsake -- written from a loving parent's perspective -- is just the ticket high school and college graduates need for a one-way passage to adulthood.",
        "Category": " Humor , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Christmas Favorites With Audio CD: Your Favorite Holiday Music in Words, Pictures, and Audio",
        "Authors": "By Sourcebooks, Inc.",
        "Description": "Presents lyrics, music scores, and background information for seventeen Christmas songs, together with an audio CD featuring a combination of choral and instrumental pieces.",
        "Category": " Young Adult Nonfiction , Holidays & Celebrations",
        "Publisher": "Sourcebooks Mediafusion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Tomie dePaola's Mother Goose Favorites (Reading Railroad)",
        "Authors": "By dePaola, Tomie",
        "Description": "Presenting a delightful collection of children's favorite Mother Goose rhymes, illustrated with full-color paintings by Tomie dePaola. Young readers and their parents will enjoy meeting up with familiar friends, including Old King Cole, Little Bo-Peep, Jack and Jill, and many more in a book that is sure to be a story-hour favorite.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "It's Not Easy Being a Bunny (Beginner Books(R))",
        "Authors": "By Sadler, Marilyn and Bollen, Roger (ILT)",
        "Description": "This Beginner Book starring P.J. Funnybunny is a bunny-rific tale of discovery!Meet P. J. Funnybunny in this humorous and touching Beginner Book by Marilyn Sadler and Roger Bollen. It’s Not Easy Being a Bunny tells the “tail” of P.J. and his quest to become something other than what he is. Is it more fun to be a bear, a bird, or a pig? Read along as P.J. tries to determine who he is—and where he belongs. Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning.\"Sick of being a bunny, P. J. Funnybunny takes off to become a bear. Hibernation gets dull, so he tries being a bird. And so it goes, with beavers, pigs, possums, and skunks—till P. J. realizes that bunnyhood is for him. The short, repeating text is ideal for beginners and the bright, humorous cartoons will get immediate attention.\" —School Library Journal.",
        "Category": " Juvenile Fiction , Animals , Rabbits",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Wheels on the Bus (Raffi Songs to Read)",
        "Authors": "By Raffi and Wickstrom, Sylvie Kantorovitz (ILT)",
        "Description": "Illus. in full color. \"With a jovial bus driver as host, readers have quite a ride ahead of them as the bus bounces through what appears to be a French town. In her first book the artist humorously injects the familiar song with cheerful new life.\"--Horn Book.",
        "Category": " Juvenile Nonfiction , Music , Songbooks",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Time of Wonder (Picture Puffins)",
        "Authors": "By McCloskey, Robert",
        "Description": "Winner of the Caldecott Medal! For fans of Blueberries for Sal, One Morning in Maine, and Make way for Ducklings.\"Out on the islands that poke their rocky shores above the waters of Penobscot Bay, you can watch the time of the world go by, from minute to minute, hour to hour, from day to day . . .\" So begins this classic story of one summer on a Maine island from the author of One Morning in Maine and Blueberries for Sal. The spell of rain, the gulls and a foggy morning, the excitement of sailing, the quiet of the night, the sudden terror of a hurricane, and, in the end, the peace of the island as the family packs up to leave are shown in poetic language and vibrant, evocative pictures.",
        "Category": " Juvenile Fiction , Concepts , Seasons",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "My Mother Always Used to Say...",
        "Authors": "By Tochter, Anna",
        "Description": "",
        "Category": " Family & Relationships , General",
        "Publisher": "HarperCollinsPublishers PTY Limited",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Morocco: Past and Present",
        "Authors": "By Milan, C. T. M. (TRN) and Barosio, Guido",
        "Description": "",
        "Category": " Travel , Pictorials",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Christmas Book: A Treasury of the Sights, Sounds, Crafts, Tastes, and Joys of the Season/05660",
        "Authors": "By Shakery, Karin (EDT)",
        "Description": "Discusses the traditional ways to celebrate Christmas and explains how to create a variety of Christmas decorations and gifts",
        "Category": " Social Science , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "HO! HO! HO! (Sidesplitters)",
        "Authors": "By Kingfisher Publications (EDT)",
        "Description": "This hilarious collection of festive jokes is sure to have children in stitches over the Christmas holidays. There are more than 150 seasonal jokes, featuring riotous reindeer, silly snowmen, and preposterous presents. The wide range of jokes will add laugh-out-loud fun to any holiday gathering. An ideal stocking stuffer, this book will make Christmas merrier than ever before!",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "American Songbook",
        "Authors": "By Amsco Publications",
        "Description": "",
        "Category": "",
        "Publisher": "Hal Leonard Corporation",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Four Seasons Of The Chesapeake Bay  Volume I  Spring-Summer Edition",
        "Authors": "By Hamer, Red and Barbara H. Hamer",
        "Description": "",
        "Category": "",
        "Publisher": "Four Seasons Book Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Merry Christmas, Stinky Face",
        "Authors": "By McCourt, Lisa and Moore, Cyd (ILT)",
        "Description": "It's Christmastime, and Stinky Face is worried! A paperback edition  of the third book in the popular Stinky Face series.\"What if Santa's lips get chapped?\" Stinky Face asks. \"What if the sack of toys starts to rip?\"As always, Mama lovingly addresses each and every one of her child's concerns. But as an extra safety measure, Stinky Face leaves Santa lip balm and duct tape.\"Cheerful, lighthearted images compound the humor readers will derive from Stinky Face's anxieties.\"                                                               --Horn Book Guide",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Runaway Ralph",
        "Authors": "By Cleary, Beverly and Darling, Louis (ILT)",
        "Description": "Newbery Medal-winning author Beverly Cleary ramps up the humor and adventure in the second book in the Ralph Mouse series. With a motorcycle to rev and the open road to see, Ralph S. Mouse is itching to run away from his overprotective family! But once he escapes to a summer campground nearby, the horrors of the wild make him doubt his plan. Angry cats, scary watchdogs, and grouchy gophers are only the half of it...But then he befriends Garf, a sad and friendless boy at the camp. Though he wants desperately to be back home with his relatives, Ralph realizes that he may need to help Garf before he can help himself.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "How to Write & Sell Your First Novel",
        "Authors": "By Collier, Oscar and Leighton, Frances Spatz",
        "Description": "Offers advice on genre selection, characters, dialogue, plot, writing habits, revision, manuscript submission, agents, contract negotiation and publicity, and shares the stories of first-time novelists",
        "Category": "",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "New Clues to Harry Potter Book 5: Hints from the Ultimate Unofficial Guide to the Mysteries of Harry Potter",
        "Authors": "By Waters, Galadriel, Mithrandir, Astre, and Fossa, E. L.",
        "Description": "A guide to J.K. Rowling's fifth Harry Potter book provides hints about the novel and suggests secret subplots for future volumes.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Wizarding World Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "American Academy of Pediatrics Caring For Your Teenager",
        "Authors": "By Bashe, Philip and Greydanus, Donald E.",
        "Description": "Expert, authoritative guidance you can trust on helping your teenager cope with the changes and challenges of adolescence, from The American Academy of Pediatrics.The critical, life-shaping years between twelve and twenty-one have been called the “turbulent teens.” But adolescence doesn’t have to be a time of anxiety and upheaval--for either teenagers or their parents. In this comprehensive, down-to-earth guide, the nation’s leading authority on the care of children helps parents and caregivers guide teenagers through the successful transition into young adulthood. Combining practical parenting advice with the latest medical, psychological, and scientific research, and covering every aspect of a teenager’s growth and development, the American Academy of Pediatrics’ Caring for Your Teenager offers indispensable information on:• The stages of adolescence--what defines normal physical, emotional, social, and intellectual development• Setting rules and limits--helping teenagers grow into responsible adults• The twelve building blocks of self-esteem--from feelings of security and belonging to decision making, pride, and trust• Instilling values and strengthening family ties• The problem of peer pressure: giving your child the confidence to handle it• Hormones--easing teenagers’ anxieties about their changing bodies• Safeguarding your teenager from sexually transmitted diseases• Adapting to different family types--from single-parent to adoptive to blended• Helping your teenager cope with serious illness or death in the family, sibling rivalry, separation, or divorcePlus• Helping your teenager find the right college--or make an alternative choice• Teens, the Internet, and the law• A comprehensive medical guide to common ailments . . . and much moreCaring  for Your Teenager is the one guide that no one entrusted with the care of a teenage child should be without--a book that provides parents with all the information they need to ensure that their child is on the right track to becoming a happy, healthy adult.",
        "Category": " Family & Relationships , Life Stages , Adolescence",
        "Publisher": "Bantam",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Win Before You Buy: Inside the Stock Market",
        "Authors": "By Fraser, Scott S.",
        "Description": "",
        "Category": "",
        "Publisher": "Contrarian Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Living Proof: The Exciting Story of Vietnam Hero Lt. Clebe McClary",
        "Authors": "By Clebe McClary, Diane Barker",
        "Description": "",
        "Category": "",
        "Publisher": "Cross Roads Books, Inc.",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Praying for Purpose for Women: A Prayer Experience That Will Change Your Life Forever (Pathway to Purpose)",
        "Authors": "By Brazelton, Katherine",
        "Description": "This 60-day prayer experience can change a woman's life forever. Sixty influential Christian women---such as author Liz Curtis Higgs; author Ruth Graham, daughter of evangelist Billy Graham; singer and songwriter Babby Mason; and author Kay Warren, wife of Pastor Rick Warren--- share how their lives have changed. This book can be used by itself as a daily devotional. However, if women read through Praying for Purpose as a devotional while reading Pathway to Purpose, their whole experience will be deepened and solidified.",
        "Category": " Religion , Prayer",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Graveyard of the Atlantic: Shipwrecks of the North Carolina Coast",
        "Authors": "By Stick, David and Stick, Frank (ILT)",
        "Description": "This is a factual account, written in the pace of fiction, of hundreds of dramatic losses, heroic rescues, and violent adventures at the stormy meeting place of northern and southern winds and waters -- the Graveyard of the Atlantic off the Outer Banks of North Carolina.",
        "Category": " History , United States , General",
        "Publisher": "The University of North Carolina Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Tao of Parenting: The Ageless Wisdom of Taoism and the Art of Raising Children",
        "Authors": "By Nagel, Greta",
        "Description": "Applying the ancient yet timeless 81 principles of Taoism to parenting, The Tao Of Parenting features instructive anecdotes from four families to demonstrate how Taoist teachings help parents raise good, healthy children. The stories are just as diverse as the families who tell them (a blended family featuring children from separate marriages, a couple with different cultural and ethical backgrounds, a single parent of twin boys, and a couple with different parenting techniques learning to compromise).Some of the Taoist principles used by these families include:*Do Not Think of Self.  Shows the rewards parents receive by making their children their number one priority.*The material is fleeting, the spiritual is everlasting. Demonstrates the rewards of caring for those in need.*Do Not Be Authoritarian.  Shows how to foster self-reliance and responsibility in children while supporting their efforts, rather than controlling their every move.*Follow the middle road; it is the heart of knowing. Offers the benefits of parents being neither too permissive or too strict, but rather adjusting the rules for each child and each circumstance.There are many more valuable lessons in this special book which can be used by parents of all faiths to help guide their lives and those of their children.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Bread Machine Magic: 139 Exciting New Recipes Created Especially for Use in All Types of Bread Machines",
        "Authors": "By Rehberg, Linda, Conway, Lois, and Simmons, Lois (ILT)",
        "Description": "Features recipes for deli rye, San Francisco sourdough, Black Forest pumpernickel, Irish soda bread, zucchini carrot bread, and more",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The Everything Blackjack Strategy Book: Surefire Ways To Beat The House Every Time",
        "Authors": "By Weiss, Sonia and Hagen, Tom",
        "Description": "Expert player Tom Hagen and author Sonia Weiss guide you through the basic rules, and reveal the surprisingly easy tricks the casinos don't want you to know. Whether you're counting cards or doubling down, you'll master the intricate techniques you need to win-putting the odds in your favor every time!The Everything Blackjack Strategy Book includes:Complete rules for blackjack and its many variationsBasic and complex strategies including surrendering, entering early, and insurance Tips for playing onlineTricks for understanding odds and probabilityGuidelines for casino etiquetteHints for tournament playWhether you're an amateur or a pro, The Everything Blackjack Strategy Book will give you the advantage, skill, and confidence you need to beat the house every time!",
        "Category": " Games & Activities , Card Games , Blackjack",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Everyday Writer",
        "Authors": "By Lunsford, Andrea A. and Horowitz, Franklin E.",
        "Description": "Students write every day and everywhere — for school, for work, and for fun. And nobody else in the field of composition understands the real world of student writing better than Andrea A. Lunsford. Her trademark attention to rhetorical choice, language and style, and critical thinking and argument — based on years of experience as a researcher and classroom teacher — make The Everyday Writer the tabbed handbook that can talk students through every writing situation. But wait — there’s more! New research into student writing now informs every page of the new edition…and with expanded, more visual coverage of the writing process, research and documentation, and writing in the disciplines, today’s Everyday Writer prepares students more than ever for everyday writing challenges — from managing a research project to writing on a Facebook wall. The Everyday Writer with Exercises is now available, too.",
        "Category": " Language Arts & Disciplines , Authorship",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "deathgame [ the hardy boys]",
        "Authors": "By Dixon, Franklin W.",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Snow (I Can Read It All By Myself)",
        "Authors": "By Eastman, P. D. and McKie, Roy",
        "Description": "An easy reader about the joys of playing in the snow!This classic Beginner Book edited by Dr. Seuss is a delightful ode to winter. Brrrrr—it snowed! From snowball fights and skiing to fort building and snowman-making, P. D. Eastman and Roy McKie’s Snow will have young readers eager for the kind of fun only a wintry-white day can bring. Perfect for enjoying with a cup of hot cocoa, it makes an ideal gift for the holidays, and happy occasions of all kinds! Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning.\"Joyful verse relates the many ways to enjoy snow. First graders will love it.\"--Chicago Tribune.",
        "Category": " Juvenile Fiction , Nature & the Natural World , Weather",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1962"
        }
    },
    {
        "Title": "The Danish Girl: A Novel",
        "Authors": "By Ebershoff, David",
        "Description": "Now an Academy Award-winning major motion picture, starring Academy Award-winners Eddie Redmayne and Alicia Vikander and directed by Academy Award-winner Tom Hooper   National Bestseller * A New York Times Notable Book * Winner of the Lambda Literary Award for Transgender Fiction * Winner of the Rosenthal Foundation Award from the American Academy of Arts and Letters * Finalist for the New York Public Library Young Lions Award * Finalist for the American Library Association Stonewall Book AwardLoosely inspired by a true story, this tender portrait of marriage asks: What do you do when the person you love has to change?  It starts with a question, a simple favor asked by a wife of her husband while both are painting in their studio, setting off a transformation neither can anticipate.  Uniting fact and fiction into an original romantic vision, The Danish Girl eloquently portrays the unique intimacy that defines every marriage and the remarkable story of Lili Elbe, a pioneer in transgender history, and the woman torn between loyalty to her marriage and her own ambitions and desires.  The Danish Girl’s lush prose and generous emotional insight make it, after the last page is turned, a deeply moving first novel about one of the most passionate and unusual love stories of the 20th century.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Penguin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Lost Continent: Travels in Small-Town America",
        "Authors": "By Bryson, Bill",
        "Description": "When a native of Iowa returns from England to wander across America's heartland in search of the perfect small town, the result is a string of hilarious anecdotes and biting social commentary",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Displaying Pictures and Photographs",
        "Authors": "By Clifton-Mogg, Caroline and Feetham, Piers",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "In Self-Defense (Hardy Boys Case File 45): In Self-Defense",
        "Authors": "By Dixon, Franklin W.",
        "Description": "Frank and Joe Hardy investigate when danger threatens Bayport's new self-defense school and find themselves up against a ruthless real-estate developer out to buy the building in which the school is located",
        "Category": "",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Forward the Mage (Joe's World)",
        "Authors": "By Flint, Eric, Roach, Richard, and Baen, James P. (EDT)",
        "Description": "Arriving in Goimr to pursue his career as an artist, Benvenuti finds himself caught up in a bizarre quest to uncover the meaning of the king's nightmare, accompanied by the sorcerer Zulkeh and by Gwendolyn, a gorgeous Amazon. Reprint.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Whale Done! The Power of Positive Relationships",
        "Authors": "By Blanchard, Kenneth H., Ballard, Jim, Lacinak, Thad, and Tompkins, Chuck",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Complete Beauty Bible: The Ultimate Guide to Smart Beauty",
        "Authors": "By Begoun, Paula",
        "Description": "",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Your Divorce Advisor : A Lawyer and a Psychologist GuideYou Through the Legal and Emotional Landscape of Divorce",
        "Authors": "By Mercer, Diana and Pruett, Marsha Kline",
        "Description": "A lawyer and a psychologist offer a groundbreaking divorce strategy that protects both your finances and your family.From your first thought of divorce through the final paperwork, Your Divorce Advisor takes you step by step toward a divorce that dissolves the marriage but not your dignity, your sense of family, or your financial security. Whether you hire a lawyer or a mediator, or do it yourself, this practical, direct, and empowering guide offers you the wise counsel you need for both the legal and the emotional processes of ending your marriage. Your Divorce Advisor shows you how to: -Keep a healthy perspective that leads to a successful legal strategy and recognize when emotions threaten your case -Protect your assets without destroying your family Offering: -Detailed coverage of all your legal options and guidance through every legal step, including anticipating the emotional repercussions of your decisions -More information on custody than any other divorce book, including age-appropriate custody schedules -A sample divorce agreement explained one paragraph at a time Your Divorce Advisor helps you set yourself and your family on a positive course toward a new life.",
        "Category": " Psychology , Emotions",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Children's Christmas Stories and Poems: In Easy-to-Read Type (Dover Children's Thrift Classics)",
        "Authors": "By Stewart, Pat Ronson (ILT) and Ward, Candace (EDT)",
        "Description": "Here is a choice collection of favorite stories and poems filled with the Christmas spirit, perfect for children, their families, and friends to enjoy together at holiday time. It includes Charles Dickens's own abridgment of A Christmas Carol, O. Henry's poignant story \"The Gift of the Magi,\" and Clement Clarke Moore's beloved poem \"A Visit from St. Nicholas.\" The story of the first Christmas as told in the gospel of St. Luke (King James version) is here, too, along with Albert Bigelow Paine's delightful animal story \"Christmas the the Hollow Tree Inn,\" and the touching editorial reply in the New York Sun to 8-year-old Virginia O'Hanlon's question, \"Is there a Santa Claus?\" For good measure, there are lyrics to traditional songs and carols, among them \"Away in a Manger,\" \"The Twelve Days of Christmas,\" \"Jingle Bells,\" and three more. Ideal as a stocking stuffer, this volume is a perfect sampler of Christmas reading for children.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2011"
        }
    },
    {
        "Title": "Simone De Beauvoir And Jean-paul Sartre: The Remaking Of A Twentieth-century Legend",
        "Authors": "By Fullbrook, Kate and Fullbrook, Edward",
        "Description": "He was France's best-known philosopher and chief arbiter of intellectual fashions during the postwar era. She was the most influential forerunner of today's feminist movement, who nonetheless seemed to live in the shadow of a great man. So goes one of the great cultural legends of our time. The only problem, as Kate and Edward Fullbrook point out in this beautifully written and meticulously researched portrait, is that it is wrong.Using newly available documentary evidence from diaries and letters, the authors shed astonishing new light on precisely who was the dominant partner in this relationship.By carefully tracing the dates of composition of some of Beauvoir's and Sartre's major works, the Fullbrooks demonstrate that Beauvoir, rather than Sartre, was the primary creative influence behind the couple's most celebrated ideas. In writing his acclaimed Being and Nothingness, Sartre acted primarily as an interpreter of a philosophical system already worked out in Beauvoir's novel, She Came To Stay.This astonishing discovery is at the heart of the Fullbrooks' absorbing account of Beauvoir's and Sartre's childhoods and their first twenty years together as a couple who changed the intellectual outlook of the world. By reworking the chronologies of the couple's writings and rereading old information in light of the new, the Fullbrooks arrive at a revisionary account of the couple's intimate lives, whose radical sexual freedom must now be understood as stemming from Beauvoir's rather than from Sartre's personal needs.The book provides decisive insights into the lives, literature, and ideas of two major figures on the modern cultural scene, and raises profound questions as to the psychological needs, sexual politics, and bad faith that led Beauvoir and Sartre to give misleading accounts of the inner workings of their relationship. Kate and Edward Fullbrook have written a book destined to be widely discussed and hotly debated.",
        "Category": " Biography & Autobiography , Philosophers",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    }
]