[
    {
        "Title": "Cinders & Smoke: A Mile By Mile Guide for the Durango to Silverton Narrow Gauge Trip",
        "Authors": "By Osterwald, Doris B.",
        "Description": "",
        "Category": "",
        "Publisher": "Western Guideways",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Women of the Andes: Patriarchy and Social Change in Two Peruvian Towns (Women And Culture Series)",
        "Authors": "By Bourque, Susan C.",
        "Description": "Pilar is a capable, energetic merchant in the small, Peruvian highland settlement of Chiuchin. Genovena, an unmarried day laborer in the same town, faces an impoverished old age without children to support her. Carmen is the wife of a prosperous farmer in the agricultural community of Mayobamba, eleven thousand feet above Chiuchin in the Andean sierra. Mariana, a madre soltera—single mother—without a husband or communal land of her own, also resides in Mayobamba.These lives form part of an interlocking network that the authors carefully examine in Women of the Andes. In doing so, they explore the riddle of women’s structural subordination by analyzing the social, political, and economic realities of life in Peru. They examine theoretical explanations of sexual hierarchies against the backdrop of life histories. The result is a study that pinpoints the mechanisms perpetuating sexual repression and traces the impact of social change and national policy on women’s lives.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "University of Michigan Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "Arlington Heritage: Vignettes of a Virginia County",
        "Authors": "By Templeman, Eleanor Lee Reading",
        "Description": "",
        "Category": "",
        "Publisher": "Privately printed",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Mexico and Peru Myths and Legends (Myths and Legends Series)",
        "Authors": "By Spence, Lewis",
        "Description": "",
        "Category": "",
        "Publisher": "Senate",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Letters to a Friend: The Correspondence Between T.H. White and L. J.",
        "Authors": "By White, T. H.",
        "Description": "Presents a selection of the correspondence between White and L. J. Potts, the author's mentor, advisor, critic, and devoted friend from White's second year at Cambridge to the end of Potts's life",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Putnam Pub Group",
        "Price Starting With ($)": "19.7",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Ireland: A Novel",
        "Authors": "By Delaney, Frank",
        "Description": "From a land famous for storytelling comes an \"absolute masterpiece\"* -- an epic novel of Ireland that captures the intimate, passionate texture of the Irish spirit.One wintry evening in 1951, an itinerant storyteller -- a Seanchai, the very last practitioner of a fabled tradition extending back hundreds of years -- arrives unannounced at a house in the Irish countryside. In exchange for a bed and a warm meal, he invites his hosts and some of their neighbors to join him by the fireside, and begins to tell formative stories of Ireland's history. One of his listeners, a nine-year-old boy, grows so entranced by the story-telling that, when the old man leaves abruptly under mysterious circumstances, the boy devotes himself to finding him again.Ronan's search for the Storyteller becomes both a journey of self-discovery and an immersion into the sometimes-conflicting histories of his native land. As the long-unspoken secrets of his own family begin to reveal themselves, he becomes increasingly single-minded in pursuit of the old man, who he fears may already be dead. But Ronan's personal path also leads him deeper and deeper into the history and mythology of Ireland itself, in all its drama, intrigue, and heroism.Ireland travels through the centuries, interweaving Ronan's quest for the Storyteller with a richly evocative unfolding of the great moments in Irish history, ranging from the savage grip of the Ice Age to the green andtroubled land of tourist brochures and political unrest. Along the way, we meet foolish kings and innocent monks, fabled saints and great works of art, shrewd Normanraiders, strong tribal leaders, poets, politicians, and lovers. Each illuminates the magic of Ireland and the eternal connection of its people to the land.A sweeping novel of huge ambition, Ireland is the beautifully told story of a remarkable nation. From the epic sweep of its telling to the precision of its characters -- great and small, tragic and comic -- it rings with the truth of a writer passionate about his country and in full command of his craft.* Jack Higgins",
        "Category": " Fiction , Historical , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Abraham Lincoln Mystic Chords Of Memory A Selection from Lincoln's Writings",
        "Authors": "By Shapiro, Larry (Edited)",
        "Description": "",
        "Category": "",
        "Publisher": "Book of the Month Club",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Almost a Princess (The Men from Special Branch)",
        "Authors": "By Thornton, Elizabeth",
        "Description": "From nationally bestselling author Elizabeth Thornton comes a sensuous new tale of true love and fiery romance—under the most intriguing of circumstances.Case Devere, the steely-eyed earl of Castleton, has agreed to help Special Branch track down a notorious killer—one who just happens to be his archenemy. But he finds more than he bargained for when his search leads him to Jane Mayberry, a beautiful bluestocking passionately devoted to the cause of women’s rights—and to protecting her privacy.  As irresistible as she is uncooperative, the spirited Jane arouses Case’s interest—as well as his worst suspicions—when she quietly disappears.  Determined to find the one woman who may hold the key to his investigation—and to his heart—Case goes after her.Though their sparring belies an attraction too powerful to deny, Jane knows there can never be anything between herself and the strong-willed earl. For she bears a dark and terrifying secret that must remain hidden—even at the cost of a broken heart. As Case fights for the love of the one woman who has ever mattered to him, they are swept into a deadly game by a killer who won’t stop until he has punished them both.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Most Beautiful Gift: A Christmas Story",
        "Authors": "By Snow, Jonathan",
        "Description": "Snow! Seven-year-old Mark is entranced by it! Could the snow be coming from a snow machine in the sky? Quick as you please, Mark runs outside to see. As he looks up, a tiny snowflake drifts onto his nose. It is so pretty that it must be ... The Most Beautiful Gift.This is the wondrous tale of Mark and his snowflake. As he handles the delicate flake with extreme care, Mark is amazed by its exquisitely lacy shape. Then and there, he decides to give it to the kindest person he can find; a gift for someone who deserves it.First Mark takes it to a businessman, who wants to dissect it so that he can sell the pieces for profit. Then he takes it to a doctor, but the doctor wants to cut it up to for scientific reasons. And so Mark turns elsewhere. In his quest to do right by the snowflake, he will discover some amazing things about its magical spirit ... and about the true value and meaning of Christmas.Enchantingly told, this charming book is the perfect holiday gift: a heartwarming fable for all ages to be treasured by young and old - parents, children, and friends alike.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "8 Minutes in the Morning to Lean Hips and Thin Thighs",
        "Authors": "By Cruise, Jorge",
        "Description": "Lose up to 4 inches from your hips and thighs in less than 4 weeks-- guaranteed! Have you had a hard time shedding the fat and cellulite from your hips and thighs? Now, whether you're new to the Jorge Cruise weight-control plan or not, 8 Minutes in the Morning to Lean Hips and Thighs will help you lose up to 4 inches in less than 4 weeks-- guaranteed! The Jorge Cruise secret is to restore your metabolism by creating new lean muscles that burn fat and shrink the size of your hips and thighs. Each day you'll do a simple Cruise Move routine that sculpts your hips and thighs and takes just 8 minutes. You'll also get a delicious meal plan with the essential muscle-making materials you'll need to create your new body. All with NO counting of calories or banning of foods. Empowering visualizations will help you conquer the emotional eating that may be sabotaging your efforts.Success stories from Jorge Cruise clients will help keep you inspired. You have nothing to lose except inches from your hips and thighs!\"When I was a kid, I was called 'Thunder Thighs.' NOW, I'm working to have Thinner Thighs!\"--Eleanor Talbot (lost 14 inches from her thighs!)\"I've truly changed my lifestyle for the better.\"--Cheryl McCowan (shrunk 3 1/2 inches off her thighs!)\"My thighs have always been a trouble zone for me, and now I have the tools to zap them!\"--Bonnie Barrett (lost 4 inches from her thighs!)",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Ulysses S. Grant: An Album",
        "Authors": "By McFeely, William S. and Giordano, Neil",
        "Description": "Acclaimed historian William S. McFeely has assembled a dramatic collection of photographs that reveals the people, places, and events that shaped the life of one of the towering figures of American history. Treating seven aspects of Grant's life (1822-1885), McFeely gives us both the private man and the public figure. Grant's view on slavery, his love life, the houses he lived in, his understanding of war—particularly the Civil War—and the trip around the world that he and his wife Julia took (with remarkable illustrations made at the time) are all here. We watch photographers create a hero out of an obscure officer and enhance our understanding of Grant's remarkable Personal Memoirs. A beautiful volume, essential for the library of any Civil War buff, this book offers a wealth of images that illuminate the man and his times in a way that words alone cannot.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Ansel Adams",
        "Authors": "By Pritzker, Barry",
        "Description": "",
        "Category": "",
        "Publisher": "JG Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "A History of Costume (Dover Fashion and Costumes)",
        "Authors": "By Kohler, Karl",
        "Description": "Egypt, Babylon, Greece up through 19th-century Europe; based on surviving pieces, art work, much more. Includes many clear, measured patterns for reproducing historic costumes. Full text. 595 illustrations. \"Landmark in the field of Western European costume . . . exceptional value for its price.\" — American Artist.",
        "Category": " Antiques & Collectibles , Textiles & Costume",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1963"
        }
    },
    {
        "Title": "The Extra Mile: Rethinking Energy Policy for Automotive Transportation (A Twentieth Century Fund Book)",
        "Authors": "By Crandall, Robert W. and Nivola, Pietro S.",
        "Description": "In the United States, proposals for gasoline tax hikes have consistently met with broad-based congressional opposition. Although such taxes are a common and effective method of conserving energy in other industrialized nations, U.S. policy has traditionally relied on regulatory programs rather than fuel taxes to promote energy efficiency in automotive transportation. This book examines both the political causes and the economic effects of this idiosyncratic policy preference.Moderating the consumption and importation of oil has been an explicit goal of the United States over the past twenty years. Pietro S. Nivola and Robert W. Crandall argue that a higher levy on gasoline would be a more efficient way of achieving this goal than current automotive fuel economy standards. In fact, they find that an additional excise of less than twenty-five cents per gallon over the past dozen years would have conserved more oil than has the existing policy of administering gas mileage requirements for new passenger vehicles. And such a tax, they maintain, would not be as detrimental to the economy as opponents fear, nor as regressive as they claim.Why, then, is there such a strong national resistance to a fuel tax in the United States? And why is there less resistance in other countries? The authors examine the development of motor-fuel excises in Great Britain, France, Germany, Japan, and Canada, and explain the historical and political factors that have led to different national policy orientations.Turning their attention back to the United States, Nivola and Crandall show how regulatory measures have fallen short of their goal and why political barriers to bolder taxation of gasoline remain formidable. They conclude by offering suggestions for new directions in U.S. energy policy at the federal, state, and local level.",
        "Category": " Political Science , Public Policy , Environmental Policy",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The new college French & English dictionary",
        "Authors": "By Steiner, Roger J.",
        "Description": "",
        "Category": "",
        "Publisher": "Amsco School Publications",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Washington historic landmarks: Pillars of patriotism",
        "Authors": "By Somerville, Mollie D",
        "Description": "",
        "Category": "",
        "Publisher": "National Society, Daughters of the American Revolution",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Military Technology/#07575",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Bookthrift Co",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "William Carlos Williams and James Laughlin: Selected Letters",
        "Authors": "By Williams, William Carlos",
        "Description": "This volume chronicles the correspondence between William Carlos Williams, a Pullitzer Prize-winning American poet, and his publisher, James Laughlin, the founder of \"New Directions\".",
        "Category": " Music , History & Criticism",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Lincoln Murder Conspiracies",
        "Authors": "By Hanchett, William",
        "Description": "Clears up misconceptions spread by various conspiracy theories, recounts the factual evidence concerning Lincoln's assassination, and explains why such unproved theories have been so popular",
        "Category": " True Crime , Murder , General",
        "Publisher": "University of Illinois Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "In the Trenches: Selected Speeches and Writings of an American Jewish Activist, 1979-1999",
        "Authors": "By Harris, David A.",
        "Description": "Harris, executive director of the American Jewish Committee since 1990, shares 20 years of experience with the AJC, including working to help Soviet Jewry and his views on the Middle East, other parts of the world, the Holocaust, human rights, international terrorism, making a better America, and the future of American Jewry. His words on anti-Semitism, unsolved bombings in Argentina, and interfaith relations still resonate. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Religion , Judaism , General",
        "Publisher": "Ktav Pub & Distributors Inc",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Tarnished Crown: Princess Diana and the House of Windsor",
        "Authors": "By Holden, Anthony",
        "Description": "The marital troubles of Prince Charles and Princess Diana that have so engrossed the world are only one more downward step in the decline of the position of the royal family, a decline that began with the abdication of King Edward VII in 1936.There have been, and will be, many other books on the erosion of the House of Windsor, but no one is as qualified to chart its disintegration as Anthony Holden, Britain's leading royal commentator for more than a decade. His bestselling biography of the Prince of Wales, published in 1988 to a mixture of acclaim and controversy, was hailed by The Times of London as \"definitive.\" Recent events have proved it remarkably prophetic. Renowned for the shrewdness of his insights, the accuracy of his reporting, and the reliability of his judgments, Mr. Holden argues that the British monarchy must change in order to survive beyond the reign of the incumbent. Even though the Queen has begun to pay taxes, many hard-pressed Britons still consider the monarchy's wealth disproportionate to the times. Following his separation from his popular wife, Prince Charles's prospects for inheriting the throne have been further compromised by the unseemly revelations of taped telephone conversations. What does the long-term future hold for Diana, Princess of Wales? Should the British monarchy surrender its postimperial splendor for the humbler styles of the \"bicycle kings\" of Scandinavia?In these pages Mr. Holden traces the collapse of the \"family\" monarchy, the true extent of the Queen's wealth, and the changing associations between Crown, Church, and Parliament. The author also analyzes the failure of four royal marriagesbesides Charles and Diana's, those of Princess Margaret, Prince Andrew, and Princess Anne - throwing new light on relations between the royals and those they have wed. He also examines the role played by British institutions, from the press to Downing Street, and looks ahead to the twenty-first century. Will Charles step aside in favor of his son William? Or will Britain become a republic with an elected president?In this important and revealing book, Mr. Holden makes the most authoritative contribution to the worldwide debate on the future of the British monarchy.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "The Cambridge Guide to Literature in English",
        "Authors": "By Ousby, Ian and Lessing, Doris May (FRW)",
        "Description": "Substantially enlarged and updated, this new edition of The Cambridge Guide to Literature in English confirms its status as the most authoritative survey of its subject now available in a single volume. Its coverage of novelists, poets, playwrights and their works embraces both the established classics of English literature and a wealth of contemporary figures from all over the English-speaking world, such as Saul Bellow, Adrienne Rich, Les Murray, Wole Soyinka, R. K. Narayan, Janet Frame, Mordecai Richler, Joseph Brodsky, J. M. Coetzee and Ben Okri.Under Ian Ousby's editorship over a hundred contributors provide detailed biographical and critical articles, not only about writers and works of literature, but also about the critics, philosophers, historians and biographers who have influenced or reacted to literature. Substantial coverage is given to popular genres such as science fiction, detective novels and children's literature, with entries on, for example, Dr. Seuss, Margaret Mahy, Roald Dahl, Isaac Asimov, Frederik Pohl, P. D. James and Nicolas Freeling.Other entries range widely over literary groups and movements, critical schools, genres, poetic forms, critical concepts, rhetorical terms, literary terms, theatres and theatre companies. There are also substantive articles on subjects such as copyright, libraries and the English language.With a superb range of illustrations and a comprehensive cross-referencing system, The Cambridge Guide to Literature in English is both an outstanding reference book, and a delightful companion for anyone who enjoys reading.",
        "Category": " Literary Criticism , European , English, Irish, Scottish, Welsh",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "7.86",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Lootas Little Wave Eater: An Orphaned Sea Otter's Story",
        "Authors": "By Meeker, Clare Hodgson and Casson, C. J. (ILT)",
        "Description": "Lootas, Little Wave Eater tells the story of a four-week-old orphaned sea otter that was adopted by the Seattle Aquarium. Color photographs throughout the book show how human handlers raised Lootas, then introduced her to other otters, and finally weaned her from constant human contact. Illustrations help educate young readers about sea otter habitat, food, anatomy, predators, and more. Royalties from sales of this book benefit the Seattle Aquarium's Sea Otter Program.",
        "Category": " Juvenile Nonfiction , Animals , Marine Life",
        "Publisher": "Little Bigfoot",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Fun Factory: Games and Toys from Household Junk",
        "Authors": "By Milne, Lyndsay",
        "Description": "Provides instructions for eighty projects created from everyday items, and information about protecting the environment and recycling",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Little Mermaid (Disney's, 1308)",
        "Authors": "By Jennifer Liberts",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Golf For Dummies (For Dummies Series)",
        "Authors": "By Huggan, John, McCord, Gary, and Costner, Kevin (INT)",
        "Description": "Covers equipment, types of courses, grip, swing, putting, chipping and pitching, common problems, rules, etiquette, and tactics, and lists favorite players and courses",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Night Before the Night Before Christmas",
        "Authors": "By Moore, Clement Clarke, Wing, Natasha, and Lester, Mike (ILT)",
        "Description": "It's December 23, and Christmas is just around the corner. But one family is having trouble getting its act together. Once again, Natasha Wing follows the rhythms and meter of Clement Moore's classic Christmas poem, yet gives it her own entirely original twist.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Traditional Tales From Long, Long Ago",
        "Authors": "By Parragon",
        "Description": "",
        "Category": "",
        "Publisher": "Dempsey Parr",
        "Price Starting With ($)": "7.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Your Outta Control Puppy: How to Turn Your Precocious Pup Into a Perfect Pet",
        "Authors": "By Anderson, Teoti",
        "Description": "",
        "Category": " Pets , Dogs , General",
        "Publisher": "TFH Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Football: A History of the Professional Game (Sports Illustrated)",
        "Authors": "By King, Peter",
        "Description": "A history of the sport covers the best players, teams, games, and coaches",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "20 (Surprisingly Simple) Rules and Tools for a Great Marriage",
        "Authors": "By Stephens, Steve",
        "Description": "Best-selling author Dr. Steve Stephens offers concrete yet simple ways to build marriages today, even when life speeds by at a frantic pace. Along with a prayer to ask for God's help, each chapter offers ideas and tools that make following rules like “Accept Differences,” “Listen Carefully,” and “Compliment Daily” easy. Readers will be surprised at how applying these simple rules can make a good marriage even better . . . or keep a struggling marriage from falling apart.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Tyndale Momentum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Don Worth, Photographs 1955-1985 (Untitled Series No. 40)",
        "Authors": "By Worth, Don (EDT)",
        "Description": "",
        "Category": " Photography , General",
        "Publisher": "Friends of Photography Bookstore",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Covenant: The History of a Biblical Idea (Seminar in the History of Ideas)",
        "Authors": "By Hillers, Delbert R.",
        "Description": "",
        "Category": " History , Ancient , General",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1969"
        }
    },
    {
        "Title": "Art of the Twenties",
        "Authors": "By Lieberman, William",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Museum of Modern Art",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "The Jack Sprat cookbook",
        "Authors": "By Leary, Paris",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Messages from the stars: Communication and contact with extraterrestrial life",
        "Authors": "By Ridpath, Ian",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Looking at the Sun: The Rise of the New East Asian Economic and Political System",
        "Authors": "By Fallows, James M.",
        "Description": "The Western world believes that capitalism has won, that our model of individual enterprise and rights has triumphed. But in East Asia a new system has emerged that challenges the economic principles the West extols. In fact, as James Fallows vividly demonstrates, the theories we embrace to explain how nations rise and fall have prevented us from seeing the true nature of this new system and its enormous impact on us.Skillfully blending history with on-the-ground reportage and astute analysis, Fallows reveals how political goals and historical experience have shaped Japan's economic rise and placed it at the heart of the Asian system. He shows how the explosive growth of Thailand, Malaysia, and Singapore has been fueled by Japanese investment; why Burma, the Philippines, and Vietnam have been largely isolated from the region's progress; and why Korea, Taiwan, and \"Greater China\" are the strongest contenders for future economic dominance.Extraordinary in depth and scope, Looking At the Sun provides the first clear picture of the Asian rise and the magnitude of its challenge to the Western world.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "China, Hong Kong, Taiwan, Inc.: The Dynamics of a New Empire",
        "Authors": "By Kemenade, Willem Van and Webb, Diane",
        "Description": "A Dutch journalist discusses the economic, political, and social implications of the formal reunification of Hong Kong with China, as well as the possible incorporation of Taiwan, examining the prospects for a peaceful union. 25,000 first printing. Tour.",
        "Category": " History , Asia , China",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Ride Together: A Brother and Sister's Memoir of Autism in the Family",
        "Authors": "By Karasik, Judy",
        "Description": "Meet the Karasiks, a typical middle-class 1960s family: one mother, one father, one daughter, and three sons, one of whom, David, has autism.  The Ride Together is an extraordinary family memoir told in alternating chapters of comics and text. With a narrative that stretches over nearly fifty years, Paul and Judy Karasik -- he writes with pictures, she with words -- unite to relate the story of their family, their brother David, and the history of their relationship with him. In doing so, each comes to understand the responsibility David represents and the meaning his life gives theirs.  In the pages of The Ride Together, David grows from child to man, remaining dependent on others, even as he witnesses his siblings leaving home -- and him -- for careers and lives of their own. He speaks in a code of his own; he performs his own versions of The Adventures of Superman and Face the Nation; he writes page after page of television synopses.  What he understands of life and death no one can truly tell, yet David walks through his days with dignity and, as it turns out, endurance.  At first glance the adventure of this book is its brilliant experiment of form -- the story of a brother with autism told in a style that is as unusual as the subject matter. But The Ride Together goes deeper than that: It takes a family that may appear strange to some -- like many families with disabilities -- and reveals a group of people whose acceptance of what life has dealt them helps them persevere through good times and bad.  Praised by writers for its craft and by families for its authenticity, The Ride Together provides a remarkable portrait of a family with a difference.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Every Day's a Party: Louisiana Recipes For Celebrating With Family And Friends",
        "Authors": "By Bienvenu, Marcelle, Willett, Felicia, and Lagasse, Emeril (EDT)",
        "Description": "Emeril takes you through a year's worth of party and festival menus (divided by month) from Super Bowl tailgate to Mardi Gras, from the New Year's Eve to end the millennium to the New Orleans Jazz Fest. In the fun and colorful style that Emeril brings to his Food Network television show Emeril Live and to all his cookbooks, Every Day's a Party is filled with over 125 recipes and Emeril's signature \"kick-it-up-a-notch\" way of making every occasion an over-the-top celebration.You've never had this much fun on President's Day.",
        "Category": " Cooking , Entertaining",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Behavioral and Social Sciences: Achievements and Opportunities",
        "Authors": "By Gerstein, Dean R., Smelser, Neil J., Luce, R. Duncan, and Sperlich, Sonja",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "National Academies Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Wind Power for Your Home : The First Complete Guide That Tells How to Make the Wind's Energy Work For You",
        "Authors": "By Sullivan, George",
        "Description": "",
        "Category": "",
        "Publisher": "CORNERSTONE LIBRARY",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Hark!: A Novel of the 87th Precinct (87th Precinct Mysteries)",
        "Authors": "By McBain, Ed",
        "Description": "00  Ed McBain concocts a brilliant and intricate thriller about a master criminal who haunts the city with cryptic passages from Shakespeare, directing the detectives of the 87th Precinct to a future crime -- if only they can figure out what he means.  The 87th Precinct gets a visit from one of the city's most accomplished criminals -- a thief known as the Deaf Man. Because he might be deaf. Or he might not. So little is known about the man who is harassing Detective Steve Carella with puzzling messages that it is hard to tell. But as soon as a pattern emerges, the detectives of the 87th are forced to hit the books and brush up on their Shakespeare -- because each new clue contains a line from one of his works. Unless they can crack the complicated riddles and beat the Deaf Man at his own cat-and-mouse game, someone is going to end up hurt, or something will be stolen -- or both. It's always so hard to tell with the Deaf Man.   Ed McBain brings his most intelligent and devious criminal back to the 87th Precinct with a richly plotted and literary crime.  Ed McBain concocts a brilliant and intricate thriller about a master criminal who haunts the city with cryptic passages from Shakespeare, directing the detectives of the 87th Precinct to a future crime -- if only they can figure out what he means.  The 87th Precinct gets a visit from one of the city's most accomplished criminals -- a thief known as the Deaf Man. Because he might be deaf. Or he might not. So little is known about the man who is harassing Detective Steve Carella with puzzling messages that it is hard to tell. But as soon as a pattern emerges, the detectives of the 87th are forced to hit the books and brush up on their Shakespeare -- because each new clue contains a line from one of his works. Unless they can crack the complicated riddles and beat the Deaf Man at his own cat-and-mouse game, someone is going to end up hurt, or something will be stolen -- or both. It's always so hard to tell with the Deaf Man.   Ed McBain brings his most intelligent and devious criminal back to the 87th Precinct with a richly plotted and literary crime.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "All the Words You'll Ever Need: A Comprehensive Christian Guide to Writing Grace",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "CrossAmerica Books, Carmel NY",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Little Book of Bathroom Philosophy: Daily Wisdom from the World's Greatest Thinkers",
        "Authors": "By Bergman, Gregory",
        "Description": "Witty, wise, and eminently useful, The Little Book of Bathroom Philosophy gives the lowdown on the world's most famous philosophers, complete with brief biographies, highlights of their major teachings, and lots of quotations that are perfect for sprinkling into toasts and speeches or casually introducing into dinner-party conversation.",
        "Category": " Philosophy , General",
        "Publisher": "Fair Winds Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Under Fire",
        "Authors": "By Griffin, W. E. B.",
        "Description": "June 1, 1950: Captain Ken McCoy's report on probable North Korean hostilities meets with so much bureaucratic displeasure that not only is it promptly suppressed, but McCoy himself is kicked out of the Corps. At least two outfits, however, are not impressed by such infighting: the fledgling CIA, which promptly hires McCoy; and the North Koreans, who on June 25 invade across the 38th parallel. Immediately, veterans scattered throughout military and civilian life are called up, many with only seventy-two hours' notice. Fleming Pickering and his daredevil son Malcolm, Ed Banning, George Hart, Clyde Dawkins, William Dunn, Ernie Zimmerman - for them, and their sweethearts and wives, names such as Inchon and Pusan will acquire a new, bloody reality, and Korea will become not only a new battlefield...but their greatest challenge of all.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Solar Home Book: Heating, Cooling, and Designing with the Sun",
        "Authors": "By Bruce Anderson, Michael Riordan",
        "Description": "",
        "Category": "",
        "Publisher": "Cheshire Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Red on Red: Creating Stunning Interiors Using Reds and Pinks",
        "Authors": "By Hoppen, Stephanie",
        "Description": "The author of White on White tackles another important color and all its related shades--purples, oranges, raspberrys, pinks, and fuchsias--and shows readers how to bring reds into any room or design scheme. 25,000 first printing.",
        "Category": " Design , Decorative Arts",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Amazing Athlete #4: Girls on Blades (Look-Look)",
        "Authors": "By Miller, Mona and Katz, Lee (ILT)",
        "Description": "When participating in a skating race begins to threaten the friendship between Amy and Diane, Barbie helps them remember the real meaning of sportsmanship.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "French Lessons: A Memoir",
        "Authors": "By Kaplan, Alice",
        "Description": "Brilliantly uniting the personal and the critical, French Lessons is a powerful autobiographical experiment. It tells the story of an American woman escaping into the French language and of a scholar and teacher coming to grips with her history of learning. Kaplan begins with a distinctly American quest for an imaginary France of the intelligence. But soon her infatuation with all things French comes up against the dark, unimagined recesses of French political and cultural life.The daughter of a Jewish lawyer who prosecuted Nazi war criminals at Nuremburg, Kaplan grew up in the 1960s in the Midwest. After her father's death when she was seven, French became her way of \"leaving home\" and finding herself in another language and culture. In spare, midwestern prose, by turns intimate and wry, Kaplan describes how, as a student in a Swiss boarding school and later in a junior year abroad in Bordeaux, she passionately sought the French \"r,\" attentively honed her accent, and learned the idioms of her French lover.When, as a graduate student, her passion for French culture turned to the elegance and sophistication of its intellectual life, she found herself drawn to the language and style of the novelist Louis-Ferdinand Celine. At the same time she was repulsed by his anti-Semitism. At Yale in the late 70s, during the heyday of deconstruction she chose to transgress its apolitical purity and work on a subject \"that made history impossible to ignore:\" French fascist intellectuals. Kaplan's discussion of the \"de Man affair\" — the discovery that her brilliant and charismatic Yale professor had written compromising articles for the pro-Nazi Belgian press—and her personal account of the paradoxes of deconstruction are among the most compelling available on this subject.French Lessons belongs in the company of Sartre's Words and the memoirs of Nathalie Sarraute, Annie Ernaux, and Eva Hoffman. No book so engrossingly conveys both the excitement of learning and the moral dilemmas of the intellectual life.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Down by the River",
        "Authors": "By O'Brien, Edna",
        "Description": "A novel set in Ireland relates the story of a young girl who becomes pregnant by her father, a situation made worse when it becomes fodder for the mill of church, state, and the town square. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "More How Do They Do That?",
        "Authors": "By Sutton, Caroline, Markey, Kevin, and Vincent, Tom",
        "Description": "Have you ever wondered:- How do they know how much an aircraft carrier weighs?- How do they get music onto a CD?- How does an electric eel generate electricity?- How do they know how long a second is?- How do penguins stay warm in Antarctica?- How do they teach guide dogs to cross at a green light?The answers to these and many other everyday wonders are explained.Here, in simple and easy-to-understand terms, are solutions to the riddles of everyday life. How exactly does a thief break into your car and drive off with it in less than a minute? And how do they get Hostess Twinkies to stay fresh for so long?More How Do They Do That? also reveals aspects of modern science and the natural world that are often taken for granted. How do they measure the heat of distant stars? How do they measure the ozone layer? And how do they know there's going to be another ice age in two thousand years? The answers await within. . .",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Hearts and Lives of Men",
        "Authors": "By Weldon, Fay",
        "Description": "Clifford Wexford, a thirty-five-year-old art dealer, and Helen Lally, the twenty-two-year-old daughter of an artist, meet, fall in love, marry, produce Nell, and divorce",
        "Category": " Fiction , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Baltimore.... a Picture History, 1858--1958",
        "Authors": "By Beirne, Francis F",
        "Description": "",
        "Category": "",
        "Publisher": "Hastings house",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Gobs and Gobs of Free Stuff",
        "Authors": "By Lesko, Matthew and Martello, Mary Ann",
        "Description": "",
        "Category": "",
        "Publisher": "Information USA, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Under the Tuscan Sun: At Home in Italy",
        "Authors": "By Mayes, Frances",
        "Description": "“This beautifully written memoir about taking chances, living in Italy, loving a house and, always, the pleasures of food, would make a perfect gift for a loved one.  But it’s so delicious, read it first yourself.”—USA Today The 20th anniversary edition of the classic, updated with a new afterword. Don’t miss Frances Mayes in PBS’s Dream of Italy: Tuscan Sun Special!    Twenty years ago, Frances Mayes—widely published poet, gourmet cook, and travel writer—introduced readers to a wondrous new world when she bought and restored an abandoned villa called Bramasole in the spectacular Tuscan countryside. Under the Tuscan inspired generations to embark on their own journeys—whether that be flying to a foreign country in search of themselves, savoring one of the book's dozens of delicious seasonal recipes, or simply being transported by Mayes's signature evocative, sensory language. Now, with a new afterword from the Bard of Tuscany herself, the 20th anniversary edition of Under the Tuscan Sun brings us up-to-date with the book's most beloved characters.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Utopia (Dover Thrift Editions)",
        "Authors": "By More, Thomas, Sir, Saint",
        "Description": "First published in Latin in 1516, Utopia was the work of Sir Thomas More (1477–1535), the brilliant humanist, scholar, and churchman executed by Henry VIII for his refusal to accept the king as the supreme head of the Church of England.In this work, which gave its name to the whole genre of books and movements hypothesizing an ideal society, More envisioned a patriarchal island kingdom that practiced religious tolerance, in which everybody worked, no one has more than his fellows, all goods were community-owned, and violence, bloodshed, and vice nonexistent. Based to some extent on the writings of Plato and other earlier authors, Utopia nevertheless contained much that was original with More.In the nearly 500 years since the book's publication, there have been many attempts at establishing \"Utopias\" both in theory and in practice. All of them, however, seem to embody ideas already present in More's classic treatise: optimistic faith in human nature, emphasis on the environment and proper education, nostalgia for a lost innocence, and other positive elements.In this new, inexpensive edition, readers can study for themselves the essentials of More's utopian vision and how, although the ideal society he envisioned is still unrealized, at least some of his proposals have come to pass in today's world.",
        "Category": " Fiction , Literary",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Cooking Healthy with a Man in Mind",
        "Authors": "By Lund, JoAnna M. and Alpert, Barbara",
        "Description": "The author of Healthy Exchanges Cookbook presents a delectable new assortment of more than two hundred low-fat, low-calorie, and low-cholesterol recipes that are satisfying to every member of the family. Lit Guild, Doubleday, Doubleday Health, & Crossings Alt.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Opera: A Listener's Guide",
        "Authors": "By Sacher, Jack",
        "Description": "",
        "Category": " Music , Genres & Styles , Opera",
        "Publisher": "Schirmer Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Your Home Office (Simple Home Improvement)",
        "Authors": "By Stewart Walton",
        "Description": "",
        "Category": "",
        "Publisher": "Marshall Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Life You Imagine: Life Lessons for Achieving Your Dreams",
        "Authors": "By Jeter, Derek",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Steven Raichlen's High-Flavor, Low-Fat Chicken",
        "Authors": "By Raichlen, Steven and Schneider, Greg (PHT)",
        "Description": "Convenient, inexpensive, healthy - no wonder America loves chicken. Yet despite its popularity, few people know how to maximize its flavor while keeping down the fat.Steven Raichlen's High-Flavor, Low-Fat Chicken offers a diverse, tempting array of recipes ranging from traditional favorites like Grammie Ethel's Chicken Noodle Soup (chicken soup may be good for the soul, but it wasn't always this good for the heart!), to updated classics like Coq au Vin and Chicken Salad Nicoise. Of course you'll also find the invigorating international fare that has become Raichlen's trademark, including Mango and Chicken Stir-fry and Sopa de Lima - Yucatan Chicken Lime Soup.Accompanied by complete nutritional analyses and illustrated with gorgeous photographs, the more than forty recipes from around the world showcase high-flavor, low-fat cooking techniques like grilling, roasting, and smoking that bring out the best in the bird and show yet again why chicken is one of America's favorite foods.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Virginia Woolf: A Biography",
        "Authors": "By Bell, Quentin",
        "Description": "Probes the events of the English author's life paying special attention to her Bloomsbury milieu and her personal relationships",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1974"
        }
    },
    {
        "Title": "I Have Heard of a Land (Trophy Picture Books (Paperback))",
        "Authors": "By Thomas, Joyce Carol and Cooper, Floyd (ILT)",
        "Description": "I have heard of a landWhere the imagination has no fencesWhere what is dreamed one nightIs accomplished the next dayIn the late 1880s, signs went up all around America - land was free in the Oklahoma territory. And it was free to everyone: Whites, Blacks, men and women alike. All one needed to stake a claim was hope and courage, strength and perseverance. Thousands of pioneers, many of them African-Americans newly freed from slavery, headed west to carve out a new life in the Oklahoma soil. Drawing upon her own family history, National Book Award winner Joyce Carol Thomas has crafted an unforgettable anthem to these brave and determned people from America's past. Richly illustrated by Coretta Scott King Award honoree Floyd Cooper, I Have Heard of a Land is a glorious tribute to the Afrian-American pioneer spirit.    00-01 Sequoyah Children's Book Award Masterlist",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Catholics and Nuclear War",
        "Authors": "By Murnion, Phillip",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Crossroad Pub Co",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Myths of Child Rearing",
        "Authors": "By Rosner, Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "W W Norton & Co (Sd)",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "My Animals/ Mis Animales (English and Spanish Edition)",
        "Authors": "By Emberley, Rebecca",
        "Description": "Younger readers can begin to learn a new language with these brightly colored Spanish/English board books that show pictures of familiar animals. Full color. Baby/Preschool.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "LB Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "I'm a Big Sister",
        "Authors": "By Cole, Joanna and Chambliss, Maxie (ILT)",
        "Description": "Combines easy-to-read text and colorful illustrations that follow the experiences of a big sister as she helps to care for a baby sibling, and includes parent tips on responding to the needs of older children. By the authors of How I Was Adopted.",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Outsmarting the Female Fat Cell After Pregnancy: Every Woman's Guide to Shaping Up, Slimming Down, and Staying Sane After the Baby",
        "Authors": "By Waterhouse, Debra",
        "Description": "This new guide from the bestselling author of Outsmarting the Female Fat Cell provides a reasonable approach to conquering post-pregnancy weight without dieting, suffering, and without feeling bad about those extra pounds. Waterhouses latest offering shows women how their post-pregnancy bodies can be fitter, sexier, and stronger.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Reading Magic: Why Reading Aloud to Our Children Will Change Their Lives Forever",
        "Authors": "By Fox, Mem and Horacek, Judy (ILT)",
        "Description": "Bestselling author and literacy expert Mem Fox reveals the incredible emotional and intellectual impact reading aloud to children has on their ability to learn to read.All parents want and expect their children to learn to read, but few realize they can get their kids on the road to reading long before they start school simply by reading aloud to them every day. With passion and humor, acclaimed author and internationally respected literacy expert Mem Fox tells readers how she herself became aware of the astonishing effects that reading aloud and bonding through books have on very young children. She speaks of when, where, and why to read aloud and demonstrates how to read aloud to best effect and how to get the most out of a read-aloud session. She walks readers through the three secrets of reading which together make reading possible. She gives guidance on defining, choosing, and finding good books and closes with tips on dealing effectively with the challenges that sometimes arise when children are learning to read. Filled with practical advice, activities, and inspiring true read-aloud miracles, this book is a must for every parent-and for anyone interested in how children learn to read.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The American Diabetes Association: The American Dietetic Association Family Cookbook (American Diabetes Association & American Dietetic Association)",
        "Authors": "By American Dietetic Association~American Diabetes As",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "A Northern Light: Borders Edition",
        "Authors": "By Donnelly, Jennifer",
        "Description": "While working at the local hotel, the drowned body of a young woman washes onto the shore and gets Mattie thinking again of the loss of her mother, her familyÆs struggles, and her unhappy life in her small community, but when she reads the girlÆs letters, Mattie is inspired and becomes determined to follow her dream of moving to New York City to become a writer. 50,000 first printing.",
        "Category": " Young Adult Fiction , Historical , United States , 20th Century",
        "Publisher": "Sandpiper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Official SCRABBLE Players Dictionary",
        "Authors": "By Merriam-Webster",
        "Description": "\"The book that millions of SCRABBLE® players consider the only necessary resource. Ideal for recreational and school use. More than 100,000 playable two-to-eight-letter words. Easy alphabetical organization.\"\\\\",
        "Category": " Games & Activities , Reference",
        "Publisher": "Merriam-Webster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Stories for the Christian Spirit: Trusting in God's Plan",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Goddess in the Office: A Personal Energy Guide for the Spiritual Warrior at Work",
        "Authors": "By Budapest, Zsuzsanna Emese",
        "Description": "Wise, whimsical, witty, and when it's called for, deliciously wicked, America's favorite witch stirs up an empowering brew for working women everywhere.From receptionist to CEO and everyone in between, what woman wouldn't want to improve something (or many things) about her hectic seven-day work week? In this gift-worthy guide, Z. Budapest combines down-to-earth tips and traditional magic to help women employ their powers to:• get a raise  • increase productivity• repel sexual harassment  • protect computer dataand much more",
        "Category": " Self-help , Spiritual",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Marvin's Room: A Play",
        "Authors": "By McPherson, Scott",
        "Description": "",
        "Category": "",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Everyday Embellishments: 8 Fun Quilts to Stitch and Embellish (That Patchwork Place)",
        "Authors": "By Hawley, M'Liss Rae",
        "Description": "Offers step-by-step instructions for eight unique and whimsical wall quilts, in a guide that spotlights a variety of quilting techniques and presents detailed lessons in quilt construction and embellishment, using such simple machine methods as strip piecing, fusible appliqué, and dimensional appliqué. Original.",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "That Patchwork Place",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "More Like Us",
        "Authors": "By Fallows, James M.",
        "Description": "Arguing against following examples set by the Japanese in rebuilding American economic strength, the author recommends utilization of the vast skills and resources of immigrants to the United States",
        "Category": " Social Science , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Blue Highways: A Journey Into America",
        "Authors": "By William Least Heat Moon",
        "Description": "In this account of his twelve-thousand-mile journey across America--tracing his white ancestors--a native American reveals a glimpse of backroads America",
        "Category": "",
        "Publisher": "Fawcett Crest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Creative Aging: Discovering the Unexpected Joys of Later Life Through Personality Type",
        "Authors": "By Millner, Nancy Bost",
        "Description": "Why are some people full of vitality and passion for life, while others are bound by fear and regret? Applying Jung's model of personality type and the tools of the Myers Briggs Type Indicator® assessment, psychologist and counselor Nancy Millner examines the impact personality differences have on our responses to aging. Millner offers as illustration the personal stories of more than 50 people who have passed through midlife and are now aging creatively in their 60s and 70s. All have faced the limitations of their later years with optimism that has led to new energy and purpose in their work, their relationships and their spiritual growth.",
        "Category": " Self-help , Aging",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Racquetball: Steps to Success (Steps to Success Activity Series)",
        "Authors": "By Kittleson, Stan",
        "Description": "Contains basic information discussing rules, etiquette, and equipment, and provides step-by-step instructions for the beginning level player",
        "Category": " Sports & Recreation , Racquetball",
        "Publisher": "Leisure Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Song from the Forest: My Life Among the Ba-Benjelle Pygmies",
        "Authors": "By Sarno, Louis",
        "Description": "",
        "Category": " Social Science , Anthropology , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Children's Illustrated Dictionary",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Complete Seasonal Cookbook (Williams-Sonoma Complete Cookbooks)",
        "Authors": "By Sonoma, Williams",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Your Kitchen",
        "Authors": "By Walton, Stewart",
        "Description": "The kitchen is the most important room in your home.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Lebhar-Friedman",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Portrait in Sepia: A Novel",
        "Authors": "By Allende, Isabel and Peden, Margaret Sayers (TRN)",
        "Description": "\"Portrait in Sepia is the best book Allende has published in the United States since her first novel of nearly two decades ago, The House of the Spirits.” —Jonathan Yardley, Washington Post Book World “Portrait in Sepia tightens the weave of a multigenerational fantasy as complete and inspiring as the real world it parallels … Allende’s enchanting historical universe keeps expanding and Portrait in Sepia is a new galactic jewel.” —Chicago Tribune A richly imagined historical novel about memory and family secrets from the New York Times bestselling author of Island Beneath the Sea, Inés of My Soul, Daughter of Fortune, Zorro, and House of the Spirits.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Bible Promise Book: One Thousand Promises from God's Word (New International Version)",
        "Authors": "By Barbour Publishers",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Code of Conduct",
        "Authors": "By Arnold, Elliott",
        "Description": "",
        "Category": "",
        "Publisher": "Scribners",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Williams-Sonoma Foods of the World: San Francisco: Authentic Recipes Celebrating the Foods of the World",
        "Authors": "By Williams, Chuck (EDT), Fletcher, Janet, and Hall, Jean-Blaise (PHT)",
        "Description": "Describes the culinary tradition of San Francisco, and offers forty-five recipes for appetizers, main dishes, vegetables dishes, and desserts.",
        "Category": " Cooking , Regional & Ethnic , American , California Style",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Ojibway drums",
        "Authors": "By Magoon, Marian Austin (Waite)",
        "Description": "",
        "Category": "",
        "Publisher": "Longmans & Green",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "April 1865: The Month That Saved America",
        "Authors": "By Winik, Jay",
        "Description": "The New York Times bestselling chronicle of the Civil War's final days that will forever change the way we see the war's end and the nation's new beginning. It was a month that could have unravelled the American nation. Instead, it saved it. In April 1865, Jay Winik masterfully breathes new life into the end of a war and the events we only thought we knew. This gripping, panoramic narrative takes readers on a breathless ride through these tumultuous thirty days, showing that the nation's future rested on a few crucial decisions and twists of fate. Here is Richmond's dramatic fall, Lee's harrowing retreat, and the intense debate in Confederate circles over unleashing guerrilla warfare. Here, too, is the rebel surrender at Appomattox, Lincoln's assassination five days later, and the ensuing fears of chaos and a coup, the shaky transfer of presidential power, and finally the start of national reconciliation. Outsized characters stalk through sweeping events in Winik's brilliant narrative, transforming a seeming epilogue to a great war into a central栮d saving欯ment in American history, firmly placing April 1865 in the same pantheon as 1492 and 1776.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Sunset Adventures In Food",
        "Authors": "By By the Editors of Sunset Books and Sunset Magazine and Krell, Dorothy - Cook Book Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Lane Book Co.",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "The J. Paul Getty Museum Handbook of the Collections",
        "Authors": "By J. Paul Getty Museum (COR)",
        "Description": "This revised edition of the Handbook highlights the collections of the Getty Museum at the Getty Center, including the Museum's latest acquisitions. In recent years the paintings collection has grown substantially, and featured here are paintings new to the Getty by artists such as Claude Monet, Jean-Honoré Fragonard, Nicholas Poussin, Jacques-Louis David, and Paul Cézanne, as well as recently acquired works in every department of the Museum. Three hundred forty objects are reproduced-each with information about content and style-to help enhance appreciation and insight by non-specialist readers and museum-goers alike.The book is organized by curatorial department-antiquities, decorative arts, drawings, illuminated manuscripts, paintings, photographs, and sculpture. An introduction by Deborah Gribbon, director of the museum, traces the fascinating history of the Getty through its move to the Getty Center.",
        "Category": " Art , Collections, Catalogs, Exhibitions , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Cambridge Astronomy Guide",
        "Authors": "By Liller, William and Mayer, Ben",
        "Description": "The Cambridge Astronomy Guide is intended for lovers of astronomy who wish to do more than just look at the night sky or marvel at glossy pictures of it. It tells you how to get outside and actually practise astronomy, even if you own nothing more than a simple camera. Astronomy, more than any other science, offers amateurs the opportunity to make meaningful and lasting contributions to the field. This Guide explains in simple non-mathematical terms how you can take stunning star photographs and then put them to use making valuable contributions to the science of astronomy. Ben Mayer's odd-numbered chapters provide a fascinating account told with much humour of how one raw amateur got started and quickly progressed to become one of the world's best known and in many ways most successful amateur astronomers. Bill Liller's even-numbered chapters provide a more extensive commentary on much of what Ben writes, plus some additional material which gives the professional point of view.",
        "Category": " Science , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Debt of Honor",
        "Authors": "By Clancy, Tom",
        "Description": "Every novel by Tom Clancy has been \"a jaw-tightener and a nail-biter of the first order,\" as the San Diego Union described Without Remorse. But Debt of Honor surpasses them all, with Jack Ryan facing his greatest challenge - against a peril that may become all too real.In retrospect, it would seem an odd way to start a war. . . .The end of history. The new world order. Fine phrases, but as Jack Ryan is about to discover, history isn't dead yet - and only the nature of the threat is new.On the Pacific island of Saipan, a wealthy Japanese businessman regards his new-bought land with satisfaction. In the Indian Ocean off Sri Lanka, a foreign navy begins a series of highly unusual exercises. At the headquarters of America's major stock-clearing corporation, an engineer brings a customized computer program on-line for the first time, and smiles at his own private joke. Three seemingly unrelated incidents, but all just the first links in a chain of events that will stun the world.Called out of retirement to serve as the new President's National Security Advisor, Jack Ryan quickly realizes that the problems of peace are fully as complex as those of war. Enemies have become friends, friends enemies, and even the form of conflict has changed. What he cannot realize, however, is just how close the next conflict is. And when one of those new enemies readies a strike not only at America's territory, but at the heart of her economy, it is Ryan, with the help of CIA officers John Clark and Domingo Chavez, who must prepare an untested President to meet the challenge, if Ryan can only figure out how. For there is a debt of honor to be paid - and the price will be terrifyingly high. . . .",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Dr Frau: A Woman Doctor Among the Amish",
        "Authors": "By Kaiser, Grace H.",
        "Description": "",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Good Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Culinary Crafting: The Art of Garnishing and Decorating Food",
        "Authors": "By Townsend, Doris McFerran",
        "Description": "",
        "Category": "",
        "Publisher": "Rutledge Books",
        "Price Starting With ($)": "24.27",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Get Crafty - Indoor Crafts",
        "Authors": "By Bolton, Vivienne",
        "Description": "",
        "Category": "",
        "Publisher": "Dempsey Parr Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "3 Minute Treasuries Bedtime",
        "Authors": "By Renee Graef",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Alphabet Zoo (Padded Large Learner)",
        "Authors": "By Holmes, Stephen",
        "Description": "",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    }
]