[
    {
        "Title": "The God Project",
        "Authors": "By Lee, Stan",
        "Description": "Politicians, a televangelist, and Malcolm Keyes, of eidetic memory, encounter a CIA project that will permit the government to send forces into a foreign country without any public repercussions at all, but the Project has disappeared",
        "Category": " Fiction , General",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Rules of Engagement",
        "Authors": "By Weber, Joe",
        "Description": "When a North Vietnamese shoots down his wingman, Marine pilot Brad Austin is determined to avenge his comrade, despite the rule against hitting an enemy MiG base",
        "Category": " Fiction , General",
        "Publisher": "Presidio Pr",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Alchemist's Daughter: A Novel",
        "Authors": "By McMahon, Katharine",
        "Description": "During the English Age of Reason, a woman cloistered since birth learns that knowledge is no substitute for experience.Raised by her father in near isolation in the English countryside, Emilie Selden is trained as a brilliant natural philosopher and alchemist. In the spring of 1725, father and daughter embark upon their most daring alchemical experiment to date—attempting to breathe life into dead matter. But when Emilie—against her father’s wishes—experiences the passion of first love, she is banished to London, where she soon discovers she knows nothing about human nature—or her own family’s complicated past. So begins her shocking journey to enlightenment. Also available as a Random House Large Print edition and as an eBook",
        "Category": " Fiction , Historical , General",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Homeport",
        "Authors": "By Roberts, Nora",
        "Description": "The Maine air is bitterly cold when Dr. Miranda Jones arrives at the family home after a busy lecture tour. But her blood turns to ice when she suddenly feels the knife against her throat.The unseen assailant steals her bags, slashes her tires, and disappears. Deeply shaken, Miranda is determined to put the experience behind her. Distraction comes when she is summoned to Italy - to verify the authenticity of a Renaissance bronze of a Medici courtesan known as The Dark Lady. But instead of cementing Miranda's position as the leading expert in the field, the job nearly destroys it when her professional judgment is called into question. Emotionally estranged from her mother, with a brother immersed in his own troubles, Miranda has no one to turn to...except Ryan Boldari, a seductive art thief whose own agenda forces them into a reluctant alliance.Now it becomes clear that the incident in Maine was not a simple mugging - and that The Dark Lady may possess as many secrets as its beautiful namesake once did. For Miranda, forced to rely on herself - and a partner who offers her both unnerving suspicion and intoxicating passion - the only way home is filled with deception, treachery, and a danger that threatens them all.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "14.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Using Your Money Wisely: Biblical Principles Under Scrutiny",
        "Authors": "By Burchett, Lucy",
        "Description": "Nearly 80 percent of all divorced couples between the ages of 20 and  30 list financial difficulties as the primary cause of their separation. Even  some of the most dedicated Christians are facing the perils of bankruptcy and overextended  credit. We are seeing just some of the effects of living in a materialistic society.Larry  Burkett, renowned for his Christian Financial Concepts ministry, dedicated himself  to helping people understand what the Scripture says about finances. Through a series  of outstanding articles taken from CFC newsletters, Using Your Money Wisely  clearly demonstrates God's principles for prudent money management",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Scars (Childrens Paperbacks Series)",
        "Authors": "By Bailey, Anne",
        "Description": "Ever since her sister's murder two years before, and the investigation that followed, Tanya has been unable to speak from shock and from her fear of what she might give away if she spoke",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Faber & Faber",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Padre: A Novel",
        "Authors": "By Hardy, Robin",
        "Description": "",
        "Category": " Fiction , Christian , General",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Sierra (Palisades Pure Romance)",
        "Authors": "By MacDonald, Shari",
        "Description": "When beautiful Celia Randall travels to eastern California for a short-term photography assignment, she unexpectedly locks horns-and falls in love-with the editor of the award-winning High Sierra magazine, Marcus Stratton. Yet, broken by recent losses in her own life, Celia hides from intimacy with anyone-including the One who loves her most of all-until tragic circumstances bring her face to face with a God whose love is even greater than that of the man who risks his life for her...high in the Sierra.",
        "Category": "",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Spector Nordstrom Way",
        "Authors": "By Spector, Robert and McCarthy, Patrick D.",
        "Description": "Praise for The Nordstrom Way\"Outstanding customer service and Nordstrom's are synonymous. The innovative approach has allowed them to find out what the customers want and then do it. Their standards of service are what we all shoot for.\" - David D. Glass President and Chief Executive Officer Wal-Mart Stores, Inc.\"Nordstrom is a national model for outstanding customer service. American business should use this book as a primer to learn how to make and keep happy, satisfied customers.\" - J. Willard Marriott, Jr. Chairman and President Marriott International, Inc.\"When you run a family business that includes your customers as extended family, you're unbeatable. This book outlines an American family saga that has become the admiration of the world.\" - Leonard A. Lauder President and Chief Executive Officer Est?e Lauder Companies\"Nordstrom's business is built on one-to-one communication with the customer. Their professional salespeople bridge the gap between the designer and the consumer. The Nordstrom Way is what the '90s are all about!\" - Donna Karan Designer and Chief Executive Officer Donna Karan Company",
        "Category": " Business & Economics , Distribution",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Outrageous!: Unforgettable Service...Guilt-Free Selling",
        "Authors": "By Gross, T. Scott and Gross, Scott",
        "Description": "",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Violin",
        "Authors": "By Rice, Anne",
        "Description": "In the grand manner of Interview with the Vampire, Anne Rice's new novel moves across time and the continents, from nineteenth-century Vienna to a St. Charles Greek Revival mansion in present-day New Orleans to dazzling capitals of the modern-day world, telling a story of two charismatic figures bound to each other by a passionate commitment to music as a means of rapture, seduction, and liberation.While grieving the death of her husband, Triana falls prey to the demonic fiddler Stefan, a tormented ghost of a Russian aristocrat who uses his magic violin first to enchant, then to dominate and draw her into a state of madness.But Triana understands the power of the music perhaps even more than Stefan--and she sets out to resist him and to fight, not only for her sanity, but for her life. The struggle draws them both into a terrifying supernatural realm where they find themselves surrounded by memories, by horrors, and by overwhelming truths. Battling desperately, they are at last propelled toward the novel's astonishing and unforgettable climax.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Power of a Woman",
        "Authors": "By Bradford, Barbara Taylor",
        "Description": "A family tragedy forces successful careerwoman Stephanie Jardine to come to terms with the secrets of her past and a stormy relationship, in a novel by the author of A Woman of Substance. 500,000 first printing. $350,000 ad/promo.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Everything Baby Names Book: Everything You Need to Know to Pick the Perfect Name for your Baby",
        "Authors": "By Rogak, Lisa and Shaw, Lisa Angowski Rogak",
        "Description": "Provides over 25,000 names for boys and girls, including origins, meanings, nicknames, and variations",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Cool Careers For Dummies",
        "Authors": "By Edwards, Sarah, Edwards, Paul, and Nemko, Marty",
        "Description": "Sure, some people enter preschool knowing what they want to be when they grow up. But most of us aren't so lucky, and we don't get much help. Some parents say things like, \"It's your life, you decide.\" Other parents go to the other extreme, expecting you to follow in their footsteps. In high school, you take a career test, but many high school students laugh at their test results: the utterly useless, \"You could pursue a wide range of careers.\"This revised edition of Cool Careers For Dummies provides insight into landing a job for anyone who doesn't know where to look, doesn't have time to look, or doesn't want to suffer through a long back-to-school stint. It's designed for people of all walks of life to uncover rewarding, viable careers or get in on the ground floor of the next Big Things. What's more, this guide even offers tips to make even a humdrum job much better.Clearly organized by specific topic areas, you can easily find the topics that appeal to you. You'll uncover information likeFinding the right career for you, whether you've never had a career before or want to dump your old career for a new and improved oneGetting smart about choosing, and making the most of, a careerLanding the job you want even if the thought of networking gives you the creeps and you don't have a 500-name RolodexCustomizing your career to make any job better by tailoring it to your strengths and using wise approaches to your boss and co-workersAnd, you'll find a fast yet substantive introduction to more than 500 good careers, including many unlikely suspects!Despite taking career tests, plowing through fat career guides, and spending hours of reflecting, many people end up falling into their careers more by chance than by choice. Not a good way to ensure career happiness. There is a better way. Read all about it, in Cool Careers For Dummies.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Girls (Ballantine Reader's Circle)",
        "Authors": "By Yglesias, Helen",
        "Description": "The youngest of four sisters, a noted New York writer and critic, eighty-year-old Jenny has flown to Miami Beach to help her flamboyant sister Flora (the Sandra Bernhardt of the senior set) deal with their ailing older siblings. Eva, ninety-five, is still elegant and articulate: \"They come if it's convenient,\" she ventures between wine toasts to her continuing years. Naomi is ever a beauty at ninety--and as vain as they come: \"He's crazy about me, but I just brush him off.\" Despite their fragile bodies, they are women to be reckoned with--and Jenny and Flora have their hands full. As they strive to keep their sisters comfortable and cared for, an explosive history of sibling rivalry is reignited--one that illuminates each of their long lives, the tender joys and sorrows, and the bittersweet ache for life, especially in its twilight years. . . .",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Step-By-Step Dried Flowers: Over 30 Projects for Garlands, Swags, Wreaths and Festive Arrangements Using Dried or Pressed Flowers and Foliage",
        "Authors": "By Westland, Pamela",
        "Description": "These simple directions for drying flowers provides all of the information needed to create exquisite dried flower projects.",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Gatsby's Girl",
        "Authors": "By Preston, Caroline",
        "Description": "Just as Jay Gatsby was haunted by Daisy Buchanan in The Great Gatsby, F. Scott Fizgerald was haunted by his own great first love a Chicago socialite named Ginevra. Alluring, capricious, and ultimately unavailable, she would become his first muse, the inspiration for such timeless characters as Gatsby's Daisy and Isabelle Borge in This Side of Paradise.Caroline Preston's astute perceptions of her characters and the cultural landscapes they inhabit have earned her work comparisons to to that of Anne Tyler, Alison Lurie, and Diane Johnson. Now, in this richly imagined and ambitious novel, Preston deftly evokes the entire sweep of Ginevra's life from her first meeting with Scott to the second act of her sometimes charmed, sometimes troubled life.Ginevra was sixteen, a rich man’s daughter who had been told she was pretty far too often for her own good. Scott was nineteen, a poor boy full of ambition. They met at a country club dance in St. Paul, Minnesota, in January 1916. For almost a year they wrote each other letters so long, breathless, and yearning that they often required more than one envelope.But despite their intense epistolary romance, the relationship wouldn’t last. After throwing him over with what he deemed supreme boredom and indifference,” she impulsively married a handsome aviator from the right society background.Ruminating over what might have been had she picked the writer instead of the flier, she furtively reads the now famous Fitzgerald’s work. When she sees herself much to her surprise in his characters, it’s not just as the spoiled debutante he’d known; he’s also uncannily predicted the woman she’s become, cracks and all.An affecting story of two people, one famous, one known only through her portrayals in enduring works of fiction, Gatsby’s Girl is a tremendously entertaining and moving novel about the powerful forces of first love, memory, and art.",
        "Category": " Fiction , Literary",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Octagon: Being an Account of a Famous Washington Residence, Its Great Years, Decline, and Restoration",
        "Authors": "By McCue, George",
        "Description": "",
        "Category": "",
        "Publisher": "American Institute of Architects Foundation",
        "Price Starting With ($)": "37.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Spanish Stories / Cuentos Españoles (A Dual-Language Book) (English and Spanish Edition)",
        "Authors": "By Flores, Angel",
        "Description": "Designed for the lover of fine literature as well as the intermediate language student, this dual-language book contains 13 great, representative Spanish short stories. Chronologically arranged to illustrate the development of the story form in Spanish, the stories are presented both in Spanish and English, enabling students to learn a language while simultaneously studying literary classics.　Edited by former Queens College professor Angel Flores, the volume includes brilliant works not available in any other edition published in the U.S. First-rate stories range from the medieval tales of Don Juan Manuel and the classics of Cervantes, Alarcon and Miguel de Unamuno to the highly acclaimed contemporary works of Jorge Luis Borges, Camilo Jose Cela, and Juan Goytisolo. Also included are satirical views of Spanish life by Leopolda Alas (Clarin) and Emilia Pardo Bazan, charming sketches by Ricardo Palma, and the socially and politically inspired writings of Benito Lynch and Horacia Quiroga.　With this book, language students will be able to follow Spanish classics in the original while having immediate access to a complete, faithful English translation on the facing page. The dual format saves hours in word-hunting and note-taking, allowing more time for intensified study of the language, building vocabulary and practicing conversation. The present volume also contains an informative essay on Spanish literature, a biographical-critical introduction to each story, notes on obscure references and idioms and a Spanish-to-English vocabulary.Students of language and comparative literature will find the dual-language format convenient and helpful and the stories deeply satisfying; readers interested in Spanish literature will want to add this important and stimulating collection to their personal libraries.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Poetry of Chantay Mahogany's Life.....and Yours!",
        "Authors": "By Mahogany, Chantay",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Authorhouse",
        "Price Starting With ($)": "9.76",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Making the Most of Your Money: Smart Ways to Create Wealth and Plan Your Finances in the '90s",
        "Authors": "By Quinn, Jane Bryant",
        "Description": "The right choices in risky times. Jane Bryant Quinn knows how to find them, as readers of her personal finance columns--in Newsweek, Woman's Day and newspapers nationwide--can confirm. She's smart, doesn't skirt the tough questions, and doesn't bore you to death with complicated theories or formulas. She steers you away from financial schemes that promise you the moon. But she's not timid about investing. She urges you to take intelligent action, to seize opportunities in both good times and bad.In Making the Most of Your Money, Quinn does on paper what good financial planners should do in person. She guides you toward organizing your financial life--without fuss or pain and in a way that is right for you. She shows you how to set sensible goals; critiques the expanding range of financial products (what's good and what's bad in mutual fnnds, stocks, bonds, real estate, fixed-income savings, and Wall Street's dubious exotica); and offers common-sense advice in all areas of personal finance-borrowing, saving, insuring, investing, and much more. Making the Most of Your Money tells you exactly what you need to know to stay on top of a changing economy.Quinn's particular strength is to take you beyond the outworn assumptions of the past 20 years, to lay out the new money strategies that will dominate the 1990s. From this book you learn how to compensate for the downturn in incomes and property values; how to borrow intelligently in an era when loans are harder to get; how to earn more money by making wise investment choices; how to prepare for a future where Social Security won't be worth as much as it is right now. Here, you'll find all of her personal systems for balancing safety with prudent risk, explained in her clear and witty prose.From building financial safety nets to choosing the right mortgage, from finding a better credit card to planning for college and retirement, Quinn shows you what works--and what doesn't. Families, couples, singles--in fact, all Americans who want to handle their money better--will find Making the Most of Your Money the single best financial guide to the decade ahead.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Yanomamo - The Last Days Of Eden",
        "Authors": "By Chagnon, Napoleon A.",
        "Description": "Chagnon first made contact with the Yanomamö, a now-imperiled tribe of Amazon Indians, in 1964. He gives an unforgettable portrait of an extraordinary people in this eloquent, meticulously detailed, and often passionate book. Foreword by Edward O. Wilson; Index; maps; illustrations and photographs by the Author.",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "6.01",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Making Scrapbooks: Complete Guide to Preserving Your Treasured Memories",
        "Authors": "By Vanessa-Ann",
        "Description": "Turn precious memories into a beautiful keepsake to treasure forever! The joyous announcement of a baby's birth. A wedding invitation. Rare family photographs. They deserve careful safeguarding in a beautiful personalized memory album. The days of drab, store-bought scrapbooks have gone forever, because if you have a snapshot or souvenir, you have a work of art waiting to happen. A few easy techniques--and your imagination--will do the trick.  Just see how a stunning setting, a sprinkle of decorations, or a surprising design can transform everyday objects into something special. This unique volume shows you how to do the job right.  * Avoid irreparable damage to your photos, and make sure your scrapbook lasts a long time, by following hints on handling, archiving, and even buying materials. * Create a book that always captures just the right mood for whatever you're documenting--from background paper to a photo frame. * Embellish with découpage, embossing, appliqué, pop-up pictures, and hand-tinting.  * Sponging, heat-coloring metal, marbling, plastic-wrap painting and more allow you to express your individuality and create a book like no other.  * A variety of designs capture romantic, comic, and holiday moods. * An amazing array of scrapbook ideas, complete with patterns, complement every occasion and every season. * Explore the incredible variety of tools--some little known--that will help you cut, measure, and decorate your album so it will be unique. * Calculate page measurements and crop pictures to create the best possible design.  You'll soon have a library of magnificent scrapbooks to enjoy--and what better way to have and to hold those images, moments, wishes, and me",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Hidden Book In the Bible",
        "Authors": "By Friedman, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "HARPER COLLINS PUBLISHERS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Quotable Rudy: Words of Insight, Savvy, and Survival by and about Rudy Giuliani, A Mayor for America (Potent Quotables)",
        "Authors": "By Carpenter, Monte (EDT)",
        "Description": "Rudy Giuliani was named Time magazine's 2001 Person of the Year, and it's no  wonder. He was the courageous and inspirational leader who emerged shaken but  not deterred from the smoldering ruins left behind in the aftermath of the  September 11 terrorist attacks on New York City's World Trade Center. His  hands-on actions and soothing words comforted not only a shocked, grieving  city but a nation as well. Frequently brash and occasionally confrontational,  Giuliani attacked and drastically reduced crime in New York City, among his  numerous accomplishments. This compilation of about 300 quotes by and about  the now-former mayor and rising political star tackles dozens of compelling  topics.",
        "Category": " Reference , Quotations",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Old Testament portraits",
        "Authors": "By Kendrick Strong",
        "Description": "",
        "Category": "",
        "Publisher": "Christian Education Press",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "The Harper Atlas of World History",
        "Authors": "By unknown",
        "Description": "Uses maps to show political, social, and ecomonic changes and provides information on world culture throughout history",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Richard Scarry's Best Mother Goose Ever (Giant Golden Book)",
        "Authors": "By Scarry, Richard and Scarry, Richard (ILT)",
        "Description": "Richard Scarry introduces toddlers to the nursery rhymes of Mother Goose! Featuring his unmistakable art (now restored to its original glory) and fifty of Mother Goose's most beloved rhymes, Scarry's timeless collection, now celebrating its fiftieth anniversary, is a must-have for readers of all ages.",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Loving",
        "Authors": "By Sullivan, Charles (EDT)",
        "Description": "\"Love is a crooked thing,\" W. B. Yeats wrote, \"there is nobody wise enough to find out all that is in it.\" Love includes the romance of a moment and the devotion of a lifetime, both elation and grief, the ecstasy of being together and the pain of being apart. We may (or may not) love ourselves, one another, friends, children, parents, places, things; our feelings may be simple or very complicated. \"How do I love thee?\" asked Elizabeth Barrett Browning. \"Let me count the ways.\"Loving: Poetry and Art embraces the astonishing variety and complexity of love as no other book has done. Among the 100 poems and songs and nearly 90 beautifully reproduced images, we find \"legendary lovers\" from Adam and Eve and Romeo and Juliet to John Lennon and Yoko Ono. The lover's fascination with the beloved's beauty, the compelling thrill of first love, the perils and delights of intimacy, the special bonding that is possible for couples - all are celebrated here. Love between parents and children is reflected in the anonymous \"Lady Bug\" poem as well as in Sylvia Plath's intensely personal lines, while the universality of human feelings is shown in poetry about creation and spiritual love, such as Gerard Manley Hopkins' \"Glory be to God for dappled things.\"To create this unique and deeply moving book, Charles Sullivan has gathered outstanding examples of poetry and art from various cultures and historical periods, and presents them so that words and images go beautifully together. Here we discover or rediscover love poems by Dylan Thomas, Gwendolyn Brooks, Pablo Neruda, Robert Bly, Emily Dickinson, Ted Hughes, William Shakespeare, Erica Jong, Seamus Heaney, W. H. Auden, Takasaki Masakase, Anne Sexton, Nikki Giovanni, John Donne, Walt Whitman, and Edna St. Vincent Millay, among others. Their poetry is accompanied by paintings, sculpture, photographs, and other stirring images by such artists as Chagall, Rodin, Mary Cassatt, David Hockney, Michelangelo, Van Gogh, Georgia O'Keeffe, Whistler, Picasso, Monet, Romare Bearden, Renoir, Matisse, Red Grooms, and Mary Frank.Biographical notes give the reader useful background information about the artists and poets included in the book.Elegant and distinctive in design and content, Loving is a treasure for single persons, couples, and families, for the young and old alike. It will be enjoyed many times, in many moods. And as Yeats wrote about love itself, \"one cannot begin it too soon.\"",
        "Category": " Poetry , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Encounters with Verdi",
        "Authors": "By Conati, Marcello (EDT)",
        "Description": "Interviews, memoirs, and essays describe the experiences, personality, and musical career of the distinguished Italian composer, Giuseppe Verdi",
        "Category": " Biography & Autobiography , Composers & Musicians",
        "Publisher": "Cornell University Press",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Total Digital Photography",
        "Authors": "By George, Chris",
        "Description": "This comprehensive 320-page book covers over 150 topics in depth-and includes over 1000 drawings and full-color photographs to illustrate step-by-step instructions. The text covers everything from choosing the right digital camera, to photo composition, to how to correct and improve digital images, to advanced imaging techniques such as professional retouching, montage, and special effects. It also features detailed advice on how to print digital images successfully, and how to output them to other devices and applications. With the range of topics covered, the book is a great gift for both the newcomer to digital photography and the experienced photographer looking to master the craft.",
        "Category": " Photography , Techniques , Digital",
        "Publisher": "Running Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "MLA Handbook for Writers of Research Papers, Fifth Edition",
        "Authors": "By Gibaldi, Joseph",
        "Description": "The handbook takes readers through the research paper process step by step, and includes information on narrowing the topic, outlining, note taking, etc. Before dealing with such mechanics of writing as spelling, punctuation, and format, the manual covers the use of catalogs (online and paper), indexes, and databases in the library and offers a list of some standard print and electronic reference works. The sections on documentation in text and citations seem to include every type of source and possible variable. The work concludes with abbreviations for terms used in research, reference sources by subject, and some examples of other styles of documentation. Examples within each section are printed in a font different from the explanatory text, a featurethat allows the user to easily find the appropriate format. Chapters are divided by subtopics with numeric denotation; an index makes topics easy to find.Provides guidelines and examples for handling research, outlining, spelling, punctuation, formatting, and documentation",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Modern Language Assn of Amer",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Diet for a Happy Heart",
        "Authors": "By Jones, Jeanne",
        "Description": "",
        "Category": "",
        "Publisher": "101 Productions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "Don't Know Much About American History (Don't Know Much About...(Paperback))",
        "Authors": "By Davis, Kenneth C.",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Great Dames: What I Learned from Older Women",
        "Authors": "By Brenner, Marie",
        "Description": "\"Fascinating, gossipy, entertaining. . . .\" — New York Times Book ReviewThey are ten outstanding women of the century. Each had an aura, including Thelma Brenner, the first great dame her daughter ever knew. Their lives were both gloriously individual and yet somehow universal. They were mighty warriors and social leaders, women of aspiration who persevered. They lived through the Great Depression and a world war. Circumstances did not defeat them. They played on Broadway and in Washington. They had glamour, style, and intelligence. They dressed up the world. \"Vivid, intimate portraits . . . a splendid tribute to ten of the century's grandest, most powerful women.\" —Us \"These women were our geishas, whispering in our ears to influence all aspects of American life.\" —Susan Salter Reynolds, Los Angeles Times\"Delectable, classy . . .  a runaway hit.\" —Liz Smith\"An engrossing introduction to a way of life that's now extinct, for better or for worse.\" —Chicago Sun-Times",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Healthy Pleasures",
        "Authors": "By Ornstein, Robert E. and Sobel, David",
        "Description": "Discover the proven medical benefits of pleasure and live a longer, healthier lifeImagine a medical treatment that can decrease heart disease, boost immune function, relieve depression, and block pain-whose only side effect is that it makes you feel good. It's safe, inexpensive, and readily available. No, it's not a miracle drug; rather, these benefits come from the experience of pleasure itself. And this pleasure prescription is filled in the internal pharmacy of the brain.Psychologist Robert Ornstein and physician David Sobel deliver the latest scientific evidence that pleasures--from saunas to siestas, chocolate to charity--and positive attitudes--from happiness to optimism--are not only enjoyable but also good for you.",
        "Category": " Psychology , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Firestorm",
        "Authors": "By Barr, Nevada",
        "Description": "As part of the army battling the Jackknife fire in northern California's Lassen Volcanic National Park, Anna, in her capacity as spike camp medic and security officer, tends the injuries and the frayed nerves of the firefighters. When the National Weather Service predicts a cold front followed by snow, promising to all but extinguish the fire, the camp is demobilized, but a last-minute rescue of a firefighter with a broken leg detains Anna and the San Juan crew. Driven on by the erratic thunderstorm of the front, wind shears in the steep canyon, creating the deadly weather conditions for a firestorm. As the ravine explodes in flames propelled by the racing winds, the crew tries desperately to outrun the blaze, ultimately seeking refuge in their individual silver fire shelters wryly referred to as shake 'n' bakes.When the fire finally passes, Anna emerges from her shelter to check on the fate of her companions. The sound of each exhausted voice, the sight of each bruised and blackened figure, is cause for celebration - until one member of the crew is found inside his shelter with a knife in his back. With darkness comes snow, making immediate rescue impossible, and Anna must tend to the physical and emotional wounds of the crew while seeking the identity of the murderer in their midst.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Hunt Club",
        "Authors": "By Lott, Bret",
        "Description": "In this lyrically written, hauntingly seductive novel, Bret Lott brings to life the beauty and flavor of the mist-covered swamps and backlands of South Carolina&#39;s Lowcountry in a story that is both mystery and rite of passage. At fifteen, Huger (\"you say it YOU-gee\") Dillard already knows a great deal about the ways of the world--or so he thinks. He may not have a father, but with the guidance of his blind \"Unc,\" Leland, and weekends spent at the Hunt Club--a tract of woods and swamp belonging to his family--Huger knows all about the land and the habits of its wildlife, from deer to the pompous Charleston doctors and lawyers who come to hunt them. But nothing can prepare him for the dark events that begin to unfold when he and Unc stumble upon the body of a well-to-do Charleston regular on their land.  Who wanted him dead? And why is the Hunt Club suddenly at the heart of a dark secret worth killing for? Caught in a treacherous labyrinth that stretches deep into the past, Huger and everyone he loves are about to discover painful truths that will irrevocably change them; truths that will shatter a young boy&#39;s innocence and test him as a man.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "House warming with Charlie Wing",
        "Authors": "By Wing, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Dark Homecoming",
        "Authors": "By Lustbader, Eric",
        "Description": "Ex-New York cop Lew Croaker dedicated fifteen years to helping rid society of vermin and psychopaths. His commitment cost him his left hand, which eventually led to a feeling of burnout that found him leaving the force for Florida, a fishing boat, and the family he desperately needs. Croaker hasn't spoken to his sister Matty in years, and he's never even met Rachel, his troubled teenage niece. Suddenly, nothing is as important to him as reconciling this loss. Now, Croaker is determined to become the brother - and uncle - he's neglected to be for longer than he cares to remember.But Rachel is hours away from death in a Miami hospital, and a compatible kidney donor has yet to turn up for his only niece. The slick attorney who sniffs Croaker out has an offer he's hard-pressed to refuse. All Croaker has to do is accept Marcellus Majeur's package: one kidney in exchange for Croaker's services. To kill one man.Through Miami's chic South Beach, the funky nightspots of the Florida Keys, and the shadowy Everglades, Croaker accelerates his quest to save Rachel. He has but hours to either commit a cold-blooded, irrevocable act of murder or find out who engineered the scheme. But while Croaker plays the hunter, an inescapable malevolence stalks him - from the sea, the jungles - and from the depths of an unthinkably twisted mind.",
        "Category": " Fiction , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "58.61",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Last Resort: A Novel",
        "Authors": "By Lurie, Alison",
        "Description": "Like a loyal victorian wife, Jenny has devoted her life to her much older husband, the famous writer and naturalist Wilkie Walker, bringing up their children and researching and editing his best-selling books. But this year, as winter approaches, Wilkie is increasingly depressed and withdrawn. At her wit's, Jenny persuades him to visit Key West, the Last Resort. Within weeks of their arrival Jenny not only has a part-time job but is becoming involved with assorted local characters, including Gerry, an ex-beatnik poet, and Lee, the dramatically attractive manager of a women-only guesthouse. Wilkie, meanwhile, is planning his own \"accidental\" death by drowning-a task that turns out to be more difficult than he thought-and trying to avoid the attentions of a breathless young female fan.",
        "Category": " Fiction , Literary",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Hour Game (King & Maxwell)",
        "Authors": "By Baldacci, David",
        "Description": "A woman is found murdered in the woods with a very special watch on her wrist - and what seemed a simple case soon escalates into a nightmare. The criminal methods of some of the most infamous killers of all time are being replicated by a new predator who stalks and strikes victims with a cunning brilliance. No one can understand the murderer's motives or who the next victim will be.Drawn into this violent affair are two Secret Service agents turned private investigators, Sean King and Michelle Maxwell. Both have been hired to prove a man's innocence in a domestic burglary involving an aristocratic, if dysfunctional, family. Soon stunning secrets will lead the partners into the middle of a frantic search for a killer unlike any they've confronted before.As the Hour Game barrels forward, Sean and Michelle face a macabre puzzle and uncover one horrifying revelation after another. Nearing the truth, they will find that their own lives are in danger. And then they're hit with the biggest surprise of all. When you play the Hour Game, you have to play to win. But time is running out  for all of them.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Divorce and Remarriage for Catholics?",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Image",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Patience of a Saint",
        "Authors": "By Greeley, Andrew M.",
        "Description": "A brush with death convinces Red Kane, a Chicago newspaper columnist, to investigate the connection between Harv Gunther, a powerful politician, and the recent murder of a teenage girl",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Summer at the Lake",
        "Authors": "By Greeley, Andrew M.",
        "Description": "For childhood friends Leo Kelly, Jane Devlin, and newly ordained \"Packy\" Keenan, the summers they spent at the lake together were times of pure magic. And no summer was more enchanting than the summer of 1948 - until a tragic car wreck killed two of their friends.The rich and prominent \"Old House\" families of Chicago banded together to protect their own - the driver, who was drunk, was the son of a local doctor. The car had belonged to Leo, whose family was middle class, so the police quickly arrested him and tried to force a confession. To make matters more complicated, half a million dollars in counterfeit bills had been found in the trunk. There was a cover-up and a vicious scandal. Leo left for the Korean War, and the three friends' summers at the lake were gone forever...Until thirty years later - when Leo, still obsessed by the memory of Jane and the need to solve the mystery of what really happened that fateful summer, comes back to Chicago and back to the lake.Jane is more beautiful than ever, but her life has been an unhappy one, trapped in a loveless marriage and haunted by the memory of Leo. She has returned to the lake to try to piece her life back together.Disillusioned with the priesthood, Packy realizes he's in love with Jane, too. But as a best friend and confidant to Leo and Jane, he faces a difficult choice this summer: should he help his oldest friend win back the woman of his dreams or pursue what might be his own last chance for love?",
        "Category": " Fiction , General",
        "Publisher": "Forge",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "A Groom of One's Own: And Other Bridal Accessories",
        "Authors": "By Pond, Mimi",
        "Description": "An antidote to stuffy, traditional marriage guides advises the bride-to-be with an irreverent mixture of wit and wisdom",
        "Category": " Humor , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Eastern Europe - Pa",
        "Authors": "By Brown, J. F.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Duke University Press",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Words for Your Wedding",
        "Authors": "By Glusker, David Lowell (EDT) and Misner, Peter (EDT)",
        "Description": "In the excitement of planning a wedding in all its detail, the beauty and meaning of the words exchanged can sometimes be overlooked. To help you find and create the perfect ceremony, ministers David Glusker and Peter Misner have compiled this do-it-yourself guide that walks you through the entire wedding ceremony, offering both contemporary and traditional readings and prayers.From the gathering words to the final blessing, this collection of wedding traditions lets you design a ceremony that is right for you—whether it is an established service, a combination of elements from various traditions, or a newly created celebration of your own.This practical resource for couples and ministers alike also includes special sections featuring: the civil ceremonythe Roman Catholic and ecumenical weddingthe Jewish weddingtips for how to write your own serviceguidelines for renewing your wedding vows",
        "Category": " Reference , Weddings",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "The Walls Around Us: The Thinking Person's Guide to How a House Works",
        "Authors": "By Owen, David",
        "Description": "A beginner's guide to home repair and maintenance wittily explains everything from the use of drywall screws, to strategies for kitchen renovation, to resolving the great latex versus oil paint debate. Reprint.",
        "Category": " House & Home , Repair",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Certain Trumpets: The Nature of Leadership",
        "Authors": "By Wills, Garry",
        "Description": "The Pulitzer Prize-winning author of Lincoln at Gettysburg offers a gallery of portraits that examine the interplay among leaders and followers and identify the essential elements of successful leadership. Reprint. 25,000 first printing.",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Fax This Book: Over 100 Sit-Up-and-Take-Notice Cover Sheets for Better Business",
        "Authors": "By Caldwell, John",
        "Description": "Nationally syndicated cartoonist John Caldwell solves the problem of how to make your fax stand out in a sea of unfurlingpaper with over 100 reusable, attention-getting cover sheets for every kind of business correspondence. Each page is certifiably photocopiable and faxable; perforations on the left margin make for clean removal. John Caldwell's daily and Sunday panels are distributed by King Features Syndicate. He is also the author of Faxable Greeting Cards, The Book of Ultimates and Caldwell. 180,000 copies in print.",
        "Category": " Business & Economics , Business Writing",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Lives Behind the Lines: 20 Years of For Better or For Worse (Volume 21)",
        "Authors": "By Johnston, Lynn",
        "Description": "It's hard to believe we've known and loved the Pattersons for two decades. This lively family-Elly and John and their kids, Michael, Elizabeth, and April-has grown and changed, yet always retained its heartwarming combination of wit and wisdom. Through the years, this extraordinary clan has become like treasured relatives to millions of devoted fans. In Behind the Lines-the new collection that celebrates the strip's 20-year anniversary-For Better or For Worse creator Lynn Johnston takes us on a trip down memory lane, looking back over some of the strip's most memorable moments: Farley's heroics and death. Elly's concerns about aging. Michael's early days at college. Presented as a scrapbook, Behind the Lines includes a chapter for Elly, John, Michael, Elizabeth, and April, highlighting formative times in their lives. Johnston's commentary adds a behind-the-scenes element, as she describes some of her thoughts about the strip over the years. An abundance of her favorite color and black-and-white cartoons makes this must-have book a guaranteed winner with the strip's most ardent fans.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Always Kiss with Your Whiskers: Love Advice from My Cat: Always Kiss with Your Whiskers: Love Advice from My Cat",
        "Authors": "By Timmons, Bonnie (ILT), Nickles, Elizabeth, and Asseyev, Tamara",
        "Description": "A tongue-in-cheek guide to love, romance, and etiquette from a cat's point of view provides humorous advice to single females about relationships with men",
        "Category": " Humor , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "10,000 Ways to Say I Love You",
        "Authors": "By Godek, Gregory J. P.",
        "Description": "",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Sourcebooks Casablanca",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Binky Brothers and the Fearless Four",
        "Authors": "By Lawrence, James, Kessler, Leonard",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1970"
        }
    },
    {
        "Title": "Sons of the City: A Novel",
        "Authors": "By Flander, Scott",
        "Description": "Sooner or later, every cop must decide whether getting the job done means crossing a line that could cost him his career, his freedom, and even his soul. And for those who patrol the streets of Philadelphia, that line sometimes seems all too easy to cross. When a street cop is killed in a rundown crack house, his indignant fellow cops predictably start rounding up every young black man in sight. Even after the cop's sergeant, Eddie North, discovers the Mafia may have been behind the murder, tension between the police and the black community continues to escalate.Fueled by the surrounding discord, Eddie becomes obsessed with taking the mob boss down for good. And he's getting help from an unexpected source -- the slain cop's sister. Also a police officer, she is going undercover as the mob boss's lover to get the inside scoop on her brother's murder. But infiltrating the mob is no easy task, and Eddie watches in jealous alarm as she starts slipping precariously into the Mafia life. As the city heads toward a racial conflagration and street cops go to war with the mob, Eddie discovers what can happen when people -- particularly cops -- try to create and inflict their own ideas of justice. With dead-on insight into the private world of the police force -- the unexpected, terrifying danger, as well as the comic moments -- Scott Flander takes the reader right onto the streets and reveals, in an unforgettable cityscape, the powerful forces that can tear apart the urban fabric.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Culture and Commitment: A Study of the Generation Gap",
        "Authors": "By Mead, Margaret",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "AIDS: The Ultimate Challenge",
        "Authors": "By Kubler-Ross, Elisabeth",
        "Description": "AIDS\"None of us is so unique as to be exempt from the human condition.\"As the numbers of reported AIDS cases continue to climb, and the disease continues to take more and more lives, those who have to deal with the complexities of this problem continue to ask: \"How do we care for these terminally ill?\"Using letters from patients, questions and answers between patient and doctor, and other compassionate tools, Dr. Elisabeth Kübler-Ross, the world's foremost expert on death and dying, shows us how to comfort the seriously ill and help AIDS patients through the critical \"stages of dying\" She addresses the stigma surrounding AIDS as a \"gay disease\" and makes a special plea for prisoners with AIDS, for women and children with AIDS, and for babies with AIDS. This remarkable book is warm and informative on one of the most important subjects of our time.",
        "Category": " Psychology , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Forgiveness, the Passionate Journey: Nine Steps of Forgiving through Jesus Beatitudes",
        "Authors": "By Wuellner, Flora Slosson",
        "Description": "This book explores Jesus’ understanding of forgiveness, taking forgiveness out of the realm of “victimhood” and revealing it as release and healing.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "The Upper Room",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Mary Engelbreit's Outdoor Companion: The Mary Engelbreit Look and How to Get It (Mary Engelbreit's Companion)",
        "Authors": "By Engelbreit, Mary, Lyons, Charlotte, and Martin, Barbara Elliott (PHT)",
        "Description": "In Mary Engelbreit's Outdoor Companion, the third volume in her successful decorating series, Mary takes readers outside to play. With the help of her friends, Mary presents new inspirational ideas for readers to carry across the threshold of their homes, and into the great outdoors.Engelbreit fans will learn to bestow the artist's creative touch on their own porches, backyards, and gardens.The Outdoor Companion will be an invaluable and beautiful resource for the countless Americans who are expanding their decorating to the exterior of their homes.",
        "Category": " Architecture , Landscape",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "David Brinkley: A Memoir",
        "Authors": "By Brinkley, David",
        "Description": "THE NEW YORK TIMES BESTSELLER\"It seems to me now that Huntley's and my success lay mainly in the fact that we were new, as television was new, and we had few competitors. . . . Nearly everything we did had never been done before. . . . What is now commonplace was in its beginning a grand and glorious adventure for the people of our country and the world, a vicarious balloon ride into the stars. . . .\"Just how a young man growing up in a small southern town with only one one-hundred-watt A.M. radio station and no network affiliation became one of the world's most respected broadcasters in the nation makes for a \"grand and glorious adventure\" in itself. Now, in this fascinating and charmingly candid memoir of a career spanning half a century, David Brinkley recollects from his own unique vantage point the remarkable, shaky beginnings of television news, the ever-changing social and political landscape of our country, and the colorful people who have crossed his path. He includes priceless moments playing poker with Harry Truman, riding the rails with Winston Churchill, being whisked off by helicopter to Camp David by Lyndon Johnson, and receiving the distinguished Medal of Freedom from George Bush. From the New Deal to the Contract with America, David Brinkley has seen it all. . . and he knows how to tell a story--especially his own.\"Reading it is like sitting in your living room, having a conversation with this wonderful man. He writes the way he talks, the words flowing easily and comfortably; the book, a wry, elegant, funny, intimate, always interesting, often insightful trip across 75 years.\"--The Boston Globe\"A WEALTH OF ANECDOTES.\"--San Francisco Chronicle\"CHOCK FULL OF GOOD STORIES.\"--The Christian Science MonitorA NEW YORK TIMES NOTABLE BOOK",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "1812",
        "Authors": "By Nevin, David",
        "Description": "It was a glorious war and a magnificent age...An age that would decide whether America would grow into a vast global power, sweeping all the way to the Pacific or be broken, its divided pieces remaining small adjuncts to a mighty England. A war that would claim the breadth of the continent for America or cede that vast expanse to England and Spain.Among the many men and women who would forge the future of our young nation's destiny were: James and Dolley Madison - Together they face the ultimate presidential decision: Should they take the nation into a war for which it isn't prepared? Andrew and Rachel Jackson - They speak for the West, for the frontier drive. Their enduring marriage gives Jackson the fortitude to dominate history in the battle that will determine our nation's future. Winfield Scott - The young soldier who takes us headlong into the battle that will define American Army professionalism for all time. Sally McQuirk - The daughter of a Washington publisher who is determined to cover the war as a journalist.In their lives and loves, their hopes and fears, we live the thirty months of the war that shaped American destiny.",
        "Category": " Fiction , Historical",
        "Publisher": "Forge",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Amazing Grace: A Vocabulary of Faith",
        "Authors": "By Norris, Kathleen",
        "Description": "A NEW YORK TIMES NOTABLE BOOK OF THE YEARFrom the New York Times-bestselling author of The Cloister Walk, a book about Christianity, spirituality, and rediscovered faith.Struggling with her return to the Christian church after many years away, Kathleen Norris found it was the language of Christianity that most distanced her from faith. Words like \"judgment,\" \"faith,\" \"dogma,\" \"salvation,\" \"sinner\"—even \"Christ\"—formed what she called her \"scary vocabulary,\" words that had become so codified or abstract that their meanings were all but impenetrable. She found she had to wrestle with them and make them her own before they could confer their blessings and their grace. Blending history, theology, storytelling, etymology, and memoir, Norris uses these words as a starting point for reflection, and offers a moving account of her own gradual conversion. She evokes a rich spirituality rooted firmly in the chaos of everyday life—and offers believers and doubters alike an illuminating perspective on how we can embrace ancient traditions and find faith in the contemporary world.",
        "Category": " Religion , Faith",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Cost Accounting: A Managerial Emphasis",
        "Authors": "By Horngren, Charles T., Datar, Srikant M., and Foster, George",
        "Description": "",
        "Category": " Business & Economics , Accounting , Managerial",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.05",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Forever Fifty: And Other Negotiations",
        "Authors": "By Viorst, Judith",
        "Description": "The author offers lyrical, compassionate, and witty observations about turning fifty years old and facing middle age",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Tracing Your Civil War Ancestor",
        "Authors": "By Groene, Bertram Hawthorne",
        "Description": "It is tantalizing to speculate about the role your ancestors may have played in the great national drama of the Civil War. But family records are often inaccurate, or provide precious few leads on where to begin the search.Now, experienced historian Bertram Hawthorne Groene shows you how easy it is to trace your forbearers' role in the war, where and how long they fought, whether they were Union or Rebel, soldier or sailor -- even with a minimum of information.Tracing Your Civil War Ancestor provides you with:-- The names and addresses of all state archives.-- The names and addresses of institutions that hold microfilmed service records from the national archives.-- Names and publishers of useful regional Civil War reference books.-- Names and publishers of sourcebooks for identifying Civil War weapons and accoutrements.-- And much more.Historians, genealogists, antique dealers, and collectors of Civil War artifacts will find this concise guidebook of great value. But most of all it is of inestimable practical value to family historians, North and South, who are discovering the pleasure and satisfaction of compiling an accurate family history.",
        "Category": " Reference , Genealogy & Heraldry",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Taylor's Encyclopedia of Gardening: Horticulture and Landscape Design",
        "Authors": "By Taylor, Norman",
        "Description": "15,000 entries telling how and when to plant over 9,000 species of plants, and how to care for and design gardens",
        "Category": " Technology & Engineering , General",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "June",
            "Year": "1961"
        }
    },
    {
        "Title": "Holy Man: Father Damien of Molokai",
        "Authors": "By Daws, Gavan",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "University of Hawaii Press.",
        "Price Starting With ($)": "6.27",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Everyone Worth Knowing",
        "Authors": "By Weisberger, Lauren",
        "Description": "WHAT HAPPENS WHEN A GIRL ON THE FRINGE ENTERS THE REALM OF NEW YORK'S CHIC, PARTY-HOPPING ELITE?  Soon after Bette Robinson quits her horrendous Manhattan banking job like the impulsive girl she's never been, the novelty of walking her four-pound dog around her unglamorous Murray Hill neighborhood wears as thin as the \"What are you going to do with your life?\" phone calls from her parents. Then Bette meets Kelly, head of Manhattan's hottest PR firm, and suddenly she has a brand-new job where the primary requirement is to see and be seen inside the VIP rooms of the city's most exclusive nightclubs. But when Bette begins appearing in a vicious new gossip column, she realizes that the line between her personal and professional life is...invisible.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Complete Cancer Survival Guide: The Newest, Most Comprehensive, Cutting-Edge Source for All the Latest Information on Each of the 25 Most Common Forms of Cancer",
        "Authors": "By Bashe, Philip and Teeley, Peter",
        "Description": "Diagnosis * Staging * Treatment Options * Procedures and Medications * Clinical TrialsWhen you are fighting for your life, you must be sure to know your enemy and have at your disposal the most effective weapons there are. Peter Teeley and Philip Bashe provide a complete arsenal of absolutely essential information for anyone diagnosed with cancer.Drawing on the advice and information provided by dozens of top specialists at all the major cancer centers in the United States, The Complete Cancer Survival Guide provides the most up-to-date, cutting-edge information available on how each of the 25 most common forms of cancer is diagnosed and staged, what the most advanced treatments are, and where to go throughout the country to be sure that the care you receive is absolutely the best there is.In down-to-earth language, THE COMPLETE CANCER SURVIVAL GUIDE maps out a practical game plan for obtaining the best care available. Drawing on advice provided by dozens of top specialists at all of the major cancer centers around the United States, the authors provide the most up-to-date information on which to base decisions about where to seek treatment and to make sense of the many therapy choices that may seem at odds with one another. THE COMPLETE CANCER SURVIVAL GUIDE is a bible on which to rely not only for learning about how to navigate the health-care maze and obtain the best care, but also for learning how to best care for yourself--physically, emotionally, spiritually, and financially. -->",
        "Category": " Medical , Oncology",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Decorating With Marble Stone and Granite",
        "Authors": "By Parsons, Christine",
        "Description": "A guide to the decorating possibilities of marble, stone, and granite introduces interior design styles and room settings which use the materials for counter tops, paneling, floors, and other purposes",
        "Category": " Architecture , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Nightmares & Dreamscapes",
        "Authors": "By King, Stephen",
        "Description": "A new collection of short stories, several being published for the first time, offers a spine-tingling journey to the nightmare world created by a master of sheer terror and grotesque imagination. 1,500,000 first printing. $400,000 ad/promo. BOMC.",
        "Category": " Fiction , Horror",
        "Publisher": "Viking",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Washington Hostess Cookbook",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Ancient Mesopotamia: Portrait of a Dead Civilization",
        "Authors": "By Oppenheim, A.Leo",
        "Description": "",
        "Category": "",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "February",
            "Year": "1969"
        }
    },
    {
        "Title": "Island of the Aunts",
        "Authors": "By Ibbotson, Eva and Hawkes, Kevin (ILT)",
        "Description": "When the kindly old aunts decide that they need help caring for creatures who live on their hidden island, they know that adults can't be trusted. What they need are a few special children who can keep a secret-a secret as big as a magical island. And what better way to get children who can keep really big secrets, than to kidnap them! (After all, some children just plain need to be kidnapped.) Don't miss this wildly inventive and funny read from master storyteller Eva Ibbotson.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Chicken Soup for Every Mom's Soul: 101 New Stories of Love and Inspiration for Moms of all Ages (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Shimoff, Marci (COM), and McNamara, Heather (COM)",
        "Description": "An inspiration for moms everywhere!\"These stories made my heart smile.\"  -Catherine Oxenberg, actressIt will change your life forever.Although you undoubtedly heard those six words many times after announcing that you were expecting, you couldn't have imagined what they really meant. And then the moment came. You held your baby in your arms and felt an outpouring of emotion like you had never known before. And just like they said, nothing was ever the same.Motherhood is a lifelong journey that's as unique as every woman who embarks on it. No other role defines us as deeply and fills us with as much compassion, or tests our strength and patience more extremely! No other relationship fills our hearts with as much love, wonder and awe for another human being.Although motherhood is a timeless calling, today's moms have unique challenges and rewards. In this book you'll learn from other mothers and seasoned grandmothers who share the universal worries, the tears and the laughs that come with the job, as well as the wisdom to help you be the very best mom you can be.These stories are for every mom, whether you're an expectant or an adoptive mom, a stay-at-home or working mom, or a grandmother watching your grandchildren grow. Share this book with any mom to remind her of the profound role she will forever play in her child's life.",
        "Category": " Self-help , Spiritual",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Warrior Queens",
        "Authors": "By Fraser, Antonia",
        "Description": "Recounts the lives of more than a dozen women through the ages who assumed the role of warrior queen, from Boudica in 60 AD to Golda Meir, Indira Gandhi, and Margaret Thatcher in the twentieth century",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Whad'Ya Know?",
        "Authors": "By Feldman, Michael",
        "Description": "The host of the popular American Public Radio show, \"Whad'ya Know?\", offers a unique perspective on life in the Midwest, discussing topics ranging from home remodeling, to politics, to middle age",
        "Category": " Humor , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "8.7",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "How to Play Guitar : A New Book for Everyone Interested in the Guitar",
        "Authors": "By Evans, Roger",
        "Description": "Detailed, nontechnical instructions, clear diagrams, and helpful professional advice cover choosing the right guitar, tricks for tuning, fundamental chords, reading music and tablature, rhythm guitar, fingerpicking, key signatures, and transposition",
        "Category": " Music , Musical Instruments , Guitar",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "Twentieth-Century Music",
        "Authors": "By Salzman, Eric",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "God's Dream Team: A Call to Unity",
        "Authors": "By Tenney, Tommy",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Error patterns in computation: A semi-programmed approach",
        "Authors": "By Ashlock, Robert B.",
        "Description": "",
        "Category": "",
        "Publisher": "Merrill",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Four Reforms: A Program for the Seventies",
        "Authors": "By Buckley, William F.",
        "Description": "",
        "Category": "",
        "Publisher": "G. P. Putnam's Son",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Only Investment Guide You'll Ever Need: Newly Revised and Updated",
        "Authors": "By Tobias, Andrew",
        "Description": "Presumably readers who bought and used the 1978 first edition will not need this one. Other personal investors will find tips on when and when not to invest in stocks, tax strategies, who to trust to manage money, how much life insurance to buy, what to do in case of a big inheritance, and related matters. No bibliography. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Beginning Writer's Answer Book",
        "Authors": "By Polking, Kirk (EDT)",
        "Description": "Answers questions most frequently asked of  Writer's Digest  (the monthly magazine) editors. Encompasses both the processes and techniques of writing as well as marketing and publishing aspects. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "A Guide to Zuni Fetishes and Carvings",
        "Authors": "By McManis, Kent",
        "Description": "A slim, useful guide to the delightful small animal carvings known as fetishes.  Fetishes are made by many Native American tribes, but the most renowned carvers are the Zuni. The author discusses several carving families and their distinctive styles, the features and powers of the various animals, and the basics of collecting. Abundantly illustrated. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": "",
        "Publisher": "Treasure Chest Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Memoir of Roger Brooke Taney, LL.D.,: Chief justice of the Supreme court of the United States",
        "Authors": "By Samuel Tyler",
        "Description": "",
        "Category": "",
        "Publisher": "J. Murphy & co",
        "Price Starting With ($)": "49.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1872"
        }
    },
    {
        "Title": "Instant Massage for Stress Relief",
        "Authors": "By Evans, Mark",
        "Description": "",
        "Category": " Health & Fitness , Massage & Reflexotherapy",
        "Publisher": "Lorenz Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "War Stories: Operation Iraqi Freedom (With DVD)",
        "Authors": "By North, Oliver",
        "Description": "The mainstream media are trying to discredit our victory in Iraq by saying there was no reason to take out Saddam. But Oliver North knows better. He was there. Embedded with Marine and Army units for FOX News Channel during Operation Iraqi Freedom, North (himself a decorated combat veteran) vividly tells the story his camera gave us glimpses of during the campaign to liberate Iraq. This updated edition features a new chapter detailing the events after the end of major hostilitiesincluding the capture of Saddam Husseinand brand-new action photos straight from the front line.",
        "Category": " Philosophy , Political",
        "Publisher": "Regnery History",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Walker's Companion (Nature Company Guides)",
        "Authors": "By Ferber, Elizabeth (EDT), Forbes, Bill, and Wallace, David Rains (EDT)",
        "Description": "A handbook for amateur naturalists describes what to look for on nature walks and discusses the different environments found in North America",
        "Category": " Science , General",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The End of Harry Potter?",
        "Authors": "By Langford, David",
        "Description": "The publication of Harry Potter and the Deathly Hallows, the seventh and final Harry Potter novel, is probably the most eagerly anticipated event in the history of publishing.  Even the smallest hints from author J. K. Rowling about what may happen to Harry and his friends have been major news stories.In The End of Harry Potter?, David Langford—Potter fan and award-winning writer—delves into the many mysteries which remain unsolved.  Is Albus Dumbledore really dead? Whose side is Severus Snape really on? What are the remaining horcruxes, where He Who Shall Not Be Named has stashed his soul? Does Harry bear a part of the Dark Lord's soul in his scar, and is this why he understands Parseltongue?J. K. Rowling is the only person who knows the answers to these questions. But in this highly entertaining book, Langford uses his deep knowledge of the six published Harry Potter novels to explore these and other mysteries, and to present a selection of possible outcomes.Only the publication of Harry Potter and the Deathly Hallows will lay these questions to rest, but in the meantime, fans of the series will find David Langford's book entertaining and thought-provoking, and a perfect way to refresh their memory of the first six books in readiness for the last.",
        "Category": " Young Adult Nonfiction , Literary Criticism & Collections",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Here Comes the Strikeout!",
        "Authors": "By Kessler, Leonard",
        "Description": "With lessons on practice and perseverance, this is the perfect beginning reader for kids who love baseball! Bobby loves baseball. He can run the bases fast. He can slide. He can catch the ball. But he has never hit the ball. A lucky bat won’t do the trick—though with hard work and determination, Bobby might just hit a home run. Full of charming illustrations and simple text by Leonard Kessler, this Level Two I Can Read is for readers who have begun reading on their own, but still need a little help.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins Children's Book Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "The Meaning of your Dreams",
        "Authors": "By Martini, Franklin D",
        "Description": "",
        "Category": "",
        "Publisher": "Ottenheimer Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Victoria-Sisters No Frie",
        "Authors": "By Sunshine, Linda",
        "Description": "",
        "Category": " Family & Relationships , Siblings",
        "Publisher": "HearstMag",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "The Art of Doing Nothing: Simple Ways to Make Time for Yourself",
        "Authors": "By Vienne, Veronique",
        "Description": "The Art of Doing NothingSimple Ways to Make Time for YourselfA culture of overachievers, we make things happen--and happen fast. While rushing along, though, the days seem to get shorter and shorter. If only time would hold still, just a little bit, to let us savor life's simplest moments. . . .The Art of Doing Nothing will help to ease these beat-the-clock jitters. The stress-reducing techniques described here require no time, no skill, no commitment. A practical guide to rest and relaxation, it ushers us into a world where \"being\" is more compelling than \"doing.\" Beautifully illustrated with Erica Lennard's photographs, The Art of Doing Nothing gives us permission to celebrate idleness in all its mesmerizing forms. Véronique Vienne's delightfully informative essays on the art of breathing, meditating, bathing, listening, waiting, and more offer useful tips on such skills as how to whistle, stay in the moment, take a nap, cure a cold, or watch the sun set over the horizon. Without further ado--and without feeling guilty--we learn to unwind, exhale, and, yes, stop and smell the roses.Like Ira Gershwin, you will be delighted to discover that you've got plenty of nothin', and that nothin's plenty for you.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Potter Style",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Forest",
        "Authors": "By Roger Caras",
        "Description": "An evocation of life in a northwestern American forest concentrates on a golden eagle's two-week stay in a conifer grove during which time bears, weasels, mountain lions, and other animals struggle to maintain the continuity of their species",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Far Out Exploring Nature With Binoculars",
        "Authors": "By Christina Wilsdon",
        "Description": "",
        "Category": "",
        "Publisher": "SIMON & SCHUSTER @ TRADE",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Sun Also Rises (Cliffs Notes)",
        "Authors": "By Carey, Gary K.",
        "Description": "This is the book that chronicled the lives and times of \"the Lost Generation,\" American expatriates that filled Europe between the world wars. Hemingway's expatriates are there for two different reasons: one is there solely for entertainment, the other, to heal from the horrors of war and create something worth living for. Wounded Jake Barnes narrates a great, difficult love story.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "CliffsNotes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1964"
        }
    },
    {
        "Title": "Taking Charge Of Change: Ten Principles For Managing People And Performance",
        "Authors": "By Smith, Douglas K.",
        "Description": "Cooking up great ideas of how things ought to be is easy. Getting things to actually change is hard, especially in large, complex organizations. The meeting about ”the new vision” goes over fine, then everyone drifts back to his or her office and nothing changes. This book provides the diagnostic tools managers need to assess their particular needs for change, and then the tool kit required to implement the changes one wants to see.",
        "Category": " Business & Economics , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Flea: The Definitive Guide to Hunting, Gathering, and Flaunting Superior Vintage Wares",
        "Authors": "By Zubrod, Sheila and Stern, David",
        "Description": "For pop culture junkies and there are many, flea markets are mirrors of the American mind as much as shopping venues. To them, owning a slice of our history is as important as finding that perfect piece to adorn the living room; adding to a collection; or just to getting a good bargain.   In this increasingly cookie-cutter, IKEA world, flea markets have endured, grown and recently shown an upscale trend. In Flea, Zubrod and Stern help make the flea market experience and process easy and enjoyable. They describe places to go, what to look for, how to tell what&#39;s \"a good thing\" and what&#39;s not and how to incorporate a find into an original home aesthetic. They also introduce readers to more than 50 classics items from the recent past that serve as the backbone of a new trend in art: from club chairs to cocktail shakers, Bauer pottery to Ring-Ding glass, fly-fishing gear to barbed wire. They also list the major flea market meccas in America, the world and on the World Wide Web; offer strategies for hunting; and show how dozens of today&#39;s top designers have woven their flea finds into their lives.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    }
]