[
    {
        "Title": "The Natural History of North America",
        "Authors": "By Ricciuti, Edward R.",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "In Private-In Public: The Prince and Princess of Wales",
        "Authors": "By Burnet, Alastair",
        "Description": "Shows highlights from the Royal couple's official trips to Australia, the U.S., Austria, Canada, and Japan, and provides a behind-the-scenes look at their family life and their personal staff",
        "Category": " History , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Thornyhold",
        "Authors": "By Stewart, Mary",
        "Description": "When Gilly Ramsey, whose childhood has been one of lonely isolation, inherits an English country home steeped in magic, she discovers an intriguing, mysterious world, and a man who teaches her to love",
        "Category": " Fiction , Gothic",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Marya: A Life",
        "Authors": "By Oates, Joyce Carol",
        "Description": "Limns an emotionally incisive, hauntingly resonant portrait of a modern woman in search of self-understanding and fulfillment",
        "Category": " Fiction , Literary",
        "Publisher": "E. P. Dutton",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "The Country Cousin",
        "Authors": "By Auchincloss, Louis",
        "Description": "Rebelling against Old Guard New York society, Amy Hunt runs off with a married man, returns disgraced, marries the family lawyer, and lives happily until the blackmail begins",
        "Category": " Fiction , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "My Young Years",
        "Authors": "By Rubinstein, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A. Knopf, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The last Kennedy",
        "Authors": "By Sherrill, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Dial Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Secret Correspondence",
        "Authors": "By Golub, Marcia",
        "Description": "While writing the biography of her mother, Gabby Segul, Lara Jacob becomes obsessed with Gabby's diary, just as her Gabby had become obsessed with the diary of her uncle",
        "Category": " Fiction , General",
        "Publisher": "Ticknor & Fields / Houghton Mifflin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Taking Care of Your Child: A Parent's Guide to Medical Care",
        "Authors": "By Fries, James F., Pantell, Robert H., and Vickery, Dona",
        "Description": "",
        "Category": "",
        "Publisher": "Westview Press",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "GOWER STREET",
        "Authors": "By Rayner, Claire",
        "Description": "",
        "Category": " Fiction , Historical",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1973"
        }
    },
    {
        "Title": "A Soldier in Search of Peace: An Inside Look at Israel's Strategy in the Middle East",
        "Authors": "By Tamir, Avraham",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "God's Equal (English and French Edition)",
        "Authors": "By Absire, Alain and Rothschild, Jon (TRN)",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "The Finalists",
        "Authors": "By Braddon, Russell",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Born To Be King : Prince William Of Wales",
        "Authors": "By Hall, Trevor",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "Handbook of Magazine Article Writing",
        "Authors": "By Jean M. Fredette",
        "Description": "How to write, revise, and market. The introducation is an interview with Bob Greene. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Eater's Choice: A Food Lover's Guide to Lower Cholesterol",
        "Authors": "By Goor, Ron and Goor, Nancy",
        "Description": "After clearly explaining what blood cholesterol levels mean, the authors demonstrate how to lower and control it by making wise food choices and present two weeks of menu plans that feature more than two hundred recipes",
        "Category": " Health & Fitness , General",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "The War Against Parents: What We Can Do for America's Beleaguered Moms and Dads",
        "Authors": "By West, Cornel and Hewlett, Sylvia Ann",
        "Description": "Sylvia Ann Hewlett, noted feminist scholar and child advocate, and Cornel West, Harvard philosopher and well-known human rights leader, join in a rare partnership to explore one of the most painful problem of our times. Why are hundreds of thousands of American children \"dangling and dangerous\" and millions more failing to thrive? At the heart of our children's agony is a frightening erosion of the parenting role - not because parents are less devoted than they used to be but because the whole world is stacked against them. Big business, government, and the wider culture are waging a silent war against parents, undermining the work they do. Adults raising children have been harmed by managerial greed, pounded by tax and housing policy, and invaded and degraded by the entertainment industry. In The War Against Parents, Hewlett and West present a blueprint for parent empowerment, which they call a G.I. Bill for the Twenty-first Century. United behind an agenda that spans the divides of race, gender, and class. The War Against Parents is both a visionary and an intimate book. Hewlett and West explore their childhoods -- strangely similar stories of growing up in family-centered blue-collar communities in Wales and California -- and with striking candor tell of their struggles to be a good mother and a good father in our parent-hurting society. Lending moral heft to the work parents do, Hewlett and West provide comfort and hope. There is not a parent among us who is not hungry for such healing.",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The New Joy of Sex",
        "Authors": "By Comfort, Alex",
        "Description": "A new edition of the classic guide to sex provides thorough and practical advice on enjoying safe, healthful, and fulfilling lovemaking",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "Crown",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Painting the Town : An Adventure in France",
        "Authors": "By Walt Disney Company",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Enterprises",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Creative Art for the Developing Child; A Teacher's Handbook for Early Childhood Education.",
        "Authors": "By Cherry, Clare",
        "Description": "",
        "Category": "",
        "Publisher": "Lake Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Merv",
        "Authors": "By Merv griffin",
        "Description": "The popular television personality combines a candid account of his private life with a reminiscence of his career--from radio singer to talk-show host--and stories about celebrities he has known and interviewed",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "America A to Z: People, Places, Customs, and Culture",
        "Authors": "By Editors of Reader's Digest",
        "Description": "Mix Red Barber, the White House, and a touch of the blues, and you have America A To Z, a colorful portrait of our nation. Like many a Norman Rockwell painting, it captures what is familiar and what is best about America. Hot dogs and hot rods. Big bands and baseball. Oreos and the Oregon Trail.Remember the Alamo? How about the Automat...the Merrimac...Jack Kerouac? This book has the dish on dishwashers, the skinny on dieting, and the scoop on ice cream. It's got the word on Walter Winchell and Walt Whitman, all the info on RFD, UFOs, VCRs, and M&Ms.Here's a parade of fun facts, famous faces, and historic milestones that leads straight down memory lane. Whether you grew up with soda fountains or Silly Putty, Milton Berle or the Brady Bunch, it's a nostalgic trip you'll want to take again and again.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Corduroy's Christmas",
        "Authors": "By Freeman, Don, McCue, Lisa (ILT), and Hennessy, B. G.",
        "Description": "A holiday story starring the classic teddy bear beloved by children for 50 years    Celebrate Christmas with everyone's favorite bear and this charming lift-the-flap book. Join in all of Corduroy's holiday activities, from trimming the tree to baking Christmas cookies. Discover the magic of Christmas with Corduroy in this festive tale, perfect for even the youngest reader.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Better Homes and Gardens HEARTS To Stitch & Craft",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "6.26",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The True History of the Elephant Man",
        "Authors": "By Howell, Michael, Ford, Peter",
        "Description": "A biographical and medical exploration of the tormented life of John Merrick, a nineteenth-century cripple who became the most famous \"professional freak\" in history",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Faith of My Fathers: A Family Memoir",
        "Authors": "By McCain, John and Salter, Mark",
        "Description": "Senator John McCain learned about life and honor from his grandfather and father, both four-star admirals in the U.S. Navy. Both their careers and their courage helped prepare McCain for the biggest challenge of his life when, as a naval aviator, he was shot down over Hanoi in 1967 and seriously injured. When his captors realized McCain's impressive military legacy, they offered him early release. In what has now become a legendary act of heroism, McCain refused the offer and was subsequently tortured, held in solitary confinement, and imprisoned for more than five years.Faith of My Fathers is about what McCain learned from his father and grandfather, and how their example enabled him to survive. Told with humility, grace, and humor, it is a story of three imperfect men who faced adversity and emerged with their honor intact. It is a story to inspire and instruct, one that shows what fathers give to their sons, and what, ultimately, endures.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Curse of Madame \"C\" (A Far Side Collection) (Volume 20)",
        "Authors": "By Larson, Gary",
        "Description": "More than 150 cartoons from one of America's most outlandish cartoonists explore a world of bee-hive-haired women, talking bugs, and bespectacled animals, in a new collection by the creator of \"The Far Side.\" Original. 900,000 first printing.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews And McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Golf Book",
        "Authors": "By Bartlett, Michael",
        "Description": "An anthology of essays--by both noted writers and accomplished golfers--discusses highlights in the history of golf, revealing the thoughts and observations of such devotees as Alistair Cooke, George Plimpton, Ian Fleming, and Jack Nicklaus",
        "Category": " Sports & Recreation , General",
        "Publisher": "Arbor House Pub Co",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Soaring with the Phoenix: Renewing the Vision, Reviving the Spirit, and Re-Creating the success of your company",
        "Authors": "By Belasco, James A. and Stead, Jerre",
        "Description": "The co-author of Flight of the Buffalo and one of America's top executives present a revolutionary program filled with a wealth of tips and techniques that will help any organization rise to the pinnacle of success during times of change and insecurity. 75,000 first printing.",
        "Category": " Business & Economics , Management",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Giving up America",
        "Authors": "By Abraham, Pearl",
        "Description": "When Deena decides to marry Daniel, an Orthodox Jew, her father, a Hasidic scholar, opposes the marriage for Kabbalistic reasons: the sum of the numbers assigned to the Hebrew letters in their names equals the numerical value of the Hebrew word for \"pain.\" Yet the marriage appears blessed.When Daniel brings home the new temp from work, a young southerner in training for the Miss America pageant, and her best friend, the couple and the two women form an immediate and unlikely foursome. But soon cracks begin to appear in the foundation of Deena and Daniel's marriage, and the values that Deena grew up with are thrown into question, along with the very notion of \"home.\"Giving Up America charts the conflict between the religious and the secular, between Hasidic and Orthodox practices, between being single and being married. It painfully juxtaposes the inner desires, expectations, and imaginings of its characters with the workaday realities and choices we all face.",
        "Category": " Fiction , Literary",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Fallen Angels (Millwood Hollow Series #1)",
        "Authors": "By Hickman, Patricia",
        "Description": "Jeb Nubey hides a secret about his past that has left him alienated from his family and hiding from the law.",
        "Category": " Fiction , Historical",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Standard Book of Quilt Making and Collecting (Dover Quilting)",
        "Authors": "By Ickis, Marguerite",
        "Description": "Here is the best available book on quilt making — a complete, easy-to-follow guide that shows you how to make beautiful, useful quilts that you will be proud to own and display. Even if you are a beginner, you will soon find yourself quilting like an expert by following these clearly drawn patterns, photographs, and step-by-step instructions.All the information you need is here, lucidly and thoroughly explained. You'll learn how to plan the quilt, the number of blocks to fit a bed, how to select the pattern to harmonize with the design and color of the room, and how to choose materials. Clear directions explain how to cut, sew, and make applique patterns, patchwork, and strips. An entire chapter on design discusses basic elements, sources, making your own designs, avoiding sewing problems, how to use the rag bag, and much more. The section on patterns gives directions on tracing, seam allowance, and estimating quantity. There is full information on borders, quilting, and tufting, and just about every other aspect of quilt making.Mrs. Ickis shows you over 100 traditional and unusual quilts, including Basket, Tree of Life, Flowers in a Pot, Traditional Geometric, Friendship, Square and Cross, Saw Tooth, Drunkard's Path, Flying Geese, Mexican Cross, Pennsylvania Dutch, Crazy Quilts, Yo-yo Quilts, Album Quilts, and dozens of others, including over 40 full-size patterns. You are given other uses for quilting, such as drapes, curtains, upholstery, lunch cloths, purses, cushions, and Italian quilting.Completing the coverage are fascinating chapters on collecting quilts as a hobby; how to make full-size patterns of famous American quilts from pictures, small designs, and museum or collector's quilts; and a history of quilt making with personal memories.",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1959"
        }
    },
    {
        "Title": "War on Debt: Breaking the Power of Debt (Financial Freedom Series, V. 1)",
        "Authors": "By Avanzini, John",
        "Description": "",
        "Category": "",
        "Publisher": "His Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Glory Days: Bruce Springsteen in the 1980's",
        "Authors": "By Marsh, Dave",
        "Description": "Presents a review of The Boss's life, career, and music during the five years that witnessed his rise to international fame",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "When Bad Things Happen to Good People",
        "Authors": "By Kushner, Harold S.",
        "Description": "When Harold Kushner's three-year-old son was diagnosed with a degenerative disease that meant the boy would only live until his early teens, he was faced with one of life's most difficult questions: Why, God? Years later. Rabbi Kushner wrote this contemplation of the doubts and fears that arise when tragedy strikes. Kushner shares his wisdom as a rabbi, a parent, a reader, and a human being.",
        "Category": "",
        "Publisher": "Schocken",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Donahue",
        "Authors": "By Donahue, Phil",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "Killjoy",
        "Authors": "By Garwood, Julie",
        "Description": "Avery Delaney has always tried to put the past far behind her. Abandoned by her rapacious, conniving mother when she was only three days old, Avery was raised by her grandmother and beloved aunt Carolyn. Then, when she was eleven, she witnessed her grandmother's violent death, before Avery herself was shot and left for dead. Miraculously she survived. The man responsible is serving time in a Florida prison. This traumatic experience propels Avery into a life of law and order.Her razor-sharp mind and ability to gather data and decipher evidence has made Avery an expert crime analyst for the FBI. But soon she will have to use every one of her skills on a case that hits painfully close to home.Avery's workaholic aunt, Carolyn Salvetti, is certain her (hopefully soon-to-be ex-) husband sent her the gold embossed reservation to the posh Utopia Spa in the mountains of Colorado. At first she is resistant, but then she figures it will be a welcome respite from the cutthroat advertising business, not to mention a networking extravaganza. Plus she persuades her niece to join her for the two weeks of luxury and decadence.But Carolyn never makes it to Utopia. Under false pretenses, she is taken to an isolated retreat by a handsome stranger with a dazzling smile, suave demeanor, and the darkest of motives. His name is Monk, a hired assassin. Now, with scant clues and fewer resources, Avery must track down and save Carolyn - and outmaneuver a brilliant killer who is part of an elaborate plot of madness and lethal vengeance.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Blackwood Farm (The Vampire Chronicles)",
        "Authors": "By Rice, Anne",
        "Description": "In her new novel, perennial bestseller Anne Rice fuses her two uniquely seductive  strains of narrative -- her Vampire legend and her lore of the Mayfair witches --  to give us a world of classic deep-south luxury and ancestral secrets. Welcome to  Blackwood Farm: soaring white columns, spacious drawing rooms, bright, sun-drenched  gardens, and a dark strip of the dense Sugar Devil Swamp. This is the world of Quinn  Blackwood, a brilliant young man haunted since birth by a mysterious doppelgänger,  “Goblin,” a spirit from a dream world that Quinn can’t escape and that prevents him  from belonging anywhere. When Quinn is made a Vampire, losing all that is rightfully  his and gaining an unwanted immortality, his doppelgänger becomes even more vampiric  and terrifying than Quinn himself. As the novel moves backwards and forwards in  time, from Quinn’s boyhood on Blackwood Farm to present day New Orleans, from ancient  Athens to 19th-century Naples, Quinn seeks out the legendary Vampire Lestat in the  hope of freeing himself from the spectre that draws him inexorably back to Sugar  Devil Swamp and the explosive secrets it holds. A story of youth and promise, of  loss and the search for love, of secrets and destiny, Blackwood Farm is Anne Rice  at her mesmerizing best.",
        "Category": " Fiction , Occult & Supernatural",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Vinegar Hill (Oprah's Book Club)",
        "Authors": "By Ansay, A. Manette",
        "Description": "In a stark, troubling, yet ultimately triumphant celebration of self-determination, award-winning author A. Mannete Ansay re-creates a stifling world of guilty and pain, and the tormented souls who inhabit it. It is 1972 when circumstance carries Ellen Grier and her family back to Holly's Field, Wisconsin. Dutifully accompanying her newly unemployed husband, Ellen has brought her two children into the home of her in-laws on Vinegar Hill--a loveless house suffused with the settling dust of bitterness and routine--where calculated cruelty is a way of life preserved and perpetuated in the service of a rigid, exacting and angry God. Behind a facade of false piety, there are sins and secrets in this place that could crush a vibrant young woman's passionate spirit. And here Ellen must find the straight to endure, change, and grow in the all-pervading darkness that threatens to destroy everything she is and everyone she loves.",
        "Category": " Fiction , Psychological",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Exit Wounds (Joanna Brady Mysteries, Book 11)",
        "Authors": "By Jance, Judith A.",
        "Description": "The incomparable J. A. Jance returns with a powerful tale that explores the darkest corners of human nature, revealing the grievous injuries inflicted behind locked doors, the unseen wounds that bleed and destroy and never heal ...The heat is a killer in Cochise County, Arizona, with temperatures over 100 degrees. In the suffocating stillness of an airless trailer, a woman is lying dead, a bullet hole in her chest. Why someone would murder a harmless loner with a soft spot for stray dogs is only one of the questions  nagging at the local police; another is why the killer used an eighty-five-year-old bullet, fired from the same weapon that slaughtered two other women who were discovered bound, naked, and gruesomely posed on the remote edge of a rancher's land.The slayings are as oppressive as the blistering heat for Sheriff Joanna Brady, who must shoulder the added double burden of a brutal reelection campaign and major developments on the home front. With suddenly more on her plate than many big-city law officers have to contend with, Joanna must put marital distractions and an opponent's dirty tricks in the background and deal with the terrifying reality that now threatens everyone in her jurisdiction: a serial killer in their midst.A twisted and lethal drama is unfolding in this small corner of the southwestern desert as fear, hatred, and the evil at the core of one family's history come to a rapid boil beneath a merciless Arizona sun. Pressure mounts for Sheriff Brady personally and professionally while she pursues a sadistic murderer into the shadows of the past to get to the roots of a monstrous obsession ... and expose the permanent wounds of a crime far worse than homicide.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "How to Be Awake and Alive",
        "Authors": "By Newman, Mildred",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Fit or Fat Woman",
        "Authors": "By Bailey, Covert and Bishop, Lea",
        "Description": "Specific diet and exercise advice that addresses the particular needs of women, including chapters covering metabolism, hormones, and social pressures. This book combines physiological knowledge, aerobic and strength exercises, and diet basics.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Harvest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "And So It Goes",
        "Authors": "By Ellerbee, Linda",
        "Description": "Examines the internal operations of television news and answers many basic journalistic questions beginning who, what, when, where, why",
        "Category": " Performing Arts , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "The Rowan",
        "Authors": "By McCaffrey, Anne",
        "Description": "The Rowan, a beautiful and powerful psychic who was the sole survivor of a mining accident on Jupiter's moon Callisto, finds love for the first time when she meets fellow telepath Jeff Raven",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Reinhart's Women",
        "Authors": "By Berger, Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "The Delacorte Press/Seymour Lawrence",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "How to Be Your Own Stockbroker",
        "Authors": "By Schwab, Charles",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "The Man Who Ate the 747",
        "Authors": "By Sherwood, Ben",
        "Description": "J.J. has clocked the world's longest continuous kiss, 30 hours and 45 minutes. He has verified the lengthiest single unbroken apple peel, 172 feet 4 inches. He has measured the farthest flight of a champagne cork from an untreated, unheated bottle, 177 feet 9 inches. He has tasted the world's largest menu item, whole-roasted Bedouin camel.But in all his adventures from Australia to Zanzibar, J.J. has never witnessed great love until he comes upon a tiny windswept town in the heartland of America, where folks still talk about family, faith, and crops. Here, where he least expects it, J.J. discovers a world record attempt like no other: Piece by piece, a farmer is eating a Boeing 747 to prove his love for a woman.In this vast landscape of cornfields and lightning storms, J.J. is doubly astounded to be struck by love for the same woman, Willa Wyatt of the honey eyes and wild blond hair. It is a feeling beyond measure, throwing J.J's carefully ordered world upside down, proving that hearts, like world records, can be broken, and the greatest wonders in life cannot be quantified.",
        "Category": " Fiction , Humorous",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Lost Years (Star Trek)",
        "Authors": "By Dillard, J. M.",
        "Description": "Recounts the adventures of the crew of the Enterprise after they completed their original five-year mission, detailing how Kirk, McCoy, and Spock managed to enter into as much danger as they did when they were in space",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "A Hole in the World: An American Boyhood",
        "Authors": "By Rhodes, Richard",
        "Description": "A mother's suicide leads to chaos and family violence in Rhodes's moving and terrifying memoir of loss and eventual triumph as he describes his traumatic childhood",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Chocolate For A Teen's Soul: Life-changing Stories For Young Women About Growing Wise And Growing Strong",
        "Authors": "By Allenbaugh, Kay (EDT)",
        "Description": "From the bestselling Chocolate series, a powerful collection for teenagers offering true stories about growing wise and growing strong.Rich, enticing, and delectable as a luscious box of chocolates, this collection offers 55 tales of life and love as a teenager. From teens of every age, including women who remember what it was like, come stories of first love, first jobs, best friends, heartbreak, hope, innocence, and the real world. Poignant, funny, and powerful, these stories tell it like it is. From the recollection of a first kiss to tales of self-consciousness about a changing body, from painful struggles with parents and grandparents to the joy of abiding family love, teens will see themselves in these pages and find comfort in knowing that they are not alone.",
        "Category": " Self-help , General",
        "Publisher": "A Fireside Book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Select",
        "Authors": "By Wilson, F. Paul",
        "Description": "A stunning blockbuster of a novel that combines the terror of modern medicine run amok - in the manner of Robin Cook - with the gripping suspense of John Grisham's The Firm.Quinn Cleary has always wanted to be a doctor. Yet the only way she can afford it is to win acceptance to The Ingraham, an exclusive, privately funded medical school and research center reputed to be the nation's finest. The few select students chosen by The Ingraham receive a completely free medical education: tuition, room, board, and lab fees all paid by the school.Once accepted to the school of her dreams, Quinn dives into her studies and into a steady relationship with a classmate. At last, her life seems perfect.Or is it? Quinn begins to notice subtle changes in her classmates: the way they act, the way they think - all seem to be falling eerily into line with the messianic vision of the school's director. She confides her concerns to her boyfriend, who laughs them off - until he finds a suspicious electronic monitoring device in his room.Then he disappears....Alone on the deserted campus during midyear break, Quinn Finally encounters the dark truth about The Ingraham - the true purpose of the institute's seemingly humane medical research, the motives that have determined the school's policy, and the secret mission of the hospital's intimidating security force, a small private army that is drawing an ever tighter net around her with each passing minute.What she discovers is immense and terrifying - a conspiracy that exposes her to a danger more frightening than death - a cynical plot that undermines everything she has ever believed about the healing arts.This is suspense fiction at its grandest: instantly and relentlessly compelling, and touching directly on an issue that heads the list of our national and personal priorities.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "11.43",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Columbus and the Age of Discovery (The New Book Of Knowledge)",
        "Authors": "By Dor-Ner, Zvi and Scheller, William",
        "Description": "A lavishly illustrated (with some 240 color and 96 b&w illustrations, photos, charts, and maps) complement to the PBS documentary of the same name, which, however, stands by itself as a thoughtful contribution to the literature of the Columbus quincentenary drawing upon the knowledge of international experts in fields as diverse as navigation, religion, anthropology, the history of colonialism and trade, agriculture, and epidemiology, to explore the complexities of the Columbus legend. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "S.O.S: Chilling Tales of Adventure on the High Seas",
        "Authors": "By Nickles, Sara (EDT)",
        "Description": "Where there's an ocean, there are always adventure tales to be told. In the good old-fashioned tradition of story-telling, S.O.S. collects 19 intriguing tales--both fictional and true, classic and contemporary. From the depths of H. G. Wells's The Abyss to the tempest in Sebastian Junger's The Perfect Storm, these spine-tingling stories are as varied as the moods of the sea itself. A sturdy book with rounded corners and large type, S.O.S. is perfect for a week-long sail or an afternoon adventure in the armchair. Selected Contributors: Joseph Conrad, Stephen King, Gabriel Garcia Marquez, Sebastian Junger, Paul Theroux, Ernest Hemingway.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Secret of Happiness",
        "Authors": "By Graham, Billy",
        "Description": "Tells how one can find happiness through poverty, mourning, meekness, hunger, mercy, purity, peacemaking, and in spite of persecution",
        "Category": " Religion , Christian Life , Spiritual Growth",
        "Publisher": "Word Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "American Appetites",
        "Authors": "By Oates, Joyce Carol",
        "Description": "Glynnis McCullough, terribly drunk, quarrels with her husband Ian and falls through a window to her death--an accident leading to his conviction on a murder charge and their suburban community's shock",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "9.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Night of the Fox",
        "Authors": "By Higgins, Jack",
        "Description": "When an American officer who knows the time and place of the D-Day invasion disappears on German-occupied Jersey, the Allies choose Harry Martineau to direct the rescue mission",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Other People's Marriages",
        "Authors": "By Thomas, Rosie",
        "Description": "When seductive young widow Nina Cort returns to her hometown to put the past behind her, a chance encounter with a childhood friend opens the door to a circle of five very close, seemingly happily married couples. They are Andrew and Janice Frost, forever giving parties; rich and successful Darcy Clegg and Hannah, his sexy young wife; Vicky and Gordon Ransome, expecting their third child; libidinous Jimmy Rose and Star, his enigmatic wife; and Michael Wickham, married to Marcelle, a woman as complex as her famous five-course meals.To Nina, they represent everything that she has lost: love, safety, children, companionship. But then she is drawn to one of the men, and their passionate affair ignites a series of infidelities that reveals the cracks beneath the apparently smooth surfaces of these marriages. Over the course of a year, each pair is forced to renegotiate the terms of their relationship. No one emerges unscathed or unchanged. Nina herself is in for a shock: The marriage that she mourns, that she saw as perfect, was flawed.Author Rosie Thomas's unerring eye shines a powerful spotlight on both the mundane and extraordinary moments that make up domestic life. Though the vulnerability of relationships is exposed, so, too, are the strengths of the marriage bonds, and of the bonds of friendship among women. Other People's Marriages is a powerful portrait of the vagaries of attraction, friendship, and love.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "A Wild And Lonely Place: A Sharon McCone Mystery",
        "Authors": "By Muller, Marcia",
        "Description": "For months, the embassies of oil-rich nations have been the target of an elusive terrorist known only as the Diplo-Bomber. A federal task force, which includes one of Sharon McCone's closest police contacts, is stumped - until a botched bombing attempt threatens the San Francisco consulate of Azad, a progressive Arab emirate.At first McCone is thinking only of the $1 million reward offered by the FBI and the Azadis. But when she learns more about the consulate household, McCone suspects that someone inside the turbulent ruling family may be linked to the bombing. The Azadis' consul general is the western-educated Malika Hamid, one of only a few Muslim women to brave the world of international diplomacy. An intriguing mix of eastern traditions and modern ideas, Malika is fiercely controlling the lives of her playboy son and his beautiful, alcoholic American wife. Torn between her troubled parents is the lonely, nine-year-old Habiba, a mischievous imp of a girl who takes an immediate liking to McCone.When little Habiba disappears, McCone follows her trail to a desolate Caribbean island that has its own brand of justice. Now McCone and her allies, including her lover, Hy Ripinsky, find themselves in an arena far larger than any they have been in so far. Here McCone is risking not only her own life but those of many others as the mission takes her dangerously close to the edge of disaster. For this is a battle that could destabilize U.S. international relations - and one in which McCone must literally fight fire with fire...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Broken Promise Land",
        "Authors": "By Muller, Marcia",
        "Description": "When her brother-in-law, a country music superstar, begins receiving blackmail threats from an enemy from his past, Detective Sharon McCone plunges into the ruthless, play-for-keeps world of the country music industry",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Lucky Ones",
        "Authors": "By Mortman, Doris",
        "Description": "The Lucky Ones is the sweeping story of four women bound by friendship, secrets, and an invincible will to succeed. As the Presidential election heats up, the stage is set for last-minute power plays and explosive political intrigue as each woman competes in the highly charged, male-dominated arena where winning is everything.Zoe Vaughn has just been named foreign policy advisor to Ben Knight, a widowed Democratic senator making a bid for the Presidency - and Zoe's first love. They met at Harvard, but their ambitions led them down separate paths. Now, twenty years later, their lives once again converge. Yet they both harbor secrets from the world and from each other...secrets their unscrupulous enemies will not hesitate to use against them.Georgie Hughes is a congresswoman from a powerfully connected Texas dynasty. The wife of a philanderer, who has always done what others expected of her, she stuns everyone when she is nominated for Vice President on the Republican ticket. But her illicit love affair could destroy her dreams of office...and unearth a shameful episode from her past.Celia Porter has come a long way from Florida beauty queen to Harvard-educated journalist for a national television network. Having won the coveted spot of chief reporter covering the election, she can't risk having her old sins exposed...even if it means betraying a cherished friend.Kate Siegel is still reeling from the tragedy that rocked her world and estranged her from her husband. Founding a group to protect children against sex criminals was her way of fighting back. But when she is suddenly thrust into the spotlight, she finds herself torn between two of her closest friends from opposing political parties...and between a reconciliation with her husband and a love affair with someone new.Friends Enemies. Lovers. They are all players in a high-stakes game of power and politics only one can win. It is a race that will sweep from Texas to Massachusetts to Washington, D.C., where Ben Knight's boyhood friend - now is most formidable enemy - plots his downfall. It's all here, from the behind-the-scenes power struggles to before-the-cameras spin...from a campaign trail fraught with unexpected reversals and searing betrayals to the final moment of decision between victory and failure.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Fibromyalgia: A Comprehensive Approach What You Can Do About Chronic Pain and Fatigue",
        "Authors": "By Williamson, Miryam Ehrlich",
        "Description": "Fibromyalgia: A Comprehensive Approach is the first thorough, user-friendly resource that outlines the causes, symptoms, and a full range of treatments for a condition that affects 10 to 12 million Americans. Since fibromyalgia (FM) mimics other illnesses, many people who experience chronic pain and fatigue don't know that they have FM or think they have something else. Ms. Williamson has gathered information from top medical specialists, research studies, and practical advice form FM sufferers who share their strategies for working around FM's disabling symptoms. You will discover: * How to find the right doctor* Which pain medicines and nondrug therapies work best* The role deep sleep deprivation plays in FM and what you can do to remedy sleep disturbance* How exercise and nutrition affect FM symptoms* Massage, meditation, and relaxation techniques that help* What to watch for in detecting and treating FM in children Anyone who suffers from FM-- and the more than 15 similar or related illnesses-- knows that the pain is not \"all in your head.\" The symptoms are real, and although there is no cure for FM, this book offers realistic, effective ways to live a full life despite FM.",
        "Category": " Health & Fitness , Diseases , General",
        "Publisher": "Walker Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "A Handbook for Christian Maturity",
        "Authors": "By Bright, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Campus Crusade for Christ International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "Myron",
        "Authors": "By VIDAL, GORE and Box, Edgar (CON)",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1974"
        }
    },
    {
        "Title": "More Memories",
        "Authors": "By Emery, Ralph and Carter, Tom",
        "Description": "One of the most exciting best-sellers in recent memory was Ralph Emery's Memories, the autobiography of the popular host of TNN's Nashville Now. Across the country, fans made the book a phenomenal success, keeping it high on the New York Times best-seller list for six months.The reason was simple: people love Ralph Emery and his wonderful recollections about the world of country music. And now Emery, who over the course of forty years in broadcasting has come to know and launch a thousand country stars, among them Patsy Cline, Loretta Lynn, Dolly Parton, and Barbara Mandrell, picks up where Memories left off.Emery himself says his first book drew on less than one percent of his memories of his years on television. With More Memories, he takes readers backstage and into the limelight with tales about dozens of top stars, including Willie Nelson, Jimmy Dean, Reba McEntire, Roger Miller, Porter Wagoner, Glen Campbell, George Jones, Loretta Lynn, Dolly Parton, Garth Brooks, and many, many more. Readers will travel the same roads these stars have traveled: roads of happiness, despair, excess, recovery, estrangement, and reconciliation. Their stories are at once harrowing, funny, inspiring, and heartwarming.Within these pages, Emery uncovers new facts - and mysteries - surrounding the death of Patsy Cline; reveals how the Grammy Awards Show ended up in Nashville one year, and why it may never return there again; explains why a square-dance call during a Bob Wills show in Texas mortified the local gentry; and relates the visit of Roy Acuff's ghost to the TNN offices. And those are just a few of the memories Emery shares.Illustrated with many never-before-seen photographs, More Memories offers a wealth of enjoyment for readers and fans everywhere.",
        "Category": " Music , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "War and Remembrance",
        "Authors": "By wouk, herman",
        "Description": "This sequel and conclusion to The Winds of War traces the destinies of its characters--especially the fate of the Henry family--during the turbulent years of World War II",
        "Category": " Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "The Brass Ring: A Sort of a Memoir",
        "Authors": "By Mauldin, William Henry",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Sophie's Choice",
        "Authors": "By Styron, William",
        "Description": "As the fierce lovemaking and fights of Nathan, a paranoiac Jewish intellectual, and Sophie, a Polish-Catholic concentration-camp survivor, intensify, Stingo, a writer who lives below them in a cheap rooming house, becomes more and more involved in their lives",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.33",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "A View from the Bench (The People's Court)",
        "Authors": "By Wapner, Joseph A.",
        "Description": "The star of television's \"People's Court\" relates his most unforgettable courtroom adventures--stories that provide memorable lessons in law, the unpredictability of human nature, and old-fashioned justice",
        "Category": " Law , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Catfish: My Life in Baseball",
        "Authors": "By Keteyian, Armen and Hunter, Jim (Catfish)",
        "Description": "The former pitcher for the New York Yankees and Oakland A's recounts his baseball experiences, from the beginning of his career, to his retirement after fifteen years of pro ball, to his election to the Hall of Fame",
        "Category": " Biography & Autobiography , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "A Grand Passion",
        "Authors": "By MacKey, Mary",
        "Description": "Natasha Ladanova, the illegitimate child of a great dancer, is succeeded by her daughter, Tatiana Trey, and her granddaughter Alysa Rochina, on the premiere ballet stages of the world",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Looking Glass: A Novel (The Locket Series)",
        "Authors": "By Evans, Richard Paul",
        "Description": "When I started to write The Looking Glass, I intended to create a story about the healing power of hope and love. But as this story developed, a message began to emerge that I had not foreseen, a message about the distorted mirror in which we view ourselves, binding ourselves with shackles of self-doubt and fear.  The Looking Glass is aptly named, for it is about seeing the reality of ourselves: to see a true reflection of who we are.  It is the story of Hunter Bell, a Presbyterian minister turned gambler, and the founder of a gold camp named Bethel. (Which you may remember was Esther's hometown in The Locket.) He is running from the bitter memories of his past, his ministry, and ultimately, from his God.  Venturing into a blizzard to chase away wolves drawn close to his cabin by hunger, Hunter finds a beautiful young woman in the snow, wounded by the wolves and half dead with the cold. Her name is Quaye McGandley, and she is an Irish woman sold into marital slavery to a brutal husband who then brought her to America against her will. As Hunter nurses her back to health, he finds that his tender ministrations to Quaye have opened his heart to his greatest fear -- that he might love again.  It is my hope that you, and those with whom you share my book, might through its message better see the divinity within yourself and the reality of who you are: worthy of love, gentleness, and grace.  With hope,  Richard Paul Evans   When I started to write The Looking Glass, I intended to create a story about the healing power of hope and love. But as this story developed, a message began to emerge that I had not foreseen, a message about the distorted mirror in which we view ourselves, binding ourselves with shackles of self-doubt and fear.  The Looking Glass is aptly named, for it is about seeing the reality of ourselves: to see a true reflection of who we are.  It is the story of Hunter Bell, a Presbyterian minister turned gambler, and the founder of a gold camp named Bethel. (Which you may remember was Esther's hometown in The Locket.) He is running from the bitter memories of his past, his ministry, and ultimately, from his God.  Venturing into a blizzard to chase away wolves drawn close to his cabin by hunger, Hunter finds a beautiful young woman in the snow, wounded by the wolves and half dead with the cold. Her name is Quaye McGandley, and she is an Irish woman sold into marital slavery to a brutal husband who then brought her to America against her will. As Hunter nurses her back to health, he finds that his tender ministrations to Quaye have opened his heart to his greatest fear -- that he might love again.  It is my hope that you, and those with whom you share my book, might through its message better see the divinity within yourself and the reality of who you are: worthy of love, gentleness, and grace.  With hope,  Richard Paul Evans",
        "Category": " Fiction , Romance , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Trophies and Dead Things",
        "Authors": "By Muller, Marcia",
        "Description": "Investigator Sharon McCone probes the strange will of murder victim Perry Hilderly, who had disinherited his children to leave his fortune to four strangers, and uncovers a tangled web of old secrets leading back to the Vietnam War",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "20.85",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Who steals my name ...?",
        "Authors": "By FRASER, James",
        "Description": "",
        "Category": "",
        "Publisher": "Published for the Crime Club by Doubleday",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Presidential Campaigns",
        "Authors": "By Paul F. Boller, Jr.",
        "Description": "A history of the American presidential elections from 1789 to 1980, highlighting the hoopla, diversity, mudslinging, oratory, and serious issues of the campaigns",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Lust and Other Stories",
        "Authors": "By Minot, Susan",
        "Description": "",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Where have you gone, Joe DiMaggio?: The story of America's last hero",
        "Authors": "By Allen, Maury",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Elements of Expression: Putting Thoughts into Words",
        "Authors": "By Plotnik, Arthur",
        "Description": "A unique, compact, witty guide to writing and speaking vividly and expressively offers engaging examples of adventurous language grouped under such headings as \"The Power of Tough Talk\" and \"Infusions for Tired Vocabularies.\"",
        "Category": " Social Science , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Maximum Leadership: The World's Leading Ceo's Share Their Five Strategies for Success",
        "Authors": "By Farkas, Charles M., De Backer, Philippe, and Backer, Philippe De",
        "Description": "In the summer of 1994, the authors of this book began traveling across North America, Europe, and Asia to interview the heads of more than 160 major multinational corporations, in industries as diverse as entertainment, banking, diamond mining, and semiconductors. Their goal was to explore the role of the CEO - to discover how the men and women at the pinnacle of some of the world's most prominent companies fulfill their role as leaders. They came away not with abstract theories about management but with real stories about how CEOs actually spend their days, whom they see, where they go, which decisions they make, which they don't, and why. In the process, the authors uncovered new and provocative evidence that there exist five distinct styles of leadership. In Maximum Leadership they illustrate those styles - or \"approaches,\" as they call themwith vivid examples and the candid voices of CEOs at companies such as Coca-Cola, Gillette, Nintendo, Hewlett-Packard, Goldman Sachs, and Nestle.",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Louis Rukeyser's Book of Lists",
        "Authors": "By Rukeyser, Louis",
        "Description": "Where are the top places in America to avoid bankers? Where are the healthiest places to live? What were the worst-performing NASDAQ stocks last year? And the best-performing? Who are the most generous people in America? What is the cost per victory in Major League Baseball? And in the NBA? Who are the highest-paid female executives? What is your risk of being audited by the IRS? What are some of the silliest laws in America? Which are America's fastest-growing companies?The answers to these questions comprise just the merest fraction of the diverse and entertaining information in Louis Rukeyser's Book of Lists. Numbering 185 in all, these lists indicate the best, the worst, and the funniest from the worlds of business, finance, and politics.To add further to readers' enjoyment, a number of men and women also from these worlds were invited to contribute their own lists, among them William Simon, Donald Rumsfeld, Elaine Garzarelli, Arthur Levitt, Mary Farrell, Julius Westheimer, and Charles Schwab.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Avenger",
        "Authors": "By Forsyth, Frederick",
        "Description": "Attorney Calvin Dexter hangs his shingle in a quiet New Jersey town, has a reasonably successful practice, and takes the hills strong while triathalon training. But Dexter is no ordinary man. ***The summer before he goes to college, Ricky Colenso travels to Bosnia to volunteer as an aid worker. A few weeks later, he disappears and is never heard from again. A family grieves and is offered little hope--in the fog of that horrible time and place, the killer, too, has vanished.***Or so it would seem. For in a world that has forgotten right and wrong, there are few like Cal Dexter who can settle the score. And so, years later, a worldwide chase is on and Dexter begins to draw a net around the killer. But this time CIA agent Paul Devereux must find a way to stop Dexter before his quest for vengeance throws the world into chaos.***A heart-stopping novel of murder and mystery, double-cross and triple-cross, old loyalties and new hatreds, Avenger has all of Frederick Forsyth's page-turning trademarks.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Where the River Runs",
        "Authors": "By Henry, Patti Callahan",
        "Description": "New York Times bestselling author Patti Callahan Henry delivers an engaging novel about a South Carolina woman who goes back home to face the past—and discovers herself.Meridy Dresden was once a free-spirited, fun-loving girl. All that changed when the boy she loved was killed in a tragic fire. Since then, she alone has carried the burden of a terrible secret. Now, years later, married to a wonderful man and mother of a teenage son, she is shocked to learn that a childhood friend is being blamed for that long-ago fire. Fearful but determined, Meridy returns to the South Carolina Lowcountry and summons the courage to make a decision that may destroy her well-ordered life, her family’s reputation, her contented marriage, and everything she’s worked so hard to protect…including her heart.“Brilliant. Powerful. Magical. Do not miss this book.”—New York Times bestselling author Haywood Smith",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Practical Miracles for Mars and Venus: Nine Principles for Lasting Love, Increasing Success, and Vibrant Health in the Twenty-first Century",
        "Authors": "By Gray, John",
        "Description": "Practical advice from the author of the No. 1 hardcover of the last decade for filling each day with wonder,power, and fulfillment.Awaken your power to create practical miracles so that you can adjust to life's challenges and respond with greater peace, joy, and love.John Gray provides nine guiding principles to live by:Believe as if miracles are truly possible.Live as if you are free to do what you want.Learn as if you are a beginner.Love as if for the first time.Give as if you already have what you need.Work as if money doesn't matter.Relax as if everything will be okay.Talk to God as if you are being heard.Feast as if you can have whatever you want.Practical Miracles for Mars & Venus also presents new practical tools for taking charge of your destiny.",
        "Category": " Self-help , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Bereaved Parent",
        "Authors": "By Schiff, Harriet Sarnoff",
        "Description": "Offers guidance to parents facing the imminent death of a child, shocked by an accidental death, or suffering post-funerary turmoil, grief, and depression, and shows a way through the day-to-day hardships and decisions",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "Stop Aging Now!: Ultimate Plan for Staying Young and Reversing the Aging Process, The",
        "Authors": "By Carper, Jean",
        "Description": "In Stop Aging Now!, Jean Carper -- winner of the 1995 Excellence in Journalism Award from the American Aging Association (the nation's leading group of scientists investigating the biomedical aspects of aging), nationally syndicated columnist and leading authority on health and nutrition -- documents how antioxidant vitamins, minerals, herbs and food chemicals are the magic youth potions humans have been seeking for centuries. Based on exciting new scientific findings from leading institutions, Stop Aging Now! reveals the stunning truth: Much of what we call aging is not inevitable, but is needless and can be prevented and reversed to a startling degree by supplements and foods. Indeed, aging is often due to unsuspected deficiencies that can be readily corrected, and even people in their sixties, seventies and eighties can turn back the clock and recover their youth. Leading scientists have found that: Vitamins can prevent and reverse memory loss and other signs of aging. Vitamins and minerals can rejuvenate immune functions, restoring youthful resistance to infections and cancer. Antioxidants in foods and supplements can help prevent clogged arteries, heart attacks and general bodily deterioration. Many unfamiliar but readily available food chemicals can prolong life and preserve your vitality.",
        "Category": " Architecture , History , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Becoming Real: Defeating the Stories We Tell Ourselves That Hold Us Back",
        "Authors": "By Saltz, Gail",
        "Description": "An inspiring work that pushes us to mature past the obstacles we create for ourselves.In this refreshing and unique book, Today Show psychiatrist Dr. Gail Saltz shows how to pinpoint, deal with, and eliminate the debilitating baggage that stands in the way of success. Through revealing and intensive questionnaires, Becoming Real helps identify the symptoms that lead to repetitive self-defeating behaviors and provides essential tools for becoming a stronger person-in love, friendship, career, and in life-with a newfound confidence.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Midlife Crisis at 30",
        "Authors": "By Macko, Lia and Rubin, Kerry",
        "Description": "A guide for professional women struggling with burnout or disillusionment shares the stories of women who have had similar experiences, analyzing the social and psychological factors that affect a woman's career and relationships, and offering strategies on how to achieve a healthier personal and professional balance. Reprint.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The Breast Book",
        "Authors": "By Stoppard, Miriam",
        "Description": "The Breast Book presents a wealth of information, from the anatomy of the breast to its cultural significance and sexual character, from breast feeding and breast self-examination to cosmetic surgery, benign breast changes, and breast cancer. In her uniquely sympathetic style, Dr. Stoppard gives indispensable advice on breast care at all stages of a woman's life - from early menstruation to menopause and beyond - with particular emphasis on the early detection and treatment of breast cancer.Writing with warmth and candor, Dr. Stoppard addresses women's fears, assumptions, and feelings about their breasts. With its expert guidance and up-to-date medical information, including a comprehensive list of relevant organizations and support groups, The Breast Book offers every woman the confidence and knowledge to make informed decisions about the health of her breasts - and to take charge of her body and her life.",
        "Category": " Medical , Gynecology & Obstetrics",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Day Christ Died",
        "Authors": "By Bishop, Jim",
        "Description": "\"This is a book about the most dramatic day in the history of the world, the day on which Jesus of Nazareth died. It opens at 6 P.M.&#8212the beginning of the Hebrew day&#8212with Jesus and ten of the apostles coming through the pass between the Mount of Olives and the Mount of Offense en route to Jerusalem and the Last Supper. It closes at 4 P.M. the following afternoon, when Jesus was taken down from the cross. . . . The fundamental research was done a long time ago by four fine journalists: Matthew, Mark, Luke, and John. The rest has been added in bits and pieces from many men whose names span the centuries.\"&#8212from the Foreword",
        "Category": " Religion , Christianity , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The Reagans: Portrait of a Marriage",
        "Authors": "By Edwards, Anne",
        "Description": "The Reagans is a penetrating portrayal of one of the most powerful couples of the twentieth century. Distinguished biographer Anne Edwards paints the first in-depth, intimate portrait of the man who became our fortieth president and the woman without whom he might never have reached such heights.It was a dramatic love story from the start: Nancy was always first in Reagan's thoughts and he was paramount in Nancy's actions. But this obsessional love had a darker side for the four Reagan children. Anne Edwards brings the Reagans' dysfunctional family life into sharp focus, along with a fascinating array of supporting players such as Reagan's evangelistic mother, Nelle, Frank Sinatra, and Gerald Ford.Few first ladies had as much power as Nancy Reagan, and few were so widely disliked. Anne Edwards shows a side of her never before revealed---from Nancy's ardent defense of Reagan's interests with both opponents and supporters, to the most difficult battle yet, the struggle to maintain her husband's dignity through his descent into Alzheimer's disease.The Reagans is an original and mesmerizing look at one of America's most important presidential marriages. The Reagans is a penetrating portrayal of one of the most powerful couples of the twentieth century. Distinguished biographer Anne Edwards paints the first in-depth, intimate portrait of the man who became our fortieth president and the woman without whom he might never have reached such heights.It was a dramatic love story from the start: Nancy was always first in Reagan's thoughts and he was paramount in Nancy's actions. But this obsessional love had a darker side for the four Reagan children. Anne Edwards brings the Reagans' dysfunctional family life into sharp focus, along with a fascinating array of supporting players such as Reagan's evangelistic mother, Nelle, Frank Sinatra, and Gerald Ford.Few first ladies had as much power as Nancy Reagan, and few were so widely disliked. Anne Edwards shows a side of her never before revealed---from Nancy's ardent defense of Reagan's interests with both opponents and supporters, to the most difficult battle yet, the struggle to maintain her husband's dignity through his descent into Alzheimer's disease.The Reagans is an original and mesmerizing look at one of America's most important presidential marriages.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "The Party: A Guide to Adventurous Entertaining",
        "Authors": "By Quinn, Sally",
        "Description": "In The Party, Sally Quinn turns her trademark sharp wit on the Washington social scene and offers an irreverent look at what goes on at the parties you read about in the columns. From seating debacles to real-life scandals, she reveals her firsthand experiences as a member of the Washington power elite to illustrate how to entertain for any occasion.  No one knows better than Quinn how to make parties work. She has thrown some of the most talked-about parties and has attended most of the others. As Quinn writes, all that is necessary is that the host live by the golden rule: \"Treat your guests the way you would like to be treated.\" The Party provides a checklist of ideas to help make the important decisions?such as what time of day (or night) or month and how to choose the invitations, the place, the food, the booze, the setting, the table, the entertainment, and, above all, the guests. Within these guidelines, Quinn tells about her own adventures, stories, and techniques from all kinds of different parties?from the elaborate, formal dinner to the impromptu get-together. Her playful, poignant, and often hilarious accounts of party disasters from her own and others' parties will strike a chord with anyone who has ever entertained. The Party is not only an amusing and lively glimpse into the party scene but also a useful and practical guide to making your own parties a success and guaranteeing that your guests will want to come back.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Singing Boy: A Novel",
        "Authors": "By McFarland, Dennis",
        "Description": "On the way home from dinner one night in suburban Boston, Malcolm Vaughn is shot and killed by a stranger. His eight-year-old son, Harry, watches it happen. His wife, Sarah, holds Malcolm in her arms as he bleeds to death in the street.So begins a story of a group of people so undone by shock and grief that they lose their way in the world of the living. Sarah, a research scientist at a prestigious university, refuses to return to work and drags her heels getting Harry back to school. Malcolm's best friend, Deckard Jones, tries to help them through the crisis, but he's having one of his own: Malcolm's death has triggered memories of his tour in Vietnam. Meanwhile, Harry appears to have come through the loss unscathed, but Deckard thinks there's something much too smooth about the boy's good-little-soldier routine.Sarah, locked inside her own despair, is a widow first, a mother second. She wearies of Deckard's constant advice, on everything from how best to handle the police to the proper way to care for Harry. Too often she meets Deekard's good intentions with anger, a conflict that threatens to estrange them. When a painful discovery reveals to Sarah the depth of Harry's trouble, she is prompted to make an impulsive decision about their future that goes against the better judgment of everyone - including herself.",
        "Category": " Fiction , Psychological",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Losing My Mind: An Intimate Look at Life with Alzheimer's",
        "Authors": "By Debaggio, Thomas",
        "Description": "When Tom DeBaggio turned fifty-seven in 1999, he thought he was about to embark on the relaxing golden years of retirement -- time to spend with his family, his friends, the herb garden he had spent decades cultivating and from which he made a living. Then, one winter day, he mentioned to his doctor during a routine exam that he had been stumbling into forgetfulness, making his work difficult. After that fateful visit, and a subsequent battery of tests over several months, DeBaggio joined the legion of twelve million others afflicted with Alzheimer's disease. But under such a curse, DeBaggio was also given one of the greatest gifts: the ability to chart the ups and downs of his own failing mind. Losing My Mind is an extraordinary first-person account of early onset Alzheimer's -- the form of the disease that ravages younger, more alert minds. DeBaggio started writing on the first day of his diagnosis and has continued despite his slipping grasp on one of life's greatest treasures, memory.  In an inspiring and detailed account, DeBaggio paints a vivid picture of the splendor of memory and the pain that comes from its loss. Whether describing the happy days of a youth spent in a much more innocent time or evaluating how his disease has affected those around him, DeBaggio poignantly depicts one of the most important parts of our lives -- remembrance -- and how we often take it for granted. But to DeBaggio, memory is more than just an account of a time long past, it is one's ability to function, to think, and ultimately, to survive. As his life becomes reduced to moments of clarity, the true power of thought and his ability to connect to the world shine through, and in DeBaggio's case, it is as much in the lack of functioning as it is in the ability to function that one finds love, hope and the relaxing golden years of peace.  At once an autobiography, a medical history and a testament to the beauty of memory, Losing My Mind is more than just a story of Alzheimer's, it is the captivating tale of one man's battle to stay connected with the world and his own life.",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Paint Ideas & Decorating Techniques (Decorating Ideas)",
        "Authors": "By Better Homes and Gardens Books (EDT) and Hallam, Linda (EDT)",
        "Description": "Here is the most complete guide to paintfinishes on the market, with expert advice on affordable decorating using today’s most stylish, achievable finishes. It’s the only book that shows how to combine paint finishes and color choices for room-to-room continuity.More than 70 step-by-step photos show exactly how to achieve the desired look.Designer advice on finishes to complement every major decorating style, from country to cottage, from traditional to stylish Oriental influences.Detailed directions for the most popular decorative painting techniques.Recommended tools and materials lists for specific finishes along with time and skill level estimates.",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Making Change: A Woman's Guide to Designing Her Financial Future",
        "Authors": "By Godfrey, Neale S. and Richards, Tad",
        "Description": "\"This book is about you and your money....\"  The author of the bestselling Money Doesn't Grow on Trees extends her proven financial guidance to the millions of women who want to take control of their financial lives. In Making Change, Neale S. Godfrey -- single mother, successful author, and financial guru -- shows you exactly how to make your finances, your future, and your life work for you. Giving expert advice with a down-to-earth approach, Godfrey guides you toward financial security with her \"Design It...Do It\" motto, whether you're starting out or just determined to gain the financial confidence and competence you've always wanted.  Full of quizzes, planning tools, and inspiring anecdotes, Making Change shows you how to discover your financial personality and teaches you the life skills you will need to \"make change\" in the ways that count most:  * Learn how to manage personal banking and budgeting effectively * Find essential information on saving and investing wisely * Discover the secrets to creating, maintaining, and repairing credit * Visualize the steps you need to take for making important financial decisions * Evaluate your financial options for the future  You'll have everything you need to design and create the financially secure life you want -- and deserve.",
        "Category": " Business & Economics , Bookkeeping",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Between Two Rivers: A Novel",
        "Authors": "By Rinaldi, Nicholas",
        "Description": "Within the walls of Echo Terrace, the world ...A beautifully resonant novel with a dazzling array of characters whose life stories are woven together into a breathtaking braid of love and memory.Farro Fescu is the proud and observant concierge of Echo Terrace, a condominium in New York City. Passing through his lobby at all hours of the night and day is an exotic cross-section of the world's population: an Egyptian-born plastic surgeon who lives on the fifth floor and specializes in gender reassignment; a fighter pilot, on the eighth floor, who flew for Nazi Germany during World War II; an Iraqi spice merchant and the world-famous crazy-patch quilter with whom he's having an affair; the adulterer's son, dreaming of becoming an undertaker; and the widow whose apartment is a jungle Eden filled with a menagerie of specimens -- finches, canaries, a defanged cobra, a monkey named Joe -- that had been the subject of her dead husband's research.Farro Fescu knows them all, knows all their secrets. He knows what happened to Yesenia Rivera, the nineteen-year-old staff housekeeper from Queens, when she took a fateful ride one evening on the Staten Island Ferry. He alone knows the truth behind the mysterious mishap that befell the fashion designer Ira Klempp, a resident of the twelfth floor. And he knows -- and would like to know much more -- about the alluring María Gracia Moño, sometime lover of Harry Falcon, the brilliant captain of industry who lives in the penthouse and is dying of cancer.He is keenly attuned to the building and the people in it, yet he does not know what is in his own heart -- why, after a long, hard life, he is still alive, and still alone. Nor does he know what he will be capable of in the face of sudden, overwhelming tragedy.As the narrative eye of Between Two Rivers floats from one apartment to another, revealing the characters' private histories and tracing the dramatic intersections of their daily lives, a lush tapestry of experience emerges. The story, in beautifully textured prose, is laced with wit and humor, subtle ironies and haunting echoes, and everywhere a profound sense of the resilience of the human spirit.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper",
        "Price Starting With ($)": "8.15",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Stars & Stripes Forever: The History, Stories, and Memories of Our American Flag",
        "Authors": "By Schneider, Richard H.",
        "Description": "It is a symbol of unity and a subject of controversy. It can be found in the depths of the Earth's oceans and on the rocky surface of the moon. It is our flag -- the Stars and Stripes -- a swath of red, white, and blue that represents America's past and its present . . . and inspires its future. In this moving and informative volume, Richard H. Schneider, the author of the acclaimed Taps: Notes from a Nation's Heart and Freedom's Holy Light: The Statue of Liberty, delivers an intriguing history and a powerful tribute to our flag.   Stars & Stripes Forever unfurls the colorful story of this enduring emblem of our national identity, culture, and spirit, from its humble origins more than two hundred years ago to its significance in the twenty-first century. Combining history and legend, fact and lore, Schneider relates how the flag has evolved -- through war and peace, through changing times and honored traditions -- and sets the record straight on many widely held misconceptions.   There are many entertaining and enlightening stories, including that of the flag that inspired Francis Scott Key's \"The Star-Spangled Banner\"; the flag that was stained by Lincoln's blood at Ford's Theater in 1888; and the flag raised at Ground Zero amid the wreckage of the World Trade Center. In addition to historical facts and little-known lore, he offers heartfelt recollections from celebrities and ordinary citizens alike whose lives have been indelibly touched by Old Glory.   Sure to speak to the patriot in us all, Stars & Stripes Forever tells a story that is as remarkable and diverse as America itself.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Human Behavior in the Social Environment: An Ecological View",
        "Authors": "By Germain, Carel B.",
        "Description": "",
        "Category": "",
        "Publisher": "Columbia Univ Pr",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Slow Way Home: A Novel",
        "Authors": "By Morris, Michael",
        "Description": "On the surface, Brandon Willard seems like your average eight-year-old boy. He loves his mama, peanut butter and jelly sandwiches, and G. I. Joe. But Brandon's life is anything but typical.Wise beyond his years, Brandon understands he's the only one in this world he can count on. It's an outlook that serves him well the day his mama leaves him behind at the Raleigh bus station and sets off to Canada with \"her destiny\" - the latest man that she hopes will bring her happiness. The day his mother leaves, Brandon takes the first step toward shaping his own destiny. Soon he finds himself spending pleasant days playing with his cousins on his grandparents' farm and trying to forget the past. In the safety of that place, Brandon finally is able to trust the love of an adult to help iron out the wiry places until his nerves are as steady as any other boy's.But when Sophie Willard shows up a year later with a determined look in her eye and a new man in tow, Brandon's grandparents ignore a judge's ruling and flee the state with Brandon. Creating a new life and identity in a small Florida town, Brandon meets the people who will fill him with self-worth and self-respect. He slowly becomes involved with \"God's Hospital,\" a church run by the gregarious Sister Delores, a woman who is committed to a life of service for all members of the community, black and white, regardless of some townsfolk's disapproval.When violence threatens to rip the town apart, Brandon and his grandparents are put in a perilous situation that will forever change the course of their lives.",
        "Category": " Fiction , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Ain't She Sweet?",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "Ain't She Sweet?Not exactly . . .The girl everybody loves to hate has returned to the town she'd sworn to leave behind forever. As the rich, spoiled princess of Parrish, Mississippi, Sugar Beth Carey had broken hearts, ruined friendships, and destroyed reputations. But fifteen years have passed, and life has taught Sugar Beth its toughest lessons. Now she's come home -- broke, desperate, and too proud to show it.The people of Parrish don't believe in forgive and forget. When the Seawillows, Sugar Beth's former girlfriends, get the chance to turn the tables on her, they don't hesitate. And Winnie Davis, Sugar Beth's most bitter enemy, intends to humiliate her in the worst possible way.Then there's Colin Byrne. . . . Fifteen years earlier, Sugar Beth had tried to ruin his career. Now he's rich, powerful, and the owner of her old home. Even worse, this modern-day dark prince is planning exactly the sort of revenge best designed to bring a beautiful princess to her knees.But none of them have reckoned on the unexpected strength of a woman who's learned survival the hard way.  While Sugar Beth's battered heart struggles to overcome old mistakes, Colin must choose between payback and love. Does the baddest girl in town deserve a second chance, or are some things beyond forgiving?Ain't She Sweet? is a story of courage and redemption. . . of friendship and laughter. . . of love and the possibility of happily-ever-after.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "American Heroines: The Spirited Women Who Shaped Our Country",
        "Authors": "By Hutchison, Kay Bailey",
        "Description": "As long as there has been an America, the indomitable spirit of American women has shaped both the country’s history and society. Regardless of the time and place these women were born each excelled in her respective field, making it easier for the next generation. This is what makes them heroines.In American Heroines, Kay Bailey Hutchison presents female pioneers in fields as varied as government, business, education and healthcare, who overcame the resistance and prejudice of their times and accomplished things that no woman—and sometimes no man -- had done before. Hutchison, a pioneer in her own right, became the first woman elected to the United States Senate from the State of Texas. Interspersed with the stories of America's historic female leaders are stories of today’s women whose successes are clearly linked to those predecessors. Would Sally Ride have been given the chance to orbit the earth had Amelia Earhart not flown solo across the Atlantic Ocean fifty years before? Had Clara Barton not nursed wounded soldiers on Civil War battlefields, aid may not have reached the millions it did while the Red Cross was in the hands of women like Elizabeth Dole and Bernadine Healy. Had Oveta Culp Hobby not been appointed the first Secretary of the Department of Health and Education by President Eisenhower, the country may have been deprived of such leaders as Secretary of State Madeline Albright and National Security Advisor Condoleeza Rice.As a young girl, Senator Hutchison dreamed of an America where the qualifier \"the first woman\" had become obsolete. The profiles contained in American Heroines, illustrate how her dream is coming true, one courageous step at a time.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    }
]