[
    {
        "Title": "Perfect Cakes",
        "Authors": "By Malgieri, Nick, Eckerle, Tom (PHT), and Eckerle, Tom",
        "Description": "When it's time to celebrate, it's time to bake a cake! When it's time to be creative, it's time to bake a cake! When it's time to find comfort in the kitchen, it's time to bake a cake. From weddings to birthdays to something nice for yourself and your family and guests, nothing marks a special occasion better than a freshly baked cake. Now renowned baking teacher Nick Malgieri, author of Cookies Unlimited, Chocolate, and How to Bake, shares his flawless recipes and professional techniques for creating a perfect cake every time. From simple to extravagant, the recipes are presented with the same clear, uncomplicated instructions that have made Nick a favorite among firsttime bakers and experts alike. You'll find more than two hundred recipes for all types of cakes, from homey favorites such as Sour Cream Coffee Cake and Classic Angel Food Cake to luscious classics such as Dark and White Chocolate Cheesecake to international showstoppers such as Zuppa Inglese and Chocolate Raspberry Bûche de Noël. Nick shows how to get the best results every time you bake, ensuring that your cheesecake will never crack, your pound cake batter will never separate, and your génoise will always be tender and light. When the time comes to decorate or fill your cake, there's a wealth of creative ideas, from working with marzipan to piping icing to flavoring ganache and buttercream. Also included are tips on selecting the most flavorful chocolates, fruits, liqueurs, and other ingredients. Tempting color photographs throughout the book will inspire anyone to head into the kitchen. Novice bakers will be reassured and experts challenged with Perfect Cakes, a comprehensive collection of perfect recipes and expert guidance.",
        "Category": " Cooking , Courses & Dishes , Cakes",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Broadway Platinum: One Hundred Favorite Show Tunes",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hal Leonard Corp",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "The 25 Most Common Problems in Business: (And How Jesus Solved Them)",
        "Authors": "By Zabloski, Jim",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "When We're in Public, Pretend You Don't Know Me (2004)",
        "Authors": "By Susan Borowitz",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Life, death, and destiny (Layman's theological library)",
        "Authors": "By Shinn, Roger Lincoln",
        "Description": "",
        "Category": "",
        "Publisher": "Westminster Press",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Nerve Damage: A Novel",
        "Authors": "By Abrahams, Peter",
        "Description": "Sometimes the dead live on in your dreams . . . at least that's true for Roy Valois. His wife, Delia, died fifteen years earlier while working for a private think tank and he has never forgotten her. Roy is a well-known sculptor in the art world. His newest piece, a magnificent creation he calls Delia, has just been finished, a sign that he's found a little closure at last.Then Roy gets some news of the grimmest kind. It's the kind of news that forces thoughts in unexpected directions, such as the contents of one's obituary. Roy and his lawyer, a close friend, find themselves wondering whether Roy's obituary will mention a big goal he scored in college hockey. Roy's friend suggests that they could probably find out. With some help, they hack into the morgue files of the New York Times. There's no mention of the goal, but something else about his obituary bothers Roy. According to the New York Times, his wife was working for the United Nations when she died&#8212not the think tank.At first, Roy thinks it's a simple mistake, but when a conversation with the writer of his obituary fails to clear things up, he suspects something more. The deeper he digs, the more confusing his wife's past becomes. Delia's former colleagues deny ever knowing her, the building that housed the think tank has supposedly served as the offices for another organization for decades, and Roy can't find any records of its existence. Who was Delia? Who did she work for? How did she really die? Did she really die? With time running out, a desperate Roy won't stop until he knows the truth about the woman he can't stop loving.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The Equipping Pastor: A Systems Approach To Congregational Leadership",
        "Authors": "By Stevens, R. Paul",
        "Description": "The authors draw on their combined experience to create an exciting model of congregational leadership that understands congregations as relational systems. Learn how relational processes can liberate members for ministry and mission in the world and release pastors for appropriate leadership.",
        "Category": " Religion , Leadership",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Home Grown Heroes: How to Raise Courageous Kids",
        "Authors": "By Kimmel, Tim",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The Pampered Chef: Busy Mom's Cookbook",
        "Authors": "By Doris Christopher",
        "Description": "",
        "Category": "",
        "Publisher": "The Pampered Chef, Ltd",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Ice Drift",
        "Authors": "By Taylor, Theodore",
        "Description": "The year is 1868, and fourteen-year-old Alika and his younger brother, Sulu, are hunting for seals on an ice floe attached to their island in the Arctic. Suddenly the ice starts to shake, and they hear a loud crack--the terrible sound of the floe breaking free from land. The boys watch with horror as the dark expanse of water between the ice and the shore rapidly widens, and they start drifting south--away from their home, their family, and everything they&#39;ve ever known.Throughout their six-month-long journey down the Greenland Strait, the brothers face bitter cold, starvation, and most frightening of all, vicious polar bears. But they still remain hopeful that one day they&#39;ll be rescued.This thrilling new adventure story from bestselling author Theodore Taylor is a moving testament to the bond between brothers--and to the strength of the human spirit.Includes a map, a glossary of Inuit words and phrases, and an author&#39;s note..",
        "Category": " Juvenile Fiction , Historical , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Tiny One: A Novel",
        "Authors": "By Minot, Eliza",
        "Description": "Grieving over the death of her mother, killed in a winter car accident in Massachusetts, young Via Revere copes with her anguish and loss by vivdly recalling the events of the day her mother died. A first novel. 30,000 first printing. Tour.",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "How to Pick Up Foreclosures: A Step-By-Step Guide for Getting Super Discounted Property Before the Auction",
        "Authors": "By Cook, Wade B.",
        "Description": "",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Lighthouse Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Red Queen's Daughter",
        "Authors": "By Kolosov, Jacqueline",
        "Description": "Orphaned as a young girl because of the imprudent marriage of her mother, Queen Katherine Parr, Mary Seymour vows never to fall in love--and under no circumstances will she marry. Lady Strange, her mysterious guardian, offers the young woman an extraordinary alternative to marriage: Mary is to become a white magician who will join Queen Elizabeth's court and ensure the success of the Virgin Queen's reign. Accompanied by her magical hound, Perseus, Mary sets out to learn the properties of different stones and the art and precision of natural spells. Soon after her sixteenth birthday, she joins Elizabeth's court as a lady-in-waiting. Upon her arrival, Mary realizes that Elizabeth's court is rife with men and women who are vying for power. The most dangerous of all is Edmund Seymour, Mary's disturbingly handsome cousin. From the moment she meets Edmund, Mary has to fight her growing attraction, especially once she discovers that he is a black magician, the dark mirror of her own self. But, despite the threat Edmund poses to Mary, he seems to be the only one who truly understands her. When Edmund becomes involved in a plot against the Queen, Mary finds her beliefs tested in ways she never could have imagined.",
        "Category": " Young Adult Fiction , Historical , Europe",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Reverence for Life",
        "Authors": "By Albert Schweitzer",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Song of Deborah",
        "Authors": "By Ross, Bette M.",
        "Description": "The beautiful Deborah, caught between the love of Lapidoth, the Philistine caravan master, and Sisera, King of Canaan, follows the call of Yahweh to become God's oracle and Israel's first woman judge",
        "Category": " Fiction , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Growing Up Christian: Have You Taken Ownership of Your Relationship with God?",
        "Authors": "By Jacobsen, Mark and Graustein, Karl",
        "Description": "",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "P & R Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Everything Menopause Book: Reassuring Advice and the Latest Information to Keep You Healthy and Sane (Everything Series)",
        "Authors": "By Gentry, Lorna and Slupik, Ramona",
        "Description": "A comprehensive resource furnishes the most current research and professional advice on menopause, providing a wealth of information on such topics as hormone therapy and coping with various emotions, that will help women undergoing this lifechanging transition remain happy and healthy. Original.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Suck It Up (Suck It Up Series)",
        "Authors": "By Meehl, Brian",
        "Description": "★ “A refreshing take on the vampire romance.”—Publishers Weekly, Starred Are you up to your neck in bloodsucking vampire stories?Tired of those tales about dentally enhanced dark lords?Before I wrote this book I thought all vampires were night-stalking, fangpopping, bloodsucking fiends. Then I met Morning McCobb. He’s a vegan vampire who drinks a soy-blood substitute called Blood Lite. He believes staking should be a hate crime. And someday he hopes to march in a Vampire Pride Parade. He was also the first vampire to out himself and try to show people of mortality, like you and me, that vampires are just another minority with special needs. Trust me—this is like no other vampire book you’ll ever feed on. So, as my buddy Morning says, “Pop the lid, and suck it up.”“Appealing characters and an original vampire world. Delightful for those who like their romance vaguely paranormal, their adventure romantic and their vampires defanged.”—Kirkus Reviews“A flawed and affable protagonist . . . snarky humor, outsider-looking-in perspective, and fresh new takes on the familiar.”—School Library Journal",
        "Category": " Young Adult Fiction , Paranormal, Occult & Supernatural",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Perfect Palette: Fifty Inspired Color Plans for Painting Every Room in Your Home",
        "Authors": "By Krims, Bonnie Rosser",
        "Description": "This guide offers a method of selecting and combining paint colours for the home decorator. It contains plans covering every room in the house, a useful listing of colour reference numbers from major paint manufacturers, and practical tips and advice.",
        "Category": " House & Home , Decorating",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Scrapbooking for the first time®",
        "Authors": "By Carter, Rebecca",
        "Description": "Let your creativity go wild with these great scrapbooking techniques. Learn all the basics: choosing and using equipment, mounting photographs, adding paper frames, matting, die-cutting, incorporating decorative and natural papers, and working with templates and rub-ons. Each technique builds on the one before in a natural progression, from coloring black-and white pages with pens to project pages that introduce ideas and products. A gallery of professionally made scrapbook interiors is included to provide guidance and encouragement.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Sterling/Chapelle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Teaching with Hacker Handbooks : Topics, Strategies and Lesson Plans",
        "Authors": "By Marcy Carbajal Van Horn",
        "Description": "",
        "Category": "",
        "Publisher": "Bedford St. Martin's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Exploring the Old Testament",
        "Authors": "By Schultz, Samuel J. and Smith, Gary V.",
        "Description": "",
        "Category": " Religion , Biblical Studies , Old Testament",
        "Publisher": "Crossway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Decorate Your Home for Christmas",
        "Authors": "By Wilson, Jana",
        "Description": "This inspiring collection of Christmas crafts helps you give every room a festive air. Look through galleries arranged by artists eager to share their holiday season and personal style. For example, all Jana Wilson’s choices, including cowboy boot ornaments, reflect her ranch home. You can make everything you see—a candy house; Father Christmas; fairy godmother to crown the tree; and other holiday glories.",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Sterling/Chapelle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Organic Crafts: 75 Earth-Friendly Art Activities",
        "Authors": "By Monaghan, Kimberly",
        "Description": "Parents, teachers, and caregivers looking for ideas on how to get children outdoors and instill in them a love of nature can find more than 75 creative crafts, games, and activities using objects that kids can collect from nature in this idea book. As children make race cars out of rocks, create paint from plants, and assemble funny grass masks, they learn to be environmentally friendly—absorbing information on recycling, reducing waste, and inspiring others to protect nature. Organized by the various natural materials needed, the crafts offer a new twist on perennial homemade gifts and school projects.",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "Chicago Review Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Earth-Friendly Outdoor Fun: How to Make Fabulous Games, Gardens, and Other Projects from Reusable Objects (Earth-Friendly Series)",
        "Authors": "By Pfiffner, George",
        "Description": "From bowling pins to boomerangs, windsocks to waterwheels, create a world of exciting outdoor activity!With Earth-Friendly Outdoor Fun, ordinary discarded objects find new life as imaginative æ and unique æ outdoor toys, games, and tools. Go bowling in your own backyard. Or build your own backyard barometer. Scare up a scarecrow from some old clothes and newspaper. Send a jet balloon soaring. Activities include complete step-by-step instructions and illustrations to ensure success. Best of all, you'll also learn important facts and tips about helping to save our environment through recycling.GEORGE PFIFFNER, the author of all four books in the Earth-Friendly series, spent fourteen years creating hundreds of activities for Woman's Day and other magazines. He also designs theater sets and department store displays.Also available in the Earth-Friendly series: Earth-Friendly Toys Earth-Friendly Wearables Earth-Friendly Holidays",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Handling In-Flight Emergencies (Practical Flying Series)",
        "Authors": "By Eichenberger, Jerry A.",
        "Description": "",
        "Category": "",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Quitting Smoking",
        "Authors": "By Kleinman, Lowell, M.D. and Messina-Kleinman, Deborah",
        "Description": "A guide to medications and techniques to quit smoking includes advice on surviving withdrawal symptoms, setting long-term goals, and staying healthy and fit.",
        "Category": " Self-help , Substance Abuse & Addictions , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "National Voluntary Laboratory Accreditation Program: Energy efficient lighting products (NIST handbook)",
        "Authors": "By Galowin, Lawrence S",
        "Description": "",
        "Category": "",
        "Publisher": "For sale by the Supt. of Docs., U.S. G.P.O",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "JOHN (Macarthur Bible Studies)",
        "Authors": "By MacArthur, John",
        "Description": "The Gospel of John is filled with profound truths and rich spiritual stories. Stories of Christ's miracles that inspire His followers; stories of death that redeems the lost; and the stories of Resurrection that provides us with hope for eternal glory.  Every miracle, teaching, and reaction John writes has one clear purpose to prove that Jesus is the Word, the Messiah, and the Son of God.  The dramatic milestones of Christ's ministry, as portrayed by John, have invited millions of believers through out the ages into a saving faith with Jesus Christ, and will lead you into a deeper understanding of the ultimate story of Jesus, the Son of God.The Mac Arthur Study Guide Series provides a twelve week, verse-by-verse examination of the books of the New Testament.  This revised and updated series continues to be one of the best-selling study guides currently available for individuals or small groups.Features Include:Twelve week studyThought-provoking questionsVerse-by-verse commentarySpace provided for note-taking",
        "Category": " Religion , Biblical Studies , New Testament",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Steinbeck Country: The American Classic Edition",
        "Authors": "By Crouch, Steve",
        "Description": "",
        "Category": "",
        "Publisher": "Graphic Arts Center Pub Co",
        "Price Starting With ($)": "5.28",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Fathers' Rights: Hard-Hitting and Fair Advice for Every Father Involved in a Custody Dispute",
        "Authors": "By Dachman, Ken and Leving, Jeffery",
        "Description": "Millions of fathers are currently embroiled in the fight of their lives to win custody of their children. Wounded by the acrimony and greed that often accompany divorce proceedings, many wonder if they will ever again be an important part of their sons&#39; and daughters&#39; lives. With this landmark book, renowned men&#39;s rights attorney Jeffery M. Leving offers disenfranchised fathers true hope and meaningful advice certain to save years of anguish and possibly thousands of dollars.Drawing on more than fifteen years of frontline experience, Leving leads fathers through every twist and turn of the legal system and shows them how to protect their rights (and their children&#39;s)&#151;both before and during divorce litigation.This authoritative and accessible book covers every aspect of the custody process, including protecting the parent/child relationship as a breakup occurs; finding a competent and sympathetic lawyer; drafting a &#147;Shared Parenting Agreement”; demonstrating parental competence when falsely accused of abuse; avoiding parental alienation; determining when to settle and when to litigate; techniques for dealing effectively with psychologists, social workers, and other domestic relations experts; and much more.Illustrated with vivid real-life examples, Jeffery Leving and Kenneth Dachman&#39;s practical guide is essential reading for the scores of American fathers routinely excluded from their children&#39;s lives by a biased legal system in which avarice and recrimination too often overwhelm compassion and justice.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "How I Pray: People of Different Religions Share with Us That Most Sacred and Intimate Act of Faith",
        "Authors": "By Castelli, Jim (EDT)",
        "Description": "Religion writer Jim Castelli set out to answer these profound questions by talking with twenty-six spiritual leaders and practitioners representing the wide spectrum of faith in America today. How I Pray gathers these remarkable conversations into a thought-provoking, personal, and deeply meaningful volume.In How I Pray Christians and Jews, Muslims and Buddhists, Native Americans and Mormons, and members of many other faiths describe the intimate and unique ways in which they pray—and what prayer means to them. Catholic priest and novelist Andrew M. Greeley reveals that he prays to a womanly God because it enhances the intimacy of his spiritual encounters. Pollster George Gallup, Jr., considers his prayer life a dynamic two-way conversation with God. Lakota Sioux medicine man High Star shares the fascinating prayer rituals that his people have practiced for centuries.Infused with honesty and passion, warmth, and a deep reverence for life's spirituality, How I Pray is sure to be a source of illumination and delight for readers of all religious backgrounds, with insights from the following spiritual leaders:Philip C. Bom Sidney Callahan Joan Brown Campbell Sandra Goodwin Clopine Richard J. Foster George Gallup, Jr.  Ann Garvin Rajshri Gopal Billy Graham Andrew M. Greeley High Star Lawrence Kushner Norman Lear John Lewis Martin E. Marty Carole Mu’min Ronald Y. Nakasone Marlene Payne Jane Redmont Mary Frances Robles Eve Rudin Robert Schuller Dan Seals Eleana Silk Rembert G. Weakland, O.S.B. Lisa Wood",
        "Category": " Religion , Prayerbooks , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Illustrated History of the Civil War 1861-1865",
        "Authors": "By Roth, David E.",
        "Description": "Famous images from one of the world's principal sources of historical photographs accompany a cogent, compelling history of America's bloodiest conflict by the founder of  Blue and Gray  magazine.",
        "Category": " History , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "8.19",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Making Greeting Cards With Rubber Stamps",
        "Authors": "By McGraw, Maryjo",
        "Description": "Gathers stamping techniques and thirty hand-stamped greeting card projects that lend themselves to personalization and improvistation",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Balanced Healing: Combining Modern Medicine with Safe & Effective Alternative Therapies",
        "Authors": "By Altshuler, Larry",
        "Description": "A comprehensive reference guide to alternative healing introduces readers to step-by-step strategies for blending traditional and alternative treatments, presenting a host of potentially treatable maladies in an A-to-Z reference. Original.",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Harbor Press, Inc.",
        "Price Starting With ($)": "6.13",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "The Father of Love: Spiritual Insights from the Love Comes Softly Series",
        "Authors": "By Oke, Janette",
        "Description": "Combines spiritual insights and Scripture passages with the day-to-day experience of a prairie family of a century ago",
        "Category": " Religion , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "High Blood Pressure: The Black Man and Woman's Guide to Living with Hypertension",
        "Authors": "By Hudson, Hilton M., II and Reed, James W.",
        "Description": "Designed for the lay reader who has recently been diagnosed with hypertension, this book discusses major symptoms, prevention techniques, risk factors, complications, and treatment and emphasizes self-care, stress management, and empowerment.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Hilton Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Mayo Clinic Family Health Book, Revised Second Edition",
        "Authors": "By Larson, David E. (EDT) and Mayo Clinic (COR)",
        "Description": "Since its initial publication in 1990, Mayo Clinic Family Health Book has become a classic guide to your health concerns. U.S. News & World Report judged it the \"number one book of its kind,\" and The New York Times stated, \"Deserves a place on the shelf next to the dictionary and the encyclopedia.\" Now, revised and updated, with a new emphasis on selfhelp and prevention, this generously illustrated volume from one of the most trusted names in medicine offers the latest in medical expertise for your home reference. Part I: Your Health Through the Years Here you'll find explanations of human growth and development, descriptions of health problems that you or your loved ones may face, and an informative Color Atlas of Human Anatomy. Part II: Staying Well Filled with prevention strategies, this section details nutrition, fitness, stress management, safety, and other subjects essential for healthy living. Part III: First Aid and Emergency Care This section offers accessible guidance on how you can respond to conditions ranging from sunburn and cuts to chest pain and choking. Part IV: Human Diseases and Disorders Includes detailed discussions of the symptoms, diagnosis, and treatment of more than 1,000 diseases and disorders, as well as the health concerns of men and women. An all-new Color Guide to the Diagnosis and Treatment of Common Disorders reveals facts about back pain, high blood pressure, breast lumps, prostate problems, joint trouble, genetics, and more. A Photographic Guide to Common Skin Disorders depicts almost 100 common ailments. Part V: Modern Medical Care This section offers perspectives on how to obtain the best medical care from our changing health care system, including information about tests, medications, cancer treatment, home care, and dealing with death. Appendices Look here for handy conversiontions of medical terms; names, addresses, and phone numbers of organizations offering health information; and guidance on how you can prepare a living will or a durable power of attorney for health care. Mayo Clinic is known worldwide for providing comprehensive diagnosis, accurate answers, and detailed explanations to people seeking treatment for both common and uncommon medical problems. This reputation began more than 100 years ago when Mayo Clinic founders Drs. William and Charles Mayo established a system for a doctor to thoroughly investigate patient problems by seeking the opinions and help of other Mayo physicians. Today, Mayo Clinic experts in virtually every medical specialty work together to meet patients' needs. With this depth of medical experience, Mayo* occupies a unique position as a health information resource. Mayo Clinic's major outpatient and hospital facilities are located in Rochester, Minnesota; Jacksonville, Florida; and Scottsdale, Arizona. Other landmark Mayo Clinic books include Mayo Clinic Complete Book of Pregnancy & Baby's First Year and Mayo Clinic Heart Book.",
        "Category": " Medical , Reference",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "11.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Low Cost, No Cost Ideas for Youth Ministry",
        "Authors": "By Group",
        "Description": "",
        "Category": "",
        "Publisher": "Group Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "The Yoga System of Health and Relief from Tension",
        "Authors": "By yogi vithaldas",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Sun-Kissed (Smart Novels: An SAT Vocabulary Novel: The Painless Way to Learn SAT Vocabulary)",
        "Authors": "By Crowther, John (EDT) and Ray, Belinda",
        "Description": "Smart Novels are compelling, full-length novels with edgy and mature themes that will appeal to teens. Each book showcases more than 1,000 vocabulary words frequently included on the SAT. Brief definitions appear on the same page so that readers can quickly access and digest the meanings as they read along.",
        "Category": " Study Aids , SAT",
        "Publisher": "SparkNotes LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Hidden Carolinas: Including Ashville, Great Smoky Mountains, Outer Banks, and Charleston",
        "Authors": "By O'Neal, Catherine",
        "Description": "Combining unique travel choices, outdoor adventures, and little-known locales into guides where vacations meet adventures, each title in the Hidden series also offers readers the comfort of detailed maps, Internet information for each listing, author picks, suggested itineraries, and walking and driving tours. Hidden Carolinas is a virtual bed-and-breakfast guide with personal recommendations of over 100 one-of-a-kind inns. The author leads readers to over 40 beaches and nine lighthouses, plus 63 parks and wilderness areas. Author Catherine O'Neal lives in Key Largo, FL. Includes 17 maps.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Ulysses Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Lonely Planet Cambodia (Cambodia, 3rd ed)",
        "Authors": "By Ray, Nick",
        "Description": "",
        "Category": " Travel , Asia , Southeast",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Our Lady Among Us",
        "Authors": "By Rev. Valentino Del Mazza",
        "Description": "",
        "Category": "",
        "Publisher": "St. Paul Editions",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Heroes of pro basketball (Pro basketball library, 1)",
        "Authors": "By Berger, Phil",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Urban Christian",
        "Authors": "By Bakke, Ray and Hart, Jim",
        "Description": "An Eternity 1988 Book of the Year!There are millions of opportunities for the gospel.  With half of the world's five billion people in cities, there is almost no end to the exciting challenges that await us.  Ray Bakke has been there.  For over twenty years he and his family have worked with and love the people of today's cities, bringing a message of faith and hope.  He knows how the city works and how it can be used to the advantage of the gospel.  He knows how people hurt too, and he knows how Christianity can heal and make whole.Now he offers us the basic building blocks we need to live this young, rootless, mobile, media-tuned population.  Here is practical, time-tested wisdom on what the church can and is doing in worship, work and witness.Bakke's biblical perspective is enriched by years of study and worldwide travel.  He believes the church can and must train people to live with and minister to the hurting rich and the hurting poor of the city.  The opportunities are our for the taking.",
        "Category": " Religion , Fundamentalism",
        "Publisher": "IVP Academic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Backpacker Magazine's Guide to the Appalachian Trail",
        "Authors": "By Chase, Jim",
        "Description": "Traces the history of the Appalachian Trail, describes points of interest along each section of the trail, and discusses the ecology and geology of the region",
        "Category": " Sports & Recreation , Hiking",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Riding Class (Saddle Club #52)",
        "Authors": "By Bryant, Bonnie",
        "Description": "Pleased when a disabled rider who is training at Pine Hollow Stables demonstrates remarkable achievments, the Saddle Club begins to worry when the disabled rider is scheduled to compete against snooty Veronica diAngelo. Original.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Making Things Better",
        "Authors": "By Brookner, Anita.",
        "Description": "Facing life alone at an advanced age, Julius Herz cannot shake the sense that he should be elsewhere, doing other things. Walking through bustling streets that seem increasingly alien to him, he’s confronted by life’s pressing questions with an urgency he has never known before: what do we owe the people in our lives? How should we fill our days? Feeling fortified despite the growing ache in his heart, Herz finds himself also blessed with a stirring sense of exhilaration. After a lifetime of deferring to others’ stronger wills, he faces a future of possibility, the only constraint the deeply ingrained habits of his mind. Profound and deeply resonant, Making Things Better explores the quandaries of aging, longing, and self-discovery with transfixing precision and spellbinding acuity.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Chronicles of Ancient Darkness #2: Spirit Walker",
        "Authors": "By Paver, Michelle and Taylor, Geoff (ILT)",
        "Description": "“Fast-paced and exciting adventure that will enthrall every reader.” —Erin Hunter, author of the New York Times bestselling Warriors seriesThe second thrilling book in Michelle Paver’s bestselling fantasy series is a must-have for fans of Brandon Mull and Jeanne DuPrau.As the Moon of No Dark looms over the land, the clans fall prey to a horrifying sickness. Fear stalks the Forest. No one knows the cause—and only Torak can find the cure.His quest takes him across the sea to the mysterious islands of the Seal Clan, where Torak will battle an unseen menace and uncover a betrayal that will change his life—forever.Crackling with suspense and ominous magic on every page.“Torak’s bravery against insurmountable dangers makes him an engaging and memorable hero” —VOYA",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Katherine Tegen Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Shift to Professional Paradise ... 5 Steps to Less Stress, More Energy & Remarkable Results at Work",
        "Authors": "By Vicki Hess",
        "Description": "",
        "Category": "",
        "Publisher": "CornerStone Leadership Institute",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Ella Fitzgerald (Black Americans of Achievement)",
        "Authors": "By Kliment, Bud",
        "Description": "Traces the life of the legendary singer, tells how she became involved in music, and describes the highlights of her career",
        "Category": " Young Adult Nonfiction , Biography & Autobiography , Cultural Heritage",
        "Publisher": "Chelsea House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "THE RED BOW",
        "Authors": "By Donna R Tyson",
        "Description": "",
        "Category": "",
        "Publisher": "DR Tyson",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Houghton Mifflin Invitations to Literature: Paperback Plus Imp Level 1.4 Sheep Shop (Invitations to Lit 1996)",
        "Authors": "By Hm (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Like It Was: A Complete Guide to Writing Oral History",
        "Authors": "By Brown, Cynthia Stokes",
        "Description": "Gives instructions for writing oral histories and biographies including such aspects as planning, interviewing, transcribing, editing, and publishing the results",
        "Category": " Education , General",
        "Publisher": "Teachers & Writers Collaborative",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Thoughts for Young Men",
        "Authors": "By Ryle, J. C.",
        "Description": "I Heartily Endorse It!\" .... and strongly commend it to both Christian leaders and fathers, not to mention older and younger men alike.\"-John MacArthur, Jr. \"Ryle Is Magnificent! There's no other word for it. ...are you brave enough to face hard-hitting truth and have God search your heart on things that matter most? Then Ryle is the man for you! Do yourself a favor -read this and think about what you read.\"-J.I. Packer",
        "Category": " Religion , Spirituality",
        "Publisher": "Calvary Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Tree of Smoke",
        "Authors": "By Johnson, Denis",
        "Description": "Tree of Smoke is the 2007 National Book Award Winner for Fiction.One of the New York Times 10 Best Books of the YearNamed a Best Book of the Year by Time, The Washington Post, The Boston Globe, Chicago Tribune, San Francisco Chronicle, Salon, Slate, The National Book Critics Circle, The Christian Science Monitor. . . .Tree of Smoke is the story of William \"Skip\" Sands, CIA--engaged in Psychological Operations against the Vietcong--and the disasters that befall him. It is also the story of the Houston brothers, Bill and James, young men who drift out of the Arizona desert and into a war where the line between disinformation and delusion has blurred away. In the words of Michiko Kakutani in The New York Times, Tree of Smoke is \"bound to become one of the classic works of literature produced by that tragic and uncannily familiar war.\"",
        "Category": " Fiction , War & Military",
        "Publisher": "Picador",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Me and My Big Mouth",
        "Authors": "By Joyce Meyer",
        "Description": "",
        "Category": "",
        "Publisher": "Harrison House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Favorite Brand Name Grilling",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Strategies for Resolving Individual and Family Problems",
        "Authors": "By Vondracek, Fred W. and Corneal, Sherry",
        "Description": "Offering balanced, extensive coverage of both theory and techniques, this book is designed to assist students and professionals in expanding their understanding of a very broad range of intervention strategies. The authors provide serious discussion of the important theoretical underpinnings of the major strategies used today, offer insight into approaches (such as dance, music, and art therapy, biofeedback, etc.), and provide details on the how to of various approaches.",
        "Category": " Psychology , Psychotherapy , Counseling",
        "Publisher": "Brooks Cole",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Writing Prose: Techniques and Purposes",
        "Authors": "By Kane, Thomas S. and Peters, Leonard J. (EDT)",
        "Description": "",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Gulliver's Travels (Barnes & Noble Classics)",
        "Authors": "By Swift, Jonathan and Seidel, Michael (INT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LDIV&&R&&LI&&RGulliver's Travels&&L/I&&R, by &&LB&&RJonathan Swift&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&RConsidered the greatest satire ever written in English, &&LB&&RJonathan Swift&&L/B&&R’s &&LI&&RGulliver’s Travels&&L/I&&R chronicles the fantastic voyages of Lemuel Gulliver, principally to four marvelous realms: Lilliput, where the people are six inches tall; Brobdingnag, a land inhabited by giants; Laputa, a wondrous flying island; and a country where the Houyhnhnms, a race of intelligent horses, are served by savage humanoid creatures called Yahoos.&&LBR&&R&&LBR&&RBeneath the surface of this enchanting fantasy lurks a devastating critique of human malevolence, stupidity, greed, vanity, and short-sightedness. A brilliant combination of adventure, humor, and philosophy, &&LI&&RGulliver’s Travels&&L/I&&R is one of literature’s most durable masterpieces.&&LBR&&R&&L/DIV&&R&&LDIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&R&&L/B&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&RMichael Seidel&&L/B&&R&&L/B&&R&&L/B&&R is Jesse and George Siegel Professor in the Humanities at Columbia University. He has written widely on eighteenth-century literature. His books include &&LI&&RSatiric Inheritance: Rabelais to Sterne&&L/I&&R (1979), &&LI&&RExile and the Narrative Imagination&&L/I&&R (1986), and &&LI&&RRobinson Crusoe: Island Myths and the Novel&&L/I&&R (1991). &&L/P&&R&&L/DIV&&R&&L/DIV&&R",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "Barnes Noble Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Christmas Crafts Year-Round: 60 Great Gifts You Can Make from January to December",
        "Authors": "By Boswell, Holly",
        "Description": "",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Visionary Leadership",
        "Authors": "By Nanus, Burt",
        "Description": "Warren Bennis writes,the bookfills me with equal amounts of admiration and envy. For the first time ever, Nanus defines for us what 'the vision thing' is all about.Successful leaders know that nothing drives an organization like an attractive, worthwhile, achievable vision for the future. Leadership expert and best-selling author Burt Nanus finally shows why vision is the key to leadership and demonstrates how any leader can use a logical, step-by-step process to create and implement a powerful new sense of direction in his or her organization.Designed for individual leaders to develop their own vision statement, this book guides readers through the mechanics of forming a vision, guidelines for developing the scope of the vision, and processes for implementing that vision.Visionary Leadership is an indispensable guide for leaders at all levels, from top executives to heads of divisions and departments, from large corporations to small businesses, from manufacturing and service organizations to government and nonprofit institutions.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Maine Coon Cats (Complete Pet Owner's Manuals)",
        "Authors": "By Daly, Carol Himsel",
        "Description": "This very large and very friendly feline breed is described in words, dozens of color photos, and informative line drawings. Cat fanciers get information on breeding, feeding, health care, and much more.",
        "Category": " Pets , Cats , Breeds",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Country Living Scrapbooking: Creating Scrapbooks, Albums, Journals & Memory Boxes",
        "Authors": "By Hearst Books",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Choosing Simplicity: Real People Finding Peace And Fulfillment In A Complex World",
        "Authors": "By Pierce, Linda Breen",
        "Description": "",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Gallagher Press",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The uncommitted; alienated youth in American society",
        "Authors": "By Keniston, Kenneth",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace & World",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Google Hacks: 100 Industrial-Strength Tips & Tools",
        "Authors": "By Calishain, Tara and Dornfest, Rael",
        "Description": "The Internet puts a wealth of information at your fingertips, and all you have to know is how to find it. Google is your ultimate research tool--a search engine that indexes more than 2.4 billion web pages, in more than 30 languages, conducting more than 150 million searches a day. The more you know about Google, the better you are at pulling data off the Web.  You've got a cadre of techniques up your sleeve--tricks you've learned from practice, from exchanging ideas with others, and from plain old trial and error--but you're always looking for better ways to search.  It's the \"hacker\" in you: not the troublemaking kind, but the kind who really drives innovation by trying new ways to get things done.  If this is you, then you'll find new inspiration (and valuable tools, too) in Google Hacks from O'Reilly's new Hacks Series. Google Hacks is a collection of industrial-strength, real-world, tested solutions to practical problems. The book offers a variety of interesting ways for power users to mine the enormous amount of information that Google has access to, and helps you have fun while doing it.  You'll learn clever and powerful methods for using the advanced search interface and the new Google API, including how to build and modify scripts that can become custom business applications based on Google.  Google Hacks contains 100 tips, tricks and scripts that you can use to become instantly more effective in your research. Each hack can be read in just a few minutes, but can save hours of searching for the right answers.    Written by experts for intelligent, advanced users, O'Reilly's new Hacks Series have begun to reclaim the term \"hacking\" for the good guys. In recent years the term \"hacker\" has come to be associated with those nefarious black hats who break into other people's computers to snoop, steal information, or disrupt Internet traffic. But the term originally had a much more benign meaning, and you'll still hear it used this way whenever developers get together. Our new Hacks Series is written in the spirit of true hackers--the people who drive innovation.  If you're a Google power user, you'll find the technical edge you're looking for in Google Hacks.",
        "Category": " Computers , System Administration , Storage & Retrieval",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Pemberley Manor: Darcy and Elizabeth, for better or for worse",
        "Authors": "By Nelson, Kathryn L.",
        "Description": "How does \"happily ever after\" really work?                        With such different personalities, Darcy and Elizabeth  surely need to work on their communication skills! Unlike Jane and Bingley,  both of whom are easygoing and friendly, the Darcys are definitely a case where  opposites attract.        Through their dramatic courtship, Lizzy finally saw through  Darcy's rigid pride and sense of duty, and Darcy fell in love with Lizzy's  sunny optimism and independence of spirit. Now that they're married, what will  happen when their fundamentally different personalities reassert themselves?  Uncover the true feelings of one of the world's most famous couples during  their first year of marriage.        PRAISE FOR PEMBERLEY MANOR:         \"A talented writer with a wonderful feel for Regency.\"         Mary  Bracho, Loft Literary Center        \"An absorbing read from the very first page.\"         Alison  Aldridge, BBC Worldwide        \"One to treasure. What a sumptuous book!\"         Jane Odiwe,  author of Lydia Bennet's Story",
        "Category": " Fiction , Romance , General",
        "Publisher": "Sourcebooks Landmark",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Love from Greece: Happily Ever After/Fairy-Tale Romance/In a Land Far, Far Away (Heartsong Novella Collection)",
        "Authors": "By Panagiotopoulos, Melanie",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "Barbour Publishing, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Mayo Clinic Fitness for Everybody",
        "Authors": "By Dahm, Diane, M.D. (EDT) and Smith, Jay, M.D. (EDT)",
        "Description": "Features an abundance of information on how to exercise safely and effectively by providing a custom program that is tailored to lifestyles, needs, medical problems, and age, and offering tips on choosing the right equipment, staying motivated, and much more. Reissue.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Mayo Foundation for Medical",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Hot Dog and Bob Adventure 2: and the Particularly Pesky Attack of the Pencil People (Adventure #2) (Hot Dog and Bob, HOTD)",
        "Authors": "By Rovetch, Lissa and Whamond, Dave (ILT)",
        "Description": "Be afraid of your pencil. Be VERY afraid! Just when Bob is getting over their last battle with the grossly evil pizza alien, he and Hot Dog have a new enemy to tackle: crafty little pencil snatchers from the planet Pencilvania. Beginning readers will be clamoring for Hot Dog and Bob's second adventure.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Rodzina",
        "Authors": "By Cushman, Karen",
        "Description": "In 1881, 12-year-old Rodzina Clara Jadwiga Anastazya Brodski wishes she didn’t have to board the orphan train in Chicago. But she has no home, no family, and no choice. Rodzina doesn’t believe the orphans are on their way out West to be adopted by good families. She’s sure they will become slaves to strangers. Anyway, who would ever adopt a large, tough, stubborn girl of Polish origin? As the train heads west, all Rodzina has is a small suitcase and her family memories from the past. Will Rodzina ever step off the train to find the family that deep in her heart she’s searching for?",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "A String in the Harp",
        "Authors": "By Bond, Nancy",
        "Description": "The three Morgan children accompany their recently widowed professor father to Wales, where their worsening family life is transformed by twelve-year-old Peter's discovery of the harp-tuning key of the great Welsh bard Taliesin.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Happily Ever After",
        "Authors": "By Stone, Betsy S.",
        "Description": "Many people enter marriage with visions of \"wedded bliss\" only to find their expectations, hopes, and carefully conceived resolutions shattered when the dream becomes a reality.Happily Ever After reveals the changes marriage brings to a relationship and to each spouse, why they occur, and how you can deal with them positively. It's a guide through the often rough early marital years, and to creating a strong foundation for long-term contentment.Author Betsy Stone, a practicing psychologist, takes a look at the most common problems newlyweds face--including such potentially explosive topics as money, sex, and religion--and offers sound solutions. Using examples drawn from couples who have successfully weathered the first few years of marriage, she explores how to abandon old habits and develop new ones; how to be close and how to be separate; how to deal with in-laws and extended family, negotiate everyday conflicts, and compromise on larger issues.With invaluable advice on communicating openly, smart tips on how to fight and how to reconcile, and exercises throughout for developing and refining the skills discussed,Happily Ever After is essential reading for those who've discovered it takes more than love to make a marriage work.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "A Mother's Heart: A Look at Values, Vision, and Character for the Christian Mother (A Navigator Book)",
        "Authors": "By Fleming, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Navpress Publishing Company, 1982",
        "Price Starting With ($)": "8.06",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "Family Fun Activity Book: Playtimes and Activities to Bring Children and Grownups Together",
        "Authors": "By Keeshan, Bob and Palmisciano, Diane",
        "Description": "Describes a variety of activities including arts and crafts projects, homemade toys, action games, quiet games, and puppets",
        "Category": " Family & Relationships , Activities",
        "Publisher": "Fairview Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Type 2 Diabetes for Beginners",
        "Authors": "By Barrier, Phyllis",
        "Description": "A day-by-day handbook forpeople just diagnosed withtype 2 diabetesPeople who are diagnosed with diabetes findthemselves in a whole new world whereeven the most common everyday events,such as eating breakfast, take on exaggeratedimportance. It’s a world where a personneeds a sympathetic guide to help him orher decide what to do next. The amount ofinformation to take in and act on is overwhelming.But it’s important to learn andtake action now, because this is the way todefeat diabetes and live well in spite of it.This book is the “take-you-by-the-hand”guide that will become a trusted friend andadviser for the millions of people who findthemselves in the growing ranks of peoplewith diabetes. It can be a lonely and scaryplace to be, whether one has had diabetesfor a day or for 20 years.As with all skills—and managing diabetes isjust another skill that can be learned—it iswise to start with the basics and to return tothem regularly. This author has decades ofexperience counseling individuals anddesigning reader-friendly publications tohelp a wider circle of folks make the choicesthat lead naturally to good management oftheir diabetes. She’s with readers from thefirst day of diagnosis, through the shock andfears that may arise, and teaches them whatthe simple steps are and how to take themto make a real difference in their healthnow, and in all their tomorrows.",
        "Category": " Health & Fitness , Diseases , Diabetes",
        "Publisher": "American Diabetes Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Never Dies the Dream",
        "Authors": "By Landon, Margaret",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "The Great Novels of Thomas Hardy: Tess of the D'Urbervilles/Far from the Madding Crowd/the Mayor of Casterbridge",
        "Authors": "By Hardy, Thomas",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "By Hook or by Book (Prime Crime Mysteries)",
        "Authors": "By Meredith, D. R.",
        "Description": "Reference librarian Megan Clark wants her Murder by the Yard book group to help her conduct research on string theory, but the disappearance of a valuable manuscript and the death of its owner will railroad those plans. Original.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "HTML for the World Wide Web with XHTML and CSS, Fifth Edition",
        "Authors": "By Castro, Elizabeth",
        "Description": "As both the Web and the browsers used to navigate it mature, work-arounds that compensate for the myriad factors that affect Web page appearance no longer cut it. Users expect Web pages to look beautiful regardless--and with the Fifth Edition of this popular Visual QuickStart Guide, you can make your Web pages comply. By following the generously illustrated, step-by-step instructions that are the hallmark of the Visual QuickStart series, you'll create beautiful code that works consistently across browser versions and platforms (including hand-held devices and cell phones) in no time. This updated edition includes a new section on foreign-language and multilingual Web sites as well as ample coverage on how the use of HTML is changing. What hasn't changed, however, is the book's popular format: Task-oriented, step-by-step instruction that builds on your growing knowledge. Info-packed appendixes, a comprehensive index, and plenty of screen shots and code examples make HTML for the World Wide Web, Fifth Edition, with XHTML and CSS: Visual QuickStart Guide a must-have reference. Whether you're just getting your feet wet (no prior HTML knowledge is required) or design Web sites for a living, you'll turn to this best-selling guide again and again for answers to all of your HTML-related questions.",
        "Category": " Computers , Programming Languages , HTML",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Health & Weight-loss Breakthroughs 2009: Maximum Immunity",
        "Authors": "By Prevention",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "What Your Doctor May Not Tell You About(TM) Alzheimer's Disease: The Complete Guide to Preventing, Treating, and Coping with Memory Loss",
        "Authors": "By Mitchell, Deborah R. and Devi, Gayatri",
        "Description": "The director of the New York Memory and Healthy Aging Services offers sound advice for patients and caregivers facing Alzheimer's disease. This guide covers prevention, treatment, and coping with memory loss and examines the symptoms and stages of Alzheimer's.",
        "Category": " Health & Fitness , Diseases , Nervous System (incl. Brain)",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Going Places with Children in Washington, DC 17th Edition, 50th Anniversary Edition",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Green Acres School",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "After Surgery, Illness, or Trauma : 10 Practical Steps to Renewed Energy and Health",
        "Authors": "By Ryan, Regina Sara",
        "Description": "This work offers 10 practical steps for dealing dealing gently and effectively with the temporary, but often neglected, issues of recuperation. It looks at such topics as how to manage short-term loss of independence and how to cope with fear, boredom, anger and impatience.",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Hohm Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "History of Art for Young People",
        "Authors": "By Janson, H. W., Janson, Anthony F., Fanson, Anthony F.",
        "Description": "A comprehensive overview of the evolution of Western art ranges from the cave art of prehistory to the latest developments of the present day and features material on women and black artists, modern art, and photography",
        "Category": "",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "The Selected Works of T. S. Spivet",
        "Authors": "By Larsen, Reif",
        "Description": "A brilliant, boundary-leaping debut novel tracing twelve-year-old genius map maker T.S. Spivet's attempts to understand the ways of the worldWhen twelve-year-old genius cartographer T.S. Spivet receives an unexpected phone call from the Smithsonian announcing he has won the prestigious Baird Award, life as normal-if you consider mapping family dinner table conversation normal-is interrupted and a wild cross-country adventure begins, taking T.S. from his family ranch just north of Divide, Montana, to the museum's hallowed halls. T.S. sets out alone, leaving before dawn with a plan to hop a freight train and hobo east. Once aboard, his adventures step into high gear and he meticulously maps, charts, and illustrates his exploits, documenting mythical wormholes in the Midwest, the urban phenomenon of \"rims,\" and the pleasures of McDonald's, among other things. We come to see the world through T.S.'s eyes and in his thorough investigation of the outside world he also reveals himself. As he travels away from the ranch and his family we learn how the journey also brings him closer to home. A secret family history found within his luggage tells the story of T.S.'s ancestors and their long-ago passage west, offering profound insight into the family he left behind and his role within it. As T.S. reads he discovers the sometimes shadowy boundary between fact and fiction and realizes that, for all his analytical rigor, the world around him is a mystery. All that he has learned is tested when he arrives at the capital to claim his prize and is welcomed into science's inner circle. For all its shine, fame seems more highly valued than ideas in this new world and friends are hard to find. T.S.'s trip begins at the Copper Top Ranch and the last known place he stands is Washington, D.C., but his journey's movement is far harder to track: How do you map the delicate lessons learned about family and self? How do you depict how it feels to first venture out on your own? Is there a definitive way to communicate the ebbs and tides of heartbreak, loss, loneliness, love? These are the questions that strike at the core of this very special debut.Now a major motion picture directed by Jean-Pierre Jeunet and starring Kyle Catlett and Helena Bonham Carter.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Press",
        "Price Starting With ($)": "6.32",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Knowledge from What?: Theories and Methods in Social Research",
        "Authors": "By Phillips, Derek L.",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally & Co ,U.S.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1971"
        }
    },
    {
        "Title": "Trojan Gold: A Vicky Bliss Novel of Suspense (Vicky Bliss Series, 4)",
        "Authors": "By Peters, Elizabeth",
        "Description": "A picture is worth a thousand words . . . but the photograph art historian Vicky Bliss has just received in the mail gives rise to a thousand questions instead. At first glance it appears to be the famous portrait of Frau Schliemann adorned in the gold of Troy. But closer study reveals the picture to be contemporary—which is odd since Vicky knows the Trojan gold vanished sometime around the end of World War Two. And if she needed further proof that something here is terribly amiss, a quick look at the blood-stained envelope the photo arrived in should do the trick.Yet Vicky is not the only expert to receive this mysterious mailing. And the entire circle is gathering for a festive Bavarian Christmas—one, hopefully, to be made even more festive by the rediscovery of an ancient lost treasure. But the celebration could prove to be short—and bloody—courtesy of a very determined killer in their midst . . .",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Harper",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Good Gifts from the Home: Soaps, Shampoos & Other Suds: Make Beautiful Gifts to Give (or Keep)",
        "Authors": "By Reno, Kelly",
        "Description": "Provides instructions for making and molding soaps, includes recipes for cold  cream, shampoos, shower gels, foot baths, hair conditioners, and children's soaps, and offers advice on gift wrapping",
        "Category": " Antiques & Collectibles , Care & Restoration",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Sacred Thirst",
        "Authors": "By Barnes, M. Craig",
        "Description": "Jesus once said, \"Whoever drinks of the water that I will give them will never be thirsty.\" So why are Christians still thirsty? We throw ourselves into church work, Bible studies, prayer, missions, fellowship. Yet still we search restlessly for something more. What are we missing?Perhaps the answer is, more of Jesus. Church meetings and programs, ministry, Christian counseling, and home groups are all good, but they are not him. It doesn't matter how devoted we are to these wonderful activities; they are not the same thing as communion with Jesus. Our souls crave him alone.In Sacred Thirst, author and pastor Craig Barnes brings us face-to-face with our desperate longing for God. Like the woman at the well, we have tried to satisfy our parched souls with so many other things—even religious things. But when we get to the bottom of our desire, we find Jesus quietly waiting with his living water—intimatecommunion with the Father, Son, and Holy Spirit.This book is filled with unique insights into human experience and the character of God. With his keen understanding of the needs of contemporary Christians, Barnes points to the only way our thirst will ever be satisfied. Drawing from his rich background in the Bible and his tender insights as a pastor, he leads us into a new understanding ofourselves and the uncontrollable but gracious God we seek.",
        "Category": " Religion , Christian Life , Personal Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Greece: The Rough Guide, Sixth Edition",
        "Authors": "By FISHER, John, Dubin, Marc, Ellingham, Mark, and Jansz, Natania",
        "Description": "",
        "Category": " Travel , Europe , Greece",
        "Publisher": "Rough Guides",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "American Government, Eighth Edition",
        "Authors": "By Wilson, James Q. and Diiulio, John J.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "A Christmas Visitor",
        "Authors": "By Saperstein, David and Samerjan, George",
        "Description": "Determined to restore the Christmas spirit to their home, shrouded in grief since the death of their son, George Boyajian and his family encounter a stranger who forever changes all of their lives with a special message of love and hope. Reprint.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Soviet Power and Europe (A Rand Corporation research study)",
        "Authors": "By Wolfe, Professor Thomas W.",
        "Description": "",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1970"
        }
    },
    {
        "Title": "Jaywalking with the Irish",
        "Authors": "By Monagan, David",
        "Description": "",
        "Category": " Travel , Europe , Ireland",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Who's in Love with Arthur?: An Arthur Chapter Book (Marc Brown Arthur Chapter Books (Paperback))",
        "Authors": "By Brown, Marc",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Out of the Night",
        "Authors": "By Corderman, Esther Boyce",
        "Description": "",
        "Category": "",
        "Publisher": "McClain Printing Co",
        "Price Starting With ($)": "11.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    }
]