[
    {
        "Title": "DHTML and CSS for the World Wide Web, Third Edition",
        "Authors": "By Teague, Jason Cranford",
        "Description": "If you can't afford to let the Web get ahead of you, you can't afford not to have this guide. In this best-selling Visual QuickStart Guide, you'll find all the friendly, step-by-step instructions you need to start using DHTML and CSS to add visually sophisticated, interactive elements to your Web sites. Completely updated to cover the new browsers, standards, and DHTML and CSS features that define the Web today, the one thing that hasn't changed in this edition is its task-based visual approach to the topic.     Using loads of tips and screenshots, veteran author Jason Cranford Teague covers a lot of ground--from basic and advanced dynamic techniques to creating effects for newer browsers, migrating from tables to CSS, and creating new DHTML scripts. If you're new to DHTML and CSS, you'll find this a quick, easy introduction to scripting, and if you're a more experienced programmer, you'll be pleased to find practical, working examples throughout the book.",
        "Category": " Computers , Programming Languages , General",
        "Publisher": "Peachpit Press",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Strength Training for Muscle Development: A Step-by-step Guide Improve Your Strength 20-minute Worko",
        "Authors": "By Mark Hatfield",
        "Description": "",
        "Category": "",
        "Publisher": "Main Street",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Stupid Crook Book (Volume 1)",
        "Authors": "By Gregory, Leland",
        "Description": "Police arrived on the scene of a recreational vehicle park to discover a very sick man vomiting and complaining of stomach cramps. The man admitted he had attempted to siphon gas from a motor home but inadvertently put the siphon tube in the wrong tank. Instead of gasoline, the man sucked out the contents of the sewage holding tank. If stupidity were lethal, all of the criminals highlighted in The Stupid Crook Book would be dead. This book from highly successful author Leland H. Gregory III captures hilarious tales of captured criminals who are so dumb you almost feel sorry for them. Almost. This lineup of criminal bozos includes: * Michael Anthony Silver, who made a $250 call to a 1-900 psychic hotline in the course of robbing a home. When the phone bill came later that month the homeowners called the police, who traced the call back to the hotline. It turns out Silver used his real name with the psychic.* A would-be bank robber who fainted when a bank teller told him she had no money. The police later found his getaway car and discovered the key locked inside it.* Tony Bariteau, who was arrested and pled guilty to breaking into the Deja Vu store in Troy, Alabama-twice! He was arrested because the same witness spotted him smashing the same window and stealing much of the same merchandise. Deja vu indeed.* A wanted fugitive from Maryland who was running low on cash and stopped by a police station in Texas to ask for gas money. The police saved him the expense and gave him a free ride back to prison.The Stupid Crook Book builds on the successful trail Gregory blazed with America's Dumbest Criminals, the book he coauthored that spent 17 weeks on the New York Times best-seller list. Author's web site: www.realwacky.com/",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Sister's Choice (Patchwork Circle Series, Book 2)",
        "Authors": "By Pella, Judith",
        "Description": "Developing her reputation as a highly skilled quilter in spite of awkward innate abilities, Maggie Newcomb hopes to win the affection of a critical fellow quilter's son but finds her plans challenged by the arrival of a wealthy and beautiful young woman who quickly becomes a rival. Original.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Plain Jayne (Plain and Simple)",
        "Authors": "By Manton Lodge, Hillary",
        "Description": "After losing out on a huge career opportunity, reporter Jane Tate escapes to Oregon Amish country, seeking solace and maybe a big story, but Jayne finds life more complicated than she expected in this land of buggies and bonnets. Original.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Homes: Today and Tomorrow",
        "Authors": "By Sherwood, Ruth F.",
        "Description": "A textbook examining the theory and history of house design, construction, and furnishing, as well as factors to be considered when buying a house.",
        "Category": " Architecture , General",
        "Publisher": "McGraw-Hill/Glencoe",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Demon Thief (The Demonata, 2)",
        "Authors": "By Shan, Darren",
        "Description": "The second novel in this bonechilling series by Darren Shan, author of the New York Times bestselling Cirque Du Freak series is sure to give you goosebumps.  Kernel Fleck has always known he's weird. He sees lights. Strange, multi-colored patches of light, swirling through the air. But it's not until a window opens into a demon world, with horrific consequences, that Kernel discovers his powers. As a Disciple, his mission is to hunt vicious, powerful demons to the death...",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Food Cures: Fight Disease with Your Fork!",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "Discover cures for common conditions from allergies to gum disease, from insomnia to lowering your cholesterol.  Includes 75 immune-boosting recipes.Clean out your medicine cabinet and restock with healing and appealing items from the grocery store. Treat the most common ailments naturally, safely, and deliciously-and live pain free, disease free, and worry free!   Rely less on pills and more on real food. How much? How often? Here you'll find all the answers, the research-validated treatments, and successful cures for dozens of common conditions. The past few years have been filled with intriguing announcements from the world of medical research. Forget about wonder drugs-we're living in a time of wonder foods. The foods described in this book are nutritional powerhouses bursting with compounds that have specific and well-defined health benefits-included are 75 healthy recipes that will please every member of the family. Healing foods section includes information about: * How a rainbow of fruits and vegetables (8 to 9 servings a day)-the wider the variety the better-will lower the risk of an array of cancers * How dark chocolate contains hefty amounts of disease-fighting flavonoids and can significantly improve blood pressure * How olive oil lowers \"bad\" LDL cholesterol and raises \"good\" HDL cholesterol * How spinach, in addition to protecting your eyes from macular degeneration, is a valuable source of vitamin K, which can help maintain bone density Discover cures for common conditions from allergies to gum disease, from insomnia to lowering your cholesterol. Changing your diet won't guarantee that you'll never get sick or need drugs, but eating the right food can help heal what ails you and can bolster your body's defenses against disease, treat disease directly, and even slow the aging process.",
        "Category": " Medical , Diet Therapy",
        "Publisher": "Trusted Media Brands",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Man from a Far Country: An Informal Portrait of Pope John Paul II",
        "Authors": "By Craig, Mary",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow",
        "Price Starting With ($)": "5.86",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Let's Go Paris 13th Edition",
        "Authors": "By Emerson, Maude (EDT)",
        "Description": "Completely revised and updated, Let's Go: Paris is your insider's guide to the City of Light. Our forty-five years of travel savvy deliver everything you need to know to be mistaken for a native, from an expanded introduction to contemporary Paris to tips on ordering un café like a local. This edition examines Paris from every angle, telling you where to find falafel on rue de Rosiers and giving you opportunities to experience the city's social issues first-hand. So, whether you'd rather savor foie gras under the gaze of wine-making wax monks or stroll the cobblestone Quai de Valmy near the locks of Canal St-Martin, Let's Go can show you the way.",
        "Category": " Travel , Europe , France",
        "Publisher": "Let's Go Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Precious Little Fairies",
        "Authors": "By Valerie Tabor Smith",
        "Description": "",
        "Category": "",
        "Publisher": "Paradise Press, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Inscape: Discovering Personhood in the Marriage Relationship",
        "Authors": "By Synder, Ross",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "How Sweet It Is",
        "Authors": "By Wisler, Alice J.",
        "Description": "Deena Livingston leaves behind a broken romance and her chef job in Atlanta to spend time at her grandfather's cabin in the mountains of North Carolina. But her grandfather has an odd request: he wants Deena to teach cooking classes to the ragtag group of middle-schoolers who attend the local afterschool program, The Center. Reluctantly, Deena agrees, but how is she supposed to convince these kids that cooking at home is better than eating at McDonalds? And after all she went through in Atlanta, why is she attracted to Zack, the social worker at The Center? Can a Dr. Seuss-quoting plumber, a curly-haired basketball player, and a group of middle-schoolers change Deena's outlook on life?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "sarah's garden (A Patch of Heaven Novel)",
        "Authors": "By Long, Kelly",
        "Description": "Quite by accident, Sarah King has fallen in love. But this love is forbidden, and could cost her everything she holds dear.Tucked into the majesty of Pennsylvania's Allegheny Mountains is a garden Sarah King has been nurturing for years. She never feels more alive than when she is alone with her thoughts and her Creator among the delicate rows of plants. But then duty calls her away from her beloved garden and into a world she knows little about.Grant Williams, a handsome young veterinarian, has left the city to open a rural practice among the Amish. Within minutes of meeting shy but feisty Sarah King, he is captivated by her.As their feelings grow for one another, Sarah insists they can never be together. Marrying Grant would mean being uprooted from her home, her family, and her community. Throughout the cold Pennsylvania winter, with her garden tucked away until spring, Sarah begins crafting a quilt that illustrates her pain. Can anything lasting blossom from a love that's forbidden?",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Judy Moody: Around the World in 8 1/2 Days",
        "Authors": "By McDonald, Megan",
        "Description": "",
        "Category": "",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Diabetic Body: An Owner's Manual",
        "Authors": "By Publications International Ltd., Gower, Timothy",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "A Dandy in Aspic",
        "Authors": "By Derek Marlowe",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Fodor's New Orleans 2007 (Travel Guide)",
        "Authors": "By Travis, William (EDT)",
        "Description": "Completely updated and revised, Fodor's New Orleans 2007 has the most up-to-date coverage of post-Katrina New Orleans. Visually arresting front matter features, new planning tips, FAQs, post-Katrina neighborhood profiles, new boxes and revised maps to help readers better plan and customize their trip.",
        "Category": " Travel , United States , South , West South Central (AR, LA, OK, TX)",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Messiah, An Oratorio for Four-Part Chorus of Mixed Voices - The Choruses with Piano Accompaniment (G. Schirmer's Editions of Oratorios and Cantatas)",
        "Authors": "By G. F. Handel",
        "Description": "",
        "Category": "",
        "Publisher": "Hal Leonard",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1912"
        }
    },
    {
        "Title": "Quick Vegetarian Pleasures: More than 175 Fast, Delicious, and Healthy Meatless Recipes",
        "Authors": "By Lemlin, Jeanne",
        "Description": "More than 175 quick, wholesome, nutritious, and delicious recipes to be enjoyed by vegetarians and non-vegetarians alike.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "5.02",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Twinkle Twinkle Little Star (Kate Toms Series)",
        "Authors": "By Toms, Kate",
        "Description": "The Kate Toms Series is a fantastic series by Kate Toms that will engage and amuse little ones and adults alike.Twinkle, Twinkle Little Star isa beautiful, soft-to-touch board book that babies and toddlers willlove to share. It has a soft-to-touch cover with flocking and glitterand exquisite, hand-stitched illustrations throughout. The charming,rhyming text is loosely based on \"Twinkle, Twinkle Little Star\" - abook to read again and again.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "A Patient's Guide to PCOS: Understanding--and Reversing--Polycystic Ovary Syndrome",
        "Authors": "By Ryan, George and Futterweit, Walter, M.D.",
        "Description": "A comprehensive guide to polycystic ovary syndrome, from a leading authority on the condition One in ten American women of childbearing age is affected by polycystic ovary syndrome (PCOS) to some degree, and many suffer from serious symptoms, such as infertility, early miscarriage, chronic pelvic pain, weight gain, high blood pressure, acne, and abnormal hair growth. PCOS is by far the most common hormone imbalance in women of this age group, yet few women understand the threat it poses to their health—or how to prevent it. In A Patient's Guide to PCOS, Dr. Walter Futterweit, a foremost authority on PCOS in America, tells women everything they need to know about this condition and how to treat it. Drawing on his twenty-five years researching and treating the condition and his ongoing long-term study of more than a thousand women with PCOS, Futterweit discusses• what PCOS is and how it affects your body• what to eat and how to exercise to control PCOS• all the treatment options, including the latest drug therapies• how to reverse PCOS-induced infertility and restore healthy skin and hair• resources for preventing, diagnosing, and treating PCOSThis comprehensive guide contains everything women need to know about PCOS—from identifying warning signs and seeking a diagnosis to finding emotional support in recovery—to regain their health and resume their lives.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Secret Identity of Devon Delaney (mix)",
        "Authors": "By Barnholdt, Lauren",
        "Description": "Mom says karma always comes around to get you, and I guess it's true. Because last summer I was a total liar, and now, right in the middle of Mr. Pritchard's third-period math class, my whole world is about to come crashing down.   That's because while Devon was living with her grandmother for the summer, she told her \"summer friend,\" Lexi, that she was really popular back home and dating Jared Bentley, only the most popular guy at school. Harmless lies, right? Wrong. Not when Lexi is standing at the front of Devon's class, having just moved to Devon's town. Uh-oh.   Devon knows there's only one way to handle this -- she'll just have to become popular! But how is Devon supposed to accomplish that when she's never even talked to Jared, much less dated him?! And it seems the more Devon tries to keep up her \"image,\" the more things go wrong. Her family thinks she's nuts, her best friend won't speak to her, and, as if it's not all complicated enough, Jared starts crushing on Lexi and Devon starts crushing on Jared's best friend, Luke. It all has Devon wondering -- who is the real Devon Delaney?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Sunrise Song: Treasures of the Heart #4 (HeartQuest)",
        "Authors": "By Palmer, Catherine",
        "Description": "Dr. Fiona Thornton has committed her life to studying and protecting the elephants of Kenya. Rogan McCullough, a wealthy entrepreneur, offers Fiona generous financial support if she will allow him to bring tourists to her camp to see the elephants. When poachers threaten Fiona's beloved elephants, she and Rogan must work together to save them. In the process, both reach new depths of faith and discover an unforeseen love for each other.",
        "Category": " Fiction , Religious",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Sam",
        "Authors": "By Joseph Cahill",
        "Description": "",
        "Category": "",
        "Publisher": "Crystal Gull Pub.",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Lonely Planet Montreal",
        "Authors": "By Gray, Jeremy",
        "Description": "",
        "Category": " Travel , Canada , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Dead Head: A Dirty Business Mystery (Dirty Business Mysteries)",
        "Authors": "By Harris, Rosemary",
        "Description": "The talented Rosemary Harris continues to pick up steam, garner acclaim, and collect fans with her quirky, beloved Dirty Business Mystery series Fugitive Mom. That’s the tabloid headline that rocks Springfield, Connecticut when one of the town’s favorite ladies is discovered to be an escaped convict. With a little help from the always game Lucy Cavanaugh, Paula is hired to find out which of her neighbors is a fugitive from the law and why the long-kept secret has finally come out.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Why the Ocean is Salty (Steck-Vaughn Pair-It Books Proficiency Stage 5: Leveled Reader)",
        "Authors": "By Steck-Vaughn (COR)",
        "Description": "",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "STECK-VAUGHN",
        "Price Starting With ($)": "8.52",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "True South: Travels Through a Land of White Columns, Black-Eyed Peas & Redneck Bars",
        "Authors": "By Auchmutey, Jim (EDT) and Donosky, Lea (EDT)",
        "Description": "",
        "Category": " Travel , United States , South , General",
        "Publisher": "Longstreet Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "CliffsNotes on Wharton's Ethan Frome (Cliffsnotes Literature Guides)",
        "Authors": "By Pavlos, Suzanne",
        "Description": "The original CliffsNotes study guides offer a look into key elements and ideas within classic works of literature. The latest generation of titles in this series also features glossaries and visual elements that complement the familiar format.CliffsNotes on Ethan Frome explores life in the personal prison designed by the lead character, a “ruin of a man” who would rather be miserable with his lot in life than stray from accepted social convention.Following the story of a poor farmer whose devotion to duty and fear of humiliation keep him from tasting happiness, this study guide provides summaries and commentaries for each chapter within this tragic tale. Other features that help you figure out this important work includeLife and background of author Edith WhartonIntroduction to the novel, with a synopsis and character mapFull character list and analyses of central figuresCritical essays on the author’s style, choice of literary tools, and use of themesReview section that features fill-in-the-blank questions, quoted passages, essay questions, and suggested practice projectsResource Center with books, articles, and Web sites that can help round out your knowledgeClassic literature or modern-day treasure—you&#39;ll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Madame Bovary (Collector's Library)",
        "Authors": "By Gustave Flaubert",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "If We'd Wanted Quiet, We Would Have Raised Goldfish",
        "Authors": "By Lansky, Bruce",
        "Description": "Poems deal with family relationships, child development, aging, and the roles of parents and children",
        "Category": " Family & Relationships , General",
        "Publisher": "Meadowbrook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Asia's Rising Economic Tide: Unique Opportunities for the United States (Cir Report)",
        "Authors": "By Heginbotham, Erland and Heginbotham, S.",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Planning Assn",
        "Price Starting With ($)": "12.33",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Little Girls Bible Storybook for Fathers and Daughters",
        "Authors": "By Larsen, Carolyn, Turk, Caron (ILT), and Turk, Caron",
        "Description": "Proven Bible storybook series for children ages 4-7 now available with easier to read font and thoroughly revised and updated.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Baker Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Times Concise Atlas Of World History",
        "Authors": "By BARRACLOUGH,",
        "Description": "",
        "Category": "",
        "Publisher": "Hammond",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "A Peacock in the Land of Penguins",
        "Authors": "By Blanchard, Kenneth H. (FRW), Schmidt, Warren H., Hateley, B. J. Gallagher, and Weiss, Sam (ILT)",
        "Description": "This brand new edition of a classic, international bestseller continues to bring keen insight to an important topic—workforce diversity. Written in a charming, engaging style, it is a contemporary corporate fable—a tale for our times. This special 20th anniversary edition includes many new tips, tools, and strategies for peacocks and penguins alike—as well as an entirely new bonus parable. Through the story of Perry the Peacock and his fine feathered friends, authors Gallagher and Schmidt bring to life the challenges of birds of different feathers who struggle to be successful in the conformity-minded Land of Penguins. Their travails illuminate the challenges of creating a pluralistic corporate culture in which the talent, energy, and commitment of all employees are fully engaged.  People who have new ideas that differ from business as usual are often ignored or criticized for the very thing that makes them valuable: their originality and creativity. This unique book helps organizations break out of \"penguin thinking” in order to tap into and leverage the creativity of diversity. Learn how to cultivate an organizational culture in which new ideas can flourish and innovation can take flight.",
        "Category": " Business & Economics , Management",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "God Chaser's Daily Journal: Daily Meditation and Personal Journal",
        "Authors": "By Tenney, Tommy",
        "Description": "",
        "Category": " Religion , Meditations",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Corvette Past Present Future",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The Chocolate & Coffee Bible: Over 300 Delicious, Easy-to-Make Recipes for Total Indulgence, from Bakes to Desserts, Shown Step by Step 1300 Glorious Photographs",
        "Authors": "By Catherine ... [et al.] Atkinson",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Every Freaking! Day with Rachell Ray: An Unauthorized Parody",
        "Authors": "By Hilts, Elizabeth",
        "Description": "Hey kids!  If 30-minute meals are good, wouldn't 30-second meals be even better?  You bet they would!  And EVERY FREAKING! DAY WITH RACHELL RAY makes this dream a reality! This 64-page, full-color parody of the super-caffeinated media phenomenon Rachael Ray doesn't merely mimic the tone of the megastar's monthly magazine, daily talk show, multiple Food Network shows and countless ad campaigns, it nails it! Bestselling author Elizabeth Hilts captures Rachael's perky exuberance, her \"casual\" approach to cooking and her irrepressible and wholly unique Rayisms.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Personality Puzzle: Understanding the People You Work With",
        "Authors": "By Littauer, Florence and Littauer, Marita",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Fleming H. Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Very Daring Duchess",
        "Authors": "By Jarrett, Miranda",
        "Description": "Escaping the invasion of Napoleon's army, Francesca Robin seeks to flee Italy on an English ship. When Francesca -- an artist whose risqué paintings are much desired by wealthy gentlemen buyers -- learns of Admiral Lord Nelson's decree that no lady may gain passage on an English ship without a husband, she dares to do the unthinkable: find an eligible English bachelor and marry him at once.  Estranged from his noble family, Captain Lord Edward Ramsden has built a stellar naval career. Proper and upstanding, he shocks himself by impulsively exchanging vows with this forward and flirtatious lady in distress. But in London, their mock marriage is turned upside down when Edward is unexpectedly named a duke -- and Francesca his unlikely duchess -- stunning the genteel ton. Their newfound social status invites danger and scandal -- and now the duke risks all to win the heart of the woman he loves madly -- his bold-spirited duchess.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "POCKET",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Joy of Women's Friendships: Sharing the Gift of Intimacy (A Bible Study for Women)",
        "Authors": "By Brestin, Dee",
        "Description": "",
        "Category": " Religion , Biblical Studies , Bible Study Guides",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "From Bumper to Bumper: Bob Sikorsky's Best Automotive Tips",
        "Authors": "By Sikorsky, Robert",
        "Description": "A simple, practical guide to extending car life (don't clean an air filter, check the exhaust system for obstructions) and the reason behind the advice. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Vines & Climbers",
        "Authors": "By Barash, Cathy Wilkinson",
        "Description": "",
        "Category": " Gardening , Ornamental Plants",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "An Ordinary Man: An Autobiography",
        "Authors": "By Zoellner, Tom and Rusesabagina, Paul",
        "Description": "A remarkable account of the amazing life story of the man who inspired the film Hotel Rwanda Readers who were moved and horrified by Hotel Rwanda will respond even more intensely to Paul Rusesabagina’s unforgettable autobiography. As Rwanda was thrown into chaos during the 1994 genocide, Rusesabagina, a hotel manager, turned the luxurious Hotel Milles Collines into a refuge for more than 1,200 Tutsi and moderate Hutu refugees, while fending off their would-be killers with a combination of diplomacy and deception. In An Ordinary Man, he tells the story of his childhood, retraces his accidental path to heroism, revisits the 100 days in which he was the only thing standing between his “guests” and a hideous death, and recounts his subsequent life as a refugee and activist.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "For Women Only Discussion Guide: A Companion to the Bestseller about the Inner Lives of Men",
        "Authors": "By Feldhahn, Shaunti and Rice, Lisa A. (CON)",
        "Description": "More for Women Only! What’s going on in a man’s mind? You don’t have to scratch your head any longer. After Shaunti Feldhahn’s For Women Only: What You Need to Know About the Inner Lives of Men broached the subject, women everywhere responded with an overwhelming desire to dig deeper. Now this all-new discussion guide will help you and your friends explore the complex terrain beneath a man’s confident exterior. Personal stories, fascinating case studies, and pointed questions will launch the conversations you need to open your eyes to what the man in your life—a boyfriend, brother, husband, or son—is really thinking and feeling. Men want to be understood, but they’re afraid to “freak out” the women they love by confessing what is happening inside their heads. For women who really do want to understand, this group or one-on-one discussion guide is a must for helping you apply all those “ah ha” revelations to your relationships with the men in your life!  This newly expanded study guide will help you answer that question. Discussion questions, personal stories, and situational case studies will equip you to apply truths from the book to the relationships in your life. Additional content includes:      • Feedback from For Women Only readers     • Space to pen your thoughts after each chapter     • Quotes to remember     • Tips for starting your own discussion group   Ideal for book clubs, small groups, or one-on-one dialogue with the man in your life, this is an invaluable resource and companion to the acclaimed book. Story Behind the BookAbout five minutes after For Women Only hit the shelves, women started talking about it in small groups, book clubs, and coffee houses—and with their men. And about five days after that, Shaunti started getting e-mails saying, “We could really use something to help us work through these subjects.” For Women Only has opened the eyes of women to things they never understood about men before. Now, the For Women Only Discussion Guide will help them talk through and apply those truths to their lives.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Five Hundred Fifty Perennial Garden Ideas: A Comprehensive Visual Sourcebook for Beautiful Gardens Year After Year",
        "Authors": "By Fell, Derek, Heath, Carolyn, and Fell, Derek (PHT)",
        "Description": "A vivid and varied collection of garden photos (three or four to a page), each with a caption describing how particular plants are used to create particular effects. A comprehensive visual sourcebook that is informative and inspiring. 9.25x11.5\" Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Gardening , Flowers , Perennials",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Writing Tides: Finding Grace and Growth Through Writing",
        "Authors": "By Groff, Kent Ira",
        "Description": "People write all the time—memos, cards, or emails, presentations for speaking, teaching, or preaching. Whether you write for personal reflection or for others, this book will deepen the creative process by finding meaning and mystery in ordinary notes or analytical essays, prose or poetry, sermons or lectures, music or lyrics, committee minutes or family stories. “Writing is a form of contemplation,” wrote Thomas Merton. Exquisitely written, Writing Tides embodies Kent Groff’s passion to help anyone discover contemplative insights through personal reflections, practical notes, or work-related writing. Drawing upon the author’s experience leading courses in writing, spiritual formation, and vocation, Groff guides readers to discover writing practices that aid meditation, prayer, and spiritual growth.An excerpt from the Circuit Rider review: \"Some will find Writing Tides to be of immense help as they seek to become more creative and disciplined writers; this work will be of particular interest to those for whom creativity and discipline are spiritual matters.\" (Click here to read the entire review.)",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Gardener's Palette: The Complete Guide to Selecting Plants by Color",
        "Authors": "By Dale, John C. and Gunnell, Kevin",
        "Description": "Offers more than 1,000 choices of flowers categorized by color, with information on planting, cultivation, flowering season, plant size, and stem length",
        "Category": " Gardening , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Penguin Atlas of Women in the World: Completely Revised and Updated (Reference)",
        "Authors": "By Seager, Joni",
        "Description": "World events continue to reveal the importance of understanding how women live across continents and cultures. Using maps, text, and other graphics in this new revision of her eye-opening book, Joni Seager employs up-to-the-minute research and data to show what shifts have occurred in the ten years since the first edition was published - the strides made by women and the distance still to be traveled.",
        "Category": " Reference , Atlases, Gazetteers & Maps",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Space: Learning About Gravity, Space Travel and Famous Astronauts (I'd Like to Be A. . .)",
        "Authors": "By n/a",
        "Description": "",
        "Category": " Children's Music",
        "Publisher": "Twin Sisters",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The small garden planner",
        "Authors": "By Rose, Graham",
        "Description": "",
        "Category": "",
        "Publisher": "Simon And Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Orenda: A Novel of the Iroquois Nation",
        "Authors": "By Cameron, Kate",
        "Description": "Morning Song, the daughter of an Iroquois woman and a French trapper, takes up the mantle of her grandmother, Teller of Legends, the keeper of the tribal history, but her task is threatened by war, love, and the necessity for following her own vision",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Home-Based Business For Dummies",
        "Authors": "By Edwards, Sarah, Edwards, Paul, and Economy, Peter",
        "Description": "Thanks to the Internet, home-based businesses are booming. With a home computer and a good idea, you can market and sell almost anything in the world just from home. Whether you’re selling homemade jams or working as a business consultant, today’s entrepreneur doesn’t even have to leave home.Home-Based Business For Dummies, 2nd Edition will help you make your endeavor profitable and successful! Ideal for future entrepreneurs who have the urge and want the know-how, this updated guide includes new information on home business scams and how to avoid them, shows how to create an efficient, comfortable (but not too comfortable) work environment, explains how to put new technologies to work for you, and much more. There’s even a 10-question quiz to help you determine if you’re ready. You’ll learn all the basics, including:Selecting the right kind of business for youSetting up a home officeManaging money, credit, and financingMarketing almost anything in the worldAvoiding distractions at homeHome-Based Business For Dummies, 2nd Edition was written by Paul and Sarah Edwards, award-winning authors who write a monthly column for Entrepreneur magazine, and Peter Economy, an author or coauthor For Dummies books on managing, consulting, and personal finance. In straightforward English, they show you how to:Stay connected to the business community, even when working from homeKeep your work separate from your personal lifeHandle benefits, health insurance, and your retirement planningMake sure your bookkeeping is accurate and legalUse the Internet to bid for work, list your services in directories, network, and moreChoose the technology and other resources you needDevelop your own marketing and advertising strategiesNavigate IRS rules for home-based businessesHome-Based Business For Dummies is packed with ideas and information that will help you get started right and help established, successful home-based business owners stay ahead of the pack. Use it well and this handy guide will be the most important reference in your home office.",
        "Category": " Business & Economics , Home-Based Businesses",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Creative Edge Page Design",
        "Authors": "By Haller, Lynn (EDT)",
        "Description": "Designers who want to walk the cutting edge in their own work will find inspiration in the pages of this progressive book. An international crew of design visionaries discusses their featured magazine and book designs, brochures, ads and posters, revealing how they achieved the \"creative edge\" in every piece. Showcased in categories, which include Concept, Type, Image and Layout, each piece includes insight on specs and technique.",
        "Category": " Design , Graphic Arts , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The outer edges",
        "Authors": "By Jackson, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Rinehart",
        "Price Starting With ($)": "10.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "Red Pawns",
        "Authors": "By Griswold, George, and Robert George Dean",
        "Description": "",
        "Category": "",
        "Publisher": "E. P. Dutton",
        "Price Starting With ($)": "9.34",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "The Cook's Encyclopedia of Barbecues, Grills & Outdoor Eating (Cook's Encyclopedias)",
        "Authors": "By France, Christine",
        "Description": "Choose from over 200 tempting savory and sweet barbecue recipes, plus ideas for salads and accompaniments, salads, dips, and marinades.",
        "Category": " Cooking , Reference",
        "Publisher": "Anness",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Soda Fountain Classics",
        "Authors": "By Elsa Peterson-Schepelern",
        "Description": "",
        "Category": "",
        "Publisher": "Ryland Peters and Small",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Bustin'",
        "Authors": "By Webber, Minda",
        "Description": "Sam Hammett, a ghost and paranormal pest controller, is forced to team up with a sexy rival, Nicolas Strakhov, owner of Monsters 'R Us, to rid the world of an ancient Greek myth that is turning people to stone. Original.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Everything Texas Hold 'Em Book: Tips And Tricks You Need to Take the Pot",
        "Authors": "By Wenzel, John",
        "Description": "In a definitive overview of the popular card game, a successful professional poker player sheds new light on the game, discussing the rules of Texas Hold'em and its many variations and offering helpful advice and expert strategies on everything from the art of bluffing to measuring the odds and placing bets. Original. 40,000 first printing.",
        "Category": " Games & Activities , Card Games , Poker",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "A Betty Neels Christmas",
        "Authors": "By Neels, Betty",
        "Description": "Two heartwarming tales of holiday romance from the beloved author includes A Christmas Proposal, in which Dr. Oliver Hay-Smythe meets a modern-day Cinderella and is determined to rescue her from her dreary existence and lavish her with love, and Winter Wedding. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Holy Clues: The Gospel According to Sherlock Holmes",
        "Authors": "By Kendrick, Stephen",
        "Description": "If God is the greatest mystery of them all, then why not, in pursuit of God, consult the greatest detective of them all? In this imaginative and surprisingly profound book, Stephen Kendrick reveals Sherlock Holmes as spiritual guide. Drawing on the teachings of Christianity, Buddhism, and Judaism--as well as a host of thinkers as varied as Albert Einstein, Gandhi, and Vincent van Gogh--Kendrick explores the stories of Sherlock Holmes and finds remarkably prescient religious insights. He shows us the link between careful observation of clues and the Buddhist concept of \"Bare Attention.\" He illuminates the parallel between the great sleuth's pursuit of justice and God's actions on the scene of the first murder, when Cain slew Abel. And in the detective's open, engaged mind, Kendrick finds a model for uniting the principles of science with a sincere spiritual quest. The result is a book of inspiration for the modern, skeptical searcher--and an entertaining work that sheds new light on the methods of the world's greatest detective.",
        "Category": " Religion , Spirituality",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "A Garden of Wildflowers: 101 Native Species and How to Grow Them",
        "Authors": "By Art, Henry Warren",
        "Description": "This comprehensive illustrated book on growing native wildflowers anywhere in the United States includes dozens of different ways to create a natural and satisfying landscape, tables that compare species, and sources of seeds and plants",
        "Category": " Nature , Plants , Flowers",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Rivers of Zadaa (6) (Pendragon)",
        "Authors": "By Machale, D. J.",
        "Description": "THE BATTLE CONTINUES.   The struggle of good versus evil continues as Bobby Pendragon follows Saint Dane to the territory of Zadaa. Saint Dane's influence has fueled the fire of discontent between two warring tribes: the Rokador and the Batu. This is also the territory where the Traveler Loor lives as a member of the Batu. Together she and Bobby must work to thwart Saint Dane's efforts to destroy Zadaa.   But as Bobby pursues Saint Dane, he begins to notice changes in himself. He is no longer a flip kid looking for excitement. He is a young man beginning to see this quest as more than a series of adventures. He is also learning that as a Traveler, he had powers no normal human should have.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "What's Cooking: Mexican",
        "Authors": "By Spieler, Marlena",
        "Description": "",
        "Category": "",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Diary of a Nobody (Wordsworth Classics)",
        "Authors": "By Grossmith, George and Grossmith, Weedon (ILT)",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Concrete, Masonry, and Brickwork: A Practical Handbook for the Home Owner and Small Builder",
        "Authors": "By United States. Dept. of the Army",
        "Description": "",
        "Category": "",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "Exclusively White House trivia",
        "Authors": "By Pitch, Anthony, Pitch, Anthony S.",
        "Description": "",
        "Category": "",
        "Publisher": "Mino Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The New International Webster's Pocket Grammar Dictionary of the English Language, New Revised Edition",
        "Authors": "By Trident Press International",
        "Description": "",
        "Category": "",
        "Publisher": "Trident Press International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1827"
        }
    },
    {
        "Title": "The Gardener's Companion: An Essential Guide to Plants and Planting",
        "Authors": "By Royal Horticultural Society (Great Britain) (COR), Brickell, Christopher, and Elsley, John",
        "Description": "Christopher Brickell draws on 40 years of gardening experience, particularly from his tenure as Director-General of The Royal Horticultural Society, to describe in this personal guide the 300 garden plants he regards as his special favorites, together with more than 200 secondary recommendations.The plants vary widely in character - from exotic climbers such as the Chilean bell-flower to exquisite alpines such as the spring gentian and from miniature bulbs such as the Siberian squill to handsome trees such as the tupelo, with its brilliant autumn tints. More than 200 color photographs capture the many qualities described.In an anecdotal style, and with infectious enthusiasm, Christopher Brickell offers wealth of planting advice, as well as useful tips on many aspects of honing the gardener's skill. Expert guidance is given on the selection and maintenance of all major plant categories - trees, shrubs, climbers and wall shrubs, herbaceous perennials bulbs, alpines warm-climate and greenhouse plants, and short-lived plants.The plants are organized by season, with separate sections for those \"high-performance\" plants that do well in more than one season. This arrangement makes it easy for the reader to adopt the author's planting choices to create year-round impact in the garden, with carefully staged seasonal highlights.At the back of the book is a practical reference section, which includes detailed listings of nurseries and other sources of plants.Produced in association with The Royal Horticultural Society, The Gardener's Companion is an authoritative plant selector wide a personal voice. For the enthusiastic novice as much as for the committed gardener, this indispensable guide promotes new standards of excellence in the garden, distilling the taste and expertise of one of the world's foremost plant experts.",
        "Category": " Gardening , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Live Flesh",
        "Authors": "By Rendell, Ruth",
        "Description": "After ten years in prison for shooting -- and permanently crippling -- a young policeman, Victor Jenner is released to a strange new world and told to make a new life for himself. It's hard to fill the days, but at least there's one blessing -- he was never convicted for all those rapes he committed. Then Victor meets David, the policeman he shot all those years ago, and David's beautiful girlfriend, Clare. And suddenly Victor's new life is starting to look an awful lot like the old one . . .",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "The Thorn In the Flesh: Hope for All Who Struggle With Impossible Conditions",
        "Authors": "By Kendall, R.T.",
        "Description": "",
        "Category": "",
        "Publisher": "Charisma House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Oh, the Pets You Can Get!: All About Our Animal Friends (Cat in the Hat's Learning Library)",
        "Authors": "By Rabe, Tish, Ruiz, Aristides (ILT), and Mathieu, Joseph (ILT)",
        "Description": "The Cat and Co. take off to the faraway land of Gerpletz where they know quite a lot about caring for pets—especially cats, dogs, guinea pigs, birds, and bunnies! From the food, shelter, exercise, and medical care they need to the love and companionship they crave, the Cat teaches beginning readers how to keep their pets (and themselves!) healthy, safe, and happy.",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Gourmet's Fresh: From the Farmers Market to Your Kitchen",
        "Authors": "By Yanes, Romulo A. (EDT) and Gourmet (COR)",
        "Description": "One of America's leading cooking magazines introduces two hundred recipes, many never before published, that feature seasonal fruits, vegetables, herbs, and organic foods from the local farmer's market, along with eighteen seasonal menus, cooking advice and suggestions, and tips on shopping. 10,000 first printing.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Ice Age: Dawn of the Dinosaurs: My Three Dads",
        "Authors": "By Wilde, A. J. (ADP)",
        "Description": "Manny is on a mission: Make the tundra as safe as possible before baby mammoth is born. With frozen danger everywhere they look, Manny, Sid, and Diego have quite a job to do! Can these future father figures baby-proof nature in time?",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "How To Paint With Watercolors",
        "Authors": "By Crawshaw, Alwyn",
        "Description": "Demonstrates basic techniques for working with watercolors and presents step-by-step instructions for creating landscapes, portraits, and still lifes",
        "Category": "",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Red Riding Hood (retold by James Marshall)",
        "Authors": "By Marshall, James",
        "Description": "\"A thoroughly modern, thoroughly charming retelling of the old favorite. Witty and direct . . . both Granny and child are swallowed, then rescued intact by the hunter who kills the wolf. . . . A perfect union of words, story, and illustration.\"--Kirkus Reviews.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Picture Puffins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "The Human Body (Blow-Up! Junior Science) [ILLUSTRATED]",
        "Authors": "By Coster-Longman, Christina",
        "Description": "",
        "Category": "",
        "Publisher": "McRae Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "A State of Disobedience",
        "Authors": "By Kratman, Tom",
        "Description": "It's Time to Remember the Alamo All Over Again-Here Comes the Second Texan Revolution!In the long war against terrorism, the US Government had taken on extraordinary powers. And now that the war was won, powerful forces in the government had no intention of relinquishing those powers. As in 1860, the country was on the verge of civil war. And as in 1860, a leader arose to save the country-but it was not the President this time. Instead, the Governor of Texas was the woman of destiny. . . .",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Kentucky Bride",
        "Authors": "By Howell, Hannah",
        "Description": "Beautiful Clover Sherwood never expected such a cruel fate. Her father's death has left her penniless, ostracized from Pennsylvania society, and abandoned by her fiancé. All she has now is a grieving mother, two hungry little brothers and no prospects. . .until a wealthy Kentucky backwoodsman with a deep Scottish burr comes to town--and inspires her to make a most daring move. . .It's no secret that rugged, roughhewn Scotsman, Ballard MacGregor is ready to marry. Nonetheless, he is surprised by genteel Clover's sudden proposal. . .and more than pleased. For the lass's sweet innocence is bewitching. But settlement life proves harsh on his refined young wife. And Ballard fears that unless he can awaken her passion and win her love--as she has won his--he may lose his Kentucky bride. . .\"The superbly talented Howell never disappoints.\" --Romantic Times",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "One-dish meals (Cooking with Bon appetit)",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "Knapp Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "This Loving Land",
        "Authors": "By Garlock, Dorothy",
        "Description": "After the death of their mother Summer Kuykendall and her brother travel to Texas to live under the protection of Sam McLean, a family friend. They arrive to find that Sam has been killed, but his son Slater will honour his father's promise.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "My First Encyclopedia",
        "Authors": "By Watson, Carol",
        "Description": "This entertaining picture information book is designed to help children satisfy their growing curiosity about the world around them. My First Encyclopedia is arranged in themes that move from the familiar environment of a child's everyday life to an exploration of the wider world. Learning is fun as lively artwork and full-color photographs combine with clear, simple language to answer the questions that young children ask. Educational and informative, My First Encyclopedia prepares children for the first years of school and encourages independent reading. Developed in consultation with language specialists, an alphabetical index is also included for easy reference.",
        "Category": " Juvenile Nonfiction , Reference , Encyclopedias",
        "Publisher": "DK Children",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Walt Disney Productions presents the Rescuers in Trouble in Devil's Bayou (Disney's wonderful world of reading)",
        "Authors": "By Disney, Walt",
        "Description": "Two villains looking for buried pirate treasure upset the lives of some swamp creatures.",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Pete's Dragon (Disney's Wonderful World of Reading)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Random House, New York",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Nell's Cowboy (Heart of Texas, No. 5)",
        "Authors": "By Macomber, Debbie",
        "Description": "Nell Bishop, the widowed mother of two children and owner of the Twin Canyons dude ranch, houses Travis Grant, an Eastern wannabe cowboy, who seems intent on stirring up the town--by revealing the mysteries of its past. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Wildlife in Danger",
        "Authors": "By Krutch, Joseph Wood",
        "Description": "",
        "Category": "",
        "Publisher": "Viking",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Cook's Illustrated 2006",
        "Authors": "By",
        "Description": "Perfect for long-term reference, this hardback edition contains all six issues of Cook's Illustrated Magazine from 2006.",
        "Category": " Cooking , Reference",
        "Publisher": "America\u0092s Test Kitchen",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Behind the Headlines With Bill Henry",
        "Authors": "By Patricia Yeomans",
        "Description": "",
        "Category": "",
        "Publisher": "Ward Ritchie Press",
        "Price Starting With ($)": "15.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Third Force: The Rise of Transnational Civil Society",
        "Authors": "By Nihon Kokusai Koryu Senta (COR), Florini, Ann (EDT), and Carnegie Endowment for International Peace (COR)",
        "Description": "From the landmines campaign to the Seattle protests against the WTO to the World Commission on Dams, transnational networks of civil society groups are seizing an ever-greater voice in how governments run countries and how corporations do business. This volume brings together a multinational group of authors to help policy makers, scholars, business people, and activists themselves understand the profound issues raised.Contributors include Fredrik Galtung, Rebecca Johnson, Sanjeev Khagram, Chetan Kumar, Motoko Mekata, Thomas Risse, P.J. Simmons, and Yahya Dehqanzada.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Carnegie Endowment for Int'l Peace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Hoodwinked Bride (Silhouette: A Fortune's Children: Wedding)",
        "Authors": "By Boswell, Barbara",
        "Description": "Beautiful, headstrong Angelica Carroll returns to the Fortune estate to blackmail the wealthy family, but when the Fortunes hire private investigator Flynt Corrigan, he mysteriously marries the heiress. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The Private Dining Room",
        "Authors": "By Nash, Ogden",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Who Said That? (Dial-a-picture)",
        "Authors": "By Smith, Kathryn",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore Inc. Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Little Book of Great Lines from Shakespeare",
        "Authors": "By Shakespeare, William",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes Noble Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Ultimate Round: 18 Life Lessons from the World's Greatest Golfers",
        "Authors": "By Glaspey, Terry, Dyke, Larry (ILT), and Dyke, Larry",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Grace After Midnight: A Memoir",
        "Authors": "By Ritz, David and Pearson, Felicia",
        "Description": "While Felicia is a brilliant actor in a truly chilling role in The Wire, what's most remarkable about \"Snoop\" is what she has overcome in her life. Snoop was born a three-pound cross-eyed crack baby in East Baltimore. Those streets are among the toughest in the world, but Snoop was tougher. The runt of the ghetto showed an early aptitude for drug slinging and violence and thrived as a baby gangsta until she landed in prison after killing a woman in self-defense. There she rebelled violently against the system, and it was only through the intervention of her mentor that she turned her life around. Snoop was discovered in a nightclub and quickly recruited to be one of television's most frightening and intriguing villians. Snoop's is the story of a woman who defied traditional conventions on the hardest streets in America.--From publisher description.in the world, but Snoop was tougher. The runt of the ghetto showed an early aptitude for drug slinging and violence and thrived as a baby gangsta until she landed in prison after killing a woman in self-defense. There she rebelled violently against the system, and it was only through the intervention of her mentor that she turned her life around. Snoop was discovered in a nightclub and quickly recruited to be one of television's most frightening and intriguing villians. Snoop's is the story of a woman who defied traditional conventions on the hardest streets in America.--From publisher description.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Cabins and Cottages",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Covers every step in the creation of a vacation home, presenting illustrated instructions for building a contemporary version of a pioneer's rugged log cabin, putting up a modern A-frame structure complete with a deck and a sleeping loft, and assembling a prefabricated cottage",
        "Category": " Technology & Engineering , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "The Incredible Journey Through the World of the Dinosaurs: Take a Trip Through Time Millions of Years Ago!",
        "Authors": "By Harris, Nicholas",
        "Description": "",
        "Category": "",
        "Publisher": "Orpheus Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    }
]