[
    {
        "Title": "Lucy's Bones, Sacred Stones, & Einstein's Brain: The Remarkable Stories Behind the Great Objects and Artifacts of History, from Antiquity to the Modern Era (Henry Holt Reference Book)",
        "Authors": "By Rachlin, Harvey",
        "Description": "Imagine what it might be like to sit in the cockpit of the Wright brothers' airplane, to see light flashing brilliantly through the Hope Diamond, or to turn the pages of Anne Frank's heartbreaking diary. History has bequeathed to us a multitude of marvelous artifacts, and locked inside each one is a piece of the endless story of our civilization.Raconteur Harvey Rachlin uses these intriguing objects to bring history alive. He spins compelling tales, telling us not only about the roles these objects played but also about the people who possessed them or were affected by them, and how the artifacts were handed down through the ages. He begins in antiquity, with the story of the Black Stone of the Ka'bah, the symbolic core of Islam, and moves through time, to the rifle that was used to shoot President Kennedy. He reveals startling new details about familiar artifacts such as the bones of the hominid Lucy and George Washington's false teeth. He introduces us to obscure curiosities, like the Blood of Saint Januarius, which mysteriously liquefies on certain days of the year. And Rachlin explains how the everyday articles that Teddy Roosevelt carried in his pocket miraculously saved his life. Learn where each object currently resides, including how London Bridge found its way to Arizona, or what ultimately happened to the bones of John Merrick, the \"Elephant Man.\"",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Love Me",
        "Authors": "By Keillor, Garrison",
        "Description": "The enterprising Larry Wyler, settled in St. Paul with his beloved Iris, an earnest Democrat out to save the world, sits upstairs and writes stories and lands one in The New Yorker, the Canaanland of all English majors. While Iris devotes herself to rescuing demented geezers and chemically dependent single moms, he sets his sights on literary prominence.When his first novel, Spacious Skies, becomes a hit, he leaves Iris behind and buys a Manhattan apartment with a fabulous terrace and moves into an office at The New Yorker among Salinger, Trillin, Updike, Powers - writers he admires - and the great editor William Shawn.Wyler and Shawn become pals, sailing around New York Harbor on the Shawnee, drinking man-size martinis, but Wyler's followup novel, Amber Waves of Grain, bombs badly. (\"Why did I write so much about soybeans in the first chapter?\" he wonders.) And then comes a long spell of writer's block. Wyler despairs until out of nowhere comes an invitation to write a newspaper advice column, \"Ask Mr. Blue\" - a low rung on the literary ladder, but writing commonsense advice to the lonely and the frustrated provides a much-needed distraction and initiates Larry's own long recovery. As he doles out wisdom to Exasperated, whose wife gives up her judgeship for figure skating, and Nice Lady, who is abusive to the obese, and Secular Humanist, who suddenly notices his girlfriend is Amish, Wyler slowly, painfully finds a measure of clarity for his own life. He confronts the evil New Yorker publisher Tony Crossandotti and sets out to win back his wife's affections.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Too Much of a Good Thing: Raising Children of Character in an Indulgent Age",
        "Authors": "By Kindlon, Daniel J.",
        "Description": "A thought-provoking guide is filled with a wealth of information for raising well-balanced children in an age of increasing wealth, where we give too much and expect too little, by identifying the \"Seven Sins of Indulgence\"--Disrespectfulness, Goal-lessness, Narcissism, Naivete, Amorality, Inability to Tolerate Boredom, and Underachievement. Reprint. 40,000 first printing.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Miramax",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Cooking Light Cookbook 1989",
        "Authors": "By Leisure Arts, Oxmoor House",
        "Description": "Addressing the concerns of people who want to eat well while remaining slim, these more than 450 recipes produce foods that are light in fat, sodium, and processed sugar, yet are filling and flavorful",
        "Category": " Cooking , Reference",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Cloak and Dollar: The History of American Secret Intelligence",
        "Authors": "By Jeffreys-Jones, Rhodri",
        "Description": "Rhodri Jeffreys-Jones, a leading expert on the history of American espionage, here offers a lively and sweeping history of American secret intelligence from the founding of the nation through the present day. Jeffreys-Jones chronicles the extraordinary expansion of American secret intelligence from the 1790s, when George Washington set aside a discretionary fund for covert operations, to the beginning of the twenty-first century, when United States intelligence expenditure exceeds Russia’s total defense budget.How did the American intelligence system evolve into such an enormous and costly bureaucracy? Jeffreys-Jones argues that hyperbolic claims and the impulse toward self-promotion have beset American intelligence organizations almost from the outset. Allan Pinkerton, whose nineteenth-century detective agency was the forerunner of modern intelligence bureaus, invented assassination plots and fomented anti-radical fears in order to demonstrate his own usefulness. Subsequent spymasters likewise invented or exaggerated a succession of menaces ranging from white slavery to Soviet espionage to digital encryption in order to build their intelligence agencies and, later, to defend their ever-expanding budgets. While American intelligence agencies have achieved some notable successes, Jeffreys-Jones argues, the intelligence community as a whole has suffered from a dangerous distortion of mission. By exaggerating threats such as Communist infiltration and Chinese espionage at the expense of other, more intractable problems—such as the narcotics trade and the danger of terrorist attack—intelligence agencies have misdirected resources and undermined their own objectivity.Since the end of the Cold War, the aims of American secret intelligence have been unclear. Recent events have raised serious questions about effectiveness of foreign intelligence, and yet the CIA and other intelligence agencies are poised for even greater expansion under the current administration. Offering a lucid assessment of the origins and evolution of American secret intelligence, Jeffreys-Jones asks us to think also about the future direction of our intelligence agencies.",
        "Category": " History , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Pearl Harbor",
        "Authors": "By Willmott, H. P., Haruo, Tohmatsu, and Johnson, W. Spencer",
        "Description": "\"A date which will live in infamy\"--President Delano Roosevelt, December 7, 1941. Perfectly coinciding with the release of this splendid volume on Memorial Day 2001, Disney will release its high-profile, big-budget, and star-powered film, Pearl Harbor. The excitement will leave viewers craving a closer look at the real event--and this eye-popping, large-size, and image-packed book will keep readers fascinated long after the movie has left the screen. Directed by visual master Michael Bay (The Rock, Armageddon), produced by Jerry Bruckheimer (who not only masterminded Bay's hits, but also Flashdance, Top Gun, Days of Thunder, Crimson Tide, among others), and with a cast that includes Oscar(r) winners Ben Affleck and Cuba Gooding, the film is sure to dominate the news and to pique curiosity about the subject.It was the battle that would change the course of history. 2,395 military and civilian personnel killed. Another 1,178 wounded. 21 ships sunk, beached, or damaged. 323 aircraft destroyed. It wasn't yet eight in the morning on the island of Oahu when Japan's Commander Fuchida radioed these code words to the Land of the Rising Sun's navy: TORA, TORA, TORA. The Japanese surprise attack on the United States had succeeded; Pearl Harbor was burning. Through bold and striking images previously unseen outside of Japan, and an authoritative, thoroughly up-to-date text, you'll look back at the shocking event. Enhancing your experience further are the standout--and very special--maps and graphics by Malcolm Swanston (expert cartographer of the History of Warfare series). Starting long before the assault and continuing through to the dramatic aftermath, H.P. Willmott, a brilliant and experienced writer on the topic, breaks new ground and corrects long-held misconceptions. First he brings the background into clear focus, charting Japan's emergence as a power in the Far East, and the military involvement in Manchuria and China that put her on a collision course with the U.S. Above all, Willmott makes sense of the complex, often surreal process that led the Japanese High Command to consider an attack on Pearl Harbor the preferred strategy. The text about the strike itself draws on extensive, deeply compelling new research. Highlights include concise tables listing every warship involved in the operation--from aircraft carriers to midget submarines--along with every formation of aircraft, which carriers they flew from, and which targets they hit. Most controversial: a discussion of crucial evidence that explains why a third-and potentially-devastating strike on the American base never occurred. Finally, you'll see why this fateful day may have been not only the day that Japan started the war...but also the day she lost it. Arguing strongly that the act of violence served as the prelude to her defeat, Willmott places Pearl Harbor in its proper military context, and considers subsequent developments in the Pacific, particularly the Battles of the Coral Sea and Midway in 1942, as well as the Doolittle Raid by American bombers on Tokyo in April of the same year.",
        "Category": " History , Military , Pictorial",
        "Publisher": "Cassell",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "You Are My Sunshine",
        "Authors": "By Hobbie, Holly",
        "Description": "It's a glorious day in Woodcock Pocket. The sun is shining, the birds are singing . . . and Toot is moping. So, Puddle makes Toot's favorite dessert at dinnertime, takes him out for a little adventure, and even throws a party, but nothing seems to cheer up his friend. Then a big thunderstorm with lots of mud rocks Woodcock Pocket and changes everything. With light-hearted humor and exquisitely detailed watercolor paintings, Holly Hobbie tells the story of two pigs and their enduring friendship.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Clumsiest People in Europe: Or, Mrs. Mortimer's Bad-Tempered Guide to the Victorian World",
        "Authors": "By Pruzan, Todd and Mortimer, Favell Lee",
        "Description": "A caustic, cranky, and inadvertently hilarious look at foreign countries and their customs by a Victorian woman who rarely left the house.No matter who your ancestors were, and where they had the misfortune of living, Victorian children's book writer Mrs. Favell Lee Mortimer had something nasty to say about them. Their faults, according to Mrs. Mortimer, might have amounted to just about anything. The Irish \"are very kind and good-natured when pleased, but if affronted, are filled with rage.\" In Italy, \"the people are ignorant and wicked.\" In Sweden, \"Nothing useful is well done...The carpenters and the blacksmiths are very clumsy in their work.\"Remarkably, all of these assertions come from a woman who only twice set foot outside of her native England. But lack of personal experience never kept Mrs. Mortimer from dispensing her horrifying wisdom about the evils of just about every nation on earth. Whether describing Europe (\"It is dreadful to think what a number of murders are committed in Italy\"), Asia (\"The religion of Taou teaches men to act like madmen\"), Africa (\"The worst quality in any character is hypocrisy, and this is to be found in the Egyptian\"), or America (\"New Orleans is a dangerous place to live in, both for the body and the soul\"), Mrs. Mortimer's views are consistently appalling. One hundred fifty years later, three of her forgotten classics have been compiled into one volume, The Clumsiest People in Europe, reviving the comically misinformed and startling prejudices of this unique Victorian eccentric.",
        "Category": " Humor , General",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Oracle Betrayed: Book One of The Oracle Prophecies",
        "Authors": "By Fisher, Catherine",
        "Description": "They might not know what the future holds,but they know they hold it in their hands.Mirany, the newly appointed attendant to the Speaker, is untested, in fear for her life, and keeper of the god's secrets. Seth, an ambitious scribe toiling in the shadow of the pyramid, has discovered the secret labyrinths and underground passages to the tombs.Hermia, the Speaker, interprets the words of the god and twists his wishes to suit her treachery.General Argelin, the cunning leader in league with the Speaker, intends to dictate the choosing of the new ruler Alexos, the quiet boy, is fated to rule the land -- unless his enemies succeed in their plot.Oblek, the foolish musician, may be the only person who can keep Alexos alive.The Jackal, the black-market tomb raider, will strike like a scorpion if anyone interferes with his scheme to rob the sacred catacombs",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Dave Matthews Band: Music for the People",
        "Authors": "By Pocket Books",
        "Description": "Their albums enter the charts at #1. Fans follow them around the country, soaking up the incredible energy of their sold-out live concerts. From gigging at an Earth Day celebration and more frat parties than anyone can remember, Dave Matthews and his phenomenal band have electrified rock 'n' roll America. Now a music industry insider takes you to the heart of the Dave Matthews Band -- their meteoric rise to superstardom and the most extensive listing ever published of their tours and smash recordings, including the bootlegs that the band encourages.  Charlottesville, Virginia, 1991: Dave Matthews meets and jams with drummer Carter Beauford, bassist Stefan Lessard, saxophonist Leroi Moore, and violinist Boyd Tinsley. The band tours extensively for the next two years and puts out the self-released live album, Remember Two Things. Their enthusiastic grass-roots following in the Southeast and groove-ridden jams earn them a major label deal with RCA Records and the release of Under the Table and Dreaming, giving fans two smash hits and garnering a pair of Grammy nominations. But it is the heartfelt ballad \"Crash Into Me\" from their third album, Crash, that vaults them into the alternative-rock mainstream. Superb critical acclaim for their fourth bestselling set, Before These Crowded Streets, lands Dave on the cover of Spin, dubbed \"the King of Rock.\"  Through interviews with close associates, collaborators, tour mates, and friends, along with a complete discography and \"gigography\" (the definitive list of all the band's phenomenal live shows), this book takes you inside the Dave Matthews universe. This multiracial quintet's unique mix of jazz, blue-eyed funk, world rhythms, and sensitive lyricism speaks to people across generations.",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Nuremberg: The Reckoning",
        "Authors": "By Buckley, William F.",
        "Description": "Nuremberg's Palace of Justice, 1945:the scene of a trial without precedent in history, a trial that continues to haunt the modern world. Leading the reader into the Palace is Sebastian, a young German-American whose fate is to be intimately involved with the lives and deaths of others: the father who disappeared mysteriously, the ancestors whose stories become vitally relevant, and some of the towering figures of twentieth-century legal history, including Justice Robert Jackson, Albert Speer, Hermann Goering, and the dark, untried shadow of Adolf Hitler. In a gripping account of warmakers who must face the consequences of their actions, Nuremberg: The Reckoning flows through Warsaw, Berlin, Lodz, Munich, Hamburg, and finally Nuremberg, as Sebastian, an interpreter-interrogator, comes to terms with his family legacy and his national identity. With his customary authority and audacity, William F. Buckley Jr. has taken a pivotal moment in history and shaped it into absorbing and original fiction. The result is a riveting novel of insight and deep understanding exploring the characters and issues that made history.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Quotable Women: A Celebration (Introducing Courage Gift Editions)",
        "Authors": "By Jay, Molly (EDT)",
        "Description": "From the irreverent to the inspirational, Quotable Women is a lively sampling of wit and wisdom from some of the world’s most eloquent female minds. This treasure trove of inspirational quotations by and for women-from such influential sources as Georgia O’Keeffe, Alice Walker, and Helen Keller-is accompanied by 46 full-color reproductions of fine art paintings also by women.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Parrot Pie for Breakfast: An Anthology of Women Pioneers",
        "Authors": "By Robinson, Jane (EDT)",
        "Description": "There is nothing quite like parrot pie for breakfast. First one must catch one's parrot, of course, and build the hearth to bake it, but that is all in a day's work for the woman pioneer. This riveting anthology tells the story of over 100 such women spanning the age of Empire from the early seventeenth century to the early twentieth. Almost half of them are settlers in North America and Canada, a quarter in Africa, many in Australasia and India, and the rest scattered around the globe from Egypt to Jamaica, Sarawak to Samoa, and many points inbetween.  From the lowliest kitchen skivvy to ambassadors' wives, this book celebrates the emigrants who settled the wildernesses of the world in search of new and better lives. Many were lured abroad by the promise of work or fortune; some went because imperial duty called, while for others it was a most unfeminine lust for adventure that drew them away. But all faced challenges in their homes from home that were to test to the limit their spirits, their resourcefulness, even their survival.",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Bibliotherapy: The Girl's Guide to Books for Every Phase of Our Lives",
        "Authors": "By West, Beverly and Peske, Nancy",
        "Description": "Because women read books differently than guys do...Every woman knows ... books are more than a way to kill time on the bus — they're therapy that fits in our bag. Whether we're wallowing in a sullen perennial adolescence or our biological clock is ringing and we can't find the snooze button, books are the dog-eared friends that help us deal with our baggage as we navigate life's journey. Now Bibliotherapy prescribes the best of classic and contemporary Chick Lit that women turn to again and again — for inspiration (A Tree Grows in Brooklyn) ... for escape (Ladder of Years) ... for revenge against the patriarchy (Our Blood) ... and for bonding with our girlfriends (Waiting to Exhale). Upper-thigh spread sparking a midlife crisis? Read A Lady's Life in the Rocky Mountains and remember that it's not over until the fat lady yodels. Did your pot of gold turn out to be fourteen-karat tin? Open your eyes with Awakening to the Sacred and learn to savor your rainbow.  Wondering what all the fuss is about?  Climb into bed with Lady Chatterley's Lover and explore your pleasure potential.With provocative points to ponder as you read (\"What is the metaphorical significance of a codpiece?\"), fun quotes, and a list of books that must not be read but, in Dorothy Parker's words, \"thrown with great force,\" Bibliotherapy ensures you'll always find the right literary prescription — no matter what phase of life you're teetering on the brink of! Plus: Doomed but Inspired Heroes ... Books to Read When You're Sick of Your Career and Are Seriously Considering Taking Up Alpaca Ranching in Peru ... Bad Girls We'd Like to Have Over for Girls' Night ... Books That Are the Equivalent of Citronella for Men ... and much more!",
        "Category": " Reference , Bibliographies & Indexes",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Banking on Baghdad: Inside Iraq's 7,000-Year History of War, Profit, and Conflict",
        "Authors": "By Black, Edwin",
        "Description": "New York Times and international bestselling author Edwin Black uncovers Iraq's hidden economy and the companies that profit from its upheaval  Big business and global warfare have long been fiery and symbiotic forces in Iraq. Banking on Baghdad tells the dramatic and tragic history of a land long the center of world commerce-and documents the many ways Iraq's recent history mirrors its tumultuous past. Tracing the involvement  of Western governments and militaries, as well as oil, banking, and other corporate interests in Iraq, Black shows that today, just as yesterday, the world needs Iraq's resources-and is always willing to fight and invade in order to acquire and protect them.  While demonstrating that Iraq itself is partially to blame for its current state of turmoil, Black does not shy away from the uncomfortable truth that war and profit have also played an equal part in creating the Iraq we know today. Just as he did in IBM and the Holocaust, Black exposes the hidden associations between leading corporations, war, and oil-such as the astonishing connections between Nazi Germany, Iraq, and the Holocaust.  He exposes the war and race-based profiteering by some of the world's most prestigious corporations, as well as the political and economic ties between the Bush administration and the companies that gain handsomely from its foreign policy. Just as he did in War Against the Weak, Black offers a compelling blend of history and contemporary investigative journalism that spans a century and eschews easy answers for complicated questions.  Edwin Black (Washington, DC) is the award-winning New York Times bestselling author of IBM and the Holocaust, The Transfer Agreement, and War Against the Weak. His journalism has appeared in the Washington Post, The Village Voice, The Sunday Times (of London), and The Los Angeles Times.",
        "Category": " Business & Economics , Banks & Banking",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "19.46",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Writers",
        "Authors": "By Soames, Sally (PHT)",
        "Description": "Our favorite authors. We read their words, we know their characters, but most every reader has wondered about the people behind the books - the faces behind the stories. Writers is a compelling collection of 73 photographs of some of the world's most gifted authors. For over twenty-five years, acclaimed photographer Sally Soames of London's Sunday Times has eloquently recorded the faces of novelists, poets, essayists, and playwrights. Using only natural light, she displays a rare skill, revealing in her subjects something of their \"ability to create, influence, teach, weave magic.\" In capturing the light in their eyes, she captures, too, the light that illuminates their words.To accompany their portraits, the writers pictured here have selected words - either their own or those of authors they admire - which intensify the visual image and give us a new understanding of the works that have made them so beloved.",
        "Category": " Photography , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "According to the Rolling Stones",
        "Authors": "By Wood, Ron, Richards, Keith, Jagger, Mick (EDT), Watts, Charlie (EDT), Loewenstein, Dora (EDT), and Dodd, Philip (EDT)",
        "Description": "Members of the legendary band--Mick Jagger, Keith Richards, Charlie Watts, and Ronnie Wood--offer an inside chronicle of their storied careers as musicians, songwriters, performers, and colleagues, discussing the evolution of their music and their own turbulent lives, in a volume complemented by a comprehensive discography, chronology, personal commentary, and more than three hundred rare and intimate photographs. 250,000 first printing.",
        "Category": " Music , Genres & Styles , Rock",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "High Technology and Low-Income Communities: Prospects for the Positive Use of Advanced Information Technology",
        "Authors": "By Mitchell, William J. (EDT), Schon, Donald A. (EDT), and Sanyal, Bishwapriya (EDT)",
        "Description": "How will low-income communities be affected by the waves of social, economic, political, and cultural change that surround the new information technologies? How can we influence the outcome? This action-oriented book identifies the key issues, explores the evidence, and suggests some answers. Avoiding both utopianism and despair, the book presents the voices of technology enthusiasts and skeptics, as well as social activists. The book is organized into three parts. Part I examines the issues in their socio-technical, economic, and historical contexts. Part II—the core of the book—proposes five initiatives for using computers and electronic communications to benefit low-income urban communities:- to provide access to the new technologies in ways that enable low-income people to become active producers rather than passive users;- to use the new technologies to improve the dialogue between public agencies and low-income neighborhoods;- to help low-income youth to exploit the entrepreneurial potential of information technologies;- to develop approaches to education that take advantage of the educational capabilities of the computer;- to promote the community computer: applications of computers and communications technology that foster community development. Part III presents a synthesis of the various topics. Its main questions are, What are the prospects and problems of initiatives to enable the poor to benefit from the new technologies? and What federal, state, and municipal policies would enhance the prospects for success?ContributorsAlice Amsden, Jeanne Bamberger, Anne Beamish, Manuel Castells, Joseph Ferreira, Peter Hall, Leo Marx, William J. Mitchell, Mitchel Resnick, Bish Sanyal, Donald A. Schön, Alan and Michelle Shaw, Michael Shiffer, Bruno Tardieu, Sherry Turkle, Julian Wolpert",
        "Category": " Social Science , Sociology , General",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Quilt Style",
        "Authors": "By Fazely, Lucy A.",
        "Description": "The tradition of American quilting stretches back for centuries and is as popular today as it was when quilts were stitched purely from necessity. This gorgeous exploration of American quilts, offered at an extraordinary value, is illustrated with many antique and contemporary examples. It features such classic patchwork patterns as tumbling blocks, stars, and Irish chain, plus all basic applique techniques and themes.",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Birth of Venus",
        "Authors": "By Dunant, Sarah",
        "Description": "Alessandra Cecchi is not quite fifteen when her father, a prosperous cloth merchant, brings a young painter back from northern Europe to decorate the chapel walls in the family’s Florentine palazzo. A child of the Renaissance, with a precocious mind and a talent for drawing, Alessandra is intoxicated by the painter’s abilities.But their burgeoning relationship is interrupted when Alessandra’s parents arrange her marriage to a wealthy, much older man. Meanwhile, Florence is changing, increasingly subject to the growing suppression imposed by the fundamentalist monk Savonarola, who is seizing religious and political control. Alessandra and her native city are caught between the Medici state, with its love of luxury, learning, and dazzling art, and the hellfire preaching and increasing violence of Savonarola’s reactionary followers. Played out against this turbulent backdrop, Alessandra’s married life is a misery, except for the surprising freedom it allows her to pursue her powerful attraction to the young painter and his art.The Birth of Venus is a tour de force, the first historical novel from one of Britain’s most innovative writers of literary suspense. It brings alive the history of Florence at its most dramatic period, telling a compulsively absorbing story of love, art, religion, and power through the passionate voice of Alessandra, a heroine with the same vibrancy of spirit as her beloved city.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Nika Hazelton's Pasta Cookbook",
        "Authors": "By Hazelton, Nika",
        "Description": "A mouth-watering selection of recipes for all occasions Nika Hazelton’s Pasta Cookbook contains more than a hundred recipes from a first lady of the culinary world. Here is a tantalizing selection of pasta recipes—from home-style Italian specialties and hearty soups to casseroles and elegant summer salads. Perfect pastas, sensational sauces: • Spicy Peanut Noodle Salad • Pasta with Vodka, Cream, and Tomato Sauce • Egg Noodles with Smoked Salmon • Linguine with White Clam Sauce • Tortellini with Cream • Spaghetti Carbonara • Pasta Salad with Smoked Chicken • Easy Green Pasta with Cream, Pine Nuts, and Basil • Ratatouille Lasagne and many, many more!Whether you buy pasta or make your own with these instructions, Nika Hazelton’s Pasta Cookbook is practical, simple, and wonderful.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Random House Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "Ugly Americans: The True Story of the Ivy League Cowboys Who Raided the Asian Markets for Millions",
        "Authors": "By Mezrich, Ben",
        "Description": "Ben Mezrich, author of the New York Times bestseller Bringing Down the House, returns with an astonishing story of Ivy League hedge-fund cowboys, high stakes, and the Asian underworld.John Malcolm was the ultimate gunslinger in the Wild East, prepared to take on any level of risk in making mind-boggling sums of money. He and his friends were hedge-fund cowboys, living life on the adrenaline-, sex-, and drugs-fueled edge—kids running billion-dollar portfolios, trading information in the back rooms of high-class brothels and at VIP tables in nightclubs across the Far East.Malcolm and his Ivy League-schooled twenty-something colleagues, with their warped sense of morality, created their own economic theory that would culminate in a single deal the likes of which had never been seen before—or since.Ugly Americans is a story of extremes, charged with wealth, nerve, excess, and glamour. A real-life mixture of Liar's Poker and Wall Street, brimming with intense action, romance, underground sex, vivid locales, and exotic characters, Ugly Americans is the untold true story that rocked the financial community.",
        "Category": " Business & Economics , Finance , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "All That Matters: A Novel",
        "Authors": "By Goldstein, Jan",
        "Description": "What's the greatest gift that one person can give another?Jan Goldstein's stunning debut novel, All That Matters, is a deeply moving, endearing tale of a young woman who, with the help of her feisty grandmother, makes a journey from the very brink of death and despair into a full embrace of life.Jennifer Stempler has nothing left to lose: the love of her life dumped her, her mother died in a senseless car accident five years ago, and her famous Hollywood producer father started a brand-new family--with no room in it for her. So, 23-year-old Jennifer decides to pursue peaceful (permanent) oblivion on the beach near her home in Venice, California, drifting on a lethal combination of Xanax and tequila. But she can't even get that right.Jennifer's depression is no match for her Nana's determination. Gabby Zuckerman refuses to let her granddaughter self-destruct. With promises made to Jennifer's father and doctors, Gabby whisks Jennifer back to her home in New York City, intending to prove to Jennifer that her life cannot possibly be over yet. In fact, it has just begun. Through jaunts in Central Park to road trips to Maine, Gabby teaches Jennifer how to trust and hope again. And by relating her own tragic and heroic experience during the Nazi occupation of Poland, Gabby bestows upon Jennifer an understanding of her own life's value. But when Gabby reveals a secret--one that proves to be Jennifer's toughest challenge yet--Jennifer struggles to find out whether the gift will sustain her.Combining the unabashedly heart-warming sentiment of Robert James Waller's The Bridges of Madison County or Nicholas Sparks's Message in a Bottle with the irreverent humor of Jennifer Weiner's In Her Shoes, Goldstein's All That Matters is an inspirational first novel that leads readers to the core of what matters in life--family, hope, and savoring each moment.",
        "Category": " Fiction , Women",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Broken Lives : Personal View of the Bosnian Conflict",
        "Authors": "By STEWART, Lieutenant-Colonel Bob.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper-Collins",
        "Price Starting With ($)": "5.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Tips and Techniques for Builders (Fine Homebuilding)",
        "Authors": "By Miller, Charles (EDT)",
        "Description": "No building job, whether new construction, renovation or remodeling, always goes exactly as planned, so builders learn to improvise solutions. And they often share what they learn in FINE HOMEBUILDING magazine. Here is a collection of such tested and proven tips and advice straight from the pages of the magazine.",
        "Category": " Technology & Engineering , Construction , General",
        "Publisher": "The Taunton Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Truth (with jokes)",
        "Authors": "By Franken, Al",
        "Description": "The #1 New York Times bestseller by Senator Al Franken, author of Giant of the SenateSenator Al Franken’s landmark bestseller, Lies (And the Lying Liars Who Tell Them): A Fair and Balanced Look at the Right, was praised as a “bitterly funny assault” (The New York Times) that rang “with the moral clarity of an angel’s trumpet” (The Associated Press). Now, this master of political humor strikes again with a powerful and provocative message for all of us.In these pages, Senator Franken reveals the alarming story of how:   • Bush (barely) beat Kerry with his campaign of “fear, smear, and queers,” and then claimed a nonexistent mandate.   • “Casino Jack” Abramoff, the Republicans’ nearest and dearest friend, made millions of dollars off of the unspeakable misery of the poor and the powerless. And, also, Native Americans.   • The administration successfully implemented its strategy to destroy America’s credibility and goodwill around the world.Complete with new material for this paperback edition, The Truth (with jokes) is more than just entertaining, intelligent, and insightful. It is at once prescient in its analysis of right-wing mendacity and incompetence, and inspiring in its vision of a better tomorrow for all Americans (except Jack Abramoff).",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Under a War-Torn Sky",
        "Authors": "By Elliott, Laura",
        "Description": "When Henry Forester is shot down during a bombing run over France,the World War II pilot finds himself trapped behind enemy lines. In constant danger of discovery by German soldiers, Henry begins a remarkable journey to freedom. Relying on the kindness of strangers, Henry moves from town to town--traveling by moonlight, never asking questions, or even the names of the people who help him along the way. Each day brings him closer to home, yet every step in enemy territory invites new dangers.Even as Henry fights for his own life, he quickly grows to realize the peril that surrounds all of the French people, and to admire the courage of the freedom fighters who risk death to protect him. Suspenseful and achingly true, this critically-acclaimed and deeply beloved novel explores the heartbreak of war, the strength of human spirit, and one young man's struggle to protect the things he loves",
        "Category": " Young Adult Fiction , Historical , Military & Wars",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Gospel Code: Novel Claims About Jesus, Mary Magdalene and Da Vinci",
        "Authors": "By Witherington, Ben, III",
        "Description": "Dan Brown's international bestseller The Da Vinci Code has raised many questions in the minds of readers. Was Jesus really married to Mary Magdalene?Did he father a child with her? Did Constantine suppress the earliest Gospels and invent the doctrine of Christ's divinity? Do the Gnostic Gospels represent the true Christian faith which the early church sought to supplant?The Da Vinci Code, in blurring the lines between fact and fiction, popularizes the speculations and contentions of numerous more serious books that are also attracting wide attention. How should we respond to claims that we now have documents that reveal secrets about Jesus, secrets long suppressed by the church and other religious institutions? Do these new documents successfully debunk traditional views about Jesus and early Christianity? Ben Witherington III confronts these claims with the sure-footedness of a New Testament scholar, yet in the plain language that any interested reader can follow. He takes us back to the early centuries after Jesus' death and tells us what we can really know about Jesus, Mary Magdalene, the canonical Gospels and their Gnostic rivals.",
        "Category": " Religion , Biblical Criticism & Interpretation , New Testament",
        "Publisher": "IVP Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Setting the Record Straight: Responses to Misconceptions About Public Education in the United States",
        "Authors": "By Bracey, Gerald W.",
        "Description": "In this second and substantially updated edition of Setting the Record Straight, Bracey goes toe-to-toe with the opponents of quality public education. You'll learn how to discredit them in your own discussions by using the very logic and statistical analyses they purport to have on their side.In this series of analyses, Bracey homes in on specific topics like vouchers, school funding, and comparisons to international test scores, themes around which agitators have created a host of mythological American school failures from the flimsiest of evidence. In fact, each essay begins with a question you might commonly hear in conversation about these alleged shortcomings, to which Bracey provides a brief, sound-byte-ready rebuttal. Then he follows it up with a full-length explanation, replete with statistical data and talking points that fully support his assertions - and silence those who would undermine education with disinformation.",
        "Category": " Education , Leadership",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "The Big Bad Wolf",
        "Authors": "By Patterson, James",
        "Description": "Alex Cross battles the most ruthless and powerful killer he has ever encountered - a predator known only as the Wolf.Alex Cross's first case since joining the FBI has his new colleagues stymied. Across the country, men and women are being kidnapped in broad daylight and then disappearing completely. These people are not being taken for ransom, Alex realizes. They are being bought and sold. And it looks as if a shadowy figure called the Wolf - a master criminal who has brought a new reign of terror to organize crime - is behind this business in which ordinary men and women are sold as slaves.Even as he admires the FBI's vast resources, Alex grows impatient with the Bureau's clumsiness and caution when it is time to move. A lone wolf himself, he has to go out on his own in order to track the Wolf and try to rescue some of the victims while they are still alive.As the case boils over, Alex is in hot water at home too. His ex-fiancee, Christine Johnson, comes back into his life - and not for the reasons Alex might have hoped.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Con Man's Daughter",
        "Authors": "By Dee, Ed",
        "Description": "Eddie Dunne's hands are swollen from fighting, his cell phone rings to the tune of \"When Irish Eyes Are Smiling,\" and his spending money is in a metal box above his bathroom ceiling. Banished from the NYPD and retired from his job with the Russian mob, Eddie plays the ponies and baby-sits his six-year-old grandchild. Then, in the blink of an eye, his life is invaded when someone kidnaps his thirty-five-year-old daughter. Now he must risk everything to get her back.Eddie knows Kate has been taken for something he's done. He knows the Russians are involved, and he knows where they live, how they work, and where their bodies are buried. But the cops and Feds will give Eddie more trouble than help, his tangled loyalties will cancel out, and the danger he faces is one he must attack head-on with his own two hands. Because for almost twenty years Eddie and his former NYPD partner cut a swath of law and disorder through New York, hopping back and forth from both sides of the law amid thievery, extortion, and violence on a scale ordinary citizens could never comprehend. Now he has to find out which of his misdeeds will lead him to his daughter - or to his death.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Tarnished Eye",
        "Authors": "By Guest, Judith",
        "Description": "From the New York Times bestselling author of Ordinary People comes a gripping novel of suspense, exploring fragile family dynamics in the aftermath of tragedy...  Acclaimed author Judith Guest makes a triumphant return with this poignant and powerful novel that's sure to add luster to her reputation as one of the most thoughtful observers of the human condition.  Taking as part of her inspiration a baffling, unsolved true-life crime, Guest achieves in this absorbing new novel an extraordinary combination of page-turning mystery and intimate, emotionally charged family drama.  The Tarnished Eye takes readers to the community of Blessed, in northern Michigan, where Sheriff Hugh DeWitt still grieves for his infant son, who died of SIDS a few years earlier. Obsessed with the past, he's endangering his future with his beloved wife and daughter.  Meanwhile, up the road from the DeWitts, in one of the rich summer cottages, Paige Norbois grieves for a lost love of her own. Married to a stern and unresponsive man, Paige wills herself to stay in the marriage and sacrifice her personal feelings for the sake of her children's stability.  But soon an unimaginable tragedy destroys all dreams of stability in Blessed. Paige, her husband, Edward, and their four children are brutally slaughtered in their home. Sheriff DeWitt, deeply moved by the horrific murder scene, must find answers to a string of urgent questions.  When, exactly, did the murders occur? Why did nobody miss the family earlier? Who had a motive to kill? The man with whom Paige was having an affair? The business partner, who was stealing from Edward's publishing firm? Which family member was the primary, intended victim? And above all, what sort of trauma could fuel a killer's capacity to commit such hate-driven violence?  Judith Guest, with her own untarnished eye and finely nuanced prose, delivers a novel that transcends genre and showcases once again her remarkable literary gifts.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Squandered Victory: The American Occupation and the Bungled Effort to Bring Democracy to Iraq",
        "Authors": "By Diamond, Larry",
        "Description": "America's leading expert on democracy delivers the first insider's account of the U.S. occupation of Iraq-a sobering and critical assessment of  America's effort to implant democracy In the fall of 2003, Stanford professor Larry Diamond received a call from Condoleezza Rice, asking if he would spend several months in Baghdad as an adviser to the the American occupation authorities. Diamond had not been a supporter of the war in Iraq, but he felt that the task of building a viable democracy was a worthy goal now that Saddam Hussein's regime had been overthrown. He also thought he could do some good by putting his academic expertise to work in the real world. So in January 2004 he went to Iraq, and the next three months proved to be more of an education than he bargained for.Diamond found himself part of one of the most audacious undertakings of our time. In Squandered Victory he shows how the American effort to establish democracy in Iraq was hampered not only by insurgents and terrorists but also by a long chain of miscalculations, missed opportunities, and acts of ideological blindness that helped assure that the transition to independence would be neither peaceful nor entirely democratic. He brings us inside the Green Zone, into a world where ideals were often trumped by power politics and where U.S. officials routinely issued edicts that later had to be squared (at great cost) with Iraqi realities. His provocative and vivid account makes clear that  Iraq-and by extension, the United States-will spend many years climbing its way out of the hole that was dug during the fourteen months of the American occupation.",
        "Category": " Political Science , General",
        "Publisher": "Times Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Nothing's Impossible: Leadership Lessons From Inside And Outside The Classroom",
        "Authors": "By Monroe, Lorraine",
        "Description": "In 1991, Dr. Lorraine Monroe founded the Frederick Douglass Academy, a public school in Harlem, in the belief that caring instructors, a disciplined but creative environment, and a refusal to accept mediocrity could transform the lives of inner-city kids. Her experiment was a huge success. Today the Academy is one of the finest schools in the country, sending graduates to Ivy League colleges and registering the third highest SAT scores in New York City. The key to its success: a unique leadership method Monroe calls the \"Monroe Doctrine,\" which she developed through decades as a teacher and principal in some of America's toughest schools. In this book Monroe tells her own remarkable story and explains her \"Doctrine\" through pithy, memorable rules and observations and a host of wonderful true stories. This is an inspiring read for both new and experienced educators?and for anyone who wants to succeed in the face of seemingly impossible odds.",
        "Category": " Education , Leadership",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "A Turn for Lucas",
        "Authors": "By Averbuch, Gloria and Guterman, Yaakov (ILT)",
        "Description": "Knowing that he is not as good a soccer player as his sister, Lucas is very nervous when the coach puts him in as goalie early in a game against the Sharks.",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "Mitten Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Price of Government: Getting the Results We Need in an Age of Permanent Fiscal Crisis",
        "Authors": "By Osborne, David and Hutchinson, Peter",
        "Description": "Government is broke. The 2004 federal deficit is the highest in U.S. history. The states have suffered three years of record shortfalls. Cities, counties, and school districts are laying off policemen and teachers, closing schools, and cutting services. But the fiscal pain won&#39;t go away, and the bankrupt ideologies of left and right offer little guidance.The Price of Government presents a radically different approach to budgeting&#151;one that focuses on buying results for citizens rather than cutting or adding to last year&#39;s spending programs. It advocates consolidation, competition, customer choice, and a relentless focus on results to save millions while improving public services.",
        "Category": " Business & Economics , Accounting , Governmental",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Guests of the Ayatollah",
        "Authors": "By Bowden, Mark",
        "Description": "On November 4, 1979, a group of radical Islamist students, inspired by revolutionary Iranian leader Ayatollah Khomeini, stormed the U.S. embassy in Tehran. They took fifty-two Americans hostage and kept nearly all of them captive 444 days.The Iran hostage crisis was a watershed moment in American history. It was America's first showdown with Islamic fundamentalism, a confrontation at the forefront of American policy to this day. It was also a powerful dramatic story that captivated the American people, launched yellow-ribbon campaigns, made celebrities of the hostage's families, and crippled the reelection campaign of President Jimmy Carter.Mark Bowden tells this sweeping story through the eyes of the hostages, their radical, naïve captors, the soldiers sent on the impossible mission to free them, and the diplomats working to end the crisis. Taking listeners from the Oval Office to the hostages' cells, Guests of the Ayatollah is a remarkably detailed, brilliantly re-created, and suspenseful account of a crisis that gripped and ultimately changed the world. On November 4, 1979, a group of radical Islamist students, inspired by revolutionary Iranian leader Ayatollah Khomeini, stormed the U.S. embassy in Tehran. They took fifty-two Americans hostage and kept nearly all of them captive 444 days.The Iran hostage crisis was a watershed moment in American history. It was America's first showdown with Islamic fundamentalism, a confrontation at the forefront of American policy to this day. It was also a powerful dramatic story that captivated the American people, launched yellow-ribbon campaigns, made celebrities of the hostage's families, and crippled the reelection campaign of President Jimmy Carter.Mark Bowden tells this sweeping story through the eyes of the hostages, their radical, naïve captors, the soldiers sent on the impossible mission to free them, and the diplomats working to end the crisis. Taking listeners from the Oval Office to the hostages' cells, Guests of the Ayatollah is a remarkably detailed, brilliantly re-created, and suspenseful account of a crisis that gripped and ultimately changed the world.",
        "Category": " Political Science , Civil Rights",
        "Publisher": "Simon & Schuster Audio",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "A Democrat Looks at His Party",
        "Authors": "By Acheson, Dean Gooderham",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Barbarians at the Gate",
        "Authors": "By Burrough, Bryan and Helyar, John",
        "Description": "Barbarians at the Gate has been called one of the most influential business books of all time -- the definitive account of the largest takeover in Wall Street history. Bryan Burrough and John Helyar's gripping account of the frenzy that overtook Wall Street in October and November of 1988 is the story of deal makers and publicity flaks, of strategy meetings and society dinners, of boardrooms and bedrooms -- giving us not only a detailed look at how financial operations at the highest levels are conducted but also a richly textured social history of wealth at the twilight of the Reagan era.Barbarians at the Gate -- a business narrative classic -- is must reading for everyone interested in the way today's world really works.",
        "Category": " Business & Economics , Corporate & Business History",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Handbook of American Indian Games (Native American)",
        "Authors": "By MacFarlan, Allan",
        "Description": "Fun-loving youngsters will find new trails to amusement in this varied collection of 150 spirited, entertaining and easy-to-play games once played by Indian tribes across America. Indian lore and recreation specialists Allan and Paulette Macfarlan present a rich assortment of active, quiet, competitive, and instructive games for boys and girls of all ages that offer hours of enjoyment and provide insight into how American Indians thought, lived, and played.You’ll find running, relay, kicking, stalking, throwing and rolling, tossing and catching, guessing, group-challenge, and many other games chosen for their skill-building and character-building qualities. These authentic Indian sports develop dexterity, strength, endurance, patience, logic, power of observation, good sportsmanship, and other desirable attributes.The games can be played indoors or out with little or no equipment and are suitable for small and large groups for every occasion. Complete step-by-step instructions plus numerous diagrams make them easy to learn and play — an ideal source of recreation for campers, scouts, school groups, and others.Parents, teachers, group leaders, camp counselors, and anyone who works with young people will find the Handbook of American Indian Games a wonderful source of safe, healthy, and amusing recreations.",
        "Category": " History , United States , State & Local , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Adam Smith",
        "Authors": "By West, E. G.",
        "Description": "Adam Smith, author of The Wealth of Nations, was no dry pedant. His lectures and writings are alive with examples taken from the busy eighteenth-century world around him, and Edmund Burke praised his literary style as “rather painting than writing.” It was Adam Smith who taught moral philosophy and literary criticism to Boswell at the University of Glasgow, and in Smith’s works we follow his interests from political history to law, sociology, economic and social history, philosophy, and English literature.E. G. West brings to life Adam Smith’s first years in the bustling Scottish seaport of Kirkcaldy (and recounts Smith’s brief kidnapping, as a baby, by gypsies). We follow young Smith as a student, watch his thought develop as Professor of Moral Philosophy at Glasgow, and enjoy with him the hospitality of David Hume, the Parisian literary salons, Johnson, Burke, Gibbon, and other giants of the era.West gives us a masterful summary of The Wealth of Nations. Even more significant, West restores to eminence an earlier work of Smith’s, The Theory of Moral Sentiments. “If The Wealth of Nations had never been written,” he asserts, “this previous work would have earned for him a prominent place in intellectual history.” West takes particular delight in using The Theory of Moral Sentiments to rebut Marx’s assumptions about laissez-faire capitalism.E. G. West was educated at the University College of Exeter, graduating in economics in 1948. He has taught at several British colleges and at Carleton University in Ottawa, and has been a visiting research scholar at the University of Chicago and the University of California at Berkeley and a visiting professor at the Center for Study of Public Choice, Virginia Polytechnic Institute and State University. Dr. West authored several books including Education and the State and Education and the Industrial Revolution. His articles have appeared in numerous periodicals and scholarly journals.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Liberty Fund Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1977"
        }
    },
    {
        "Title": "Calculus and its applications",
        "Authors": "By Goldstein, Larry Joel, etc.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Jew Vs Jew: The Struggle For The Soul Of American Jewry",
        "Authors": "By Freedman, Samuel G.",
        "Description": "At a time when American Jews should feel more secure and cohesive than ever, civil war is tearing apart their community. Congregations, neighborhoods, even families are taking sides in battles about Jewish identity and Jewish authenticity.The conflict pits fundamentalist against secularist, denomination against denomination, even liberal against conservative within each branch of Jewry. Jew vs. Jew tells the story of how American Jewry has increasingly -- and perhaps terminally -- broken apart in the last forty years.  Jew vs. Jew stretches in time from 1960 to 2000. It travels the country from Florida to New England, from Los Angeles to the Catskills in New York, from Cleveland to Denver, and it also crosses the ocean to Israel to show how tensions within the Jewish state inflame those among American Jews. The flash-points range from conversion standards to the role of women, from the peace process in Israel to the sexual climate on an Ivy League campus. But behind them all, as Samuel Freedman writes, lie common causes. First, far from unifying American Jews, Israel now divides them on both political and religious grounds. Second, neither America nor the larger world presents Jews with a single enemy against whom to coalesce. Third, and most important, nothing in the Jewish history of persecution, oppression, and exile prepared the Chosen People for the challenge posed by America, the challenge of being absorbed into a tolerant and diverse nation, being accepted so thoroughly that the intermarriage rate tops 50 percent.  Jew vs. Jew introduces readers to memorable places and characters. Freedman describes one of the final summers at a Labor Zionist camp in the Catskills whose brand of secular Jewishness is becoming obsolete because Zionism succeeded in creating Israel. He tells the story of Orthodox and Reform Jews in a Cleveland suburb who are fighting about the construction of several synagogues -- and, on a deeper level, about whether unity or pluralism ought to be the goal of Jewish life. He portrays a Florida Jew so violently opposed to the Oslo peace accords that he planted a bomb in a synagogue where Shimon Peres was speaking. He tells about a Los Angeles congregation that spent three years debating whether or not to honor the Biblical matriarchs in its liturgy.We come to know the Long Island neighbors who cannot tolerate sharing even a property line because their versions of Jewish identity are so irreconcilably different.  Jew vs. Jew is a work of vigorous reporting, lucid writing, and intellectual curiosity. And even as it chronicles an embittered and polarized community, it refuses to take sides or pass judgment. Instead, with compassion and acuity, Jew vs. Jew bears witness.",
        "Category": " Religion , Ethics",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Web Security and Commerce (Nutshell Handbooks)",
        "Authors": "By Garfinkel, Simson and Spafford, Gene",
        "Description": "Attacks on government Web sites, break-ins at Internet service  providers, electronic credit card fraud, invasion of  personal privacy by merchants as well as hackers--is this what  the World Wide Web is really all about?Web Security & Commerce cuts through the hype and the front page stories. It tells you what the real risks are and explains how you can minimize them. Whether you're a casual (but concerned) Web surfer or a system administrator responsible for the security of a critical Web server, this book will tell you what you need to know.  Entertaining as well as illuminating, it looks behind the headlines at the technologies, risks, and benefits of the Web.  Whatever browser or server  you are using, you and your system will benefit from this book.Topics include:User safety--browser vulnerabilities (with an emphasis on Netscape Navigator and Microsoft Internet Explorer), privacy concerns, issues with Java, JavaScript, ActiveX, and plug-ins.Digital certificates--what they are, how they assure identity in  a networked environment, how certification authorities and server certificates work, and what code signing all about.Cryptography--an overview of how encryption works on the Internet and how different algorithms and programs are being used today.Web server security--detailed technical information about SSL (Secure Socket Layer), TLS (Transport Layer Security),  host security, server access methods, and secure CGI/API programming.Commerce and society--how digital payments work, what blocking software and censorship technology (e.g., PICS and RSACi) is about,  and what civil and criminal issues you need to understand.",
        "Category": " Computers , Security , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Congress, the bureaucracy, and public policy (The Dorsey series in political science)",
        "Authors": "By Ripley, Randall B.",
        "Description": "",
        "Category": "",
        "Publisher": "Homewood, Ill. : Dorsey Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Songs of Paul Simon",
        "Authors": "By Simon, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "A. A. Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1972"
        }
    },
    {
        "Title": "The Best of the Wine Country 4th Edition",
        "Authors": "By Martin, Don W.",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "DiscoverGuides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Schifferstadt cat and friends",
        "Authors": "By Hotz, Birch",
        "Description": "",
        "Category": "",
        "Publisher": "Diversions Publications",
        "Price Starting With ($)": "7.33",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Windows of Wisdom",
        "Authors": "By Stephen F. Olford",
        "Description": "",
        "Category": "",
        "Publisher": "Billy Graham Evangelical Association / Ambassador-Emerald International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Liberation Management",
        "Authors": "By Peters, Thomas J.",
        "Description": "In the new economy, hierarchical business structures are being consigned to the shredder and replaced with flexible, fast-responding, ad hoc groups of brainworkers. Tom Peters, author of the bestselling IN SEARCH OF EXCELLENCE is once again ahead of the curve, and now demonstrates that the key to success in business future is total engagement, dynamism, speed, and independence. \"Rewarding. Provides a wealth of thought-provoking information and incisive insights.\"PHILADELPHIA INQUIRER\"A gold mine of information.\"USA TODAY",
        "Category": " Business & Economics , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Fixing Intelligence: For a More Secure America",
        "Authors": "By Odom, William E.",
        "Description": "Security depends on intelligence, and in this book a leading authority discusses basic problems in American intelligence and how to fix them. For this edition he provides a new preface in which he assesses the security recommendations of the recently released Congressional committee report on 9/11.Praise for the earlier edition:?Odom's important and thought-provoking book . . . couldn't be more timely.\"?Eric Lichtblau, New York Times Book Review (front cover)?Indispensable . . . a formidable contribution to the difficult work ahead in realigning the intelligence agencies’ Cold War-vintage structure.”?Lorraine Adams, Washington Post Book World?A vital and extraordinarily timely contribution to our national debate.”?Zbigniew Brzezinski\"This is a forcefully and cogently argued book. It is a necessary read for anyone concerned about the future of intelligence.\"?Lawrence D. Freedman, Foreign Affairs?By publishing the Odom study, the Yale University Press establishes a benchmark, a guide for public debate on this vital issue.”?David E. Murphy, retired National Intelligence Officer and CIA Soviet specialist\"General Odom uses the unique insight gained from years of experience in the intelligence business to explain in plain language an issue that is critical to U.S. national security?intelligence community reform.  A valuable resource to expert and novice alike, it serves both as an excellent introduction to the intelligence community, and also as a valuable guide to the current debate over how to proceed with intelligence community reform.\"?Senator Richard C. Shelby",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "But I Love You Anyway (Harvest American Writing)",
        "Authors": "By Lewis, Sara",
        "Description": "Two sisters confront love, marriage, and a failing business in this “charming and deceptively breezy second novel” (Publishers Weekly) that “deftly explores big issues like loyalty, trust, sorrow, and disappointment in sure, bright, effervescent prose” (New York Times Book Review).",
        "Category": " Fiction , General",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Howard W Hunter",
        "Authors": "By Knowles, Eleanor and Hunter, Howard W.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Deseret Book Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The age of Jackson, (Documentary history of the United States)",
        "Authors": "By Remini, Robert Vincent",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Dolls of Yesterday: Dolls and Doll Collecting in Europe and America During the Past 200 Years",
        "Authors": "By St. George, Eleanor",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The Night Lover: Art & Poetry",
        "Authors": "By Stevens, Elisabeth",
        "Description": "",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Birch Brook Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Papercrafts and Origami ~ A truly comprehensive collection of papercraft ideas, designs and techniques, with over 300 projects",
        "Authors": "By Painter, Lucy (Ed).",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Anatomy for the Artist",
        "Authors": "By Carter, Daniel and Courtney, Michael",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "18 Seconds",
        "Authors": "By Crouse, Lindsay (NRT) and Shuman, George D.",
        "Description": "Investigative consultant Sherry Moore is blind and stunningly beautiful, with the extraordinary ability to \"see\" the deceased's last eighteen seconds of memory by touching the corpse. A head injury at age five left her without sight and prevented her from remembering her past. When Sherry discovers she has the sight, she learns to use her gift to help others solve mysteries that only she can tap into. Serial killer Earl Sykes was never caught for his vicious murders. Instead, a deadly traffic accident landed him in prison. Now almost thirty years later, he returns to the seaside town of Wildwood, New Jersey -- and to abducting young female victims for his gruesome games.Wildwood police lieutenant Kelly O'Shaughnessy is stymied over the disappearance of young women. When an old man's untimely death leads Sherry Moore to Wildwood, O'Shaughnessy's desperation forces her to accept Sherry's help, but not without consequence. As the two women join forces to discover the killer's identity, they unwittingly become the hunted, marching deeper with every step into the monster's lair.A law enforcement veteran himself, George Shuman packs a realistic style and authentic investigative detail into this taunt tale filled with pulse pounding tension that will send listeners right to the edge.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster Audio",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Soy Zone",
        "Authors": "By Sears, Barry",
        "Description": "Enter The Soy Zone...the healthiest diet in the worldSoy is the fastest-growing food product in America today, and for good reason. A nutritional superstar, it has no cholesterol or saturated fat but plenty of protein, vitamins, and fiber and offers an amazing rainbow of health benefits for vegetarians and non-vegetarians alike.In this groundbreaking new book, Dr. Barry Sears reveals his healthiest Zone diet yet and along the way provides stunning new scientific findings on the disease-fighting and anti-aging benefits of soy. Based on the simple idea that food is your best medicine, The Soy Zone shows you how to maintain peak mental alertness, increase your energy, and reduce the likelihood of chronic disease -- all while losing excess body fat -- by eating delicious soy-based Zone meals.In this eye-opening new book, Dr. Sears drops bombshell after bombshell, including:Why soy is a wonder foodWhy the right soy-based diet can prevent heart disease, cancer, diabetes, depression, osteoporosis, and chronic fatigueThe serious problems with the traditional grain-based vegetarian dietThe soy diet secrets of Okinawans, the longest-lived people in the worldWhy a pasta/bread/rice-based diet makes you fatWhy high-protein fad diets will wreck your metabolism and cause weight gainWhy the USDA food pyramid is unhealthyWhy Omega-3 fatty acids must be essential supplements to your dietAs America is finding out, soy is the most complete and versatile protein source in existence. Now Dr. Sears brings the life-enhancing benefits of the Zone to a mouthwatering collection of delicious soy-based Zone meals, featuring:Appetizing new recipes from top chefs, such as Baked Golden Tofu Dumplings, Red Bean Chili, Tempeh Paprikas, Tofu-Eggplant Gumbo, Hong Kong Burger, and Soy Zone-Friendly Vegetarian Pad ThaiSoy Zone-perfect breakfasts, lunches, appetizers, dinners, and snacksThe ultimate healthful food plan, with quick and easy fat-burning alternatives to dangerous highcarb dietsAn exercise and longevity plan for men and womenHelpful recommendations for Soy Zoning your kitchenA scientifically proven plan for achieving perfect hormonal balance while losing weightSo Enter The Soy Zone Today -- it may be your greatest investment for a healthy future.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Surviving Antarctica: Reality TV 2083",
        "Authors": "By White, Andrea",
        "Description": "It's 50 degrees below zero.  The wind and snow blow so hard, you can't see your hand in front of your face. Your heating fuel is nearly gone, and so is your food. How do you survive?  Five fourteen–year–olds face this desperate situation on a deadly journey in Antarctica. It is 2083. They are contestants on a reality TV show, Antarctic Survivor, which is set up to re–create Robert F. Scott's 1912 doomed attempt to be the first to reach the South Pole.  But in 2083 reality TV is not just an act. Contestants literally relive – or die during – the simulations of events. Robert Scott and his team were experienced explorers and scientists, but their attempt to reach the Pole proved fatal. What chance does the Antarctic Survivor team have?  This action–packed, riveting adventure –– full of fascinating direct quotes from Scott's journals and other accounts of the expedition – is both a heart–wrenching drama from the past and a disquieting glimpse into the future.",
        "Category": " Young Adult Fiction , Science Fiction , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Clinical Interview Using Dsm-IV: Fundamentals",
        "Authors": "By Othmer, Ekkehard and Othmer, Sieglinde C.",
        "Description": "How to use the most powerful assessment strategies developed in the field of clinical psychology and psychiatry. In this new edition adapted to DSM-IV, the authors teach how to master each of the four basic interview components separately and how to make them interact optimally during the five phases of the patient interview. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Medical , General",
        "Publisher": "Amer Psychiatric Pub Inc",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Ultimate Questions",
        "Authors": "By John Blanchard",
        "Description": "",
        "Category": "",
        "Publisher": "Evangelical Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Bouncing Back After Your Pregnancy: What You Need to Know about Recovering From Labor and Delivery and Caring For Your New Family",
        "Authors": "By Curtis, Glade B. and Schuler, Judith",
        "Description": "Picking up where most pregnancy books leave off, Bouncing Back After Your Pregnancy covers the care of mother and baby and the new family dynamic during the eight to twelve weeks of postpartum adjustment. Written with compassion and packed with sound medical advice, Bouncing Back guides new parents through this most intense, disorienting time, with information on:Recovering from childbirth and regaining strength and vitalityWhat to do if you are having trouble breastfeedingAnd how to tell if your baby is getting enough milk or formulaWhat to ask in your first visit to the pediatricianNutritional tips and recommended exercises for getting back in shapeSelecting the right childcare arrangements if you are returning to the workplaceAnd much, much more.Sure to take its place on the shelf right next to Your Pregnancy Week by Week, Bouncing Back After Your Pregnancy is the definitive resource for every new mother.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Everyday Cheapskate's Greatest Tips (Debt-Proof Living (Paperback))",
        "Authors": "By Hunt, Mary",
        "Description": "From Mary Hunt comes a collection of tips on saving money and time in the areas of home, auto, travel, clothing, cooking, shopping, finance, kitchen, gifts, special occasions, kids, yard and garden, laundry, health, organizing and more. It contains sound advice for getting out of debt, managing money, curbing spending, finding creative solutions, and &#147;bringing dignity to the art of living below your means.”",
        "Category": " Business & Economics , Personal Finance , Budgeting",
        "Publisher": "Running Press Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Toward Commitment: A Dialogue About Marriage",
        "Authors": "By Rehm, Diane and Rehm, John B.",
        "Description": "In Toward Commitment, Diane Rehm, the nationally known Public Radio broadcaster, and John, her lawyer-husband, open up for the reader their marriage of over forty years, revealing their passionate bond as well as their points of conflict and frustration. In a series of surprisingly honest dialogues, they grapple with their pronounced differences of background, attitude, and expectation. Addressing difficult and important issues-from love and sex and raising children to dependence and independence, from spiritual differences to financial and social needs-Toward Commitment gives readers the opportunity to eavesdrop on a husband and wife bravely analyzing their relationship and confronting the issues that inevitably strain a relationship. Refreshingly candid, these perceptive discussions will resonate with any two people who care enough about each other to resolve their difficulties. A practical guide for married couples as well as a must-read for couples considering that commitment, this thoughtful and ultimately hopeful book will help them become closer than ever.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.75",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Where's Dan Quayle?",
        "Authors": "By Becker, Jim",
        "Description": "Readers are challenged to locate Vice President Dan Quayle at such locales as a session of Congress, a military base, on a tour of the White House, and NASA headquarters",
        "Category": " Humor , Topic , Political",
        "Publisher": "Collier Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Guardian of the Horizon",
        "Authors": "By Peters, Elizabeth",
        "Description": "A hitherto lost journal of the indomitable Amelia Peabody has been miraculously recovered: a chronicle from one of the \"missing years\" -- 1907–1908 -- shedding new light on an already exceptional career, a remarkable family . . . and an unexpected terror.Ousted from their most recent archaeological dig and banned forever from the Valley of the Kings, the Emersons are spending a quiet summer at home in Kent, England, when a mysterious messenger arrives. Claiming to be the teenage brother of their dear friend Tarek, prince of the mysterious Lost Oasis, the charismatic herald brings troubling news of a strange malady that has struck down Tarek's heir and conveys his brother's urgent need for help only the Emersons can provide.Driven by loyalty -- and a fear that the evil forces opposing Tarek's rule will now exploit the royal heir's grave illness -- the family sets off in secret for the land time forgot -- a mountain fortress from which they narrowly escaped ten years before. Braving the treacherous desert climate on a trek fraught with danger at every turning, guided only by a crumbling map, the Emersons are unaware that deception is leading them onward into a nest of vipers -- where a dreadful fate may await. For young Ramses, forced to keep his growing love for the beautiful Nefret secret, temptation along the way may prove his ultimate undoing. And a dark past and grim obligation have ensnared Nefret once again, as she is helpless to save those she loves most from the prison of the Lost Oasis.Guardian of the Horizon is rich with suspense, surprises, unforgettable characters, and the intoxicating atmosphere that has earned its author the coveted title of Grand Master two times over. The remarkable Elizabeth Peters proves once again that, in the world of historical adventure fiction, she is truly without peer.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Dasher: The roots and the rising of Jimmy Carter",
        "Authors": "By Wooten, James T.",
        "Description": "",
        "Category": "",
        "Publisher": "see notes for publisher info",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Body of David Hayes",
        "Authors": "By Pearson, Ridley",
        "Description": "Years ago, Lou Boldt's wife Liz had an affair with David Hayes, a young computer specialist at the bank where she is an executive. When Liz ended the relationship after reconciling with Lou, Hayes engaged in a daring embezzlement scheme. Now, years later, Hayes is trying to retrieve the money he hid for the Russian mob and contacts Liz to try to gain access to the bank's mainframe. Liz is torn between wanting to protect the bank and needing to protect her family. Boldt, ripped apart by the discovery of his wife's possible blackmail, must skate a delicate line between his incompatible roles as determined detective and jealous husband if he is to find the money while exposing and stopping Hayes. Intensely involving and revealing new aspects of Boldt's emotional makeup never before seen, The Body of David Hayes is Ridley's most gripping and engaging thriller yet.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Extra Virgin: A Young Woman Discovers the Italian Riviera, Where Every Month Is Enchanted",
        "Authors": "By Hawes, Annie",
        "Description": "In 1983, a pale Annie Hawes and her equally pale sister leave England for the sun-drenched olive groves of a small Italian town in Liguria. With fantasies of handsome tanned men and swimming in the sea urging them on, they are hired to work for ten weeks to graft roses -- of which they have little knowledge -- along the Italian Riviera, board and lodging included.But none of the men seem to be under forty, and Ligurians have particular ideas about life, including swimming (\"To go swimming in seawater outside the month of July or August is even worse for your health than drinking cappuccino after twelve noon!\"). But Annie and her sister are captivated by San Pietro's quirkiness and beauty, and suddenly their brief stay stretches into years, as they are bemused, charmed, and ultimately accepted by the eccentric inhabitants of their adopted home.Resonating with captivating verve and humor, Extra Virgin dishes up a sumptuous sampling of Italian life from an irresistible new voice.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Fed: The Inside Story How World's Most Powerful Financial Institution Drives Markets",
        "Authors": "By Mayer, Martin",
        "Description": "A timely, inside look at America's Federal Reserve System reveals how the Fed has reinvented itself in response to changes in the new economy, explaining how it works, how it has changed, its impact on modern business and financial institutions, and more. Reprint.",
        "Category": " Business & Economics , Economic History",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Chicken Soup for the Cat & Dog Lover's Soul: Celebrating Pets as Family with Stories About Cats, Dogs and Other Critters",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Becker, Marty (COM), and Kline, Carol (COM)",
        "Description": "Chicken Soup for the Pet Lover's Soul spoke directly to the hearts of all readers whose lives have ever been changed by the love of a pet. Now the coauthors bring readers this volume, honoring the unique and enduring love that people share with their cats and dogs. Like its predecessor, this book is a joyous and inspiring collection--sometimes poignant, sometimes amusing, always filled with the special and incredibly unconditional love only cats and dogs can give. The stories in this collection celebrate those lovable furry, four-legged creatures that bring out the best in all of us, inspiring us to be happier, kinder, more understanding and more loving.  Readers will discover that many of humanity's greatest heroes, healers and teachers are not humans at all, but those amazing cats and dogs that brighten all our lives.",
        "Category": " Pets , Cats , General",
        "Publisher": "Hci",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Iceman Cometh",
        "Authors": "By O'Neill, Eugene",
        "Description": "The Place: Harry Hope's bar, a cheap gin-mill of the five-cent whiskey, last-resort variety situated downtown on the West Side of New York.The Time: Salesman Hickey's birthday celebration, two days during the summer of 1912 -- a time when all tomorrows are forced abruptly to become today; when the delineation between hopes, dreams, and pipe dreams disintegrates; when \"self-knowledge\" destroys self-respect, compassion -- and life.One of the last of Eugene O'Neill's plays, The Iceman Cometh stands today with Long Day's Journey into Night and A Moon for the Misbegotten as the supreme expression of his dramatic genius.",
        "Category": " Drama , American , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1957"
        }
    },
    {
        "Title": "Romiette and Julio",
        "Authors": "By Draper, Sharon M.",
        "Description": "Star Crossed Lovers  When Romiette Cappelle meets Julio Montague, she feels as though she has met the soul mate who can rescue her from her recurring nightmare about fire and water. But like the Shakespearean characters whose names echo theirs, Romiette and Julio discover that not everyone approves of their budding romance. In their case, it is because Romiette is African-American and Julio is Hispanic, and the Devildogs, a dangerous local gang, violently oppose their interracial relationship.  When the Devildogs threaten to teach them a lesson, Romiette and Julio come up with a risky plan to escape from the gang's fearsome shadow. But things go terribly awry, and the two find themselves caught up in a deadly reality more frightening that Romiette's nightmare -- and in a desperate struggle to avoid the tragic fate of Shakespeare's famous young lovers.",
        "Category": " Young Adult Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Natural Calm: Stress Relief for Today's Woman (Women's Edge Health Enhancement Guide)",
        "Authors": "By Prevention Magazine Health Books (COR), Shimer, Elizabeth, and Aalst, Mariska Van",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Complete Stretching: A New Exercise Program for Health and Vitality",
        "Authors": "By Tobias, Maxine and Sullivan, John Patrick",
        "Description": "A guide to the newest approach to good health guides readers through intensive stretch workouts, each designed according to flexibility level, that relieve tension, enhance performance, and prevent injuries. Original. 50,000 first printing.",
        "Category": " Art , Techniques , Drawing",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Floors and Stairways",
        "Authors": "By Time-Life Books",
        "Description": "Detailed drawings supplement step-by-step instructions for replacing stairways, laying carpet and tile floors, and installing and refinishing wood floors",
        "Category": " House & Home , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.15",
        "Publish Date": {
            "Month": "March",
            "Year": "1978"
        }
    },
    {
        "Title": "Exploring the World of the Celts",
        "Authors": "By James, Simon",
        "Description": "\"The whole race...is madly fond of war, high-spirited and quick  to battle...and on whatever pretext you stir them up, you will  have them ready to face danger, even if they have nothing on  their own side but their own strength and courage\" - Strabo,  first century BC. Warlike, flamboyant, courageous - the ancient  Celts had a fearsome reputation, even among the bellicose Romans.  For 500 years they dominated the barbarian lands north of the  Alps, before being largely absorbed into the Roman Empire. But  Celtic culture survived and achieved a glorious flowering in the  post-Roman, early Christian era. Today Celtic influence can be  found everywhere, in arts and crafts, in legends, in placenames  and even in the languages we speak. In this new introduction to  the world of the Celts, Simon James looks at all aspects of their  history. Individual sections chart their rise, their way of life  from farming to feasting, their wars, their gods, and their  superb craftsmanship. Also highlighted are the hitherto neglected  subject of Celtic life under Roman rule and persistent traditions  that led to the Celtic renaissance in Ireland after AD 400.  Original features include the latest discoveries; extracts from  classical authors; illustrated retellings of the most famous  myths and legends; tables of comparative information; diagrams,  maps and site plans. The Celts once held sway over much of  Europe, from Caledonia to Asia Minor. Here is the whole story of  this immensely inventive and influential people.",
        "Category": " History , Europe , Ireland",
        "Publisher": "Thames and Hudson",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Yoga Mind And Body (DK Living)",
        "Authors": "By Sivananda Yoga Vedanta Center (COR) and Dorling Kindersley, Inc. (COR)",
        "Description": "Outlines the five basic principles of yoga, explaining how exercise, meditation, breathing, relaxation, diet, and positive thinking can improve everyday life and providing recipes and step-by-step photographs for basic yoga postures",
        "Category": " Health & Fitness , Yoga",
        "Publisher": "DK",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Disney's Easy to Read Stories: A Collection of 6 Favorite Tales",
        "Authors": "By Disney Book Group",
        "Description": "A colorful collection of six beginning reader tales includes \"Toy Story\", \"Lady and the Tramp,\" \"Mulan,\" and \"The Lion King.\"",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Water Gardens",
        "Authors": "By Sunset Books",
        "Description": "Offers advice on creating and caring for a water garden, including pool design and construction, plant selection, and stocking the pond with fish",
        "Category": " Gardening , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Simpsons Forever! A Complete Guide to Our Favorite Family...Continued",
        "Authors": "By Groening, Matt and Gimple, Scott M.",
        "Description": "Picking up where The Simpsons: A Complete Guide to our Favorite Family left off, The Simpsons Forever! brings all the history, tidbits, and cold hard facts on every episode from the past two years, and much, much more. Fans will find the highlights of all the shows from seasons nine and ten, plus eyeball–busting two–page spreads for special episodes (like the annual Halloween show). Heavily packed into these pages are updated favourites like Best Homerisms, Famous Chalkboard Sayings, All–New Simpsons Singalong Lyrics, Couch Gags, and classic screen images. And, yes – it's all cross–referenced! The ultimate celebration of America's Favorite – and longest running – cartoon family, The Simpsons Forever! is a must!",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Harper Design",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Gideon's River",
        "Authors": "By Marric, J. J.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper and Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Jack Maggs",
        "Authors": "By Carey, Peter",
        "Description": "\"Jack Maggs is a dazzling tale of obsession, and Jack Maggs stands as a remarkable character, a resurrected antipodean lag returned to England for vengeance and reconciliation.\"--Thomas Keneally From the Booker Prize-winning author, a vivid and robust novel of Dickensian London--a place and a story teeming with mystery, science, and passion.The time, the 1830s. Jack Maggs, a foundling trained in the fine arts of thievery, cruelly betrayed and deported to Australia, has now reversed his fortunes--and seeks to fulfill his well-concealed, innermost desire. Returning \"home\" under threat of execution, he inveigles his way into a household in Great Queen Street, where he's quickly embroiled in various emotional entanglements--and where he falls under the hypnotic scrutiny of Tobias Oates, a celebrated young writer fascinated by the process of mesmerism and obsessed with the criminal mind.From this volatile milieu emerges a handful of vividly drawn characters in the dangerous pursuit of love, whether romantic or familial--each of them with secrets, and secret longings, that could spell certain ruin. And as their various schemes converge, the captivating figure at the center is Jack Maggs himself, at once frightening, mystifying, and utterly compelling.  \"Imaginative and audacious . . . A twentieth-century, post-colonial Dickens novel . . . This strange, bold, gripping, and wonderful novel is the story of a power struggle, a double love story, a quest story, and a story of trickery and disguise. It's about taking possession--of an inheritance, of another person's soul, of your own destiny--and being taken possession of. Not least, it's the story of one writer's being possessed by another.\"--Hermione Lee, The Observer \"Uncommonly exciting and engaging. As much as anyone now writing, Peter Carey is a master of storytelling. His empathy with his characters, combined with his psychological sharp-sightedness, has them almost jumping off the page in full human complexity. An especial bonus is his style . . . Vivid, exact, unexpected images and language match the quick, witty intelligence flickering through this novel, and make it a triumph of ebullient indictment, humane insight, and creative generosity.\"--Peter Kemp, Sunday Times (London) \"Writing and philosophical contemplations of the highest order . . . On a par with, and more interesting than, his two earlier masterpieces . . . An absorbing, beautifully written novel finished off with a most satisfactory happy ending, and with incidents, an atmosphere, and ideas that linger in the mind.\"--Carmen Callil, The Daily Telegraph",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Straight",
        "Authors": "By Francis, Dick",
        "Description": "The death of his brother Greville--an enigmatic figure with numerous enemies--bodes ill for Derek Franklin, who inherits numerous aspects of his life, including its dangers",
        "Category": " Fiction , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Children's Sculpture",
        "Authors": "By Horwitz, Elinor Lander",
        "Description": "",
        "Category": "",
        "Publisher": "Washingtonian Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "Heavens & The Earth",
        "Authors": "By McDougall, Walter A.",
        "Description": "Chronicles the political history of the space race, from its nineteenth-century beginnings with the rocketry pioneers to the Cold War competition, in which space became another area embraced by the U.S. and U.S.S.R",
        "Category": " Political Science , History & Theory",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Rhetoric in a Modern Mode",
        "Authors": "By James K. Bell And Adrian A. Cohn",
        "Description": "",
        "Category": "",
        "Publisher": "Glencoe",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Whom the Gods Love (Julian Kestrel Mystery)",
        "Authors": "By Ross, Kate",
        "Description": "In 1825, while having a party, a successful young man with an uncertain reputation is murdered, and after the police fail to find the killer, the young man's father calls upon private detective Julian Kestrel to solve the mystery. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Programming in ADA (International computer science series)",
        "Authors": "By Barnes, J.G.P.",
        "Description": "Introduces the standard version of the Ada programming language, covers control structures, subprograms, exceptions, and tasking, and provides exercises and examples",
        "Category": "",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Homo Faber: A Report",
        "Authors": "By Frisch, Max and Bullock, Michael (TRN)",
        "Description": "Walter Faber is an emotionally detached engineer forced by a string of coincidences to embark on a journey through his past. The basis for director Volker Schlšndorff’s movie Voyager. Translated by Michael Bullock. A Helen and Kurt Wolff Book",
        "Category": " Fiction , General",
        "Publisher": "HarperVia",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Leopard Gecko Manual: From The Experts At Advanced Vivarium Systems",
        "Authors": "By De Vosjoli, Philippe, Klingenberg, Roger, Tremper, Roger, and Viets, Brian",
        "Description": "Considered by author Philippe de Vosjoli as &#147;the first domesticated species of lizard,” the leopard gecko has fast become &#147;the reptilian version of the parakeet or goldfish.” Leopard Geckos takes a close look at the characteristics of this species that have made these attractive lizards so amazingly popular in the pet world. As a hardy, easy care, and potentially long-lived lizard, the leopard gecko is the perfect size, attractive in its velvety skin, and fairly easy to breed. The subject of breeding geckos is covered in multiple chapters in this book led by author and herp expert de Vosjoli, who is joined by gecko specialists Dr. Roger Klingenberg, Ron Tremper, and Dr. Brian Viets, who each contribute special chapters to this up-to-date and authoritative guide.  Colorfully illustrated, Leopard Geckos provides excellent general guidelines for keepers who wish to add a gecko to their vivarium and maintain their pet in excellent health and condition. The authors provide an introduction to gecko characteristics including distribution, size, longevity, and growth rate, to help beginners better understand the anatomy and behavior of these fascinating lizards. This Advanced Vivarium Systems title includes information about selecting a healthy leopard gecko, handling, housing needs, water and feeding requirements, and shedding and tail loss. Dr. Klingenberg provides the chapter &#147;The Recognition and Treatment of Disease,” which covers specific disorders keepers should be aware of. De Vosjoli begins the discussion on breeding leopard geckos, and then is joined by Dr. Viets for a chapter on &#147;Incubation Temperature and Hatchling Sex and Pigmentation.” Tremper’s chapter on &#147;Color and Pattern Variations” focuses on the genetic aspects of breeding leopard geckos. The book also discusses the African fat-tailed gecko plus other eublepharids, including the African clawed gecko, Japanese leopard gecko, Malaysian cat gecko, and the Central American banded gecko.",
        "Category": " Pets , Reptiles, Amphibians & Terrariums",
        "Publisher": "CompanionHouse Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Girls' Guide to Power & Success",
        "Authors": "By Solovic, Susan Wilson",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Plains of Passage",
        "Authors": "By Auel, Jean M.",
        "Description": "Ayla and Jondalar journey across Ice Age Europe, awing the primitive tribes--she with her ability to communicate with animals, and he with his mastery of the tools of war",
        "Category": " Fiction , Sagas",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Icebreaker (James Bond)",
        "Authors": "By Gardner, John",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Putnam Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Lady of Avalon",
        "Authors": "By Bradley, Marion Zimmer",
        "Description": "Like the inhabitants of the mystical Avalon, readers of Lady of Avalon will feel they have been transported to another world - a world of myth, magic, romance, and history. This novel spans the creation of Avalon itself and foreshadows the birth of the legendary King Arthur. Here, we meet three remarkable holy women who steer the fortunes of Roman Britain as they struggle with their own destinies:Caillean retreats to the island of Avalon with a small band of priestesses. There she establishes a sisterhood to serve the Great Goddess, raises the heir to the mystic royal line, and veils Avalon from a hostile world in its everlasting mists.The astute Dierna guides Avalon through treacherous political waters by marrying a young priestess to a Roman general ... only to discover that love - especially her own - cannot be so easily controlled.Ana gives birth to a baby girl who will be the mother of the great King to come. But it is her beautiful and feisty oldest daughter, Viviane, who is destined for true greatness - as the famed Lady of the Lake and guardian of the Grail.",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Caring for Your Baby and Young Children (The American Academy of Pediatrics)",
        "Authors": "By Shelov, Steven P. and Hannemann, Robert E. (CON)",
        "Description": "Now the organization that represents the nation's finest pediatricians and the most advanced research and practice in the field of child care brings you state-of-the-art answers to all your medical and parenting concerns. Here is sound, reassuring advice on child rearing that covers everything from preparing for childbirth to toilet training to nurturing your child's self-esteem. Here, too, is an indispensable guide to recognizing and solving common childhood health problems, plus detailed instructions for coping with emergency medical situations.Comprehensive, accurate, and up-to-date, Caring for Your Baby and Young Child includes: basic care from infancy through age five; guidelines and milestones for physical, emotional, social, and cognitive growth; a complete health encyclopedia covering injuries, illnesses, congenital diseases, and other disabilities; safety checks for home, outdoors, and car; a guide for choosing child-care programs; a discussion of family issues from sibling rivalry and adoption to stepfamilies and working mothers and much more.Caring for Your Baby and Young Child is an essential child-care resource for all parents who want to provide the very best care for their children - and the one guide pediatricians routinely recommend and parents can safely trust.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Book of Virtues: A Treasury of Great Moral Stories",
        "Authors": "By Bennett, William J. (EDT)",
        "Description": "Responsibility. Courage. Compassion. Honesty. Friendship. Persistence. Faith. Everyone recognizes these traits as essentials of good character. In order for our children to develop such traits, we have to offer them examples of good and bad, right and wrong. And the best places to find them are in great works of literature and exemplary stories from history.  William J. Bennett has collected hundreds of stories in The Book of Virtues, an instructive and inspiring anthology that will help children understand and develop character -- and help adults teach them. From the Bible to American history, from Greek mythology to English poetry, from fairy tales to modern fiction, these stories are a rich mine of moral literacy, a reliable moral reference point that will help anchor our children and ourselves in our culture, our history, and our traditions -- the sources of the ideals by which we wish to live our lives. Complete with instructive introductions and notes, The Book of Virtues is a book the whole family can read and enjoy -- and learn from -- together.",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Square Foot Gardening",
        "Authors": "By Bartholomew, Mel",
        "Description": "Twice as much in half the space!* A complete garden book for both the beginner and the expert* A new way to garden with 80 percent less space and work* The companion book to the nationally acclaimed television series* Over 900,000 copies in printSquare Foot Gardening presents a new way to garden in less space with less work.* Grow a perfect garden in only 10 minutes a day.* Harvest the biggest tomatoes.* Enjoy spectacular flowers every day.* Ideal for beginners from 4 to 94.* Simple, easy, attractive and rewarding gardens.",
        "Category": " Gardening , Techniques",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    }
]