[
    {
        "Title": "Wellness Foods A to Z: An Indispensable Guide for Health-Conscious Food Lovers",
        "Authors": "By Margen, Sheldon",
        "Description": "This encyclopedic volume by the editors of the U. of California, Berkeley  Wellness Letter  offers a nutritional and market profile of foods from almonds to yoghurt, with serving suggestions. It also provides information on eating for optimal health (without proselytizing for organic food); a guide to food groups, vitamins and minerals, and herbs and spices; how to read food labels; and a cooking glossary. Includes color illustrations. Lacks references. Distributed by National Book Network. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Rebus, Inc.",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Forever Kiss",
        "Authors": "By Knight, Angela",
        "Description": "",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Red Sage Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Fangs But No Fangs (The Young Brothers, Book 2)",
        "Authors": "By Love, Kathy",
        "Description": "When their brother Christian, a vampire who was once a force to be reckoned with, retires to a trailer park and becomes the king of karaoke at a local bar in an attempt to atone for his many sins, Rhys and Sebastian step in to save him with the help of Christian's sexy neighbor Jolee. Original.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Brava Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Big Book of Small Household Repairs : Your Goof-Proof Guide to Fixing over 200 Annoying Breakdowns",
        "Authors": "By Wing, Charlie",
        "Description": "From replacing an outlet to fixing a leak to repairing bath tiles, more than two hundred money-saving repairs using tools from around the house are explained with step-by-step instructions and hundreds of illustrations.",
        "Category": " House & Home , Maintenance & Repair",
        "Publisher": "Emmaus, PA, U.S.A.: Rodale Pre",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "One Morning in Joseph's Garden: An Easter Story",
        "Authors": "By Boddy, Joe (ILT), Flinn, Lisa, and Younger, Barbara",
        "Description": "On the first Easter morning, before dawn, light somehow woke animals, insects, and plants as if dawn had come.  Then darkness returned.  Later Mary arrived and met the risen Lord.  through this gentle story, young children are introduced to the miracle of Easter in a very non-violent way.  For ages 4-8.",
        "Category": " Juvenile Nonfiction , Religion , Christianity",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The KornShell command and programming language",
        "Authors": "By Bolsky, Morris I., Korn, David G.",
        "Description": "Aimed at new users and for reference by experienced programmers. Topics include: files and processes, command language, programming language, editor functions, syntax, and parameters. Has numerous examples. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Berlitz Jr: French",
        "Authors": "By Wolf, Tony (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "Texas Bookman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Harper and Moon",
        "Authors": "By Ross, Ramon Royal",
        "Description": "Harper is captivated by Moon, who is a few years older, when they spend the summer with Olinger, an old mountain man, in eastern Washington, but when Olinger dies mysteriously, Harper's friendship is put to the test. Reprint.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Avon Camelot",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "More Sewing for the Home (Singer Sewing Reference Library)",
        "Authors": "By Singer",
        "Description": "Demonstrates how to make curtains, drapes, duvet covers, dust skirts, padded headboards, shower curtains, and towel embellishments, and discusses useful materials and techniques",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Cy Decosse Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Journey to Terezor",
        "Authors": "By Asch, Frank",
        "Description": "During a devastating flood, Matt and his parents are transported to a mysterious planet--inhabited by other misplaced earthlings and ruled by robots--where Matt teams up with two young geniuses in an effort to escape back to Earth",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Inventing the Truth: The Art and Craft of Memoir (The Writer's craft)",
        "Authors": "By Zinsser, William Knowlton",
        "Description": "",
        "Category": " Reference , Writing Skills",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Psychology in America: A Historical Survey",
        "Authors": "By Hilgard, Ernest Ropiequet",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "6.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Silver in American Life: Selections from the Mabel Brady Garvan and Other Collections at Yale University",
        "Authors": "By Ward, Barbara and Ward, Gerald",
        "Description": "",
        "Category": "",
        "Publisher": "Amer Federation of Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1979"
        }
    },
    {
        "Title": "Mrs. Santa Claus",
        "Authors": "By Ives, Penny",
        "Description": "Santa's resourceful wife delivers the presents on Christmas Eve when he and the reindeer become ill",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "What Will the Weather Be? (Let's-Read-and-Find-Out Science 2)",
        "Authors": "By Croll, Carolyn (ILT) and Dewitt, Lynda",
        "Description": "WeatherWill it be warm or cold?Should we wear shorts or pants?Shoes or boots?Read and find out why the weather is so difficult to predict.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Weather",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Complete Tile",
        "Authors": "By Cory, Steve",
        "Description": "",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Origin: A Novel",
        "Authors": "By Abu-Jaber, Diana",
        "Description": "Lena is a fingerprint expert at a crime lab in the small city of Syracuse, New York, where winters are cold and deep. Suddenly, a series of crib deaths—indistinguishable from SIDS except for the fevered testimony of one distraught mother with connections in high places—draws the attention of the police and the national media and raises the possibility of the inconceivable: could there be a serial infant murderer on the loose?Orphaned as a child, out of place as an adult, gifted with delicate and terrifying powers of intuition, Lena finds herself playing a critical role in the case. But then there is the mystery of her own childhood to solve....Could the improbable deaths of a half-dozen babies be somehow connected to her own improbable survival?The beauty and originality of Diana Abu-Jaber's writing are here accompanied by deft, page-turning narrative tension and atmosphere, tugging the reader to an unforgettable conclusion.",
        "Category": " Fiction , Literary",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Not Guilty",
        "Authors": "By MacDonald, Patricia",
        "Description": "When Keely Bennett's world is shattered by the suicide of her beloved husband, Richard, she and her nine-year-old son Dylan have to start over. Her late husband's childhood friend, Mark Weaver, helps Keely settle Richard's affairs and sweeps her into a whirlwind romance -- and eventually a comfortable suburban lifestyle that includes marriage and a beautiful baby girl.  The darkness that clouded Keely's past has all but vanished. Yet Dylan, now a teenager, remains distant, brooding and resentful of his stepfather and baby sister, Abby. Then history repeats itself, and her life is once again thrown into chaos. But Keely's nightmare is just beginning?for the authorities are looking for a murderer, and they already have a prime suspect: Dylan.  Refusing to believe her son is a killer, Keely vows to clear his name. But the prosecutor has a personal stake in seeing Dylan convicted -- and her pleas for help from the police fall on deaf ears. To save her son, Keely must rely on herself. But she is far from alone; someone is watching her every move. When her investigation threatens to uncover a conspiracy of secrets and corruption, she is suddenly plunged into the path of danger -- and into the sights of a ruthless killer who will stop at nothing to ensure the truth stays buried forever....  Seamlessly weaving a psychological portrait of the bond between a mother and son with the breathless intrigue of a murder mystery, Not Guilty is a novel that finds Patricia MacDonald at the height of her celebrated",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Essential Thomas Jefferson",
        "Authors": "By Thomas Jefferson",
        "Description": "",
        "Category": "",
        "Publisher": "Value Proprietary",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Volunteer Revolution: Unleashing the Power of Everybody",
        "Authors": "By Hybels, Bill",
        "Description": "The future of the local church is directly tied to its ability to attract, equip, and unleash the potential of volunteers in the church Pastor Bill Hybels sees a new reality on the horizon. There is unprecedented spiritual openness in today’s society, and at the same time, increasing economic pressure on the resources of local churches. The solution lies squarely on the able shoulders of God-gifted volunteers. And they are ready for the challenge! Once trained, empowered, and inspired, record numbers of volunteers will take on all new levels of responsibility in the local church, creating a volunteer revolution that will transform churches and communities. The Volunteer Revolution reveals how all of this can happen and how churches can unleash vast amounts of untapped potential. Through real-life volunteer stories, Hybels inspires church leaders in their role as equippers while motivating potential volunteers to align themselves with God’s mission to change the world. The Volunteer Revolution is also available as an unabridged Audio Pages® CD.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Young Fu of the Upper Yangtze",
        "Authors": "By Lewis, Elizabeth F.",
        "Description": "Introduction by Pearl S. Buck. This \"accurate, vivid and well-written story\" (The New York Times ) is about Young Fu, a country boy, who is apprenticed to a master coppersmith when he and his mother move to the city of Chungking during the exciting and often dangerous 1920s.A Newbery Medal Book.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Race: Life's Greatest Lesson",
        "Authors": "By Groberg, Dee and Anderson, Mac (INT)",
        "Description": "An illustrated poem, this is the heart-wrenching story of a boy in a footrace hoping to win, but falling again and again. Each time he wants to give up, knowing, pace by pace, that he has lost any chance of winning and that his dad, watching from a distance, will be disappointed. But each time he gets back up and runs as hard as he can. For inhis heart he can hear the voice of his dad: \"You haven't lost at all; for winning is no more than this, to rise each time you fall.\" As the boy finishes the race, the crowd cheers as loudly for him as for the winner, and his father's proud look is his true reward.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Here's the Bright Side: Of Failure, Fear, Cancer, Divorce, and Other Bum Raps",
        "Authors": "By Rollin, Betty",
        "Description": "Do clouds truly have silver linings? Betty Rollin answers with a resounding yes in this wise, moving, and funny book about the surprising upsides to life’s most challenging, painful, and seemingly insurmountable low blows. Rollin has been there. After being diagnosed with breast cancer more than thirty years ago–and again nine years later–she managed to find an astonishingly bright side to the darkness. She shares her often zany and unpredictable personal experiences of turning the worst into the best, and shows how others have done the same–thriving in adversity to a remarkable degree and coming to recognize their various blessings in disguise.Steve Jobs describes how being fired from Apple, the company he founded, was one of the best things that ever happened to him. Homemaker Sally Fleming made a better life for herself and her family after a fire. Only when workaholic CEO Eugene O’Kelly was diagnosed with a terminal illness did he really begin to live his life to the fullest. Bill Clinton, Charles Colson, and others describe life changes after adversity. Rollin reveals the science behind the theory of adversarial, or post-traumatic, growth. This paradox is not about denying hardship but about finding a way to benefit from it. Seeing the bright enables us to find the good, whatever form it takes, within the bad and proceed from there. Poignant, timely, universal, and inspiring, Here’s the Bright Side proves that amid life’s struggles and losses, there is much to be gained–wisdom, strength, and, perhaps most important, gratitude. “Try feeling gloomy and grateful all at once,” says Rollin. “You can’t. Gratitude picks you up and puts you in a place where gloom cannot thrive.”",
        "Category": " Psychology , Developmental , Adulthood & Aging",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Ten Worst Frauds Against America's Seniors",
        "Authors": "By Richardson, Jed J",
        "Description": "",
        "Category": "",
        "Publisher": "Seniors Coalition",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "North American Indian Mythology",
        "Authors": "By Burland, Cottie Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn Publ Group Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Modern Organizations",
        "Authors": "By Etzioni, Amitai",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Courage Is Contagious",
        "Authors": "By Kasich, John",
        "Description": "A leader of the Republican Party in the U.S. Congress, where he represents Ohio, presents twenty profiles in courage of exemplary Americans who have improved the lives of their fellow citizens without the help of the government.",
        "Category": " Social Science , Volunteer Work",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Webbles Storybook World: Welcome to Weebalot",
        "Authors": "By Edgers, Geoff and Tugeau, Jeremy (ILT)",
        "Description": "An easy-to-read narrative brings the Fab Four to life, discussing their childhoods in Liverpool, England, their first forays into rock music, what Beatlemania was like, and why they broke up.",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "20,000 Leagues Under the Sea (A Stepping Stone Book(TM))",
        "Authors": "By Verne, Jules and Conaway, Judith (ADP)",
        "Description": "An adaptation of the nineteenth-century science fiction tale of an electric submarine, its eccentric captain, and the undersea world, which anticipated many of the scientific achievements of the twentieth century.",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Who Stole the Wizard of Oz?",
        "Authors": "By Avi and James, Derek (ILT)",
        "Description": "One of Newbery Honor author Avi's most popular middle-grade mysteries is available in paper once again.  The mystery revolves around a rare edition of The Wizard of Oz missing from the local library. When Becky is accused of stealing it, she and her twin brother Toby set out to catch the real thief and prove her innocence. Clues cleverly hidden in four other books lead to a hidden treasure--and a gripping adventure.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Here's Hope: New Testament, New King James Version",
        "Authors": "By Bible",
        "Description": "No ministry, outreach, or evangelism program can afford to be without these convenient and economical New Testaments. Features include: Plan of Salvation, easy to read print, and value pricing.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Holman Bible Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Free from Bondage God's Way: Galatians/Ephesians (The International Inductive Study Series)",
        "Authors": "By Arthur, Kay",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Joy of Following Jesus",
        "Authors": "By Sanders, J. Oswald",
        "Description": "",
        "Category": "",
        "Publisher": "Billy Graham Evangelistic Asso",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Establishment Clause: Religion and the First Amendment",
        "Authors": "By Levy, Leonard W.",
        "Description": "Examines the portion of the First Amendment providing for separation of church and state, discusses the history of the clause, and offers a modern interpretation",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Dragon Rising: An Inside Look at China Today",
        "Authors": "By Becker, Jasper",
        "Description": "Jasper Becker's book, The Chinese, was hailed as the best single-volume introduction to this enormous, inscrutable society. The Washington Post said, \"He has been everywhere and asked every question,\" describing his conclusions as \"right in both details and analysis.\" Since then, China's role in world affairs has only grown greater. No nation on Earth is as newsworthy as 21st-century China?and no book could be timelier than Dragon Rising, appearing just as world attention begins to focus on the 2008 Beijing Olympics and China's all-out effort to present itself as a modern world power. As interest grows, Becker is the ideal guide to the profound changes that are already reshaping economic, diplomatic, and military strategies all over the globe.  Intertwining in-depth analysis with revealing anecdotal evidence, Becker addresses every major question. What form will China's government take? How will communism's legacy affect modernization? Can Shanghai's success with urban capitalism be replicated elsewhere? Will wholesale cultural and economic change be resisted by the millions facing sudden transition from an authoritarian state to a market-driven society? How will the new China cope with pollution, unemployment, and voracious demand for energy? Each chapter examines a specific region and such key local issues as poverty, minority unrest, and official corruption, then places them in the broader context of Chinese society as a whole. Vividly illustrated with photographs that capture the paradox of an ancient culture remaking itself into a dynamic consumer society, Dragon Rising is a wonderfully written, well-rounded, wide-ranging portrait of China's problems and prospects.",
        "Category": " History , Asia , China",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Handbook of Stress",
        "Authors": "By Goldberge",
        "Description": "",
        "Category": "",
        "Publisher": "Free Press",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "Our Bodies Ourselves for the New Century",
        "Authors": "By Health, Boston Womens",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster Trade",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "American Medical Association Women: HOW TO UNDERSTAND SYMPTOMS",
        "Authors": "By Clayman, Charles B. (EDT), Kunz, Jeffrey R. M. (EDT), and American Medical Association (COR)",
        "Description": "Describes symptoms of common ailments, including those conditions related to pregnancy and menstruation, explains when a doctor should be consulted, and suggests self-treatment for minor problems",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Random House",
        "Price Starting With ($)": "9.2",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Galactic Derelict",
        "Authors": "By Andre Norton",
        "Description": "",
        "Category": "",
        "Publisher": "The World Publishing Company",
        "Price Starting With ($)": "96.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "The reindeer book",
        "Authors": "By Battaglia, Aurelius",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "The Courage to Raise Good Men",
        "Authors": "By Silverstein, Olga and Rashbaum, Beth",
        "Description": "Calling into question the necessity of \"male role models,\" an experienced psychologist shows how our culture sanctions the emotional blighting of young males, offering advice for transforming mother-son relationships and gender roles. 35,000 first printing. $35,000 ad/promo. Tour.",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Life After Graduation: Financial Advice & Money Saving Tips",
        "Authors": "By Arndt, Terry, Ricchini, John",
        "Description": "",
        "Category": "",
        "Publisher": "Life After Graduation, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Rush Limbaugh Is a Big Fat Idiot: And Other Observations",
        "Authors": "By Franken, Al",
        "Description": "In the grand satirical tradition of Swift, Rabelais, and Twain comes...Rush Limbaugh Is a Big Fat Idiot, and Other Observations...a scathing--but uncompromisingly fair--look at America's largest talk show host and the rest of the Republican right.        Penned by the Emmy award-winning Saturday Night Live writer whom John Podhoretz of the New York Post has called \"the man responsible for some of the most brilliant political satire of our time,\" Rush Limbaugh Is a Big Fat Idiot tackles the issues--and the politicians--in ways few have dared...        Exploding Medicare Costs: \"Why not shoot the elderly into space?  Stay with me.  Because I'm not just thinking about the budget here.  I'm talking about science.  Just think how many more manned space operations NASA could undertake if they didn't have to worry about getting the astronauts back.\"        Crime: \"I have a radical gun-buyback idea that I guarantee would be a huge success.  Here's how it works: hand in a gun, get a free vial of crack.\"        Newt Gingrich: \"Many of us, like Newt, have acknowledged smoking dope and reading Toffler in the early 70s.  But after reading his book, I think Newt's dirty little secret is that he smoked dope and watched The Jetsons.\"        Phil Gramm: \"If you get beyond the fact the Gramm is ugly, mean, hypocritical, has a boob fetish, and drives his wife like a mule, he does have a certain folksy charm.\"        On the subject of Rush Limbaugh, Franken lets the facts speak for themselves. Listen to Rush, the \"rugged individualist\" and enemy of government handouts, explain how his second wife made him stop sitting around the house eating just food and go file for unemployment insurance.  And learn all of Rush's several explanations for how he avoided the draft.        Of course, when it comes to draft-dodging Republicans, Rush isn't alone. Reading Al's Vietnam short story, \"Operation Chickenhawk,\" you'll savor the exploits of Privates Limbaugh, Gramm, Quayle, Buchanan, Gingrich, and George Will as Lieutenant Oliver North leads them kicking and screaming into combat.        And don't miss Al's informative discussion with the man who has \"the easiest job in America\": Rush Limbaugh's fact-checker.  And much, much more.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "1,003 Great Things About Getting Older",
        "Authors": "By Hodgman, Ann, Marx, Patricia, Owen, David, and Birnbach, Lisa (EDT)",
        "Description": "Grandma Moses was old. Methuselah was old. Bob Hope was old. But boomers getting gray hairs and wrinkles? It can't be!Aging has been a normal human condition since the dawn of humankind, but for the boundless boomer bulge hitting its thirties, forties, and fifties, giving aging angst a whole new meaning. In this hilarious book, well-known humor writers Lisa Birnbach, Ann Hodgman, Patricia Marx, and David Owen have brought together countless reasons for their maturing compatriots to look on the bright side of getting older. 1,003 Great Things About Getting Older will convince you that aging isn't so bad. Finally you can eat dinner at 4:00. Your Pineapple Pez Dispenser is worth $900. Chances grow smaller every year that you will die in childbirth. You'll learn about nonagenarians like the Delaney sisters, Henny Youngman, and Douglas Fairbanks, Jr., and the secrets of the very old (yogurt, scotch, and pain killers). All in all, the book is a compendium of humor, trivia and real information.1,003 Great Things About Getting Older is a perfect feel-good gift to raise the spirits of anyone concerned about a few wrinkles or gray hairs.",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Grill Italian",
        "Authors": "By Wright, Clifford A.",
        "Description": "Italian-style grilling goes beyond meat and poultry. There's an entire chapter on vegetables every which way in Grill Italian. Tomatoes are stuffed with bread, garlic, and herbs before grilling. Artichokes are grilled and drizzled with lemon juice and oregano. Italians do extraordinary things with seafood, too. Even the simplest grilled shrimp is unforgettable. And what do you serve with your classic Grilled Tuna \"Originata\"? In Grill Italian you will find a chapter of traditional pasta and salad accompaniments.In his introduction, Wright tackles the burning questions about grilling: Which makes better-tasting food, gas or charcoal? Supermarket briquets or hard-to-find hardwood lump charcoal? It doesn't really matter, Wright says. The reason food tastes good when grilled is that fat drips down on hot coals or lava rocks and returns in the form of smoke to flavor the food.While your backyard may not overlook the azure waters of the Tyrrhenian Sea, with Grill Italian you can bring the intense, natural flavors of Italian grilling to your table.",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Sporting News Selects Baseball's Greatest Players: A Celebration of the 20th Century's Best (Sporting News Series)",
        "Authors": "By Smith, Ron and Mays, Willie (FRW)",
        "Description": "Provides a ranking of the 100 greatest baseball players of the twentieth-century",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Sporting News",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Hugo's Les Miserables (Cliffs Notes)",
        "Authors": "By Klin, George and Marsland, Amy Louise",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.In CliffsNotes on Les Miserables, you examine two themes from Victor Hugo&#39;s epic: the struggle between good and evil in the soul of one man, and society&#39;s struggle toward a greater good. Addressing many of the social issues of his day, Hugo wrote this novel, which traces the path of Jean Valjean as he changes from convict to saint. Hugo believed in the spiritual possibilities of human beings and has chosen the story of the poor and outcast to illustrate this \"perfectibility of man.\"With expert commentaries and critical analyses, this study guide helps you explore the profound social problems of the early 1800s, which influenced Hugo&#39;s work. You&#39;ll also gain insight into the author&#39;s life and other major works. Other features that help you study includeIntroduction to the novelA brief synopsis of the novelChapter summaries and analysesAn Interactive quiz to test your knowledgeEssay topics and review questionsClassic literature or modern-day treasure—you&#39;ll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Book Notes",
        "Publisher": "CliffsNotes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1968"
        }
    },
    {
        "Title": "The authority of the Bible, (The library of constructive theology)",
        "Authors": "By Dodd, C. H.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Brothers",
        "Price Starting With ($)": "14.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1929"
        }
    },
    {
        "Title": "Lyle 1,001 Antiques Worth a Fortune",
        "Authors": "By Curtis, Tony",
        "Description": "A guide to collectibles and antiques features information on everything from bus tickets, to milk bottles, to menus and includes black-and-white photographs and current market values. Original.",
        "Category": " Art , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Wedgwood Ware (A Ward Lock Collectors Monograph)",
        "Authors": "By Kelly, Alison",
        "Description": "",
        "Category": "",
        "Publisher": "Littlehampton Book Services Ltd",
        "Price Starting With ($)": "13.16",
        "Publish Date": {
            "Month": "September",
            "Year": "1970"
        }
    },
    {
        "Title": "Adventures In Odyssey Passages Series: Arin's Judgment (Adventures in Odyssey 2)",
        "Authors": "By McCusker, Paul",
        "Description": "At the end of World War II, Wade is transported to a war-torn alternate world called Marus, where he finds himself a key figure in a political power struggle and unwittingly helps to bring the Unseen One's judgment on a corrupt people.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Basic Watercolor Techniques",
        "Authors": "By Albert, Greg (EDT), Wolf, Rachel (EDT), and Rubin Wolf, Rachel (EDT)",
        "Description": "Intended for beginners, this book offers suggestions on equipment and techniques for creating different textures, and gives tips on how to actually see what is being painted",
        "Category": " Art , Techniques , Watercolor Painting",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Country Pine Furniture",
        "Authors": "By King, Constance",
        "Description": "",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "The pictorial encyclopedia of antiques",
        "Authors": "By Durdík, Jan",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "American Junk",
        "Authors": "By Carter, Mary Randolph",
        "Description": "For anyone who reads the local Pennysaver or swap sheet, for anyone who can't drive by a yard sale without turning in, for anyone on lookout for treasures in Grandma's attic, or for anyone who just likes to collect - welcome to American Junk, the bible for a new generation of foragers.\" Author Mary Randolph Carter, herself a passionate \"junker,\" takes us on a tour of tag sales, auctions, and flea markets around the country, where she and other devotees of the sport have discovered unique and remarkable items that they then transform from bargains to prized booty. She introduces us to and takes us into the homes of these unusually creative people, who share her belief that thrift, economy, and ingenuity translate into high style indeed.There are before-and-after pictures, tips on repair and storage hints on how to bargain, ideas for themed collections and even a list of what to bring on junking expeditions. The author reveals the price of almost every one of the hundreds and hundreds of items pictured, and best of all provides a directory to more than two \"junking sites\" nationwide.American Junk is a one-of-a-kind book for those who appreciate the rare, the idiosyncratic, and the unexpected - those who realize that there are as many kinds of junk as there are individuals.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Studio",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Powerful Reforms with Shallow Roots: Improving America's Urban Schools",
        "Authors": "By Usdan, Michael D. (EDT), Cuban, Larry (EDT), and Hale, Elizabeth L. (FRW)",
        "Description": "",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Teachers College Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Ice Age 2: Geyser Blast! (I Can Read Book 2)",
        "Authors": "By Artful Doodlers (ILT) and O'Ryan, Ellie",
        "Description": "On their quest to find the giant ark, Manny, Sid, and Diego and their new friends must cross a dangerous geyser field. Will this makeshift herd make it across, or will the bubbling geysers mean the untimely end of their journey?",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Fires of Merlin (Merlin Saga)",
        "Authors": "By Barron, T. A.",
        "Description": "",
        "Category": "",
        "Publisher": "Philomel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Raising Strong Daughters",
        "Authors": "By Gadeberg, Jeanette",
        "Description": "A delightful, upbeat compendium of tips for parents.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Fairview Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Busy but Balanced: Practical and Inspirational Ways to Create a Calmer, Closer Family",
        "Authors": "By Doe, Mimi",
        "Description": "The ideas in Busy but Balanced are for the people who need them the most-those of us out in the world putting our longings, goals, and ideas into action and balancing that with creating a nourishing home and deeply connecting with our children.  It's not about giving up desire but, instead, creating a right relationship with all aspects of ourselves and our world.  Rather than breathlessly grasping at the shards of our lives, we can boldly and calmly expand to embrace all aspects of it-alert and relaxed.A mother of two young children expressed what many of us feel:  \"I want a simple life; I want a busy life.  I don't want it cluttered with junk, but I want it vibrant.  My relationship is with my family, and I want that at the core of my life; but I also want meaningful work. My family is forever so I want that to thrive, but I want the day in and day out at work to be good too.\"Fear of change locks many of us into rote living-treadmill days.  Busy but Balanced, a practical and inspirational guide, will help you take action month by month, manage change, even invite it in, to create a full life lived with no regrets.  Making choices allows you to live sanely with more joy, energy, and success-without sacrifice.  ---From the Introduction",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Leaving No Child Behind?: Options for Kids in Failing Schools",
        "Authors": "By Hess, Frederick M. (EDT) and Finn, Chester E., Jr. (EDT)",
        "Description": "The NCLB is the signal domestic policy initiative of the Bush administration and the most ambitious piece of federal education legislation in at least thirty-five years. Mandating a testing regime to force schools to continually improve student performance, it uses school choice and additional learning resources as sticks and carrots intended to improve low-performing schools and districts. The focus is on improving alternatives to children in low-performing schools.Here top experts evaluate the potential and the problems of NCLB in its initial stages of implementation. This first look provides valuable insights, offering lessons crucial to understanding this dramatic change in American education.",
        "Category": " Political Science , Public Affairs & Administration",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Managing Pain Before It Manages You",
        "Authors": "By Caudill, Margaret A., M.D.",
        "Description": "Imagine finding a way to reduce the amount of time you spend in doctor's offices, and to decrease the discomfort, depression, and anxiety associated with chronic pain. In «MDBR»Managing Pain Before it Manages You, Margaret A. Caudill offers just that\\m-\\a program designed to help you develop skills for coping with pain so you can enjoy a fuller life. Carefully conceived from the author's many years of working with chronic pain sufferers, this program has been proven effective and is currently in use at the Deaconess Hospital in Boston, Massachusetts and the Hitchcock Clinic in Nashua, New Hampshire. Participants report that they have been able to take control of their pain and cut their doctor visits by more than one-third for up to two years following the program!.",
        "Category": " Psychology , Mental Health",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Tired of Yelling: Teaching Our Children to Resolve Conflict",
        "Authors": "By Waugh, Lyndon D., M.D. and Sweitzer, Letitia",
        "Description": "ARE YOU TIRED OF THE YELLING? TIRED OF THE CONSTANT CONFLICT AT HOME, AT SCHOOL...EVEN AT WORK?  In Tired Of Yelling, renowned family psychiatrist Lyndon D. Waugh offers the solution for more peaceful homes and classrooms, offering parents the lifelong gift of teaching their children the most valuable lesson they can ever learn: how to get along with other people.  Dr. Waugh's simple fifteen-step model shows parents how to teach their children to:  assess their emotion and gauge its intensity be angry while behaving well listen actively admit fault brainstorm solutions make acceptable decisions.   This practical and easy-to-understand book provides specific teaching language for each age group-from infants to teens-so you'll know exactly what to say and how to say it. Complete with strategies for overcoming a child's resistance and sections on motivation, defensiveness, discipline, and \"goat getting,\" Tired Of Yelling helps parents defuse tension and achieve something truly priceless-an emotionally stronger and happier child.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Parenting an Only Child: the Joys and Challenges of Raising Your One and Only",
        "Authors": "By Newman, Susan",
        "Description": "Is it possible to raise a contented only child?  Can we be happy with only one child?  The answer to both of these questions is a resounding yes.In recent years, the number of couples choosing to have one child has risen sharply. Whether it's by choice or fate, having a single child presents unique considerations, opportunities, and advantages. Social psychologist Susan Newman, who has been studying single-child families since the 1980s, shatters the myths of the lonely, spoiled only child, and provides in-depth coverage of the critical issues including:•  Making the right family size decision for you•  Withstanding the pressure to have another•  Maintaining a balance of power in a three-member household•  Single-parenting the only child•  Setting boundaries with a child who is used to having your undivided attention•  Fostering high achievement, creativity, and independence in only children •  The effects of having parents, instead of siblings, as role models•  Confronting age-old only-child stereotypes •  Building family networks and other support systems for the futurePresenting fascinating findings and family stories, Dr. Newman shares her knowledge and gives down-to-earth advice, making this the most accessible, up-to-date handbook of its kind. For couples who are already raising an only child, or for those who are exploring the option, Parenting an Only Child offers encouraging clarity and singular insight. Now with a new resource section.",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Celebrating Family Milestones: By Making Art Together",
        "Authors": "By Linesch, Debra, Ph.D.",
        "Description": "As each family grows and develops, everyone experiences the challenge of changes and transitions. Although adults frequently have trouble coping with change, it can be much more difficult for a child. Even birthdays, temporary separations or friends moving away can result in confused feelings that are very difficult for children to express and handle by themselves. The basic message of Celebrating Family Milestones is that families can communicate with each other and provide mutual support by making art together.    The author is a professional psychologist who has used art therapy to reach children with serious problems they were unable to deal with verbally. She has applied the same techniques to help families (including her own) weather transitions and grow closer and stronger.    This book deals with two major problems that impede communication: lack of time together and the difficulty of expressing            feelings through words alone. By taking time on a regular basis to make art together, families participate in an enjoyable activity that provides the setting for communication. Making art together helps family members to express feelings with more than just words, which are often so difficult to find, especially for children.    Although children will usually say they're okay, they often hide the fear or confusion they feel inside. In their art children will express - often unconsciously - what they really feel. The results provide valuable clues for parents, who can use this opportunity for discussion and reassurance if necessary.    Projects cover a wide range of family experience, including the birth of a new baby, the death of a grandparent, a temporary separation during a parent's business trip, the celebration of New Year's and the importance of the family tree. Every project is complete in itself, yet the author leaves room for             improvisation to suit each family's particular situation.    Celebrating Family Milestones will be welcomed by parents and educators alike. The simple but distinctive projects require no particular skill and no expensive materials. The emphasis is on the process of working together to make art and the feelings expressed through this activity, rather than the final product. However, many of the pieces made with the help of this book will ultimately become family treasures, rich with memories and associations.",
        "Category": " Family & Relationships , General",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Right From Birth: Building Your Child's Foundation For Life",
        "Authors": "By Ramey, Craig T.",
        "Description": "",
        "Category": "",
        "Publisher": "Goddard Press, Inc.",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Birthright (Song of Acadia #3)",
        "Authors": "By Oke, Janette and Bunn, T. Davis",
        "Description": "Since their reunion, Nicole and Anne have moved from \"sisters\" to best friends, but when Anne and her young son follow Nicole to their uncle Charles's English estate to become his heirs, they struggle to overcome the trials of keeping their birthright secret. Simultaneous.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Mad Kestrel",
        "Authors": "By Massey, Misty",
        "Description": "A rip-roaring pirate romance and mysteryIn a world where infants with magical powers are torn from their parents to be raised by the mysterious and powerful Danisoba, who have a monopoly on magic, Kestrel has managed to keep her abilities concealed—and herself free. First hiding in back alleys as a street urchin, she hid when they killed her parents, and then served as a young tavern maid before escaping to sea, where magic is cancelled by water. Now an adult, as the quartermaster of a pirate ship, Kestrel loves the freedom of living on the seas. But her way of life could end if anyone on board learns her closely guarded secret—that she has magical control over the wind. One day a black ship appears, and her life changes. Its captain is a handsome rogue of whom Kestrel is strangely, constantly aware. When Kestrel's captain is led into a trap and is arrested, she gathers her crew and sets sail in relentless pursuit. . . .",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "How to Deal with Annoying People: What to Do When You Can't Avoid Them",
        "Authors": "By Phillips, Bob and Alyn, Kimberly",
        "Description": "A look at personality styles and personal interactions determines why people are annoyed by others, why others are annoyed by them, and what they can do to create better relationships by employing biblical principles and identifying social cues.  Original.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Fire on the Waters : A Novel of the Civil War at Sea",
        "Authors": "By Poyer, David",
        "Description": "The year is 1861, and America shudders on the brink of disunion. Elisha Eaker, scion of a wealthy Manhattan banking family, joins the Navy against his father's wishes. He does it as much to avoid an arranged marriage to his cousin, Araminta Van Velsor, as to defend the flag.  Eli meets Lieutenant Ker Claiborne aboard the sloop of war U.S.S. Owanee. An Annapolis graduate who's seen action in the West Indies and the Africa Station, Claiborne is cool and competent in storm and battle, but he now faces an agonizing choice between the Navy he loves and his native Virginia. Whichever road he takes, he'll be called a traitor.  With authentic nautical and historical detail, master sea-yarner David Poyer follows Eli, Araminta, Ker, and their loved ones and shipmates into a maelstrom of divided loyalties, bitter partings, stormy seas, governmental panic, political blundering, and, finally, the test of battle as the bloodiest and most divisive war in American history begins.",
        "Category": " Fiction , War & Military",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Thriving: The Complete Mind/Body Guide for Optimal Health and Fitness for Men",
        "Authors": "By Ivker, Robert S. and Zorensky, Edward",
        "Description": "Thriving is a comprehensive, user-friendly guide to holistic treatments and therapies, showing men how to attain balance in all aspects of life - from physical fitness and creative and professional satisfaction to spiritual well-being. Once this is accomplished, any man can start a positive chain reaction within his body and mind, leading to a state of thriving. By attaining peak health, men can find themselves achieving more and enjoying more, in all aspects of their lives.In the second half of the book, the authors discuss twenty of the most common ailments of men of all ages, from prostate cancer and back pain to depression, and provide proven therapies that combine self-healing principles with effective alternative and conventional treatments.",
        "Category": " Health & Fitness , Men's Health",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "It Worked For Me: 1001 Real-Life Pregnancy Tips",
        "Authors": "By Kennedy, Michelle and McClellan, Maddy (ILT)",
        "Description": "An experienced mom who is also a syndicated journalist advises on ways to cope with pregnancy's many pitfalls, from morning sickness and food cravings to that moment when waters break. Author Michelle Kennedy adds her own pregnancy problems and their solutions to those of hundreds more moms, and the result is this lighthearted, wisdom-infused look at pregnancy and how to cope with it. Ginger tea for morning sickness, squatting and swimming exercises, a list of healthful snacks to deal with unusual food cravings&#151;these are just a few among the 1001 tips to help make pregnancy bearable. Among the book's many topics are&#151;What to eatWhat to wearCoping with the medical stuffPreparing for labor . . . and much moreIt Worked for Me gives expectant moms the tips that have actually worked in practice when they were tried by mothers who came through their pregnancies happy and healthy.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Poland (Eyewitness Travel Guides)",
        "Authors": "By Czerniewicz-Umer, Teresa, Omilanowska, Malgorzata, and Majewski, Jerzy S.",
        "Description": "Presents a travel guide to Poland, featuring places to eat, places to stay, directions, and maps.",
        "Category": " Travel , Europe , Eastern",
        "Publisher": "DK Adult",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "The Bullfighter Checks Her Makeup: My Encounters with Extraordinary People",
        "Authors": "By Orlean, Susan",
        "Description": "In a collection of essays from The New Yorker, the acclaimed author of The Orchid Thief offers a series of intriguing profiles of some of the colorful people she has encountered, from the first female Spanish matador to the African king who drives a New York City cab to Silly Billy, a popular entertainer on the children's birthday-party circuit. 50,000 first printing.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Expecting Fitness: How To Modify And Enjoy Your Exercise Program Throughout Your Pregnancy",
        "Authors": "By Gallo, Birgitta and Ross, Sheryl, M.D.",
        "Description": "Current research has proven that it is not only safe for pregnant women to exercise, it is absolutely beneficial. Even if you are considered a high-risk pregnancy or are restricted to bed rest, you can and should exercise during this crucial time. This book includes specially designed exercises just for you. Among the benefits of exercise and proper nutrition during pregnancy:-Shorter, less painful labor-Fewer birth defects-Less excess weight gain-Ease of regaining pre-pregnancy figure-Healthier, calmer, and more intelligent babiesBirgitta Gallo's Expecting Fitness doesn't lead you through some leg lifts. It shows you how to modify your current sports activities-including tennis, golf, aerobics, swimming, even kickboxing-safely throughout your pregnancy. It also includes nutritional guidelines, relaxation and breathing techniques, and an illustrated guide to the changes the pregnant body goes through. It is a unique and comprehensive guide for any woman who wants to give her baby the best possible start in life.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Renaissance Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Rage of a Demon King (Serpentwar Saga)",
        "Authors": "By Feist, Raymond E.",
        "Description": "Erik von Darkmoor has trained well and fought valiantly in the service of the Prince - and has risen up through the ranks to become a respected leader of men. Though still young in years, both he and boyhood friend Rupert \"Roo\" Avery - one of Krondor's preeminent merchants and one of the Kingdom's richest men - have been aged by experience. And each has an essential role to play in the cataclysm that is to come - as has every warrior, tradesperson, thief, spellweaver, spy, royal, and subject alike who stands to lose far more than life alone to the invading forces of darkness.For a demon king has escaped a world already devoured to feed on one consumed by chaos and war. A foul and terrifying thing, a nightmare creature of dark and murderous nature, it seeks to own and corrupt the very source of life itself. And soon more of its dread kind will follow - unless the most powerful sorcerers in the embattled realm can close forever a demon-spilling rift...and unlock a mystery far more dangerous and profound than anything ever known before.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Fast Food Facts: Complete Nutrition Information on More Than 800 Menu Items in 16 of the Largest Fast Food Chains (Pocket Edition)",
        "Authors": "By Franz, Marion J.",
        "Description": "Tables list calories, exchange values, and the carbohydrate, protein, fat, cholesterol, and sodium contents for a variety of fast foods",
        "Category": "",
        "Publisher": "Chronimed Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "All That Glitters",
        "Authors": "By Tryon, Thomas",
        "Description": "Tells the stories of Babe, Schaatzi, April, Maude, and Clare--five famous actresses whose lives are touched by the famous agent, and lover, Frankie Adano",
        "Category": "",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "The Greatest Joke Book Ever",
        "Authors": "By Greene, Mel",
        "Description": "What do you call a woman who knows where her husband is every night?A widow!Golf got its name because all the other four-letter words were taken. Here's the most massive melding of mirth ever minted! Hundreds of jokes, stories, and other tomfoolery on every subject from cars to kids, from sports to business, from politics to the Pearly Gates. Tell'em to your friends or keep'em to yourself -- this book has more jokes than Lessie has fleas!How do you save a drowning lawyer?Take your foot off his head!If love is blind, why is lingerie so popular?C'mon. You can do it. Take this book to the cash register -- and take home enough jokes to meet your minimum daily humor requirement for the whole millennium!",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Every Young Woman's Battle: Guarding Your Mind, Heart, and Body in a Sex-Saturated World (The Every Man Series)",
        "Authors": "By Ethridge, Shannon and Arterburn, Stephen",
        "Description": "Guys Aren’t the Only Ones Fighting a Battle for Purity. The world you live in promotes sex as the answer to just about everything. The pressure to go along with the crowd is greater than ever before, and it’s easy to compromise in little ways that are a lot more harmful than they seem. You and your friends may become caught up in destructive relationships or sexual activities without even knowing how you got there. You just want to be normal–to fit in, to be liked, to look attractive to the opposite sex. But are you paying too high a price? This counterpart to the award-winning Every Young Man’s Battle can help you:· learn how the sexual battle begins in your heart and mind· understand your hunger for attention from guys· recognize and avoid the potential pitfalls awaiting young women on the journey toward adulthood and possibly marriage· find out how the media, novels, fashion, internet chat rooms, and body and beauty obsessions influence your sexual choices–and what you can do about it· guard your mind, heart, and body against sexual and emotional compromise· develop a deeper, more satisfying level of intimacy with God Whether you have so far protected yourself emotionally and sexually, feel that you’ve been robbed of your purity, or have given in to temptation in some way, this book can help you achieve or reclaim sexual integrity. It can also guide you through the temptations and pressures of young adulthood while demonstrating how you can live your life to the fullest–without regrets.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Waterbrook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Health 4 Life (First Place)",
        "Authors": "By Wilkinson, Jody, M.D.",
        "Description": "All you need to know about healthy living, living a healthy, balanced lifestyle - physical, spiritual, emotional and mental is much easier, and infinitely more rewarding than most people imagine. The key to reaching the goal is total wellness, which is what \"Health 4 Life\" is all about. Full of practical pointers and encouraging insights, this is a welcome resource for everyone who wants to achieve a balanced, healthy way of life. First Place users know the value of this resource and millions more will welcome its excellent health tips and practical eating helps. A full spectrum of wellness-related topics are covered - how to eat healthy while traveling or dining out; understanding and preventing cancer, heart disease and high cholesterol.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Gospel Light Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Mothers and Sons: Raising Boys to Be Men",
        "Authors": "By Lush, Jean and Vredevelt, Pamela",
        "Description": "How can mothers help rambunctious little boys grow up to be well-adjusted adults? What kind of goals should they have for raising their sons? Are there skills mothers can learn that will make child rearing more enjoyable? Mothers and Sons, available for the first time in mass market, answers these and other questions with reliable and effective counsel.   Family therapists Jean Lush and Pam Vredevelt present guidelines for instilling self-control, maturity, and morality into a young boy's identity. Especially helpful are the descriptions of normal developmental and sexual phases of boys from infancy to the teen years and discussion on how to best handle the difficult issues of each stage. Special chapters for single moms and step-moms are included as well.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Original Pizza and Pasta Cookbook",
        "Authors": "By Kalenuik, Ron",
        "Description": "",
        "Category": "",
        "Publisher": "Magnanimity House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Safe House: A Burke Novel",
        "Authors": "By Vachss, Andrew H.",
        "Description": "The new novel from Andrew Vachss puts Burke - hard-core career criminal and man-for-hire - up against a new breed of predator: stalkers. Some obsessed, some deranged, all dangerous.Burke's old prison pal Hercules, hired by a shadowy network that runs a safehouse for stalking victims, botched the job, and one of the stalkers is dead. To save his partner, Burke has to penetrate the network, and he makes a deal with the boss, Crystal Beth, a woman as obsessed as the stalkers. But Crystal Beth has a stalker of her own, an extortionist who threatens to bring down her entire network unless she surrenders one of the women she's hiding.When Burke learns that the extortionist might be government-issue, and that the stalker he's protecting is a member of a neo-Nazi cell with plans to make Oklahoma City look like a pipe bomb, his survivalist instincts go on full alert. And when it comes down to making his own house and his family-of-choice safe, Burke turns lethal.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Golden Book of All of Paris",
        "Authors": "By Ca Berti Luciano C",
        "Description": "",
        "Category": "",
        "Publisher": "Bonechi",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Man Who Walked Like a Bear: An Inspector Porfiry Rostnikov Novel",
        "Authors": "By Kaminsky, Stuart M.",
        "Description": "Inspector Porfiry Rostnikov and his colleagues battle against a conspiracy to assassinate a politburo member, a bomb scare at Lenin's tomb, and abounding corruption",
        "Category": " Fiction , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Mediaeval Feudalism",
        "Authors": "By Carl Stephenson and Foreword-G",
        "Description": "",
        "Category": "",
        "Publisher": "Great Seal Books",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "The Mediterranean Diet Cookbook: A Delicious Alternative for Lifelong Health",
        "Authors": "By Jenkins, Nancy Harmon",
        "Description": "Discussing the nutritional and health benefits of Mediterranean culinary practices, this delectable cookbook presents two hundred recipes for simple traditional dishes from all over the region, all adapted for the modern American kitchen.",
        "Category": " Cooking , Regional & Ethnic , Mediterranean",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Pooh and Friends (Look and Find Books)",
        "Authors": "By Publications International staff",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Close to Home Unplugged: The Second Close to Home Anthology",
        "Authors": "By McPherson, John",
        "Description": "Think of reality. Yeah, we know--it's not the easiest thing in the world to think about, but humor us. Now think of reality as a rubber band. Now think of twisting, stretching, and otherwise contorting that rubber band until it's almost to the breaking point. That's what creator John McPherson does in his hilarious tribute to the absurdities of life, Close to Home.The characters in Close to Home populate a world where one mistake in a personalized license plate can mean the difference between LASER and LOSER, where wedding photos are displayed in \"Magic Eye\" format, where fed up mothers install speed bumps in the living room, and where do-it-yourself floor tiles are shaped like jigsaw puzzle pieces. In short, a world only slightly more absurd and exasperating than our own!Close to Home Unplugged features comics from Home: The Final Frontier, The Honeymoon is Over, and The Silence of the Lamberts",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Change Of Command (The Serrano Legacy)",
        "Authors": "By Moon, Elizabeth",
        "Description": "Rejuvenants fear the backlash caused by bad drugs; they want to ensure that nothing interferes with their pursuit of long life - or the profit that comes from promising it to others. Neighbor states fear the aggressive expansion of the Familias Regnant, fuelled by population growth and extended lifespan. With the Regular Space Service, those who have received experimental rejuvenations fear they may have been given bad drugs on purpose. Esmay Suiza's family fears that her marriage to an offworlder will damage their position. Barin Serrano's family fears that his marriage to a Landbride of Altiplano will damage his career and their reputation.Fear begets violent reactions - from foreign governments, from great Families determined to maintain or increase their power, from internal rivalries in the Fleet - and nothing escapes the resultant bloodbath unscathed. As Esmay and Barin struggle to reconcile their families, others have more cosmic struggles to win.",
        "Category": " Fiction , Science Fiction , Space Opera",
        "Publisher": "Baen",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Classic Chinese: Authentic Dishes from the Orient (Classic Cooking Series)",
        "Authors": "By Hsiung, Deh-Ta (INT)",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Penny Whistle Children's Party Planner",
        "Authors": "By Brokaw, Meredith",
        "Description": "",
        "Category": "",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "The Optimistic Child: Proven Program to Safeguard Children from Depression & Build Lifelong Resilience",
        "Authors": "By Seligman, Martin E. P., Reivich, Karen, Jaycox, Lisa, and Gillham, Jane",
        "Description": "Despite the increased focus on self-esteem over the past three decades, depression in children has continued to grow, now affecting a quarter of all kids today. To combat this trend, Dr. Seligman began the Penn Depression Prevention Project, the first long term study aimed at 8 to 12 year olds. His findings were revolutionary, proving that children can be against depression by being taught how to challenge their pessimistic thoughts.   The Optimistic Child offers parents and teachers the tools developed in this study to teach children of all ages life skills that transform helplessness into mastery and bolster self-esteem. Learning the skills of optimism not only reduces the risk of depression but boosts school performance, improves physical health, and provides children with the self-reliance they need as they approach the teenage years and beyond. world of optimists is a bigger world, a world of more possibilities, says Seligman. Filled with practical advice and written in clear, helpful language, this book is an invaluable resource for caregivers who want to open up this world for their children.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "HarperPb",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "RIBS: Over 80 all-American and international recipes for ribs and fixings (Harmony Particular Palate Cookbooks)",
        "Authors": "By Friedland, Susan R.",
        "Description": "Presents a variety of recipes for pork ribs and appropriate side dishes such as potatoes, vegetables, salads, breads and desserts",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "Harmony Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "Party Appetizers: Small Bites, Big Flavors",
        "Authors": "By Pearson, Victoria (PHT) and Ritchie, Tori",
        "Description": "With today's magazines singing the praises of graze-style eating as both healthy and fun,Party Appetizers offers the perfect way to treat guests. Entertaining aficionado Tori Ritchie serves up sensational recipes for fabulous finger foods to kick off any informal dinner or stylish celebration -- or even be the main attraction at a holiday soiree. Variety truly is the spice of life when you're talking olives jazzed up with herbs and spices or savory party favorites like Merguez Meatballs with Yogurt Sauce or rich Fig and Gorgonzola Toasts with Caramelized Onions. And for guests who have to start with dessert, there are even a few bonbons such as Mocha Shortbread Buttons and Sugar and Spice Walnuts. Tips on smart shopping, artful presentation, and indispensable ingredients as well as a \"make-ahead planner\" get hosts prepared before the party for maximum socializing with guests. So let the festivities begin!",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Room to Write",
        "Authors": "By Goldberg, Bonni",
        "Description": "What makes someone a writer? A writer writes, expressing the world through synthesis of mind and magic, sensuality and spirit. With both humor and reverence, Room to Write playfully prevails on us to experience the world through a writer's eyes, and respond to the creative sparks that charge good writing.In two hundred daily essays, the author invites the reader--whether an experienced writer or someone just starting out--into the crucibles from which creative writing erupts: emotion, imagination, intellect, and soul. Once there, she urges the reader to grab a pen, grasp a keyboard, and seize the moment when perception fires revelation and language becomes art.Each page features an essay exploring an aspect of the writing process, an exercise to get the reader writing, and a quotation to tickle the mind and keep the writing going. Ultimately, readers learn about how they write, and how to trust their intuition. Room to Write is a collection of beguiling provocations, an irresistible invitation to all those who believe that writing, like any creative endeavor, is a way of life.",
        "Category": " Self-help , Creativity",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Sunset 30 Minutes or Less Cookbook",
        "Authors": "By Editors of Sunset Books",
        "Description": "",
        "Category": "",
        "Publisher": "Sunset Books",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "9 Scorpions",
        "Authors": "By Levine, Paul",
        "Description": "Award-winning author Paul Levine captures the dark side of the legal world with gripping, mordantly witty prose that \"gets leaner, meatier, better with every book\" (Miami Herald). Now, he delivers a thrillingly authentic page-turner about the murderous secrets of those who make and break the law at the highest level: the United States Supreme Court.  Lisa Fremont is a rising young lawyer gifted with a brilliant mind, natural beauty -- and an alluring sensuality. A newly hired law clerk on the staff of Supreme Court Justice Samuel Truitt, Lisa has a bright future. She also has a past that her curriculum vitae doesn't reveal....Long before she was Lisa Fremont, Esquire, she was Angel, an underage stripper in San Francisco's Tiki Club. And long before Max Wanaker was president of Atlantica Airlines, he was the wealthy benefactor who took her off the streets.Her driving ambition put her at the top of her class at Stanford, but her tuition, a highpowered career head start, and a new life came courtesy of Max, who knew a good bet when he saw it. Max took his angel far with a devil of a deal -- now, he's calling in the debt.  Three years ago, on its approach to Miami International, Atlantica Flight 640 crashed, claiming hundreds of lives and sparking a multimillion-dollar legal battle that is about to come before the Supreme Court. The swing vote belongs to Sam Truitt, and Max is depending on Lisa's expertise in the art of persuasion to save Atlantica. Lisa knows there's only one way to get Justice Truitt's vote: put aside her passion for justice and get into Truitt's life, into his head -- and into his bed.  But Lisa's obligation to Max is about to be overruled by a raw desire for Sam Truitt....One of the nation's most powerful men, Justice Truitt is also just a man -- with a failing marriage and a sharp, sexy law clerk succeeding in winning him over. Not knowing whom to trust as he steps into the minefield of the Atlantica case, he puts his career and his life on the line to strip away layers of corruption and violence outside the system -- and within. For even among his fellow Justices -- as tangled and deadly as nine scorpions in a bottle -- Truitt may find the deadly sting of malevolence at the highest levels of Law.  In the Machiavellian maze of political intrigue and personal betrayal that is the Supreme Court, Lisa Fremont and Sam Truitt could make one hell of a legal team. But inside the hidden sanctums of the halls of justice, there's only one rule to live by: stay one step ahead of those who live by no law at all.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Perspectives in Ecological Theory (Biology Series)",
        "Authors": "By Margalef, Ramon",
        "Description": "",
        "Category": "",
        "Publisher": "Univ of Chicago Pr (Tx)",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "June",
            "Year": "1968"
        }
    }
]