[
    {
        "Title": "Campbell's Slow Cooker Recipes",
        "Authors": "By Campbell's",
        "Description": "",
        "Category": "",
        "Publisher": "Campbell's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "In Bed with the Duke (Governess Brides Series)",
        "Authors": "By Dodd, Christina",
        "Description": "A return to historical romance from the New York Times bestselling superstar   Lady's companion Emma Chegwidden avoids defying society's rules-until she runs right into the arms of the seductive Reaper...a mystery man whose goal is justice. Or is it vengeance? Only one thing is certain: he's far too dangerous for the demure Emma. But some challenges are too tempting to resist...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "The How and Why Wonder Book of Stars",
        "Authors": "By Hoss, Norman",
        "Description": "",
        "Category": "",
        "Publisher": "Wonder Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Study Guide for Business Law",
        "Authors": "By Atkins, Ramona",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "7.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "50 Storage Projects For The Home (Popular Science)",
        "Authors": "By Favorite, Mary Jane and Armpriester, Kate",
        "Description": "The experts fromPopular Science show great ways to expand storage space. \"Concise step-by-step instructions guide you through the creation of a dazzling selection of shelves, cabinets, carts, bins....Hundreds of superb two-color exploded diagrams, close-up photos, and scaled working plans.\"--The Craft Digest. \"Anyone looking for ideas on how to deal with storage will find much here.\"--Woodwork.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Listen, Mother of God!: Reflections on the Litany of Loreto",
        "Authors": "By Dollen, Charles",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Our Sunday Visitor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "NASA: America in Space",
        "Authors": "By Baker, Wendy",
        "Description": "A guide to space exploration from NASA's founding in 1958 to the most recent space shuttle missions and futuristic imaginings of permanent space stations",
        "Category": " Science , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "The Dead Sea Scriptures",
        "Authors": "By Gaster, Theodor Herzl (EDT) and Dead Sea Scrolls. English.",
        "Description": "This volume contains the translated text of the ancient Hebrew writings found in caves near the Dead Sea, plus separate introductions for each scroll as wee as new translations of the Hymns and paraphrases of the Bible narratives by Professor Gaster, one of the world's leading Hebraists.",
        "Category": " Religion , Biblical Studies , Old Testament , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1976"
        }
    },
    {
        "Title": "The Falcon's Feathers (A to Z Mysteries)",
        "Authors": "By Gurney, John Steven (ILT) and Roy, Ron",
        "Description": "Help Dink, Josh, and Ruth Rose solve mysteries from A to Z!    Kids love collecting the entire alphabet and super editions! With over 8 million copies in print, the A to Z Mysteries® have been hooking chapter book readers on mysteries and reading for years. Now this classic kid favorite is back with a bright new look!   F is for Falcon . . . Find those falcons! After Josh discovers a falcons’ nest, he checks on the young birds every day. But when he tries to show Dink and Ruth Rose, the nest is empty! Could someone have taken the baby falcons? Soar into the mystery with Dink, Josh, and Ruth Rose!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Day the Dinosaurs Died (I Can Read Level 2)",
        "Authors": "By Wilson, Phil (ILT) and Brown, Charlotte Lewis",
        "Description": "Offers an illustrated look at how the impact of a giant asteroid changed the planet and caused the extinction of these massive beasts who ruled the planet for millions of years. Reprint.",
        "Category": " Juvenile Nonfiction , Science & Nature , Biology",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Nursery Rhymes: Well-Loved Verses to Share, A Nursery Collection Book",
        "Authors": "By Harwood, Beth (EDT) and Lacome, Susie (ILT)",
        "Description": "The Nursery Collection books are enhanced by special touches such as flocking and embossing on the cover and pages. Charming illustrations and soft, pastel colors distinguish the entire collection of traditional nursery rhymes, fairy tales, and lullabies. Nursery rhymes are a traditional part of early childhood. This beautifully illustrated book is filled with well-loved rhymes cherished by generations including One Two Buckle My Shoe, Three Blind Mice, and Little Miss Muffet.",
        "Category": " Juvenile Fiction , Nursery Rhymes",
        "Publisher": "Silver Dolphin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Strategic Management of Technology and Innovation",
        "Authors": "By Christensen, Clayton M., Wheelwright, Steven C., and Burgelman, Robert A.",
        "Description": "The 4th Edition of Strategic Management of Technology and Innovation by Burgelman, Christensen, and Wheelwright continues its unmatched tradition of market leadership, by using a combination of text, readings, and cases to bring to life the latest business research on these critical business challenges. New co-author Clay Christensen provides his insights on innovation management and new market entries through several new cases. Approximately 40% of the cases are entirely new to this edition.Strategic Management of Technology and Innovation takes the perspective of the general manager at the product line, business unit, and corporate levels. The book not only examines each of these levels in some detail, but also addresses the interaction between the different levels of general management - for example, the fit between product strategy and business unit strategy, and the link between business and corporate level technology strategy.Each part of the book starts with an introductory chapter laying out an overall framework and offering a brief discussion of key tools and findings from existing literature. The remainder of each part offers a selected handful of seminar readings and case studies. Almost all of the cases deal with recent events and situations, including several that are concerned with the impact of the Internet. A few \"classics\" have been retained, however, because they capture a timeless issue or problem in such a definitive way that the historical date of their writing is irrelevant.",
        "Category": " Business & Economics , General",
        "Publisher": "McGraw-Hill/Irwin",
        "Price Starting With ($)": "9.86",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Hot Stuff (The Hot Zone)",
        "Authors": "By Phillips, Carly",
        "Description": "she's not just one of the guysAnnabelle Jordan and her two sisters were orphans in frilly dresses when they went to live with their sports-lawyer uncle in his world of locker rooms, bookies and gambling.Now the girls are publicists in their uncle's firm, The Hot Zone. Despite her upbringing, Annabelle is all woman. She's naturally drawn to real men—like her latest client, businessman and former football legend Brandon Vaughn.The chemistry is potent, undeniable, irresistible. Annabelle soon realizes that Brandon is much more than just another jock. And that she'd better hold on tight if she  doesn't want to lose her heart.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Creation of the Future: The Role of the American University",
        "Authors": "By Rhodes, Frank Harold Trevor",
        "Description": "Is the university a dinosaur: huge, lumbering, endearing in its own way, yet unsuited to today's world? Is it a thing of the past, unnecessary in an age of the Internet and online learning? In a book likely to provoke people who are loyal to the ideal of the university as well as those who foresee its demise, Frank H. T. Rhodes acknowledges that the university is an imperfect institution, but argues that it plays an essential role in modern society. In the process, he articulates strong opinions on a range of difficult issues.  The Creation of the Future is no defense or promotion of the status quo. Focusing on American research universities, Rhodes makes the case that they are an irreplaceable resource, quite literally a national and international treasure, whose value must be preserved through judicious renewal and reform, beginning with a rededication to teaching as a moral vocation. Rhodes discusses where the research university is today and how it got here, as well as where it must go in the future. In the process, he addresses a wide range of contemporary challenges facing the institution, including*why universities can no longer be \"ivory towers\"*why post-tenure review of professors is desirable*whether grading standards have become too lax*why unionization of graduate students is inappropriate*why affirmative action is necessary*how governance and leadership can be improved*how to maintain a sense of commitment to the university in the face of increasing disciplinary specialization*why faculty must affirm that university membership has not only its privileges, but also its price.*what should and should not be done to control the rapid rise in tuition.*whether curricula of professional schools should be more heavily weighted toward the liberal arts.*why service is a social obligation of all universities, not just land-grant institutions.*why research is vital to effective teaching.His eighteen-year tenure as president of Cornell University gives Rhodes a unique perspective on a system he finds both invaluable and in need of change. Although he is an enthusiastic advocate, he pulls no punches in recommending sweeping changes. The greatest catastrophe facing universities today, he writes, is loss of community: \"Without community, knowledge becomes idiosyncratic. The lone learner, studying in isolation, is vulnerable to narrowness, dogmatism, and untested assumption; pursued in community, learning will be expansive and informed, contested by opposing interpretations, leavened by differing experience, and refined by alternative viewpoints.\"In championing a new relevance for the American research university, Rhodes argues for renewal through the application of old virtues to new realities. Campus culture, he says, must embrace the human experience in all its richness, breadth, and ambiguity if it is to survive and thrive.",
        "Category": " Education , Research",
        "Publisher": "Cornell University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Touchdown for Tommy (Matt Christopher Sports Classics)",
        "Authors": "By Christopher, Matt and Caddell, Foster",
        "Description": "TOUCHDOWN FOR TOMMY Is football Tommy's key to a new home? Football isn't just Tommy's favorite sport-he also thinks that it's the key to a good home. The recently orphaned Tommy is delighted to discover that his foster father, Mr. Powell, coaches Midget League football. By playing well, Tommy hopes that he will make Mr. Powell want to adopt him, and then he will have a real family again. But will things work out the way he plans!",
        "Category": " Juvenile Fiction , Sports & Recreation , Football",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "P.S. I Love You Baby Collection Quilts",
        "Authors": "By Milligan, Lynda and Smith, Nancy",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Possibilities",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Everything Flowers",
        "Authors": "By Wells, Jean and Wells, Valori",
        "Description": "Offers tips and techniques to transfer floral images to quilts and other crafts and details instructions for twelve projects, including quilts, scrapbooks, and potpourri packets",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "C&T Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Scrap Quilts Using Fast Patch (Contemporary Quilting)",
        "Authors": "By Hallock, Anita",
        "Description": "Teaches a method of fast-piecing strips of triangles to create scrap quilts, and tells how to store and make the best use of fabric and scrap collections",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Chilton Book Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Ivan & Adolf: The Last Man in Hell",
        "Authors": "By Vicchio, Stephen",
        "Description": "",
        "Category": "",
        "Publisher": "Woodholme House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Greece: Ancient Civilizations : Grades 3-6 (Time Traveler Series)",
        "Authors": "By Pofahl, Jane",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , Social Science",
        "Publisher": "Instructional Fair",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "I'd Go with the Helmet, Ray",
        "Authors": "By Trudeau, G. B.",
        "Description": "\"Garry Trudeau is the premier American social and political satirist of his time.\"--Newsweek\"He has transformed the comic strip into a venue of social commentary not seen since the nineteenth-century broadsides that gave rise to daily newspapering. It seems only fitting that something as modest as a comic strip could serve as the American equivalent to Tolstoy.\"--Seattle Times\"Not since Thomas Nast has there been a more effective political and social cartoonist.\"--Oakland Tribune\"The impact that Trudeau and his characters have had on the last twenty years really is incalculable. Trudeau's characters have passed from merely comic-strip entities into something akin to cultural icons, mirroring society as they chronicle it.\"--Idaho State JournalIn I'd Go with the Helmet, Ray, the intense situation in the Gulf reactivates a platoon of veteran characters. For B.D., the change of climate forces a change of helmets (\"They cut it away like an avocado--strictly outpatient\"), but in most respects, he's clearly in his element. Mr. Butts, serving country and corporation as Battalion Tobacco Liaison, also seems right at home, but intrepid correspondent Roland \"From-somewhere-in-the-Midwest\" Hedley quickly becomes a whole lot more lost than usual.Meanwhile, on the home front, USO volunteer Boopsie readies her turkey costume for the Jay Leno Southwest Asia Thanksgiving Tour, while conflicted adman Mike Doonesbury agonizes over an oil company TV campaign to \"make the American people feel good about being gouged.\" In contrast, Congresswoman Lacey Davenport keeps her integrity intact by resigning over the S&L crisis--a stately act of principle that leads her badly shaken colleagues to conclude she is suffering from a fatal disease.This is Doonesbury at its best--provocative, witty, and poignant.",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Guide to Owning a Chinchilla",
        "Authors": "By Barrie, Anmarie",
        "Description": "",
        "Category": " Pets , Reference",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "GOLD STARS MULTIPLICATION",
        "Authors": "By Peter Patilla",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon",
        "Price Starting With ($)": "17.14",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Because God loves you: A message from the U.S. Catholic Bishops for the Jubilee Year 2000",
        "Authors": "By Catholic, Church",
        "Description": "",
        "Category": "",
        "Publisher": "U.S. Catholic Conference",
        "Price Starting With ($)": "10.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Free to Be Me",
        "Authors": "By Robinson, Betty",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "By Dawn's Early Light: A Novel",
        "Authors": "By Shelby, Philip",
        "Description": "From the author of Days of Drums and co-author (with Robert Ludlum) of the New York Times bestselling The Cassandra Compact comes a new political thriller that ricochets across the world stage with implacable force.  Moving from the desolation of North Korea to the oak-and-leather preserves of Wall Street to the subterranean surveillance headquarters in the Pentagon, By Dawn's Early Light traces the journey of Sloane Ryder, a young, straight-shooting financial analyst who gets caught in the undertow of large-scale political maneuverings involving the United States' ever-sensitive relationship with China. While Washington, Wall Street, and Beijing jockey for position in East Asia, Sloane uncovers a plot -- woven by some of the most eminent figures in government -- to murder the first woman president of the United States. As she frantically pieces together a series of strange but seemingly unrelated events, her trail leads her to the Handyman, a merciless killer-for-hire. Suddenly she finds she's playing a deadly game of cat-and-mouse where each move could be her last.  By Dawn's Early Light is a Roman candle of interlocking conspiracies, Faustian bargains, and shadowy alliances among unlikely parties. A high-wire act of collusion and double-cross, its shocking plot twists will keep readers reeling till the very last pages.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Letters of T.S. Eliot, Vol. 1: 1898-1922",
        "Authors": "By Eliot, T. S. and Eliot, Valerie",
        "Description": "Assembled by Eliot's widow, letters from his childhood days in Missouri through the early years of his marriage and move to England include those penned by Eliot, as well as letters written to him by family, friends, and contemporaries",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Marine Biology Coloring Book",
        "Authors": "By Niesen, Thomas M., Ph.D.",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "The Hound of the Baskervilles (Paperback Classics)",
        "Authors": "By Doyle, Arthur Conan, Sir, Brook, Henry, and Harvey, Bob (ILT)",
        "Description": "Sherlock Holmes is out to discover the reason behind the strange murders at Baskerville Hall.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "The Salmon of Doubt: Hitchhiking the Galaxy One Last Time (Hitchhiker's Guide to the Galaxy)",
        "Authors": "By Adams, Douglas",
        "Description": "“A fitting eulogy to the master of wacky words and even wackier tales . . . Salmon leaves no doubt as to Adams’s lasting legacy.”—Entertainment WeeklyWith an introduction to the introduction by Terry JonesDouglas Adams changed the face of science fiction with his cosmically comic novel The Hitchhiker’s Guide to the Galaxy and its classic sequels. Sadly for his countless admirers, he hitched his own ride to the great beyond much too soon. Culled posthumously from Adams’s fleet of beloved Macintosh computers, this selection of essays, articles, anecdotes, and stories offers a fascinating and intimate portrait of the multifaceted artist and absurdist wordsmith. Join Adams on an excursion to climb Kilimanjaro . . . dressed in a rhino costume; peek into the private life of Genghis Khan—warrior and world-class neurotic; root for the harried author’s efforts to get a Hitchhiker movie off the ground in Hollywood; thrill to the further exploits of private eye Dirk Gently and two-headed alien Zaphod Beeblebrox. Though Douglas Adams is gone, he’s left us something very special to remember him by. Without a doubt.“Worth reading and even cherishing, if only because it’s the last we’ll hear from the master of comic science fiction.”—The Star-Ledger",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Bottom Line's Power Aging",
        "Authors": "By Gary Null PhD",
        "Description": "",
        "Category": "",
        "Publisher": "BOTTOM LINE",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Room: A Novel",
        "Authors": "By Donoghue, Emma",
        "Description": "Held captive for years in a small shed, a woman and her precocious young son finally gain their freedom, and the boy experiences the outside world for the first time.   Inspiration for the MAJOR MOTION PICTURE starring Academy Award winner Brie LarsonTo five-year-old-Jack, Room is the world. . . . It's where he was born, it's where he and his Ma eat and sleep and play and learn. At night, his Ma shuts him safely in the wardrobe, where he is meant to be asleep when Old Nick visits. Room is home to Jack, but to Ma it's the prison where she has been held for seven years. Through her fierce love for her son, she has created a life for him in this eleven-by-eleven-foot space. But with Jack's curiosity building alongside her own desperation, she knows that Room cannot contain either much longer.Room is a tale at once shocking, riveting, exhilarating--a story of unconquerable love in harrowing circumstances, and of the diamond-hard bond between a mother and her child.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Complete Family Guide to Alternative Medicine: An Illustrated Encyclopedia of Natural Healing",
        "Authors": "By Thomas, Richard (EDT) and Shealy, C. Norman (EDT)",
        "Description": "A complete health reference explains what various alternative therapies are now available, what they are successful at treating, which therapy is suitable for which ailment, and how to choose and find a good practitioner. Original.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Element Books Ltd.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Spectrum Test Prep, Grade 3",
        "Authors": "By Foreman, Dale",
        "Description": "Spectrum Test Prep provides the most comprehensive strategies for effective test preparation! Each book features essential practice in reading, math, and language test areas. The lessons, perfect for students in grade 3, are presented through a variety of formats and each book includes suggestions for parents and teachers, as well as answer keys and progress charts.Today, more than ever, students need to be equipped with the essential skills they need for school achievement and for success on proficiency tests. The Spectrum series has been designed to prepare students with these skills and to enhance student achievement. Developed by experts in the field of education, each title in the Spectrum workbook series offers grade-appropriate instruction and reinforcement in an effective sequence for learning success. Perfect for use at home or in school, and a favorite of parents, homeschoolers, and teachers worldwide, Spectrum is the learning partner students need for complete achievement.",
        "Category": " Juvenile Nonfiction , Study Aids , Test Preparation",
        "Publisher": "Spectrum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Everyday Home Repairs",
        "Authors": "By ed Bryan Trandem",
        "Description": "",
        "Category": " House & Home , Repair",
        "Publisher": "Creative Publishing International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Marbling (Living Style Series)",
        "Authors": "By Spencer, Stuart",
        "Description": "Describes useful paints, glazes, and equipment, demonstrates various marbling techniques, and shows how to plan their effect in the overall interior design",
        "Category": " Art , General",
        "Publisher": "Ward Lock Ltd",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "That Wilder Image: Painting of America's Native School from Thomas Cole to Winslow Homer",
        "Authors": "By Flexner, James Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1971"
        }
    },
    {
        "Title": "Mathematics for Dynamic Modeling",
        "Authors": "By Beltrami, Edward J.",
        "Description": "",
        "Category": "",
        "Publisher": "Academic Pr",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The 5 in 10 Appetizer Cookbook: 5 Ingredients in 10 Minutes or Less",
        "Authors": "By Hamilton, Paula J.",
        "Description": "Presents Tuscan White Bean Dip, California Pizza, Chicken Satays, Stuffed Mushrooms, and other finger foods and first courses using up to five readily available ingredients and that can be prepared in ten minutes or less. 50,000 first printing. $40,000 ad/promo.",
        "Category": " Cooking , General",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Return of the Bunny Suicides (Books of the Bunny Suicides Series)",
        "Authors": "By Riley, Andy",
        "Description": "Return of the Bunny Suicides follows over one hundred bunnies as they find ever more bizarre ways to end their fuzzy little existences.  From swimming with nibbly fishes, to hiding under an elephant’s footstool, to getting on the sharp end of a Venetian gondola—no stone goes unturned (or undropped, or uncatapulted) in the twisted little creatures’ next installment.Illustrated in a spare and simple style, Return of the Bunny Suicides is a collection of hilarious and outrageous cartoons that will appeal to anyone in touch with their evil side.www.bookofbunnysuicides.com",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Son of a Duck is a Floater (English and Arabic Edition)",
        "Authors": "By Arnander, Primrose (EDT)",
        "Description": "To understand a people, acquaint yourself with their proverbs' runs an Arab adage, and here are the books that do just that. The popular Apricots Tomorrow, a selection of sayings from the Gulf region, is joined by sister titles The Son of a Duck is a Floater and the newest book in the series, Unload your own Donkey, which draws on sayings from the Maghreb and Levant. Pairing age-old Arabic sayings with English equivalents, the proverbs highlight the uncanny similarity of inherited wisdom in the East and West.",
        "Category": " Humor , Form , Anecdotes & Quotations",
        "Publisher": "Stacey International",
        "Price Starting With ($)": "17.5",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "A Once-and-Coming Spirit at Pentecost: Essays on the Liturgical Readings Between Easter and Pentecost",
        "Authors": "By Brown, Raymond E.",
        "Description": "Father Brown completes his look at the great seasons of the liturgical year, making the rich insights of modern biblical exegesis conveniently available to all, with this volume for the season from Easter to Pentecost. During this season the Church reads consecutively from the Acts of the Apostles, recounting the external life of the Church after Pentecost. The accompanying readings from the Gospel according to John portray the internal life of Christian disciples and promise a coming Paraclete to be sent by the Father. Father Brown's title A Once-and-Coming Spirit signifies these two great biblical sources that he reflects on. He shows how these readings speak to our time as we live out the external history of a visible Church while internally drawing life from Jesus as branches on the vine. His comments offer an opportunity to appreciate the intent of the season after Easter and to prepare ourselves for the intensified gift of the spirit at Pentecost.",
        "Category": " Religion , Spirituality",
        "Publisher": "Liturgical Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "iPod pedia: The Ultimate iPod and iTunes Resource",
        "Authors": "By Miller, Michael",
        "Description": "iPodpedia is the first book to show you everything that the iPod and iTunes have to offer—from music to movies and beyond. Whether you want to get the most out of your iPod’s music playback, create your own playlists, edit your music info and album art, convert your home movies and DVDs to iPod videos, listen to audiobooks and podcasts, or just unfreeze a frozen iPod, iPodpedia will show you how to do it.     Here’s some of what’s covered inside…  •    Using the iPod, iPod Nano, and iPod Shuffle™  •    Apple’s new iPhone™  •    Purchasing music and movies from the iTunes Store  •    Using iTunes to rip and burn CDs  •    Managing music and playlists  •    Finding cover art and other music file tag information  •    Dealing with DRM (Digital Rights Management)  •    Watching movies, TV shows, and other videos  •    Listening to audiobooks and podcasts  •    Viewing digital photos and slideshows  •    Connecting your iPod to a home audio/video system  •    Using the iPod in your car or boat  •    Playing iPod games  •    Using the iPod as a calendar and scheduler  •    Exercising with the Nike+iPod Sports Kit  •    Transferring files from your iPod to your PC  •    Using add-on software programs  •    iPod accessories  •    iPod tips, tricks, and hacks   •    Troubleshooting iPod problems       Part 1:    Background  1    The History  2    The iPod Family  3    The iPhone  Part 2:    Operation  4    Using the iPod  5    Using the iTunes Software  6    Using the iTunes Store  Part 3:    Applications  7    Music  8    Podcasts  9    Audiobooks10  Photos  11  Videos12  Games  Part 4:    Special Uses  13    Using Your iPod in the Living Room  14    Using Your iPod in the Car  15    Using Your iPod as a Portable Storage Device  16    Using Your iPod to Record Audio and Podcasts  17    Using Your iPod for Running and Exercise  18    Using Your iPod as a Calendar/Scheduler   19    Using iTunes to Manage Your Music Purchases  Part 5:    Secrets  20    iPod Tips and Tricks  21    iPod Hacks  Part 6:    Support  22    iPod Accessories  23    Third-Party Software24    iPod Troubleshooting  Part 7:    Appendixes     Michael Miller has written more than 75 non-fiction how-to books over the past two decades, including Googlepedia: The Ultimate Google Reference, Absolute Beginner’s Guide to Computer Basics, How Microsoft Windows Vista Works, How Home Theater and HDTV Work, Tricks of the eBay Masters, and YouTube 4 You. His books have collectively sold more than a m",
        "Category": " Music , Recording & Reproduction",
        "Publisher": "Que Pub",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Quilt of Life: A Patchwork of Devotional Thoughts",
        "Authors": "By Tatem, Mary",
        "Description": "Life is a patchwork of separate experiences that come together into a unified whole-much like a handmade quilt. Author Mary Tatem weaves that theme into 90 story-based meditations, offering insight into peaceful, successful, godly living. This new edition of the much-loved devotional The Quilt of Life (more than 175,000 copies sold since 2000) will introduce you to the beautiful, colorful, and cozy world of quilts—and the Master Designer who lovingly assembles the fabric of our existence. In addition to the encouraging devotional material, The Quilt of Life includes a bonus feature: practical tips for quilters!",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Virtual Faith : The Irreverent Spiritual Quest of Generation X",
        "Authors": "By Beaudoin, Tom",
        "Description": "Reveals the deep and pervasive search for meaning that haunts Generation X. This book is must reading for anyone who would understand the spirituality of young people at the turn of a new millennium.--Robert A. Ludwig, author of Reconstructing Catholicism for a New GenerationIn Virtual Faith, Beaudoin explores fashion, music videos, and cyberspace concluding that his generation has fashioned a theology radically different from, but no less potent or valid than, that of their elders.Beaudoin's investigation of popular culture uncovers four themes that underpin his generation?s theology. First, all institutions are suspect -- especially organized religion. Second, personal experience is everything, and every form of intense personal experience is potentially spiritual. Third, suffering is also spiritual. Finally, this generation sees ambiguity as a central element of faith. This book opens a long overdue conversation about where and how we find meaning, and how we all can encourage each other in this central human searching.Tom Beaudoin earned his Master of Theological Studies from Harvard University School of Divinity in 1996 and is currently working toward a Ph.D. in Religion and Education at Boston College.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Presidency in a Separated System",
        "Authors": "By Jones, Charles O.",
        "Description": "Popular interpretations of American government tend to center on the presidency. Successes and failures of government are often attributed to presidents themselves. But, though the White House stands as a powerful symbol of government, the United States has a separated system intentionally designed to distribute power, not to concentrate it. Charles O. Jones explains that focusing exclusively on the presidency can lead to a seriously distorted picture of how the national government works. The role of the president varies widely, depending on his resources, advantages, and strategic position. Public expectations often far exceed the president's personal, political, institutional, or constitutional capacities for achievement. Jones explores how presidents find their place in the permanent government and how they are \"fitted in\" by others, most notably those on Capitol Hill. This book shows how a separated system of government works under the circumstances created by the Constitution and encouraged by a two-party system. Jones examines the organizational challenges facing presidents, their public standing and what it means, presidential agendas and mandates, and lawmakinghow it works, where the president fits in, and how it varies from issue to issue. He compares the post-World War II presidents and identifies the strengths and weaknesses of each in working within the separated system. Jones proposes a view of government as a legitimate, even productive, form of decisionmaking and emphasizes the varying strategies available to presidents for governing. He concludes with a number of important lessons for presidents and advice on how to make the separated system work better.",
        "Category": " Political Science , American Government , Executive Branch",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Familiar Trees of North America : East",
        "Authors": "By Franklin, Jerry",
        "Description": "A portable, comprehensive field guide--brimming with concise descriptions and stunning color photographs, and designed to fit into your back pocket--from the go-to reference source for over 18 million nature lovers.This handy, streamlined field guide identifies the most frequently encountered trees of North America's eastern region. Packed with information, it includes detailed photographs and diagrams, specific descriptions, and a glossary of terms.",
        "Category": " Nature , Plants , Trees",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "As Husbands Go: A Novel",
        "Authors": "By Isaacs, Susan",
        "Description": "Call her superficial, but Susie B. Anthony Rabinowitz Gersten assumed her marriage was great—and why not? Jonah Gersten, M.D., a Park Avenue plastic surgeon, clearly adored her. He was handsome, successful, and a doting dad to their four-year-old triplets Dashiell, Evan, and Mason. But when Jonah is found in the Upper East Side apartment of second-rate “escort” Dorinda Dillon, Susie is overwhelmed with questions left unanswered. It’s bad enough to know your husband’s been murdered, but even worse when you’re universally pitied (and quietly mocked) because of the sleaze factor. None of it makes sense to Susie—not a sexual liaison with someone like Dorinda, not the “better not to discuss it” response from Jonah’s partners. With help from her tough-talking, high-style Grandma Ethel who flies in from Miami, she takes on her snooty in-laws, her husband’s partners, the NYPD, and the DA (is the person arrested for the homicide the actual perp, or just an easy mark for a prosecutor who hates the word “unsolved”?), as she tries to prove that her wonderful life with Jonah was no lie.   Susan Isaacs brilliantly turns the conventions of the mystery on end as Susie Gersten, suburban mom, floral designer, and fashion plate, searches not so much for answers to her husband’s death as for answers to her own life.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Jesus Makes Me Happy",
        "Authors": "By Hayes, Wanda",
        "Description": "",
        "Category": "",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Blue Dahlia (Garden Trilogy, Book One)",
        "Authors": "By Roberts, Nora",
        "Description": "",
        "Category": "",
        "Publisher": "Jove/Doubleday Large Print",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Penguin London Mapguid (Penguin Handbooks)",
        "Authors": "By Middleditch, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Graham Kerr's Galloping Gourmet Television Cookbook Volume 2 Favorite Dishes : Italy, Australia, New Zealand",
        "Authors": "By Kerr, Graham",
        "Description": "",
        "Category": "",
        "Publisher": "Fremantle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Battle of the Red Hot Pepper Weenies: And Other Warped and Creepy Tales (Weenies Stories)",
        "Authors": "By Lubar, David",
        "Description": "A girl doesn't have a date for the school dance—until her dad makes one for her in his lab. \"Lily—meet Stitchy.\" A family enjoys a nice Thanksgiving dinner—until they are interrupted by a torrent of turkeys out for revenge. A princess meets a pea-brained suitor. And the battle of two red hot pepper weenies ends in flames.Critically-acclaimed author and master of the macabre David Lubar returns from a journey into the darkest depths of his brain with thirty-five more warped and creepy tales. And in the tradition of the three previous Weenie collections—In the Land of the Lawn Weenies, Invasion of the Road Weenies, and The Curse of the Campfire Weenies—he reveals the inspiration behind each story at the end of the book. Don't be a weenie. Read these stories...if you dare!",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Starscape",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Uses for Mooses: And Other Silly Observations",
        "Authors": "By Silliker, Bill, Jr.",
        "Description": "Gathered here are nearly 60 color images of moose at their wackiest, each accompanied by a silly caption from the human mind. These amusing and enlightening photographs provide a surprising insight into the character of moose. People of all ages will be delighted by this hilarious look at moose and their mannerisms.",
        "Category": " Humor , Topic , Animals",
        "Publisher": "Down East Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Discovering God's Will",
        "Authors": "By Ferguson, Sinclair B.",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Banner of Truth",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Spiritual Direction: Contemporary Readings",
        "Authors": "By Culligan, Kevin (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Living Flame Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "Lost Empire: A Fargo Adventure (A Sam and Remi Fargo Adventure)",
        "Authors": "By Cussler, Clive and Blackwood, Grant",
        "Description": "Sam and Remi Fargo, heroes of Spartan Gold, return in this extraordinary new adventure from the number-oneNew York Times- bestselling author. With Spartan Gold, a daring thriller that Publishers Weekly proclaimed \"solidly in the Cussler tradition, [and] sure to please new fans and old,\" Clive Cussler introduced husband-and-wife treasure-hunting team Sam and Remi Fargo. In their electrifying new adventure, the Fargos make a startling discovery that others would kill to keep hidden...While scuba diving in Tanzania, Sam and Remi Fargo come upon a relic belonging to a long-lost Confederate ship. An anomaly about the relic sets them off chasing a mystery-but unknown to them, a much more powerful force is engaged in the same chase. Mexico's ruling party, the ultranationalist Mexica Tenochca, is intent on finding that artifact as well, because it contains a secret that could destroy the party utterly.Through Tanzania and Zanzibar, into the rainforests of Madagascar, and across the Indian Ocean to Indonesia and the legendary site of the 1883 Krakatoa explosion, the Fargos and their ruthless opponents pursue the hunt-but only one can win. And the penalty for failure is death.Filled with the dazzling suspense and breathtaking action that are Cussler's trademarks,Lost Empire is a stunning new novel from the grand master of adventure.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "The Marriage Mender: A Couple's Guide for Staying Together",
        "Authors": "By Whiteman, Tom and Bartlett, Thomas G.",
        "Description": "This book offers the solution-based tools you needto begin rebuilding your marriage. Learn to look to the future ofyour relationship instead of focusing on the past with its problemsby:? building emotional safety? communicating effectively with your spouse? resolving conflict creatively? fighting fairly",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Last Snow (Jack McClure/Alli Carson Novels)",
        "Authors": "By Lustbader, Eric",
        "Description": "The electrifying follow-up to the Jack McClure thriller First Daughter from theNew York Times bestselling author of The Bourne Sanction and The Bourne DeceptionJack McClure, Special Advisor and closest friend to the new President of the United States, interprets the world very differently from the rest of us. It’s his greatest liability, and his greatest asset.An American senator, supposedly on a political trip to the Ukraine, turns up dead on the island of Capri. When the President asks him to find out how and why, Jack sets out from Moscow across Eastern Europe, following a perilous trail of diplomats, criminals, and corrupt politicians. Thrust into the midst of a global jigsaw puzzle, Jack’s unique dyslexic mind allows him to put together the pieces that others can’t even see.Still unreconciled to the recent death of his daughter and the dissolution of his marriage, Jack takes on a personal mission along with his official one: keeping safe from harm his two unlikely, unexpected, and incompatible companions—Annika Dementieva, a rogue Russian FSB agent, and Alli Carson, the President’s daughter. As he struggles to keep both young women safe and unearth the answers he seeks, hunted by everyone from the Russian mafia to the Ukrainian police to his own NSA, Jack learns just how far up the American and Russian political ladders corruption and treachery has reached.In the vein of Eric Van Lustbader’s latest bestselling Jason Bourne novels, Lustbader takes us on an international adventure in this powerful page-turner that will keep you reading through the night.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Stories Huey Tells (Stepping Stone, paper)",
        "Authors": "By Cameron, Ann and Smith, Roberta (ILT)",
        "Description": "If you loved The Stories Julian Tells, just wait until you meet his younger brother, Huey! This beloved and bestselling chapter book series is all about family, imagination, and friendship! It isn't easy being Julian's younger brother. When Huey has bad dreams, Julian says  his are scarier. When Huey wants to study animal tracks, Julian says he's too young.  But Huey isn't a baby. He's an adventurer, a chef, a tracker, and a scout. And he's  about to show Julian—and the world—all that he can do.",
        "Category": " Juvenile Fiction , People & Places , United States , African American",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Daddy Long-Legs (Watermill)",
        "Authors": "By webster, jean",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Choosing Victory Over-Coming Defeat (International Inductive Study)",
        "Authors": "By Arthur, Kay",
        "Description": "",
        "Category": " Bibles , Other Translations , Study",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Under the Stars (High School Musical Stories from East High, Super Special)",
        "Authors": "By Perelman, Helen",
        "Description": "The students of East High are going green! When the environmental science classes take a trip to a nearby state park, the kids think it will be all fun and games. But between collecting water samples, taking hikes, and learning to ride some rather temperamental horses, drama is right around the corner. Then two of the students go missing and everyone has to team up to make sure that the trip doesn't end in disaster.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Be Proud of All You'Ve Achieved: Poems on the Meaning of Success (Self-Help & Recovery)",
        "Authors": "By Gary Morris",
        "Description": "",
        "Category": "",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Game and the Glory, The",
        "Authors": "By Lewis, Gregg and Akers, Michelle",
        "Description": "The midfielder of the United States women's soccer team chronicles her life, discussing the difficulties she overcame, including a career-threatening illness and a painful divorce",
        "Category": " Young Adult Fiction , Sports & Recreation , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Cool as Ice",
        "Authors": "By Mantell, Paul and Christopher, Matt",
        "Description": "11 year old Chris is small for his age, so he can't believe it when he learns he's been selected for the all-star hockey team. It's not fun and games playing for the Arctic Wolves, however, as Chris and his teammate, Derek, find out.",
        "Category": " Juvenile Fiction , Sports & Recreation , Winter Sports",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Against the Tide: How a Compliant Congress Empowered a Reckless President",
        "Authors": "By Chafee, Lincoln",
        "Description": "In this smart, candid, and surprising political memoir, Lincoln Chafee offers a behind-the-scenes look at the first six years of the Bush Administration from the vantage point of one of the few Republican moderates in the Senate.            When Senator Chafee (R-RI) went to Washington, he encountered a Republican Party drifting so far to the right it no longer stood for the mainstream principles that united Americans. Instead, under the direction of George W. Bush, the Party had fallen victim to extremism. In the face of this trend, Chafee stood fast as one of the most liberal Republicans in the Senate, seeking to cut across partisan lines at the very time that they threatened to irrevocably divide the nation.             A political iconoclast, Chafee was the only Republican senator to have expressed support for same-sex marriage; the only Republican to vote in favor of reinstating the top federal tax rate on upper-income payers; the only Republican in the Senate to have voted against authorization of the use of force in Iraq; the only Republican to vote for the Levin-Reed amendment calling for a nonbinding timetable for a withdrawal of U.S. troops from Iraq; and the only Republican to vote against Supreme Court nominee Samuel Alito. Chafee favored increased federal funding for health care, supported affirmative action and gun control, supported women’s reproductive rights, and endorsed federal funding for embryonic stem cell research. Sometimes referred to by conservatives as a RINO (Republican in Name Only), Chafee turns the tables on the right and asks why it has enabled Bush Jr. to pull the GOP and the nation away from traditional principles of fiscal conservatism, respect for our environment, and aversion to foreign entanglements.              Unabashedly frank, Chafee’s memoir recounts his political journey from small-town mayor to a voice crying from the congressional wilderness. He offers a forward-looking assessment of what comes next for the Republican and Democratic parties, and he also addresses the potential rise of a third party within the void created by bipartisan extremism. Most important, Chafee sounds a wake-up call to his Party, and to all Americans, by challenging our government to strive, as Abraham Lincoln once articulated, “to elevate the condition of men.”",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Royal Wedding (Special Publications)",
        "Authors": "By Ladybird Books",
        "Description": "",
        "Category": "",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Sun Sense: A Complete Guide to Prevention, Early Detection and Treatment of Skin Cancer",
        "Authors": "By Robins, Perry",
        "Description": "",
        "Category": "",
        "Publisher": "The Skin Cancer Foundation, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "East to the Dawn: The Life of Amelia Earhart",
        "Authors": "By Butler, Susan",
        "Description": "\"Of the dozen or so books (mostly wild fantasies) that I have read about Amelia Earhart, Susan Butler's is the only one which re-creates accurately that singular woman whom my father was in love with, as indeed was I, aged ten, when the lady vanished.\"ùGORE VIDALAmelia Earhart (1897 -1937) captured the hearts of America after becoming the first woman to fly across the Atlantic in 1928. Nine years later, her disappearance on an around-the - world flight brought her extraordinary life to an abrupt and mysterious end.Based on a decade of archival research through Earhart's letters, journals, and diaries, and drawing on interviews with the aviator's friends and relatives, East to the Dawn provides the most authoritative and richly textured account of both Earhart's record-setting aviation career and her personal life: her early years with her grandparents, her experiences as a nurse and social worker, her famous marriage to publisher George Putnam, and her secret affair with Gene Vidal, head of the Bureau of Air Commerce. As the Los Angeles Times raved, East to the Dawn is \"a fully realized portrait of a truly remarkable woman.\"\"The mountain of new material it marshals guarantees East to the Dawn a permanent place on the shelf of Amelia Earhart references.\"ùNEW YORK TIMES BOOK REVIEW",
        "Category": " Transportation , Aviation , History",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Consciousness of battle: An interim report on a theological journey",
        "Authors": "By Shideler, Mary McDermott",
        "Description": "",
        "Category": "",
        "Publisher": "Eerdmans",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Communication Sex and Money",
        "Authors": "By Cole, Edwin Louis",
        "Description": "",
        "Category": "",
        "Publisher": "Harrison House@publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Complete Guide to Water Gardens, Ponds & Fountains (English and English Edition)",
        "Authors": "By Fisher, Kathleen",
        "Description": "An updated, expanded edition of Creative Homeowner's comprehensive guide to water gardens, Complete Guide to Water Gardens, Ponds & Fountains provides essential information on designing and installing all types of home water gardens, from naturalistic to formal, plus fountains, waterfalls, streams, and bog gardens. Readers will learn how to construct each of these structures, as well as how to design bridges and stepping-stones. Special sections on aquatic plants, fish, and other pond inhabitants bring life to these essential garden features. Beautifully illustrated with dozens of inspiring landscape photographs, plus step-by-step sequences and instructions, the book shows readers all they need to know to create and maintain the water garden of their dreams.",
        "Category": " Gardening , Reference",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Rome and the Vatican: with the restored frescoes of the Sistine Chapel and the Last Judgement",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Ats Italia Editrice",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Gaudi",
        "Authors": "By Branguli (Photographer)",
        "Description": "",
        "Category": "",
        "Publisher": "Escudo de Oro",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Olympia: Complete Guide",
        "Authors": "By Spyros Photinos",
        "Description": "",
        "Category": "",
        "Publisher": "Olympic Publications",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Ned and the Gift of Life: A Lesson About Blood (Ned's Head Books)",
        "Authors": "By Madison, Ron",
        "Description": "",
        "Category": " Juvenile Fiction , Health & Daily Living , General",
        "Publisher": "Dr Ron Madison/Ned's Head",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Crime Of Galileo.",
        "Authors": "By Santillana, Giorgio De",
        "Description": "",
        "Category": "",
        "Publisher": "Phoenix Books, Chicago",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Strong Women, Strong Hearts",
        "Authors": "By Nelson, Miriam E., Lindner, Lawrence, and Lichtenstein, Alice H.",
        "Description": "From the distinguished author of the Strong Women health series comes an important book for any woman who wants to take charge of her heart health.  Heart disease kills more women than men each year, yet it is still mistakenly thought of as a \"man's disease.\" In this comprehensive and practical guide, top women's health expert and author Miriam E. Nelson, Ph.D., teams up with heart expert Alice H. Lichtenstein, D.Sc., to present up-to-date advice on diet, exercise, weight loss, stress reduction, and other key strategies tailored specifically for women.  With self-evaluations, checklists, exercises, recipes, and other practical information, as well as the latest research findings, this empowering book will help readers assess their risks, understand their options, and make important changes to improve their heart health.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Stories of Vladimir Nabokov",
        "Authors": "By Nabokov, Vladimir Vladimirovich, Bristol, Barbara (EDT), and Nabokov, Dmitri",
        "Description": "Here, for the first time, the stories of one of the century's greatest prose stylists are collected in a single, comprehensive volume.Written from the early 1920s - the years of his exile from Russia - to the mid-1950s, when he abandoned the story form and turned to his English-language masterpieces Lolita, Pale Fire, and Ada, these stories reveal the fascinating progress of Nabokov's early development as they remind us that we are in the presence of a magnificent original, a genuine master. Edited by his son and translator, Dmitri Nabokov, The Stories of Vladimir Nabokov is a literary event and a celebration of his art.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Knopf",
        "Price Starting With ($)": "47.48",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Frontlines: Snapshots of History",
        "Authors": "By Moore, Nicholas (EDT) and Weiland, Sidney (EDT)",
        "Description": "",
        "Category": " History , Historiography",
        "Publisher": "Ft Pr",
        "Price Starting With ($)": "6.88",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Broken Trust: Greed, Mismanagement & Political Manipulation at America’s Largest Charitable Trust (Latitude 20 Books (Paperback))",
        "Authors": "By King, Samuel P. and Roth, Randall W.",
        "Description": "Princess Bernice Pauahi Bishop was the largest landowner and richest woman in the Hawaiian kingdom. Upon her death in 1884, she entrusted her property--known as Bishop Estate--to five trustees in order to create and maintain an institution that would benefit the children of Hawai‘i: Kamehameha Schools. A century later, Bishop Estate controlled nearly one out of every nine acres in the state, a concentration of private land ownership rarely seen anywhere in the world. Then in August 1997 the unthinkable happened: Four revered kupuna (native Hawaiian elders) and a professor of trust-law publicly charged Bishop Estate trustees with gross incompetence and massive trust abuse. Entitled \"Broken Trust,\" the statement provided devastating details of rigged appointments, violated trusts, cynical manipulation of the trust’s beneficiaries, and the shameful involvement of many of Hawai‘i’s powerful.No one is better qualified to examine the events and personalities surrounding the scandal than two of the original \"Broken Trust\" authors. Their comprehensive account together with historical background, brings to light information that has never before been made public, including accounts of secret meetings and communications involving Supreme Court justices.",
        "Category": " History , United States , State & Local , General",
        "Publisher": "University of Hawaii Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Secrets of Economic Indicators: Hidden Clues to Future Economic Trends and Investment Opportunities, 2nd Edition",
        "Authors": "By Baumohl, Bernard",
        "Description": "“This is the real deal. Baumohl miraculously breathes life into economic indicators and statistics.”  –The Wall Street Journal      “This is the most up-to-date guide to economic indicators and their importance to financial markets in print. The coverage of less-reported indicators, especially those from nongovernment sources, is hard to find elsewhere. The inclusion of the actual published tables helps the newer student of the markets find the data in the public release. For anyone trying to follow the economic data, this should be next to your computer so that you can understand and find the data on the Internet.”  –David Wyss, Chief Economist, Standard and Poor’s     “I find Baumohl’s writing fascinating. In addition to the famous indicators, he includes many that I hadn’t heard of. I really appreciate that he tells you exactly where to find each indicator on the Web. Just about anyone who’s serious about understanding which way the economy is headed will want to read this book. It could be a classic.”  –Harry Domash, Columnist for MSN Money and Publisher, Winning Investing Newsletter      “Bernie Baumohl has accomplished something of real value in The Secrets of Economic Indicators. He has successfully demystified the world of financial and economic news that bombards us in our daily lives. Both professional investors and casual observers of the world of finance and economics will be grateful for what he has done. The constant stream of heretofore bewildering news from the world of business and finance can now be easily understood. Every businessperson or investor should keep a copy of Baumohl’s book close at hand as he or she catches up on the business, stock market, and economic events of the day. It is great, at long last, to have someone who has eliminated what may have been so perplexing to so many and to have done so with such remarkable clarity.”  –Hugh Johnson, Chairman and Chief Investment Officer of Johnson Illington Advisors       “Bernie Baumohl has written a must-read educational and reference book that every individual investor will find indispensable for watching, monitoring, and interpreting the markets. The daily flow of high frequency economic indicators is the stuff that makes financial markets move and that can signal the big trends that make or break investor portfolios. Most important, Bernie’s long experience in reporting economics for Time Magazine helps make the ‘dismal science’ lively and interesting.”  –Allen Sinai, President and Chief Global Economist, Decision Economics, Inc.     “Baumohl has a gift for taking a complicated subject and allowing it to read like a fast-moving novel. My confidence in reading and understanding economic indicators as portrayed in this book made me realize the possibilities this information holds for improving my personal net worth as well as navigating my business toward higher profits. I recommend this book if you care about your future finances.”  –Morris E. Lasky, CEO, Lodging Unlimited, Inc.; Manager and consultant for $6 billion in hotel assets; Chairman, Lodging Conference; Chairman, International Hotel Conference     “I think this is an excellent book. It’s well written, accessible to a variety of readers, deals with an interesting and important subject, and covers the topic well. It deserves to get a lot of notice and use.”  –D. Quinn Mills, Alfred J. Weatherhead, Jr., Professor of Business",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Pearson P T R",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Sex Education Is for the Family",
        "Authors": "By LaHaye, Tim F.",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "Illustrated Handbook of Nursing Care",
        "Authors": "By Springhouse Corporation",
        "Description": "",
        "Category": " Medical , Nursing , Reference",
        "Publisher": "Springhouse Pub Co",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Seven Songs of Merlin (Merlin Saga)",
        "Authors": "By Barron, T. A.",
        "Description": "Young Merlin, triumphant after his  first encounter with the dreaded Rhita Gawr, has brought new hope to Fincayra, the enchanted isle that lies between earth and sky. Yet when a renewed tide of evil arises, its first victim is Merlin's own mother. To save her, Merlin and the forest girl Rhia must follow the perilous path of Seven Songs of Wizardry that has claimed even the lives of great wizards. Most difficult of all, Merlin must discover the secret of seeing not with his eyes, but with his heart.The eagerly anticipated second book in The Lost Years of Merlin epic combines all the passion, power, and spiritual depth that are T.A. Barron's hallmarks. It adds a thrilling new dimension to the legend of Merlin, even as it offers lasting inspiration to us all.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Philomel Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Journey Through the Forest",
        "Authors": "By Cox, Steve, illustrated by",
        "Description": "",
        "Category": "",
        "Publisher": "Books Are Fun, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Distance Manager: A Hands On Guide to Managing Off-Site Employees and Virtual Teams",
        "Authors": "By Fisher, Kimball and Fisher, Mareen Duncan",
        "Description": "Global business demands and new technologies have created a virtual workplace for many companies, with employees and teams routinely collaborating from distant geographical locations on the road, from home, at client sites—even on the other side of the globe. The Distance Manager provides practical information and tools to help managers bridge the communication gaps created by geographical separation, and get peak performance from employees they rarely see. This handbook is perfect for sales managers, project team leaders, senior managers, and anyone who manages people at more than one location. Key topics include:• Using e-mail, teleconferencing, and videoconferencing for maximum effectiveness• Mastering the people skills required to manage from a distance• Virtual team building, and strategies for managing multiple locations",
        "Category": " Computers , Internet , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "100 Questions & Answers About Infertility",
        "Authors": "By Gordon, John D. and DiMattina, Michael, M.D.",
        "Description": "In the United States there are estimated to be 10 million infertile couples and 25% of all women will experience a period of infertility in their lifetime. 1% of all US babies are the result of IVF and over 70,000 cycles of IVF are performed each year in the US.  100 Questions and Answers about Infertility gives authoritative answers to 100 of the most common questions asked by individuals and couples regarding their infertility.",
        "Category": " Reference , Questions & Answers",
        "Publisher": "Jones & Bartlett Learning",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Old Stormalong, the Seafaring Sailor (Folk Tales of America)",
        "Authors": "By York, Carol Beach and Harvey, Paul",
        "Description": "Chronicles the legendary exploits of Alfred Bulltop Stormalong, rumored to have sea water in his veins instead of blood and whose sea adventures include fighting with John Paul Jones and digging up the Panama Canal by sailing across dry land",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Understanding Criminal Law, Third Edition",
        "Authors": "By Dressler, Joshua",
        "Description": "",
        "Category": " Law , General",
        "Publisher": "Lexis Law Pub",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Forging a Real World Faith",
        "Authors": "By MacDonald, Gordon",
        "Description": "Argues that Christian faith can help us face the problems of the real world, and looks at the internal and external challenges of life",
        "Category": "",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Voices of War: Stories of Service from the Home Front and the Front Lines",
        "Authors": "By Wiener, Tom (EDT)",
        "Description": "The experience of war has affected every generation in the 20th and 21st century. Every soldier has a story to tell, and since the year 2000 the Veteran's History Project, a new permanent department of the Library of Congress, has been carefully collecting and preserving the memories of the veterans of all wars. The collection is astonishing in its scope. In addition to more than 50,000 recorded oral histories, the VHP has amassed thousands of letters, photographs, scrapbooks, and invaluable mementos from nearly a century of warfare.In the first book to showcase the richness and depth of this collection historian TK has organized the book into chapters by themes common to all war experiences: Basic Training, First Combat, Courage, Special Bonds, Fate, Fun, and Coming Home. Short introductory essays introduce each topic, but historian TK then allows the veterans their chance to speak, deftly interweaving the letters, photographs, sketches, and pages of compelling oral history of U.S. veterans' experiences in World War I and II, Korea, Vietnam, and the Persian Gulf. Brief connecting passages provide background information where necessary.    Readers will discover the extraordinary memoirs of men like John Casper Wister, a so-called \"ordinary soldier\" who vividly described army life in World War I and tried to warn his fellow soldiers about Germany's threat in the years following the war. They'll experience the courage of soldiers like Bruce Fenchel, who fought all five of the major battles of Europe under the command of General Patton. Blasted in a tank explosion at Chaumont, he hung onto a gas truck with frozen hands long enough to be dropped at a Belgian family home and pub, where he was hidden in the attic. After fierce battles at Bastogne and the Rhine River, he witnessed terrifying sites of torture apparatus and death when his division liberated the Ohrdurf Concentration Camp. They'll meet Red Cross worker Peggy Henry, who was plunged into a harrowing story of survival during the Battle of the Bulge when she and two local women had to flee the advancing German army under cover of darkness. They'll read about the bonds of brotherhood experienced by Walter Morris, who trained the Army's first all-black paratrooper unit. They'll read about families and sweethearts on the homefront, and share the remarkable stories of \"ordinary\" wives like Margerie Gufein, who each month during World War II and the Korean War created a handmade \"Goofein Journal\" to update her husband on family happenings. Photographs of these touching homemade newspapers illustrate the text. They'll share the extraordinary story of a husband and wife who volunteered to go to Vietnam together rather than be separated by the draft, and meet Rod Hinsh, an army special forces fighter assigned to the highly unusual task of guarding USO performer Martha Ray during the Vietnam War. Twenty-three years after the war, Ray vividly recalled their first meeting. They'll also see how the legacy of war continues in the modern world, experiencing how the story of was has changed with emails, digital photographs, and embedded journalists. And finally they'll read the heartwarming tale of Ray Shipley, a veteran of World War II and Korea, who each day for the past two months has been rising at 6am to go to BWI airport to extend a handshake and free phone cards to soldiers returning from Iraq on leave. Though he has no official authority, he carries their bags, points them to their connecting flight, and never forgets to say \"welcome home.\"    Through the diverse stories collected in this volume emerges the moving story of America at war. This is a book that will provoke memories and thoughtful reflection and truly celebrate the sacrifices made by the millions of veterans who have fought to defend our freedom. The experience of war has affected every generation in the 20th and 21st century. Every soldier has a story to tell, and since the year 2000 the Veteran's History Project, a new permanent department of the Library of Congress, has been carefully collecting and preserving the memories of the veterans of all wars. The collection is astonishing in its scope. In addition to more than 50,000 recorded oral histories, the VHP has amassed thousands of letters, photographs, scrapbooks, and invaluable mementos from nearly a century of warfare.In the first book to showcase the richness and depth of this collection historian TK has organized the book into chapters by themes common to all war experiences: Basic Training, First Combat, Courage, Special Bonds, Fate, Fun, and Coming Home. Short introductory essays introduce each topic, but historian TK then allows the veterans their chance to speak, deftly interweaving the letters, photographs, sketches, and pages of compelling oral history of U.S. veterans' experiences in World War I and II, Korea, Vietnam, and the Persian Gulf. Brief connecting passages provide background information where necessary.    Readers will discover the extraordinary memoirs of men like John Casper Wister, a so-called \"ordinary soldier\" who vividly described army life in World War I and tried to warn his fellow soldiers about Germany's threat in the years following the war. They'll experience the courage of soldiers like Bruce Fenchel, who fought all five of the major battles of Europe under the command of General Patton. Blasted in a tank explosion at Chaumont, he hung onto a gas truck with frozen hands long enough to be dropped at a Belgian family home and pub, where he was hidden in the attic. After fierce battles at Bastogne and the Rhine River, he witnessed terrifying sites of torture apparatus and death when his division liberated the Ohrdurf Concentration Camp. They'll meet Red Cross worker Peggy Henry, who was plunged into a harrowing story of survival during the Battle of the Bulge when she and two local women had to flee the advancing German army under cover of darkness. They'll read about the bonds of brotherhood experienced by Walter Morris, who trained the Army's first all-black paratrooper unit. They'll read about families and sweethearts on the homefront, and share the remarkable stories of \"ordinary\" wives like Margerie Gufein, who each month during World War II and the Korean War created a handmade \"Goofein Journal\" to update her husband on family happenings. Photographs of these touching homemade newspapers illustrate the text. They'll share the extraordinary story of a husband and wife who volunteered to go to Vietnam together rather than be separated by the draft, and meet Rod Hinsh, an army special forces fighter assigned to the highly unusual task of guarding USO performer Martha Ray during the Vietnam War. Twenty-three years after the war, Ray vividly recalled their first meeting. They'll also see how the legacy of war continues in the modern world, experiencing how the story of was has changed with emails, digital photographs, and embedded journalists. And finally they'll read the heartwarming tale of Ray Shipley, a veteran of World War II and Korea, who each day for the past two months has been rising at 6am to go to BWI airport to extend a handshake and free phone cards to soldiers returning from Iraq on leave. Though he has no official authority, he carries their bags, points them to their connecting flight, and never forgets to say \"welcome home.\"    Through the diverse stories collected in this volume emerges the moving story of America at war. This is a book that will provoke memories and thoughtful reflection and truly celebrate the sacrifices made by the millions of veterans who have fought to defend our freedom.",
        "Category": " History , Military , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Scarlet Contessa: A Novel of the Italian Renaissance",
        "Authors": "By Kalogridis, Jeanne",
        "Description": "What Philippa Gregory has done for Tudor England, Jeanne Kalogridis does for Renaissance Italy. Her latest irresistible historical novel is about a countess whose passion and willfulness knew no bounds—Caterina Sforza Daughter of the Duke of Milan and wife of the conniving Count Girolamo Riario, Caterina Sforza was the bravest warrior Renaissance Italy ever knew. She ruled her own lands, fought her own battles, and openly took lovers whenever she pleased. Her remarkable tale is told by her lady-in-waiting, Dea, a woman knowledgeable in reading the “triumph cards,” the predecessor of modern-day Tarot. As Dea tries to unravel the truth about her husband’s murder, Caterina single-handedly holds off invaders who would steal her title and lands. However, Dea’s reading of the cards reveals that Caterina cannot withstand a third and final invader—none other than Cesare Borgia, son of the corrupt Pope Alexander VI, who has an old score to settle with Caterina. Trapped inside the Fortress at Ravaldino as Borgia’s cannons pound the walls, Dea reviews Caterina’s scandalous past and struggles to understand their joint destiny, while Caterina valiantly tries to fight off Borgia’s unconquerable army.",
        "Category": " Fiction , Historical , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Carver",
        "Authors": "By Radin",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Resurrection Men",
        "Authors": "By Welsh, T. K.",
        "Description": "Set in London in 1830 where the selling of human corpses to those in science has become a lucrative business, twelve-year-old Victor is aware that his body would fetch a good price and so must watch out for those who mean to do him harm while working to put a stop to their evil ways.Set in London in 1830 where the selling of human corpses to those in science has become a lucrative business, twelve-year-old Victor is aware that his body would fetch a good price and so must watch out for those who mean to do him harm while working to put a stop to their evil ways.",
        "Category": " Young Adult Fiction , Historical , Europe",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "100 Places Every Woman Should Go",
        "Authors": "By Griest, Stephanie Elizondo",
        "Description": "With its breezy reviews and insightful advice, 100 Places Every Woman Should Go encourages women of any age to see the world &#151; in a group, with a friend, or solo &#151; and inspires them to create their own list of dreams. Based on her own explorations of many countries, states, and regions, and on interviews with travelers, award-winning author Stephanie Elizondo Griest highlights 100 special destinations and challenging activities &#151; from diving for pearls in Bahrain to racing a camel, yak, or pony across Mongolia; to dancing with voodoo priestesses in Benin and urban cowboys in Texas; to taking a mud bath in a volcano off the coast of Colombia. Divided into such sections as &#147;Places Where Women Made History,” &#147;Places of Indulgence,” and &#147;Places of Adventure,” this guidebook includes timely contact information, resources, and recommended reading. &#147;Ten Tips For Wandering Women” features safety precautions plus pointers on haggling, packing, and staying parasite-free. Vivid portraits of free spirits like Frida Kahlo (&#147;A tequila-slamming, dirty joke-telling smoker, this famous artist was bisexual and beautiful”) help travelers expand their experience.",
        "Category": " Travel , Reference",
        "Publisher": "Travelers' Tales",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Blood Accusation: The Strange History of the Beiliss Case",
        "Authors": "By Samuel, Maurice",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "26.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Dancing in the Arms of God: Finding Intimacy and Fulfillment by Following His Lead",
        "Authors": "By Neal, Connie",
        "Description": "The author describes the fulfillment she has experienced as a Christian by allowing God to help her reach her spiritual potential",
        "Category": " Religion , Inspirational",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Her Corner Office: A Guide To Help Women Find A Place And A Voice In Corporate America",
        "Authors": "By Bourgeois, Trudy",
        "Description": "",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Brown Books Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    }
]