[
    {
        "Title": "Legend & Legacy:  The Story of Boeing and Its People",
        "Authors": "By Serling, Robert J",
        "Description": "The name Boeing evokes vivid images, from the B-17 Flying Fortresses of World War II to the 707 and 747 jet transports that revolutionized air travel. Less well known: The Boeing Company built the first stage of the Saturn rocket that started men on the way to the moon, developed the Minuteman missile system, and is now designing America's space station. Boeing jets, in service around the globe, carry 675 million passengers annually--the equivalent of twelve percent of the world's population.Behind the statistics and the awe-inspiring aircraft is a company of paradoxes, a vast organization nimble enough to take daring market risks that have kept it at the top of its industry. Robert J. Serling, forty-five years an award-winning aviation writer, takes the reader behind the scenes with humor, objectivity, and abundant anecdotes: Boeing once went seventeen months without seeing a single domestic jetliner and came close to bankruptcy. One of its legendary test pilots unexpectedly barrel-rolled a prototype jetliner, into which the company had sunk one-quarter of its net worth, because he thought the stunt would help sell the airplane. Legend and Legacy, Robert J. Serling's most ambitious work to date, reads like a novel, complete with memorable characters who, despite occasional stumbles, helped win the war and conquer the commercial skies: The salesman who almost traded a used 727 for $12 million worth of underwear. The vice president who worked in a darkened office illuminated by a single, low-wattage light bulb. The gifted, driven engineers who did the impossible, by yesterday.Never in its seventy-five years has Boeing been so revealingly profiled. This book is must-reading for anyone fascinated by the history of aviation.",
        "Category": " Business & Economics , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "6.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Lesbian Passion: Loving Ourselves and Each Other",
        "Authors": "By Loulan, Joann and Nelson, Mariah Burton",
        "Description": "",
        "Category": " Social Science , LGBT Studies , Lesbian Studies",
        "Publisher": "Spinsters Ink",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Unleashing Your Potential: Discovering Your God-Given Opportunities for Ministry",
        "Authors": "By Tillapaugh, Frank R.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "The Living Language Non-Connoisseur's Menu Guide: to Ordering and Enjoying French, Italian, Latin American and Spanish Cuisine (LL NonConnoisseur Menu Gde(TM))",
        "Authors": "By D'Aprix, David",
        "Description": "With The Non-Connoisseur's Menu Guide, you'll never again feel intimidated by a menu full of unfamiliar, unpronounceable terms.Want to avoid getting served stewed gizzards when you intended to order grilled chicken? To finally know the difference between fusilli and penne? And exactly how to pronounce Pouilly-Fuissé? This guide has the answers (and the reassurance) you're looking for.Easy-to-follow pronunciation guides throughoutTips for selecting winesGuide to coffeesTipping chartCultural hintsSuggested dining selectionsGreat pointers so you can dine like a seasoned pro!With The Non-Connoisseur's Menu Guide, you'll impress your friends, your business associates, your dates, and even yourself!",
        "Category": " Foreign Language Study , Multi-Language Phrasebooks",
        "Publisher": "Living Language",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "America Firsthand: Readings in American History; (Volume 1) From Settlement to Reconstruction",
        "Authors": "By Robert D. Marcus, David Burner",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Official Exceptions to the Rules of Golf: A Rule Book That Lets You Play Golf Your Way",
        "Authors": "By Beard, Henry, Boswell, John, and Lewis, Ken (ILT)",
        "Description": "A humorous guide to the exceptions in the rules of golf, specially created for inept golfers, features amusing line drawings. By the author of Latin for Even More Occasions. 50,000 first printing.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Villard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "The Recipes of the Five Brothers: Volume I",
        "Authors": "By Leah Rosch",
        "Description": "",
        "Category": "",
        "Publisher": "Van den Bergh Foods",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Clinton: Young Man in a Hurry",
        "Authors": "By Moore, Jim",
        "Description": "Traces the life and political career of Governor Clinton, assesses his accomplishments in Arkansas, and looks at his campaign for the presidential nomination",
        "Category": " History , General",
        "Publisher": "The Summit Publishing Group",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "New York Times Book of Personal Finance",
        "Authors": "By Sloane, Leonard",
        "Description": "",
        "Category": "",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Mary Kay",
        "Authors": "By Ash, Mary Kay",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Pandora",
        "Authors": "By Rice, Anne",
        "Description": "Anne Rice, creator of the Vampire Lestat, the Mayfair witches and the amazing worlds they inhabit, now gives us the first in a new series of novels linked together by the fledgling vampire David Talbot, who has set out to become a chronicler of his fellow Undead.The novel opens in present-day Paris in a crowded café, where David meets Pandora. She is two thousand years old, a Child of the Millennia, the first vampire ever made by the great Marius. David persuades her to tell the story of her life.Pandora begins, reluctantly at first and then with increasing passion, to recount her mesmerizing tale, which takes us through the ages, from Imperial Rome to eighteenth-century France to twentieth-century Paris and New Orleans. She carries us back to her mortal girlhood in the world of Caesar Augustus, a world chronicled by Ovid and Petronius. This is where Pandora meets and falls in love with the handsome, charismatic, lighthearted, still-mortal Marius. This is the Rome she is forced to flee in fear of assassination by conspirators plotting to take over the city. And we follow her to the exotic port of Antioch, where she is destined to be reunited with Marius, now immortal and haunted by his vampire nature, who will bestow on her the Dark Gift as they set out on the fraught and fantastic adventure of their two turbulent centuries together.",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Glimmering",
        "Authors": "By Hand, Elizabeth",
        "Description": "It is 1999. The Last Days, say some; the First, say others. The climate has altered irrevocably, the cities have imploded into vicious shards, and the stars haven't been seen for months. The sky is a shimmering arras of reds and greens and golds, the result of global warming, it is thought.Jack Finnegan, publisher of the world's last literary magazine, is dying of AIDS while he watches the floodwaters rise toward his decaying mansion on the Hudson. Trip Marlowe, a rock star addicted to the wild glories of the hallucinogenic drug IZE, is immortalizing himself as a digital VR icon. Marz Candry, the \"Hyacinth Girl\" blooming under the canopy of the Glimmering, is waiting to bear Trip's child, while the fellahin and their underground cults are preparing the frenzies of the Night of the Thousand Years.All these and more are drawn in to the seductive web of Leonard Thrope, the Warhol-like \"sociocultural pathologist\" who arrives from the East with his entourage bearing a gift: an elixir developed by an exiled scientist in a Tibetan lamasery. Jack (who tries everything, on principle) finds he is no longer HIV positive, no longer dying. Thanks to Fusax, something far more terrible, far more wonderful, far more unexpected is about to happen to Jack Finnegan and his world.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Harper Prism",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Technical Writing: Situations and Strategies",
        "Authors": "By Markel, Michael H.",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "How To Make Love To A Man (safely): A new, intimate guide to sexy sex in the nineties",
        "Authors": "By Penney, Alexandra",
        "Description": "The author of How to Make Love to a Man tackles sex in the 1990s with advice on erotically discussing the issue of condoms, U-spot orgasms, the coital alignment technique, and more. 100,000 first printing. $100,000 ad/promo. Tour.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Priceless Gift: The Poems of Helen Steiner Rice",
        "Authors": "By Rice, Helen Steiner",
        "Description": "",
        "Category": "",
        "Publisher": "Littlebrook Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Nuclear Ethics",
        "Authors": "By Nye, Joseph S.",
        "Description": "Discusses the methods of moral reasoning, the evaluation of moral arguments, nuclear war theory, the policy of nuclear deterrence, and the effect of nuclear weapons on nonnuclear powers",
        "Category": " History , Military , Nuclear Warfare",
        "Publisher": "Free Press",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "The New Joy of Sex: A Gourmet Guide to Lovemaking in the Nineties, Compact Edition",
        "Authors": "By Comfort, Alex",
        "Description": "The classic best-seller is now available in a condensed, more affordable, compact edition. With graphic illustrations and explicit advice about sexual techniques and positions, combined with a tender appreciation of the power of love to enhance sexual pleasure, The New Joy of Sex, Compact Edition will bring Joy to its widest readership yet.",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "And Then Arnie Told Chi Chi . . . ",
        "Authors": "By Wade, Don",
        "Description": "\"Once in a while I substitute my name into the stories and impress my friends with all the fun stuff that has happened to me.\" -- Gary McCord CBS Sports  \"Lots of hearty laughs. . . . Recommended for sports collections.\" -- Library Journal  This new collection from the author of the bestselling \"And Then Jack Said to Arnie . . . \" brings out the locker room and onto the tee an engaging treasury of more than 200 of the greatest golf stories every told--stories about tough lies, great putts, and amazing recoveries--from the game's greats: Ben Hogan, Nancy Lopez, Fuzzy Zoeller, Tommy Bolt, Fred Couples, Lee Trevino, and others. You will learn about Harvey Penick's advice to a young Tom Kite, the humorous antics of Bob Hope and Bing Crosby at the famed Pebble Beach Golf Links, Jack Nicklaus's superstitions, and Seve Ballesteros's bout with the press. From Augusta National to Royal St. George's, this entertaining, intimate, and just plain funny book will take you onto some of the best courses alongside the greatest players in the world.   Don Wade, a senior editor at Golf Digest magazine, has been covering professional golf and collecting true stories about the game since the 1970s. He has written books with Ken Venturi, Sam Snead, Amy Alcott, and Nancy Lopez. He lives in Stamford, Connecticut.   Paul Szep is a two-time Pulitzer Prize-winning cartoonist.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Sign of the Chrysanthemum (Harper Trophy Book)",
        "Authors": "By Paterson, Katherine",
        "Description": "Muna has never known his father -- a samurai, a noble warrior. But Muna's mother has told Muna how he will know him one day: by the sign of the chrysanthemum. When his mother dies, Muna travels to the capital of twelfth-century Japan, a bewildering city on the verge of revolution. He finds a haven there, as servant to the great swordsmith, Fukuji. But Muna cannot forget his dream: He must find his father. Only then will he have power and a name to be reckoned with. Only then will he become a man.",
        "Category": " Juvenile Fiction , Historical , Asia",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Wine of Astonishment",
        "Authors": "By MacKenzie, Rachel",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "May",
            "Year": "1974"
        }
    },
    {
        "Title": "New Age Globalism: Humanist Agenda for Building a New World Without God",
        "Authors": "By Rowe, Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Growth Pub & Distributing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "The Fortune",
        "Authors": "By Korda, Michael",
        "Description": "When Arthur Bannerman, a controversial and wealthy man, dies and leaves his young widow, Alexa Walden, his entire fortune, the Bannerman family is split apart",
        "Category": " Fiction , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Sports Illustrated Greatest Pictures: Memorable Images from Sports History",
        "Authors": "By Sports Illustrated (EDT)",
        "Description": "A collection of photographs from Sports Illustrated magazine records the greatest moments in sports, including scenes from the Olympics, boxing confrontations, and the worlds of baseball and football",
        "Category": " Sports & Recreation , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Pets (Child's First Library of Learning)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Explores the world of pets, providing information on animal characteristics and behavior in question and answer format.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Srengthen Your Immune System",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "Introduces a wide range of effective strategies for enhancing the body's disease-fighting capabilities, including a healthy diet, nutritional and herbal supplements, a definitive exercise program, good sleeping habits, and the development of a positive outlook on life.",
        "Category": " Health & Fitness , Diseases , Immune & Autoimmune",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Classic Patchwork and Quilting",
        "Authors": "By Echols, Margit",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The Writer's Ultimate Research Guide",
        "Authors": "By Metter, Ellen",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Escher Twist: A Homer Kelly Mystery",
        "Authors": "By Langton, Jane",
        "Description": "Cambridge, Massachusetts: home to Homer and Mary Kelly, Harvard University, the Mount Auburn Cemetery, and...Leonard Sheldrake. Leonard, Homer's friend, often compares the many-faceted city of Cambridge to a favorite engraving, filled with strange power and wonder, by the twentieth-century Dutch artist Maurits Escher. Leonard is a huge fan of the artist and is thrilled when Cambridge hosts an Escher exhibit. While basking in all-things-Escher during his first visit to the gallery, he meets a woman in a green coat - Frieda - who is equally enthralled by Escher's brilliance. Leonard falls instantly in love - but Frieda hurries away without telling him her last name, her address, or her phone number - though she does hint that if he knew more about her, he would not love her.Despite Frieda's warning and their all-too-brief encounter, Leonard is now desperately in love with this elusive woman - and desperate to find her. So Homer and Mary offer to help - but looking for her makes them feel as if they were lost in an Escher labyrinth as they encounter murders of the past, secrets of today, modern fortune-tellers, and the ghosts of Mount Auburn Cemetery.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Handy Space Answer Book",
        "Authors": "By Phillis Engelbert, Diane L. Dupuis",
        "Description": "",
        "Category": "",
        "Publisher": "Visible Ink Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "ALF A Day At The Fair (Alf Storybooks Ser.)",
        "Authors": "By Hill, Johnson and Doty, Eldon (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "Checkerboard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Book of Country Herbal Crafts/a Step-By-Step Guide to Making over 100 Beautiful Wreaths, Garlands, Bouquets-And Much More",
        "Authors": "By Cusick, Dawn",
        "Description": "A detailed guide to country-style herbal crafts features complete directions, materials lists, and step-by-step illustrations for creating more than one hundred craft projects",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The Woman's Day Book of Weekend Crafts: More Than 100 Quick-To-Finish Projects",
        "Authors": "By Houghton Mifflin Company",
        "Description": "Provides techniques for completing even a fairly complicated craft project in a short period of time and presents projects to occupy a short evening or a long weekend",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1978"
        }
    },
    {
        "Title": "Scare Tactics",
        "Authors": "By Farris, John",
        "Description": "A selection of five original tales of horror, accompanied by \"The Guardian,\" a full-length novel about a child enmeshed in a web of evil and terror",
        "Category": " Fiction , Horror",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Love for a Lifetime: Building a Marriage That Will Go the Distance",
        "Authors": "By Dobson, James C.",
        "Description": "The bestselling Gold Medallion winner Love for a Lifetime has brought hope, harmony, and healing to millions of homes worldwide, giving men and women powerful and biblical insights for building lasting marital harmony. Encouraging and practical, this proven classic is perfect for every husband and wife who want to strengthen and celebrate their marriage relationship.The joining of husband and wife in marriage is the most fulfilling human relationship possible. There is nothing like being loved unconditionally and intimately, decade after decade, by someone who promises to be there for better or for worse for the remaining days of your lives. For this reason, nurturing and celebrating each other is the most important investment of time and energy you can make as a couple. And millions around the world can testify, the surest way to preserving a marriage is by applying the principles outlined in God's Word. With Bible-based insights shared by today's foremost family advocate, Love for a Lifetime is a modern classic. This newly updated edition delivers the wisdom that will bring success to your marriage... for as long as you both shall live.Story Behind the BookFor every ten marriages in America today, five will end in bitter conflict and divorce. And only one or two couples in ten will achieve what might be called \"intimacy\" in their marriages. This book helps keep readers from being passive victims in the unfolding drama of their lives together. They can build a stable, satisfying, intimate relationship that will withstand the storms of life. All they need is a little wise counsel...and a burning desire to succeed. Based on information from a panel of successfully married couples, on the research of respected experts in the field, and on the principles endorsed by the Creator of families Himself, Love for a Lifetime is designed to help couples do just that.",
        "Category": " Religion , Inspirational",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "No Bad Dogs the Woodhouse Way",
        "Authors": "By WOODHOUSE,BARBARA",
        "Description": "",
        "Category": "",
        "Publisher": "Summit",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The New Saltwater Aquarium Handbook",
        "Authors": "By Blasiola, George",
        "Description": "Provides practical information for setting up and maintaining a marine aquarium with sections on fish selection, and more",
        "Category": " Nature , General",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Growing Up Reading: Sharing With Your Children the Joys of Reading (Highlights for Children)",
        "Authors": "By Lamme, Linda Leonard",
        "Description": "Explains how children learn to read, and discusses reading comprehension, word recognition, and the development of good reading habits",
        "Category": " Education , General",
        "Publisher": "Acropolis Books Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "The One Tree (The Second Chronicles of Thomas Covenant, Book 2)",
        "Authors": "By Donaldson, Stephen R.",
        "Description": "Thomas Covenant and Dr. Linden Avery search for the One Tree from which Covenant must fashion a new Staff of Life, an essential tool in his battle with Lord Foul",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Don't Say a Word",
        "Authors": "By Klavan, Andrew",
        "Description": "Psychiatrist Nathan Conrad confronts urban paranoia and murderous insanity when his family is watched and followed, and later brutalized, by a criminal with a twisted mind and a mad giant who thrives on the suffering of others",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Nature of Human Consciousness (A Book of Readings)",
        "Authors": "By Ornstein, Robert E.",
        "Description": "Scientists from diverse disciplines explore the origins, nature, and processes of both the intuitive and intellectual modes of human awareness",
        "Category": " Psychology , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "March",
            "Year": "1974"
        }
    },
    {
        "Title": "The Princessa: Machiavelli for Women",
        "Authors": "By Rubin, Harriet",
        "Description": "A legacy of leadership for women only.For centuries men have used the lessons of Machiavelli's The Prince to gain and hold power. Today's women, struggling to succeed in a man's world, must learn a crucial lesson of their own: men and women are not equal--and that is a woman's greatest strength. From the wars of intimacy to battles of public life, whether confronting bosses, competitors, or lovers, the greatest power belongs to the woman who dares to use the subtle weapons that are hers alone.This provocative work urges women to claim what they want and deserve, offering a bold new battle plan that celebrates a woman's unique gifts: passion and intuition, sensitivity and cunning. It draws from history's legendary female divas and poets, saints and sinners, artists and activists--who, armed with a desire for justice and a spirit of outrageousness, achieved their impossible dreams. Their lasting legacy is codified in The Princessa: act like a woman, fight like a woman, and life will be yours to command.",
        "Category": " Literary Criticism , Women Authors",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Better Homes and Gardens Dieting for One (Better Homes & Gardens Books)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "That makes me angry! (CTW Sesame Street a growing-up book)",
        "Authors": "By Best, Anthony",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books Publishing Co., Inc. in cooperation with Children's Television Workshop",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Wild Horses",
        "Authors": "By Francis, Dick",
        "Description": "Once a blacksmith, now famous and respected as a newspaperman, Valentine Clark knows everyone who is anyone in the racing world. Aged, confused, blind and dying, he harbors a daunting secret that he is desperate to be rid of. He makes his last confession to his visiting film-director friend, Thomas Lyon, whom in his delirium he mistakes for a priest. Unburdened and at peace, Valentine passes away, yet his legacy remains, guarded by Thomas.On location in Newmarket, Thomas is troubled by the old man's secret. Seeking to understand this puzzling revelation, he uncovers a long-unsolved mystery that he soon finds is very much unforgotten. But as much as he wants to learn more, it seems he already knows too much. Imaginative and decisive though he may be, he will need superhuman courage and extreme cunning to stay alive.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Sleep Right in Five Nights: A Clear and Effective Guide for Conquering Insomnia",
        "Authors": "By Perl, James, Ph.D.",
        "Description": "A psychologist and sleep specialist reviews new research into insomnia disorders and provides self-diagnostic tips, sleep-inducing techniques, and evaluations of available medicines. 35,000 first printing. $15,000 ad/promo.",
        "Category": " Medical , General",
        "Publisher": "Quill",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Future Hope: A Jewish Christian Look at the End of the World",
        "Authors": "By David Brickner",
        "Description": "",
        "Category": "",
        "Publisher": "Purple Pomegranate Productions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Starlight and Candles: The Joys of the Sabbath",
        "Authors": "By Manushkin, Fran and Chwast, Jacqueline (ILT)",
        "Description": "Follows two children, Jake and Rosy Jacobson, as they prepare for the Sabbath--their father buys the wine, their mother makes the soup, and Jake and Rosy have to mix and knead the dough for challah.",
        "Category": "",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Classic Mountain Bike Rides: Thirty of the World's Most Spectacular Trails",
        "Authors": "By Crowther, Nicky (EDT)",
        "Description": "An informative, richly illustrated look at thirty of the world's finest off-road bike trails capture the local character, flora and fauna, and scenic landscapes of treks through the Himalayas, pryenees, Caucasus, Rockies, and other locales, accompanied by specially commissioned maps, route difficulty ratings, travel dates, essential equipment, and local customs. 25,000 first printing.",
        "Category": " Sports & Recreation , Hiking",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Managers as Mentors",
        "Authors": "By Bell, Chip R.",
        "Description": "This latest edition of the classic Managers as Mentors is a rapid-fire read that guides leaders in helping associates grow in today’s tumultuous organizations. Thoroughly revised throughout with twelve new chapters, this edition places increased emphasis on the mentor acting as a learning catalyst with the protégé rather than simply handing down knowledge.  As with previous editions, a fictional case study of a mentor-protégé relationship runs through the book. But now this is augmented with interviews with six top US CEOs. New chapters cover topics such as the role of mentoring in spurring innovation and mentoring a diverse and dispersed workforce accustomed to interacting digitally. Also new to this edition is the Mentor’s Toolkit, six resources to help in developing the mentor-protégé relationship. This hands-on guide teaches leaders to be the kind of confident coaches integral to learning organizations.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Photograph Weddings, Groups, & Ceremonies (How to Do It Books)",
        "Authors": "By Burk, Tom",
        "Description": "Advice on taking single and group portraits is accompanied by tips on equipment, poses, planning, pricing, and printing considerations",
        "Category": " Photography , General",
        "Publisher": "HP Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    },
    {
        "Title": "Ageless Body, Timeless Mind: A Companion Guide and Journal",
        "Authors": "By Chopra, Deepak",
        "Description": "Through the daily practice of a variety of exercises, the user of this guide and journal may achieve a life dominated by growth and evolution. The journal-keeper's own life may be traced through the pages of this beautifully designed book. In these pages the reader will find one of Dr. Chopra's most powerful In Practice guides. 2-color line drawings.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Starry, Starry Night: Three Holiday Stories",
        "Authors": "By McDaniel, Lurlene",
        "Description": "In \"Christmas Child,\" fifteen-year-old Melanie struggles with the death of a new baby sister; while in \"Last Dance,\" Brenda struggles with her feelings over a dying boy; and in \"Kathy's Life,\" a teen who has it all discovers otherwise. Tour.",
        "Category": " Young Adult Fiction , Holidays & Celebrations",
        "Publisher": "Bantam Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Grill It! Vegetarian: Over 80 Meat-free Recipes To Revolutionize Your Cooking",
        "Authors": "By Walden, Hilaire and McDowall, Anne (EDT)",
        "Description": "Definitely not just for vegetarians, Grill It! Vegetarian contains more than 90 delectable, healthful recipes for appetizers, snacks, dips, entrees, and accompaniments based on fresh seasonal produce. Savor Radicchio with Mozzarella, Japanese Grilled Eggplant, Vegetable Kebobs with Cilantro Sauce, and dozens more meatless dishes whose flavors are enhanced by open-fire cooking. A chapter on desserts also offers fabulous recipes for grilled fruits and sauces. Gorgeously illustrated with full-color photographs, it's a great grilling resource for any time of year.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Daily Word: Love, Inspiration, and Guidance for Everyone",
        "Authors": "By Zuck, Colleen (EDT)",
        "Description": "For years, Daily Word magazine has provided a lifetime of inspiration and guidance to over 6 million readers. Now for the first time, readers have one comprehensive daily guide filled with 365 uplifting prayers. A beautiful way to celebrate each and every day--to add spiritual renewal and direction to our daily routine--this book is the perfect companion for our journey through life...A One Spirit Book Club main selectionA Book-of-the-Month Club? alternate selection",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "How to Hit/How to Pitch",
        "Authors": "By Cluck, Bob",
        "Description": "Tells how to analyze and correct one's own hitting or pitching problems, and suggests practice drills",
        "Category": " Sports & Recreation , Coaching , Baseball",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Praying to the God you can trust",
        "Authors": "By Anderson, Leith",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Seeding",
        "Authors": "By Shobin, David",
        "Description": "Their investigation of the mysterious, sudden, cancerous deaths of nearly two hundred young, postpartum women leads Dr. Craig Erikson and his colleagues to certain plant-based diseases and clues to a centuries-old civilization",
        "Category": " Fiction , Horror",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "Breaking the Ice (Silver Blades, No. 1)",
        "Authors": "By Lowell, Melissa",
        "Description": "When Nikki Simon makes the Silver Blades skating club, she worries that being a member of the club will be tougher than she expected, especially if she must complete a difficult double flip jump. Original.",
        "Category": " Juvenile Fiction , Sports & Recreation , Hockey",
        "Publisher": "Skylark",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Chicago's Famous Buildings A Photographic Guide to the City's Architectural Landmarks and Other Notable Buildings",
        "Authors": "By Bach, Ira J. (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Every Man for Himself (Bainbridge, Beryl)",
        "Authors": "By Bainbridge, Beryl",
        "Description": "On Wednesday, April 10, 1912, the RMS Titanic left Southampton on her maiden voyage to New York. Four days later, half an hour before midnight, she struck an iceberg. By 2 a.m. the last lifeboat had rowed frantically away. Minutes later the great ship sank. Fifteen hundred people had lost their lives.Every Man for Himself recaptures those four crucial days at the end of the Belle Epoque. J. Pierpont Morgan's nephew, en route to New York, has booked passage on the world's most luxurious ocean liner. His companions include a host of Guggenheims, Vanderbilts, and upper crust fellow travelers. It is a voyage of black-tie dining and moonlight serenades, of illicit romances and reserved travelers with shadowy pasts. The young Morgan soon finds his destiny linked to those of his shipmates, memorable personalities all, as the great ship sails toward her fate. But the Titanic's destiny may not be unknown to everyone on board: just hours before tragedy strikes, one of the passengers is heard to remark, \"Have you not yet learned that it's every man for himself?\" Bainbridge vividly recreates each scene of the voyage, from the suspicious fire in the Number 10 coal boiler, to the champagne and crystal of the first-class public rooms, to that terrible midnight chaos in the frigid North Atlantic. This remarkable, haunting tale confirms Bainbridge as a consummate observer of human behavior and the human condition.",
        "Category": " Fiction , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Straight Cut",
        "Authors": "By Bell, Madison Smartt",
        "Description": "In this story of romantic duplicity, drug deals, and double-crosses, Tracy discovers that the film editing job in Rome offered to him by an old friend is not all it seems",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Remember the Morning",
        "Authors": "By Fleming, Thomas J.",
        "Description": "Set in pre-Revolutionary America, Remember the Morning tells the story of Catalyntie Van Vorst, the first in a long line of strong-minded women in the Stapleton lineage. A brilliant businesswoman, as were many of the Dutch of her era, Catalyntie is also a troubled person who struggles to resolve the conflicts created by growing up captive in a Seneca Indian village. Deeply involved in her life is the beautiful, extraordinarily gifted black woman, Clara Flowers, who shared this captivity with Catalyntie. They also share a love for the same man.",
        "Category": " Fiction , Historical",
        "Publisher": "Forge",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Proud Flesh",
        "Authors": "By Humphrey, William",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "April",
            "Year": "1973"
        }
    },
    {
        "Title": "Pandaemonium: Ethnicity in International Politics",
        "Authors": "By Moynihan, Daniel Patrick",
        "Description": "Ten years before the Soviet Union collapsed, Senator Daniel Patrick Moynihan stood almost alone in predicting its demise.  As the intelligence community and cold war analysts churned out statistics demonstrating the enduring strength of the Moscow regime, Moynihan, focusing on ethnic conflict, argued that the end was at hand.  Now, with such conflict breaking out across the world, from Central Asia to South Central Los Angeles, he sets forth a general proposition: Far from vanishing, ethnicity has been and will be an elemental force in international politics.      Drawing on a lifetime of scholarship, the Senator provides in Pandaemonium a subtle, richly textured account of the process by which theory has grudgingly begun to adapt to reality.  Moynihan--whose previous studies range over thirty years from Beyond the Melting Pot (with Nathan Glazer) to the much acclaimed On the Law of Nations--provides a deep historical look at ethnic conflict around the globe.  He shows how the struggles that now absorb our attention have been going on for generations and explain much of modern history.  Neither side in the cold war grasped this reality, he writes. Neither the liberal myth of the melting pot nor the Marxist fantasy of proletarian internationalism could account for ethnic conflict, and so the international system stumbled from one set of miscalculations to another.      Toward the close of World War I, Woodrow Wilson declared the \"self-determination of peoples\" to be an Allied goal for the peace.  Toward the end of World War II, Josef Stalin inserted \"self-determination of peoples\" into Article I of the United Nations Charter, defining \"The Purposes\" of the new world organization.  This process has been going on ever since.  The first phase, the breaking up of empire, was relatively peaceful.  The second phase, presaged by the 1947 partition of India, is certain to be far more troubled, as fifty to a hundred new countries emerge.      Moynihan argues, however, that a dark age of \"ethnic cleansing\" is not inevitable; that the dynamics of ethnic conflict can be understood, anticipated, moderated.  Ethnic pride can be a source of dignity and of stability, if only its legitimacy is accepted.  Moynihan writes in a learned, reflective voice: at times theoretical, but always in the end directed to issues of fierce immediacy.  A splendid achievement, Pandaemonium begins the re-education of Western diplomacy.",
        "Category": " Literary Collections , European , English, Irish, Scottish, Welsh",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "A Love Divine",
        "Authors": "By Ripley, Alexandra",
        "Description": "The sea called to Joseph of Arimathea the way a woman calls to her lover. From the time he was twelve years old, he could not resist his desire to sail for distant horizons. He had one other passion: Sarah, a dark-haired sprite of a woman whom he had loved from his childhood days. As a Jew during the Roman occupation of Palestine, Joseph would have to fight for both his loves.Combining impeccable historical research with a story of incredible power, Alexandra Ripley re-creates Joseph of Arimathea's life and times. From the dusty roads of Palestine to the marble palaces of Rome to the fierce barbarian villages of ancient Britain, Joseph journeys toward destiny. He will nearly lose Sarah in a forced marriage to another, play a dangerous game of intrigue with Herod and Salome, and - in a moment that would change his life and that of his crippled daughter, Helena - meet the man called Jesus of Nazareth.",
        "Category": " Fiction , Historical",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Hotel World",
        "Authors": "By Smith, Ali",
        "Description": "Woooooooo-hooooooo.Five people: four are living; three are strangers; two are sisters; one, a teenage hotel chambermaid, has fallen to her death in a dumbwaiter. But her spirit lingers in the world, straining to recall things she never knew. And one night all five women find themselves in the smooth plush environs of the Global Hotel, where the intersection of their very different fates make for this playful, defiant, and richly inventive novel. Forget room service: this is a riotous elegy, a deadpan celebration of colliding worlds, and a spirited defense of love. Blending incisive wit with surprising compassion, Hotel World is a wonderfully invigorating, life-affirming book.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Clifford's Pals (Clifford 8x8)",
        "Authors": "By Bridwell, Norman",
        "Description": "Clifford and his canine friends decide to play at a construction site. Bad idea! Clifford and his friends get into trouble and learn that games are only fun when played in a safe place!",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Frommer's Ireland from $50 a Day (17th Ed.)",
        "Authors": "By Meagher, Mark, Neave, Elizabeth, Poole, Susan, and Meagher, Robert Emmet",
        "Description": "Offers information and advice on where to stay, where to eat, and what to see, including tours, shopping, and clubs",
        "Category": " Travel , Europe , Ireland",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Why Parents Disagree & What You Can Do About It: How to Raise Great Kids While You Strengthen Your Marriage",
        "Authors": "By Taffel, Ron and Israeloff, Roberta",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "30 Low-Fat Meals in 30 Minutes",
        "Authors": "By Levy, Faye",
        "Description": "This book will prove that you can prepare quick meals that are low in fat and still taste great.  The recipes will make use of bold seasonings that instantly add flavor without the need for long simmering.  The book is organized around main courses, with chapters broken down into menus with poultry or meat, menus with fish or seafood, vegetarian menus and pasta menus.  In addition, an introductory chapter will offer strategies for quick, low-fat cooking, including tips on picking fresh ingredients, stocking a pantry and cooking techniques.  The menus will follow today's flexible dining habits.  Some menus serve two, and others serve four.  Most menus will include three recipes, but they will not all follow the traditional pattern of appetizer, main course and dessert.  Sometimes, for example, there will be a main course with two accompaniments.  Those menus that do not include desserts will have suggestions for simple desserts (usually seasonal fruit, frozen yogurt or other desserts already in the book) that would complement the menu well.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Steel Albatross",
        "Authors": "By Carpenter, M. Scott",
        "Description": "As the Soviets rush to activate their secret underwater power plant, hot-shot fighter pilot Rick Tallman is given command of the unproven Steel Albatross, the U.S. underwater glider",
        "Category": " Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Russian Debutante's Handbook",
        "Authors": "By Shteyngart, Gary",
        "Description": "A visionary novel from the author of Super Sad True Love Story and Little Failure.The Russian Debutante's Handbook introduces Vladimir Girshkin, one of the most original and unlikely heroes of recent times. The twenty-five-year-old unhappy lover to a fat dungeon mistress, affectionately nicknamed \"Little Failure\" by his high-achieving mother, Vladimir toils his days away as a lowly clerk at the bureaucratic Emma Lazarus Immigrant Absorption Society. When a wealthy but psychotic old Russian war hero appears, Vladimir embarks on an adventure of unrelenting lunacy that takes us from New York's Lower East Side to the hip frontier wilderness of Prava--the Eastern European Paris of the nineties. With the help of a murderous but fun-loving Russian mafioso, Vladimir infiltrates the Prava expat community and launches a scheme as ridiculous as it is brilliant.Bursting with wit, humor, and rare insight, The Russian Debutante's Handbook is both a highly imaginative romp and a serious exploration of what it means to be an immigrant in America.",
        "Category": " Fiction , Literary",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Smart Investor's Survival Guide: The Nine Laws of Successful Investing in a Volatile Market",
        "Authors": "By Carlson, Charles B.",
        "Description": "For today’s shell-shocked individual investors, financial expert Charles B. Carlson offers hands-on advice on how to survive — and thrive — in a wildly fluctuating market.     The economic recession of the past year, followed by the tragedy of September 11, sent a ripple of panic through investors in 2001. The market shed trillions of dollars in wealth, and hundreds of thousands of individual investors suffered substantial financial losses. The volatility we experienced last year was more than a fluke, argues investment expert Charles B. Carlson. With the ongoing changes in the economy, including changes in corporate reporting laws, instant availability of financial information, and the ability to buy and sell stocks with the touch of a keystroke, volatility is here to stay.     But volatility isn’t necessarily a bad thing. In fact, Carlson argues, if you know how to weather today stormy markets, investing in them can be very profitable.     In The Smart Investor’s Survival Guide, Carlson shows investors how to make volatility work to their advantage. First, he argues, it is critical that investors match their investment style — growth, value, buy and hold — to the kinds of stocks they pick. For long-term investors, Carlson recommends that a portion of their portfolio be invested in what he calls the calm eye of the storm, “easy hold” stocks that have consistent, steady growth, and very low volatility. Even in the terrible market downturn of 2000, when the Nasdaq lost 39 percent of its value and stocks like Lucent and Cisco saw their share price drop by 80 percent  or more, a number of investment sectors actually gained in value. The Dow Jones index, minus its technology stocks, broke even. In other words, even in the worst markets, not every stock or sector goes down.     Through what he calls the nine essential laws of successful investing in a volatile market, Carlson reveals:  • How to diversify the portfolios across stock sectors and investment vehicles  • The critical importance of matching one’s investment style — value, growth, buy and hold — to the kinds of stocks one invests in  • The importance of “easy hold” — no-brainer stocks — in a portfolio, stocks that will grow 10 to12 percent a year with minimal        volatility.    Written by one of the most trusted names in the financial community, The Smart Investor’s Survival Guide shows investors how to master today’s turbulent markets, and profit from them.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Doubleday Business",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "How to Reduce Your Risk of Breast Cancer",
        "Authors": "By Michnovicz, Jon J., M.D. and Klein, Diane S.",
        "Description": "A comprehensive guide that not only enumerates the reasons why women get breast cancer, but explains, in up-to-the-minute detail, the ways that breast cancer risk can actually and definitely be reduced through diet and nutrition.",
        "Category": " Medical , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Oriental rugs: The illustrated guide",
        "Authors": "By Summers, Janice",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "12.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Colored Sugar Water: A Spiritual Tale",
        "Authors": "By Berry, Venise T.",
        "Description": "Despite their success, Lucy, the thirty-five-year-old fitness manager for a string of Texas health clubs, and Adel, vice president for human resources at American oil, struggle with the individual dissatisfaction, spiritual and emotional emptiness, and unhappiness of their lives and set out to search for true meaning and fulfillment. By the author of All of Me. 30,000 first printing.",
        "Category": " Fiction , Religious",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Home Remedies: What Works : Thousands of Americans Reveal Their Favorite Home-Tested Cures for Everyday Health Problems",
        "Authors": "By Prevention Magazine Health Books (COR), Kaufman, Brian, and Maleskey, Gale",
        "Description": "Combining folk wisdom with doctor endorsements, a fascinating collection of home-tested cures for a variety of ills offers remedies that actually work and analyzes these remedies to explain why they work. Prevention Main.",
        "Category": " Health & Fitness , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Bridesmaid Revisited (Ellie Haskell Mysteries)",
        "Authors": "By Cannell, Dorothy",
        "Description": "A strange letter from three friends of her dead grandmother triggers a mystery for Ellie Haskell as she tries to figure out why they think the deceased woman is trying to communicate a message to her",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Dear Graduate: Letters of Wisdom from Charles Swindoll",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "Spring Arbor Distributors",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Listen to the Silence (Sharon McCone Mysteries)",
        "Authors": "By Muller, Marcia",
        "Description": "For Sharon McCone, when one door opens, another shuts. In the midst of celebrating a joyous wedding, she gets word that her father has died. The news leads her to the rituals of death: the scattering of ashes, the sharing of grief, the sorting through a loved one's belongings. But for Sharon McCone the last of those acts leads to a discovery that will change everything ...The existence of a legal document, hinting at a family secret deliberately withheld from McCone, provokes a violent breach between McCone and her mother. It drives McCone to search for her family's roots, particularly those of her Shoshone great-grandmother. This emotionally fueled search takes her to Montana's Flathead Indian Reservation and, eventually, to a remote and sparsely populated county in northern California. There, obsessed with her own problems, she walks into a deadly fight between Indians trying to preserve their sacred lands and a high-powered resort developer.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Adam of the Road (Newbery Library, Puffin)",
        "Authors": "By Vining, Elizabeth Gray, Lawson, Robert (ILT), and Gray, Elizabeth Janet",
        "Description": "A Newbery Medal WinnerAwarded the John Newbery Medal as \"the most distinguished contribution to American literature for children\" in the year of its publication. \"A road's a kind of holy thing,\" said Roger the Minstrel to his son, Adam. \"That's why it's a good work to keep a road in repair, like giving alms to the poor or tending the sick. It's open to the sun and wind and rain. It brings all kinds of people and all parts of England together. And it's home to a minstrel, even though he may happen to be sleeping in a castle.\" And Adam, though only eleven, was to remember his father's words when his beloved dog, Nick, was stolen and Roger had disappeared and he found himself traveling alone along these same great roads, searching the fairs and market towns for his father and his dog.Here is a story of thirteenth-century England, so absorbing and lively that for all its authenticity it scarcely seems \"historical.\" Although crammed with odd facts and lore about that time when \"longen folke to goon on pilgrimages,\" its scraps of song and hymn and jongleur's tale of the period seem as newminted and fresh as the day they were devised, and Adam is a real boy inside his gay striped surcoat.\"Engaging and beautifully written.\"—Children's Literature",
        "Category": " Young Adult Fiction , Historical , Europe",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Right to Hunt",
        "Authors": "By Whisker, James Biser",
        "Description": "The classic defence of hunting, brought up to date by its author, the acknowledged dean of hunting philosophy, Jame B Whisker.  You'll never find a better guide to the philosophy behind hunting. This unique book is not the ordinary hunting guide telling you where to find the game animals, it's guide to the ideas, the history and the politics of hunting that shape today's debate. This is genuine, useful intellectual ammunition for hunting activists everywhere. Alan Gottlieb",
        "Category": " Sports & Recreation , Hunting",
        "Publisher": "Merril Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Froggy Bakes a Cake",
        "Authors": "By Piper, Watty, Remkiewicz, Frank (ILT), London, Jonathan, and Mateu (ILT)",
        "Description": "It's Froggy's mother's birthday, and Froggy wants to bake her birthday cake all by himself. He gathers the chocolate, the sugar, the eggs, the flour, and pretty soon, Froggy has all the ingredients he needs to make—a big mess! Jonathan London and Frank Remkiewicz have collaborated on the six previous Froggy books, and they've cooked up another winner here, sweetened with generous helpings of Froggy humor and charm.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Breath and Shadows",
        "Authors": "By Leffland, Ella",
        "Description": "Breath and Shadows is about three pairs of people who live in widely separated periods of time -- the late 1700s, late 1800s, and late 1900s. These people, as gradually becomes clear, are three generations of the same family, none of which has any knowledge of the other two. But there exists down through these far-flung generations a meshwork of cause and effect that reverberates all the way into the present.The interrelatedness of these three pairs of people, the twining of their destinies, is the core of the book.Though the novel takes place in three different centuries, it is rooted in such timeless attributes as social mores, class and money, as well as in historical events such as the battle at Leipzig, where Napoleon was crushed, and the ruins of Berlin in 1945.These events are woven through the private lives of the characters, among whom are a lonely and young officer, a sculptress trying to find truth in the stone she works with, a man terrified of flying who forces himself to fly constantly, a woman who embodies the ineffable bond between an animal and a human being, and others responding to their world, their natures and their needs. It is a novel about the attempt of human beings to know the past, to know one another and to know themselves. It is about love, loss, sexual passion, human perception and the possibility that the search for goodness may be an act of insanity.",
        "Category": " Fiction , Literary",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Gifts From My Home",
        "Authors": "By Harriet E. Crosby",
        "Description": "",
        "Category": "",
        "Publisher": "Popular Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Riddle of the Ice",
        "Authors": "By Arms, Myron",
        "Description": "The author recounts his voyage aboard a fifty-foot sailboat amid the towering icebergs and pounding gales of the Arctic Circle in search of the reasons for the appearance of an enormous glacier in the middle of a hot summer. Tour.",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Once and Future Spy",
        "Authors": "By Littell, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "The Overlook Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Remembering America: A Voice from the Sixties",
        "Authors": "By Goodwin, Richard N.",
        "Description": "An intriguing look at the tumultuous 1960s offers portraits of John Kennedy and Lyndon Johnson and the presidential campaigns of Eugene McCarthy and Robert Kennedy",
        "Category": " History , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Classic fish dishes",
        "Authors": "By Street, Myra",
        "Description": "",
        "Category": "",
        "Publisher": "Shooting Star Press",
        "Price Starting With ($)": "6.39",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Best Friends for Frances",
        "Authors": "By Hoban, Russell and Hoban, Lillian (ILT)",
        "Description": "This sweet friendship story starring America’s favorite badger, Frances, is a classic that continues to be loved by children, siblings, and parents everywhere.Frances doesn't think her little sister can be her friend, but when Frances finds herself left out because of a \"no-girls\" rule, she decides to show those boys what girls can do. In the process, she discovers that sisters can indeed be friends . . . maybe even best friends!This Level Two I Can Read book is geared toward kids who read on their own but still need a little help.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "August",
            "Year": "1969"
        }
    },
    {
        "Title": "Affect Destiny: The Book of Hope Story",
        "Authors": "By Hoskins, Bob",
        "Description": "",
        "Category": "",
        "Publisher": "Book of Hope",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Full Faith & Credit",
        "Authors": "By James R. Cook",
        "Description": "",
        "Category": "",
        "Publisher": "Blue Book Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Runaway Bunny",
        "Authors": "By Brown, Margaret Wise",
        "Description": "Clement Hurd redrew some of his pictures for this new edition of the profoundly comforting story of a bunny?s imaginary game of hide-and-seek and the lovingly steadfast mother who finds him every time.   \"Best of the Best\" Children's Books 1966?1978 (SLJ)Outstanding Children's Books of 1972 (NYT)",
        "Category": " Juvenile Fiction , Social Themes , Runaways",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1942"
        }
    },
    {
        "Title": "The Complete Color Directory",
        "Authors": "By Westgate, Alice",
        "Description": "An invaluable tool for every kind of home decorating decision, this directory packs comprehensive information about color into one handy, pocket-size format. Arranged in rainbow order with removable, perforated color swatches at the end of each color section, the book gives readers a range of hues to consider. For example, the red section shows pure red swatches alongside hues achieved by adding different percentages of other colors to red, so readers can select the right nuance of red for a particular decorating need. Each color section covers the same pertinent topics: color in daylight versus artificial light; color texture and its relation to hue; and how to organize given colors into auspicious combinations. Recipes for mixing paints, washes, and varnishes are also provided, and a card “viewer” enables readers to isolate single colors or look at pairs together.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Whales",
        "Authors": "By Simon, Seymour",
        "Description": "Describes, in text and illustrations, the physical characteristics, habits, and natural environment of various species of whales.",
        "Category": " Juvenile Nonfiction , Animals , Marine Life",
        "Publisher": "T.Y. Crowell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Decorating Magic: 500 Clever Tricks with 50 Easy-to-Find Items",
        "Authors": "By Vanessa-Ann Collection (COR)",
        "Description": "There’s no end to the ways you can decorate with flea market finds, attic treasures, and favorite collections.  Captivating color photographs reveal a myriad uses for a wide range of ordinary items.  “Here are 500 easy-to-do projects to inspire the amateur interior decorator.  This book is divided into sections by the material used, which range from doilies to cans to shells, with a picture that depicts each....Those interested in crafts will find a multitude of ideas.”—Library Journal.",
        "Category": " House & Home , Decorating",
        "Publisher": "Sterling/Chapelle",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Country Living Handmade Pillows: Decorative Accents Throughout Your Home",
        "Authors": "By Stewart, Arlene Hamilton",
        "Description": "Custom-make your own luxurious cushions, perhaps using such treasures as vintage laces, handkerchiefs, and doilies. Some don’t even require sewing; other, more elaborate projects include tassels, monograms, and trimming. Try herbal pillows, eye pillows, travel pillows, satin bridal pillows, and pillows for holidays.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Hearst",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Essential Kitchens : This Old House Books (Design Basics, Before and After, Basic Skills, Equipping your kitchen, Materials and Surfaces)",
        "Authors": "By Feirer, Mark - Editor",
        "Description": "",
        "Category": "",
        "Publisher": "This Old House Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Alexander Technique",
        "Authors": "By Barlow, Wilfred",
        "Description": "",
        "Category": "",
        "Publisher": "Warner",
        "Price Starting With ($)": "14.03",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Take It from Me: Life's a Struggle But You Can Win",
        "Authors": "By Eliot, Marc and Brokovich, Erin",
        "Description": "Advice on how to overcome life's obstacles, and live the life you want, from one of today's most inspiring heroes  \"It is as challenging a task to comment on Erin Brockovich as it was to portray her. She seems to defy description. I shall put it simply, because Erin is someone who appreciates a clear point. She is kind, and she is tireless. Erin is inspiring, and I know the world to be a better place because she is in it.\"--Julia Roberts Erin Brockovich delivers her irrepressible spirit and down-to-earth wisdom in Take It from Me, an inspiring trove of stories, lessons, and motivational strategies anyone can use to summon their inner strength and free the winning forces that lie within us all.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    }
]