[
    {
        "Title": "The Life You Want: Get Motivated, Lose Weight, and Be Happy",
        "Authors": "By Greene, Bob, Kearney-Cooke, Ann, Ph.D. (CON), and Jibrin, Janis (CON)",
        "Description": "TAKE CONTROL OF YOUR WEIGHT AND CLAIM THE LIFE YOU DESERVE! Bob Greene has helped millions lose weight and get in shape with his life-changing Best Life plan. Now Oprah’s most trusted expert on diet and fitness teams up with psychologist Ann Kearney-Cooke and nutritionist Janis Jibrin to zero in on common barriers to weight loss success. Together, they will offer practical tips and explore the latest science on emotional eating and lack of motivation. REWIRE YOUR BRAIN TO OVERCOME OVEREATING CONQUER EXERCISE AVERSION TAME YOUR SUGAR, FAT, AND SALT CRAVINGS TRANSFORM YOUR BODY IMAGE INCREASE YOUR HAPPINESS While the basic principles of weight loss are simple enough, maintaining a healthy lifestyle can be a struggle. The Life You Want delivers the information and inspiration you need to overcome each obstacle—once and for all.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Left Neglected",
        "Authors": "By Genova, Lisa",
        "Description": "Sarah Nickerson is like any other career-driven supermom in Welmont, the affluent Boston suburb where she leads a hectic but charmed life with her husband Bob, faithful nanny, and three children—Lucy, Charlie, and nine-month-old Linus. Between recruiting the best and brightest minds as the vice president of human resources at Berkley Consulting; shuttling the kids to soccer, day care, and piano lessons; convincing her son’s teacher that he may not, in fact, have ADD; and making it home in time for dinner, it’s a wonder this over-scheduled, over-achieving Harvard graduate has time to breathe. A self-confessed balloon about to burst, Sarah miraculously manages every minute of her life like an air traffic controller. Until one fateful day, while driving to work and trying to make a phone call, she looks away from the road for one second too long. In the blink of an eye, all the rapidly moving parts of her jam-packed life come to a screeching halt.   A traumatic brain injury completely erases the left side of her world, and for once, Sarah relinquishes control to those around her, including her formerly absent mother. Without the ability to even floss her own teeth, she struggles to find answers about her past and her uncertain future. Now, as she wills herself to regain her independence and heal, Sarah must learn that her real destiny—her new, true life—may in fact lie far from the world of conference calls and spreadsheets. And that a happiness and peace greater than all the success in the world is close within reach, if only she slows down long enough to notice.",
        "Category": " Fiction , Women",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "The Lake of Dreams: A Novel",
        "Authors": "By Edwards, Kim",
        "Description": "At a crossroads in her life, Lucy Jarrett returns home to upstate New York from Japan, only to find herself haunted by her father's unresolved death a decade ago. Old longings stirred up by Keegan Fall, a local glass artist who was once her passionate first love, lead her into the unexpected. Late one night, as she paces the hallways of her family's rambling lakeside house, she discovers, locked in a window seat, a collection of objects that first appear to be idle curiosities, but soon reveal a hidden family history. As Lucy explores these traces of her lineage---from an heirloom blanket and dusty political tracts to a web of allusions depicted in stained-glass windows, both in her hometown and beyond---a new family narrative emerges. It will link her to a unique slice of the suffragette movement, and yield dramatic insights that will free her to live her life to its fullest and deepest.With revelations as captivating as the deceptions at the heart of her best-selling phenomenon, The Memory Keeper's Daughter. Kim Edwards now gives us a powerful family story and a story of love lost and found. The Lake of Dreams is an arresting novel in which every vibrant detail is as carefully placed as a puzzle. With her signature gifts for lyricism, Suspense, and masterly storytelling, Kim Edwards's new novel will delight those who loved The Memory Keeper's Daughter and mesmerize millions of new fans.",
        "Category": " Fiction , Literary",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Made to Crave: Satisfying Your Deepest Desire with God, Not Food",
        "Authors": "By TerKeurst, Lysa",
        "Description": "From New York Times bestselling author of Uninvited and The Best Yes, Lysa TerKeurst brings you the missing link between a woman’s desire to be healthy and the spiritual empowerment necessary to make that happen. The reality is we were made to crave. Craving isn’t a bad thing. But we must realize God created us to crave more of him. Many of us have misplaced that craving by overindulging in physical pleasures instead of lasting spiritual satisfaction. If you are struggling with unhealthy eating habits, you can break the “I’ll start again Monday” cycle, and start feeling good about yourself today. Learn to stop beating yourself up over the numbers on the scale. Discover that your weight loss struggle isn’t a curse but rather a blessing in the making, and replace justifications that lead to diet failure with empowering go-to scripts that lead to victory. You can reach your healthy weight goal – and grow closer to God in the process. This is not a how-to book. This is not the latest and greatest dieting plan. This book is the necessary companion for you to use alongside whatever healthy lifestyle plan you choose. This is a book and Bible study to help you find the \"want to\" in making healthy lifestyle choices.Other products in the Made to Crave family include the Made to Crave devotional, video study and participant’s guide, and Made to Crave for Young Women. All available now!",
        "Category": " Religion , Christian Living , Women's Interests",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Call Me Irresistible: A Novel",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "The funniest love story of the year, Call Me Irresistible is the book Susan Elizabeth Phillips fans have been craving. The beloved New York Times bestselling author returns with a delightfully sassy, sexy, and downright irresistible tale of true love Texas style.Ted Beaudine, one of Phillips’s most charming characters (the adolescent heartbreaker from her hilarious debut, Fancy Pants, and the new college graduate from Lady Be Good) is now all grown up and in a heap of romantic trouble all his own—in a perfectly marvelous contemporary romance that fans of Emily Giffin, Kristen Hannah, and Elin Hilderbrand will simply adore.",
        "Category": " Fiction , Women",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Damage",
        "Authors": "By Lescroart, John T.",
        "Description": "Watch a video                 From New York Times bestseller John Lescroart comes an explosive look at the seductive power of   revenge and the terrible costs of justice.  The Curtlees are the most powerful family in San   Francisco, unscrupulous billionaires who ve lined every important pocket in the Bay Area in pursuit of their own   ascent. So when the family's heir, Ro Curtlee, was convicted of rape and murder a decade ago, the fallout for those   who helped to bring him to justice was swift and uncompromising. The jury foreman was fired from his job and   blacklisted in his industry. The lead prosecutor was pushed off the fast track, her dreams of becoming DA dashed.   And head homicide detective Abe Glitsky was reassigned to the police department s payroll office. Eventually, all   three were able to rebuild their fragile, damaged lives. And then Ro Curtlee's lawyers won him a retrial,   and he was released from jail. Within twenty-four hours, a fire destroys the home of the original trial's   star witness, her abused remains discovered in the ruins. When a second fire claims a participant in the case, Abe is   convinced: Ro is out for revenge. But with no hard evidence and an on-the-take media eager to vilify anyone who   challenges Ro, can Abe stop the violence before he finds himself in its crosshairs? How much more can he sacrifice   to put Ro back behind bars? And just how far across the line is he prepared to go in pursuit of justice?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Weight Watchers New Complete Cookbook, Fourth Edition",
        "Authors": "By Weight Watchers International (COR)",
        "Description": "The trusted classic from Weight Watchers The most trusted name in healthy lifestyle, Weight Watchers leads the way to eating well—and losing weight. Packed with 500 recipes for every occasion, this book is delicious proof that healthy eating means you don't have to give up your favorite foods. It's so easy to enjoy meals with family and friends—holidays or everyday—with these tempting recipes that both beginners and experienced cooks will love. This newest edition has everything you'll need to cook—and eat—in a healthier way: included is a new chapter with slow cooker recipes, hundreds of tips, helpful how-to photography, sidebars filled with must-have advice, and plenty of fresh ideas for breakfast, lunch, dinner, and beyond. An added feature: all recipes have been tagged for skill level. This book has been completely redesigned and boasts all new photography. And, of course, this revised edition includes the latest information on the popular and successful Weight Watchers program. Includes more than 60 gorgeous full-color recipe photos and instructive how-to images Features more than 500 recipes, including essential basics, breakfasts, lunches, soups and stews, vegetarian meals, baked goods, and desserts Now with more whole grain and vegetable dishes that help you eat healthier and stay full longer New design adds a fresh and contemporary spin to this trusted classic",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "6.26",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Clean",
        "Authors": "By Junger, Alejandro",
        "Description": "“The Clean program works….The wisdom and information contained in this book is deeply helpful and life changing.” —Gwyneth PaltrowAs featured on Goop.com!From Alejandro Junger, Eastern medicine specialist, cardiologist, and head of the Integrative Medicine program at Lenox Hill Hospital (as well as a doctor at New York City’s renowned Eleven Eleven Wellness Center), comes the New York Times bestseller, Clean—a medically-proven program that teaches how to remove toxins, rejuvenate our bodies, and restore our natural health.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Deja Vu (Sisterhood)",
        "Authors": "By Michaels, Fern",
        "Description": "Celebrate With The SisterhoodThanks to a presidential pardon, the Sisterhood can put their fugitive days behind them and resume their lives in peace. Still, all the women admit that lately things are a little too calm and peaceful. Meeting up for the first time in months to celebrate Kathryn's birthday--in the City of Sin, no less--seems like the perfect antidote. But before they can kick up their heels something too big to pass up is dropped into their laps. The time has come to deal with Enemy #1, a/k/a Hank Jellicoe. Wanted by the FBI, the CIA, and Homeland Security for starters, President Connor herself has run out of patience with their lack of results. Only the Sisterhood, with their special blend of guts, imagination, and friends in all places are capable of pulling off the impossible--of hunting down this monster and taking him out once and for all.  .  .Praise for Fern Michaels and her Sisterhood novels.  .  .\"Revenge is a dish best served with cloth napkins and floral centerpieces.  .  .fast-paced.  .  .puts poetic justice first.\"--Publishers Weekly on Payback\"Delectable.  .  .deliver[s] revenge that's creatively swift and sweet, Michaels-style.\"",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "The Longest War: The Enduring Conflict between America and Al-Qaeda",
        "Authors": "By Bergen, Peter L.",
        "Description": "TEN YEARS HAVE PASSED since the shocking attacks on the World Trade Center, and after seven years of conflict, the last U.S. combat troops left Iraq—only to move into Afghanistan, where the ten-year-old fight continues: the war on terror rages with no clear end in sight. In The Longest War Peter Bergen offers a comprehensive history of this war and its evolution, from the strategies devised in the wake of the 9/11 attacks to the fighting in Afghanistan, Pakistan, and beyond. Unlike any other book on this subject, here Bergen tells the story of this shifting war’s failures and successes from the perspectives of both the United States and al-Qaeda and its allies. He goes into the homes of al-Qaeda members, rooting into the source of their devotion to terrorist causes, and spends time in the offices of the major players shaping the U.S. strategic efforts in the region. At a time when many are frustrated or fatigued with what has become an enduring multigenerational conflict, this book will provide an illuminating narrative that not only traces the arc of the fight but projects its likely future. Weaving together internal documents from al-Qaeda and the U.S. offices of counterterrorism, first-person interviews with top-level jihadists and senior Washington officials, along with his own experiences on the ground in the Middle East, Bergen balances the accounts of each side, revealing how al-Qaeda has evolved since 9/11 and the specific ways the U.S. government has responded in the ongoing fight. Bergen also uncovers the strategic errors committed on both sides—the way that al-Qaeda’s bold attack on the United States on 9/11 actually undermined its objective and caused the collapse of the Taliban and the destruction of the organization’s safe haven in Afghanistan, and how al-Qaeda is actually losing the war of ideas in the Muslim world. The book also shows how the United States undermined its moral position in this war with its actions at Guantánamo and coercive interrogations—including the extraordinary rendition of Abu Omar, who was kidnapped by the CIA in Milan in 2003 and was tortured for four years in Egyptian prisons; his case represents the first and only time that CIA officials have been charged and convicted of the crime of kidnapping. In examining other strategic blunders the United States has committed, Bergen offers a scathing critique of the Clinton and Bush administrations’ inability to accurately assess and counter the al-Qaeda threat, Bush’s deeply misguided reasons for invading Iraq—including the story of how the invasion was launched based, in part, on the views of an obscure academic who put forth theories about Iraq’s involvement with al-Qaeda—and the Obama administration’s efforts in Afghanistan. At a critical moment in world history The Longest War provides the definitive account of the ongoing battle against terror.",
        "Category": " History , Military , Afghan War (2001-)",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Ronald Reagan: 100 Years: Official Centennial Edition from the Ronald Reagan Presidential Foundation",
        "Authors": "By Ronald Reagan Presidential Foundation (COR) and Baker, Howard H., Jr. (FRW)",
        "Description": "Ronald Reagan: 100 Years is the official centennial publication from the Ronald Reagan Presidential Foundation. Featuring archival photographs of the Reagan family along with insightful text, this book is the ultimate commemorative edition to mark the one hundredth anniversary of President Reagan’s birth. It offers an intimate, insider’s glimpse of the life and legacy of America’s most beloved leader.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "The Outlaws: A Presidential Agent Novel",
        "Authors": "By Griffin, W. E. B. and Butterworth, William E., IV",
        "Description": "The #1 New York Times-bestselling series returns-and the stakes have never been higher.  Charlie Castillo's secret unit has been disbanded-but that doesn't mean he's out of business. As experience has painfully shown him, there are many things the intelligence community can't do, won't do, or doesn't do well, and he has the men and assets to help set things straight. But the first opportunity, when it comes, is shocking: A FedEx package arrives, bearing photos of barrels containing some of the most dangerous biohazard materials on earth, all of which were supposed to have been destroyed during a raid on a secret Russian factory in the Congo. Who has them, and what do they want? Castillo has a feeling he's not going to like the answers.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "The Judas Gate (Sean Dillon)",
        "Authors": "By Higgins, Jack",
        "Description": "\"With fresh plots, interesting characters, and vibrant settings, Jack Higgins has firmly cemented his reputation as one of the world's most successful thriller writers.\"---The Strand MagazineTreachery has a price, in the mesmerizing new thriller from the New York Times---bestselling writer.With his latest novels, Jack Higgins has shown himself \"on top of his game\" (Publishers Weekly), his books infused with \"a timely edginess [that] pulls you along like the surprisingly strong current of the Thames River\" (Associated Press). The Judas Gate is just as timely---and just as surprising.A disturbing audiotape has made its way to General Charles Ferguson, adviser to the Prime Minister, and from him to the President of the United States: battlefield chatter from an ambush in Helmand province, Afghanistan, in which twelve U.S. Army Rangers and a British medical team died. Most of the Taliban voices are Afghan, but not all of them---shockingly, some of them are British, and one in particular, the voice of the commander, bears an Irish accent.The idea that one of their own could be responsible for such a massacre is appalling, and Ferguson immediately puts Sean Dillon in charge of hunting the traitor down. But Dillon has his own way of doing things and, he will eventually discover, so does his quarry. Not only will Dillon be going to war---the war will be coming to him.Filled with suspense, driven by characters of complexity and passion, The Judas Gate is an unforgettable novel by the man \"who has produced some of the best suspense fiction of the past fifty years\" (The San Diego Union-Tribune).Since The Eagle has Landed---one of the biggest-selling thrillers of all time---every novel JACK HIGGINS has written, including his most recent works, The Wolf at the Door and A Darker Place, has become an international bestseller. He has had simultaneous number-one bestsellers in hardcovery and paperback, and many of his books have been made into successful movies, including The Eagle has Landed, To Catch a King, On Dangerous Ground, Eye of the Storm, and Thunder Point.Higgins, who lived in Belfast until he was twelve, had several close calls with bombs and gunfire at an early age. After leaving school at fifteen, he served three years with the Royal Horse Guards in Eastern Europe during the Cold War. Subsequently, he was a circus roustabout, a factory worker, a truck driver, and a laborer, before entering college at age twenty-seven. He has degrees in sociology, social psychology, and economics from the University of London, and a doctorate in media from Leeds Metropolitan University.A fellow of the Royal Society of Arts, and an expert scuba diver and marksman, Higgins lives on Jersey in the Channel Islands.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "THREE SECONDS",
        "Authors": "By Roslund, Anders, Hellstrom, Borge, and Dickson, Kari (TRN)",
        "Description": "Ex-convict Piet Hoffman--a family man, a rising member of Stockholm's Polish mafia, and an undercover police informant--is sent to a maximum security prison to make himself the boss of the amphetamine trade so the police can shut it down.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "SILVER OAK",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "The McDonaldization of Society 6",
        "Authors": "By Ritzer, George",
        "Description": "\"This book has been a fabulous success with students because it combines elements of critical social theory, readability...and popular culture.\"---Charles R. Frederick, Jr., Indiana University\"Many of my students... identify with the themes very rapidly. They see the connections with their own world of experience and gain confidence in thinking sociologically.\"---Michael Nofz, University of Wisconsin\"The text opened my eyes to the world around me. I really enjoyed the writing style of the book... I thought of it as a book I would recommend to friends, not as a textbook.\"---StudentAs one of the most eye-opening and popular sociology books of all time, The McDonaldization of Society 6 demonstrates the power of the sociological imagination to today's readers in a way that few other books have, linking theory to contemporary pop culture examples that resonate with 21st-century students.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Bring It!: The Revolutionary Fitness Plan for All Levels That Burns Fat, Builds Muscle, and Shreds Inches",
        "Authors": "By Greenwood-Robinson, Maggie and Horton, Tony",
        "Description": "Creator of the best-selling P90X® workout series, Tony Horton shows you how to Bring It! for the results you want. Over the past 25 years, Tony Horton has helped millions of people—from stay-at home moms to military personnel to A-list celebrities—transform their bodies and their lives with innovative workouts and cutting-edge advice. Now in his first book he shares the fundamentals of his fitness philosophy with millions more, revealing his secrets for getting fit and healthy and melting away pounds. One-size-fits-all diets and exercise regimens just don't work—that's why Tony creates unique programs for each of his clients. In Bring It! he shows you how to build your own diet and fitness plan tailored to your individual lifestyle, preferences, and goals. With a Fitness Quotient (FQ) quiz designed to assess your likes, dislikes, and current fitness level, you can choose the program that's right for you. In photographs and easy-to-follow instructions, Tony demonstrates his unique moves and exercise combinations that include cardio fat burners, lower body blitzers, core strengthening, plyometrics, yoga, and more. You'll also discover Tony's fat-blasting eating plan and detox tips, delicious recipes, and mental motivators. Whether you've never been to the gym before, are looking to get bikini ready, or simply want to take your workout to the next level, Tony Horton can give you the results you've been looking for. A better body—and future—is possible when you commit to change. Get ready to Bring It!",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Live to Tell ( D. D. Warren, Book 4)",
        "Authors": "By Gardner, Lisa",
        "Description": "“A suspenseful roller-coaster ride.”—Karin Slaughter • “Lisa Gardner always delivers heart-stopping suspense.”—Harlan CobenHe knows everything about you—including the first place you’ll hide. On a warm summer night in one of Boston’s working-class neighborhoods, an unthinkable crime has been committed: Four members of a family have been brutally murdered. The father—and possible suspect—now lies clinging to life in the ICU. Murder-suicide? Or something worse? Veteran police detective D. D. Warren is certain of only one thing: There’s more to this case than meets the eye.Danielle Burton is a survivor, a dedicated nurse whose passion is to help children at a locked-down pediatric psych ward. But she remains haunted by a family tragedy that shattered her life nearly twenty-five years ago. The dark anniversary is approaching, and when D. D. Warren and her partner show up at the facility, Danielle immediately realizes: It has started again.A devoted mother, Victoria Oliver has a hard time remembering what normalcy is like. But she will do anything to ensure that her troubled son has some semblance of a childhood. She will love him no matter what. Nurture him. Keep him safe. Protect him. Even when the threat comes from within her own house. The lives of these three women unfold and connect in unexpected ways, as sins from the past emerge—and stunning secrets reveal just how tightly blood ties can bind. Sometimes the most devastating crimes are the ones closest to home.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "iPhone for Dummies",
        "Authors": "By Levitus, Bob and Baig, Edward C.",
        "Description": "The full-color guide to getting the most out of your iPhoneCompletely updated and revised throughout, this full-color guide covers Apple's new iPhone and iOS 4. Bestselling veteran authors Baig and LeVitus introduce you to the capabilities of the iPhone whether you're making phone calls, browsing the Internet, sending and receiving e-mails, working with the calendar, watching videos, taking great photos, or much more. You'll discover how to set up iTunes, buy music and videos from the iTunes store, protect your information, troubleshoot, multitask, and download the hundreds of thousands of apps available from the App Store.Gets you started with your iPhone, and puts you on your way to mastering the multitouch interface, synchronizing your data, making phone and video calls, texting, working with the calendar, and moreExplains setting up iTunes, watching videos, taking photos, and buying musicWalks you through connecting to the Internet, sending and receiving e-mails, getting directions from GPS maps, protecting your information, and troubleshootingAddresses browsing and downloading any of the hundreds of thousands of applications from the App StoreIncludes coverage of iPhone 3G, iPhone 3GS, and the iPhone 4, available from AT&T, Verizon, Vodafone, Rogers, Telus, and other major carriers Presented in the straightforward-but-fun style that defines the Dummies series, iPhone For Dummies, 4th Edition is the only book you'll need to get comfortably acquainted with your new iPhone.",
        "Category": " Technology & Engineering , Mobile & Wireless Communications",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "When You Reach Me: (Newbery Medal Winner) (Yearling Newbery)",
        "Authors": "By Stead, Rebecca",
        "Description": "\"Like A Wrinkle in Time (Miranda's favorite book), When You Reach Me far surpasses the usual whodunit or sci-fi adventure to become an incandescent exploration of 'life, death, and the beauty of it all.'\" —The Washington Post This Newbery Medal winner that has been called \"smart and mesmerizing,\" (The New York Times) and \"superb\" (The Wall Street Journal) will appeal to readers of all types, especially those who are looking for a thought-provoking mystery with a mind-blowing twist. Shortly after a fall-out with her best friend, sixth grader Miranda starts receiving mysterious notes, and she doesn’t know what to do. The notes tell her that she must write a letter—a true story, and that she can’t share her mission with anyone. It would be easy to ignore the strange messages, except that whoever is leaving them has an uncanny ability to predict the future. If that is the case, then Miranda has a big problem—because the notes tell her that someone is going to die, and she might be too late to stop it.  Winner of the Boston Globe–Horn Book Award for Fiction A New York Times Bestseller and Notable BookFive Starred ReviewsA Junior Library Guild Selection \"Absorbing.\" —People\"Readers ... are likely to find themselves chewing over the details of this superb and intricate tale long afterward.\" —The Wall Street Journal \"Lovely and almost impossibly clever.\" —The Philadelphia Inquirer \"It's easy to imagine readers studying Miranda's story as many times as she's read L'Engle's, and spending hours pondering the provocative questions it raises.\" —Publishers Weekly, Starred review",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Crazy Sexy Diet: Eat Your Veggies, Ignite Your Spark, and Live Like You Mean It!",
        "Authors": "By Carr, Kris and Ornish, Dean, Dr. (FRW)",
        "Description": "The author of the best-sellingCrazy Sexy Cancer Tipsand Crazy Sexy Cancer Survivortakes on the crazy sexy subject of what and how we eat, drink, and think.Crazysexydiet.comOn the heels of Kris Carr’s best-selling cancer survival guidebooks and her acclaimed TLC documentary comes her new journey into a realm vital toanyone’s health. Infused with her signature sass, wit and advice-from-the-trenches style,Crazy Sexy Diet is a beautifully illustrated resource that puts you on the fast track to vibrant health, happiness and a great ass!Along with help from her posse of experts, Carr lays out the fundamentals of her Crazy Sexy Diet: a low-glycemic, vegetarian program that emphasizes balancing the pH of the body with lush whole and raw foods, nourishing organic green drinks, and scrumptious smoothies. Plus, she shares the steps of her own twenty-one-day cleanse, and simple but delectable sample recipes.In ten chapters with titles such as, pHabulous,” Coffee, Cupcakes and Cocktails,” Make Juice Not War,” and God-Pod Glow,” Carr empowers readers to move from a state of constant bodily damage control to one of renewal and repair. In addition to debunking common diet myths and sharing vital tips on detoxifying our bodies and psychesadvice that draws both on her personal experience as a cancer survivor and that of expertsshe provides helpful hints on natural personal care, how to stretch a dollar, navigate the grocery store, eating well on the run, and working through the inevitable pangs and cravings for your old not-so-healthy life.Crazy Sexy Diet is a must for anyone who seeks to be a confident and sexy wellness warrior.Including contributions by:Dean Ornish, M.D. author and founder and president of the Preventive Medicine Research InstituteNeal Barnard, M.D. author, founder of Physicians Committee for Responsible Medicine (PCRM), author ofFood for LifeKathy Freston author of Quantum Wellness and health advocateAlejandro Junger, M.D. author of Clean: The Revolutionary Program to Restore the Body's Natural Ability to Heal Itself, and director of integrative medicine at Lenox Hill Hospital, NYCRory Freedman coauthor of Skinny Bitch and health advocateMark Hyman, M.D. author of The UltraMind Solution and pioneer in functional medicineEmily Deschanel star of the Fox series Bones and health advocateSharon Gannon author of Yoga and Vegetarianism, and cofounder of Jivamukti YogaWayne Pacelle president & CEO, The Humane Society of the United StatesStacy Malkan author and cofounder of the Campaign for Safe CosmeticsDr. Lilli Link specialist in raw foods and integrative nutrition <P style=\"MARGIN: 0",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Skirt!",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "How to Woo a Reluctant Lady (3) (The Hellions of Halstead Hall)",
        "Authors": "By Jeffries, Sabrina",
        "Description": "New York Times bestselling author Sabrina Jeffries delights readers yet again with the third sizzling Regency romance in her Hellions of Hallstead Hall series, featuring the independent Lady Minerva Sharpe and the reckless Giles Masters.When a charming rogue proposes she marry him to meet her grandmother’s ultimatum, the Sharpe clan’s strong-willed sister makes a tempting counter-offer that preserves her inheritance—and ignites his imagination. Lady Minerva Sharpe has the perfect plan to thwart her grandmother’s demands: become engaged to a rogue! Surely Gran would rather release her inheritance than see her wed a scoundrel. And who better to play the part of Minerva’s would-be husband than wild barrister Giles Masters, the very inspiration for the handsome spy in the popular gothic novels she writes? The memory of his passionate kiss on her nineteenth birthday has lingered in Minerva’s imagination, though she has no intention of really falling for such a rakehell, much less marrying him. Little does she know, he really is a covert government operative. When they team up to investigate the mystery behind her parents’ deaths, their fake betrothal leads to red-hot desire. Then Minerva discovers Giles’s secret double life, and he must use all the cunning tricks of his trade to find his way back to her heart.",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Dreamweaver CS5: The Missing Manual",
        "Authors": "By McFarland, David Sawyer",
        "Description": "Adobe's website-development program lets you revamp an existing site, or design, build, and manage a new one without writing a single line of code. But learning Dreamweaver is tricky. This step-by-step guide helps you master this versatile program with jargon-free language, hands-on tutorials, and savvy advice from a Dreamweaver pro.Get complete guidance. Go from building your first web page to creating interactive, database-driven sitesBuild skills as you learn. Apply your knowledge using 12 tutorials and downloadable practice filesCreate a thoroughly modern website. Build fast-loading pages based on powerful, easy-to-use CSS toolsAdd instant interactivity. Use pre-packaged JavaScript programs to add forms, drop-down menus, and moreTap into databases. Connect your site to a database and build pages that display the informationDiscover hidden tips and tricks. Learn undocumented workarounds and shortcutsHave it your way. Customize the way Dreamweaver looks and works to suit your needs",
        "Category": " Computers , Web , Design",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "7.18",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "How to Reach Your Full Potential for God",
        "Authors": "By Stanley, Charles F.",
        "Description": "In How to Reach Your Full Potential for God, acclaimed pastor and speaker Charles Stanley connects readers with the plan and purpose God envisioned when He created them.\"Things are never going to change\" or \"This is just the way I am--I'm never going to get better\" are just a few of the damaging lies Christians believe about themselves, their situations, and their walk. But Dr. Stanley shares the real truth as God sees it.In this powerful and inspiring message, readers reconnect with the grand vision God had when He uniquely created them. They learn that regardless of setbacks, failures, and frustrations, there is a better path based in His Word, one that's full of freedom and purpose. This book takes them to their specifically designed path to become exactly who the Father made them to be and achieve exactly what He designed them for.",
        "Category": " Religion , Christianity , Baptist",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Imperial Cruise: A Secret History of Empire and War",
        "Authors": "By Bradley, James",
        "Description": "On the success of his two bestselling books about World War II, James Bradley began to wonder what the real catalyst was for the Pacific War. What he discovered shocked him. In 1905 President Teddy Roosevelt dispatched Secretary of War William Taft, his daughter Alice, and a gaggle of congressmen on a mission to Japan, the Philippines, China, and Korea with the intent of forging an agreement to divide up Asia. This clandestine pact lit the fuse that would-decades later-result in a number of devastating wars: WWII, the Korean War, and the communist revolution in China.In 2005, James Bradley retraced that epic voyage and discovered the remarkable truth about America's vast imperial past. Full of fascinating characters brought brilliantly to life, The Imperial Cruise will powerfully revise the way we understand U.S. history.",
        "Category": " History , Modern , 20th Century",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Hate List",
        "Authors": "By Brown, Jennifer",
        "Description": "For readers of Marieke Nijkamp's This Is Where It Ends, a powerful and timely contemporary classic about the aftermath of a school shooting.Five months ago, Valerie Leftman's boyfriend, Nick, opened fire on their school cafeteria. Shot trying to stop him, Valerie inadvertently saved the life of a classmate, but was implicated in the shootings because of the list she helped create. A list of people and things she and Nick hated. The list he used to pick his targets.Now, after a summer of seclusion, Val is forced to confront her guilt as she returns to school to complete her senior year. Haunted by the memory of the boyfriend she still loves and navigating rocky relationships with her family, former friends, and the girl whose life she saved, Val must come to grips with the tragedy that took place and her role in it, in order to make amends and move on with her life.Jennifer Brown's critically acclaimed novel now includes the bonus novella Say Something, another arresting Hate List story.",
        "Category": " Young Adult Fiction , Social Themes , Bullying",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "The Pregnancy Journal: A Day-to-Day Guide to a Healthy and Happy Pregnancy",
        "Authors": "By Stadler, Greg (ILT) and Harris, A. Christine, Ph.D.",
        "Description": "The classic is back! Fully revised with the latest medical information on both mom's health and baby's development,this best-selling journal is packed with daily entries that feature tips, advice, and plenty of room for personal reflection.Beautifully repackaged with a fresh design, this one-of-a-kind journalestablished both as a self-purchase and gift of choiceis the ultimate resource for today's expecting mother.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The 3:16 Promise: He Loves. He Gives. We Believe. We Live.",
        "Authors": "By Lucado, Max",
        "Description": "Building on stories and illustrations from 3:16 The Numbers of Hope by Max Lucado, this 64-page evangelistic book leads the readers word-by-word through John 3:16, the passage that he calls the \"Hope Diamond\" of scripture. It's the perfect way to introduce the gospel to friends and acquaintances through Max Lucado's warm and easy to understand writing style. Experience God's grace and plan of salvation for the first time or use this booklet to share the message of hope with someone you know.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Fang: A Maximum Ride Novel (Maximum Ride, 6)",
        "Authors": "By Patterson, James",
        "Description": "When a mysterious billionaire and a dark prophecy threaten Max and her flock, can they stick together . . . or will it all come crashing down?Angel says that Fang will be the first to die, and Angel is never wrong. Maximum Ride is used to living desperately on the run from evil forces sabotaging her quest to save the world-but nothing has ever come as close to destroying her as this horrifying prophetic message. Fang is Max's best friend, her soul mate, her partner in the leadership of her flock of winged children. A life without Fang is a life unimaginable.When a newly created winged boy, the magnificent Dylan, is introduced into the flock, their world is upended yet again. Raised in a lab like the others, Dylan exists for only one reason: he was designed to be Max's perfect other half. Thus unfolds a battle of perfection versus passion that terrifies, twists, and turns . . . and meanwhile, the apocalypse is coming.",
        "Category": " Young Adult Fiction , Science Fiction , General",
        "Publisher": "Jimmy Patterson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Content Rules: How to Create Killer Blogs, Podcasts, Videos, Ebooks, Webinars (and More) That Engage Customers and Ignite Your Business (New Rules Social Media Series)",
        "Authors": "By Scott, David Meerman (FRW), Handley, Ann, and Chapman, C. C.",
        "Description": "The guide to creating engaging web content and building a loyal following, revised and updatedBlogs, YouTube, Facebook, Twitter, Google+, and other platforms are giving everyone a \"voice,\" including organizations and their customers. So how do you create the  stories, videos, and blog posts that cultivate fans, arouse passion for your products or services, and ignite your business? Content Rules equips you for online success as a one-stop source on the art and science of developing content that people care about. This coverage is interwoven with case studies of companies successfully spreading their ideas online—and using them to establish credibility and build a loyal customer base.Find an authentic \"voice\" and craft bold content that will resonate with prospects and buyers and encourage them to share it with othersLeverage social media and social tools to get your content and ideas distributed as widely as possibleUnderstand why you are generating content—getting to the meat of your message in practical, commonsense language, and defining the goals of your content strategyWrite in a way that powerfully communicates your service, product, or message across various Web mediums Boost your online presence and engage with customers and prospects like never before with Content Rules.",
        "Category": " Computers , Web , Social Media",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Dreamweaver CS5 for Windows and Macintosh",
        "Authors": "By Negrino, Tom and Smith, Dori",
        "Description": "With the release of Adobe Creative Suite CS5, Dreamweaver solidifies its role as the de facto tool of choice for anyone designing for the Web. Adobe Dreamweaver CS5 for Windows and Macintosh: Visual QuickStart Guide uses a combination of task-based instruction and strong visuals to teach beginning and intermediate users how to create, design, and publish powerful, innovative Web sites with Dreamweaver. Leading technology authors Tom Negrino and Dori Smith take you step-by-step through the new features in Adobe Dreamweaver CS5, with completely revised chapters on critical tools like styling pages with CSS and adding user interactivity with JavaScript dynamic elements. You&#39;ll also learn to take advantage of Dreamweaver&#39;s new ability to build and modify sites that use popular content management systems, such as WordPress, Joomla!, and Drupal. If you&#39;re new to Dreamweaer and web design, you&#39;ll learn to create your first Web site, add text, style and lay out page content, manage styles, work with links, incorporate images, media, tables, forms, and frames, design site navigation, and so much more. If you&#39;re an experienced user, you&#39;ll find this a convenient reference to the new features of Dreamweaver CS5.  Note from the publisher: FREE Adobe Dreamweaver CS5.5 updates are available for this title. Simply register your product at www.peachpit.com/register and you will receive the updates when they become available.",
        "Category": " Computers , Web , Design",
        "Publisher": "Peachpit Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Student Leadership Challenge: Five Practices for Exemplary Leaders",
        "Authors": "By Kouzes, James M. and Posner, Barry Z.",
        "Description": "Derived from the classic leadership book The Leadership Challenge,  Fourth Edition, this is a concise, focused primer on the Five Practices of Exemplary Leadership for students. Grounded in the same extensive research as the best selling The Leadership Challenge, this book uses examples and language to which students in higher education can relate. It also features reflective and critical thinking activities at the end of each chapter to help students engage in each of the Five Practices. Can be used with all levels—from incoming first-year students to outgoing grads and young professionalsExamples from both on-campus and off-campus venues, with particular emphasis on service-learning and effects of leadership in the surrounding community.Provides helpful and useful background on the instrument (Student LPI).The audio version of this book is available through your favorite online retailer.",
        "Category": " Education , Higher",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Known and Unknown: A Memoir",
        "Authors": "By Rumsfeld, Donald",
        "Description": "Visit www.rumsfeld.com  for more.Discover the enhanced e-book edition of Known and Unknown offering an unprecedented reading experience for a memoir by a major public figure. For web-connected readers, it features more than 500 links to never-before-available original documents from Donald Rumsfeld's extensive personal archive. It includes State Department cables, correspondence, and memoranda on topics such as Vietnam, Watergate, the days following 9/11, the wars in Iraq and Afghanistan, and much more. Available in ePub and Adobe Reader.Like Donald Rumsfeld, Known and Unknown pulls no punches.  With the same directness that defined his career in public service, Rumsfeld's memoir is filled with previously undisclosed details and insights about the Bush administration, 9/11, and the wars in Afghanistan and Iraq.  It also features Rumsfeld's unique and often surprising observations on eight decades of history: his experiences growing up during the Depression and World War II, his time as a Naval aviator; his service in Congress starting at age 30; his cabinet level positions in the Nixon and Ford White Houses; his assignments in the Reagan administration; and his years as a successful business executive in the private sector.  Rumsfeld addresses the challenges and controversies of his illustrious career, from the unseating of the entrenched House Republican leader in 1965, to helping the Ford administration steer the country away from Watergate and Vietnam, to bruising battles over transforming the military for the 21st century, to the war in Iraq, to confronting abuse at Abu Ghraib and allegations of torture at Guantanamo Bay.  Along the way, he offers his plainspoken, first-hand views and often humorous and surprising anecdotes about some of the world's best known figures, from Margaret Thatcher to Saddam Hussein, from Henry Kissinger to Colin Powell, from Elvis Presley to Dick Cheney, and each American president from Dwight D. Eisenhower to George W. Bush.  Rumsfeld relies not only on his memory but also on previously unreleased and recently declassified documents.  Thousands of pages of documents not yet seen by the public will be made available on an accompanying website.  Known and Unknown delivers both a fascinating narrative for today's readers and an unprecedented resource for tomorrow's historians.  Proceeds from the sales of Known and Unknown will go to the veterans charities supported by the Rumsfeld Foundation.",
        "Category": " Political Science , American Government , Executive Branch",
        "Publisher": "Sentinel",
        "Price Starting With ($)": "18.87",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Adobe Dreamweaver CS5 Digital Classroom",
        "Authors": "By Osborn, Jeremy, AGI Creative Team (COR), and Herald, Greg (CON)",
        "Description": "Learning Dreamweaver is a dream with this instructional book-and-video training package!Dreamweaver CS5 Digital Classroom covers Dreamweaver CS5 and Dreamweaver CS5.5. Adobe Dreamweaver allows you to easily create robust Web sites without needing extensive programming knowledge or skills. The latest version of Dreamweaver boasts enhanced capabilities and this exciting book-and-downloadable video training package makes learning the new features of Dreamweaver less intimidating. Sixteen self-paced lessons explain how to design, develop, and maintain a fully functioning site. The complementary lessons featured in the video tutorials are each approximately five minutes long and demonstrate the concepts and features covered in the lesson.Features full-color, step-by-step tutorials that complement the topics covered in each lessonWalks you through the basics of the newest release of Dreamweaver, such as applying style sheets, using dynamic HTML, adding style with images and multimedia, and publishing and maintaining a Web siteAddresses how to use hyperlinks to navigate throughout a Website or link to other sites on the Internet and use databases to create dynamic Web sitesIt's not a dream—Dreamweaver CS5 Digital Classroom really is just like having your own personal instructor guiding you through each lesson.Note: DVD and other supplementary materials are not included as part of eBook file. These materials are available for download upon purchase.",
        "Category": " Computers , Web , Design",
        "Publisher": "Wiley",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Committed: A Love Story",
        "Authors": "By Gilbert, Elizabeth",
        "Description": "The #1 New York Times bestselling follow-up to Eat, Pray, Love--an intimate and erudite celebration of love—from the author of Big Magic: Creative Living Beyond Fear.At the end of her memoir Eat, Pray, Love, Elizabeth Gilbert fell in love with Felipe, a Brazilian living in Indonesia. The couple swore eternal love, but also swore (as skittish divorce survivors) never to marry. However, providence intervened in the form of a U.S. government ultimatum: get married, or Felipe could never enter America again. Told with Gilbert's trademark humor and intelligence, this fascinating meditation on compatibility and fidelity chronicles Gilbert's complex and sometimes frightening journey into second marriage, and will enthrall the millions of readers who made Eat, Pray, Love a number one bestseller.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "A Midsummer Night's Dream (No Fear Shakespeare) (Volume 7)",
        "Authors": "By Shakespeare, William and Crowther, John (EDT)",
        "Description": "Read Shakespeare’s plays in all their brilliance—and understand what every word means!   Don’t be intimidated by Shakespeare! These popular guides make the Bard’s plays accessible and enjoyable.Each No Fear guide contains:The complete text of the original playA line-by-line translation that puts the words into everyday languageA complete list of characters, with descriptionsPlenty of helpful commentary",
        "Category": " Study Aids , Book Notes",
        "Publisher": "Sparknotes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Scent of Jasmine (Edilean)",
        "Authors": "By Deveraux, Jude",
        "Description": "Would you risk your life—on the love of a lifetime? Charleston, 1799: A daughter of Southern gentility and a gifted painter, Catherine Edilean Harcourt has no lack of suitors at home in Virginia, waiting to fulfill her dream of marriage and family. But Cay’s adventurous spirit, fostered by growing up with her three brothers, is piqued while visiting her godfather in South Carolina. Bedridden with a broken leg, he asks Cay to fill in for him on an urgent task: on her way to a fancy dress ball, she must deliver a packed horse to an old friend’s son—who also happens to be an escaped convict charged with murdering his wife! Cay agrees to the plan, which doesn’t go at all as planned . . . whereupon she finds herself fleeing Alexander McDowell’s captors, riding blind into the night with the fugitive Scotsman. Though she should fear him, Cay finds herself overwhelmingly attracted to Alex, and drawn into his tale of misguided justice and his innocence as they seek refuge in the steamy Florida everglades. Will trusting him be the worst mistake of her life? Or will falling in love be the salvation both of them have been looking for?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Eating the Dinosaur",
        "Authors": "By Klosterman, Chuck",
        "Description": "After a bestselling and acclaimed diversion into fiction, Chuck Klosterman, author of Sex, Drugs, and Cocoa Puffs, returns to the form in which he’s been spectacularly successful with a collection of essays about our consumption of pop culture and sports.Q: What is this book about?  A: Well, that’s difficult to say. I haven’t read it yet—I’ve just picked it up and casually glanced at the back cover. There clearly isn’t a plot. I’ve heard there’s a lot of stuff about time travel in this book, and quite a bit about violence and Garth Brooks and why Germans don’t laugh when they’re inside grocery stores. Ralph Nader and Ralph Sampson play significant roles. I think there are several pages about Rear Window and college football and Mad Men and why Rivers Cuomo prefers having sex with Asian women. Supposedly there’s a chapter outlining all the things the Unabomber was right about, but perhaps I’m misinformed.  Q: Is there a larger theme?  A: Oh, something about reality. “What is reality,” maybe? No, that’s not it. Not exactly. I get the sense that most of the core questions dwell on the way media perception constructs a fake reality that ends up becoming more meaningful than whatever actually happened. Also, Lady Gaga.  Q: Should I read this book?  A: Probably. Do you see a clear relationship between the Branch Davidian disaster and the recording of Nirvana’s In Utero? Does Barack Obama make you want to drink Pepsi? Does ABBA remind you of AC/DC? If so, you probably don’t need to read this book. You probably wrote this book. But I suspect everybody else will totally love it, except for the ones who totally hate it.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "The Price of Everything: Solving the Mystery of Why We Pay What We Do",
        "Authors": "By Porter, Eduardo",
        "Description": "Everything has a price, but it isn't always obvious what that price is.  Many of the prices we   pay seem to make little sense. We shell out $2.29 for a coffee at Starbucks when a nearly identical brew can be had   at the corner deli for less than a dollar. We may be less willing to give blood for $25 than to donate it for free.   Americans hire cheap illegal immigrants to fix the roof or mow the lawn, and vote for politicians who promise to   spend billions to keep them out of the country. And citizens of the industrialized West pay hundreds of dollars a year   in taxes or cash for someone to cart away trash that would be a valuable commodity in poorer parts of the world.    The Price of Everything starts with a simple premise: there is a price behind each choice that we   make, whether we're deciding to have a baby, drive a car, or buy a book. We often fail to appreciate just how critical   prices are as a motivating force shaping our lives. But their power becomes clear when distorted prices steer our   decisions the wrong way. Eduardo Porter uncovers the true story behind the prices we pay and reveals   what those prices are actually telling us. He takes us on a global economic adventure, from comparing the relative   price of a vote in corrupt São Tomé and in the ostensibly uncorrupt United States, to assessing the cost of happiness   in Bhutan, to deducing the dollar value we assign to human life. His unique approach helps explain: * Why   polygamous societies actually place a higher value on women than monogamous ones. * Why someone may find   more value in a $14 million license plate than the standard issue, $95 one. * Why some government agencies believe   one year of life for a senior citizen is four times more valuable than that of a younger person. Porter   weaves together the constant-and often unconscious-cost and value assessments we all make every day. While   exploring the fascinating story behind the price of everything from marriage and death to mattresses and   horsemeat, Porter draws unexpected connections that bridge a wide range of disciplines and cultures. The result is a   cogent and insightful narrative about how the world really works.    Watch a Video",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Portfolio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Incendiary: A Novel (Book Club Readers Edition)",
        "Authors": "By Cleave, Chris",
        "Description": "I am a woman built upon the wreckage of myself. In an emotionally raw voice alive with grief, compassion, and startling humor, a woman mourns the loss of her husband and son at the hands of one of history’s most notorious criminals. And in appealing to their executioner, she reveals the desperate sadness of a broken heart and a working-class life blown apart.",
        "Category": " Fiction , Political",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Red Hook Road: A Novel",
        "Authors": "By Waldman, Ayelet",
        "Description": "As lyrical as a sonata, Ayelet Waldman’s follow-up novel to Love and Other Impossible Pursuits explores the aftermath of a family tragedy. Set on the coast of Maine over the course of four summers, Red Hook Road tells the story of two families, the Tetherlys and the Copakens, and of the ways in which their lives are unraveled and stitched together by misfortune, by good intentions and failure, and by love and calamity. A marriage collapses under the strain of a daughter’s death; two bereaved siblings find comfort in one another; and an adopted young girl breathes new life into her family with her prodigious talent for the violin. As she writes with obvious affection for these unforgettable characters, Ayelet Waldman skillfully interweaves life’s finer pleasures—music and literature—with the more mundane joys of living. Within these resonant pages, a vase filled with wildflowers or a cold beer on a hot summer day serve as constant reminders that it’s often the little things that make life so precious.",
        "Category": " Fiction , Literary",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "The Lost Gate (Mither Mages, 1)",
        "Authors": "By Card, Orson Scott",
        "Description": "Danny North knew from early childhood that his family was different, and that he was different from them.  While his cousins were learning how to create the things that commoners called fairies, ghosts, golems, trolls, werewolves, and other such miracles that were the heritage of the North family, Danny worried that he would never show a talent, never form an outself.He grew up in the rambling old house, filled with dozens of cousins, and aunts and uncles, all ruled by his father.  Their home was isolated in the mountains of western Virginia, far from town, far from schools, far from other people.There are many secrets in the House, and many rules that Danny must follow.   There is a secret library  with only a few dozen books, and none of them in English — but Danny and his cousins are expected to become fluent in the language of the books.  While Danny's cousins are free to create magic whenever they like, they must never do it where outsiders might see.Unfortunately, there are some secrets kept from Danny  as well.  And that will lead to disaster for the North family.The Mithermages seriesThe Lost GateThe Gate ThiefGatefather",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "InDesign CS4 for Macintosh and Windows: Visual QuickStart Guide",
        "Authors": "By Cohen, Sandee",
        "Description": "Adobe InDesign CS4, Adobe's page-design component of Creative Suite 4, offers exciting new enhancements to its already powerful tools. Among the exciting features users will find are new Live Preflighting capabilities and seamless integration with Adobe Flash, including direct translation of InDesign pages into SWF files. Adobe InDesignCS4 for Macintosh and Windows: Visual QuickStart Guidewill highlight the important new features, as well as covering the ones readers have relied on in previous versions of InDesign.Using the task-based, visual approach that readers count on in the Visual QuickStart Guides, this volume introduces readers to all aspects of InDesign CS4. Users will learn how to create and automate documents, import and style text and objects, manage long documents, export files for a wide variety of purposes, and much more.",
        "Category": " Computers , Desktop Applications , Desktop Publishing",
        "Publisher": "Peachpit Press",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Eat to Live: The Amazing Nutrient-Rich Program for Fast and Sustained Weight Loss, Revised Edition",
        "Authors": "By Fuhrman, Joel",
        "Description": "Hailed a \"medical breakthrough\" by Dr. Mehmet Oz, EAT TO LIVE offers a highly effective, scientifically proven way to lose weight quickly. The key to Dr. Joel Fuhrman's revolutionary six-week plan is simple: health = nutrients / calories. When the ratio of nutrients to calories in the food you eat is high, you lose weight. The more nutrient-dense food you eat, the less you crave fat, sweets, and high-caloric foods.EAT TO LIVE has been revised to include inspiring success stories from people who have used the program to lose shockingly large amounts of weight and recover from life-threatening illnesses; Dr. Fuhrman's nutrient density index; up-to-date scientific research supporting the principles behind Dr. Fuhrman's plan; new recipes and meal ideas; and much more. This easy-to-follow, nutritionally sound diet can help anyone shed pounds quickly-and keep them off.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Little, Brown Spark",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "The New Reagan Revolution: How Ronald Reagan's Principles Can Restore America's Greatness",
        "Authors": "By Denney, Jim, Gingrich, Newt (FRW), and Reagan, Michael",
        "Description": "\"There are cynics who say that a party platform is something that no one bothers to read and it doesn't very often amount to much.  Whether it is different this time than it has ever been before, I believe the Republican Party has a platform that is a banner of bold, unmistakable colors, with no pastel shades.\" –Ronald Reagan, 1976 Republican National Convention When Ronald Reagan was called to the podium by President Ford during the 1976 Republican National Convention, he had no prepared remarks. But the unrehearsed speech he gave that night is still regarded as one of the most moving speeches of his political career. The reason he was able to give such a powerful speech on a moment's notice was that he was proclaiming the core principles of his heart and soul, which he had been teaching and preaching for years.The New Reagan Revolution reveals new insights into the life, thoughts, and actions of the man who changed the world during the 1980s. The challenges and threats we face today are eerily similar to the conditions in the world before the beginning of the Reagan era. The good news is that we already know what works. Ronald Reagan has given us the blueprint. This book is not merely a diagnosis of our nation's ills, but a prescription to heal our nation, rooted in the words and principles of Ronald Reagan. In these pages, you'll find a plan for returning America to its former greatness, soundness, and prosperity. It's the plan Ronald Reagan developed over years of study, observation, and reflection. It's a plan he announced to the nation, straight from his heart, one summer evening during America's 200th year. It's the plan he put into action during his eight years in office as the most effective president of the 20th century, and it is the plan we can use today to help return America to its former greatness, soundness, and prosperity.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Marrying Daisy Bellamy (The Lakeshore Chronicles, 8)",
        "Authors": "By Wiggs, Susan",
        "Description": "Daisy Bellamy has struggled for years to choose between two men&#151;one honorable and steady, one wild and untethered. And then, one fateful day, the decision is made for her.Now busy with a thriving business on Willow Lake, Daisy knows she should be happy with the life she's chosen for herself and her son. But she still aches for the one thing she can't have.Until the man once lost to her reappears, resurrected by a promise of love. And now the choice Daisy thought was behind her is the hardest one she'll ever face&#133;.",
        "Category": " Fiction , Women",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "CSS: The Definitive Guide: The Definitive Guide",
        "Authors": "By Meyer, Eric A.",
        "Description": "CSS: The Definitive Guide, 3rd Edition, provides you with a comprehensive guide to CSS implementation, along with a thorough review of all aspects of CSS 2.1. Updated to cover Internet Explorer 7, Microsoft's vastly improved browser, this new edition includes content on positioning, lists and generated content, table layout, user interface, paged media, and more.Simply put, Cascading Style Sheets (CSS) is a way to separate a document's structure from its presentation. The benefits of this can be quite profound: CSS allows a much richer document appearance than HTML and also saves time -- you can create or change the appearance of an entire document in just one place; and its compact file size makes web pages load quickly.CSS: The Definitive Guide, 3rd Edition, provides you with a comprehensive guide to CSS implementation, along with a thorough review of all aspects of CSS 2.1. Updated to cover Internet Explorer 7, Microsoft's vastly improved browser, this new edition includes content on positioning, lists and generated content, table layout, user interface, paged media, and more. Author Eric Meyer tackles the subject with passion, exploring in detail each individual CSS property and how it interacts with other properties. You'll not only learn how to avoid common mistakes in interpretation, you also will benefit from the depth and breadth of his experience and his clear and honest style. This is the complete sourcebook on CSS.The 3rd edition contains:Updates to reflect changes in the latest draft version of CSS 2.1Browser notes updated to reflect changes between IE6 and IE7Advanced selectors supported in IE7 and other major browsers includedA new round of technical edits by a fresh set of editorsClarifications and corrected errata, including updated URLs ofreferenced online resources",
        "Category": " Computers , Desktop Applications , Desktop Publishing",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Digital Photography Book, Part 2",
        "Authors": "By Kelby, Scott",
        "Description": "Scott Kelby, author of the groundbreaking bestseller “The Digital Photography Book, Vol. 1” is back with an entirely new book that picks up right where Vol. 1 left off. It’s more of that “Ah ha—so that’s how they do it,” straight-to-the-point, skip the techno jargon; packed with stuff you can really use today, that made Vol. 1 the world’s bestselling book on digital photography. In Volume 2, Scott adds entirely new chapters packed with Plain English tips on using flash, shooting close up photography, travel photography, shooting people, and even how to build a studio from scratch, where he demystifies the process so anyone can start taking pro-quality portraits today! Plus, he&#39;s got full chapters on his most requested topics, including loads of tips for landscape photographers, wedding photographers, and there&#39;s an entire chapter devoted to sharing some of the pro&#39;s secrets for making your photos look more professional, no matter what you&#39;re shooting.  This book truly has a brilliant premise, and here’s how Scott describes it: “If you and I were out on a shoot, and you asked me, ‘When I use my flash, the background behind the person I’m shooting turns black. How do I fix that?’ I wouldn’t give you a lecture on flash ratios, or start a discussion on flash synchronization and rear curtain sync. I’d just say “Lower your shutter speed to 1/60 of a second. That should do it” Well, that’s what this book is all about: you and I out shooting where I answer questions, give you advice, and share the secrets I’ve learned just like I would with a friend—without all the technical explanations and techie photo speak.” Each page covers a single concept on how to make your photography better. Every time you turn the page, you’ll learn another pro setting, tool, or trick to transform your work from snapshots into gallery prints. If you’re tired of taking shots that look “okay,” and if you’re tired of looking in photography magazines and thinking, “Why don’t my shots look like that?” then this is the book for you. This isn’t a book of theory—full of confusing jargon and detailed concepts. This is a book on which button to push, which setting to use, and when to use it. With nearly another 200 of the most closely guarded photographic “tricks of the trade,” this book gets you shooting dramatically better-looking, sharper, more colorful, more professional-looking photos every time.",
        "Category": " Photography , Techniques , Digital",
        "Publisher": "Peachpit Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Awakening (Darkest Powers)",
        "Authors": "By Armstrong, Kelley",
        "Description": "You don't have to be alive to be awakened.Chloe Saunders is a living science experiment—not only can she see ghosts, but she was genetically altered by a sinister organization called the Edison Group. She's a teenage necromancer whose powers are out of control, which means she can raise the dead without even trying. Now Chloe's running for her life with three of her supernatural friends—a charming sorcerer, a cynical werewolf, and a disgruntled witch—and they have to find someone who can help them before the Edison Group catches them. Or die trying.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Advertising: Concept and Copy",
        "Authors": "By Felton, George",
        "Description": "Felton (English, Columbus College of Art and Design) presents this textbook leading students through the process of creating ads, from the ideas to execution, with approximately 200 ads as examples, some updated for this edition. Chapters cover advertising strategy, research, consumer behavior, the marketplace, and developing a creative brief. Felton explains voice and writing technique, television, radio, and other media, and how to be creative, write a headline, and use facts, testimonials, and other tools such as comparisons, reversal, metaphor, and verbal metaphor. The second edition also has new sections on guerrilla advertising; interactive media; international, multicultural, and postmodern advertising; and expanded material on headlines, theme lines, slogans, naming, human truth, and grace. Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Design , Graphic Arts , Advertising",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Heading Home With Your Newborn: From Birth to Reality, 2nd Edition",
        "Authors": "By Jana, Laura A. and Shu, Jennifer",
        "Description": "Now in a fully-updated second edition, Heading Home with Your Newborn has everything new and expectant parents need to know about caring for baby in the first few months after birth. Written by two pediatricians who are also parents, this awarding-winning guide covers feeding, sleeping, changing, bathing, dressing, traveling, sickness, child care options, and much more.The second edition features new chapters on vaccines and choosing a child care provider, plus a robust new section devoted to early learning, with chapters on baby brain basics, baby sign language, fun and games, books and babies, the sounds of music, and the effects of media on the very young. Also included is new or updated information on car seats, safe sleep, cord blood, what to keep in your medicine cabinet, postpartum depression, vitamin D, organic formulas, disposable vs. cloth diapers, newborn hearing screening, and more.With wit and humor, Drs. Shu and Jana allay the feelings of anxiety, guilt, and inadequacy that inevitably plague first-time parents home alone with a newborn, providing authoritative yet compassionate advice for the sleep-deprived and overwhelmed!Here are a few special excerpts from Heading Home With Your Newborn as featured on HealthyChildren.org:Sleeping by the BookThe Many Colors of PoopTo Bathe, or Not to Bathe",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "American Academy of Pediatrics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Poser: My Life in Twenty-three Yoga Poses",
        "Authors": "By Dederer, Claire",
        "Description": "Ten years ago, Claire Dederer threw out her back while breastfeeding her baby daughter. Told to try yoga by everyone from the woman behind the counter at the co-op to the homeless guy on the corner, she overcame her doubts and signed up for her first class. And she fell madly in love.Over the next decade, Dederer would tackle poses such as lotus, wheel, and the dreaded crow. She became fast friends with some of them, while others provoked long-standing feuds.It wasn't just her back that was demanding Dederer do something differently. On the surface, life at home looked pretty idyllic. But she found herself thinking more and more about the forces that had shaped her generation. They were children of the 1970s---their mothers had run away to find them-selves and hadn't been afraid to make a few messes along the way. The daughters, as a result, grew up determined to be good, good, good. They would buy organic, create an enriching home environment, and make their own baby food---even if it meant feeling hemmed in by an anxiously conscientious little world. Yoga seemed to fit right into this program.To her surprise, Dederer found that the poses weren't just acrobatic feats (though they were that, too). The deeper she explored them, the more they tested her most basic ideas of what makes a good mother, daughter, friend, wife. Suddenly, headstand was a way to wrestle with anxieties she had always dodged, jump-through helped her understand her mother's flight (and, maybe, her own pursuit of freedom), and the dreaded crow reminded her that losing one's balance could be worth a great deal more than keeping both feet on the ground.As Dederer's practice deepened, the poses that once seemed so daunting now pushed her toward a life that was a little more improvisational---and a little less tidy. Witty and heartfelt, sharp and irreverent, Poser is the story of Dederer's discovery that what she needed most of all was less goodness---and more joy.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "The Quiet World: Saving Alaska's Wilderness Kingdom, 1879-1960",
        "Authors": "By Brinkley, Douglas",
        "Description": "In what is clearly a labor of love, Brinkley (history, Rice U.) recounts an environmentalist's history of Alaska from its purchase by the US in 1880 to the formation of the Arctic National Wildlife Refuge in 1960. He charts the wilderness movement through the lives of advocates ranging from itinerant artists and lady bush pilots, to ardent wildlife biologists, to a Supreme Court justice and the President of the United States. Using these biographies as mileposts, he chronicles such conservation achievements as the Glacier Bay and Denali National Parks, Gates of the Arctic National Wildlife Preserve, and the Tongass and Chugach National Forests. Brinkley sketches a portrait of stunning locales and abundant wildlife; industry; politics; unremitting progress; and a surprisingly diverse cast of champions, including John Muir, Theodore Roosevelt, Ansel Adams, Rachel Carson, Allen Ginsberg, and even the Walt Disney Studios. Annotation ©2011 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Harper",
        "Price Starting With ($)": "6.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "The Poison Tree: A Novel",
        "Authors": "By Kelly, Erin",
        "Description": "From an incredible new voice in psychological suspense, a novel about the secrets that remain after a final bohemian summer of excess turns deadly.  This taut psychological thriller begins when Karen and her nine-year- old daughter, Alice, pick up Rex from a ten-year stint in prison for murder. Flash back to the sultry summer in 1990s London when Karen, a straight-A student on the verge of college graduation, first meets the exotic, flamboyant Biba and joins her louche life in a crumbling mansion in Highgate. She begins a relationship with Biba's enigmatic and protective older brother, Rex, and falls into a blissful rhythm of sex, alcohol, and endless summer nights. Naïvely, Karen assumes her newfound happiness will last forever. But Biba and Rex have a complicated family history-one of abandonment, suicide, and crippling guilt-and Karen's summer of freedom is about to end in blood. When old ghosts come back to destroy the life it has taken Karen a decade to build, she has everything to lose. She will do whatever it takes to protect her family and keep her secret. Alternating between the fragile present and the lingering past with a shocker of an ending, The Poison Tree is a brilliant suspense debut that will appeal to readers of Kate Atkinson, Donna Tartt, and Tana French.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Pamela Dorman Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "When Beauty Tamed the Beast (Fairy Tales, 2)",
        "Authors": "By James, Eloisa",
        "Description": "“Eloisa James’s writing is absolutely exquisite.”—New York Times bestselling author Teresa Medeiros “Nothing gets me to a bookstore faster than a new novel by Eloisa James.”—New York Times bestselling author Julia Quinn A wonderful spin on a much-beloved fairy tale, New York Times bestselling author Eloisa James’s When Beauty Tamed the Beast is heart-soaring and fun historical romance at its finest. Miss Linnet Berry Thrynne is a Beauty . . . Naturally, she's betrothed to a Beast.Piers Yelverton, Earl of Marchant, lives in a castle in Wales where, it is rumored, his bad temper flays everyone he crosses. And rumor also has it that a wound has left the earl immune to the charms of any woman. Linnet is not just any woman.She is more than merely lovely: her wit and charm brought a prince to his knees. She estimates the earl will fall madly in love—in just two weeks.Yet Linnet has no idea of the danger posed to her own heart by a man who may never love her in return.If she decides to be very wicked indeed . . . what price will she pay for taming his wild heart?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Common Nonsense: Glenn Beck and the Triumph of Ignorance",
        "Authors": "By Zaitchik, Alexander",
        "Description": "Who is this guy and why are people listening?Forget Rush Limbaugh, Bill O'Reilly, and Sean Hannity—Glenn Beck is the Right’s new media darling and the unofficial leader of the conservative grassroots. Lampooned by the Left and Lionized by the far Right, his bluster-and-tears brand of political commentary has commandeered attention on both sides of the aisle.Glenn Beck has emerged over the last decade as a unique and bizarre conservative icon for the new century. He encourages his listeners to embrace a cynical paranoia that slides easily into a fantasyland filled with enemies that do not exist and solutions that are incoherent, at best. Since the election of President Barack Obama, Beck’s bombastic, conspiratorial, and often viciously personal approach to political combat has made him one of the most controversial figures in the history of American broadcasting.In Common Nonsense, investigative reporter Alexander Zaitchik explores Beck's strange brew of ratings lust, boundless ego, conspiratorial hard-right politics, and gimmicky morning-radio entertainment chops.Separates the facts from the fiction, following Beck from his troubled childhood to his recent rise to the top of the conservative media heap Zaitchik's recent three-part series in Salon caused so much buzz, Beck felt the need to attack it on his show Based on Zaitchik's interviews with former Beck coworkers and review of countless Beck writings and television and radio shows Explains why Beck is always crying, why he has so many conservative enemies, why he's driven by conspiracy theories, and why he's dangerous to the health of the republicA contributing writer to Alternet, Zaitchik's reporting has appeared in the New Republic, the Nation, Salon, Wired, Reason, and the BelieverBeck, a perverse and high-impact media spectacle, has emerged as a leader in a conservative protest movement that raises troubling questions about the future of American politics.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Trade Paper Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Business Plans Kit For Dummies",
        "Authors": "By Jaret, Peter, Schenck, Barbara Findlay, and Peterson, Steven",
        "Description": "When you're establishing, expanding, or re-energizing a business, the first place to invest time and energy is with writing your business plan. If you're a small business owner looking for expert guidance and friendly tips on developing and implementing a strategic plan to help your business succeed in any economy, Business Plans Kit For Dummies has you covered!-Build from the ground up ù learn how to establish your company's mission, vision, values, and goals-Get down to the nitty-gritty ù develop every step of your business plan's components, from analyzing your company's capabilities to developing a marketing strategy-Make it personal ù understand how to handle the special planning issues if you're self-employed, facing turnaround issues, starting a nonprofit, or working online-Dot your i's and cross your t's ù follow practical guidance for putting together an organized, reader-friendly written planOpen the book and find:-The importance of writing a business plan-Business plan components from beginning to end-Advice on how to revitalize your business-Ways to address challenges in a changing market-How to describe and define your business-Marketing strategies that work-Clear explanations of business finances-Planning for new and established businesses",
        "Category": " Business & Economics , Strategic Planning",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Pictures of You",
        "Authors": "By Leavitt, Caroline",
        "Description": "Two women running away from their marriages collide on a foggy highway, killing one of them. The survivor, Isabelle, is left to pick up the pieces, not only of her own life, but of the lives of the devastated husband and fragile son that the other woman, April, has left behind. Together, they try to solve the mystery of where April was running to, and why. As these three lives intersect, the book asks, How well do we really know those we love—and how do we forgive the unforgivable?",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Wherever You Are: My Love Will Find You",
        "Authors": "By Tillman, Nancy",
        "Description": ". . . I wanted you more than you'll ever know,so I sent love to follow wherever you go. . . .Love is the greatest gift we have to give our children. It's the one thing they can carry with them each and every day.If love could take shape it might look something like these heartfelt words and images from the inimitable Nancy Tillman. Here is a book to share with your loved ones, no matter how near or far, young or old, they are.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Feiwel & Friends",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Factory Girls: From Village to City in a Changing China",
        "Authors": "By Chang, Leslie T.",
        "Description": "An eye-opening and previously untold story, Factory Girls is the first look into the everyday lives of the migrant factory population in China.China has 130 million migrant workers—the largest migration in human history. In Factory Girls, Leslie T. Chang, a former correspondent for the Wall Street Journal in Beijing, tells the story of these workers primarily through the lives of two young women, whom she follows over the course of three years as they attempt to rise from the assembly lines of Dongguan, an industrial city in China’s Pearl River Delta.As she tracks their lives, Chang paints a never-before-seen picture of migrant life—a world where nearly everyone is under thirty; where you can lose your boyfriend and your friends with the loss of a mobile phone; where a few computer or English lessons can catapult you into a completely different social class. Chang takes us inside a sneaker factory so large that it has its own hospital, movie theater, and fire department; to posh karaoke bars that are fronts for prostitution; to makeshift English classes where students shave their heads in monklike devotion and sit day after day in front of machines watching English words flash by; and back to a farming village for the Chinese New Year, revealing the poverty and idleness of rural life that drive young girls to leave home in the first place. Throughout this riveting portrait, Chang also interweaves the story of her own family’s migrations, within China and to the West, providing historical and personal frames of reference for her investigation.A book of global significance that provides new insight into China, Factory Girls demonstrates how the mass movement from rural villages to cities is remaking individual lives and transforming Chinese society, much as immigration to America’s shores remade our own country a century ago.",
        "Category": " Social Science , Ethnic Studies , Asian American Studies",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "It's a Book",
        "Authors": "By Smith, Lane",
        "Description": "Playful and lighthearted with a subversive twist that is signature Lane Smith, IT'S A BOOK is a delightful manifesto on behalf of print in the digital age. This satisfying, perfectly executed picture book has something to say to readers of all stripes and all ages.",
        "Category": " Juvenile Fiction , Books & Libraries",
        "Publisher": "Roaring Brook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Green to Gold: How Smart Companies Use Environmental Strategy to Innovate, Create Value, and Build Competitive Advantage",
        "Authors": "By Esty, Daniel C. and Winston, Andrew S.",
        "Description": "This book explains what every executive should know to manage the environmental challenges facing society and the business world. Based on the authors&#39; rich experience with forward-thinking companies around the world, Green to Gold demonstrates how corporations create value by building environmental thinking into their overall business strategies. Daniel C. Esty and Andrew S. Winston provide clear &#39;how to&#39; advice for making sense of environmental challenges, and they offer detailed case examples of how companies achieve both environmental and business success—establishing an eco-advantage in the marketplace. Green to Gold is written for executives at all levels and businesses of all kinds. It guides the business leader through pollution and natural resource management issues and the growing pressure from outside stakeholders to strive for &#39;sustainability&#39;. While highlighting successful strategies, Esty and Winston also examine why environmental initiatives may fail despite best intentions. With practical suggestions for incorporating environmental thinking into core business strategy, and with a clear focus on execution—not legalisms, platitudes and abstractions—Esty and Winston present a thoughtful, pragmatic roadmap that shows how companies can use environmental pressures and responsibilities to spark innovation and drive growth.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Athlete's Palate Cookbook: Renowned Chefs, Delicious Dishes, and the Art of Fueling Up While Eating Well",
        "Authors": "By Runner's World Magazine (EDT) and Lee, Yishane",
        "Description": "Fuel Your Workouts with 125 Recipes from All-star Chef-Athletes!Training hard doesn't have to mean fueling workouts with flavorless foods better suited to members of the animal kingdom. Just ask the all-star roster of chefs who contribute to Runner's World magazine's popular monthly column, the Athlete's Palate. For five years, the likes of Bobby Flay, Jacques Torres, Charlie Trotter, Mark Bittman, Dan Barber, Cat Cora and many more have contributed the recipes they use to fuel their runs to the column. Now, in The Athlete's Palate Cookbook - by Yishane Lee and the editors of Runner's World - these dishes along with more than 60 all-new recipes for breakfasts, entrees, soups, salads, sides, desserts, and beverages are presented along side profiles of the chef-athletes who created them. The first of its kind, this gorgeously photographed cookbook includes recipes for:· Walnut and Banana Bran Pancakes from Cat Cora· Marathon Fettuccine with Shrimp in Charred Tomato Sauce from Bobby Flay· Chicken with Quinoa Tabbouleh from Charlie Trotter· And many more sumptuous meals!With healthy and delicious recipes for all phases of training along with labels for quick-and-easy meals, The Athlete's Palate Cookbook is perfect for any runner, cyclist, swimmer, or triathlete who wants to train hard while eating well.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "No Excuses: The True Story of a Congenital Amputee Who Became a Champion in Wrestling and in Life",
        "Authors": "By Maynard, Kyle",
        "Description": "He was born a congenital amputee, his arms ending at his elbows and his legs at his knees. But that didn’t stop Kyle Maynard from becoming a champion, on the wrestling mat and in his life.No Excuses is the inspiring story of Kyle’s battle against the odds. You’ll learn about the family who supported him, the coach who trained him, and the faith that strengthened him to face the toughest fights.",
        "Category": " Sports & Recreation , Wrestling",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Public Enemies: Dueling Writers Take On Each Other and the World",
        "Authors": "By Levy, Bernard Henri, Wynne, Frank (TRN), Houellebecq, Michel, and Frendo, Miriam (TRN)",
        "Description": "The international publishing sensation is now available in the United States—two brilliant, controversial authors confront each other and their enemies in an unforgettable exchange of letters. In one corner, Bernard-Henri Lévy, creator of the classic Barbarism with a Human Face, dismissed by the media as a wealthy, self-promoting, arrogant do-gooder. In the other, Michel Houellebecq, bestselling author of The Elementary Particles, widely derided as a sex-obsessed racist and misogynist. What began as a secret correspondence between bitter enemies evolved into a remarkable joint personal meditation by France’s premier literary and political live wires.  An instant international bestseller, Public Enemies has now been translated into English for all lovers of superb insights, scandalous opinions, and iconoclastic ideas.In wicked, wide-ranging, and freewheeling letters, the two self-described “whipping boys” debate whether they crave disgrace or secretly have an insane desire to please. Lévy extols heroism in the face of tyranny; Houellebecq sees himself as one who would “fight little and badly.” Lévy says “life does not ‘live’” unless he can write; Houellebecq bemoans work as leaving him in such “a state of nervous exhaustion that it takes several bottles of alcohol to get out.” There are also touching and intimate exchanges on the existence of God and about their own families.Dazzling, delightful, and provocative, Public Enemies is a death match between literary lions, remarkable men who find common ground, confident that, in the end (as Lévy puts it), “it is we who will come out on top.”",
        "Category": " Philosophy , History & Surveys , Modern",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Worldchanging: A User's Guide for the 21st Century",
        "Authors": "By Steffen, Alex (EDT) and Gore, Albert (FRW)",
        "Description": "Worldchanging is packed with information, resources, reviews, and ideas that give readers access to the tools they need to build a better future. Written by a diverse collaborative of innovators,Worldchanging demonstrates that the means for making a difference lie all around us.This team of top-notch writers, brought together by Worldchanging.com founder Alex Steffen, includes Cameron Sinclair, founder of Architecture for Humanity, Geekcore founder Ethan Zuckerman, and sustainable food expert Anne Lappé, among many others.Each chapter offers practical answers to important questions, such as: Why does buying locally produced food make sense? What steps can we take to influence our workplace toward sustainability? How can we travel, live, work, and learn in world-changing ways? How, in short, can we participate in building a better future locally and globally?Worldchanging proves that a life that is sustainably prosperous, thoughtful and democratic, dynamic and peaceful, is not just possible, it’s here.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Abrams",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Scorch Trials (Maze Runner, Book Two)",
        "Authors": "By Dashner, James",
        "Description": "Book two in the blockbuster Maze Runner series that spawned a movie franchise and ushered in a worldwide phenomenon! And don’t miss The Fever Code, the highly-anticipated series conclusion that finally reveals the story of how the maze was built!     Thomas  was sure that escape from the Maze would mean freedom for him and the  Gladers. But WICKED isn’t done yet. Phase Two has just begun. The  Scorch.   The Gladers have two weeks to cross through the Scorch—the most  burned-out section of the world. And WICKED has made sure to adjust the  variables and stack the odds against them.   There are others now. Their survival depends on the Gladers’ destruction—and they’re determined to survive.   Friendships will be tested. Loyalties will be broken. All bets are off.  The Maze Runner and Maze Runner: The Scorch Trials, and Maze Runner: The Death Cure are all now major motion pictures featuring the star of MTV's Teen Wolf, Dylan O’Brien; Kaya Scodelario; Aml Ameen; Will Poulter; and Thomas Brodie-Sangster.   Also look for James Dashner’s edge-of-your-seat MORTALITY DOCTRINE series!  Praise for the Maze Runner series: A #1 New York Times Bestselling Series A USA Today Bestseller A Kirkus Reviews Best Teen Book of the Year An ALA-YASLA Best Fiction for Young Adults Book An ALA-YALSA Quick Pick   “[A] mysterious survival saga that passionate fans describe as a fusion of Lord of the Flies, The Hunger Games, and Lost.” —EW.com   “Wonderful action writing—fast-paced…but smart and well observed.” —Newsday   “[A] nail-biting must-read.” —Seventeen.com   “Breathless, cinematic action.” —Publishers Weekly   “Heart pounding to the very last moment.” —Kirkus Reviews   “Exclamation-worthy.” —Romantic Times   “James Dashner’s illuminating prequel [The Kill Order] will thrill fans of this Maze Runner [series] and prove just as exciting for readers new to the series.” —Shelf Awareness, Starred “Take a deep breath before you start any James Dashner book.” —Deseret News",
        "Category": " Young Adult Fiction , Science Fiction , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Boys Adrift: The Five Factors Driving the Growing Epidemic of Unmotivated Boys and Underachieving Young Men",
        "Authors": "By Sax, Leonard, M.D.",
        "Description": "Something scary is happening to boys today. From kindergarten to college, American boys are, on average, less resilient and less ambitious than they were a mere twenty years ago. The gender gap in college attendance and graduation rates has widened dramatically. While Emily is working hard at school and getting A&#39;s, her brother Justin is goofing off. He&#39;s more concerned about getting to the next level in his videogame than about finishing his homework. Now, Dr. Leonard Sax delves into the scientific literature and draws on more than twenty years of clinical experience to explain why boys and young men are failing in school and disengaged at home. He shows how social, cultural, and biological factors have created an environment that is literally toxic to boys. He also presents practical solutions, sharing strategies which educators have found effective in re-engaging these boys at school, as well as handy tips for parents about everything from homework, to videogames, to medication.",
        "Category": " Psychology , Developmental , Adolescent",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Twitter For Dummies",
        "Authors": "By Fitton, Laura, Gruen, Michael E., Poston, Leslie, and Dorsey, Jack (FRW)",
        "Description": "A fully updated guide to the how and why of using TwitterThe fastest-growing social network utility sports new features, and they’re all covered in this how-to guide from a leading Twitter marketing consultant. Nearly 20 million people are tweeting on Twitter, and this book shows you how to join them and why you should. You’ll learn the nuts and bolts of using Twitter, how to make good connections, and how it can benefit your life and your business.Twitter is the fastest-growing of the social networking tools; this book gets you up to speed on the basics as well as how Twitter can enrich your life and boost your businessExplains how to sign up, find friends and people you want to follow, make the most of shortcuts, use popular Twitter tools, and Twitter on the goDiscusses how Twitter can be used for business, fundraising, and maintaining contact with people who share common goalsWith complete information about all the latest Twitter enhancements, Twitter For Dummies, 2nd Edition will help you get the most from this popular social networking tool.",
        "Category": " Computers , Web , Social Media",
        "Publisher": "Wiley Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Harvest to Heat: Cooking with America's Best Chefs, Farmers, and Artisans",
        "Authors": "By Waters, Alice (FRW), Estrine, Darryl, and Kochendorfer, Kelly",
        "Description": "Now more than ever, Americans are giving careful thought to where their food comes from. And farmers, formerly anonymous suppliers of bounty, are proving an inspiration to chefs everywhere. This book celebrates the collaboration between farmer and chef – and the journey from land to table. Readers are invited along to visit the men and women who grow, herd, ranch, and create artisanal foods that supply the finest restaurant chefs in the country.Harvest to Heat explores this dynamic relationship and paints beautiful portraits of these often unheralded people, even while it offers up a bounty of never before published, easy to cook recipes – 100 in all. It will encourage readers to think fresh first and buy food locally, as well as motivate them to cook with the confidence of a four-star chef.",
        "Category": " Cooking , Seasonal",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Dilemma: A Priest's Struggle with Faith and Love",
        "Authors": "By Cutie, Albert",
        "Description": "He was a Roman Catholic priest whose love affair became headline news. Now, he shares his explosive story-in his own words... In this deeply personal and controversial memoir, Father Albert Cutié tells about the devastating struggle between upholding his sacred promises as a priest and falling in love. Already conflicted with growing ideological differences with the Church, Cutié was forced to abruptly change his life the day that he was photographed on the beach, embracing the woman he would later call his wife.Once a poster boy of the Roman Catholic Church-loved and admired by millions-Cutié found that he was not happy and able to live as a celibate priest, especially having to defend the number of positions he was no longer in agreement with. For years he kept his relationship a secret, while he soul searched and prayed for answers. The love that he deemed a blessing was bringing him closer to God, but further from the Church. In Dilemma, Cutié tells about breaking that promise, reigniting the very heated debate over mandatory celibacy for Catholic priests, beginning a new way of life and discovering a new way of serving God.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Celebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Fancy Nancy: Heart to Heart: With Fancy Stickers!",
        "Authors": "By O'Connor, Jane, Preiss-Glasser, Robin (ILT), and Bracken, Carolyn (ILT)",
        "Description": "Almost everything about Valentine's Day is fancy . . . especially with Fancy Nancy!Mystery is in the air when Nancy receives a valentine from a secret someone. Join Nancy as she follows the clues to find out who it is—all in her trademark fabulous style, of course. Gorgeous stickers included!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Valentine's Day",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Anatomy (Quickstudy Reference Guides - Academic)",
        "Authors": "By Barcharts, Inc. (COR)",
        "Description": "Complete labeled illustrations of over 1,400 anatomical identifications. Loaded with beautifully illustrated diagrams clearly and concisely labeled for easy identification. Illustrations by award-winning medical illustrator Vincent Perez.",
        "Category": " Medical , Anatomy",
        "Publisher": "QuickStudy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Global Achievement Gap: Why Even Our Best Schools Don't Teach the New Survival Skills Our Children Need-And What We Can Do About It",
        "Authors": "By Wagner, Tony",
        "Description": "In The Global Achievement Gap, education expert Tony Wagner situates our school problems in the larger context of the demands of the global knowledge economy. With insights gained from visits to classrooms in leading suburban schools, he analyzes performance by considering the skills needed to get a good job and become a productive citizen. Highlighting discussions with young people and the adults who work with them, Wagner also explains the ways in which today’s generation is differently motivated to excel.A manifesto for the twenty-first century, The Global Achievement Gap is a must-read for anyone interested in seeing our young people achieve their full potential.",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "The Anti-Inflammation Zone: Reversing the Silent Epidemic That's Destroying Our Health (The Zone)",
        "Authors": "By Sears, Barry",
        "Description": "Combat silent inflammation -- the most serious health threat you never heard ofHeart disease is the #1 killer of Americans.Cancer is the #1 fear of Americans.Dementia is the #1 concern of Americans.What do these devastating illnesses have in common? All three have been linked to silent inflammation, a condition that occurs when the body's natural immune response goes awry. Silent inflammation attacks the heart, arteries, and even the brain -- and you will not even know it. Obesity is the primary cause of silent inflammation and excess body fat is causing today's epidemic rise in countless health threats.Now Dr. Barry Sears shows you how to combat silent inflammation in this comprehensive guide. His research shows that following the Zone dietary plan, including supplements of ultrarefined fish oil concentrates, is the best way to ensure the future of your health. You can reduce your risk of each disease and condition, or reverse silent inflammation if you have it already -- in only thirty days. The Anti-Inflammation Zone includes a week of Zone meals, exercises that you can do at home, and tools and tests for determining your level of silent inflammation. Follow this plan and enjoy these benefits: Better health Greater longevity Reduced symptoms of chronic diseases Improved emotional control Greater mental acuity Improved physical performance",
        "Category": " Health & Fitness , Diseases , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Sams Teach Yourself HTML and CSS in 24 Hours",
        "Authors": "By Morrison, Michael and Meloni, Julie",
        "Description": "In just 24 lessons of one hour or less, you can learn how to use HTML and CSS to design, create, and maintain world-class web sites. Using a clear, down-to-earth approach, each lesson builds upon the previous one, allowing even complete beginners to learn the essentials from the ground up.     Full-color figures and clear step-by-step instructions help you learn quickly.     Practical, hands-on examples show you how to apply what you learn.     Quizzes and Exercises help you test your knowledge and stretch your skills.     Learn how to…    Build your own web page and get it online in an instant    Format text for maximum clarity and readability    Create links to other pages and to other sites    Add graphics, color, and visual pizazz to your web pages    Work with transparent images and background graphics    Design your site’s layout and typography using CSS    Get user input with web-based forms    Publicize your site and make it search-engine friendly    Test a web site for compatibility with different browsers    Make your site easy to maintain and update as it grows     Free Access to Online Learning Lab  Register your book at informit.com/register for free, exclusive access to the Online Learning Lab to supplement this book’s lessons:    Video walkthroughs to show you how to complete the step-by-step examples in the book    Fast and fun online quizzes to test your understanding of each lesson    Updates or corrections as they become available",
        "Category": " Computers , Programming Languages , HTML",
        "Publisher": "Sams",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Comparative Politics: Domestic Responses to Global Challenges",
        "Authors": "By Hauss, Charles",
        "Description": "Balancing theory with application and featuring an exciting full-color design and an engaging, student-friendly writing style, COMPARATIVE POLITICS uses a unique theme--Domestic Responses to Global Challenges--to introduce key concepts and examine the growing interdependence of strong and weak states. Each chapter focuses on one of 11 countries or on the European Union, and four additional countries are available as online chapters or in a custom print solution (Brazil, Canada, Japan, and South Africa). The introduction establishes a comparative structure based on five themes: conflict, democratization, economic liberalization, globalization, and challenges, which are then explored for each country through boxed features that are color-coded for easy cross-reference and comparison. The countries discussed are categorized by economic development, helping students hone their skills of comparison, synthesis, and interpretation by studying countries of similar economic status. With this uniquely effective text, students can gain an understanding of important political trends and concepts, an exposure to politics in a number of countries, and a desire to dig more deeply into the fascinating field of comparative politics.",
        "Category": " Political Science , Comparative Politics",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Introducing HTML 5 (Voices That Matter)",
        "Authors": "By Lawson, Bruce and Sharp, Remy",
        "Description": "Suddenly, everyone’s talking about HTML5, and ready or not, you need to get acquainted with this powerful new development in web and application design. Some of its new features are already being implemented by existing browsers, and much more is around the corner.Written by developers who have been using the new language for the past year in their work, this book shows you how to start adapting the language now to realize its benefits on today’s browsers. Rather than being just an academic investigation, it concentrates on the practical—the problems HTML5 can solve for you right away. By following the book’s hands-on HTML5 code examples you’ll learn:new semantics and structures to help your site become richer and more accessiblehow to apply the most important JavaScript APIs that are already implementedthe uses of native multimedia for video and audio techniques for drawing lines, fills, gradients, images and text with canvas how to build more intelligent web forms implementation of new storage options and web databases how geolocation works with HTML5 in both web and mobile applications All the code from this book (and more) is available at www.introducinghtml5.com.********There appear to be intermittent problems with the first printing of Introducing HTML5. If you have one of these copies, please email us atask@peachpit.com with a copy of your receipt (from any reseller), and we'll either provide access to the eBook or send you another copy of the print book -- whichever you prefer. If you’d like the eBook we can add that to your Peachpit.com account. You can set up a free account at www.peachpit.com/join < http://www.peachpit.com/join >. Thanks so much for your understanding!",
        "Category": " Computers , Programming Languages , HTML",
        "Publisher": "New Riders Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Call of Duty: Modern Warfare 2 Signature Series Strategy Guide",
        "Authors": "By Marcus, Phillip and Sea Snipers",
        "Description": "Provides a guide to the video game that includes walkthroughs, character profiles, strategies, level maps, treasure checklists, fighting tactics, and weapon data.",
        "Category": " Games , Video & Electronic",
        "Publisher": "Brady Games",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Clean Food: A Seasonal Guide to Eating Close to the Source with More Than 200 Recipes for a Healthy and Sustainable You",
        "Authors": "By Walters, Terry",
        "Description": "More than a cookbook, Clean Food is a feast for the senses that will nourish mind, body, soul…and the planet, too. With more than 200 fresh, seasonal, and tempting vegan recipes, it will help everyone eat the way the want: close to the source.From the White House kitchen to fast food restaurants, everyone’s discussing “the sustainable diet.” But what exactly does that mean? Terry Walters explains it all, and shows us how to eat seasonal, unprocessed, and locally-grown foods that are good for us and the environment.Walters’s emphasizes tastes as much as ingredients in delicious recipes that include whole grains, vegetables, legumes, sea vegetables, nuts, and seeds, and range from Crispy Chickpea Fritters to Spicy Thai Tempeh with Cashews to a vegan and sugar-free Chocolate Lover’s Tart that’s absolutely luscious! Since they’re arranged from spring to winter (with a chapter for “anytime at all”), it’s easy to find the right meals for every season of the year.Terry’s dynamic personality shines through on every page, particularly in her extensive introduction to the world of whole foods (which includes a glossary of ingredients). This is certain to be the cookbook of this and every season—the one that will help us make positive, sustainable, and yet delicious changes to the way we eat every day.",
        "Category": " Cooking , Specific Ingredients , Natural Foods",
        "Publisher": "Sterling Epicure",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Swan Thieves",
        "Authors": "By Kostova, Elizabeth",
        "Description": "Andrew Marlow, a psychiatrist,  has a perfectly ordered life--solitary, perhaps, but full of devotion to his profession and the painting hobby he loves. This order is destroyed when the renowned painter Robert Oliver attacks a canvas in the National Gallery of Art and becomes Marlow's patient.   When Oliver refuses to talk or cooperate, Marlow finds himself going beyond his own legal and ethical boundaries to understand the secret that torments this silent genius, a journey that will lead him into the lives of the women closest to Robert Oliver and toward a tragedy at the heart of French Impressionism.Moving from American museums to the coast of Normandy, from the late nineteenth century to the late twentieth, from young love to last love, THE SWAN THIEVES is a story of obsession, the losses of history, and the power of art to preserve human hope.",
        "Category": " Fiction , Psychological",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "The New Men",
        "Authors": "By Murphy, Brian",
        "Description": "Hailed by reviewers, an unprecedented look at the training for the Catholic priesthood chronicles a year at the Vatican's North American College, where six beginning seminarians wrestle with their dreams and doubts about their new lives. Reprint.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Guatemala: A Cry from the Heart",
        "Authors": "By Schwantes, V. David",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Health Initiatives Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Lying Wonders: A Sheriff Milt Kovak Mystery",
        "Authors": "By Cooper, Susan Rogers",
        "Description": "Milt Kovak, sheriff of Oklahoma’s Prophesy County, has been missing from the bookshelves for too long a time. Readers who have developed a friendship with this down-to-earth hero will be delighted to find the lawman back at the old stand and, as Kirkus Reviews has described him, “ever more simpatico.” Milt has married and has a toddler son. Then one day, Milt receives a terrified phone call from Laura Johnson, an old girlfriend who broke his heart. Laura’s teenage son, Trent, went on a religious retreat of some kind with his girlfriend Amanda and has not returned. Since the dubious “church” is in Milt’s county, Laura wants him to look into young Trent and Amanda’s whereabouts.What Milt finds is more than enough to alarm a mother. On the other side of a fence around the farmland deeded to the cult, Milt sees vultures circling over something in the grass. Hoping it’s a cow, Milt dares the barbed wire and a suspicious bull, to find instead the body of Amanda. Milt’s investigation is barred at every turn by “Brother Grigsby,” his wife, and their mostly female followers (an amazing number of whom are pregnant). Meanwhile, Laura is a shrieking hysteric, and Milt’s niece sneaks incognito into the compound to do some detecting of her own.Cooper’s stories always strike a fine balance of humor and solid suspense, and her characters are as real as the neighbors down the street, although their antics are more entertaining. Milt Kovak’s return is a real treat.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Lou Manfredini's House Smarts: Everything You Ever Wanted to Know About Buying, Maintaining, and Living Comfortably in Your Home",
        "Authors": "By Manfredini, Lou and Rist, Curtis",
        "Description": "Lou Manfredini, aka Mr. Fix-It, is the trusted friend every homeowner wishes he or she had—someone who knows houses. In his fun, friendly, fully illustrated guide for both inexperienced and seasoned homeowners, he takes you through your entire house and around the yard, showing you how it all works and what to do when it doesn’t. The result: You’ll have a clear understanding of the systems that make up your house and gain the expert knowledge to proceed with any job, big or small—whether you’re hiring a contractor or doing it yourself. Discover• How your house works: an anatomy lesson• The wonders of water—where it comes from and where it goes• Getting wired—the magic of electricity• Windows—ways to bring in the sunshine and keep out the drafts• The joys of being floored—good floor construction and maintenance• Wall power—it’s not what’s on them but what’s in them that counts• Decorating secrets the pros don’t like to sharePlus Lou Manfredini’s sixty-minute home inspection, an essential tool list, and an ABC glossary of terms: from air duct to weather stripping!",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "My Ten Book : My Number Books Series",
        "Authors": "By Moncure, Jane Belk, Hohag, Linda (ILT), and Spoden, Dan (ILT)",
        "Description": "Little ten plays with her ten robot dolls and manipulates other toys and items for the reader to see what numbers can be put together to make ten.",
        "Category": " Juvenile Nonfiction , Concepts , Counting & Numbers",
        "Publisher": "Child's World",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Ultimate Weapon",
        "Authors": "By Grant, Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Ambassador and the Spy",
        "Authors": "By Brome, Vincent",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Publishing Co., Inc.",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "New Perspectives on the Internet, Sixth Edition, Comprehensive (Available Titles Skills Assessment Manager (SAM) - Office 2007)",
        "Authors": "By Schneider, Gary P. and Evans, Jessica",
        "Description": "Part of our New Perspectives Series, this new edition offers a case-oriented, problem-solving approach for learning the basic to more advanced features of the Internet-from browsing, navigating, and searching on the Internet, to using e-mail, advanced communication tools and other Web topics.",
        "Category": " Computers , Internet , General",
        "Publisher": "Course Technology",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Little House on the Prairie",
        "Authors": "By Wilder, Laura Ingalls",
        "Description": "Laura Ingalls is heading west! The Ingalls family packs up their covered wagon and sets off for the big skies of the Kansas Territory, where wide open land stretches as far as the eye can see. Just when they begin to feel settled,they are caught in the middle of a dangerous conflict.",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Story of Rock 'N' Roll: The Year-By-Year Illustrated Chronicle",
        "Authors": "By Du Noyer, Paul (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Music Book Services",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "How Nature Works: 100 Ways Parents & Kids Can Share the Secrets of Nature",
        "Authors": "By Burnie, David",
        "Description": "Covering topics from cells to animal classifications and plant types, this book provides facts and step-by-step instructions for activities for learning about nature",
        "Category": " Nature , Reference",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Uncle Willie and the Soup Kitchen (Reading Rainbow Book)",
        "Authors": "By Disalvo-Ryan, Dyanne",
        "Description": "A gentle and age-appropiate introduction to two key issues of our time—hunger and homelessness—from a kid's point of view. This empathy-building book is good for sharing at home or in a classroom.“Based on the actual volunteer experience of the author, this picture book provides a look into the soup kitchen without an overly sentimental view of the hungry or a dose of pessimism for the reader. With a note about soup kitchens introducing the story, this is informative and new, but not scary,” praised Booklist.“A boy wonders about the people he sees on his city’s streets until he goes to the soup kitchen where his uncle works. The varied needs of the individuals there become clear to the young narrator. The watercolors use earthtones and careful detail to illustrate aptly the warm, friendly story,\" according to The Horn Book.Recommended as a resource for teachers and librarians to build a connection with their local community and the school, as well as a way for any adult to help foster a conversation and respond to a child's natural curiosity.",
        "Category": " Juvenile Fiction , Cooking & Food",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Basic Portrait Techniques",
        "Authors": "By Wolf, Rachel (EDT) and Rubin Wolf, Rachel (EDT)",
        "Description": "",
        "Category": " Art , Techniques , General",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The King's Equal",
        "Authors": "By Paterson, Katherine and Vagin, Vladimir Vasilevich (ILT)",
        "Description": "Who is she?A dying king makes his son his heir--on one condition. Vain Prince Raphael must marry a woman who is his equal in beauty, intelligence, and wealth...Where is this woman?A search throughout the kingdom proves fruitless. Then the lovely Rosamund appears at the palace, as if by  magic, and Raphael is certain he has found his wife. She is intelligent and wealthy, as well as beautiful--certainly his equal, he thinks.But what does the mysterious Rosamund think?\"Finding a princess who is the 'king's equal' in comeliness, intelligence, and wealth is an order that confounds the wisest, most loyal councilors in this distant realm.  Finding a book equal in quality to this one is an even more formidable task.  [Newbery medalist] Paterson weaves her story within the structure of familiar fairy tales. . . . Vagin's illustrations are exquisite.\" —SLJ.   1993 Teachers' Choices (IRA)1992 Irma Simonton Black Award (Bank Street College of Education)1993 Children's Booksellers' Choices (Association of Booksellers for Children)",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Schaum's Outline of Review of Elementary Mathematics",
        "Authors": "By Schmidt, Philip A. and Rich, Barnett",
        "Description": "Confusing Textbooks? Missed Lectures? Not Enough Time?Fortunately for you, there's Schaum's Outlines. More than 40 million students have trusted Schaum's to help them succeed in the classroom and on exams. Schaum's is the key to faster learning and higher grades in every subject. Each Outline presents all the essential course information in an easy-to-follow, topic-by-topic format. You also get hundreds of examples, solved problems, and practice exercises to test your skills. This Schaum's Outline gives youPractice problems with full explanations that reinforce knowledgeCoverage of the most up-to-date developments in your course fieldIn-depth review of practices and applicationsFully compatible with your classroom text, Schaum's highlights all the important facts you need to know. Use Schaum's to shorten your study time-and get your best test scores!Schaum's Outlines-Problem Solved.",
        "Category": " Mathematics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Photoshop 7 Down and Dirty Tricks",
        "Authors": "By Kelby, Scott",
        "Description": "Step-by-step instructions and color illustrations presented here teach Photoshop users to use metallic, 3D, and Web special effects, show how to turn snapshots into studio-quality work, and offer shortcuts and tips, creative ideas, layouts, and design techniques. Although each chapter is self-contained, some experience with Photoshop is assumed. Kelby, editor-in-chief of  Photoshop User  magazine, has written previous books on Photoshop. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Photography , Techniques , Equipment",
        "Publisher": "New Riders Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Sculpted by Ice: Glaciers and the Alaskan Landscape",
        "Authors": "By Collier, Michael",
        "Description": "",
        "Category": " Nature , General",
        "Publisher": "Alaska Natural History Association",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Frommer's New York City with Kids (Frommer's With Kids)",
        "Authors": "By Hughes, Holly",
        "Description": "Family vacations have never been so easy with Frommer's. It's like having a friend show you around, taking you to the places local parents and kids like best. Our expert authors have already gone everywhere you might go-they've done the legwork for you, and they're not afraid to tell it like it is, saving you time and money. No other series offers candid reviews of so many hotels and restaurants in all price ranges, and tells you which ones are kid-friendly. Every Frommer's with Kids Travel Guide is up-to-date, with exact prices for everything, dozens of color maps, and exciting coverage of sports, shopping, and outdoor activities. You'd be lost without us!This eighth edition of Frommer's New York City with Kids reveals the most fun and educational experiences for kids in the Big Apple. It's full of incredibly detailed tips - right down to which hotels offer cribs and rollaway beds and which restaurants offer high chairs. Inside you'll learn where to find hands-on, interactive museums; children's entertainment, from concerts to puppet shows; kid-oriented shopping; plus all the best parks and places to play . There are even suggested itineraries for each age group making trip planning a snap! Let Frommer's New York City with Kids show your family the exciting sights and sounds of New York City.",
        "Category": " Travel , Special Interest , Family",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Tinker Bell and the Lost Treasure (Disney Fairies)",
        "Authors": "By Morris, Kimberly (ADP)",
        "Description": "Return to Pixie Hollow for a brand-new movie adventure with Tinker Bell!Tinker Bell is thrilled when she is selected to make the prestigious Autumn Scepter to commemorate the rare Blue Moon. Her friend Terence tries to help, but he ends up getting in the way—and on Tink’s nerves. Then, to make matters worse, Tink accidentally breaks the scepter’s moonstone! So she must travel north of Never Land to find the one thing that can fix the moonstone—the magical Mirror of Incanta. It’s a rough journey, but Tink is helped along by a firefly named Blaze. Can Tink mend the scepter—and her friendship with Terence—before the Blue Moon rises? Find out in the Junior Novelization retelling ofTinker Bell and the Lost Treasure, featuring eight pages of full-color scenes from the direct-to-DVD movie!",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Othello (Barnes & Noble Shakespeare)",
        "Authors": "By Shakespeare, William and Vitkus, Daniel (EDT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LDIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LI&&ROthello&&L/I&&R, by &&LB&&RWilliam Shakespeare&&L/B&&R, is part of the &&LI&&RBarnes & Noble Shakespeare&&L/I&&R series.  This unique series features newly edited texts prepared by leading scholars from America and Great Britain, in collaboration with one of the world’s foremost Shakespeare authorities, &&LB&&RDavid Scott Kastan&&L/B&&R of Columbia University. Together they have produced texts as faithful as possible to those that Shakespeare wrote.&&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&REach volume in the &&LI&&RBarnes & Noble Shakespeare&&L/I&&R includes:&&L/P&&R&&LB&&RNew Scholarship&&L/B&&R – Premiere scholars introduce each play with contemporary scholarship. An essay on editing the text provides an in-depth look at the quartos and folios used in the edition. &&LB&&RContextualizing Essays&&L/B&&R – Essays on Shakespeare’s England, language, and life, along with essays on performing Shakespeare and significant performances frame the play in both historical and theatrical context for readers. A look at the lasting influence of the play on music, art, film, and dance creates an interdisciplinary framework with which to approach the play. &&LB&&RBetter Notes&&L/B&&R – Through one-word margin definitions, facing-page glosses, and longer end notes after the play, our innovative approach to notes pulls readers away from the text fewer times while providing them with more information and comprehensive analysis. &&LB&&RFurther Reading&&L/B&&R – An annotated bibliography of titles, hand-selected by the introduction author, takes readers beyond the edition for further reading.&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&ROne of Shakespeare’s greatest tragedies, &&LI&&ROthello&&L/I&&R’s portrayal of jealousy and deception remains as shocking today as when it was first written. The editor, &&LSTRONG&&RDaniel Vitkus&&L/B&&R, provides an illuminating context for the play, meticulously reconstructing how Shakespeare’s audience might have perceived a tragedy with a black protagonist.&&L/DIV&&R&&L/DIV&&R",
        "Category": " Literary Collections , General",
        "Publisher": "Barnes & Noble Shakespeare",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    }
]