[
    {
        "Title": "Basic Spanish Coursebook: Revised and Updated (Living Language Complete Basic Courses)",
        "Authors": "By Suffredini, Ana (EDT)",
        "Description": "",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Living Language",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Questions & Answers: Ancient History: Learn About the Past by Arcturus (2012-04-15)",
        "Authors": "By Arcturus",
        "Description": "",
        "Category": " Juvenile Nonfiction , History , General",
        "Publisher": "Arcturus Publishing Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2012"
        }
    },
    {
        "Title": "Scooby - Doo! Howling on the Playground (Read & Solve, 9)",
        "Authors": "By Gail Herman",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Balck Beauty",
        "Authors": "By Anna Sewell",
        "Description": "",
        "Category": "",
        "Publisher": "Dalmatian Press LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Art of Selling Intangibles",
        "Authors": "By Gross, LeRoy",
        "Description": "Offers advice on selling securities and financial services, discusses cold calls, new prospects, seminars, and closing techniques, and looks at broker-client relations",
        "Category": " Business & Economics , Investments & Securities",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Negaholics no more! (Leadership series)",
        "Authors": "By Carter-Scott, Cherie",
        "Description": "",
        "Category": "",
        "Publisher": "National Press Pubs.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "PostScript(R) Language Reference Manual (2nd Edition)",
        "Authors": "By Adobe Systems",
        "Description": "Produced by Adobe Systems Incorporated, this is the official reference to PostScript, a powerful and flexible language that efficiently describes the appearance of text, sampled images, and graphics on a printed page or display. This edition covers the entire language, including the recent advancements of PostScript Level 2. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Explore and Discover: Sharks: Sharks (Question Time)",
        "Authors": "By Savage, Stephen",
        "Description": "Which shark has the most varied diet? How can a shark drown? Which shark has a hammer? and Why does the thresher shark have a long tails, are some of the questions answered in Explore and Discover: Sharks (Question Time) by Stephen P. Savage, an intriguing look at the lives of these mysterious predators.",
        "Category": " Juvenile Nonfiction , Science & Nature , Environmental Conservation & Protection",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Hugville",
        "Authors": "By Lichtenheld, Tom (ILT), Crandall, Court, and Murray, Joe (ILT)",
        "Description": "Hugville is a town full of unusual hugs. If you come to visit, learn how to squeeze a friend with the Octopus Hug, twist him with the Tornado Hug, and tickle him with the Monkey Hug! The friendly Mayor will guide you on a tour of Hugville, and he’ll even give you a turn at the Hug Jug!",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Gay and Lesbian Atlas (Urban Institute Press)",
        "Authors": "By Gates, Gary J., Ost, Jason, and Birch, Elizabeth (FRW)",
        "Description": "While the words \"we are everywhere\" can be frequently heard at gay and lesbian political events, The Gay and Lesbian Atlas provides the first empirical confirmation of this rallying cry. Drawing on the most recent data from the U.S. Census, this groundbreaking work offers a detailed geographic and demographic portrait of gay and lesbian families in all 50 states plus the top 25 U.S. metropolitan areas. These results, presented in more than 250 full-color maps and charts, will both confirm and challenge anecdotal information about the spatial distribution and demographic characteristics of this community. It is probably no surprise that San Francisco, Key West, and western Massachusetts all host large gay and lesbian populations, but it might surprise some that Houston, Texas, contains one of the ten \"gayest\" neighborhoods in the country, or that Alaska and New Mexico have high concentrations of gay and lesbian couples in their senior populations. The Atlas is a unique and important resource for the political and public policy communities, public health officials, social scientists, and anyone interested in gay and lesbian issues",
        "Category": " Social Science , LGBT Studies , Lesbian Studies",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Death of a Pooh-Bah (Music Lover's Mysteries)",
        "Authors": "By Sturges, Karen",
        "Description": "Phoebe Mullins's love of music took her around the world with her conductor husband, and more recently helped her solve a murder in an opera colony. Now her musical passion may prove instrumental in solving the case of another slain singer...if it doesn't prove to be her swan song. Death of a Pooh-BahA long-lost aunt's invitation brings Phoebe to Northampton, Massachusetts, and a post as stage manager of a lively community production of Gilbert and Sullivan's The Mikado. But beneath the operetta's sweet harmonies and rollicking whimsy, she observes more than one sour note. Many in the cast have a grudge against Dr. E. Foster Ballard, whose pompous self-absorption makes him perfect for his role as Lord Pooh-Bah. But who hates him enough to stab him in the back with his own prized Japanese dagger? Could it be the feminist militants who've been protesting The Mikado's misogynist lyrics? His catty ex? Or one of the Three Little Maids who've had enough of his wandering hands? And what dark history did Phoebe's own aunt have with Ballard? Soon another corpse suggests E. Foster's killer has got a little list...and Phoebe's inquiries may just have put her at the top of it.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Year's Best Science Fiction 22nd",
        "Authors": "By Dozois, Gardner R.",
        "Description": "Widely regarded as the one essential book for every science fiction fan, The Year's Best Science Fiction (Winner of the 2004 Locus Award for Best Anthology) continues to uphold its standard of excellence with more than two dozen stories representing the previous year's best SF writing.The stories in this collection imaginatively take readers far across the universe, into the very core of their beings, to the realm of the Gods, and to the moment just after now. Included are the works of masters of the form and the bright new talents of tomorrow. This book is a valuable resource in addition to serving as the single best place in the universe to find stories that stir the imagination and the heart.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "SMP Paperback",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Tetra Encyclopedia of the Marine Aquarium",
        "Authors": "By Mills, Dick",
        "Description": "",
        "Category": " Pets , Reference",
        "Publisher": "Tetra Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Viet-Nam Reader: Articles and Documents on American Foreign Policy and the Viet-Nam Crisis",
        "Authors": "By Raskin, Marcus G. and Bernard B. Fall, editor",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Valley of Steel",
        "Authors": "By King, Ivan",
        "Description": "Fate can be unkind. Would you dare to look back and risk her wrath? When you’re a child of the favela, in the Valley of Steel, you know that Fate comes like a whirlwind, lifting some to great heights and slapping others down with no reason. Ivan, rescued first from an orphanage in the slums of Rio de Janeiro and then from the bleak streets of Ipatinga in Brazil’s Valley of Steel, has been favored by Fate. When a call from Brazil interrupts his privileged life in America, he learns his best friend has committed suicide in the rugged Valley of Steel and only he knows the real reasons why. This is the story of one man’s journey home after a self-inflicted exile. The story of a boy who saw more than any child should, and the man he grew into—and how that man came back to the Valley of Steel to avenge his childhood and stare down the demons of his past. It is a story of survival, redemption, and joy. Of childhood memories that burn in the soul—and what happens when one man has courage enough to fan the flames and face the fire.",
        "Category": " Fiction , Coming of Age",
        "Publisher": "CreateSpace Independent Publishing Platform",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "The curious world of twins",
        "Authors": "By Gaddis, Vincent H.",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Paperback Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Webster's Vest Pocket Dictionary",
        "Authors": "By Kidney, Walter",
        "Description": "",
        "Category": "",
        "Publisher": "T. Nelson Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Teams & Technology",
        "Authors": "By Cohen, Susan G., Bikson, Tora K., and Mankin, Donald",
        "Description": "Presents a framework for the integrated design and implementation of team, technological, and organizational change, showing managers how to develop new information systems that support collaborative work, how to build teams that take advantage of technological potential, and how to create an organizational structure to support the synergy of teams and technology. Offers specific recommendations and illustrative vignettes for identifying leaders and managing creative tension. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Data Processing",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Low-Fat Supermarket Shopper's Guide: Making Healthy Choices from Thousands of Brand-Name Items",
        "Authors": "By Katahn, Martin and Pope-Cordle, Jami",
        "Description": "A guide to shopping for low-fat products analyzes thousands of brand-name foods for U.S. dietary requirements, total fat, saturated fat, cholesterol, sodium, fiber, and calories and offers tips on food preparation. Original.",
        "Category": " Health & Fitness , Diet & Nutrition , Food Content Guides",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Schönes Deutschland. Text in deutsch, englisch und französisch",
        "Authors": "By Nils. Koshofer",
        "Description": "",
        "Category": "",
        "Publisher": "Basserman",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "UNIX System Administration Handbook (3rd Edition)",
        "Authors": "By Nemeth, Evi, Snyder, Garth, Seebass, Scott, and Hein, Trent R.",
        "Description": "Now covers Red Hat Linux!   Written by Evi Nemeth, Garth Snyder, Scott Seebass, and Trent R. Hein with Adam Boggs, Rob Braun, Ned McClain, Dan Crawl, Lynda McGinley, and Todd Miller   \"This is not a nice, neat book for a nice, clean world. It's a nasty book for a nasty world. This is a book for the rest of us.\" –Eric Allman and Marshall Kirk McKusick   \"I am pleased to welcome Linux to the UNIX System Administration Handbook!\" –Linus Torvalds, Transmeta   \"This book is most welcome!\" –Dennis Ritchie, AT&T Bell Laboratories   This new edition of the world's most comprehensive guide to UNIX system administration is an ideal tutorial for those new to administration and an invaluable reference for experienced professionals. The third edition has been expanded to include \"direct from the frontlines\" coverage of Red Hat Linux. UNIX System Administration Handbook describes every aspect of system administration–from basic topics to UNIX esoterica–and provides explicit coverage of four popular UNIX systems:   This book stresses a practical approach to system administration. It's packed with war stories and pragmatic advice, not just theory and watered-down restatements of the manuals. Difficult subjects such as sendmail, kernel building, and DNS configuration are tackled head-on. Examples are provided for all four versions of UNIX and are drawn from real-life systems–warts and all.   \"This book is where I turn first when I have system administration questions. It is truly a wonderful resource and always within reach of my terminal.\" –W. Richard Stevens, author of numerous books on UNIX and TCP/IP   \"This is a comprehensive guide to the care and feeding of UNIX systems. The authors present the facts along with seasoned advice and numerous real-world examples. Their perspective on the variations among systems is valuable for anyone who runs a heterogeneous computing facility.\" –Pat Parseghian, Transmeta   \"We noticed your book on the staff recommendations shelf at our local bookstore: 'Very clear, a masterful interpretation of the subject.' We were most impressed, until we noticed that the same staff member had also recommended Aunt Bea's Mayberry Cookbook.\" –Shannon Bloomstran, history teacher",
        "Category": " Computers , Operating Systems , UNIX",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Solar Assassins (Perry Rhodan #49)",
        "Authors": "By Kurt Mahr",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "July",
            "Year": "1974"
        }
    },
    {
        "Title": "Secret Longings of the Heart: Overcoming Deep Disappointment and Unfulfilled Expectations (Navigators Reference Library)",
        "Authors": "By Kent, Carol",
        "Description": "While the Lord knows your deepest longings and passions, you are not always aware of them yourself. Daringly honest, powerfully encouraging, and thoroughly biblical, Secret Longings of the Heart helps women explore their desire for victory over 10 areas of life. This Bible study examines which attitudes, lifestyles, and behaviors can lead to fulfillment in Christ. Includes discussion questions.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Navpress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2017"
        }
    },
    {
        "Title": "The Dead Detective",
        "Authors": "By Robert L. Wise - A Sam & Vera Sloan Mysteryl",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Da Vinci Cook: An Angie Amalfi Mystery (Angie Amalfi Mysteries)",
        "Authors": "By Pence, Joanne",
        "Description": "Angie Amalfi is close to one of the biggest breaks of her rocky culinary career—a chance to co–write a cookbook with a famous chef. But as she scrambles to prepare for the impending interview, her realtor sister Cat is suddenly accused of a murder in a rich client's home. A priceless relic—an iron chain that was used to bind St. Peter while in a Roman prison—is missing from her wealthy client Marcello Piccoletti's home, and a murder was committed on the heels of the disappearance. The only person who can clear Cat's name is the client himself, and he's in Rome, tending to his restaurant, Da Vinci's. Heedless to Angie's stern warning, the always unpredictable Cat insists on traveling to Rome to confront Picoletti, and Angie must drop everything to accompany her sister. The Roman restaurateur has the chain with him in Rome, and exonerates Cat of the murder as well. Unfortunately, the police in the states still suspect Cat and now Picoletti, the only witness, has disappeared. Angie takes a job as a cook at Da Vinci's, hoping to get to the bottom of this complex mess. And when bodies start piling up like balls of fresh mozzarella at an Amalfi family picnic, it looks like Angie and Cat's trip to their homeland may spell arrivederci Amalfis.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Untitled: A Booklover's Mystery",
        "Authors": "By Kaewert, Julie",
        "Description": "The perfume of old books and the smell of danger...Publisher Alex Plumtree is in for the most astounding week of his life. First he comes into possession of a rare, centuries-old book, rumored destroyed on orders of King Edward IV. Then he receives an undreamed-of honor: an invitation to join a select society of book collectors...who are also some of the most powerful men and women in England.But Alex's triumph quickly turns sour. The book vanishes from Alex's office. His initiation weekend with the Dibdin Club is rife with bizarre behavior, appalling accidents--and a death that sends Alex reeling. He quickly begins to suspect that his valuable find is even more than it seemed on first glance. For hidden in its pages is a shocking secret that could change the history of books forever...as well as the face of the modern world. And there are people--and foreign powers--who would do anything to keep this secret from coming to light.All Alex has to do is figure out what that secret is. If he can stay alive long enough.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Crimeline",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Mountaineering Handbook",
        "Authors": "By Casewit, Curtis W. and Pownall, Dick",
        "Description": "",
        "Category": "",
        "Publisher": "JB Lippincott Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Born Wild in Shenandoah",
        "Authors": "By Simpson, Rob and Simpson, Ann",
        "Description": "Full-color photographs introduce baby animals as seen in their natural habitat in Virginia's Shenandoah National Park.",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "Farcountry Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "TimeTravelers Passport Guide to Virginia Museums & Historic Sites",
        "Authors": "By Margot Carlock",
        "Description": "",
        "Category": "",
        "Publisher": "The Virginia Association of Museums",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Tale of Squirrel Nutkin (Reader's Digest Young Families - Famous Fables)",
        "Authors": "By Sarah Albee",
        "Description": "",
        "Category": "",
        "Publisher": "9390175",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Faith That Breathes: Real Stories, Real Faith",
        "Authors": "By Ross, Michael",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Self-Meditation: 3,299 Tips, Quotes, Reminders, and Wake-Up Calls for Peace and Serenity",
        "Authors": "By Kipfer, Barbara Ann",
        "Description": "Don’t self-medicate—self-meditate. In a book of thousands of entries, written in the abundant, winningly positive way that’s helped her books sell over 1.5 million copies, Barbara Ann Kipfer shows just how we can—and should—meditate anytime, anywhere, and reap the ever-growing list of mental and physical benefits associated with this practice. Created by the author who brought us 14,000 Things to Be Happy About, Instant Karma, 8,789 Words of Wisdom, and The Wish List, Self-Meditation is a compulsively readable, instantly accessible list of hundreds of meditation suggestions that can be done during the course of our daily lives. You don’t need to go to a mountain retreat, renounce meat, or struggle in any way.  Here is where you’ll find a meditation to have with a cup of tea. A waiting-in-line meditation. Meditations while reading, eating, doing sit-ups, working, shopping, or finding yourself stuck in traffic. There are breaths to take and praises to give, and throughout, ways to slow down and finally smell the roses—or hear the crickets—or see the stars. Drawn from spiritual practices as varied as Zen, yoga, and insight meditation, it’s a delicious spiritual tonic that includes meditation basics, explanations, mantras, tips, and more. A completely portable guide, updated to provide inspiration for all the ways we meditate today.  Now, at any moment of the day or night, we can all catch our inner breath.",
        "Category": " Body, Mind & Spirit , Mindfulness & Meditation",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Hacker Proof : The Ultimate Guide to Network Security",
        "Authors": "By Klander, Lars",
        "Description": "A comprehensive guide to network security.  The author evaluates the risks and examines defenses including firewalls, encryption, digital signatures, the secure socket layer, Kerberos Key Exchange, and virus protection.  He also looks at security threats that are specific to different operating systems including UNIX, X-Windows, Windows NT, and Novell NetWare.  The CD-ROM contains an evaluation copy of the Ballista software and a trial version of LanOptics Guardian 2.2. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Security , General",
        "Publisher": "Jamsa Press",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Puppies",
        "Authors": "By Gorman, M. A.",
        "Description": "Preparing for the new addition ?  The Complete Idiot?s Guide to Puppies covers everything new pet owners need to know to care for and bond with a new puppy, which will prevent future problems and ensure a great relationship with the new pet. Readers will discover how to find the right puppy, the basic dog breeds, positive dog training, and in-depth healthcare specifically geared to the needs of puppies.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Because of You: Celebrating the Difference You Make (The Gift of Inspiration Series)",
        "Authors": "By Zadra, Dan (COM) and Lambert, Katie (COM)",
        "Description": "",
        "Category": "",
        "Publisher": "Compendium Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "How to Plan a Successful Trip",
        "Authors": "By Hoffman, Ellen",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Farragut Pub Co",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Apprentices in Love",
        "Authors": "By Gibbard, Mark",
        "Description": "",
        "Category": "",
        "Publisher": "Morehouse-Barlow Co",
        "Price Starting With ($)": "8.27",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "1001 Things It Means to Be a Mom: The Good, the Bad, and the Smelly",
        "Authors": "By Harrison, Harry H., Jr.",
        "Description": "So what, exactly, does it mean to be a mom?No matter what phase of motherhood a woman finds herself in, she has one thing in common with all other moms: the need to feel appreciated and encouraged. Harry H. Harrison Jr.'s latest dose of trademark wit and wisdom pays tribute to the many aspects required to be a mom. Ranging from new moms, working moms, single moms, moms of adult kids and more, 1001 Things it Means to be a Mom provides a big dose of praise and understanding that will leave moms from all walks of life feeling uplifted and highly valued. With two million books in the market, no one knows how to deliver such simple, powerful insights like Harry.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Bad Blood (A Virgil Flowers Novel)",
        "Authors": "By Sandford, John",
        "Description": "The fourth thrilling novel in #1 New York Times bestselling author John Sandford's Virgil Flowers series.Two bodies in two days. One is murder. The other is suicide. Virgil Flowers never imagined that discovering the connection would lead him into the perverse history of the Minnesota farm community, and almost unimaginable darkness.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "A Christmas Carol: In Prose Being a Ghost Story of Christmas",
        "Authors": "By Dickens, Charles, Wolfgang Lederer",
        "Description": "",
        "Category": "",
        "Publisher": "Harold Berliner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "1225 Christmas Tree Lane (Cedar Cove, 12)",
        "Authors": "By Macomber, Debbie",
        "Description": "The people of Cedar Cove know how to celebrate Christmas. Like Grace and Olivia and everyone else, Beth Morehouse expects this Christmas to be one of her best. Her small Christmas-tree farm is prospering, her daughters and her dogs are happy and well, and her new relationship with local vet Ted Reynolds is showing plenty of romantic promise.But&#133;someone recently left a basket filled with puppies on her doorstep, puppies she&#39;s determined to place in good homes. That&#39;s complication number one. And number two is that her daughters Bailey and Sophie have invited their dad, Beth&#39;s ex-husband, Kent, to Cedar Cove for Christmas. The girls have visions of a mom-and-dad reunion dancing in their heads.As always in life&#151;and in Cedar Cove&#151;there are surprises, too. More than one family&#39;s going to have a puppy under the tree. More than one scheme will go awry. And more than one romance will have a happy ending!",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "Circle of Grace",
        "Authors": "By Penelope J. Stokes",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Great Plan (Speed Racer, No. 1)",
        "Authors": "By Wheeler, Chase",
        "Description": "Speed Racer enters the high-octane Sword Mountain Race, but not everyone is in it to win. Some of the competitors are more interested in stealing the new plans for Speed’s car, the Mach 5, than crossing the finish line. Can Speed save the top-secret plans and still win the race?",
        "Category": " Juvenile Fiction , Sports & Recreation , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "1100 Questions and Answers About the Natural World",
        "Authors": "By Anita., Hawksley, Lucinda, Green, Jen, and Pe",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing, Bath, UK",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Flowers of the Canyon Country",
        "Authors": "By Welsh, Stanley L",
        "Description": "",
        "Category": " Nature , General",
        "Publisher": "Canyonlands Natl Hist Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Hometown Girl: The Chesapeake Diaries",
        "Authors": "By Stewart, Mariah",
        "Description": "New York Times bestselling author Mariah Stewart presents a captivating contemporary romance novel in the tradition of Robyn Carr, Susan Mallery, and Barbara Freethy.Life was always just about perfect for Brooke Madison Bowers. She was the prettiest, most popular girl in small-town St. Dennis, Maryland, a prom queen, local pageant star, and the pride and joy of her loving parents. She even married the man of her dreams. But the promise of happily ever after fell to pieces when her husband was killed while serving in Iraq. Brokenhearted and longing for the solace of better days, she returns to the idyllic world of St. Dennis, and the familiar comfort of the family farm. Surrounded by her loving family and friends, she’s determined to build a new life, complete with her own cupcake bakery. She’s equally determined never to fall in love again.For Jesse Enright, life has been a challenge. A fourth-generation attorney, he’s spent his life fighting to escape the shadow of his irresponsible father. Now he’s moved to St. Dennis to run the family law practice, and he’s ready to find the right girl, get married, and settle down. But his carefully laid plans go out the window when he meets Brooke and finds himself caught between the unbreakable law of attraction and Brooke’s resolve to go her way alone—despite the undeniable feelings Jesse stirs in her. But just like catching lightning in a bottle, is it possible to fall head-over-heels, heart-and-soul in love all over again?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "Strategic Moves: A Stone Barrington Novel",
        "Authors": "By Woods, Stuart",
        "Description": "In this New York Times bestseller from Stuart Woods, Stone Barrington gets a big payday and gets set up for an even bigger fall...Stone Barrington is enjoying his usual dinner at Elaine’s when his boss at Woodman & Weld, the law firm where Stone is “of counsel,” walks in, sits down and hands Stone a check for one million dollars. It seems Stone’s undercover dealings with MI6 had brought in a big new client for the firm, and they’re willing to pay Stone a huge bonus and make him a partner. But almost as soon as he’s taken the deal, Stone gets wind of an impending scandal that might torpedo his big promotion: it seems the lucrative new client he’s introduced to the firm might be a devil in disguise...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "How I Made My First Million on the Internet and How You Can Too!: The Complete Insider's Guide to Making Millions with Your Internet Business",
        "Authors": "By Chia, Ewen",
        "Description": "In this comprehensive step-by-step guide to setting up a booming Internet business and raking in million-dollar profits, Ewen Chia demystifies marketing jargon and shares the tips and techniques that continue to net his online businesses a cool fortune. Whether you're seeking to create and develop a thriving Internet business from scratch or looking to realize the full potential of your existing business, whether you haven't a clue what the Internet is about, or you're armed with a business degree, Ewen's upbeat and accessibly written Million-Dollar Blueprint will help you: --Find out who's buying what and develop lucrative solutions to meet market needs --Grab and keep the attention of prospective buyers with irresistible offers --Create a follow-up system of additional offers to boost income and grow your business --Automate your business so you can enjoy the ultimate rewards of profits, time, and leisure --Duplicate your business(es) to multiply your total income",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Morgan James Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Baby's First Book of Prayers",
        "Authors": "By Carlson, Melody and Pfeiffer, Judith (ILT)",
        "Description": "A charming first book of 41 prayers with adorable artwork, and a gift all parents will cherish each time they cuddle up and read with their new baby or toddler. If you’re a parent or grandparent looking for a wonderful gift for a new baby or toddler, look no further than Baby's First Book of Prayers. With charming artwork on the left page and an accompanying prayer on the right, this is the perfect book to introduce even the youngest children to God’s Word as you point and show them details in each sweet picture.This cherished gift for new parents encourages boys and girls to be thankful for the little everyday things. Moms, dads, grandmas, and grandpas alike love this padded edition of My First Book of Prayers as much as babes and toddlers do! You can’t make time stand still, but you can cherish every moment with your new baby and toddler. My First Book of Prayers will help you do just that.Baby's First Book of Prayers:Contains 41 short, sweet prayers, with adorable artwork accompanying each prayerWas made to fit snugly in the hands of babies and toddlersIs padded to hold up to repeated readings and rough handling at home, daycare, or Sunday schoolIs a perfect gift for many occasions, including the birth of a new baby, christenings, baptisms, first birthdays, Easter baskets, Christmas stockings, and baby showersIs offered at an affordable price point",
        "Category": " Juvenile Nonfiction , Religious , Christian , Devotional & Prayer",
        "Publisher": "Zonderkidz",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "APPLE KITCHEN COOK BOOK Revised and Expanded Edition",
        "Authors": "By taylor, demetria",
        "Description": "",
        "Category": "",
        "Publisher": "Popular Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Christmas Cooking From the Heart, Vol. 7 (Better Homes and Gardens)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "NRDC Simple Steps Toward a Healthier Earth",
        "Authors": "By Smith, Molly and Carpenter, Tad (ILT)",
        "Description": "It's easyand funto be green! Printed on 100% recycled materials and developed in partnership with the Natural Resources Defense Council, this one-of-a-kind activity book encourages kids to reduce waste and make their homes, schools, and neighborhoods more environmentally friendly. It's packed with plenty of in-book and out-of-book activities and 2 pages of stickers. Kids will have a blast while they develop an understanding of local and worldwide environmental challenges.",
        "Category": " Juvenile Nonfiction , Activity Books",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Death sails the bay",
        "Authors": "By Feegel, John",
        "Description": "",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Capital & Lowercase Letters, Grades PK - 1 (Home Workbooks)",
        "Authors": "By Carson-Dellosa",
        "Description": "Build essential skills while having fun with Home Workbooks! Each book measures 7\" x 9.25\" and is filled with 64 pages of age-appropriate activities, puzzles, and games. These teacher-approved books are perfect for extra practice at home or at school. They can even be used to build upon basic skills during school breaks or family vacations! 140 full-color stickers and an incentive chart to help parents or teachers track student progress are also included. Home Workbooks are available for prekindergarten through grade 3 students, and feature titles in a wide variety of skill areas to suit any need.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Carson Dellosa Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Shadow Fires (Shielder Series, Book 5)",
        "Authors": "By Spangler, Catherine",
        "Description": "Shunned by her people because of her ability to see into the future, Jenna dan Aron leads a solitary life, until she becomes the bride of Arion of Saura, the leader of the barbaric Leors, a man ruled by hard logic and physical prowess who has no wish to marry outside his race. Original.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Pinewood Derby Speed Secrets: Design and Build the Ultimate Car",
        "Authors": "By Meade, David and Thorne, Troy (ILT)",
        "Description": "For first-time competitors or seasoned racers, this step by step guide reveals all the secrets to building a championship car.",
        "Category": " Crafts & Hobbies , Wood Toys",
        "Publisher": "DK Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Loose Tooth (My First I Can Read)",
        "Authors": "By Schaefer, Lola M. and Wickstrom, Sylvie (ILT)",
        "Description": "A funny and reassuring My First I Can Read Book about a child's first loose tooth.A young boy wakes up one morening to find that he has his very first loose tooth. But no matter how much he pushes, pulls, and wiggles it, it just won't come out. This is the perfect book for young readers who are excited about losing their teeth, too. Energetic and engaging, this simple story is just right for the youngest beginning readers.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Just Like Dora! (Dora the Explorer Ready-to-Read, Pre-Level 1)",
        "Authors": "By Aikins, Dave (ILT) and Inches, Alison",
        "Description": "Dora has a surprise for her friends.  What could it be? Follow Dora and find out!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Mittens (My First I Can Read)",
        "Authors": "By Schaefer, Lola M. and Hartung, Susan Kathleen (ILT)",
        "Description": "Mittens is a small kitten in a big, new house. Everything seems loud and unfamiliar and scary. The little kitten wants a special place all his own. Can a new friend help him find one?The satisfying story of an adorable kitten's search for security and his discovery of a new friend is perfect for children who, like Mittens, are ready to take their first steps on a new journey: reading.Mittens is a My First I Can Read book, which means it’s perfect for shared reading with a child. \"The beautiful physical immediacy of the new pet story will draw emergent readers,\" commented Booklist.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Tell Me the Promises: A Family Covenant for Eternity",
        "Authors": "By Tada, Joni Eareckson, Dicianni, Ron (ILT), and Jensen, Steve",
        "Description": "A collection of seven stories written to illustrate commitments between parent and child",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Crossroad Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Sunset (Warriors: The New Prophecy, Book 6)",
        "Authors": "By Hunter, Erin",
        "Description": "Erin Hunter’s #1 nationally bestselling Warriors series continues with the sixth book in the New Prophecy series!The sixth book in this second series, Warriors: The New Prophecy #6: Sunset, brings more adventure, intrigue, and thrilling battles to the epic world of the warrior Clans.As shadows of the past continue to plague the forest, Brambleclaw is haunted by a dark figure on a dangerous quest for revenge, and must struggle to remain true to his Clan. A sinister path is unfolding and the time is coming for certain warriors to make the choices that will determine their destinies… and the destiny of all the Clans.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Adventures of Tom Sawyer-Treasury of Illustrated Classics Storybook Collection (Illustrated Jacketed Hardcover)",
        "Authors": "By Twain, Mark",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Vinegar Make Odors Vanish and Other Household Tips",
        "Authors": "By Betsy Rossen Elliott",
        "Description": "",
        "Category": "",
        "Publisher": "Betsy Rossen Elliott (2009-01-01)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "GPS Made Easy : Using Global Positioning Systems in the Outdoors",
        "Authors": "By Letham, Lawrence",
        "Description": "Describes the Global Position System which contains twenty-four satellites used with a receiver to determine its position anywhere in the world, explains features of the receivers, and provides practical examples of their use.",
        "Category": " Sports & Recreation , Outdoor Skills",
        "Publisher": "Mountaineers Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Bleach (Say Good-Bye to Bacteria and So Much More)",
        "Authors": "By Betsy Rossen Elliot",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Salt (Clean Coffee Cup Stains and Other Best-Kept Secrets)",
        "Authors": "By Betsy Rossen Elliot",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Baby",
        "Authors": "By MacLachlan, Patricia",
        "Description": "",
        "Category": "",
        "Publisher": "A Yearling Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Vegetable Oil (Unstick Frozen Car Doors - Solving Pesky Household Problems)",
        "Authors": "By Betsy Rossen Elliot",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Global Tectonics-What Every Business Needs to Know (Custom Edition for Penn State Center for Global Business Studies)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Ghadar & Peterson",
        "Price Starting With ($)": "6.22",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Nelson's Quick Reference Bible Dictionary",
        "Authors": "By Smith, William, Peloubet, F. N., and Peloubet, M. A.",
        "Description": "End the frustration of being unable to locate a Scripture, find a biblical word definition, or get a historical fact when you need it. Each volume in the affordable Nelson's Quick Reference(tm) Series stands alone or can be a solid foundation for an easy-to-use Bible reference library.",
        "Category": " Religion , Biblical Reference , General",
        "Publisher": "Nelson Reference & Electronic Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Probability and Statistics for Engineers and Scientists",
        "Authors": "By Myers, Raymond H, Walpole, Ronald E., and Myers, Sharon L.",
        "Description": "",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Following the Law: The Total Tricks Sequel",
        "Authors": "By Cohen, Larry",
        "Description": "",
        "Category": " Games , General",
        "Publisher": "Natco Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Almost Famous (Talent)",
        "Authors": "By Dean, Zoey",
        "Description": "Almost Famous is the next offering in the upbeat, überchic Talent series from bestselling phenomenon Zoey Dean, about friendship, betrayal, and the L.A. elite.Mackenzie Little-Armstrong?s life is almost perfect. She has discovered an almost-movie star, she?s on the brink of winning Eighth Grade Social Chair, and the fabulous back-to-school gala is just around the corner, sure to showcase Mac and her BFFs as the Next Big Things. But in the cutthroat world of Hollywood, a girl can go from almost there to nowheresville faster than you can say ?soy is so last year.? So hang on for the wild ride as Mac, Emily and their BFFs fight for survival?social survival, that is?and climb their way back to the Inner Circle.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Razorbill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "More O'Malley's Nuns",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "8.81",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "My First Read and Learn Bible (American Bible Society)",
        "Authors": "By American Bible Society and Moore, Eva",
        "Description": "Timeless stories for children and parents to share.Baby's First Read and Learn Bible features eight timeless stories from the Old and New Testament including:  the Creation, The Story of Noah, The Nativity, and Jesus and the Children. Illustrated in full color, this is a perfect introduction to the Bible for the youngest of children.",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Scholastic Inc.",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Novel in France V-62",
        "Authors": "By Martin Turnell",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Bible Promises to Treasure for Newlyweds: Inspiring Words for Every Occasion",
        "Authors": "By Wilde, Gary",
        "Description": "What better gift to place in the hands of a family member, friend or fellow worker than inspirational portions of the word of God? And this collection presents it in beautifully bound editions for years of reading pleasure. Each volume in the Bible Promises to Treasure collection brings portions of God's word to a very specific audience: moms, dads, couples, parents, graduates, and those experiencing turmoil to name just a few. Each of the ten chapters contained in each book offers an introduction along with Scripture portions and befitting inspirational thought.",
        "Category": " Religion , Biblical Reference , Quotations",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Little Critter: Going to the Sea Park (My First I Can Read)",
        "Authors": "By Mayer, Mercer",
        "Description": "Join Mercer Mayer’s classic and beloved character, Little Critter®, and his classmates for some underwater fun as they set out on a delightful trip to the sea park in this My First I Can Read book!With Little Critter and a charming world of sea creatures big and small, there’s a boatload of fun for everyone!Little Critter: Going to the Sea Park is a My First I Can Read book, which means it’s perfect for shared reading with a child.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Webster's New World - Handy Pocket Dictionary",
        "Authors": "By Merriam-Webster",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1980"
        }
    },
    {
        "Title": "Black and Blue: The Golden Arm, the Robinson Boys, and the 1966 World Series That Stunned America",
        "Authors": "By Adelman, Tom",
        "Description": "Baltimore 1966. Suffering through a summer of heated racial animosity, baseball fans look hungrily to the Orioles to bring new respect to their once-great city. Their young team of no-name kids and promising prospects appears to have been strengthened by the recent addition of veteran slugger Frank Robinson - but the former National League MVP is bad news (it is rumored), washed up and unreliable. To lay these rumors to rest, Robby must play harder than he's ever played before. In his first year in the league, against unfamiliar pitchers in new ballparks, he resoundingly proves his worth - to his city, his team, and himself - by delivering a Triple Crown performance. Aided by a hilarious and memorable cast of characters - the gentlemanly southerner Brooks Robinson and the wickedly inventive prankster Moe Drabowsky, a pitching staff of unknown kids like Jim Palmer and Dave McNally, and a gargantuan yet nimble fielder called \"Boog\" - Frank Robinson delivers his new team to its first World Series. But before they take it all, the Orioles must unseat the reigning champion Los Angeles Dodgers.With America's cities in mounting turmoil, Los Angeles seems like another world altogether, a sunny land of surfers and movie stars. Comfortably dwelling in this higher plane is pitching ace Sandy Koufax, arguably the greatest lefthander in baseball history, behind whom the Dodgers have won two of the previous three World Series, replacing the Yankees as the sport's dominant team. Though battling agonizing arthritis throughout the season, the godlike Koufax has nonetheless persevered to win twenty-seven games in 1966, a personal best. Few outside Baltimore give the Orioles more than a fighting chance against such series veterans as Koufax, Don Drysdale, Maury Wills, Tommy Davis, and the rest. Experts are betting that the Dodgers can sweep it in four.What transpires instead astonishes the nation, as the greatest pitching performance in World Series history is capped by a redemption beyond imagining.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Guide to Owning a Cockatiel",
        "Authors": "By Barrie, Anmarie",
        "Description": "Discusses the history of the cockatiel, and how to select, feed, breed, and accomodate the birds",
        "Category": " Pets , Birds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Double Image",
        "Authors": "By MacInnes, Helen",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "29.42",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "Colonial Crafts (Historic Communities (Paperback))",
        "Authors": "By Kalman, Bobbie",
        "Description": "Describes the work of colonial wheelwrights, coopers, founders, shoemakers, millers, gunsmiths, and others, and explains how artisans learned their trade",
        "Category": " Juvenile Nonfiction , History , United States , Colonial & Revolutionary Periods",
        "Publisher": "Crabtree Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Wisdom of Teams: Creating the High-Performance Organization (Collins Business Essentials)",
        "Authors": "By Katzenbach, Jon R. and Smith, Douglas K.",
        "Description": "Teams -- the key to top performanceMotorola relied heavily on teams to surpass its competition in building the lightest, smallest, and highest-quality cell phones. At 3M, teams are critical to meeting the company's goal of producing half of each year's revenues from the previous five years' innovations. Kodak's Zebra Team proved the worth of black-and-white film manufacturing in a world where color is king.But many companies overtook the potential of teams in turning around tagging profits, entering new markets, and making exciting innovations happen -- because they don't know how to utilize teams successfully. Authors Jon R. Katzenbach and Douglas K. Smith talked with hundreds of people in more than thirty companies to find out where and how teams work best and how to enhance their effectiveness. They reveal: The most important element in team success Who excels at team leadership ... and why they are rarely the most senior people  Why companywide change depends on teams ... and moreComprehensive and proven effective,  The Wisdom of Teams is the classic primer on making teams a powerful tool for success in today's global marketplace.",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "Harperbusiness",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Best Hikes Near Washington, D.C. (Best Hikes Near Series)",
        "Authors": "By Burnham, Mary and Burnham, Bill",
        "Description": "Best Hikes Near Who says you have to travel far from home for a great hike? With these information-packed guides in hand, you have everything you need for the adventure you seek, from an easy nature walk to a multiday backpack. Each featured hike includes everything about the trail: location, length, hiking time, and level of difficulty, and if Fido should come along. Other features include: - Trail finder chart that categorizes each hike (e.g., for particular attractions such as waterfalls or for families with kids)- Full-color photos throughout- Information on the area’s history, geology, flora, and fauna- Full-color maps of each trail",
        "Category": " Travel , Special Interest , Hikes & Walks",
        "Publisher": "FalconGuides",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "The Venus Probe",
        "Authors": "By David St. John",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "11.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "My Favorite Bible Storybook for Toddlers (My Favorite Bible Storybook (Dalmatian Press))",
        "Authors": "By Dalmatian Press (EDT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "dalmatian press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "My Best Friend is a Princess: A Princess Friendship Treasury (Toddler Board Books)",
        "Authors": "By Random House",
        "Description": "Sweet dreams, Sleep tight, the Disney Princesses say goodnight! Little girls will have the sweetest dreams after reading this oversized treasury of  Disney Princess bedtime stories featuring Cinderella, Belle, and Sleeping Beauty. With dreamy illustrations, this sturdy padded board book is the perfect addition to a family’s library of bedtime tales.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "eBay Business the Smart Way: Maximize Your Profits on the Web's #1 Auction Site",
        "Authors": "By Sinclair, Joseph T.",
        "Description": "Now in a fully revised second edition, eBay Business the Smart Way tells you everything you need to know to run the low-risk, high-profit eBay business of your dreams. Packed with clear examples, bulleted checklists, and valuable \"insider\" tips.",
        "Category": " Business & Economics , Small Business",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Between Earth and Sky - Girl Scouts of the USA",
        "Authors": "By Laura J. Tuchman",
        "Description": "",
        "Category": "",
        "Publisher": "Girl Scouts of the USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Double the Ducks (MathStart 1)",
        "Authors": "By Murphy, Stuart J. and Petrone, Valeria (ILT)",
        "Description": "It's hard work, taking care of 5 little ducks. But when each little duck comes home with a friend -- oh, no! Now it's double the ducks and double the work. How can 1 little boy get everything done? Understanding how to double numbers helps children master both addition and multiplication. Fun, friendship, and lots of ducks make learning this essential skill both easy and entertaining.",
        "Category": " Juvenile Nonfiction , Mathematics , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Silver Nutmeg",
        "Authors": "By Lofts, Norah",
        "Description": "",
        "Category": "",
        "Publisher": "Pyramid",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Dead Reckoning",
        "Authors": "By Parkinson, Cyril Northcote",
        "Description": "",
        "Category": " Fiction , Historical",
        "Publisher": "Jove Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Cool Stuff Exploded",
        "Authors": "By Woodford, Chris",
        "Description": "Now in paperback!The third installment of DK's visually stunning and incredibly successful Cool Stuff series will blow your mind. This super cool technology book deconstructs-or literally explodes-everyday objects so readers can see exactly how they work. Beautifully photographed spreads give a piece by piece breakdown of cell phones, computers, cars, and more, detailing how each part works and how they all fit together as a whole. This unique look at the items we use every day brings science, technology, and wonder to the fore, giving us all a great appreciation for how our twenty first century world works.",
        "Category": " Juvenile Nonfiction , Technology , How Things Work-Are Made",
        "Publisher": "DK Children",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Trial Lawyers: The Nation's Top Litigators Tell How They Win",
        "Authors": "By Couric, Emily",
        "Description": "For lawyers and lawmen alike, this book introduces ten well-known lawyers who reveal the scholarship, sleuthwork, and aggressiveness that their profession demands.",
        "Category": " Law , Trial Practice",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The Antiporosis Plan",
        "Authors": "By Stephen Holt",
        "Description": "",
        "Category": "",
        "Publisher": "Wellness Publishing.com",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Design Ideas for Home Landscaping",
        "Authors": "By Erler, Catriona Tudor",
        "Description": "Design Ideas for Home Landscaping offers inspiring ideas for achieving a stunning effect with your landscape. It contains everything professionals and homeowners need to create a landscape that is healthy and spectacular. Using the information on plant design, expert gardening and planting advice, and the most resilient vegetation for your region, you can maintain a beautiful outdoor haven with this accessible guide for the professional landscape designer and the do-it-yourself homeowner alike. Expert advice and beautiful photography offer the reader a comprehensive guide for landscape design. Author, Catrionna Tudor Erler, a freelance garden writer, photographer, and speaker, provides invaluable information on plant placement, trimming and sculpting techniques, and suggested tools for each procedure. Illustrated plant-by plant directories are the landscaper’s essential guide for information on shrubbery, perennials, annuals, biennials, bulbs, and hundreds of plants. That is why Design Ideas for Home Landscaping is an essential tool for you to achieve a gorgeous, lush landscape.",
        "Category": " Gardening , Landscape",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Best Recipes of America's Moms",
        "Authors": "By From Sears and Kenmore.",
        "Description": "",
        "Category": "",
        "Publisher": "Sears",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Eat, Shrink & Be Merry! Great-Tasting Food That Won't Go from Your Lips to Your Hips!",
        "Authors": "By Podleski, Janet, Podleski, Greta",
        "Description": "",
        "Category": "",
        "Publisher": "Granet Publishing",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Knit in Comfort: A Novel",
        "Authors": "By Sharpe, Isabel",
        "Description": "A wonderful novel from Isabel Sharpe, the author of As Good As it Got, Knit in Comfort joins the women of Comfort, North Carolina, as they come together to knit and make lace–and find that the intricacies of both echo the complexities of their own lives. A story that combines the popular pastime of crafting and a richly realized cast of unforgettable characters, Knit in Comfort is a heartwarming tale of love and friendship that every fan of Debbie Macomber, Kate Jacobs, and Ann Hood is certain to cherish.",
        "Category": " Fiction , Women",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    }
]