[
    {
        "Title": "The Red Badge of Courage (The World's Best Reading)",
        "Authors": "By Crane, Stephen",
        "Description": "",
        "Category": " Fiction , War & Military",
        "Publisher": "Readers Digest Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Home Security: A Comprehensive Guide to the Best and Most Practical Ways to Burglarproof Your Home and Possessions (The Homeowner's Library)",
        "Authors": "By Cooper, Sydney C. and Scott, Anne",
        "Description": "Covers an overview of the problem, with specific guidelines for doors, windows, locks, padlocks, burglar alarms, fire alarms for houses and apartments, and a special account for auto security",
        "Category": " House & Home , General",
        "Publisher": "Consumer Reports Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Fifty Easy Old-Fashioned Roses, Climbers, and Vines",
        "Authors": "By Zeman, Anne M.",
        "Description": "Fifty Easy Old-Fashioned Roses, Climbers and Vines is a book by Anne M. Zeman.",
        "Category": " Gardening , Flowers , Roses",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Brooklyn Botanic Garden Record:  Roses,",
        "Authors": "By Brooklyn Botanic Garden",
        "Description": "",
        "Category": " Gardening , Flowers , Roses",
        "Publisher": "Brooklyn Botanic Garden",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Good Morning, Lord: Devotions for Children",
        "Authors": "By Korfker",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Book House",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "Hershey's Best Cakes",
        "Authors": "By Hershey Kitchens Editors",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Cakes",
        "Publisher": "Wilton house",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Galloway's Book on Running",
        "Authors": "By Galloway, Jeff",
        "Description": "A world-class athlete and coach offers his own training techniques, plus tips on preventing sports injuries, eating properly, choosing equipment, and advice for female runners",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Shelter Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Catspeak:: How to Communicate with Cats by Learning Their Secret Language",
        "Authors": "By Randolph, Elizabeth, Dibra, Bashkim, and Dennis, Jose (ILT)",
        "Description": "The internationally acclaimed animal behaviorist trains readers in the art of communicating with their cats by emphasizing patience, persistence, and praise. Reprint.",
        "Category": " Pets , Cats , General",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Better Homes and Gardens Treasury of Christmas Crafts & Foods",
        "Authors": "By Not Applicable (Na )",
        "Description": "Covers over five hundred Christmas craft and cooking projects for decorating, gifts, holiday food specialties, and much more",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "Feng Shui For Beginners: Successful Living by Design (For Beginners (Llewellyn's))",
        "Authors": "By Webster, Richard",
        "Description": "When you live in harmony with the universe, good things naturally flow your way. Feng Shui for Beginners offers simple techniques for attracting the powerful energy known as ch’i into your home and workplace.  By simply rearranging your furniture, hanging wind chimes outside your door, or placing a vase filled with flowers in your bedroom, you can improve your life in a variety of ways: create a more peaceful home, enhance your creativity, even find true love. You’ll learn how to use feng shui to get rid of shars in your environment—straight lines and sharp angles that produce bad luck. And you can even predict the future with the “Flying Star” technique.",
        "Category": " Body, Mind & Spirit , Feng Shui",
        "Publisher": "Llewellyn Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Beyond Our Means: How Reckless Borrowing Now Threatens To Overwhelm Us",
        "Authors": "By Malabre, Alfred L.",
        "Description": "Discusses how the national debt arose and doubled within the last five years and what this means to the nation and the individual",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Tumble Bumble",
        "Authors": "By Bond, Felicia",
        "Description": "When a bug goes for a walk, he might meet a cat and a crocodile and a bee and ... well, all kinds of creatures. They could sing and dance and do all sorts of things. To find out who this bug meets and what they do, you'll have to join them. But ready for anything and be ready for fun, because this is a tumble bumble story and you just never know what's going to happen!",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Boyds Mills Press",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Garden Of Prayer",
        "Authors": "By Kinkade, Thomas",
        "Description": "In The Garden of Prayer, Kinkade has combined some of his most touching and uplifting artwork with inspirational quotes from many great thinkers of our time. Together, they create a heartfelt volume that will help readers nurture a prayerful relationship with God. Anyone looking for enlightenment and encouragement as they cultivate their own garden of prayer will want this enchanting volume. With its light-filled artistry and hope-filled thoughts, The Garden of Prayer provides the perfect retreat for readers seeking comfort and peace.Thomas Kinkade has always cherished the qualities that make America great. The Painter of Light¿ radiantly imbued each piece of his art with tranquillity, love, faith, and family-all attributes of this great nation that has clung together through thick and thin.",
        "Category": " Religion , Inspirational",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Guide to Womens Literature Throughout the Worl",
        "Authors": "By Buck, Clair",
        "Description": "",
        "Category": "",
        "Publisher": "Columbia Marketing",
        "Price Starting With ($)": "6.22",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Littlest Uninvited One",
        "Authors": "By Tazewell, Charles and Tribble, Gail (ILT)",
        "Description": "A mischievous cherub named Michael brings a puppy to Celestial City, causing an uproar that can be quieted only when the Son orders that a place just for animals be constructed on the Street of Miracles",
        "Category": " Juvenile Fiction , Religious , General",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Rules of Thumb for Business Writers",
        "Authors": "By Hughes, Elaine, Wienbroer, Diana Roberts, and Silverman, Jay",
        "Description": "In the business world, limply written, badly organized documents can subtly but steadily downgrade your career. You’ve got to write clearly, concisely, and energetically--without meandering, repeating yourself, or sabotaging your ideas with poorly constructed sentences, stilted language, and embarrassing grammatical errors. Get the help you need--now--with RULES OF THUMB FOR BUSINESS WRITERS. Written by the author team of the best-selling RULES OF THUMB: A GUIDE FOR WRITERS, this new guide is designed especially to meet the real writing demands of daily business. Whether you’re composing a letter, preparing an outline for your next big report, or simply wondering whether or not that comma makes sense, RULES OF THUMB FOR BUSINESS WRITERS explains how to do it right. It’s packed with concise explanations of the most frequent problems in writing, bulleted lists of easy-to-read guidelines, and hundreds of practical guidelines that instantly illustrate each concept. Quickly and easily, you’ll learn how to find your focus, break up your thoughts effectively, format your documents for optimal readability, begin with an attention-grabbing bang, adopt a straightforward, conversational tone, and improve your style. And you’ll learn how to write succinctly, accurately, and persuasively, whether in formal business correspondence, more casual e-mail messages, memos, agendas, instructions manuals, reports, newsletters and press releases, proposals, or résumés. PLUS, you’ll learn to effortlessly adhere to the rules of punctuation, grammar, and usage, understanding when to capitalize, choosing the correct pronoun, avoiding fragments and run-on sentences, properly placing apostrophes, and more. There’s even helpful advice on tackling special topics, such as conducting research on the Web efficiently, using footnotes accurately, developing templates to simplify future tasks, planning and executing a long-term project, and editing the work of others. A valuable appendix of ready-to-use memos, letters, agendas, résumés, and more round out this handy book. RULES OF THUMB FOR BUSINESS WRITERS helps you take all those amorphous ideas and disjointed bits of information and record them in a way that is clear, logical, and action-oriented. It’s the on-the-job reference you’ll turn to again and again, for both a thorough overview of the essentials of great writing and for fast, easy lessons on key topics.",
        "Category": " Business & Economics , Business Writing",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Tom: The Unknown Tennesse Williams",
        "Authors": "By Leverich, Lyle",
        "Description": "The riveting, revelatory, and sole authorized account of the critical first decades of Tennessee Williams's life. Tennessee Williams, author of such indelible masterpieces as The Glass Menagerie and A Streetcar Named Desire, is considered by many to be the greatest literary artist of the American theater. Tom is Lyle Leverich's definitive account based on his exclusive access to letters, diaries, unpublished manuscripts, and family documents of Williams's early life and of the events that shaped this most autobiographical of dramatists. It tells the story of the marital traumas of his bullying father and overly protective mother, the mental disorders that institutionalized his beloved sister Rose, his stalled academic career, and his confused sexuality and early successes as a writer; and it leaves Thomas Lanier Williams on the brink of fame with The Glass Menagerie and his transformation into the celebrated persona of \"Tennessee.\"",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "W W Norton & Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Lady Luck: The Theory of Probability (Dover Books on Mathematics)",
        "Authors": "By Weaver, Warren",
        "Description": "\"Should I take my umbrella?\" \"Should I buy insurance?\" \"Which horse should I bet on?\" Every day ― in business, in love affairs, in forecasting the weather or the stock market questions arise which cannot be answered by a simple \"yes\" or \"no.\" Many of these questions involve probability. Probabilistic thinking is as crucially important in ordinary affairs as it is in the most abstruse realms of science. This book is the best nontechnical introduction to probability ever written. Its author, the late Dr. Warren Weaver, was a professor of mathematics, active in the Rockefeller and Sloan foundations , an authority on communications and probability, and distinguished for his work at bridging the gap between science and the average citizen. In accessible language and drawing upon the widely diverse writings of thinkers like Kurt Godel, Susanne K.Langer, and Nicholas Bernoulli, Dr. Weaver explains such concepts as permutations, independent events, mathematical expectation, the law of averages, Chebychev's theorem, the law of large numbers, and probability distributions. He uses a probabilistic viewpoint to illuminate such matters as rare events and coincidences, and also devotes space to the relations of probability and statistics, gambling, and modern scientific research. Dr. Weaver writes with wit, charm and exceptional clarity. His mathematics is elementary, grasp of the subject profound, and examples fascinating. They are complemented by 49 delightful drawings by Peg Hosford. 13 tables. 49 drawings. Foreword. Index.",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "The Unofficial Gay Manual: Living the Lifestyle (Or at Least Appearing To)",
        "Authors": "By DiLallo, Kevin and Krumholtz, Jack (CON)",
        "Description": "Profusely illustrated with drawings, The Unofficial Gay Manual is hip enough to titillate the most jaded urbanite, and wholesome enough to take home to Mom — an absolute must-have for gay men, their families and friends, and a hilarious eye-opener for just about everyone else. With essays, multiple-choice and true-false tests, lists, sidebars, and charts, the manual explains it all for you with items like:• Gaydar • How to Avoid Killing Your Lover’s Mother• United We Stand (Gay Types by City)• Going out Guide to Major Cities•  10 Things to Consider When Planning a Gay Wedding . . . and dozens more that are as informative and enlightening as they are laugh-out-loud funny.",
        "Category": " Humor , Topic , Men, Women & Relationships",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "A Non-Churchgoer's Guide to the Bible",
        "Authors": "By Gantt, Michael",
        "Description": "This easy-to-read, user-friendly guide to the all-time bestselling book (the Bible) takes a fresh, nonsectarian approach.This book is written primarily for persons who may have interest in the Bible but have little knowledge of it. It is a fresh, succinct introduction to any reader. Even readers who may attend church may find it helpful. The book is also a thoughtful, nonoffensive gift.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Good Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2013"
        }
    },
    {
        "Title": "Betrayal: How Union Bosses Shake Down Their Members and Corrupt American Politics",
        "Authors": "By Gray, Daniel and Chavez, Linda",
        "Description": "“Simply put, the leftist labor unions have the Democrats in their pockets. And we’re all paying the price.”Linda Chavez, President George W. Bush’s original choice for Secretary of Labor and a former union official, is one of the foremost authorities on America’s labor unions. Now, in the explosive new book Betrayal, she and fellow union expert Daniel Gray expose the corrupt bargain between the labor movement and the Democratic Party.Committed to a far-left political agenda—and to enhancing their own power—union bosses funnel at least half a billion dollars into Democratic coffers every year. And they do it, illegally, by using dues money that workers are forced to pay as a condition of their employment—dues money that each year brings the unions $17 billion, all of it tax-free. What do labor bosses get in return? The power to call the shots in Democratic campaigns and on party policy, extraordinary influence at all levels of government, billions of dollars in taxpayer-funded federal grants, and special legal privileges that leave them free to act as they please, no matter the consequences for the American people. The cycle of corruption is seemingly endless.Chavez and Gray name names, exposing the many politicians who are in Big Labor’s pocket—including the leading lights of the Democratic Party. Betrayal also reveals: • Big Labor’s all-out efforts in the 2004 election, including how just one local union has launched a $35-million campaign to unseat President Bush• How corrupt union officials use members’ hard-earned money to fund lavish lifestyles—and how their Democratic supporters let them get away with it • How unions flout the law by failing to report any of their political spending to the IRS• How a government report uncovered the Democrats’ sellout to Big Labor—but how the unions and the Democrats sued to keep the report from going public • How the U.S. government lets unions practice legalized terrorism against American citizens• How public-employee unions extort concessions from the government and put Americans at risk by refusing to provide vital services like policing and firefighting• How Americans now live under a system of legal apartheid—one set of rules for labor bosses, another for the rest of usAll of us foot the bill for this corrupt system. Now it’s up to us to do something about it.",
        "Category": " Political Science , General",
        "Publisher": "Crown Forum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Soviet Air Power And The Pursuit Of New Military Options (Studies In Communist affairs, 3)",
        "Authors": "By Philllip A. Petersen",
        "Description": "",
        "Category": "",
        "Publisher": "United States Air Force",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Call for Revolution",
        "Authors": "By Gross, Martin L.",
        "Description": "Examines how the corruption, inefficiency, and wasteful spending of the federal government is creating a national crisis, and suggests reforms to eliminate these problems",
        "Category": " Political Science , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Greek Myths: Volume 1 (Pelican)",
        "Authors": "By Graves, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1955"
        }
    },
    {
        "Title": "A Walk Across France",
        "Authors": "By Morland, Miles",
        "Description": "\"[A] humorous and effervescent memoir of reflection, revitalization and good wine.\" -- San Francisco ChronicleAt age forty-five, Miles Morland left his high-paying job at the London office of a Wall Street firm and took a leap -- actually, a hike -- into the unknown. A self-described \"middle-aged wreck,\" Miles set out with his wife, Guislaine, to walk across France, from the Mediterranean to the Atlantic.Setting for themselves the goal of twenty miles a day, Miles and Guislaine made their way past farmyards and riverbanks, through dusty village squares and ripening vineyards, into ancient walled cities and over sand dunes. And as the hot, dry countryside unfolded slowly before them, the couple looked back with relief -- and wonder -- at the tense, frenzied corporate life they had left behind.The story of a walk, a marriage, an adventure, and a dream made real, A WALK ACROSS FRANCE marks the debut of an enormously entertaining writer.",
        "Category": " Travel , Europe , France",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Sou'West in Wanderer IV",
        "Authors": "By Hiscock, Eric C.",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1973"
        }
    },
    {
        "Title": "Colorado Ski Country (Geographic Series)",
        "Authors": "By Meyers, Charlie",
        "Description": "",
        "Category": " Sports & Recreation , General",
        "Publisher": "Falcon Pr Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Aladdin Pop-up",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "BOOKMART",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Catholic Children's Bible",
        "Authors": "By Theola, Mary",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Regina Press Malhame & Company",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The Autobiography of an Ex-Colored Man (Dover Thrift Editions: Black History)",
        "Authors": "By Johnson, James Weldon",
        "Description": "One of the most prominent African-Americans of his time, James Weldon Johnson (1871–1938) was a successful lawyer, educator, social reformer, songwriter, and critic. But it was as a poet and novelist that he achieved lasting fame. Among his most famous works, The Autobiography of an Ex-Colored Man in many ways parallels Johnson's own remarkable life. First published in 1912, the novel relates, through an anonymous narrator, events in the life of an American of mixed ethnicity whose exceptional abilities and ambiguous appearance allow him unusual social mobility — from the rural South to the urban North and eventually to Europe. A radical departure from earlier books by black authors, this pioneering work not only probes the psychological aspects of \"passing for white\" but also examines the American caste and class system. The human drama is powerful and revealing — from the narrator's persistent battles with personal demons to his firsthand observations of a Southern lynching and the mingling of races in New York's bohemian atmosphere at the turn of the century. Revolutionary for its time, the Autobiography remains both an unrivaled example of black expression and a major contribution to American literature.",
        "Category": " Biography & Autobiography , Cultural, Ethnic & Regional , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "A Ceiling of Stars (Ag Fiction (American Girl))",
        "Authors": "By Creel, Ann Howard",
        "Description": "When her mother abandons her, Vivien must face her sudden homelessness alone in a big city and tells her story through a series of poignant letters and journal entries. By the author of Water at the Blue Earth. Simultaneous.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Artists and Writers Colonies: Retreats, Residencies, and Respites for the Creative Mind",
        "Authors": "By Bowler, Gail Hellund",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Blue Heron Publishing, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "America's Best Kept Secret",
        "Authors": "By Shook, Robert L. and Gagan, James L",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Oriental favorites (Cooking with Bon appétit)",
        "Authors": "By Appetit, Bon",
        "Description": "",
        "Category": "",
        "Publisher": "Knapp Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "How a Fly Walks Upside Down...and other curious facts",
        "Authors": "By Goldwyn, Martin M.",
        "Description": "Over 250 scientific questions and answers for the unscientific layperson. Humorous and fascinating, it's a vast storehouse of knowledge and a perfect trivia reference book.  B&W line drawings throughout.  256 pages.",
        "Category": " Reference , Trivia",
        "Publisher": "Wings",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "You've Lost It, Now What? How to Beat the Bear Market and Still Retire on Time",
        "Authors": "By Clements, Jonathan",
        "Description": "Even if you have lost 40, 50, or even 80 percent of your savings, it is still possible to retire in comfort.  This year's stock market collapse has been especially devastating to millions of Americans in their forties and fifties who had been buying stocks and mutual funds for their retirement years. Trillions of dollars were lost, and thousands of retirement accounts and portfolios were reduced by more than 50 percent. The question now is, what's the next step? Will these hardworking people need to continue working into their seventies? Not if they make the right moves today, says Jonathan Clements, The Wall Street Journal's highly respected personal finance columnist.  Today, investors are faced with a barrage of dubious advice. Stocks are supposedly dead. Bonds are now touted as the only safe way to invest. Meanwhile, folks are once again claiming you can't go wrong with real estate. Clements, an award-winning personal finance columnist, rips apart this dubious advice, telling readers what's true and what's not. In the same feisty, easy-to-understand style that he brings to his regular Wall Street Journal columns, Clements gives readers a road map for the years ahead. He takes them step-by-step through the process of rebuilding their nest eggs and explains how, after reaching retirement, they can squeeze the maximum out of their savings.  This practical, concise guide will allow all readers to stop panicking, rebuild assets, and get their retirement plans back on track.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Portfolio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Nine Emotional Lives of Cats: A Journey Into the Feline Heart",
        "Authors": "By Masson, J. Moussaieff",
        "Description": "In the hugely popular New York Times bestseller, Dogs Never Lie About Love, provocative psychoanalyst Jeffrey Moussaieff Masson brilliantly navigated the inner landscape of “man’s best friend.” Now he delves deep into the secretive, playful world of cats, revealing emotions, debunking myths, and honoring the feline’s evolution from solitary jungle creature to human companion. Drawing from literature, history, animal behavioral research, and the wonderful true stories of cat experts and cat lovers around the world, Jeffrey Masson vividly explores the delights and mysteries of the feline heart. But at the core of this remarkable book are Masson’s candid, often amusing observations of his own five cats. Their mischievousness, aloofness, and affection provide a way to examine emotions from contentment to jealousy, from anger to love. Consider the question: Are cats selfish? While human egocentricity is defined by how little a person cares about others, the cat’s narcissism is not like that at all. Cats may appear self-centered, but they watch us all the time, taking us in. They see us; they notice us–a far cry from vanity.Cats are curious, a trait that rarely kills them. On the contrary, it gives them the chance to assess, in their own idiosyncratic way, whether we are worthy of their attention. Cats are happy to be themselves. What they think of us is a different question entirely. “We need cats to need us,” notes Masson, “It unnerves us that they do not. However, if they do not need us, they nonetheless seem to love us.”The Nine Emotional Lives of Cats will captivate readers with its surprises and insights, offering a new perspective on the deep connection shared by humans and their feline friends. This is the book that Masson’s many fans and cat lovers everywhere have been waiting for.",
        "Category": " Pets , Cats , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Air Force Integrates, 1945-1964, Second Edition (Smithsonian History of Aviation Series)",
        "Authors": "By Gropman, Alan L.",
        "Description": "On April 5, 1945, more than sixty black officers of the U.S. Army Air Forces were arrested for entering a whites-only club at Freeman Field, Indiana, to protest the rigid segregation and unequal policies under which they and all African American airmen were forced to serve. Termed a mutiny by the white commanders at the base, the incident was one of several racial conflicts during the next four years that helped convince senior officers in the newly independent Air Force that segregation was an inefficient personnel policy. Documenting the racial integration of the Air Force from the end of World War II to the passage of the Civil Rights Act of 1964, Alan L. Gropman contends that the service desegregated itself not for moral or political reasons but to improve military effectiveness. He draws on a range of unpublished records to show that, while proceeding smoothly, Air Force integration initially did little to ensure fair promotion practices or to protect African Americans from off-post discrimination, especially in housing, entertainment, and education. Gropman also outlines the political motivations of President Truman's 1948 Executive Order 9981 for equal opportunity in the military and reviews controversial Kennedy administration initiatives that attempted to place the military at the forefront of civil rights reform. First published in 1977, the book now includes a new preface charting the policy changes that have dramatically increased the numbers of black officers and senior supervisors in the Air Force during the past two decades. Detailing the uneven progress of a major shift in military policy, The Air Force Integrates also illuminates the often pragmatic motivations of those who bring about fundamental social change.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Smithsonian Institution Scholarly Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "How to Talk Tennis",
        "Authors": "By Schwed, Peter and Jones, Taylor",
        "Description": "Defines terms used concerning rules, scoring, playing technique, and strategy, and offers profiles of the best players of the past",
        "Category": " Sports & Recreation , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Into the Wild (Warriors, Book 1)",
        "Authors": "By Hunter, Erin",
        "Description": "Join the legion of fans who have made Erin Hunter's Warriors series a #1 national bestseller! Epic adventures. Fierce Warrior cats. A thrilling fantasy world. It all begins here with Warriors #1: Into the Wild.For generations, four Clans of wild cats have shared the forest according to the laws laid down by their ancestors. But the warrior code is threatened, and the ThunderClan cats are in grave danger. The sinister ShadowClan grows stronger every day. Noble warriors are dying—and some deaths are more mysterious than others.In the midst of this turmoil appears an ordinary housecat named Rusty . . . who may turn out to be the bravest warrior of them all.Supports the Common Core State Standards",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Collision With History: The Search For John F. Kennedy's PT 109",
        "Authors": "By Ballard, Robert D. and Morgan, Michael Hamilton (CON)",
        "Description": "Michael Hamilton Morgan writes on the PT 109 collision: It?s about 2 a.m., August 2, 1943. Lt. John F. Kennedy squints into the fog and black while at the wheel of PT 109, idling in the Blackett Strait off Gizo in the Solomon Islands. His orders are to attack the ?Tokyo Express? resupplying Japanese installations.... He and his young crew are ready, but handicapped by darkness and fog.... Suddenly, only 300 yards away, a black shape looms...traveling without lights and at high speed. Only seconds before impact...the ship is identified as a Japanese destroyer, the Amagiri. The much larger craft slices through the hull of PT 109, cutting the 80-foot wooden-hulled boat in two. Several of the crew are injured, one critically. The crew takes refuge on the larger section that remains afloat until dawn. Then all are into the water, and Lt. Kennedy begins the series of epic swims that will save his crew and earn him a place in history. Forty years after his death and 60 years after his first collision with history in the South Pacific, John F. Kennedy and his story still inspire readers. In Collision with History, JFK?s heroic efforts to save the 11-man crew of PT 109 are brought to vivid life, interwoven with a comprehensive history of PT boats and the World War II campaign in the Solomon Islands. Combining renowned explorer Robert Ballard?s account of his search for the wreckage of PT 109 with survivor accounts and Kennedy family members? personal recollections, this companion volume to the major National Geographic television event is a moving introduction to the young war hero who would later become president.",
        "Category": " History , United States , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Professional Active Server Pages 2.0",
        "Authors": "By Sussman, David, Homer, Alex, Francis, Brian, Smith, Robert, Harrison, Richard, Fedorov, Alex, and Murphy, Shawn",
        "Description": "Updates and expands the knowledge of programmers with an existing knowledge of ASP 1.0, and allows anyone with knowledge and experience of VBScript or JavaScript and the Internet to learn this server side web technology. Topics include discovering what ASP is and what it can do; mastering programming; using and building Active Server Components for programming; using the ActiveX Data Objects technology for database access; client-server programming on the Web; Internet risks and protection strategies; and case studies of applications illustrating advanced techniques. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Client-Server Computing",
        "Publisher": "Apress",
        "Price Starting With ($)": "6.8",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Where Trouble Sleeps",
        "Authors": "By Edgerton, Clyde",
        "Description": "A New York Times Notable Book. For his seventh novel, Clyde Edgerton returns to the setting of his own childhood--rural North Carolina at mid-twentieth century. This beguiling novel tells the story of a tight-knit crossroads community and what happens when a quick-change artist stops for gas and an oil check, sees opportunities, and decides to stop there for a while. \"You'll spend a lot of time laughing and wiping your eyes and reading passages aloud to anyone who'll listen.\"--Boston Globe; \"This may be Edgerton's best novel ever. I say that each time I finish one of his books.\"--Newark Star-Ledger ; \"Edgerton, evoking Flannery O'Connor, composed chatty, tone-perfect tales of small town life that illuminate the knife edge between satire and nostalgia.\" --Entertainment Weekly; \"A slyly satiric and artful story . . . Edgerton reveals the innocent, the deluded, and the hypocritical with an unerring sense of humor and truth.\"--Publishers Weekly; \"In the pitch-perfect tradition of Flannery O'Connor and William Faulkner, Edgerton spins things wildly, masterfully, hilariously out of control.\"--Maxim.",
        "Category": " Fiction , Historical",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Creative Stenciling & Decorative Techniques",
        "Authors": "By Fey-Kirsch, Jean-Michel",
        "Description": "",
        "Category": " Crafts & Hobbies , Stenciling",
        "Publisher": "Clb",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "DNS and BIND",
        "Authors": "By Albitz, Paul and Liu, Cricket",
        "Description": "DNS and BIND discusses one of the Internet's fundamental building blocks: the distributed host information database that's responsible for translating names into addresses, routing mail to its proper destination, and many other services. As the authors write in the preface, if you're using the Internet, you're already using DNS --  even if you don't know it.The third edition covers BIND 4.9, on which most commercial products are currently based, and BIND 8, which implements many important new features and will be the basis for the next generation of commercial name servers. It also covers topics like DNS security (greatly improved with BIND 8.1), asynchronous notification of changes to a zone, dynamic updates, and programming with Perl's Net::DNS module.Whether you're an administrator involved with DNS on daily basis, or a user who wants to be more informed about the Internet and how it works, you'll find that this book is essential reading.Topics include:What DNS does, how it works, and when you need to use itHow to find your own place in the Internet's name spaceSetting up name serversUsing MX records to route mailConfiguring hosts to use DNS name serversSubdividing domains (parenting)Securing your name server: restricting who can query your server, preventing unauthorized zone transfers, avoiding bogus name servers, etc.Mapping one name to several servers for load sharingTroubleshooting: using nslookup, reading debugging output, common problemsDNS programming, using the resolver library and Perl's Net::DNS  module",
        "Category": " Computers , Networking , General",
        "Publisher": "O'Reilly & Associates",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Short Trips In The Pacific Northwest: 52 Weekend Destinations from Seattle and Portland",
        "Authors": "By Anderson, Barry and Anderson, Hilda",
        "Description": "Hundreds of ideas for what to see and do are included in 52 revised and updated, easy-to-follow itineraries that take you throughout Washington and Oregon and across the border into British Columbia-from Puget Sound and the Olympic Peninsula to Vancouver Island, the Cascade Mountains, and beyond. Tour the wine country, visit an Indian reservation, view the magnificent falls at Columbia River Gorge, or browse for antiques in a nineteenth-century town. Ski, fish, hike, whale watch, or just sit and enjoy a concert under the stars. And don't forget to stop for tea at Victoria's grand old Empress Hotel. You can do it all within approximately 250 miles of Seattle or Portland. Travel directions are provided for each itinerary, as are updated listings of special events, restaurants, and lodgings.",
        "Category": " Travel , United States , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Better Homes and Gardens Your Baths",
        "Authors": "By Not Applicable (Na )",
        "Description": "Gives practical suggestions on building or remodeling a bath, discusses lighting, storage, exhaust fans, and fixtures, and looks at hot tubs, saunas, and whirlpool baths",
        "Category": " House & Home , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Waiting to Exhale",
        "Authors": "By McMillan, Terry",
        "Description": "Four African-American women console and support one another in a complex friendship that helps each of them face the middle of her life as a single woman. 100,000 first printing. Major ad/promo. Tour.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Backpack",
        "Authors": "By Barr, Emily",
        "Description": "Following her mother's death, jaded Londoner Tansy abandons her miserable boyfriend, trendy friends, and media job to backpack across Asia, discovering many things along the way, including a serial killer who seems to be targeting her.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Day in September (Creative Editions)",
        "Authors": "By Nascimbene, Yan",
        "Description": "The lives of two isolated children, a wealthy young boy from Paris and the poor daughter of Mexican migrant workers, intersect at a baseball game in California with lasting results",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Nontoxic Home & Office",
        "Authors": "By Dadd, Debra Lynn",
        "Description": "A guide to finding easy-to-implement alternatives to potentially harmful substances features chapters on cleaning products, household pesticides, tap water, drugs and medications, personal care products, food, clothing, bedding, and furniture. Original.",
        "Category": " House & Home , Reference",
        "Publisher": "Jeremy P. Tarcher, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Social Policies for Children",
        "Authors": "By McLanahan, Sara S. (EDT), Garfinkel, Irwin (EDT), and Hochschild, Jennifer L. (EDT)",
        "Description": "Successful social policies for children are critical to America's future. Yet the status of children in America suggests that the nation's policies may not be serving them well. Infant and child mortality rates in the U.S. remain high compared to other western industrialized nations; child poverty rates have worsened in the past decade; poor health care, child abuse, and inadequate schooling and child care persist.This book presents a new set of social policies designed to alleviate these problems and to help satisfy the needs of all children. The policies deal with the seven critical domains affecting children from birth through the passage to adulthood: child care, schooling, transition to work, health care, income security, physical security, and child abuse.While nearly everyone agrees that children are in trouble, there is considerable debate over what kind of trouble they are in, why this is so, and whether government can or should more actively seek to solve these problems. Americans are evenly divided on the question of whether children's problems are more economic or moral in origin. The seven proposals in this volume both reflect and cut across ideological disagreements. Some call for more government, others call for less, and all call for different government methods for achieving socially agreed upon goals.Recommendations include: replacing major welfare programs and tax subsidies with a set of universal policies, including national health insurance, child support assurance, and universal child care; offering publicly funded vouchers to allow poor children in inner-city neighborhoods to choose their own schools; using both private and governmental resources to get tough on crime through more stringent criminal justice policies and dramatic social measures; and expanding apprenticeship programs for non-college bound youths.In addition to the editors, the contributors are Barbara R. Bergmann and Robert I. Lerman, American University; Douglas J. Besharov, American Enterprise Institute; John J. DiIulio, Jr., Princeton University; Julia Graham Lear, George Washington University; and Diane Ravitch, New York University.",
        "Category": " Social Science , Children's Studies",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Selections from A Child's Garden of Verses (A Golden Book)",
        "Authors": "By Robert Louis Stevenson",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Christmas in Colonial and Early America",
        "Authors": "By peter andrews",
        "Description": "",
        "Category": "",
        "Publisher": "World Book Encyclopedia, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "James Dickey: The World as a Lie",
        "Authors": "By Hart, Henry",
        "Description": "A fascinating biography of one of the most popular, colorful, and notorious American poets of our century.The legendary Southern poet James Dickey never shied away from cultivating a heroic mystique.  Like Norman Mailer and Ernest Hemingway, he earned a reputation as a sportsman, boozer, war hero, and womanizer as well as a great poet, novelist, screenwriter, and essayist.  But James Dickey made lying both a literary strategy and a protective camouflage; even his family and closest friends failed to distinguish between the mythical James Dickey and the actual man.  Henry Hart sees lying as the central theme to Dickey's life; and in this authoritative, immensely entertaining biography he delves deep behind Dickey's many masks.  Letters, anecdotes, tall tales and true ones, as well as the reluctant but finally candid cooperation of Dickey himself animate Hart's narration of a remarkable life.  Readers of Dickey's National Book Award-winning poetry, his bestselling novel Deliverance, and anyone who witnessed his electrifying readings of his work will savor this book.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Picador",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Last Tsar: The Life and Death of Nicholas II",
        "Authors": "By Schwartz, Marian (TRN) and Radzinsky, Edvard",
        "Description": "An in-depth account of the life, reign, and final days of the last Russian tsar draws on Nicholas II's personal diaries, firsthand accounts of the murder of the royal family, and other sources. Reprint. 90,000 first printing. $90,000 ad/promo.",
        "Category": " History , Russia & the Former Soviet Union",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Walking-The Pleasure Exercise: A 60-Day Walking Program for Better Health",
        "Authors": "By Malkin, Mort",
        "Description": "Presents a natural program for improving physical and mental health, including heart strength, bone health, and weight maintenance, through pleasurable walking exercise",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "The Ultimate Disney Joke Book",
        "Authors": "By Lovitt, Chip",
        "Description": "A collection of riddles, knock-knocks, dizzy definitions, and other jokes featuring Mickey Mouse and his friends and the characters from Disney animated films",
        "Category": " Juvenile Nonfiction , Humor , Jokes & Riddles",
        "Publisher": "Disney Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Armageddon: Appointment With Destiny",
        "Authors": "By Jeffrey, Grant R.",
        "Description": "",
        "Category": " Religion , Biblical Studies , Prophecy",
        "Publisher": "Frontier Research Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Larger Animals of East Africa (Collins Safari Guides)",
        "Authors": "By Hosking, David and Withers, Martin B.",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Harpercollins Pub Ltd",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Strengthening your grip: Essentials in an aimless world",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "WORLD WIDE",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "What Do Doozers Do? (A Fraggle Rock Book Starring Jim Henson's Muppets)",
        "Authors": "By Muntean, Michaela",
        "Description": "Compares the lazy Fraggles who love to play with the energetic Doozers who love to work",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "The Cross Burns Brightly: A Hall-Of-Famer Tackles Racism and Adversity to Help Troubled Boys",
        "Authors": "By Blount, Mel and Sterling, Cynthia",
        "Description": "The former Pittsburgh Steelers star describes his struggles to establish homes for troubled boys",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The healing of a nation",
        "Authors": "By Loye, David",
        "Description": "",
        "Category": "",
        "Publisher": "Norton",
        "Price Starting With ($)": "10.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Killer Pancake (Goldy Culinary Mysteries)",
        "Authors": "By Davidson, Diane Mott",
        "Description": "With the temperature soaring, the last place Goldy, owner of Goldilocks' Catering, wants to be is slaving over a hot stove. But with her latest assignment, catering the Mignon Cosmetics Low-Fat Luncheon, Goldy stands to make a pretty hefty commission - and her assistant, Julian Teller, gets to spend time with his new ladylove, a gorgeous Mignon sales associate.Soon, though, as Goldy wrestles with recipes woefully lacking in cream, butter, and eggs, she wishes she'd stayed clear of the beauty biz - especially when she learns that to get inside the mall where the banquet is being held, she and Julian will have to wade through an angry mob of demonstrators. It seems that Mignon Cosmetics' animal-testing policies have made them the target of \"Spare the Hares.\" And there's worse to come. On the day of the banquet, as Goldy struggles to carry forty pounds of low-fat fare from her van to the mall, she hears an ominous squeal of tires and a horrifying thump.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Lilith: A Snake in the Grass (The Four Lords of the Diamond, Vol. 1)",
        "Authors": "By Chalker, Jack L.",
        "Description": "Four men, stripped of their own minds and given that of a special agent, are sent to the worlds of the Warden Diamond to conquer the alien force threatening earth and invading all life forms",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "America's New Blue Chips: An Investment Guide to the Hottest Growth Stocks",
        "Authors": "By Walden, Gene",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "5.73",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "In the Face of the Nations: Israel's Struggle for Peace",
        "Authors": "By Tekoah, Yosef",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.28",
        "Publish Date": {
            "Month": "April",
            "Year": "1976"
        }
    },
    {
        "Title": "Paint and Wallpaper (Home Repair and Improvement, Updated Series)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Examines the properties of different paints, illustrates paperhanging procedures, and describes the tools and techniques for interior and exterior painting",
        "Category": " House & Home , Decorating",
        "Publisher": "Time Life",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Walls (Your Home Series)",
        "Authors": "By Time Life",
        "Description": "Describes the structure of walls, shows how to prepare them for redecorating, and discusses paint, wallpaper, paneling, and the safe use of power tools",
        "Category": " House & Home , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "The Grand Tour: Shrines of Power",
        "Authors": "By Conti, Flavio",
        "Description": "",
        "Category": "",
        "Publisher": "HBJ Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Am I getting paid for this?: A romance about work",
        "Authors": "By Rollin, Betty",
        "Description": "",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Chili Madness: A Passionate Cookbook",
        "Authors": "By Butel, Jane",
        "Description": "Beloved chili. Passionate chili. Hot chili . . . and not just because of the chiles. Chili, the star of cook-offs, the obsession of societies, and the subject of endless debate over its proper preparation. Has there ever been a better time to be a chili head? A well-stocked supermarket today carries a variety of fresh and dried chiles, fresh cilantro, myriad dried and canned beans, chipotle powder, and all the makings for sides and salsas, from tortillas in the refrigerator case to organic avocados. Jane Butel's Chili Madness has been praised as \"an elegant celebration\" (Travel + Leisure) that \"chile lovers will love\" (New York Post), it's the spicy bestseller with over 330,000 copies in print. Extensively revised, updated, and expanded, the book will fire up a whole new generation of chili fanatics. Of the 160-plus recipes, more than 130 are brand-new. Here are classics, including Reno Red and Navajo Green and Buzzard’s Breath Chili, as well as newfangled bowls like Moroccan Chili and White Lobster Chili. To accompany the main event are savory breads (Bacon Crumble Cornbread); tempting sidekicks (Hot ’n’ Spicy Okra, Red Hot Sweet Potato Lace); fire-taming salads (Crispy Cilantro Coleslaw); and margaritas, of course. (Six kinds!) Luscious desserts such as Double Chocolate Farmer’s Cakes provide the perfect sweet ending, while chili leftovers are reinvented in crowd-pleasers like Texas-Style Burritos.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Workman Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The FBI in our Open Society",
        "Authors": "By Overstreet, Harry Allen, Overstreet, Bonaro W.",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Dead Sea Scrolls After Forty Years (Symposium at the Smithsonian Institution, Oct. 27, 1990)",
        "Authors": "By P. Kyle McCarter Jr., James A. Sanders, Hershel Shanks, James C. Vanderkam",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Biblical Archaeology Society",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Triumph on Everest: A Photobiography of Sir Edmund Hillary",
        "Authors": "By Coburn, Broughton",
        "Description": "This exciting photobiography celebrates the extraordinary life of the New Zealand farm boy who in May 1953 became the first person known to have reached the summit of Mount Everest. With climbing partner Tenzing Norgay, the iron-willed Hillary crossed deadly icefalls, clawed his way up vertical walls, and persevered through gale-force winds until he finally stood at the top of the world. Along with this gripping adventure, readers follow the explorer’s trek to the South Pole, his quest to find the Abominable Snowman, and his continuing efforts to help the Sherpa people, without whom, Hillary is convinced, he never would have scaled Everest.",
        "Category": " Young Adult Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "National Geographic Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "National Geographic Photography Field Guides: Landscapes",
        "Authors": "By Caputo, Robert",
        "Description": "When is the right moment to snap a sunset? Landscapes, the first in the new, information-packed National Geographic Photography Field Guide series, supplies the answer to this question and much more as readers discover the secrets that have made National Geographic photography so well known. In Landscapes, readers will learn how to compose and photograph the lay of the land at its breathtaking best, whether it?s the Grand Canyon or a backyard garden. Filled with easy-to-understand instructions from an accomplished National Geographic photographer, this guide will be accompanied by specialized volumes on wildlife, black and white, digital, adventure photography, and more. With the National Geographic Photography Field Guide series, novice to professional photographers will take the best pictures of their lives.",
        "Category": " Photography , Techniques , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "My First Pocket Guide Seashore Life (National Geographic My First Pocket Guides)",
        "Authors": "By Kinghorn, Jenna",
        "Description": "Sparkling photographs, realistic illustrations, and concise text provide fun facts about seashore life, both in the ocean and on the beach, examining the sea horse, octopus, crab, sea birds, and many other engaging creatures. Original.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Water (Oceans, Lakes, etc.)",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Soul of Politics: A Practical and Prophetic Vision for Change",
        "Authors": "By Wallis, Jim",
        "Description": "Jim Wallis’s classic The Soul of Politics, originally published by The New Press in 1994 and now available in a new hardcover edition, has sold 60,000 copies to date and has been widely praised for its prescience and passion. In fact, no issue has become more topical or polarizing in the United States than the intersection of religion and politics, with the country seemingly irreconcilably split between the “religious right” and the “secular left.”In this “dynamic, hopeful” (The Nation) book, Wallis, the nationally known activist, preacher, and editor of Sojourners magazine, shows why both the traditional liberal and conservative visions are inadequate to the challenge before us, and outlines instead a new political morality combining social justice with individual responsibility. Arguing that we need to look beyond the traditional corridors of power to find the resources for a political movement that will foster true democracy—emphasizing compassion, community, racial reconciliation, gender equality, justice, imagination, and joy—The Soul of Politics “speaks to how all Americans—not just churchgoers—need to take personal responsibility for change rather than rely on politicians” (Cleveland Plain Dealer).",
        "Category": " Political Science , Political Ideologies , General",
        "Publisher": "The New Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Theology of the Hammer",
        "Authors": "By Fuller, Millard",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Smyth & Helwys Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The Romantic Comedians",
        "Authors": "By Glasgow, Ellen",
        "Description": "In The Romantic Comedians Ellen Glasgow takes the familiar story of the cuckold and raises it to a new leve. Her sixty-five-year-old male protagonist, the recently widowed Judge Gamaliel Honeywell, falls in love with and marries an impulsive twenty-three-year-old woman, emblem of the 1920s. As the symbol of patriarchy, the Judge espouses all of the chivalrous myths about women, insisting that older women are not interested in love, that a man is only as old as his instincts, and that some young women prefer old lovers to young ones. His sheltered mind allows these dillusions about women as it allows him to delude himself.",
        "Category": " Fiction , Romance , General",
        "Publisher": "University of Virginia Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Faith's Fundamentals Creative Groups Guide",
        "Authors": "By Cottrell, Jack W.",
        "Description": "",
        "Category": "",
        "Publisher": "Standard Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "U.S. Lifestyles and Mainline Churches: A Key to Reaching People in the 90's",
        "Authors": "By Sample, Tex",
        "Description": "",
        "Category": " Religion , Christian Ministry , Evangelism",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Warner Collector's Guide to American Quilts (The Warner collector's guides)",
        "Authors": "By Haders, Phyllis",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "Natural Prescriptions for Women: What to Do-and When to Do It-to Solve Dozens of Female Health Problems-Without Drugs",
        "Authors": "By For Women~Prevention Magazine",
        "Description": "Traditionally, doctors don't issue prescriptions for herbs, exercise, nutrition, yoga, or massage. But what if they did? The answer can be found in Natural Prescriptions for Women, a self-care manual of non-drug prescriptions for more than 100 health problems plaguing women today.  Natural Prescriptions for Women seriously addresses the health problems that concern women most in today's stress-filled environment. In addition to these physical concerns, this book also treats women holistically, tackling such non-medical concerns as single parenting, making time for exercise, caring for older parents, and much more. This valuable manual truly belongs on every woman's bookshelf.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Entertainment 1998 Year Book",
        "Authors": "By Entertainment Weekly, Inc. (EDT)",
        "Description": "Celebrates the most popular and accomplished musicians, actors, and professional celebrities of the year, and includes a best and worst list of movies, television programs, music, and books.",
        "Category": " Performing Arts , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Cook It Light Desserts",
        "Authors": "By Jones, Jeanne",
        "Description": "A new entry in a popular series that helps cooks to reduce the fat, sodium, calories, and cholesterol in dishes while maintaining flavor offers more than two hundred dessert recipes, from puddings to souffles, that offer delicious and guilt-free delight.",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The children of Frankenstein;: A primer on modern technology and human values",
        "Authors": "By Muller, Herbert Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "Indiana University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "No Red Meat",
        "Authors": "By Shriver, Brenda and Tinsley, Ann",
        "Description": "Approximately 80 million Americans suffer from one or more forms of cardiovascular disease, the country’s number one killer. A healthy diet is critical in preventing and managing this epidemic. This volume, updated to include new low-fat, low-cholesterol recipes, is a complete cookbook and dietary guide for anyone concerned with improving their health. Specifically targeted to those on special diets for reducing risk of heart attack, stroke, and obesity. And each recipe includes per-serving dietary content?for easy daily control of calories, fat, cholesterol, and sodium. Recipes are low in sodium and include seasoning suggestions for adding flavor to salt-free foods. With informational charts on fish and poultry, menu ideas, and many other helpful hints.",
        "Category": " Cooking , Reference",
        "Publisher": "Running Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "When You Eat at the Refrigerator, Pull Up a Chair: 50 Ways to Feel Thin, Gorgeous, and Happy (When You Feel Anything But)",
        "Authors": "By Roth, Geneen",
        "Description": "A witty and compassionate guide to weight control offers fifty practical chapters on ways to break the vicious cycle of dieting and recrimination and to overcome negative feelings about oneself and one's image. 75,000 first printing. Tour.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Simca's Cuisine",
        "Authors": "By Beck, Simone and Simon, Patricia",
        "Description": "Presents recipes and preparation guidelines for the creation of gourmet, French dishes, and menus suitable for casual, formal, and special occasions",
        "Category": " Cooking , General",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "December",
            "Year": "1972"
        }
    },
    {
        "Title": "The Hustons",
        "Authors": "By Grobel, Lawrence",
        "Description": "Chronicles the stellar accomplishments of one of America's greatest dramatic families, from Walter Huston's vaudeville roots to John Huston's final film, \"The Dead\"",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Scribner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Clinical Work with Children",
        "Authors": "By Mishne, Judith Marks",
        "Description": "",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "A Different World: Stories of Great Hotels",
        "Authors": "By Matthew, Christopher",
        "Description": "",
        "Category": "",
        "Publisher": "Paddington Press",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Simple Abundance: A Daybook of Comfort of Joy",
        "Authors": "By Ban Breathnach, Sarah",
        "Description": "With the grace of Anne Morrow Lindbergh's Gift from the Sea and the wisdom of M. Scott Peck's The Road Less Traveled, Simple Abundance is a book of 366 evocative essays-one for every day of your year-written for women who wish to live by their own lights. In the past a woman's spirituality has been separated from her lifestyle. Simple Abundance shows you how your daily life can be an expression of your authentic self ... as you choose the tastiest vegetables from your garden, search for treasures at flea markets, establish a sacred space in your home for meditation, and follow the rhythm of the seasons and the year. Here, for the first time, the mystical alchemy of style and Spirit is celebrated. Every day, your own true path leads you to a happier, more fulfilling and contented way of life-the state of grace known as... Embrace its gentle lessons, savor its sublime common sense, dare to live its passionate truth, and share its extraordinary and exhilarating gift with every woman you encounter: the authentic self is the Soul made visible.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Between Sisters: Secret Rivals, Intimate Friends",
        "Authors": "By Mathias, Barbara",
        "Description": "Sisters. They are the best of friends, the worst of friends. They can be as bullying as a big brother or as loving as the most endearing mother. They can be so alike in personality and style you can't tell them apart, or so totally opposite that you'd swear they came from different families. Yet, whatever their disparities, they are inextricably bound by their female gender.In this groundbreaking book, Barbara Mathias, herself a sister to six siblings, brings both professional and personal insight into the sister connection. Using colorful stories from real lives as well as interviews with experts in the fields of psychology, family relations, and women's studies, Barbara Mathias illustrates the dynamics of a crucial relationship that has not been given the attention it deserves.Guiding the reader through the maze and mystery of familial sisterhood, Mathias explores the wide range of intricate emotions...of jealousy, fury, and painful guilt...and of closeness, respect, and compatibility...of the diversity and the similarity between women who, no matter what their circumstances, are indelibly joined.Between Sisters is a revealing study of one of the most significant relationships in a woman's life. Whether good or bad, loving or estranged, this complex connection exerts a lasting and powerful influence on every sister. Its invisible pull affects the way a woman raises a family, relates to her husband and her friends, and how she functions in her career.With the understanding gained from this revealing book, you will not only change the way you see your sister and yourself, but find new value in the instinctual bond that links you.",
        "Category": " Psychology , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Learn to Relax : A Practical Guide to Easing Tension and Conquering Stress",
        "Authors": "By George, Mike",
        "Description": "We all need to relax. If only it were as easy as it sounds! Now, with this beautifully illustrated and practical volume, anyone can learn to let go. Offering almost 30 ingenious and easy-to-do exercises tailor-made for busy people, plus original illustrations to aid visualization and a friendly text that's low on jargon, Learn to Relax presents effective ways to ease tension at work, at home, or on the road. Stress counselor Mike George suggests simple techniques for breathing, massage, anxiety control, time management, sleep enrichment, detachment, and meditation, all designed to calm the mind. Drawn from both Eastern and Western traditions, this book's easy yet highly effective strategies reveal how we can put problems in perspective, deepen self-awareness, and celebrate the positive in life. Practical and inspirational in the style of Teach Yourself to Dream, Learn to Relax is the only accessible illustrated relaxation book on the market -- and an indispensable guide for anyone who wants to rediscover the essential art of relaxation.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Bipolar Disorder: Treatment & Management",
        "Authors": "By Suppes, Trisha, M.D., Ph.D. and Keck, Paul E., Jr., M.D.",
        "Description": "",
        "Category": " Psychology , Mental Health",
        "Publisher": "Jones & Bartlett Learning",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Tales of the City, Vol. 1",
        "Authors": "By Maupin, Armistead",
        "Description": "For almost four decades Armistead Maupin’s Tales of the City has blazed its own trail through popular culture—from a groundbreaking newspaper serial to a classic novel, to a television event that entranced millions around the world. The first of nine novels about the denizens of the mythic apartment house at 28 Barbary Lane, Tales is both a sparkling comedy of manners and an indelible portrait of an era that changed forever the way we live.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "How a Man Ages",
        "Authors": "By Pesmen, Curtis",
        "Description": "A study of the physical process of maturation discusses the impact of aging on the heart, brain, skin, eyesight, and other body organs and functions and explains how to cope with the effects of aging",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    }
]