[
    {
        "Title": "Colonel (Dirigent Mercenary Corps)",
        "Authors": "By Shelley, Rick",
        "Description": "A legendary warrior in the Dirigent Mercenary Corps, Colonel Lon Nolan is ready to distance himself from a world of war and death, until he discovers that the chancellor of Elysium is coming to Dirigent, hoping to enlist the aid of the DMC against the marauding mercenaries of New Sparta. Original.",
        "Category": " Fiction , Science Fiction , Adventure",
        "Publisher": "Ace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "My Heart Stood Still (Macleod Family)",
        "Authors": "By Kurland, Lynn",
        "Description": "New York Times bestselling author Lynn Kurland captures the haunting beauty of England—past and present—and the exquisite tenderness of timeless love in this novel in the MacLeod series...In a bleak, landlocked keep on the English moors, Iolanthe MacLeod dreams of the sea—and of a darkly handsome man to come rescue her. Centuries have passed and she feels she has waited in vain...until now.Thomas McKinnon is used to attaining impossible heights, both in business and in the mountains he loves. But when the chance to restore a twelfth century castle comes his way, he gamely takes hammer in hand and crosses the Atlantic, expecting to find nothing more interesting inside his new home than cobwebs and weeds.But in that ancient, crumbling castle, the fierce, restless spirit of a medieval Scottish woman lives on—a woman so haunting that he would do anything, go anywhere, risk everything to make her his forever...",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "On the Edge (Hqn Romance)",
        "Authors": "By Britton, Pamela",
        "Description": "Unknown NASCAR driver Adam Drake has some of the best moves Rebecca Newman has ever seen, both on and off the track.But she can't afford to feel anything but respect for the new driver she's hired to pilot her race car. With the financial security of her team hanging in the balance and everyone in the series thinking she's nuts, the last thing she needs is lust getting in the way of logic. Too bad Adam has other ideas.Adam isn't afraid of a challenge, but getting close to his new owner is proving to be a tougher road than some of the superspeedways he's driven. It's going to take a secret weapon—his daughter. Soon his precocious ten-year-old has Rebecca on the run—straight into Adam's arms. But can he convince her to stay with him, and leave behind the ghosts of her past once and for all?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Unexpected Son  (Hometown Reunion)",
        "Authors": "By Carroll, Marisa",
        "Description": "When a compelling stranger comes to the town of Tyler, newly widowed Reverend Sarah risks her place at the head of the pulpit to befriend him and is torn when he asks her to provide him with a scandalous alibi. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Millers' Pocket Dictionary of Antiques",
        "Authors": "By Miller, Judith (EDT) and Miller, Martin (EDT)",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Take Me Tonight (The Bullet Catchers, Book 3)",
        "Authors": "By St. Claire, Roxanne",
        "Description": "What do thrill-seeking women want?   A fantasy-fulfilling abduction...an exciting rescue by a scorching hot guy...with an unforgettable night of passion. So they go to www.takemetonite.com -- and then they die.   Someone has to stop it.   When Sage Valentine discovers that her roommate's shocking suicide might be related to a website that provides edgy, thrill-seeking entertainment, she immediately books her own \"abduction\" to get some answers. But her \"rescuer\" isn't really who she thinks he is....Johnny Christiano is dedicated to the Bullet Catchers, who saved him from a wise guy's life of crime and turned him into an elite bodyguard. When he's assigned to stop Sage's kidnapping, he's unexpectedly trapped between deceit and sizzling desire. But the closer Johnny and Sage get to the truth, the closer danger stalks them...until death is only a double-click away.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Danger at the Fair",
        "Authors": "By Kehret, Peg",
        "Description": "Ellen and Corey Streater continue their adventures at a county fair, where, while chasing a pickpocket, they wander into the River of Fear ride and find that they are the ones being pursued. Reprint.",
        "Category": "",
        "Publisher": "Pocket Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Mark (A Henry Parker Novel, 1)",
        "Authors": "By Pinter, Jason",
        "Description": "Right as I'm about to die, I realize all the mythsare fake. There's no white light at the end of atunnel. My life isn't flashing before my eyes.All I can think about is how much I want to live. I moved to New York City a month ago to become the bestjournalist the world had ever seen. To find the greatest storiesnever told. And now here I am—Henry Parker, twenty-fouryears old and weary beyond rational thought, a bullet onetrigger pull from ending my life.I can't run. Running is all Amanda and I have done for thepast seventy-two hours. And I'm tired. Tired of knowing thetruth and not being able to tell it. Five minutes ago I thought I had the story all figured out.I knew that both of these men—one an FBI agent, the otheran assassin—wanted me dead, but for very different reasons. If I die tonight—more people will die tomorrow.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Mira",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Lord of the Wolves (Vikings)",
        "Authors": "By Graham, Heather",
        "Description": "SHE IS A HEROINE OF HER PEOPLE. . . .    With her extraordinary violet eyes, ebony hair, and ivory skin, the French countess Melisande was a prize for any man. But it was Conar MacAuliffe, a young warrior who rode into battle to defend her people, who made Melisande his bride—and then disappeared for years. Now MacAuliffe has returned to claim his wife, a ravishing woman determined to fight for her freedom at all costs. But the proud beauty who fears no man suddenly fears herself—and the passionate embrace of the husband who vows never to let her go.   HE IS THE MIGHTY VIKING CONQUEROR THEY CALLED . . .    Lord of the Wolves, a legendary warrior whose greatest challenge will come with the woman he is destined to wed. In the fiery Melisande he will find his heaven and hell. Even as he wages war for her heart, he dares not yield his own. Even as he lays sweet seductive siege to her body, he tries to shield his soul. It will take a common enemy and a little trust to awaken them both to a love that can change their lives forever.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Autumn Lover (Only Series)",
        "Authors": "By Lowell, Elizabeth",
        "Description": "Returning to her Nevada ranch at the Civil War’s end, Elyssa Sutton finds it picked bare by scavengers and coveted by determined men. Yet the proud young woman vows never again to abandon her Ruby Mountain home—though it  means enlisting the aid of a dark and dangerous stranger who lives for revenge alone.Hunter Maxwell has suffered from the savagery of outlaws and the faithlessness of a woman. And he will trust nofemale—nor will he rest until the raiders who destroyed his family pay for their crimes.A woman in need and a man in painmust stand as one to fight for something cherished,something lost. And in the brisk chill of autumn,ravaged hearts will be reborn.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2012"
        }
    },
    {
        "Title": "Black Rainbow",
        "Authors": "By Michaels, Barbara",
        "Description": "In love with her employer, Edmund Mandeville, Megan O'Neill, a young governess, battles evil, supernatural powers from the past, as well as the conventions of nineteenth-century England, to find happiness",
        "Category": " Fiction , Romance , Gothic",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "World Book of Interesting Facts",
        "Authors": "By World Book Encyclopedia Editors",
        "Description": "",
        "Category": "",
        "Publisher": "World Book Childcraft International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "What Every Sunday School Teacher Should Know: 24 Secrets That Can Help You Change Lives",
        "Authors": "By Towns, Elmer L.",
        "Description": "Sharing God's Word with children can be the most spiritually satisfying experience of your life. But if you've never taught kids before the prospect can be terrifying! Let Elmer Towns put your fears to rest as you read through 24 \"bite-sized\" topics covering everything from motivation to gifting to teaching methods! This easy-to-read book will inspire Sunday School teachers - new and experienced - to embrace with joy their important role of teaching children of all ages about God's amazing love.",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "An Acceptable Time (Time Quartet, Bk. 5)",
        "Authors": "By L'Engle, Madeleine",
        "Description": "A flash of lightning, quivering ground, and, instead of her grandparents' farm, Polly sees mist and jagged mountains -- and coming toward her, a group of young men carrying spears.Why has a time gate opened and dropped Polly into a world that existed 3,000 years ago? Will she be able to get back to the present before the time gate closes -- and leaves her to face a group of people who believe in human sacrifice?This Commemorative Edition includes a new introduction by the Author.",
        "Category": "",
        "Publisher": "Dell Laurel Leaf paperback",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "How to Murder a Millionaire (Blackbird Sisters Mysteries, No. 1)",
        "Authors": "By Martin, Nancy",
        "Description": "Nora Blackbird, society columnist and down-and-almost-out former debutante, reclaims her place within Philadelphia's elite when she stumbles upon the murdered body of a millionaire art collector.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Code Name: Baby",
        "Authors": "By Skye, Christina",
        "Description": "Federal agent Wolfe Houston is assigned the task of protecting civilian dog trainer Kit O'Halloran and her four biologically enhanced puppies from a legion of deadly mercenaries that want to get their hands on the powerful pups, forcing them all to go on the run. Original.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "HQN Books",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "This Year It Will Be Different, and other stories",
        "Authors": "By Binchy, Maeve",
        "Description": "From the New York Times bestselling author of Circle of Friends, The Glass Lake, and Evening Class comes a stunning collection of fifteen Christmas stories filled with Maeve Binchy's trademark wit, charm, and sheer storytelling genius.  In \"A Typical Irish Christmas,\" a grieving widower heads for a holiday in Ireland and finds an unexpected destination not just for himself, but for a father and daughter in crisis. . . .  In \"Pulling Together,\" a teacher not yet out of her twenties sees her affair with a married man at a turning point as Christmas Eve approaches. . . .  And in the title story, \"This Year It Will Be Different,\" a woman with a complacent husband and grown children enters a season that will forever alter her life, and theirs. . . These stories, and a dozen more, powerfully evoke many lives--from step-families grappling with exes to children caught in grown-up tugs-of-war--during the one holiday when feelings cannot be easily hidden.  The time of year may be magical, imbued with meaning.  But the situations are timeless.  And Maeve Binchy makes us care about them all.",
        "Category": " Fiction , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Sophie's World",
        "Authors": "By Gaarder, Jostein and Moller, Paulette (TRN)",
        "Description": "Discovering two thought-provoking philosophical questions in her mailbox, Sophie enrolls in a correspondence course with a mysterious philosopher and begins to receive some equally unusual letters. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Affair: A Novel",
        "Authors": "By Quick, Amanda",
        "Description": "Charlotte Arkendale knew all there was to know about men. After all, she'd made a career out of steering marriage-minded women away from untrustworthy members of the opposite sex.Yet nothing could have prepared her for Baxter St. Ives--an arresting stranger too daring, too determined, too dangerous to be her new man-of-affairs. Still, perhaps he was the perfect person to help Charlotte investigate the recent murder of one of her clients. So she gave him a chance, never realizing that Baxter, a gifted scientist, would soon conduct a risky exploration into the alchemy of desire, with Charlotte as his subject.But even as he sets out to seduce Charlotte, a twisted killer lies in wait, ready to part the lovers...or see them joined together forever--in death.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Make the Connection: Ten Steps to a Better Body and a Better Life",
        "Authors": "By Greene, Bob and Winfrey, Oprah",
        "Description": "The #1 national bestseller that helped millions to get fit for life--finally in paperback! Revealing her often heartbreaking, life-long struggle with excess weight, Oprah tells of her fortuitous meeting with Bob Greene, who helped her change her life by creating a diet and exercise program that worked for her. Color photos.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Kiss an Angel",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "Pretty, flighty Daisy Devreaux can either go to jail or marry the mystery man her father has chosen for her. Arranged marriages don't happen in the modern world, so how did the irrepressible Daisy find herself in this fix?Alex Markov, as humorless as he is deadly handsome, has no intention of playing the loving bridegroom to a spoiled little feather-head with champagne tastes. He drags Daisy from her uptown life to a broken down traveling circus and sets out to tame her to his ways.But this man without a soul has met his match in a woman who's nothing but heart. Before long, passion will send them flying sky high without a safety net... risking it all in search of a love that will last forever.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Peterson Field Guides to Eastern Birds, 4th Edition",
        "Authors": "By Roger Tory Peterson Institute",
        "Description": "",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Don't Panic - Dinner's in the Freezer: Great-Tasting Meals You Can Make Ahead",
        "Authors": "By Martinez, Susie, Howell, Vanda, and Garcia, Bonnie",
        "Description": "Hectic lifestyles and over-full schedules make traditional cooking methods nearly obsolete in many families. The results are poor nutrition and budgets strained by the high cost of fast food or commercially prepared meals. Don't Panic-Dinner's in the Freezer offers a simple and economical alternative, featuring dozens of recipes designed to be prepared and frozen for future use.With over 23,000 copies sold in its original self-published edition, this book gives practical tips for planning, organizing, and shopping for meals, as well as unique ways to freeze and reheat prepared foods. Every recipe includes measurements for cooking alone or as a joint venture with one or two friends. Families, singles, retirees-everyone who needs to eat-will find fast and easy answers to the question, \"What's for dinner?\"",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Portable Greek Historians",
        "Authors": "By Finley, M. I",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1960"
        }
    },
    {
        "Title": "Tree of Smoke: A Novel",
        "Authors": "By Johnson, Denis",
        "Description": "Once upon a time there was a war . . . and a young American who thought of himself as the Quiet American and the Ugly American, and who wished to be neither, who wanted instead to be the Wise American, or the Good American, but who eventually came to witness himself as the Real American and finally as simply the Fucking American. That’s me.This is the story of Skip Sands—spy-in-training, engaged in Psychological Operations against the Vietcong—and the disasters that befall him thanks to his famous uncle, a war hero known in intelligence circles simply as the Colonel. This is also the story of the Houston brothers, Bill and James, young men who drift out of the Arizona desert into a war in which the line between disinformation and delusion has blurred away. In its vision of human folly, and its gritty, sympathetic portraits of men and women desperate for an end to their loneliness, whether in sex or death or by the grace of God, this is a story like nothing in our literature.Tree of Smoke is Denis Johnson’s first full-length novel in nine years, and his most gripping, beautiful, and powerful work to date.Tree of Smoke is the 2007 National Book Award Winner for Fiction.",
        "Category": " Fiction , War & Military",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Book of Dragons",
        "Authors": "By Nesbit, Edith",
        "Description": "",
        "Category": "",
        "Publisher": "Bridgewater Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Checking for Understanding: Formative Assessment Techniques for Your Classroom (Professional Development)",
        "Authors": "By Fisher, Douglas and Frey, Nancy",
        "Description": "Fisher (language and literacy education, San Diego U.) and Frey (literacy, San Diego State U.) outline how to increase students' understanding of material through creative formative assessments, such as using oral language, questions, interactive writing, projects and performances, tests, and common assessments and consensus scoring. Examples by students are given. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Classroom Management",
        "Publisher": "Association for Supervision & Curriculum Development",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "New Webster's Dictionary of English Languages",
        "Authors": "By Lexicon, Pubn Inc",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Educational Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Rip Van Winkle Coloring Book (Dover Classic Stories Coloring Book)",
        "Authors": "By Irving, Washington",
        "Description": "Here, along with the complete text of this classic story are 30 Rackham illustrations rendered for coloring. Children can make their first thrilling acquaintance with the story as they color. Students and admirers of Irving and Rackham will enjoy the elfish portrayals of henpecked Rip and shrewish Dame Van Winkle.",
        "Category": " Juvenile Fiction , Activity Books",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "The Chocolate Touch",
        "Authors": "By Catling, Patrick Skene",
        "Description": "Recounts the trials and tribulations of a greedy boy's predicament when everything he touches turns to chocolate.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Granny Squares-Nanny Squares: New Twists for Classic Crochet",
        "Authors": "By Margaret Allen Northern",
        "Description": "",
        "Category": " Crafts & Hobbies , Needlework , Crocheting",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "EMBRACE AND CONQUER",
        "Authors": "By Jennifer Blake",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Columbine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "Vendetta (The Sisterhood, No.3)",
        "Authors": "By Michaels, Fern",
        "Description": "Once upon a time there were seven very different women who had been broken but not beaten by life. In those tough days of healing, they became the Sisterhood, a group of devoted friends who vowed to change their lives, empower themselves, and be there for each other, no matter what. Now, they're ready to answer the call for the woman who started it all, Myra Rutledge. Five years ago, Myra's pregnant daughter was killed by a hit-and-run driver--the playboy son of an ambassador with diplomatic immunity. Myra was left to grieve while the murderer was free to return to his lavish lifestyle with no fear of ever having to pay for his crime. But not for much longer. As the air turns crisp the Virginia hills around Myra's lovely old farmhouse, the Sisterhood has gathered for a little creative planning, and what they have in mind is a gift for Myra of long-awaited and very sweet revenge.  .  .\"Revenge is a dish best served with cloth napkins and floral centerpieces.  .  .fast-paced.  .  .puts poetic justice first.\"--Publishers Weekly",
        "Category": " Fiction , Romance , Action & Adventure",
        "Publisher": "Zebra Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Scrap Saver's Gift Stitchery",
        "Authors": "By Foose, Sandra Lounsbury",
        "Description": "",
        "Category": "",
        "Publisher": "Sedgewood Press",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Healthy Heart One-Dish Meals (Today's Gourmet)",
        "Authors": "By Chappell, Anne C. (EDT), Wyatt, Nancy Fitzpatrick (EDT), Lowery, Deborah Garrison (EDT), Oxmoor House (COR), and Cain, Anne Chappell (EDT)",
        "Description": "Features recipes for pasta, soups and stews, chili, pizza, and main courses that are low in salt and fat, contain all the food groups, and are easy to prepare",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Southern Living Healthy Hearty Cookbook",
        "Authors": "By Living, Southern",
        "Description": "",
        "Category": "",
        "Publisher": "Southern Living Books",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Taste of Home Recipe Book",
        "Authors": "By",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Country Store Reiman Pubs",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Survive on $50,000 to $150,000 a Year",
        "Authors": "By Cohen, Stanley J. and Wool, Robert",
        "Description": "A certified financial planner and the co-author of the best-seller \"All You Need to Know about the IRS\" explain how to take advantage of forces including taxation, inflation, and interest rates and details personal tailored techniques of money management",
        "Category": " Business & Economics , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Never Hit a Ghost With a Baseball Bat",
        "Authors": "By Clifford, Eth and Hughes, George (ILT)",
        "Description": "While exploring a trolley car museum, eleven-year-old Mary Rose and her younger sister Jo-Beth encounter voices from nowhere and other strange events that make them think the museum is haunted.",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "President Is at Camp David",
        "Authors": "By Nelson, W. Dale",
        "Description": "The presidential retreat, Camp David, has become synonymous with the US image of political power at its highest level.   Nelson offers a glimpse into the place and the men who spent time there from Roosevelt to Bush, detailing ephemera and gossip as well as more significant events such as meetings between Kennedy and Eisenhower after the Bay of Pigs, and Carter's sponsoring of negotiations between Begin and Sadat.  Includes photographs to round out a wealth of interesting historical research. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Syracuse University Press",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Wages of Sin",
        "Authors": "By Greeley, Andrew M.",
        "Description": "Tycoon, sculptor, war hero, poet--Chicago entrepreneur Lorcan James Flynn cannot enjoy his wealth or talents until the return of his first love sparks a memory that causes him to face the truth about himself. 50,000 first printing. $35,000 ad/promo.",
        "Category": " Fiction , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Advanced Selling Strategies: The Proven System of Sales Ideas, Methods, and Techniques Used by Top Salespeople",
        "Authors": "By Tracy, Brian",
        "Description": "Offering winning techniques for spectacular sales results, the creator of The Psychology of Selling shows readers how to conquer fears, read customers, plan strategically, focus efforts on key emotional elements, and close every sale. 30,000 first printing.",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Commandos and Rangers of World War II",
        "Authors": "By Ladd, James D.",
        "Description": "Shows how elite behind-the-lines shock troops used their special skills and weapons in beach reconnaissances, sabotage raids, and spearhead invasions that led the Allies to victory",
        "Category": " History , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "Gallery of Best Resumes: A Collection of Quality Resumes by Professional Resume Writers",
        "Authors": "By Noble, David F.",
        "Description": "A showcase collection offers more than 150 outstanding sample resumes and 30 cover letters representing the very best creations of professional resume writers. Original.",
        "Category": " Business & Economics , Careers , Resumes",
        "Publisher": "Jist Works",
        "Price Starting With ($)": "6.39",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The New Bill James Historical Baseball Abstract",
        "Authors": "By James, Bill",
        "Description": "When Bill James published his original Historical Baseball Abstract in 1985, he produced an immediate classic, hailed by the Chicago Tribune as the “holy book of baseball.” Now, baseball's beloved “Sultan of Stats” (The Boston Globe) is back with a fully revised and updated edition for the new millennium.Like the original, The New Bill James Historical Baseball Abstract is really several books in one. The Game provides a century's worth of American baseball history, told one decade at a time, with energetic facts and figures about How, Where, and by Whom the game was played. In The Players, you'll find listings of the top 100 players at each position in the major leagues, along with James's signature stats-based ratings method called “Win Shares,” a way of quantifying individual performance and calculating the offensive and defensive contributions of catchers, pitchers, infielders, and outfielders. And there's more: the Reference section covers Win Shares for each season and each player, and even offers a Win Share team comparison. A must-have for baseball fans and historians alike, The New Bill James Historical Baseball Abstract is as essential, entertaining, and enlightening as the sport itself.",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "Free Press",
        "Price Starting With ($)": "6.74",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Cider House Rules",
        "Authors": "By Irving, John",
        "Description": "\"AN OLD-FASHIONED, BIG-HEARTED NOVEL . . . with its epic yearning caught in the 19th century, somewhere between Trollope and Twain . . . The rich detail makes for vintage Irving.\"--The Boston Sunday Globe\"The Cider House Rules is filled with people to love and to feel for. . . . The characters in John Irving's novel break all the rules, and yet they remain noble and free-spirited. Victims of tragedy, violence, and injustice, their lives seem more interesting and full of thought-provoking dilemmas than the lives of many real people.\"--The Houston Post\"John Irving's sixth and best novel . . . He is among the very best storytellers at work today. At the base of Irving's own moral concerns is a rare and lasting regard for human kindness.\"--The Philadelphia Inquirer\"Entertaining and affecting . . . John Irving is the most relentlessly inventive writer around. He proliferates colorful incidents and crotchets of character. . . . A truly astounding amount of artistry and ingenuity.\"--The San Diego Union",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Essential Writer's Companion: A Concise Guide to Writing Effectively for School, Home, or Office",
        "Authors": "By Whiteley, Sandra (EDT)",
        "Description": "The Essential Writer's Companion is a complete guide to effective communication. It contains basic information on spelling, punctuation, word formation, style, grammar, and proofreading - all organized clearly and accessibly. Learn how to construct persuasive sentences and paragraphs to ensure that your written work is to the point and forceful throughout. Special sections on writing papers and reports and on doing research in the library round out this indispensable volume for school, home, or office.",
        "Category": " Reference , Writing Skills",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Winnie the Pooh",
        "Authors": "By Milne, A.A.",
        "Description": "When Edward Bear joins Christopher Robin in many forest adventures he earns the name Winnie-the-Pooh",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Rainbow's End: A Richard Jury Mystery (Richard Jury Mysteries)",
        "Authors": "By Grimes, Martha and Ferraro, Clare (EDT)",
        "Description": "\"Once again, Grimes hooks her readers with the engaging Jury and friends and with skillful tucking of hints into unexpected corners.\"--Publishers Weekly (starred review)When three women die of \"natural causes\" in London and the West Country, there appears to be no connection--or reason to suspect foul play. But Scotland Yard Superintendent Richard Jury has other ideas, and before long he's following his keen police instincts all the way to Santa Fe, New Mexico.There, in the company of a brooding thirteen-year-old girl and her pet coyote, he mingles with an odd assortment of characters and tangles with a twisted plot that stretches from England to the American Southwest. And while his good friend Melrose Plant pursues inquiries in London, Jury delves deeper into the more baffling elements of the case, discovering firsthand what the guide books don't tell you: that the Land of Enchantment is also a landscape ripe with tragedy, treachery, and murder.\"RAINBOW'S END is itself a literary rainbow. It's the skillful blend of mystery and comedy and pathos, a Martha Grimes trademark, that makes this visit with Richard Jury and company so memorable and satisfying.\"--Mostly Murder",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Emotional Phases of a Woman's Life",
        "Authors": "By Lush, Jean",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The Inheritor",
        "Authors": "By Bradley, Marion Zimmer",
        "Description": "The Inheritor is the story of a reluctant psychic who is trapped, very much against her will, in a battle with the forces of darkness. Leslie Barnes has just bought her first home, overlooking San Francisco's Golden Gate Bridge. It seems to be the perfect place for Leslie and her sister, a brilliant young musician, but as soon as they move in, a plague of sinister events begins, unsettling both women. To her horror, Leslie realizes that she is living in a vortex of magickal power. She must become the guardian of that power and protect it from those who seek to use it for evil. Trained as a psychologist, Leslie is in over her head when dealing with the occult - until she meets Clair Moffatt, a charming medium, and Claire's mentor, Colin MacLaren, world-famous psychic investigator. Together they stand against evil and enable Leslie to claim her full inheritance.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Solution Selling: Creating Buyers in Difficult Selling Markets",
        "Authors": "By Bosworth, Michael T.",
        "Description": "``Solution Selling is the most comprehensive sales and sales management process available today. Mike Bosworth has the best understanding of sales process in corporate America.''Jeffrey M. Fisher, Vice President, Symix Computer Systems.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Sunday Wife",
        "Authors": "By King, Cassandra",
        "Description": "Married for 20 years to the Reverend Benjamin Lynch, a handsome, ambitious minister of the prestigious Methodist church, Dean Lynch has never quite adjusted her temperament to the demands of the role of a Sunday wife. When her husband is assigned to a larger and more demanding community in the Florida panhandle, Dean becomes fast friends with Augusta Holderfield, a woman whose good looks and extravagant habits immediately entrance her. As their friendship evolves, Augusta challenges Dean to break free from her traditional role as the preacher's wife. Just as Dean is questioning everything she has always valued, a tragedy occurs, providing the catalyst for change in ways she never could have imagined.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Cold Harbour (Dougal Munro & Jack Carter)",
        "Authors": "By Higgins, Jack",
        "Description": "May 1944. The eve of the Allied invasion of Europe. When American OSS agent Craig Osbourne is taken aboard a German E-boat off the coast of Brittany, he thinks that his war – and possibly his life – are over. But the Lili Marlene is actually operated by the Royal Navy out of an ultrasecret base on the English coast. And it will soon be returning Osbourne – a highly trained assassin – to occupied France. There, he will help the beautiful twin sister of a dead British agent infiltrate a German High Command briefing on the defense of the Atlantic Wall. Nothing will prevent the coming Allied assault – but its success may well depend on the outcome of this mission…",
        "Category": " Fiction , War & Military",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Best Little Stories from the American Revolution",
        "Authors": "By Kelly, C. Brian and Smyer-Kelly, Ingrid",
        "Description": "Best Little Stories of the American Revolution is a journalistic history of the birth of the United States in the form of more than 100 vignettes reflecting the period. Here is the history of the war as it affected soldiers and civilians, loyalists and patriots, leaders and common folk - people who courageously prevailed against an enemy with vastly superior resources.   Included are such stories as:  Thomas Jefferson's painful discomfort as the Continental Congress made changes in his vaunted Declaration of Independence.  Two rogue warriors, loyalist and patriot, who thought nothing of murder, arson, and kidnapping as a means to victory during the conflict. Henry Knox's gritty effort to drag a large number of cannons from Fort Ticonderoga in northeastern New York to Boston. George Washington's embarrassment and fury in dealing with Benedict Arnold's young wife - hysterical and scantily clad - on the day Arnold deserted the American cause. British soldiers who got General Charles Lee's horse drunk after capturing Lee one morning in a surprise raid on his New Jersey \"bed and breakfast.\" Teenager Andrew Jackson, later president, rescued from British captivity by his mother, to Britain's chagrin. Burton Gwinnett of Georgia, one of the signers of the Declaration of Independence, who was fatally wounded in a senseless pistol duel by Lachlan McIntosh, a patriot leader.  Also included are fascinating stories of several founding mothers, including Martha Washington, Abigail Adams, Betsy Ross, Molly Pitcher, Janet Livingston Montgomery, and many others.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Cumberland House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Milk and Honey (Decker/Lazarus Novels)",
        "Authors": "By Kellerman, Faye",
        "Description": "In the silent pre-dawn city hours -- alone with his thoughts about Rina Lazarus, the woman he loves, three thousand miles away in New York -- LAPD detective Peter Decker finds a small child, abandoned and covered in blood that is not hers. It is a sobering discovery, and a perplexing one, for nobody in the development where she was found steps forward to claim the little girl. Obsessed more deeply by this case than he imagined possible, Decker is determined to follow the scant clues to an answer. But his trail is leading him to a killing ground where four bodies lie still and lifeless. And by the time Rina returns, Peter Decker is already held fast in a sticky mass of hatred, passion, and murder -- in a world where intense sweetness is accompanied by a deadly sting.",
        "Category": " Fiction , Women",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Coup",
        "Authors": "By Updike, John",
        "Description": "The Coup describes violent events in the imaginary African nation of Kush, a large, landlocked, drought-ridden, sub-Saharan country led by Colonel Hakim Félix Ellelloû. (“A leader,” writes Colonel Ellelloû, “is one who, out of madness or goodness, takes upon himself the woe of a people. There are few men so foolish.”) Colonel Ellelloû has four wives, a silver Mercedes, and a fanatic aversion—cultural, ideological, and personal—to the United States. But the U.S. keeps creeping into Kush, and the repercussions of this incursion constitute the events of the novel. Colonel Ellelloû tells his own story—always elegantly, and often in the third person—from an undisclosed location in the South of France.From the Trade Paperback edition.",
        "Category": " Fiction , Literary",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "Color",
        "Authors": "By Pavey, Donald",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Knapp Pr",
        "Price Starting With ($)": "8.16",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "The Secret Garden, A Watermill Classic",
        "Authors": "By Burnett, Frances Hodgson",
        "Description": "Ten-year-old Mary comes to live in a lonely house on the Yorkshire moors and discovers an invalid cousin and the mysteries of a locked garden.",
        "Category": " Young Adult Fiction , Family , Orphans & Foster Homes",
        "Publisher": "Watermill Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Experiment: What Would Happen If You Really Tried to Live Everyday As Jesus Would?",
        "Authors": "By Temple, Todd",
        "Description": "For extra credit in World Religions class two teenagers agree to participate in an experiment in which they attempt to live for two weeks exactly as Jesus would",
        "Category": " Young Adult Fiction , Religious , Christian , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Dreamland",
        "Authors": "By Dessen, Sarah",
        "Description": "When Caitlin first meets Rogerson Biscoe, he seems to be everything she wants him to be. He's handsome, sensitive, and more than a bit mysterious. And before long, Rogerson has cast a spell over Caitlin. A spell that keeps her in a dreamland from which she can't seem to break free-even when the dreams turn into nightmares. Beautifully crafted, with a vivid plot and sharply drawn characters, this is a powerful and intensely compelling story of a young girl struggling to break free of an abusive relationship.  \"Dreamland is the story of many contemporary teen relationships. Compelling reading.\" (School Library Journal, starred review)",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Slightly Wicked (Bedwyn Saga)",
        "Authors": "By Balogh, Mary",
        "Description": "Meet the Bedwyns…six brothers and sisters—men and women of passion and privilege, daring and sensuality…Enter their dazzling world of high society and breathtaking seduction…where each will seek love, fight temptation, and court scandal…and where Rannulf Bedwyn, the rebellious third son, enters into a liaison that is rather risqué, somewhat naughty, and…Slightly Wicked.With his laughing eyes and wild, rakish good looks, Lord Rannulf Bedwyn is a hard man to resist. To Judith Law, a woman in need of rescue when her stagecoach overturns, Rannulf is simply her savior, a heroic stranger she will reward with one night of reckless passion before she must become a companion to her wealthy aunt.  Imagine Judith's shock when the same stranger turns out to be among England's most eligible bachelors…and when he arrives at Harewood Grange to woo her cousin.  Certainly, they had made no vows, no promises, but Rannulf never did forget his uninhibited lover…nor did she forget that one delicious night. And as scandal sets the household abuzz, Rannulf proposes a solution…but when Judith refuses to have him—in love or wedlock—Rannulf has only one choice: to wage a campaign of pure pleasure to capture the heart of the woman who has already won his.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Top Notch Executive Resumes: Creating Flawless Resumes for Managers, Executives, and CEOs (Top Notch series)",
        "Authors": "By Hansen, Katharine",
        "Description": "Branded resumes that illuminate the candidate's unique value proposition and ROI are a must in today's quest for the executive suite. Top Notch Executive Resumes not only explains how to integrate branding into career-marketing communication, but also how to craft resumes that address your fit with the organization's mission and meet an employer's specific business needs. Hansen instructs high-level professionals in framing past accomplishments so that the employer can visualize the executive's strategic vision and industry insights, as well as what he or she can contribute.Highlights of the book include:A huge collection of resume samples in cutting-edge formats, organized by profession for easy navigability.Examples of a wide variety of complementary documents--including leadership profiles and executive bios--that top-level professionals need to round out their executive portfolios.Special additional features, including the preferences and peeves of hiring decision-makers, guidelines for working with recruiters, frequently asked questions, and case studies detailing complete job-search marketing campaigns.Let Top Notch Executive Resumes get you into that corner office!",
        "Category": " Business & Economics , Careers , Resumes",
        "Publisher": "Weiser",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Cat Who Walks Through Walls",
        "Authors": "By Heinlein, Robert A.",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "The Death Collectors",
        "Authors": "By Kerley, Jack",
        "Description": "In 1972, on the day of his sentencing, renowned artist and serial killer Marsden Hexcamp is shot dead in the courtroom. Members of his Mansonesque band of followers are imprisoned or simply disappear. Fast-forward more than thirty years: A suspected prostitute is found murdered in a candlelit motel room, the first in a series of horrors suggesting Hexcamp's art remains alive and treacherous. Following a trail of beautiful - and profoundly disturbing - artwork, homicide detectives Carson Ryder and Harry Nautilus descend into the shocking world of the Death Collectors, people who spend vast sums to collect serial-killer memorabilia. As Ryder and Nautilus race to solve a thirty-year conspiracy, it becomes evident that at the intersection of art and madness, death is beauty, tragedy a memento, and suffering suitable for framing.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Red Eye, Black Eye",
        "Authors": "By Jensen, K. Thor",
        "Description": "In the days after September 11th, with the ruins of his job, relationship, and city crumbling around him, cartoonist and roustabout K. Thor Jensen packed a backpack, bought a bus pass and took to the open road. His 60-day, 10,000-mile journey is chronicled in this ragtag romance. Red Eye, Black Eye is a fractured portrait of 21st century American life.",
        "Category": " Comics & Graphic Novels , Literary",
        "Publisher": "Alternative Comics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "West of Dodge: Frontier Stories  ",
        "Authors": "By L'Amour, Louis",
        "Description": "WHERE THE REAL FRONTIER BEGINS • Louis L’Amour’s classic novels of the West make for perfect Father’s Day gifts!   A young cowpuncher stakes a claim that can only be sealed with fists and a .44 Colt. . . . A gunfighter, tired of violence, finds himself pushed down a trail of bloody revenge. . . . From purple sage to gambler’s gold, from a señorita’s tempting smile to a splash of blood in the dust, here are stories with a distinctive L’Amour twist. A quiet farmer defends his honor in a moment of panic and luck . . . only to find true courage on the run from the dead man’s brothers. A young drifter defends a lady’s honor . . . and finds himself the quarry of a hanging posse. An aging marshal with a reputation as a crack shot faces a stranger who knows his secret. With relentless suspense and unforgettable drama, Louis L’Amour once again paints a vivid portrait of our western heritage that will live forever.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Honorable Enemies",
        "Authors": "By Weber, Joe",
        "Description": "Teaming up on a case involving a helicopter terrorist attack on a Hawaiian cruise ship, CIA agent Steve Wickham and FBI agent Susan Nakamura form an unlikely partnership in order to prevent a full-scale war. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "TALES OF A FOURTH GRADE NOTH-P561042/48",
        "Authors": "By Blume, Judy",
        "Description": "",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Yearling Books/Dell Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1923"
        }
    },
    {
        "Title": "Mute",
        "Authors": "By Anthony, Piers",
        "Description": "Finesse, a seductive imperial agent, convinces Knot, a mutant with telepathic powers, to help her unseat the powerful ruler of another world, who threatens to take over the Empire",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "The Renegades of Pern (Dragonriders of Pern Series)",
        "Authors": "By McCaffrey, Anne",
        "Description": "“[McCaffrey is the] master of the well-told tale.”—Chicago Sun-TimesAs long as the people of Pern could remember, the Holds had protected them from Thread, the deadly silver strands that fell from the sky. In exchange for sanctuary in the huge stone fortresses, the people tithed to their Lord Holders, who in turn supported the dragonriders, Pern’s greatest weapon against Thread. But not everyone on Pern was protected. Some, like Jayge’s trader clan, simply preferred the freedom of the roads to the security of a hold. Others, like Aramina’s family, had lost their homes. Regardless of their differences, however, they all feared the outlaws who preyed on holds and holdless alike. The Lady Thella’s renegades are the most dangerous yet—all they need is Aramina, whose telepathic link with dragons can help them evade the dragonrider patrols. But Jayge is out to stop Thella . . .and he will never let her have Aramina.",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "A Choice Of Gods",
        "Authors": "By Simak, Clifford D.",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1973"
        }
    },
    {
        "Title": "Splinter of the Mind's Eye",
        "Authors": "By Alan Dean Foster",
        "Description": "",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1978"
        }
    },
    {
        "Title": "Betty Crocker's Cookbook: Everything You Need to Know to Cook Today",
        "Authors": "By Crocker, Betty (EDT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Lincoln",
        "Authors": "By VIDAL, GORE and Box, Edgar (CON)",
        "Description": "\"The portrait is reasoned, judicious, straightforward and utterly convincing.\"THE NEW YORK TIMES BOOK REVIEWIn this profoundly moving work of epic proportion and intense human sympathy, Abraham Lincoln is observed by his loved ones, his rivals, and his future assassins. In this brilliantly realized, vividly imagined work of fiction, Gore Vidal gives us a portrait of America's great president that is at once intimate and public, stark and complex, and that will become for future generations the living Lincoln, the definitive Lincoln.\"Richly entertaining....For the general reader the elegant explication of the issues of the day gives hearty satisfaction: history lessons with the blood still hot.\"THE WASHINGTON POST",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "AIGA Professional Practices in Graphic Design: American Institute of Graphic Arts",
        "Authors": "By American Institute of Graphic Arts (COR) and Crawford, Tad (EDT)",
        "Description": "AIGA Professional Practices in Graphic Design is a comprehensive guide to every aspect of the graphic design business, from designer relationships with clients, employees, and suppliers to management issues, marketing strategies, rights, and ethical standards. It covers negotiation principles, setting fees, contracts, structuring the design firm, audits, insurance basics, studio safety, marketing on the World Wide Web, copyright and licensing, trademark infringement, and business ethics. Short and long versions of the AIGA Standard Form of Agreement are included for easy reference, and a complete resources section highlights selected publications and organizations for graphic designers.",
        "Category": " Design , Graphic Arts , General",
        "Publisher": "Allworth Press",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Seventh Scroll",
        "Authors": "By Smith, Wilbur A.",
        "Description": "For 4,000 years, the lavish crypt of the Pharaoh Mamose has never been found...until the Seventh Scroll, a cryptic message written by he slave Taita, gives beautiful Egyptologist Royan Al Simma a tantalizing clue to its location.But this is a treasure cache others would kill to possess. Only one step ahead of assassins, Royan runs for her life and into the arms of the only man she can trust, Sir Nicholas Quenton-Harper-a daring man who will stake his fortune and his life to join her hunt for the king's tomb. Together, they will embark on a breathtaking journey to the most exotic locale on earth, where the greatest mystery of ancient Egypt, a chilling danger and an explosive passion are waiting.Steeped in ancient mystery, drama and action, The Seventh Scroll is a masterpiece from a storyteller at the height of his powers.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Hungry as the Sea: A Novel",
        "Authors": "By Smith, Wilbur A.",
        "Description": "Wilbur Smith sets his vividly realistic novels on the razor's edge between human courage and nature's wrath. InHungry As The Sea, this master storyteller takes us to the frigid South Atlantic, where one man fights for his life-- and for redemption.Nicholas Berg is steaming out of Cape Town aboard the salvage tug Warlock. Once Berg ruled an ocean-going empire. Now, his future has come down to a powerful boat and a daring rescue mission. One of his former ships is being lashed against the cliffs of Cape Alarm, surrounded by deadly icebergs and survivors clinging to their boats. Berg has gambled everything on reaching the Golden Adventurerbefore a competitor and a violent storm-- to win a fortune in salvage fees. But if Nick Berg succeeds, and climbs back into the international shipping game, that's when the real danger will begin...From the power of a relentless ocean to the hunger of men to survive upon her, this is a towering novel of adventure, love and the daring of the human soul.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Rivers West: A Novel (Talon and Chantry)",
        "Authors": "By L'Amour, Louis",
        "Description": "His dream was to build magnificent steamboats to ply the rivers of the American frontier.  But when Jean Talon began his journey westward, he stumbled upon a deadly conspiracy  involving a young woman’s search to find her missing brother, and a ruthless band  of renegades. Led by the brazen Baron Torville, this makeshift army of opportunists  is plotting a violent takeover of the Louisiana Territory. Jean swears to find a  way to stop this daring plan. If he doesn’t, it will not only put an end to all his  dreams; it will change the course of history—and destroy the promise of the American  frontier.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Seekers (The American Bicentennial Series, Vol. 3)",
        "Authors": "By Jakes, John",
        "Description": "",
        "Category": "",
        "Publisher": "Pyramid Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Dangerous Animals of the Sea",
        "Authors": "By Zillox",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "Chunchu: The Genocide Fiend Volume 1",
        "Authors": "By Sung Jae, Kim and Byung-Jin, Kim (CON)",
        "Description": "\"The story of a young man saved from death by his mother, banished by his people, hunted by his brother, and tortured by the demons within. Living and fighting with a low-born warrior tribe who can never trust him, Chunchu lives a life of blood and violence, every day a struggle to survive. But something mysterious lurks within his cold exterior, something that could be awakened by the touch of a woman\"--P. [4] of cover.",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "Dark Horse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Capture the Flag: A NOVEL (STAR TREK THE NEXT GENERATION)",
        "Authors": "By Vornholt, John and Hamilton, Todd Cameron (ILT)",
        "Description": "Geordi's first year at Starfleet Academy climaxes when he defeats aggressive Cadet Jack Pettey's team in an elimination game and faces revenge-minded Pettey on the low-gravity planet, Saffair. Original.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Atlantis Station (STAR TREK: THE NEXT GENERATION: STARFLEET ACADEMY)",
        "Authors": "By Mitchell, V. E. and Hamilton, Todd Cameron (ILT)",
        "Description": "Preparing to explore Atlantis Station, an underwater research base, Geordi LaForge and his fellow cadets find themselves caught in an earthquake and must escape freezing seawater and the collapsing station before they are trapped. Original.",
        "Category": "",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "A Civil War Treasury: Being a Miscellany of Arms and Artillery, Facts and Figures, Legends and Lore, Muses and Minstrels, Personalities and People",
        "Authors": "By Nofi, Albert A.",
        "Description": "Going beyond the battles and the memoirs, this book offers a unique, intimate and informative portrayal of this nation's greatest catastrophe, the War Between the States.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Castle Books",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Best Little Stories from the Civil War",
        "Authors": "By Kelly, C. Brian and Smyer, Ingrid",
        "Description": "This collection of more than 100 stories from America's Civil War is drawn from the writings of soldiers, sailors, slaves, politicians, and ordinary citizens as much as from the accomplishments of military leaders. The stories present the war in historical sequence through the voices of the common people, not just military and political leaders.  Best Little Stories of the Civil War includes:  Soldiers describing their first experiences in battle Edward Porter Alexander, the Georgia native who was stranded in San Francisco with his wife when war broke out (he later became a Confederate general. Thomas N. Conrad, the Washington, D.C., headmaster of a boys school who spied for the South. Julia Ward Howe, who was inspired to write the words of \"The Battle Hymn of the Republic\" after watching young troops marching through Washington to the battlefields from her balcony at the Willard Hotel. New Orleans native George Cable, who describes what it was like to see Union ships sail up the Mississippi to take command of his city.  These and many more stories and anecdotes fill the pages of this fascinating book that will make the Civil War come alive with the thoughts and feelings of real people.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Cumberland House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Warriors! True Stories Of Combat, Skill And Courage",
        "Authors": "By Eldridge, Jim",
        "Description": "Looks at gladiators, samurai, armored knights, American frontiersmen, U.S. special forces, and robotic warriors of the future through stories about real or possible battles, and rates their honor, ruthlessness, weaponry, tactics, and courage.",
        "Category": " Juvenile Nonfiction , History , Military & Wars",
        "Publisher": "Chicken House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Bounce and Jiggle (Baby Gym)",
        "Authors": "By Rescek, Sanja (ILT)",
        "Description": "Touch is a baby's first language…  Designed to stimulate the senses, and based on research into the benefits of baby exercise and massage, these books encourage interaction between parent and baby.  Devoting time to special activities with your baby plays a crucial part in the bonding process.  Singing, accompanied by energetic activities, encourages babies to express their emotions, release tension – and just enjoy being noisy!",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Childs Play Intl Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Echoes of the White Giraffe",
        "Authors": "By Choi, Sook Nyul",
        "Description": "",
        "Category": " Juvenile Fiction , People & Places , Asia",
        "Publisher": "Bantam Books of Canada Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "30 Things to Do When You Turn 30",
        "Authors": "By Sellers, Ronnie (EDT) and Taylor, Chris (EDT)",
        "Description": "",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Sellers Publishing, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Star in the Storm (Aladdin Historical Fiction)",
        "Authors": "By Harlow, Joan Hiatt",
        "Description": "A RISKY SECRET  All non-sheepherding dogs have been outlawed from the rocky coastal village where Maggie lives. Unwilling to give up her beloved Newfoundland, Sirius, Maggie defies the law and hides Sirius away.  But when a steamer crashes into the rocks during a violent storm and starts to sink with a hundred passengers on board, Maggie faces a difficult choice. She knows Sirius can help rescue the people trapped on the ship, but bringing him out of hiding would put his own life in jeopardy. Is Maggie's brave dog a big enough hero to save the desperate passengers -- and himself?",
        "Category": " Juvenile Fiction , Science Fiction , General",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Only With A Cowboy (Club Fantasy)",
        "Authors": "By MacNeal, Melissa and Mellor, P. J.",
        "Description": "Black Stetson, leather chaps, rough hands, and raw muscle--he'll brand you with his touch and ride you hard all night long. . .\"Hard in the Saddle\" by P.J. Mellor Cowboy Sam Austin knows all about calming wild horses. But taming spitting mad she-cat Madison St. Claire requires all of his persuasive powers of sexual satisfaction. . .\"Breeding Season\" by Vonna Harper Years ago Wendi Rennert lost her virginity to Mike Wagner. Now Mike is back in town, and Wendy can't wait to show this rock-hard rancher some red-hot lovin'. . .\"Getting Lucky\" by Melissa MacNeal Bank president Jane Cook has no problem turning down a loan request from bad boy Luke McGrew. But his sinfully seductive body soon has her making sexual requests of her own. . .This is a REALLY HOT book. (Sexually explicit)",
        "Category": " Fiction , Erotica , General",
        "Publisher": "Aphrodisia",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Cold Calling Techniques that Really Work!",
        "Authors": "By Schiffman, Stephan",
        "Description": "Explains how to make effective sales calls, discusses the importance of preparation, and describes ways to overcome objections, measure progress, and increase sales",
        "Category": " Business & Economics , Marketing , Telemarketing",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Deep and Dark and Dangerous",
        "Authors": "By Hahn, Mary Downing",
        "Description": "Just before summer begins, 13-year-old Ali finds an odd photograph in the attic. She knows the two children in it are her mother, Claire, and her aunt Dulcie. But who’s the third person, the one who’s been torn out of the picture?Ali figures she’ll find out while she’s vacationing in Maine with Dulcie and her four-year-old daughter, Emma, in the house where Ali’s mother’s family used to spend summers. All hopes for relaxation are quashed shortly after their arrival, though, when the girls meet Sissy, a kid who’s mean and spiteful and a bad influence on Emma.Strangest of all, Sissy keeps talking about a girl named Teresa who drowned under mysterious circumstances back when Claire and Dulcie were kids, and whose body was never found. At first Ali thinks Sissy’s just trying to scare her with a ghost story, but soon she discovers the real reason why Sissy is so angry. . . . Mary Downing Hahn is at her chilling best in this supernatural tale that’s certain to send shivers down her readers’ spines.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Cultural Dimension of International Business (4th Edition)",
        "Authors": "By Ferraro, Gary P.",
        "Description": "Preparing future American businessmen and women to understand and cope with the cultural dimension of their professions, this book demonstrates how the theory and insights of cultural anthropology can positively influence the conduct of international business.  It explores (1) general concepts about culture that can be applied to any cross-cultural situation; (2) the nature of communication, both linguistic and nonverbal; (3) contrasting value systems; and (4) a wide variety of sources for locating culture-specific information. A conceptual approach provides readers with the necessary framework for understanding the cultural dimension of the international business arena.  For individuals seeking to understand any cross cultural business encounter they have had in the past or might have in the future.",
        "Category": " Business & Economics , International , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Best American Mystery Stories 2008 (The Best American Series ®)",
        "Authors": "By Penzler, Otto (EDT) and Pelecanos, George P. (EDT)",
        "Description": "“A must-read for anyone who cares about crime stories.”—BooklistThe award-winning author and Emmy-nominated television writer George Pelecanos serves as editor of the twelfth installment of this genre-expanding anthology, featuring twenty of the past year’s most enthralling, suspenseful, and slyly illuminating mystery stories.A cut-and-dried case for a wily crime-scene reconstructionist is turned on its head in Michael Connelly’s “Mulholland Dive.” A terrible secret shared between two childhood friends resurfaces decades later as one of them lies on her deathbed in Alice Munro’s masterful “Child’s Play.” James Lee Burke tells the haunting tale of a Hurricane Katrina evacuee who unexpectedly finds comfort from an unimaginable loss in “Mist.” And in Holly Goddard Jones’s “Proof of God,” a young man’s car is repeatedly vandalized as proof that someone knows about the truths he’d never willingly reveal.    As Pelecanos notes in his introduction, the twenty “original and unique voices” in this collection pay homage to the genre’s forebears by taking crime fiction into a thrilling new direction. “But make no mistake,” he says, “we are all standing on the shoulders of writers who came before us and left an indelible mark on literature through craftsmanship, care, and the desire to leave something of worth behind.”",
        "Category": " Fiction , Mystery & Detective , Collections & Anthologies",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Hoof Beat (Saddle Club #9)",
        "Authors": "By Bryant, Bonnie",
        "Description": "Lisa’s love of horses has grown over the past few months. As a member of the Saddle Club, she feels it’s her duty to spread the word about all the good things happening at Pine Hollow Stables. But when her new column, Hoof Beat, starts running weekly in the local paper, Lisa’s not getting the happy reaction she expected. Is there a difference between telling the facts, and reporting the news?",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "I Know Absolutely Nothing About Golf: A New Golfer's Guide to the Game's Traditions, Rules, Etiquette, Equipment, and Language",
        "Authors": "By Eubanks, Steve and Crouse, Whitney",
        "Description": "This is the definitive book on golf for the beginner who wants to understand the game as well as learn to play it. This is not an instructional book - it won't tell you how to improve your swing or hold your club - but a primer that guides the beginning golfer through the inner workings of the game, including its traditions, terminology, equipment, rules, types of courses, standards of etiquette, and more.Each year millions play golf for the first time. For the business professional, a golfer's spouse, a new golfer, or anyone who wants to know about the game, I Know Absolutely Nothing about Golf is the place to start.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Best American Travel Writing 2008",
        "Authors": "By Bourdain, Anthony (EDT)",
        "Description": "In his introduction to The Best American Travel Writing 2008, editor Anthony Bourdain writes that the pieces that “spoke the loudest and most powerfully to me were usually evocative of the darker side, those moments fearful, sublime, and absurd; the small epiphanies familiar to the full-time traveler, interspersed by a sense of dislocation—and the strange, unholy need to record the experience.” With this in mind, Bourdain and series editor Jason Wilson have assembled a wide-ranging and wonderfully eclectic collection that delves headlong into those darker moments and subtle realizations, looking to absorb, provoke, and offer a moving record of what it means to travel in the twenty-first century.Here you will find Seth Stevenson’s extraordinary experience of “Looking for Mammon in the Muslim World” as he makes his way through sweltering and paradoxical Dubai. Exotic tastes and larger-than-life personalities abound as Bill Buford accompanies the chocolate maker Frederick Schilling to the rain forests of Brazil. And on the other side of the world, Calvin Trillin trolls Singapore for the ultimate street food, while Kristin Ohlson delves into the harrowing challenges faced by proprietors of restaurants in Kabul, Afghanistan.The twenty-five pieces in this collection have their fair share of the absurd as well. David Sedaris explains the hilarious highs (sundaes) and woeful lows (sobbing with your seatmate) of flying Business Elite. Gary Shteyngart goes “To Russia for Love” during St. Petersburg’s vodka-soaked wedding season. And Emily Maloney gets up close and personal with her fellow travelers — and their massage devices — in a South American hostel.Culled from an amazing variety of publications, “the writing in this volume is so vibrantly good, you’ll feel like you’ve armchair-traveled around the world” (Chicago Sun Times).",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Confessions of an Eco-Sinner: Tracking Down the Sources of My Stuff",
        "Authors": "By Pearce, Fred",
        "Description": "Where does everything in our daily lives come from? The clothes on our backs, the computers on our desks, the cabinets in our kitchens, and the food behind their doors? Under what conditions-environmental and social-are they harvested or manufactured? Veteran science journalist Fred Pearce set off to find out, and the resulting 100,000-mile journey took him to the end of his street and across the planet to more than twenty countries. Pearce deftly shows us the hidden worlds that sustain a Western lifestyle, and he does it by examining the sources of everything in his own life; as an ordinary citizen of the Western world, he, like all of us, is an \"eco-sinner.\" In Confessions of an Eco-Sinner, Pearce surveys his home and then launches on a global tour to track down, among other things, the Tanzanians who grow and harvest his fair-trade coffee (which isn't as fair as one might hope), the Central American plantations that grow his daily banana (a treat that may disappear forever), the women in the Bangladeshi sweatshops who sew his jeans, the Chinese factory cities where the world's computers are made, and the African afterlife for old cell phones. It's a fascinating portrait, by turns sobering and hopeful, of the effects the world's more than 6 billion inhabitants-all eating, consuming, making-have on our planet, and of the working and living conditions of the people who produce most of these goods.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    }
]