[
    {
        "Title": "The Best and the Brightest",
        "Authors": "By Halberstam, David",
        "Description": "David Halberstam’s masterpiece, the defining history of the making of the Vietnam  tragedy, with a new Foreword by Senator John McCain.\"A rich, entertaining, and profound reading experience.”—The New York Times Using portraits of America’ s flawed policy makers and accounts of the forces that drove them, The Best and the  Brightest reckons magnificently with the most important abiding question of our country’s recent history: Why did America become mired in Vietnam, and why did we lose? As  the definitive single-volume answer to that question, this enthralling book has never  been superseded. It is an American classic.Praise for The Best and the Brightest“The most comprehensive saga of how America became involved in Vietnam. . . . It is also the Iliad of the American empire and the Odyssey of this nation’s search for its idealistic soul. The Best and the Brightest is almost like watching an Alfred Hitchcock thriller.”—The Boston Globe“Deeply moving . . . We cannot help but feel the compelling power of this narrative. . . . Dramatic and tragic, a chain of events overwhelming in their force, a distant war embodying illusions and myths, terror and violence, confusions and courage, blindness, pride, and arrogance.”—Los Angeles Times“A fascinating tale of folly and self-deception . . . [An] absorbing, detailed, and devastatingly caustic tale of Washington in the days of the Caesars.”—The Washington Post Book World“Seductively readable . . . It is a staggeringly ambitious undertaking that is fully matched by Halberstam’s performance. . . . This is in all ways an admirable and necessary book.”—Newsweek“A story every American should read.”—St. Louis Post-Dispatch",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Do You Remember?: The Book That Takes You Back",
        "Authors": "By Gitter, Michael and Anapol, Sylvie",
        "Description": "Remember the Bionic Woman, Dippity Doo, Pop Rocks, Planet of the Apes, Peter Frampton, and white lipstick? Do You Remember? takes readers back to a simpler, tackier time, when TV shows were unabashedly corny and shags (carpets and hairdos) were all the rage. Over 130 images of long-lost-pop-culture items and unforgettable icons from the '50s, '60s, '70s, and even early '80s fill the pages of this wacky collection. Do You Remember? is the perfect gift for baby boomers, ex-hipsters, and even members of Generation X, sparking chains of remembrance that make Proust's madeleine look like just another cookie.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Get It Started (The Party Room)",
        "Authors": "By Burke, Morgan",
        "Description": "The party room.On Manhattan's Upper East Side. Everybody's fabulous. No one gets carded. Then someone dies.The Party Room is where the prep school crowd goes to drink up and hook up. The cocktails are chill and the bartender's hot. Everyone knows everyone -- except the guy that Samantha Byrne leaves with one night. The next day Sam's missing. Then she's found dead in Central Park, murdered brutally. It looks like a copycat killing of another girl who was murdered years earlier. By someone from Talcott Prep. The killer is one of them. He knows where they live. And where they play....",
        "Category": " Young Adult Fiction , Law & Crime",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Classics of Western philosophy",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hackett",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Journey into Joy",
        "Authors": "By Dekruyter, Arthur H.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fleming H. Revell Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Complete Stir-fry Cookbook",
        "Authors": "By Family Circle",
        "Description": "",
        "Category": "",
        "Publisher": "Murdoch Books UK",
        "Price Starting With ($)": "7.67",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Hellfire Club",
        "Authors": "By Straub, Peter",
        "Description": "\"Surprising twists [and a] wildly inventive plot.\"--The New York TimesThey are dying, one by one. Wealthy, middle-aged women in an exclusive Connecticut suburb. Their murderer remains at large. Nora Chancel, wife of publishing scion Davey Chancel, fears she may be next. After all, her past has branded her a victim . . . .\"Combines the intellectual-puzzle mystery with a powerful vein of psycho-thriller suspense.\"--The Washington PostThen Davey tells Nora a surreal story about the Hellfire Club, where years before he met an obsessed fan of Chancel House's most successful book, Night Journey--a book that has a strange history of its own. . . .\"One of the most chilling villains to come along since Hannibal Lecter.\"--San Francisco ChronicleSuddenly terror engulfs Nora: She must defend herself against fantastic accusations even as a madman lies in wait. And when he springs, she will embark on a night journey that will put her victimhood to rest forever, dead or alive. . . .",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "3rd Degree (Women's Murder Club, 3)",
        "Authors": "By Patterson, James and Gross, Andrew",
        "Description": "In James Patterson's shockingly suspenseful #1 New York Times bestseller, one member of the Women's Murder Club is hiding a secret so dangerous that it could destroy them all.One of James Patterson's best loved heroines is about to die. Detective Lindsay Boxer is jogging along a beautiful San Francisco street when a fiery explosion rips through the neighborhood. When Lindsay plunges inside to search for survivors, she finds three people dead. A lost infant and a mysterious message at the scene leaves Lindsay and the San Francisco Police Department completely baffled.Then a prominent businessman is found murdered under bizarre circumstances, with another mysterious message left behind by the killer. Lindsay asks her friends Claire Washburn of the medical examiner's office, Assistant D.A. Jill Bernhardt, and Chronicle reporter Cindy Thomas to help her figure out who is committing these murders-and why they are intent on killing someone every three days.Even more terrifying, the killer has targeted one of the four friends who call themselves the Women's Murder Club.Which one will it be?",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Christ",
        "Authors": "By Roberson, Carroll",
        "Description": "Many people know Carroll Roberson as the smooth, plaintive Southern gospel singer and evangelist from Mississippi, but few people know that he has traveled many time to the Holy Land, and is very knowledgeable about the geography, history, and customs of that area.  In The Christ, he brings all of that vast knowledge to the table as he tells the life of Jesus, event by event, from the Old Testament prophecies to the purpose and meaning of the acts of Christ for us today.  This is a rich and satisfying account of the life of Christ that proves that He was more than a man.",
        "Category": " Religion , Spirituality",
        "Publisher": "New Leaf Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Southern Living Easy Entertaining",
        "Authors": "By Susan Hernandez Ray",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Devil's Labyrinth: A Novel",
        "Authors": "By Saul, John",
        "Description": "For more than three decades, bestselling novelist John Saul has been summoning macabre masterpieces from the darkest realms of his imagination. With each new book, his instinct for playing upon our deepest dread has grown only stronger and more sinister. He’s never been afraid to push the boundaries of suspense and confront us with what frightens us most. After his father’s untimely death sends fifteen-year-old Ryan McIntyre into an emotional tailspin, his mother enrolls him in St. Isaac’s Catholic boarding school, hoping the venerable institution with a reputation for transforming wayward teens can work its magic on her son. But troubles are not unknown even at St. Isaac, where Ryan arrives to find the school awash in news of one student’s violent death, another’s mysterious disappearance, and growing incidents of disturbing behavior within the hallowed halls. Things begin to change when Father Sebastian joins the faculty. Armed with unprecedented knowledge and uncanny skills acquired through years of secret study, the young priest has been dispatched on an extraordinary and controversial mission: to prove the power of one of the Church’s most arcane sacred rituals, exorcism. Willing or not, St. Isaac’s most troubled students will be pawns in Father Sebastian’s one-man war against evil–a war so surprisingly effective that the pope himself takes notice of the seemingly miraculous events unfolding an ocean away.But Ryan, drawn ever more deeply into Father Sebastian’s ministrations, sees–and knows–otherwise. As he witnesses with mounting dread the transformations of his fellow pupils, his certainty grows that forces of darkness, not divinity, are at work. Evil is not being cast out . . . something else is being called forth. Something that hasn’t stirred since the Inquisition’s reign of terror. Something nurtured through the ages to do its vengeful masters’ unholy bidding. Something whose hour has finally come to bring hell unto earth.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Potluck at Midnight Farm: Celebrating Food, Family, and Friends on Martha's Vineyard",
        "Authors": "By Weiss, Tamara, Simon, Carly (FRW), and Bramhall, Nina (PHT)",
        "Description": "Potlucks are the friendliest of gatherings. As guests take part in the festivities, sharing their contributions—a dish of pasta, a bottle of wine, a bunch of wildflowers—they share a bit of themselves. Author Tamara Weiss knows this well. A self-described “organizer, assembler, and table setter,” she has all the qualities of the consummate host, as well as years of experience attending and planning potlucks. In Potluck at Midnight Farm, Tamara has captured a year of potlucks on Martha’s Vineyard, from brunches in a backyard garden to grill fests at twilight beside the sea. Each season brings together new faces, old friends, beautiful settings, and great food.Collected here are more than a hundred recipes from Tamara and her guests, plus gorgeous photographs of the parties, so you too can share in the celebrations and garner ideas to create your own inspired gatherings. These dishes, at once lovely and hearty, are offered by people from all walks of life, from the island teacher to the world-famous celebrity. Each recipe is personalized with a brief anecdote of how the dish came about or why it has become such a party staple. All are wonderfully delicious. There are foods for every season and occasion: Mary Steenburgen’s Corn Spoon Pudding, Daphne’s Fried Chicken (which Bill Styron has served to Bill Clinton), and Grilled Corn Guacamole. Plus superb salads, like Tamara’s Summer Salad, with greens, sugar snap peas, mangoes, and sunflower seeds, and desserts to rave about: Lambert’s Cove Lemon Tea Cake, Judy Belushi Pisano’s Georgia Peaches with Raspberry Sauce, and the ultimate Butterscotch Brownies.Potluck at Midnight Farm celebrates with charm and class the perfect companionship of food and entertaining, and welcomes readers just as if they were guests. And Tamara gives you all the advice and inspiration you need to send you running to organize your own spectacular potlucks.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Flowers On Main (A Chesapeake Shores Novel)",
        "Authors": "By Woods, Sherryl",
        "Description": "When her last two plays are dismal failures and her relationship with her temperamental mentor falls apart, writer Bree O'Brien abandons Chicago and the regional theater where she hoped to make a name for herself to return home. Opening Flowers on Main promises to bring her a new challenge and a new kind of fulfillment.But not all is peaceful and serene in Chesapeake Shores, with her estranged mother on the scene and her ex-lover on the warpath. Jake Collins has plenty of reasons to want Bree out of his life, but none of those are a match for the one reason he wants her to stay: he's still in love with her.Jake might be able to get past that old hurt if he knew Bree was home to stay, but is she? The only way to know for sure is to take a dangerous leap of faith.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "One Year Book of Devotions for Kids #3",
        "Authors": "By Children's Bible Hour",
        "Description": "For ten years kids have had fun learning about Scripture with The One Year Book of Devotions for Kids series. Now The One Year Book of Devotions for Kids, volume 3, is available with a great new look for a new generation of readers. Each day’s lesson focuses on a key theme from a Bible story. A contemporary story, application questions, a memory verse, and an action phrase combine to reinforce the theme for each day. A great way to help kids connect with God!",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "Tyndale Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Geometry to Go: A Mathematics Handbook",
        "Authors": "By Dave Bradley, Lauren L. Darling",
        "Description": "Covers logic and proof, basic elements of geometry, polygons, measurements, similarity, congruence, transformations, circles, solids, problem solving and non-Euclidean geometry. Also includes an almanac with math prefixes and suffixes, study tips, guidelines for using geometry software, a graphing calculator, test-taking strategies, and tables.",
        "Category": " Young Adult Nonfiction , Mathematics , Geometry",
        "Publisher": "Great Source Education Group",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "August",
            "Year": "2018"
        }
    },
    {
        "Title": "Scandalous Miss Howard (Mira Historical Romance)",
        "Authors": "By Ryan, Nan",
        "Description": "Tricked into a brutal and passionless marriage after her one true love supposedly dies in prison during the American Civil War, Laurette Howard discovers that he is alive, living under the name of Sutton Vane, and, using passion as his weapon, is determined to destroy her for betraying him. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Ships from the West",
        "Authors": "By Kearney, Paul",
        "Description": "The electrifying conclusion to the Monarchies of God series finds the tentative alliance between the five Ramusian kingdoms severely tested as they prepare for battle against a shapeshifting immortal and his evil army of inhuman warriors. Original.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Painting & Decorating Boxes (Creative Finishes Series)",
        "Authors": "By Myer, Phillip C.",
        "Description": "A collection of simple and inexpensive techniques for turning ordinary boxes into beautiful home decorations or elegant gifts includes faux finishes, stamping, stenciling, tole painting, fabrics, and tin punching. Original.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Day it Rained Diamonds",
        "Authors": "By Chaber, M. E.",
        "Description": "",
        "Category": "",
        "Publisher": "HOLT, RINEHART AND WINSTON",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Monticello: A Guidebook",
        "Authors": "By Thomas Jefferson Foundation (COR)",
        "Description": "Thomas Jefferson's Monticello is an international treasure. The only residence in America on the United Nations' World Heritage List, it ranks with the Great Wall of China and the pyramids of Egypt as an irreplaceable historical site.  Monticello: A Guidebook is a fully illustrated guide to the house, gardens, and plantation, with authoritative information on Jefferson's extraordinary life and career. Senior members of the Monticello professional staff have prepared this guidebook especially for visitors to Jefferson's mountain.",
        "Category": " History , United States , State & Local , South (AL, AR, FL, GA, KY, LA, MS, NC, SC, TN, VA, WV)",
        "Publisher": "University of Virginia Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2011"
        }
    },
    {
        "Title": "Beatrix Potter's Nursery Rhyme Book",
        "Authors": "By Potter, Beatrix",
        "Description": "Traditional rhymes adapted and illustrated by Beatrix Potter are combined with original rhymes and riddles from her works.",
        "Category": " Juvenile Fiction , Nursery Rhymes",
        "Publisher": "Warne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "The Secret Life of Josephine: Napoleon's Bird of Paradise",
        "Authors": "By Erickson, Carolly",
        "Description": "The bestselling author of The Hidden Diary of Marie Antoinette and The Last Wife of Henry VIII returns with an enchanting novel about the ambitious, amoral, vulnerable woman who became the first wife of Napoleon Bonaparte.Fashion icon, leader of France's society in the turbulent years of the guillotine and the bloody Napoleonic Wars, the alluring Josephine was a tough survivor—yet she also had a gentle, haunting quality that made her irresistible to her contemporaries, especially to the mysterious, compelling stranger from Martinique who captured her heart.",
        "Category": " Fiction , Historical",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Temptation (Language of Love)",
        "Authors": "By Roberts, Nora",
        "Description": "Temptation by Nora Roberts released on Sep 23, 2003 is available now for purchase.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Fodor's Exploring China, 3rd Edition (Exploring Guides)",
        "Authors": "By Knowles, Christopher",
        "Description": "+Description=Praise for Fodor's Exploring Guides\"Astonishingly hip.\"  -- New York Daily News\"Handsomely designed...Fun to leaf through...Conveys a sense of what each destination is like.\"  -- The Los Angeles Times\"Authoritatively written and superbly presented...Worthy reading before, during, or after a trip.\"  -- Philadelphia Inquirer\"Concise, comprehensive, and colorful.\"  --  Washington PostFodor's Exploring Guides are the most up-to-date, full-color guidebooks available.  Covering destinations around the world, these guides are loaded with photos, essays on culture and history, descriptions of sights, and practical information.  Full-color photos make this a great guide to buy if you're still planning your itinerary (let the photos help you choose!) and it's a perfect companion to a general guidebook, like a Fodor's Gold Guide.All the great sights plus the history and anecdotes that bring them to lifeExtraordinary coverage of history and cultureItineraries, walks and excursions, on and off the beaten pathArchitecture and artPractical tips and full-color maps and photosGetting there and getting aroundWhen to go and what to packQuick tips on where to sleep in every price rangeSavvy restaurant picks for all budgets",
        "Category": " Travel , Asia , China",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Walks In Hemingway's Paris",
        "Authors": "By Fitch, Noel Riley",
        "Description": "Walks in Hemingway's Paris is the perfect travel companion to the most romantic and fascinating of cities for those who want to experience Paris beyond the Eiffel Tower and Notre Dame. Covering all the area of Paris that Hemingway and his fellow expatriates once roamed from Left Bank to Right, Noel Riley Fitch provides an intimate visit to major Parisian landmarks as well as to out-of-the-way cafes, hotels and residences immortalized by \"Papa\" and his friends.",
        "Category": " Travel , Europe , France",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Surviving the Sword: Prisoners of the Japanese in the Far East, 1942-45",
        "Authors": "By MacArthur, Brian",
        "Description": "Describes the ordeal of American, British, and Australian prisoners held by the Japanese during World War II, capturing the slavery, torture, disease, and other hardships that they endured, as well as the strength, determination, solidarity, and friendship that helped many of them survive. 25,000 first printing.",
        "Category": " History , Military , World War II",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Finer Things",
        "Authors": "By Joyce, Brenda",
        "Description": "The Power...The Passion...The Incomparable Romance of Brenda JoyceThe PretenderAn orphan from London's East End, a fugitive from the poorhouse, Violet Cooper was tired of sleeping on stoops and being huntry and cold.  But she dared to enter a world forbidden to her and her kind.  Even marriage to a gentle elderly knight and the title Lady Goodwin could not open closed doors, stop the cold stares, or hush the shadowy rumors of murder...The AristocratHe was a man of the world.  The rules of Victorian society did not interest him, nor could a gauche pretender with a Cockney acent possibly turn his head.  Yet Thodore Blake, second son fo the Earl of Harding, was immediately compelled by Violet--and soon found himself defending the investigation.  But wedding vows were the only way to save her from a certain hanging...The Finer ThingsTwo people from different were brought together by passion, bund together by whispered accusations, and torn apart by scandal and misfortune.  The world claimed they should never love each other.  Their hearts claimed otherwise.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "A Forever Kind of Love (Harper Monogram)",
        "Authors": "By Hagan, Patricia",
        "Description": "Returning to her native Tennessee after spending the war years in Ireland, Dancy O'Neal is shocked to find that Clint McCabe, a rebel who crossed over to the Union side during the war, has taken over her property. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Fundamental Accounting Principles (Chapters 1-25)",
        "Authors": "By Larson, Kermit D., Chiappetta, Barbara, and Wild, John J.",
        "Description": "With 50 years of success in the principles of accounting market, Fundamental Accounting Principles, 18e by Wild, Larson and Chiappetta has endured and adapted to changes in accounting, technology, and student learning styles.  Its innovation is reflected in its extensive use of small business examples, the integration of new computerized learning tools, superior end-of-chapter material, and a highly engaging, pedagogical design.  Inclusion of Homework Manager, Homework Mananger Plus and Carol Yacht’s General Ledger and Peachtree application software provides students every advantage as they strive to understand the key concepts of accounting and their role in business.",
        "Category": " Business & Economics , Accounting , General",
        "Publisher": "McGraw-Hill/Irwin",
        "Price Starting With ($)": "9.36",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Kiss Them Goodbye",
        "Authors": "By Cameron, Stella",
        "Description": "After her father's mysterious death, Vivian Patin decides to restore the family's recent inheritance, a plantation named Rosebank, and open it as a resort hotel, but murder and mystery abound. Reprint.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Witches' Supermarket (Martha Speaks)",
        "Authors": "By Meddaugh, Susan",
        "Description": "While wearing her Halloween witch costume, Helen and her dog Martha, stumble upon a strange supermarket filled with toads, poison mushrooms, brooms, and other unusual items, and must use some Halloween magic to escape",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Rand McNally Book of Favorite Bible Stories and Verses",
        "Authors": "By Mary alice Jones",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally & Company",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Sparknotes: Hamlet (William Shakespeare)",
        "Authors": "By Shakespeare, William",
        "Description": "Get your \"A\" in gear!They're today's most popular study guides-with everything you need to succeed in school. Written by Harvard students for students, since its inception SparkNotes™ has developed a loyal community of dedicated users and become a major education brand. Consumer demand has been so strong that the guides have expanded to over 150 titles.  SparkNotes'™ motto is Smarter, Better, Faster because:·   They feature the most current ideas and themes, written by experts.·   They're easier to understand, because the same people who use them have also written them.·   The clear writing style and edited content enables students to read through the material quickly, saving valuable time.And with everything covered--context; plot overview; character lists; themes, motifs, and symbols; summary and analysis, key facts; study questions and essay topics; and reviews and resources--you don't have to go anywhere else!",
        "Category": " Study Aids , Book Notes",
        "Publisher": "Spark Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Othello (Folger Library)",
        "Authors": "By William Shakespeare, Louis B. Wright and Virginia A. LaMar",
        "Description": "A discussion of the sources and historical background of the play accompanies the text and critical commentaries",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Backyard Tribe",
        "Authors": "By Shulman, Neil B.",
        "Description": "When Dr. Bud Payne of Mobile, Alabama, donates two weeks of his time to a Kenyan village hospital, it is the beginning of an astonishing adventure for him and his family.Bud offers to fly a young Maasai girl back to America for life-saving heart surgery. She comes - but not alone: her entire tribe is with her, Maasai warriors carrying spears, mothers in tribal dress carrying babies, even a mysterious medicine man alight from the airplane.The girl goes to the hospital, but the tribe goes to the Paynes' backyard. Gone are Gail Payne's prized rose beds, gone is the lawn. In their place are the mud huts of the Maasai.As the suburban neighbors mingle with the tribesmen and the medicine man mingles with the surgeons, hilarious, harrowing, and even enlightening adventures result. The warriors rustle the nearest redneck's prime dairy cow for slaughter, and the Paynes' children swap their school clothes for war paint. Gail nearly loses her mind and Bud nearly loses his medical license.However, it all leads to a classic happy ending, heightened by a cultural exchange beyond anyone's original dreams.",
        "Category": " Fiction , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The Pill Book  10th Edition: New and Revised (Pill Book (Mass Market Paper))",
        "Authors": "By Silverman, Harold M.",
        "Description": "Based on information from the Food and Drug Administration, an updated consumer's guide offers up-to-date profiles of more than 1,500 of the most commonly prescribed drugs in America, including generic and brand names, usual dosages, and side effects, as well as color photographs. Original",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Bantam New College Spanish & English Dictionary",
        "Authors": "By Williams, Edwin B.",
        "Description": "No other portable Spanish & English paperbound dictionary offers you so much for your money. With 736 pages and more than 80,000 entries, it is the most comprehensive Spanish & English dictionary of its kind, designed by a foremost authority for the greatest convenience and use.  It includes thousands of modern words and phrases that you won’t find anywhere else.  Among the special features included in this new edition: concise Spanish grammar, with a full list of irregular verbs; rules for the use of plurals and articles; detailed guides to Spanish pronunciation and word gender; Latin American usage by country; plus a thumb index for quick reference and greater convenience. You get all these features–and much more–in this one, easy-to-use, easy-to-carry compact volume.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Mr. Tompkins in Paperback",
        "Authors": "By Gamow, George",
        "Description": "Mr Tompkins has become known and loved by many thousands of readers (since his first appearance over fifty years ago) as the bank clerk whose fantastic dreams and adventures lead him into a world inside the atom. George Gamow's classic provides a delightful explanation of the central concepts in modern physics, from atomic structure to relativity, and quantum theory to fusion and fission. Roger Penrose's new foreword introduces Mr Tompkins to a new generation of readers, and reviews his adventures in the light of current developments in physics today.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Cambridge University Press (Canto Imprint)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "The Moon Looked Down",
        "Authors": "By Garlock, Dorothy",
        "Description": "The new Americana romance from bestselling author Dorothy Garlock, this time set against the backdrop of WWII.     Sophie Heller's family immigrated from Germany to Victory, a small town in Illinois, before WWII began.  Now that the war has affected the town, the townspeople discriminate against Sophie and her family.  When a train derails, it is an accident but the Heller family is blamed.  Coming to Sophie's rescue is a teacher from the high school, and despite their cultural differences, a romance starts to bloom.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Mercycle",
        "Authors": "By Anthony, Piers",
        "Description": "On Earth with the hope of saving the planet from a meteor strike, an alien from an alternate reality recruits five humans to help him on his mission, using his advanced technology to enable them to breathe while under water. Reprint.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Sparky and Eddie: First Day of School",
        "Authors": "By Johnston, Tony and Ryan, Susannah (ILT)",
        "Description": "Even though they are not in the same class, two young friends are glad that they decided to give school a try",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "501 Recipes for a Low-Carb Life",
        "Authors": "By Gillespie, Gregg R. and Johnson, Mary B.",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.86",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Pumpkin Man: Level 2 (HELLO READER LEVEL 2)",
        "Authors": "By Moffatt, Judith",
        "Description": "Using a carved pumpkin for a head, old stuffed clothes for a body, and boots for feet, two small children delight in seeing their autumn creation come together and are proud of the end results. Original.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Dead Witch Walking",
        "Authors": "By Harrison, Kim",
        "Description": "The first book in #1 New York Times bestselling author Kim Harrison's Hollows series!All the creatures of the night gather in \"the Hollows\" of Cincinnati, to hide, to prowl, to party . . . and to feed.Vampires rule the darkness in a predator-eat-predator world rife with dangers beyond imagining—and it's Rachel Morgan's job to keep that world civilized.A bounty hunter and a witch with serious sex appeal and an attitude, she'll bring 'em back alive, dead . . . or undead.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Out of Sight (The Men of T-FLAC: The Wrights, Book 5)",
        "Authors": "By Adair, Cherry",
        "Description": "Sometimes chemistry is a matter of life and death. . . .Though her confidence is badly shaken by a training accident, A. J. Cooper vows to become an excellent T-FLAC operative. She is everything the antiterrorist agency looks for—she’s smart, resourceful, and a crack shot. Eager to prove herself to her instructor, the highly regarded Kane Wright, A. J. takes on a difficult and potentially deadly assignment. A success in the field could be just the thing she needs to make her career with the agency—and working so closely with the extraordinary and irresistibly sexy Kane is a fantasy come to life.Kane Wright is a master of disguise, hiding his powerful attraction for A. J. in the name of professionalism.  But when she doesn’t bounce back quickly after her accident, Kane’s desire becomes concern. In the field, even a moment’s hesitation can turn a routine operation into a deadly one. With A. J. taking a lead position in this mission, Kane knows he won’t be able to take his eyes off his gorgeous tomboy trainee.  Under the hot desert sun, even as they struggle to unravel a madman’s devious plot, their long denied passion will finally boil over. . . .",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "What Was it Like in the Concentration Camp at Dachau?",
        "Authors": "By Neubausler, Dr. Johann",
        "Description": "",
        "Category": "",
        "Publisher": "Trustees for the Monument of Atonement in the Concentration Camp at Dachau",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Into the Green",
        "Authors": "By De Lint, Charles",
        "Description": "Accepting a gift of a magical harp from Jacky Lantern's fey kin, Angharad follows the wandering ways of bardic life, using her music to awaken the Summerblood magic throughout the Kingdom of the Green Isles. Reprint.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Tor Fantasy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Just Generosity: A New Vision for Overcoming Poverty in America",
        "Authors": "By Sider, Ronald J., Dilulio, John J. (FRW), Colson, Charles W. (FRW), and Rivers, Eugene F.",
        "Description": "",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "Baker Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Celts",
        "Authors": "By Chadwick, Nora",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1971"
        }
    },
    {
        "Title": "American Labor (History of American Civilization)",
        "Authors": "By Pelling, Henry.",
        "Description": "Traces the 300 years of labor in America and shows the development of unionism",
        "Category": " Business & Economics , General",
        "Publisher": "Univ of Chicago Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1960"
        }
    },
    {
        "Title": "The Huffington Post Complete Guide to Blogging",
        "Authors": "By Huffington Post and Huffington, Adrianna (INT)",
        "Description": "The editors of The Huffington Post -- the most linked-to blog on the web -- offer an A-Z guide to all things blog, with information for everyone from the tech-challenged newbie looking to get a handle on this new way of communicating to the experienced blogger looking to break through the clutter of the Internet. With an introduction by Arianna Huffington, the site's cofounder and editor in chief, this book is everything you want to know about blogging, but didn't know who to ask.   As entertaining as it is informative, The Huffington Post Complete Guide to Blogging will show you what to do to get your blog started. You'll find tools to help you build your blog, strategies to create your community, tips on finding your voice, and entertaining anecdotes from HuffPost bloggers that will make you wonder what took you so long to blog in the first place.   The Guide also includes choice selections from HuffPost's wide-ranging mix of top-notch bloggers. Among those who have blogged on HuffPost are Barack Obama, Hillary Clinton, Larry David, Jane Smiley, Bill Maher, Nora Ephron, Jon Robin Baitz, Steve Martin, Lawrence O'Donnell, Ari Emanuel, Mia Farrow, Al Franken, Gary Hart, Barbara Ehrenreich, Edward Kennedy, Harry Shearer, Nancy Pelosi, Adam McKay, John Ridley, and Alec Baldwin.",
        "Category": " Computers , Web , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Tell Me What to Eat If I Have Acid Reflux: Nutrition You Can Live With",
        "Authors": "By Magee, Elaine",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "New Page Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "A Contemporary Translation of Luther's Small Catechism Study Edition",
        "Authors": "By Martin Luther",
        "Description": "",
        "Category": "",
        "Publisher": "Augsburg Fortress",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Hello, Mrs. Piggle-Wiggle",
        "Authors": "By MacDonald, Betty",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Card Crafting: Over 45 Ideas For Making Greeting Cards & Stationery",
        "Authors": "By Souter, Gillian",
        "Description": "Use a wide range of basic techniques, including lettering, découpage, pop-up methods, embossing, marbling, stenciling, cross-stitch embroidery, appliqué, and even lovely paper quilling.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "The Italian Gourmet : authentic Ingredients and traditional recipes from the kitchens of Italy",
        "Authors": "By Mistretta, Giorgio",
        "Description": "",
        "Category": "",
        "Publisher": "Weldon Russell",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Unconquered",
        "Authors": "By Howell, Hannah",
        "Description": "Left a bequest by a woman with rare psychic powers, Eada of Pevensey suddenly finds herself in possession of a box containing a mysterious document. . .and something even more extraordinary: the gift of second sight. Now she can actually \"see\" her chilling fate: a Norman invader with sea-dark eyes riding across the fields to claim her lands. . .and her love.A reluctant soldier for William the Conquerer, Drogo de Toulon seizes the Pevensey lands as a right of conquest. . .and meets a woman who defies him at every turn--and arouses uncontrollable desire. Yet now, as war rages across a divided England, the two lovers must find the bond that joins body and soul. . .as they chart a course through battle and betrayal that could break their hearts--or seal their passion for all time. . .Praise for Hannah Howell and her Highland novels. . .\"Few authors portray the Scottish highlands as lovingly or colorfully as Hannah Howell.\" --Publishers Weekly\"Expert storyteller Howell pens another Highland winner.\" --Romantic Times",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "You Never Can Tell",
        "Authors": "By Eagle, Kathleen",
        "Description": "How can you find a man who doesn't want to be found?\"Where is he now?\" That's the question on everyone's lips about strong, sexy Native American Kole Kills Crow. He was once a media darling -- men wanted to be him... women wanted to be with him. But tragedy convinced Kole that it was time to vanish. Now, reporter Heather Reardon has ,turned up at his door, and although she's a tempting package, it's one he's hesitant to open -- at first.Heather is feeling pretty proud of herself for finding her man -- even if she does have to track him down in some backwoods bar -- until she discovers that the hero of her fantasies wants nothing to do with his past. Nights spent together in his warm cabin reawaken the fire within him, and Heather ignites a shared passion that neither of them expected. But then Kole is thrust back into the harsh public spotlight, forcing him to face down the demons that still haunt him... and making Heather wonder if she can trust her heart. to a lover who will never be completely hers.",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Shadow Music: A Novel",
        "Authors": "By Garwood, Julie",
        "Description": "Throughout her acclaimed writing career, Julie Garwood has captivated readers with characters who are compelling, daring, and bursting with life. Now one of the most popular novelists of our time proudly returns to her beloved historical romance roots–in a thrilling tale of love, murder, adventure, and mystery set against the haunting landscape of medieval Scotland.For Princess Gabrielle of St. Biel, Scotland is a land of stunning vistas, wild chieftains, treacherous glens, and steep shadows–skullduggery, betrayal, and now murder. Prized for her exquisite beauty, the daughter of one of England’s most influential barons, Gabrielle is also a perfect bargaining chip for a king who needs peace in the Highlands: King John has arranged Gabrielle’s marriage to a good and gentle laird. But this marriage will never take place.For Gabrielle, everything changes in one last burst of freedom–when she and her guards come upon a scene of unimaginable cruelty. With one shot from her bow and arrow, Gabrielle takes a life, saves a life, and begins a war.Within days, the Highlands are aflame with passions as a battle royal flares between enemies old and new. Having come to Scotland to be married, Gabrielle is instead entangled in Highland intrigue. For two sadistic noblemen, underestimating Gabrielle’s bravery and prowess may prove fatal. But thanks to a secret Gabrielle possesses, Colm MacHugh, the most feared man in Scotland, finds a new cause for courage. Under his penetrating gaze, neither Gabrielle’s body nor heart is safe.A gripping novel that delves into the heart of emotions–unyielding passions of love, hate, revenge, and raw desire–Shadow Music is magnificent gift from Julie Garwood and a crowning achievement in her amazing career.From the Hardcover edition.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Sooner or Later (Deliverance Company #2)",
        "Authors": "By Macomber, Debbie",
        "Description": "The sequel to #1 New York Times bestselling author Debbie Macomber's classic Someday Soon!When stubborn but proper Texas postmistress Letty Madden hires a rough soldier, Jack Murphy, to help her find her brother for the price of one night together, she has no idea that he will fall deeply in love with her.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Harper/Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Crocodiles (Know It Alls)",
        "Authors": "By Trimble, Irene and Cassels, Jean (ILT)",
        "Description": "Covers facts about various species of crocodiles, such as size, diet, and location.",
        "Category": " Juvenile Nonfiction , Animals , Reptiles & Amphibians",
        "Publisher": "McClanahan Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Marriage Contract",
        "Authors": "By Maxwell, Cathy",
        "Description": "He was a man exiled from society - handsome, unpredictable, and proud. Dark rumours surrounded his name. But Anne Burnett had signed a marriage contract binding her to Aiden Black, the Earl of Tiebauld. And although she′d never met him, she′s determined to keep her word and make theirs a marriage in truth. Because a well-bred lady with little fortune to recommend her has no choice. From the moment she arrived, Anne fell in love with Kelwin Castle and its roguishly handsome laird. By day, he instils a fierce loyalty in his people with his masterful ways...and by night, he tempts Anne to surrender her innocence to him. But while he is willing to offer his body, Aiden refuses to give Anne his heart...making her wonder what prevents him from truly claiming her as his wife.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Black Crow, Black Crow",
        "Authors": "By Parker, Nancy Winslow (ILT) and Guy, Ginger Foglesong",
        "Description": "High up in a tree, a mother crow tends her young.",
        "Category": "",
        "Publisher": "Greenwillow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Amelia's Most Unforgettable Embarrassing Moments",
        "Authors": "By Moss, Marissa",
        "Description": "A Note from the Author -- Amelia!  \"I don't know what's worse -- sharing a dorm with girls I don't know or sharing one with a girl I know too well -- my sister, Cleo. This school trip is a major lesson in embarrassment!\" -- Me, Amelia  Notes from Amelia's Fans:  \"Amelia is getting older and she is going through the same things as my friends and I. Maybe you would not be embarrassed to write about that stuff...\" (I'm blushing, but still writing...) -- Vanesa, age 13  \"I started to have my own notebook, and my problems were fixed like presto!\" (Hooray! Here's to notebook power!) -- Isabella",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Simon & Schuster/Paula Wiseman Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Cordina's Royal Family: Gabriella & Alexander: Affaire RoyaleCommand Performance",
        "Authors": "By Roberts, Nora",
        "Description": "This first installment in the Cordina's Royal Family series features two classic tales--Affaire Royale, in which Princess Gabriella, plagued by amnesia following a kidnapping, falls for an ex-policeman, and Command Performance, in which Prince Alexander finds love with a woman from his past. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Step-by-Step Cabinets & Shelves (Better Homes & Gardens Step-By-Step)",
        "Authors": "By Better Homes and Gardens Books (EDT), Marshall, Paula (EDT), and Meredith Books (COR)",
        "Description": "The everyday homeowner can create perfect cabinets and shelves for any room with this essential resource. No special skills needed. Easy-to-follow instructions offer guidance every step of the way, from selecting the right materials to building to installation.Practical, doable projects.Includes color illustrations with step-by-step instructions.Expert tips on all the tricks of the trade for building and installing cabinets.",
        "Category": " House & Home , Do-It-Yourself , Carpentry",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Cabinets & Built-Ins: 26 Custom Storage Projects",
        "Authors": "By Hughes, Herb, Oberrect, Kenn, Flexner, Bob, and Creative Homeowner Press (COR)",
        "Description": "Readers can enhance every room in their home with the twenty-six practical and beautiful storage projects they will find in Cabinets & Built-Ins.  They will find space-saving ideas, such as shelves to mount to the inside of the kitchen cabinet doors, and ambitious projects, such as the entertainment center.  Yet no matter how large the project, none are difficult.  All of the projects have been designed with simple, sturdy joinery that can be easily accomplished in a home workshop.  Cabinets & Built-Ins opens with a thoroughly illustrated techniques chapter that explains every method needed to construct all the projects.  Renowned wood-finishing expert Bob Flexner teaches how to keep projects looking great for generations to come.",
        "Category": " House & Home , Do-It-Yourself , Carpentry",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Expiration Date",
        "Authors": "By Powers, Tim",
        "Description": "Los Angeles is filled with ghosts--and half-ghosts, and ghost hunters, and ghost junkies--chasing each other in a mad quest for immortality. As a series of disasters strikes Los Angeles, a young boy inhales the last breath of Thomas Edison, and becomes a precious prize in a deadly hunt for the elusive vitalspark. Brimming with the wild imagination and heart-stopping escapades that won Tim powers the World Fantasy Award, Expiration Date is an exuberant and inventive tale from one of fantasy's most original talents.",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Tor Fantasy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Proclamation 3: AIDS for Interpreting the Lessons of the Church Year, Series B : Pentecost II",
        "Authors": "By Harrington, Daniel",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Some Like It Wicked (Kincaid Highlands)",
        "Authors": "By Medeiros, Teresa",
        "Description": "Some like it dangerous . . .Highland beauty Catriona Kincaid cares nothing for propriety—or even her own safety—when she storms the grounds of Newgate Prison. Determined to return to Scotland and restore her clan's honor, she seeks the help of Sir Simon Wescott, a disgraced nobleman and notorious rogue. She is prepared to offer him both wealth and freedom, but she never dreams the wicked rake will be bold enough to demand a far more sensual prize.Some like it seductive . . .Simon is shocked to discover the tomboy he met long ago has blossomed into a headstrong temptress. Although he's sworn off his dreams of becoming a hero, he can't resist playing knight errant to Catriona's damsel in distress. Both adventure and peril await them at her Highland home, where they will risk their lives to vanquish her enemies . . . and risk their hearts to discover a passion beyond their wildest dreams.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "A Way in the World: A Novel",
        "Authors": "By Naipaul, V. S.",
        "Description": "In his long-awaited, vastly innovative new novel, Naipaul, \"one of literature's great travelers\" (Los Angles Times), spans continents and centuries to create what is at once an autobiography and a fictional archaeology of colonialism. \"Dickensian . . . a brilliant new prism through which to view (Naipaul's) life and work.\"--New York Times.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Santa Fe Trail (The Trail Drive Series Book 10)",
        "Authors": "By Compton, Ralph",
        "Description": "An extraordinary saga of the trail-blazing cowboys who made their fortune driving cattle from Texas to the Great Frontier.They left Missouri and were headed to Santa Fe. Standing in their way was a parched desert, a land of outlaws and enemies-and one man's dangerous past.He was a wealthy englishman with two beautiful daughters. They were five dusty texans and a gambling man. And they were all on the ride of their lives.The only riches Texans had left after the Civil War were five million maverick longhorns and the brains, brawn and boldness to drive them north to where the money was. Now, Ralph Compton brings this violent and magnificent time to life in an extraordinary epic series based on the history-making trail drives.The Santa Fe TrailGavin McCord and his brawling cowboys came to Missouri with a problem: 3,500 longhorns and not one buyer. That's where Gladstone Pitkin came in. A man with money and a dream of ranching in New Mexico, Pitkin bought McCord's cattle and hired his Texans for a trail drive from Independence to Santa Fe. But with an ill-fated gambler on the drive, the courageous, hardened riders weren't just a thousand brutal miles from Santa Fe-they were heading into a death trap.",
        "Category": " Fiction , Westerns",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Wild Road (Dirk & Steele, Book 8)",
        "Authors": "By Liu, Marjorie M.",
        "Description": "",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Ultimate Container Gardener: All You Need to Know to Create Plantings for Spring, Summer, Autumn, and Winter",
        "Authors": "By Donaldson, Stephanie",
        "Description": "This is an essential guide to successful gardening in containers, outside and inside the home.",
        "Category": " Gardening , Container",
        "Publisher": "Lorenz Books",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Highlander Ever After",
        "Authors": "By Ashley, Jennifer",
        "Description": "Seeking refuge at the remote MacDonald castle after being exiled from her native country, Princess Zarabeth, while dealing with an ancient curse, a matchmaking nephew, two bitter rivals, and dark secrets, loses herself in Egan MacDonald's sensual embrace. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "His Reluctant Mistress",
        "Authors": "By Maitland, Joanna",
        "Description": "Lord Leo Aikenhead&#151;renowned rake, skilled seducer and expert spy&#151;has finally met his match. For opera singer Sophie Pietre may have the voice of an angel, but she will be no man's strumpet&#151;no matter how handsome he is!But these are dangerous times in Vienna, with betrayal and deceit round every corner. Sophie's tempted by his offer of protection and&#151;she can no longer deny it&#151;even more tempted by the offer of a place in his bed&#133;.",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Sizzling Mexican recipes (Favorite all time recipes)",
        "Authors": "By Anon",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Nightfall",
        "Authors": "By Stuart, Anne",
        "Description": "A woman in love with convicted murderer Richard Tiernan will do anything to have him--even when she learns the truth about his wife's death and his children's disappearance. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Onyx",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Promises: A Novel",
        "Authors": "By Plain, Belva",
        "Description": "With her three children, beautiful home, and loving husband, Margaret Crane is a woman others would envy.  Adam's job has cushioned them nicely over the years, and it should be a time of contentment, rewards, of new challenges together.  But lately Adam has been working too late, too hard, at the office. Margaret is sure it's just the rumored takeover of his company--until she meets Randi, The Other Woman...Meanwhile, Nina, the orphaned cousin the Cranes raised as their own daughter, is reveling in New York.  She thinks she's found Mr. Right in Keith, a brilliant investment banker.  But Keith has a secret he has not shared with Nina.  All he asks for is time...and patience.  And as Nina clings to stolen weekends with Keith, Margaret plays dutiful wife, trying to ignore warning signs of her own failing marriage.  A rift has developed between the two women who have loved each other as mother, daughter, friends.  Keith is not welcome in Margaret's home.  And Nina herself is the other woman...",
        "Category": " Fiction , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Twenty Wishes (A Blossom Street Novel, 5)",
        "Authors": "By Macomber, Debbie",
        "Description": "What Anne Marie Roche wants is to find happiness again. At thirty-eight, she's childless, a recent widow, alone. She owns a successful bookstore on Seattle's Blossom Street, but despite her accomplishments, there's a feeling of emptiness.On Valentine's Day, Anne Marie and several other widows get together to celebrate&#133;hope. They each begin a list of twenty wishes, things they always wanted to do but never did.Anne Marie's list includes learning to knit, falling in love again, doing good for someone else. When she volunteers at a local school, an eight-year-old girl named Ellen enters her life. It's a relationship that becomes far more involving&#151;and far more important&#151;than Anne Marie had ever imagined.As Ellen helps Anne Marie complete her list of twenty wishes, they both learn that wishes can come true&#133;but not necessarily in the way you expect.",
        "Category": " Fiction , Women",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Suddenly",
        "Authors": "By Delinsky, Barbara",
        "Description": "“Delinsky knows the human heart and its immense capacity to love and to believe.”—Washington Observer-Reporter“A first-rate storyteller” (Boston Globe), the incomparable Barbara Delinsky is renowned for capturing the essence of contemporary life: from day-to-day victories and setbacks to momentous events that profoundly affect us all. Nowhere is that more true than in her beloved novel Suddenly. Set in a small Vermont town, this deeply heartfelt, emotionally charged novel explores the enduring consequences of one irrevocable act—a classic from the New York Times bestselling author of A Woman Betrayed, For My Daughters, and The Passions of Chelsea Kane.",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "In a Strange City (Tess Monaghan Novel)",
        "Authors": "By Lippman, Laura",
        "Description": "New York Times bestselling author Laura Lippman’s Tess Monaghan must put her PI skills to the ultimate test when she falls into the crosshairs of a psychopath who knows everything about her.For the past fifty years on the birth date of Edgar Allan Poe, a person wearing a cloak has placed three roses and a half bottle of cognac on the writer’s gravesite. PI Tess Monaghan has never witnessed the event. But when John P. Kennedy, an eccentric antiques dealer, asks her to uncover the identity of the caped visitor, who he believes has duped him with the sale of an inauthentic antique, Tess decides to hold vigil on the night the cloaked stranger is expected to make an appearance. But the custom takes on a bizarre, fatal twist when two cloaked figures arrive. The imitator leaves his tribute and then makes his escape…after shooting the first visitor. Warning bells tell Tess to steer clear of this case. But when roses and cognac appear on her doorstep, Tess’s curiosity is piqued. She soon discovers that John P. Kennedy has vanished into thin air and much of what he told her was questionable. Then the identity of the shooting victim comes to light, and all clues seem to point to the possibility he was the target of a hate crime. But Tess isn’t convinced. What was his connection to the decades-long Edgar Allan Poe tradition and to the killer? When more cryptic clues are left at her home, Tess realizes that someone is watching her every move...someone who’s bent on killing again.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Inn At Eagle Point (A Chesapeake Shores Novel)",
        "Authors": "By Woods, Sherryl",
        "Description": "It's been years since Abby O'Brien Winters set foot in Chesapeake Shores. The Maryland town her father built has too many sad memories and Abby too few spare moments, thanks to her demanding Wall Street career, the crumbling of her marriage and energetic twin daughters. Then one panicked phone call from her youngest sister brings her racing back home to protect Jess's dream of renovating the charming Inn at Eagle Point.But saving the inn from foreclosure means dealing not only with her own fractured family, but also with Trace Riley, the man Abby left ten years ago. Trace can be a roadblock to her plans&#133;or proof that second chances happen in the most unexpected ways.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Marcella's Italian Kitchen",
        "Authors": "By Hazan, Marcella",
        "Description": "A collection of 250 Italian recipes provides for the current trend toward light, flavorful dishes and fresh ingredients and includes an additional section on how to prepare Italian ice creams and sorbets at home. Reprint. 25,000 first printing. Tour.",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "The Runaway McBride (A Seers of Grampian Novel)",
        "Authors": "By Thornton, Elizabeth",
        "Description": "James Burnett is a widower who’s given up hope of finding someone to share his life with. He did, however, once have a lover he later dubbed Faithless McBride. For eight years, he’d suppressed thoughts of Faith McBride’s abandonment with whiskey and women. That is, until visions of her imminent death started to haunt him. Only James can save her from a killer—but can Faith trust the one man who destroyed her faith in love?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Annuals, Perennials, & Bulbs",
        "Authors": "By Halpin, Anne",
        "Description": "Stunning flower gardens that bloom through the seasons depend on the artful combination of annuals, perennials, and bulbs.  In this lavishly illustrated book, Anne Halpin shows the reader how to grow these plants and gives foolproof design techniques for any landscape.  The extensive section on using color in the garden can guide you through the tricky process of plant placement and selection.  Practical techniques are emphasized too.  The reader will learn how to care for soil, start plants from seeds, grow and care for plants in containers, and maintain plants and gardens.  Sections on dividing plants, lifting bulbs, and saving seeds are also included.",
        "Category": " Gardening , Flowers , General",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Black Swan (Fairy Tale Series, Book 2)",
        "Authors": "By Lackey, Mercedes",
        "Description": "After his wife's untimely death, a powerful sorcerer dedicates his life to seeking revenge against all womankind.  He turns his captives into beautiful swans--who briefly regain human form by the fleeting light of the moon. Only Odette, noblest of the enchanted flock, has the courage to confront her captor. But can she gain the allies she needs to free herself and the other swan-maidens from their magical slavery? A monumental tale of loyalty and betrayal, of magic good and evil, of love both carnal and pure, and of the duality of human nature, The Black Swan is a rich tapestry which is sure to become an all-time masterpiece of fantasy.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "DAW",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Complete Guide to Digital Video",
        "Authors": "By Gaskell, Ed",
        "Description": "\"Complete Guide to Digital Video\" will walk you from beginner to expert, whatever your level of ambition. It's the shooting script for aspiring Spielbergs, both young and old, covering the basic techniques of shooting, lighting, editing, and publishing, all the way through to expert insider views of the video-maker's art. Whether spicing up home movies or preparing professional presentations, this book will give you the tools to create great-looking movies.",
        "Category": " Technology & Engineering , Electronics , Digital",
        "Publisher": "Course Technology PTR",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Mr. Antiques' Basic Book of Antiques",
        "Authors": "By Michael, George",
        "Description": "",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Wallace-Homestead Book Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Fortune at the Bottom of the Pyramid: Eradicating Poverty Through Profits",
        "Authors": "By Prahalad, C. K.",
        "Description": "Presents the theory that there are commercial opportunities in the poor nations of the world for private companies, and that companies can utilize this knowledge to make profits and at the same time fight poverty.",
        "Category": " Social Science , Developing & Emerging Countries",
        "Publisher": "Wharton School Publishing",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Future of Competition: Co-Creating Unique Value With Customers",
        "Authors": "By Prahalad, C. K. and Ramaswamy, Venkat",
        "Description": "In this visionary book, C. K. Prahalad and Venkat Ramaswamy explore why, despite unbounded opportunities for innovation, companies still can't satisfy customers and sustain profitable growth. The explanation for this apparent paradox lies in recognizing the structural changes brought about by the convergence of industries and technologies; ubiquitous connectivity and globalization; and, as a consequence, the evolving role of the consumer from passive recipient to active co-creator of value. Managers need a new framework for value creation. Increasingly, individual customers interact with a network of firms and consumer communities to co-create value. No longer can firms autonomously create value. Neither is value embedded in products and services per se. Products are but an artifact around which compelling individual experiences are created. As a result, the focus of innovation will shift from products and services to experience environments that individuals can interact with to co-construct their own experiences. These personalized co-creation experiences are the source of unique value for consumers and companies alike.In this emerging opportunity space, companies must build new strategic capital--a new theory on how to compete. This book presents a detailed view of the new functional, organizational, infrastructure, and governance capabilities that will be required for competing on experiences and co-creating unique value. C. K. Prahalad is the Harvey C. Fruehauf Professor of Business Administration at the University of Michigan Business School and co-author of the landmark best seller, Competing for the Future. His research, for over twenty years, has consistently focused on \"next\" practices. Venkat Ramaswamy is the Michael R. and Mary Kay Hallman Fellow of Electronic Business and Professor of Marketing at the University of Michigan Business School. His research focuses on new frontiers in co-creating value.",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Identity Crisis",
        "Authors": "By Mack, Debbi",
        "Description": "A simple domestic abuse case turns deadly when the alleged abuser is killed and Sam McRae's client disappears. When a friend asks Sam to find Melanie Hayes, the Maryland attorney is drawn into a complex case of murder and identity theft that has her running from the mob, breaking into a strip club, and forming a shaky alliance with an offbeat private investigator to get to the truth about Melanie and her boyfriend. With her career and life on the line, Sam's search takes her from the blue-collar Baltimore suburbs to the mansions of Gibson Island. Along the way, she learns that false identities can hide dark secrets, and those secrets can destroy lives.",
        "Category": "",
        "Publisher": "Quiet Storm Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Companions along the way: Sermons about relationships",
        "Authors": "By Wade, Francis Howard",
        "Description": "",
        "Category": "",
        "Publisher": "Posterity Press",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Next Victim",
        "Authors": "By Prescott, Michael",
        "Description": "Three years after the serial killer Mobius murdered FBI agent Tess McCullum's lover, he resurfaces in Los Angeles with a chemical nerve weapon that could kill thousands, and Tess is determined to do whatever it takes to stop him.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Black Rood",
        "Authors": "By Lawhead, Steve",
        "Description": "“LAWHEAD KNOWS HOW TO SPIN A TALE.”—BooklistIn a time of legends and heroes, blood and mystery, one man will carry on his family’s destiny as he sets upon a dangerous and glorious quest.The Great Crusade is long over, or so Duncan, son of Murdo, believes until a long-lost uncle appears from the East bearing tales of immense treasure. Though the Iron Lance had been won for the emperor, an even holier relic has been found: the Black Rood—the prayer-worn, blood-stained remnant of the True Cross—now endangered by the greedy ambitions of ruthless crusader barons bent on carving kingdoms from the desert sands of the Middle East.When Duncan’s life is shattered by tragedy, he sets sail on his own pilgrimage to Jerusalem, following in the footsteps of his father. But the gates to the Holy Land are guarded by the warrior priests known as the Knights Templar. These fearsome guardians hold the key to more than just Duncan’s fate—the very destiny of the West is in their hands. “HISTORICAL DETAILS BRING THE SETTING TO ROBUST LIFE.”—Publishers Weekly",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "A Time of Exile (Deverry Series, Book Five)",
        "Authors": "By Kerr, Katharine",
        "Description": "The world of Deverry: an intricate tapestry of fate, past lives, and unfathomable magic. With A Time Of Exile, Katharine Kerr opens new territory in The Deverry Saga, exploring the history of the Elcyion Lacar, the elves who inhabit the country west of Deverry. It is years since the half-elven Lord Rhodry took the throne of Aberwyn. When Rhodry's lost lover, Jill-now a powerful wizard-comes to Aberyn and tells him it's time he accepted his elven heritage, Rhodry faces the most difficult choice of his life. But with Jill's help and that of a human wizard named Aderyn who has lived for years in the westlands, Rhodry begins to understand how his life is connected not just to his own people, but to the Elcyion Lacar as well. At last, destiny begins to unravel its secrets, revealing Aderyn's true purpose among the elves-and the god' deeper design behind Rhodry's dual heritage.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "A Tale of Two Cities (Barnes & Noble Classics)",
        "Authors": "By Dickens, Charles and Wood, Gillen D'Arcy",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RA Tale of Two Cities&&L/I&&R, by &&LB&&RCharles Dickens&&L/B&&R, is part of the &&LI&&R&&LI&&RBarnes & Noble Classics&&L/I&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&R“It was the best of times, it was the worst of times . . .” With these famous words, &&LB&&RCharles Dickens&&L/B&&R plunges the reader into one of history’s most explosive eras—the French Revolution. From the storming of the Bastille to the relentless drop of the guillotine, Dickens vividly captures the terror and upheaval of that tumultuous period. At the center is the novel’s hero, Sydney Carton, a lazy, alcoholic attorney who, inspired by a woman, makes the supreme sacrifice on the bloodstained streets of Paris. &&LP&&ROne of Dickens’s most exciting novels, &&LI&&RA Tale of Two Cities&&L/I&&R is a stirring classic of love, revenge, and resurrection. &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&RGillen D’Arcy Wood&&L/B&&R&&L/B&&R received his Ph.D in English from Columbia University in 2000 and is currently an assistant professor at the University of Illinois, Urbana-Champaign. He is the author of &&LI&&RThe Shock of the Real: Romanticism and Visual Culture, 1760–1860&&L/I&&R. &&L/P&&R&&L/DIV&&R",
        "Category": " Fiction , Historical , General",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "The Tempest (Folger Shakespeare Library)",
        "Authors": "By Shakespeare, William, Mowat, Barbara A., and Werstine, Paul",
        "Description": "Putting romance onstage, The Tempest gives us a magician, Prospero, a former duke of Milan who was displaced by his treacherous brother, Antonio. Prospero is exiled on an island, where his only companions are his daughter, Miranda, the spirit Ariel, and the monster Caliban. When his enemies are among those caught in a storm near the island, Prospero turns his power upon them through Ariel and other spirits. The characters exceed the roles of villains and heroes. Prospero seems heroic, yet he enslaves Caliban and has an appetite for revenge. Caliban seems to be a monster for attacking Miranda, but appears heroic in resisting Prospero, evoking the period of colonialism during which the play was written. Miranda’s engagement to Ferdinand, the Prince of Naples and a member of the shipwrecked party, helps resolve the drama. The authoritative edition of The Tempest from The Folger Shakespeare Library, the trusted and widely used Shakespeare series for students and general readers, includes: -Freshly edited text based on the best early printed version of the play -Full explanatory notes conveniently placed on pages facing the text of the play -Scene-by-scene plot summaries -A key to the play’s famous lines and phrases -An introduction to reading Shakespeare’s language -An essay by a leading Shakespeare scholar providing a modern perspective on the play -Fresh images from the Folger Shakespeare Library’s vast holdings of rare books -An annotated guide to further reading Essay by Barbara A. Mowat The Folger Shakespeare Library in Washington, DC, is home to the world’s largest collection of Shakespeare’s printed works, and a magnet for Shakespeare scholars from around the globe. In addition to exhibitions open to the public throughout the year, the Folger offers a full calendar of performances and programs. For more information, visit Folger.edu.",
        "Category": " Drama , Ancient, Classical & Medieval",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Voyage of the \"Dawn Treader\" (Chronicles of Narnia, Book 3)",
        "Authors": "By Lewis, C. S.",
        "Description": "Lucy and Edmund, accompanied by their peevish cousin Eustace, sail to the land of Narnia where Eustace is temporarily transformed into a green dragon because of his selfish behavior and skepticism.Three English children accompany King Caspian on a perilous voyage through an enchanted ocean",
        "Category": "",
        "Publisher": "Collier Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Dead and Alive: A Novel (Dean Koontz's Frankenstein, Book 3)",
        "Authors": "By Koontz, Dean R.",
        "Description": "From the celebrated imagination of Dean Koontz comes a powerful reworking of one of the classic stories of all time. If you think you know the legend, you know only half the truth. Now the mesmerizing saga concludes. . . .As a devastating hurricane approaches, as the benighted creations of Victor Helios begin to spin out of control, as New Orleans descends into chaos and the future of humanity hangs in the balance, the only hope rests with Victor’s first, failed attempt to build the perfect human. Deucalion’s centuries-old history began as the original manifestation of a soulless vision–and it is fated to end in the ultimate confrontation between a damned creature and his mad creator. But first they must face a monstrosity not even Victor’s malignant mind could have conceived–an indestructible entity that steps out of humankind’s collective nightmare with powers, and a purpose, beyond imagining.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    }
]