[
    {
        "Title": "A Taste of the East: 200 Step-By-Step Recipes With over 1,000 Photographs",
        "Authors": "By Hsiung, Deh-Ta, Fernandez, Rafi, and Wheeler, Steven",
        "Description": "Any chef will treasure this compendium of more than two hundred authentic Asian recipes from each distinctive cooking region in the Orient, complete with serving suggestions and cooking tips.",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "7.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Zoo Animals at Your Fingertips",
        "Authors": "By Nayer, Judy and Brown, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "McClanahan Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Type 2 Diabetes Cookbook : Simple & Delicious Low-Sugar, Low-Fat, & Low-Cholesterol Recipes",
        "Authors": "By Soneral, Lois M.",
        "Description": "Offers wholesome and customized recipes with easily obtained ingredients that are simple, practical, healthy, and delicious. Soneral dispels the dietary myths about diabetes and includes recipe modifications for such forbidden foods as desserts, casseroles, appetizers, and snacks that are low in sugar, fat, and cholesterol and don't compromise flavor. The Type 2 Diabetes Cookbook contains updated nutritional information and recipes that can be the beginning to a healthier, happier lifestyle.",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Neurotica: A Novel",
        "Authors": "By Margolis, Sue",
        "Description": "If he always has the headache, why should you suffer?In the bestselling tradition of Bridget Jones's Diary comes this outrageous, hilarious look at love, marriage, and sex, introducing Anna Shapiro, who believes that surely there must be more to married life....Tabloid reporter Anna Shapiro can pinpoint the day, three years ago, that she and her husband, Dan, last had great sex. Anna would be grateful if something as ordinary as a mere headache was her husband's excuse; Dan's hypochondriac terrors include brain tumors, tropical diseases, and spontaneous combustion. While she loves her husband, she's not ready to give up on sex at age thirty-seven--so what can she do?It's the perfect time for the distraction of a freelance assignment. But what her editor has in mind is a story on the explosive new feminist manifesto that prescribes no-strings-attached affairs for women. Anna's assignment is to interview three women who've had extramarital affairs purely for sexual pleasure--but she's inclined to take her research a bit further....Can a woman have an uncomplicated affair purely for sexual pleasure--or do her emotions invariably interfere? Anna's determined to find out. And despite her worries about her middle-aged body, potential research assistants prove to be plentiful.Going where no journalist has gone before, Anna delves into a world she'd never considered until now. What is, after all, the perfect outfit for committing adultery in? Is it truly beyond the pale to pick up a man--no matter how sexy he is--at a funeral? And what can be done about that single horrifying gray hair? The answers are more hilarious than Anna could ever have predicted.But soon Anna finds herself facing the question that she never thought she'd have to answer: Is she willing to give up her marriage and her children for what may be the biggest gamble of her life?A novel for every woman who's ever wondered--and every woman who hasn't--Neurotica will have you roaring with laughter as it takes you on a wickedly delightful journey of sheer indulgence.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Edward Weston: Seventy photographs : biography",
        "Authors": "By Maddow, Ben",
        "Description": "",
        "Category": "",
        "Publisher": "New York Graphic Society",
        "Price Starting With ($)": "6.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "On Your Birthday (A Celebration of Your Special Day)",
        "Authors": "By Barbour Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "365 Ways to Relax Mind, Body & Soul",
        "Authors": "By Heller, Barbara L.",
        "Description": "Stress may be the number one threat to health and happiness in the 21st century. For the stressed-out reader who can't afford a daily massage, here are 365 simple, effective ways to promote relaxation. From simple thoughts to exercises to food, this book offers hundreds of tips. Fun-to-read gift-book format makes this perfect for anyone with too much stress in their lives.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "An Introduction to Word Processing: Using Microsoft Word 2000 or Microsoft Office 2000",
        "Authors": "By Watt, Fiona, Allman, Howard (ILT), Dodd, Emma (ILT), and Gilpin, Rebecca",
        "Description": "Discusses terminology and equipment and provides advice on specific techniques such as saving, retrieving, editing, adding pictures, creating spreadsheets and templates, as well as troubleshooting and installation.",
        "Category": " Juvenile Nonfiction , Computers , Software",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Big Fat Hen",
        "Authors": "By Baker, Keith",
        "Description": "“One, two, buckle my shoe. Three, four, shut the door. . . . . Nine, ten, big fat hen!” “Baker uses an imaginative array of acrylic colors for his hens--greens, purples, and pinks to contrast with the warm, yellow straw background. There are lots of things to count, such as sticks, eggs, chicks, and hens. A fine choice for toddler story hours.”--School Library Journal",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Mr Men Happy (Mr. Men Books)",
        "Authors": "By Hargreaves, Roger",
        "Description": "Although everyone in Happyland walks around with a smile face, Mr. Happy discovers that the most miserable person in the world is living in an underground home in the woods.",
        "Category": "",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1980"
        }
    },
    {
        "Title": "Tom Thumb (Bow-wow books)",
        "Authors": "By De La Touche, Grace",
        "Description": "",
        "Category": "",
        "Publisher": "Shooting Star Press",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Mitzvahs",
        "Authors": "By Siegel, Danny",
        "Description": "",
        "Category": "",
        "Publisher": "Town House Pr",
        "Price Starting With ($)": "13.21",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "The Fortune-Tellers",
        "Authors": "By Hyman, Trina Schart (ILT) and Alexander, Lloyd",
        "Description": "After revealing the future to a young carpenter, a fortune-teller disappears, and the young man attempts to fill the shoes of the real seer, with hilarious results for himself and the villagers, in an African tale set in a small Cameroonian town.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Undefeated in Love and War",
        "Authors": "By Carman",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Powerful Promises for Every Woman: 12 Life-Changing Truths from Psalm 23",
        "Authors": "By George, Elizabeth",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Chasing God, Serving Man",
        "Authors": "By Tenney, Tommy",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Marvelous Microwave",
        "Authors": "By Trittipo, Jane",
        "Description": "",
        "Category": " Cooking , Methods , Microwave",
        "Publisher": "Creative Cookery",
        "Price Starting With ($)": "9.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Lost Daughter of Happiness : A Novel",
        "Authors": "By Yan, Geling and Silber, Cathy (TRN)",
        "Description": "The powerful story of a love affair between an enigmatic Chinese prostitute and the Caucasian boy who worships her is set against the aftermath of the Gold Rush era, when anti-Chinese violence plagued the city of San Fransisco, known during that time as Gold Mountain to the millions who came seeking fortune. 30,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Surreal Gourmet Bites: Showstoppers and Conversation Starters",
        "Authors": "By Blumer, Bob",
        "Description": "The Food Network's Bob Blumer is called the Surreal Gourmet for good reason: he's an artist when it comes to creating dishes as fun and delicious to look at as they are to eat. Ceci n'est pas your ordinary party fare, but an array of 50 little mouthwatering masterpieces. With recipes such as Coconut Shrimp Lollypops (skewered shrimp with an amazing apricot dipping sauce), Chinese Snow Cones (wontons stuffed with chicken salad and ginger vinaigrette), and the ingenious and very adult S'more Shooters (amaretto hot chocolate with roasted marshmallows), guests will be abuzz about the food all the way home. Complete with tips and techniques, including shortcuts and prep times, as well as whimsical presentation ideas and Bob's quintessential suggestions for music to cook by, each cocktail bite is simple enough for the home cook and memorable enough to become addictive. With Surreal Gourmet Bites, the food will be the life of the party.",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Alpha Teach Yourself the Bible in 24 hours",
        "Authors": "By Whalin, W. Terry and Whalin, Terry",
        "Description": "",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.08",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Fear Not: Facing Our Fears Throught God's Love",
        "Authors": "By Freeman, Criswell",
        "Description": "We live in a world where fear is big business. Everywhere we turn, or so it seems, we are bombarded by media images that depict war, violence, destuction, poverty, and hopelessness. So it's no wonder that we are beset by a cascade of fears that leave us troubled to the very core of our souls. As believers who have been touched by the transforming power of Christ, we need never lose hope: God is still in control, and we are protected. This book is intended to help readers redirect their thoughts and prayers to God. With seventeen chapters based on common fears, it contains scripture and words of encouragement for overcoming these fears, reminding readers to hand them over to God, turning to His promises and His protection.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Officially Osbourne: Opening the doors to the land of Oz",
        "Authors": "By Gold, Todd (EDT) and Osbourne, Ozzy",
        "Description": "Once upon a time (well, maybe it was last year) in the land of Oz (a place that looks a lot like Beverly Hills, California), reigning Prince of Darkness and heavy metal legend Ozzy Osbourne, his wife and sovereign ruler, Sharon, and teenage heirs to the throne, Jack and Kelly, gave MTV camera crews the keys to the kingdom for documenting the Osbourne way of life.  The result? The Osbournes. The history-making, Emmy-winning, media-frenzied, television-family-concept-redefining reality series that America can't get enough of. The Osbournes are all can't-even-walk-down-the-street-anymore-to-grab-a-bite-to-eat famous.  But hey, you knew all that already -- so here's the part of the story that may have gone over your head. What you've got in your hands goes beyond you tuning in to The Osbournes on MTV. Think of it as ordering the Ozzy Super Deluxe -- the fully authorized, officially sanctioned, Sharon's Seal of Approval companion guide to all things Osbourne.  It's all here: complete synopses to all ten unforgettable episodes (featuring a Bad Word Box Score), exclusive interviews, hundreds of photos, a private tour of the house, what pet's in the doghouse, an Osbourne lexicon, and so much more. You'll laugh, you'll cry, you'll wish they lived next door to you (unless you've got the music cranked at 4:00 A.M.). So spend a little time in the land of Oz -- and discover why there really is no #$&*ing place like home.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "MTV",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Time For Kids: Butterflies! (Time for Kids: Science Scoops: Level 3)",
        "Authors": "By Bjerklie, David (EDT)",
        "Description": "Butterflies There are 20,000 different kinds of butterflies in the world. Many have brightly colored wings. But butterflies don't start life as beauties. Every butterfly begins as a tiny egg that hatches into a caterpillar. Then an amazing change takes place. The caterpillar turns into a fluttering butterfly!",
        "Category": " Juvenile Nonfiction , Animals , Insects, Spiders, etc.",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Easy as 1, 2, 3 Cooking Chinese",
        "Authors": "By Hsiung, Deh-Ta",
        "Description": "Quick, fresh, and light, Chinese cooking is easier than you think - perfect for both midweek meals and weekend entertaining.In this collection of fifty fabulous recipes there are both new and classic dishes to tempt your tastebuds. Clear broths and satisfying soups, tasty appetizers and mouthwatering main courses, fresh-tasting vegetables and perfect rice and noodles - all of them are simple to make in just three steps, using fresh, easy-to-find ingredients.A glossary of Chinese ingredients, tips and tricks of the trade are included too, together with helpful information on planning a Chinese meal, all to help make your Chinese cooking both look and taste absolutely fabulous.",
        "Category": " Cooking , Regional & Ethnic , Chinese",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "The Dysfunctional Family Christmas Songbook",
        "Authors": "By Boswell, John, Skenazy, Lenore, and Pyle, Charles S.",
        "Description": "Somewhere, someone is having a perfect Christmas, filled with chestnuts roasting and sleigh bells ringing…Screw ‘em.Most of us are having just the opposite: a nutcrackin’ nightmare of anger, hurt feelings, evil in-laws, and carbs beyond counting.  A time when grudges grow and gasses pass.  A time of maxed-out credit cards and a ham that the vegetarians are ready to hurl through the frosty window.It’s that holidays that we celebrate here.Evil little brothers, pregnant tattooed sisters, horny dogs, and cross-dressing dads–they’re all here, ready to spread their Christmas cheer.  So untangle the lights, spill some eggnog, and gather ‘round the place where happier families would have a piano.  Now prepare to enjoy all the carols you love–with new lyrics you’ll love even more.  “O Holy Fight,” “Silent Wife,” and “Grandpa Fell” (the ballad of Gramps and his bourbon, set to the tune of “Jingle Bells”).  Yes, all your old favorites are here, with words that express, at last, the true sentiments of the season.Remember: We wish you a Merry Christmas!  But we can’t guarantee it.",
        "Category": " Humor , General",
        "Publisher": "Crown Archetype",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Border Book (DK Living)",
        "Authors": "By Pavord, Anna",
        "Description": "Provides advice on choosing and cultivating plants for corners, edges, islands, and other forgotten areas of the garden.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Family Funbook",
        "Authors": "By Hilton, Joni",
        "Description": "Bad weather? Family vacation? Weekend afternoon? Not sure what the family should do? Grab your Family Funbook, with more than 400 fun, exciting, and inexpensive activities for the whole family. Written by a mother of four and divided into seasons, each section has arts & crafts, cooking, and outside exercises. Activities for major holidays such as Valentine's Day and Independence Day, plus multicultural activities for Kwanzaa, Saint Patrick's Day, and Hanukkah. Learn about different cultures such as Native American, Asian, Mexican, and more.",
        "Category": " Games , Travel Games",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "God's Road Map for Women",
        "Authors": "By Borden and Winters",
        "Description": "An inspiring guide for helping women find direction and encouragement to take them through their daily lives. A true celebration of womanhood, this A to Z guide gives women insight on over 75 life topics and offers real inspiration and guidance to help them face everyday with love, hope, and confidence.",
        "Category": " Religion , Inspirational",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Reflections on the Movies: Hearing God in the Unlikeliest of Places (Reflective Living Series)",
        "Authors": "By Gire, Ken",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Chariot Victor Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Moonlight on the Magic Flute (Magic Tree House (R) Merlin Mission)",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "Jack and Annie head to 18th-century Austria, where they must find and help   a musician by the name of Mozart. Decked out in the craziest outfits they’ve   ever worn—including a wig for Jack and a giant hoopskirt for Annie!—the two   siblings search an entire palace to no avail. Their hunt is further hampered   by the appearance of a mischievous little boy who is determined to follow   them everywhere. But when the boy lets the animals out of the palace zoo,   Jack and Annie have to use the only magic at their disposal to save   themselves and the naughty little fellow. Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and Annie, perfect for readers who   are just beginning chapter books Merlin Missions: More challenging adventures for the   experienced reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite Magic Tree House   adventures Have more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Fern Finder",
        "Authors": "By Hallowell, Anne C. and Hallowell, Barbara G.",
        "Description": "",
        "Category": " Nature , Plants , General",
        "Publisher": "Nature Study Guild",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Canada Geese Quilt",
        "Authors": "By Kinsey-Warnock, Natalie",
        "Description": "",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Knights are Brave",
        "Authors": "By Kath Smith",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "A Bird in the Hand: And the Stories Behind 250 Other Common Expressions (The Armchair Philologist)",
        "Authors": "By Mann, Leonard",
        "Description": "Explains hundreds of expressions, from \"Achilles' heel\" and \"Aladdin's lamp\" to \"wear your heart on your sleeve\" and \"wolf in sheep's clothing\"",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Story of Flight",
        "Authors": "By Mary Lee Settle",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Sidney Sheldon's Mistress of the Game",
        "Authors": "By Bagshawe, Tilly",
        "Description": "“The master of the storytelling game.”—People Sidney Sheldon’s masterful #1 New York Times bestseller Master of the Game has enthralled millions of readers the world over. Now, at long last, the breathtaking saga of the ambitious and powerful MacGregor/Blackwell family continues in Sidney Sheldon’s Mistress of the Game. Author Tilly Bagshawe has picked up the master’s baton and delivered a magnificent tale of determination, greed, and very dark secrets in the distinct Sheldon vein that will mesmerize newcomers and confirmed Sidney Sheldon fans alike.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Wanting Sheila Dead (Gregor Demarkian Novels)",
        "Authors": "By Haddam, Jane",
        "Description": "“Haddam manages to produce each time a layered, richly peopled, and dryly witty book with a plot of mind-bending complexity.” —Houston Chronicle on Glass Houses Sheila Dunham is a gossip columnist’s dream—she’s famous, loud and, to most who meet or see her, deeply offensive. As a result, she’s been fired from every job on television she’s ever had—first as a serious journalist, then as a personality, finally as a reality show judge. Now she’s producing and hosting her own reality show, “America’s Next Top Anchor,” shot in her hometown of New Fenwick, Connecticut. Everyone she employs is terrified of her; everyone one else hates her. And everybody seems to want Sheila dead. Finally it seems someone has decided to try. After millions of dollars of jewels are stolen from her home, she is found beaten into unconciousness, next to the murdered body of a local girl. If nothing else, her show’s ratings are going to improve. Gregor Demarkian, a retired FBI agent, is already scheduled to appear on her show but he’s going to consult on the biggest murder case to hit that part of Connecticut since the Revolutionary War. But how do you narrow down the suspects when the victim was hated by everyone?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "12.98",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "100 Promises to My Baby",
        "Authors": "By Chopra, Mallika and Chopra, Deepak (FRW)",
        "Description": "\"The world was never changed or transformed by politicians, or for that matter, by scientists. The mothers of the world hold the keys. . . .\"--from the ForewordAs she eagerly awaited the birth of her first child, Mallika Chopra began to craft a unique gift that would express her profound loving commitment to the baby growing inside of her.100 Promises to My Baby is that gift--one that reflects her deep awareness of the sacred responsibilities of parenthood. Here the author shares the vows she made to help her child--and all children--grow up feeling cherished and secure, look at the world with wonder and curiosity, and learn spiritual values that enrich life and contribute to making the world a better place. Accompanying the 100 promises are short essays, reflections, poems, and stories that have inspired the author throughout her life--and that will inspire readers to think about their own lives, values, and beliefs, and what they would like to pass on to their children.To learn more about the book, visit www.babypromises.com",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Taylor's Pocket Guide to Vegetables (Taylor's Pocket Guides)",
        "Authors": "By Taylor, Norman and Reilly, Ann (EDT)",
        "Description": "Describes seventy-nine vegetables, explains how to plan and prepare a vegetable garden, and offers advice on planting, cultivating, harvesting, and pest control",
        "Category": " Gardening , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The Creative Art of Pressed Flowers (The Creative Art of Series)",
        "Authors": "By Lawrence, Mary",
        "Description": "",
        "Category": "",
        "Publisher": "Longmeadow Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Creative Art of Flower Arranging (The Creative Art of Series)",
        "Authors": "By Hall, Jan",
        "Description": "",
        "Category": "",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Houghton Mifflin Soar to Success: Paperback Level 3 Outside Dog (Read Soar to Success 1999)",
        "Authors": "By Read (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Insight Guides Scotland",
        "Authors": "By Bell, Brian (EDT) and Corrance, Douglas (PHT)",
        "Description": "A guide to the history, traditions, and culture of Scotland also offers practical travel information and sight-seeing tips",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Apa Productions",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Space (At Your Fingertips)",
        "Authors": "By Chicko, Joe (ILT), Chicko, Terri (ILT), and Nayer, Judy",
        "Description": "Provides pictures of the moon, sun, planets, and stars, and includes brief information about each object. On board pages.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "McClanahan Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Capitalism At The Crossroads: The Unlimited Business Opportunities In Solving The World's Most Difficult Problems",
        "Authors": "By Hart, Stuart L.",
        "Description": "Capitalism is indeed at a crossroads, facing international terrorism, worldwide environmental change, and an accelerating backlash against globalization. Companies are at crossroads, too: finding new strategies for profitable growth is now more challenging. Both sets of problems are intimately linked. Learn how to identify sustainable products and technologies that can drive new growth while also helping to solve today's most crucial social and environmental problems. Hart shows how to become truly indigenous to all markets -- and avoid the pitfalls of traditional 'greening' and 'sustainability' strategies. This book doesn't just point the way to a capitalism that is more inclusive and more welcome: it offers specific techniques to recharge innovation, growth, and profitability.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Wharton School Pub",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Thursday Rides Again",
        "Authors": "By Michael Bond",
        "Description": "",
        "Category": "",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Hunters of the Red Moon",
        "Authors": "By Bradley, Marion Zimmer and Zimmer, Paul Edwin",
        "Description": "A group of hunters kidnap intelligent beings from other planets to use as their quarry, promising them wealth and freedom if they can survive until the eclipse of the Red Moon",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "DAW",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "The Kids of Einstein Elementary #2: Titanic Cat (Einstein Elementary Chapter Book)",
        "Authors": "By Costello, Matthew J., Mlodinow, Leonard, and Nash, Josh (ILT)",
        "Description": "Math to the rescue! -- in an exciting new adventure series (a la Magic Treehouse) where kids come up with creative math solutions to get themselves out of jeopardy!Steffi, Kenny, and Jose (and the time-traveling port-a-john) are back in this fun-filled mathematical adventure!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "A Walk With the Serenity Prayer: Daily Devotions for People in Recovery (The Serenity Meditation Series)",
        "Authors": "By Minirth, Frank, Congo, Janet, Congo, David, and Meier, Paul D. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Best-Loved Holiday Recipes",
        "Authors": "By By The Editors",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Young Astronomer (Young Enthusiast Series)",
        "Authors": "By Mullin, Chris, Ford, Harry",
        "Description": "",
        "Category": "",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Mini-Mini Musicals: Simple Musicals for Young Children Sung to Familiar Tunes",
        "Authors": "By Warren, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Warren Pub House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Lakeshore Christmas (The Lakeshore Chronicles, 6)",
        "Authors": "By Wiggs, Susan",
        "Description": "Maureen Davenport finally gets to direct Avalon's annual holiday pageant, and she's determined to make it truly spectacular. But former child star Eddie Haven is turning out to be a tattooed lump of coal in her stocking. Eddie can't stand Christmas, but a judge's court order has landed him right in the middle of the merrymaking. He and Maureen spar over every detail of the pagent, from casting troubled kids to Eddie's original&#151;and distinctly untraditional&#151;music.Is he sabotaging the performance to spite her, or is she foricng the show into her storybook-perfect notion of Christmas? And is it possible that they're falling in love?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Mushroom and Truffle Book",
        "Authors": "By Hurst, Jacqui",
        "Description": "",
        "Category": "",
        "Publisher": "Salamander Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Right Now: A 12-Step Program For Defeating The Obama Agenda",
        "Authors": "By Steele, Michael",
        "Description": "What Should Conservatives Do in the Age of Obama?Two Words: Fight BackPresident Obama ran on promises of bipartisanship and centrism, but he’s delivered something else: unprecedented government borrowing and spending, unsustainable debt, and audacious attempts to usher in a colossal, overbearing government, the likes of which we’ve never seen.In Right Now, Republican National Committee chairman Michael Steele blows the whistle on the entire Obama agenda. Setting aside appeals for caution in taking on a popular president, Steele throws down the gauntlet, insisting Republicans must expose and refute the policies lying at the heart of this administration’s attempts to resurrect a discredited brand of extreme liberalism.A call to arms for grassroots America, this book argues for abandoning &#147;conservatism-lite,” returning to core conservative principles, and launching an uncompromising campaign for limited government. The path to a Republican renaissance has already been laid, says Steele: the target is the Obama agenda, the method is active opposition, and the time is Right Now.Bonus: Foreword by Newt Gingrich",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Dragonsinger",
        "Authors": "By McCaffrey, Anne, Malczynski, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "18.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Hammond Students Notebook Atlas",
        "Authors": "By Hammond",
        "Description": "",
        "Category": " Reference , Atlases, Gazetteers & Maps",
        "Publisher": "Amer Map Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Christmas Cup",
        "Authors": "By Bowman, Leslie (ILT) and Patterson, Nancy Ruth",
        "Description": "Eight-year-old Megan and her grandmother turn a worthless old cup to good use by saving money in it to buy a gift for a special person at Christmas",
        "Category": " Juvenile Fiction , Holidays & Celebrations , General",
        "Publisher": "Apple",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Kitten's Christmas: Animal Shape Book",
        "Authors": "By McCue, Lisa and McCue, Dick",
        "Description": "Kitty, a young kitten, climbs the Christmas tree to look at the star, sees stockings hung from the mantle, tries to wrap a present, and is unable to stay awake for Santa's visit",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "6.08",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "The Book of Chowder",
        "Authors": "By Hooker, Richard James",
        "Description": "Culinary and historical anecdotes accompany recipes that range from a 1751 concoction for Boston fish chowder to a 1972 recipe for lima bean chowder",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "The Heretic's Daughter [Hardcover] by Kent, Kathleen",
        "Authors": "By Kathleen Kent",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown, Boston",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Four Ingredient Cookbook",
        "Authors": "By Coffee, Linda",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Cookbook Resources, LLC",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Not-So-Jolly Roger #2 (Time Warp Trio)",
        "Authors": "By Scieszka, Jon and Smith, Lane (ILT)",
        "Description": "Everyone’s favorite time-travelers are changing their styles!  The Time Warp Trio series now features a brand-new, eye-catching design, sure to appeal to longtime fans, and those new to Jon Scieszka’s wacky brand of humor.",
        "Category": " Juvenile Fiction , Science Fiction , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "My Haunted House (Araminta Spookie No. 1)",
        "Authors": "By Sage, Angie and Pickering, Jimmy (ILT)",
        "Description": "This house is not for saleAraminta Spookie lives in a wonderful old haunted house, but her crabby aunt Tabby wants to move. Aunt Tabby is determined to sell their house—Araminta has to stop her!With the help of a haunted suit of armor named Sir Horace, a ghost named Edmund, and a lot of imagination, Araminta hatches a plot for an Awful Ambush that is so ghoulish, it just might work!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Katherine Tegen Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The International Chocolate Cookbook",
        "Authors": "By Baggett, Nancy",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Chocolate",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Pamela Smith's the Good Life: A Healthy Cookbook",
        "Authors": "By Smith, Pamela M.",
        "Description": "Includes recipes and meal plans built around healthy eating guidelines, providing nutritional facts for each recipe and tips for shopping and dining out",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Creation House",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Queen of the Road: The True Tale of 47 States, 22,000 Miles, 200 Shoes, 2 Cats, 1 Poodle, a Husband, and a Bus with a Will of Its Own",
        "Authors": "By Orion, Doreen",
        "Description": "A pampered Long Island princess hits the road in a converted bus with her wilderness-loving husband, travels the country for one year, and brings it all hilariously to life in this offbeat and romantic memoir.Doreen and Tim are married psychiatrists with a twist: She’s a self-proclaimed Long Island princess, grouchy couch potato, and shoe addict. He's an affable, though driven, outdoorsman. When Tim suggests “chucking it all” to travel cross-country in a converted bus, Doreen asks, “Why can’t you be like a normal husband in a midlife crisis and have an affair or buy a Corvette?” But she soon shocks them both, agreeing to set forth with their sixty-pound dog, two querulous cats—and no agenda—in a 340-square-foot bus.Queen of the Road is Doreen’s offbeat and romantic tale about refusing to settle; about choosing the unconventional road with all the misadventures it brings (fire, flood, armed robbery, and finding themselves in a nudist RV park, to name just a few). The marvelous places they visit and delightful people they encounter have a life-changing effect on all the travelers, as Doreen grows to appreciate the simple life, Tim mellows, and even the pets pull together. Best of all, readers get to go along for the ride through forty-seven states in this often hilarious and always entertaining memoir, in which a boisterous marriage of polar opposites becomes stronger than ever.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "FamilyFun Birthday Cakes: 50 Cute and Easy Party Treats",
        "Authors": "By Cook, Deanna F. (EDT)",
        "Description": "Looking for that unusual cake to make your child's birthday extra special? FamilyFun Birthday Cakes is filled with recipes that will surely be the highlight of any occasion. From mermaids to fire trucks, horses to sunflowers, and ladybugs to treasure chests, these goodies are certain to take the cake. With more than 50 recipes, and easy step-by-step instructions, FamilyFun Birthday Cakes is the perfect resource for planning the ideal centerpiece for any birthday party.",
        "Category": " Cooking , Courses & Dishes , Cakes",
        "Publisher": "Disney Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Random House Barbecue and Summer Foods Cookbook: Over 175 Recipes for Outdoor Cooking and Entertaining",
        "Authors": "By Fraser, Margaret",
        "Description": "",
        "Category": " Cooking , Seasonal",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Christians in the Arab East: A Polical Study",
        "Authors": "By Robert Brenton Betts",
        "Description": "",
        "Category": "",
        "Publisher": "Lycabettus Press",
        "Price Starting With ($)": "6.65",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Civil War Front Pages",
        "Authors": "By Wagman, John (EDT)",
        "Description": "Chronological newspaper accounts trace the course of the Civil War from Fort Sumter to the assassination of President Lincoln",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Symbols, Signals and Noise: the Nature and Process",
        "Authors": "By Pierce, J.R.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Priorities: Mastering Time Management (Resources for Changing Lives)",
        "Authors": "By James C. Petty",
        "Description": "",
        "Category": "",
        "Publisher": "P & R Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Well-Behaved Puppy (Quick & Easy)",
        "Authors": "By De Vito, Dominique",
        "Description": "",
        "Category": " Pets , Dogs , General",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Cross Gardener",
        "Authors": "By Wright, Jason F.",
        "Description": "From the New York Times bestselling author, an inspiring story of life, love, and moving on.  Married and the father of a young daughter, John Bevan had finally found the traditional family he lacked as an orphaned child. But all that disappears when a fatal car accident steals away his wife-and the unborn child she carried. Filled with sorrow, John withdraws from life and love. He erects a small cross at the scene of his wife's accident and visits daily, grieving. Then one morning he encounters a young man kneeling before the cross, touching it up with white paint. John's conversations and travels with this mysterious man-known to him only as the Cross Gardener-will forever change his world. From Jason F. Wright comes a timeless tale that explores the questions we ask when our lives are touched by loss: How do we carry on? And who will show us the way? The answers John Bevan finds illuminate the hope that even in our darkest hours we are not alone.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Great Parties: The Best of Martha Stewart Living",
        "Authors": "By Stewart, Martha and Martha Stewart Living (EDT)",
        "Description": "An ingenious assortment of ideas and suggestions for all kinds of celebrations presents hundreds of menus, recipes, cooking tips, decorating suggestions, lighting ideas, and entertaining tips, with step-by-step guidelines for creating a memorable party. Original. 125,000 first printing.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Sculpting Her Body Perfect",
        "Authors": "By Schoenfeld, Brad",
        "Description": "A fitness program that can be followed in the convenience of their own homes helps women achieve total-body conditioning, as well as toning of specific muscle groups.",
        "Category": " Sports & Recreation , Bodybuilding & Weight Training",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Bubbles, Rainbows And Worms: Science Experiments For Pre-School Children",
        "Authors": "By Brown, Sam Ed",
        "Description": "Recommends projects designed to teach young children about air, animals, plants, water, the senses, and the environment",
        "Category": " Science , General",
        "Publisher": "Gryphon House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Running Around (And Such) (Lizzie Searches for Love, Book 1)",
        "Authors": "By Byler, Linda",
        "Description": "A romance novel by an Amish writer, based on true experiences! It isn't that Lizzie doesn't want to stay Amish. It's just that there is so much to figure out. Like why can't she let her hair a little looser on top? And why can't she wear shoes with a little bit more of a heel? And will she ever really just know for a fact who she is going to marry like her next-older sister, Emma, does? And how does it happen that her just-younger sister, Mandy, is going on a date before Lizzie ever has a real one? So does it matter at all if she eats one more whoopie pie? Amos seems to like her a lot when she pounds out the ping-pong games. He even asks her to be his partner in doubles. But then he asks Ruthie if he can take her home!           It has been this way Lizzie's whole life. She has too hot a temper. She hates housework and dislikes babies. She loves driving fast horses but is petrified of going away from home for a week to work as a maud (maid). Now that Lizzie is running around, will she scare off the Amish boys with her hi-jinks manners? She has certainly attracted the attention of the egg-truck driver. A scary thrill runs through her every time the worldly man comes to pick up an order, each time extending his stay a little longer. How long will she keep this a secret from Emma?and from Mamm and Datt? What will become of Lizzie? Is she too spirited, too innocent, and almost too uninhibited for a young Amish woman?Skyhorse Publishing, as well as our Arcade, Yucca, and Good Books imprints, are proud to publish a broad range of books for readers interested in fiction?novels, novellas, political and medical thrillers, comedy, satire, historical fiction, romance, erotic and love stories, mystery, classic literature, folklore and mythology, literary classics including Shakespeare, Dumas, Wilde, Cather, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Good Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Totline Great Big Holiday Celebrations: Activities for Celebrating Major Holidays with Young Children",
        "Authors": "By McKinnon, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Warren Publishing House, Inc.",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Best-Ever Cookies: Over 200 Luscious Cookies and Other Fabulous Desserts",
        "Authors": "By Nestle (EDT)",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "Nestle Toll House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Fabulous fondues,",
        "Authors": "By Dorothy H Becker, Nancy S. Wallace",
        "Description": "",
        "Category": "",
        "Publisher": "Peter Pauper Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "A Cup of Comfort Classic Edition: Stories That Warm Your Heart, Lift Your Spirit, and Enrich Your Life",
        "Authors": "By Sell, Colleen",
        "Description": "",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Statistics for Business & Economics",
        "Authors": "By Boudreau, Nancy T.",
        "Description": "",
        "Category": " Business & Economics , Statistics",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Keys To Success: Building Successful Intelligence For College, Career, And Life",
        "Authors": "By Carter, Carol, Bishop, Joyce, Kravits, Sarah Lyman, and Block, Judy",
        "Description": "",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "6.03",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Beginning Reader, Level 1: My Dog, Buddy",
        "Authors": "By Milgrim, David",
        "Description": "A Level 1 easy reader about a funny little dog--with wonderfully humorous illustrations!When Dad tells Buddy to sit, Buddy stands up and barks.  When Dad tells Buddy to stand up and bark, Buddy sits!  Mom tells Buddy to get the paper; Buddy rips it.  Brother Pete tells Buddy to roll over--and Buddy takes Pete's shoe and runs away! Only the little boy in this story knows how to get Buddy to do what he should--with hugs and cuddles and lots of love! New readers will love this funny story about a boy and his dog!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "I Did It! (Sight Word Readers) (Sight Word Library)",
        "Authors": "By Beech, Linda",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Stock Market Winners - What Works and Why",
        "Authors": "By maria-crawford-scott-john-bajkowski",
        "Description": "",
        "Category": "",
        "Publisher": "American Association Individua",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "DK Eyewitness Books: Baseball",
        "Authors": "By Kelley, James",
        "Description": "Text and detailed photographs present the history, techniques, and interesting facts of baseball.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "You Better Not Cry: Stories for Christmas",
        "Authors": "By Burroughs, Augusten",
        "Description": "A NEW YORK TIMES BESTSELLER about Christmases past and present from the #1 bestselling author of Running with Scissors, Dry, and A Wolf at the TableAt eight years old, Augusten Burroughs profoundly misunderstood the meaning of Christmas. Now proving himself once more \"a master of making tragedy funny\" (The Miami Herald), he shows how the holidays can bring out the worst in us and sometimes, just sometimes, the very best. From the author described in USA Today as \"one of the most compelling and screamingly funny voices of the new century\" comes a book about surviving the holiday we love to hate, and hate to love.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Empowered by Empathy : 25 Ways to Fly in Spirit",
        "Authors": "By Rosetree, Rose",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Women's Intuition Worldwide.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "WALL-E (Disney/Pixar WALL-E)",
        "Authors": "By Trimble, Irene (ADP)",
        "Description": "IN THE DISTANT FUTURE, humans have long ago left Earth, but someone forgot to turn off a little robot named WALL•E, who goes about his chores day after day after day. When circumstances lead WALL•E off the planet and across the galaxy, he goes on the adventure of a lifetime with a starship full of people and robots. With a little luck, this rusty metal hero will save the day and win the love of a beautiful female robot named EVE! WALL•E proves that love is universal, whether your heart beats or beeps! This junior novelization features an embossed cover and 8 pages of full-color movie stills from the new hit Disney•Pixar film, WALL•E.",
        "Category": " Juvenile Fiction , Science Fiction",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Amos & Obadiah Thru the Bible Books",
        "Authors": "By McGee, J. Vernon",
        "Description": "",
        "Category": "",
        "Publisher": "Thru the Bible Books",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Tequila: The Book",
        "Authors": "By Walker, Ann, Walker, Larry, and Borowski, Diane (ILT)",
        "Description": "With its smoky base and smooth intensity, tequila has for decades been an icon of wild times and life in the fast lane. Yet no other spirit is as adaptable to the flavors of food, and none matches so well the rich complexity of the Mexican culinary repertoire. Illustrated with Mexican-style linoleum cuts, this funky little celebration of tequila offers 35 authentic recipes for tequila drinks, dishes using tequila as an ingredient, and meals to serve with tequila. Including a wealth of anecdotes and information on the liquor's history and origins, this lively, thorough cookbook provides all you need to become an instant aficionado of tequila in its many moods.",
        "Category": " Cooking , Reference",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Atlas of Mysterious Places: The World's Unexplained Sacred Sites, Symbolic Landscapes, Ancient Cities, and Lost Lands",
        "Authors": "By Westwood, Jennifer (EDT)",
        "Description": "A guide to many of the world's sacred and mysterious ruins from past civilizations",
        "Category": "",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Redneck Extreme Mobile Home Makeover",
        "Authors": "By Foxworthy, Jeff and Boyd, David (ILT)",
        "Description": "Everyone knows the phrase \"A man's home is his castle.\" Does that statement ring true even if: You removed your bathroom door so you could watch TV from the commode?The directions to your house include 'turn off the paved road'?You spray painted your dead shrubbery green?Any redneck will tell you that, of course, it is true. So whether you live in a double wide or have hit the big time with a ranch with one and a half baths, Redneck Extreme Mobile Home Makeover will make you laugh at the way some of us, I mean, some of you live such as:You Might Be A Redneck if…Your yard has ever been the proposed site for a landfill.You think orange peels left on the coffee table are potpourri.The garbage truck mistakenly takes your lawn furniture.Someone knocks on your front door and your back door rattles.Your most expensive piece of art is held up with thumbtacks.You have to mow around a refrigerator and a bed frame.",
        "Category": " Humor , General",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Crafty Ideas from Junk",
        "Authors": "By Daitz, Myrna and Chapman, Gillian (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Business Letter Handbook",
        "Authors": "By Muckian, Michael and Woods, John A.",
        "Description": "With hundreds of ready-to-use model business letters that you can adapt for your own business correspondence!These clear, easy-to-follow sample letters cover the most important type of business correspondence:Proposals and requests for bids or informationClaims, complaints, and policy statementsSales and solicitation lettersAnd many more! They'll make your business communications quicker, easier, and more efficient by showing you how to create outstanding letters that get your point across&#151;and get results you want.Effective phrases • Clear terminology • Proper format",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Hummingbirds",
        "Authors": "By Cleave, Andrew",
        "Description": "",
        "Category": "",
        "Publisher": "Dorset Press",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Mary Engelbreit's Mother Goose: One Hundred Best-Loved Verses",
        "Authors": "By Engelbreit, Mary",
        "Description": "New York Times bestseller!From the warm and colorful imagination of Mary Engelbreit comes a Mother Goose book bursting with warmth and humor.This highly illustrated hardcover treasury includes everyone’s favorite time-honored characters—Little Bo-Peep, Humpty Dumpty, Old King Cole, Jack and Jill, and many, many more. Readers will enjoy Mary Engelbreit’s interpretations of the mouse running up the clock, piggies going to market, and children dancing 'round the mulberry bush.With one hundred rhymes in all, all lavishly illustrated in Mary Engelbreit's signature style, this collection of time-honored verses is truly a book to treasure. Makes an excellent gift for baby showers, new parents, and other special occasions!Special features include:• An introduction from children’s book historian Leonard S. Marcus• A note from Mary Engelbreit about the process of creating the book• An index of first lines—easy to track down your favorite rhyme!",
        "Category": " Juvenile Fiction , Nursery Rhymes",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    }
]