[
    {
        "Title": "More Tips for Tops",
        "Authors": "By Rosenkraz",
        "Description": "",
        "Category": "",
        "Publisher": "Baron/Barclay Bridge Supplies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Red Cat (John March Mysteries)",
        "Authors": "By Spiegelman, Peter",
        "Description": "Black Maps (“A stunner, a great debut roaring out of the gate”—Newsday) . . . Death’s Little Helpers (“Breaks new ground in detective fiction”—The Washington Post) . . . and now Red Cat, the third riveting installment in Peter Spiegelman’s thrilling series of novels featuring the brooding New York City private investigator John March.With a troubled past and a job that attracts too much attention from the law, March has always been the black sheep of his staid merchant-banking family. Which makes the identity of his latest client all the more surprising: his smug older brother David.David is desperate and deeply scared, and with good reason: a woman he met on the Internet, and then for several torrid sexual encounters, is stalking him. David knows her only as Wren, but she seems to know everything about him—and she’s threatening to tell all to his wife and his colleagues. His marriage, his career, and his reputation at stake, David wants John to find this woman and warn her off. Reeling from these revelations, John begins the search for Wren, and what he discovers both alarms and fascinates him. Part actress, part playwright, part performance-artist and noir pornographer, Wren is a powerfully compelling mystery—though no more so, John discovers, than his own brother.But when a body surfaces in the East River, March suddenly finds he’s no longer searching for a stalker. Now he’s hunting a killer—and following a trail that leads ever closer to David’s door. . . .",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Island of Lost Girls: A Novel",
        "Authors": "By McMahon, Jennifer",
        "Description": "While parked at a gas station, Rhonda sees something so incongruously surreal that at first she hardly recognizes it as a crime in progress. She watches, unmoving, as someone dressed in a rabbit costume kidnaps a young girl. Devastated over having done nothing, Rhonda joins the investigation. But the closer she comes to identifying the abductor, the nearer she gets to the troubling truth about another missing child: her best friend, Lizzy, who vanished years before.From the author of the acclaimed Promise Not to Tell comes a chilling and mesmerizing tale of shattered innocence, guilt, and ultimate redemption.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Spin State",
        "Authors": "By Moriarty, Chris",
        "Description": "From a stunning new voice in hard science fiction comes the thrilling story of one woman’s quest to wrest truth from chaos, love from violence, and reality from illusion in a post-human universe of emergent AIs, genetic constructs, and illegal wetware...SPIN STATEUN Peacekeeper Major Catherine Li has made thirty-seven faster-than-light jumps in her lifetime—and has probably forgotten more than most people remember. But that’s what backup hard drives are for. And Li should know; she’s been hacking her memory for fifteen years in order to pass as human.  But no memory upgrade can prepare Li for what she finds on Compson’s World: a mining colony she once called home and to which she is sent after a botched raid puts her on the bad side of the powers that be. A dead physicist who just happens to be her cloned twin. A missing dataset that could change the interstellar balance of power and turn a cold war hot.  And a mining “accident” that is starting to look more and more like murder...Suddenly Li is chasing a killer in an alien world miles underground where everyone has a secret. And one wrong turn in streamspace, one misstep in the dark alleys of blackmarket tech and interstellar espionage, one risky hookup with an AI could literally blow her mind.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Liberty's Best Hope: American Leadership for the 21st Century",
        "Authors": "By Kim R. Holmes",
        "Description": "",
        "Category": "",
        "Publisher": "The Heritage Foundation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The High Middle Ages, 1200-1550 (Making of Britain, 1066-1939)",
        "Authors": "By Rowley, Trevor",
        "Description": "",
        "Category": "",
        "Publisher": "Routledge & Kegan Paul",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "The Natural Lunchbox: Vegetarian Meals for School, Work, and Home",
        "Authors": "By Brown, Judy A.",
        "Description": "A collection of vegetarian recipes includes kashi salad, lime yogurt guacamole, baked pita chips, vegetable kabobs, marinated baked tofu nuggets, and minestrone soup",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Book Publishing Company (TN)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Splendor of Silence: A Novel",
        "Authors": "By Sundaresan, Indu",
        "Description": "Set in India during four searing pre-monsoon days in May 1942, The Splendor of Silence is internationally bestselling author Indu Sundaresan's most unforgettable accomplishment yet, merging her Indian and American backgrounds into a heartrending tale of love and clashing cultures in a time of war.Sam Hawthorne, a twenty-five-year-old U.S. Army captain, arrives at the princely state of Rudrakot in search of his missing brother, Mike, carrying with him wounds from combat in Burma and several secrets. But Sam's mission is soon threatened by the unlikeliest of sources -- he falls hopelessly in love with Mila, daughter of the local political agent. Mila, unexpectedly attracted to Sam, nurtures a secret of her own and finds herself torn between loyalty to her family and Sam.The Splendor of Silence opens twenty-one years later with Olivia, Sam's daughter, receiving a trunk of treasures from India, along with a letter from an unknown narrator that finally fills all the silences of her childhood -- telling her the story of her parents' passionate and enduring love for each other that throws them in the path of racial prejudice, nationalist intrigue, and the explosive circumstances of a country and a society on the brink of independence from British rule.Sweeping and poignant, reminiscent of Paul Scott's Raj Quartet novels, The Splendor of Silence will draw a host of devoted new fans to this hugely gifted storyteller.",
        "Category": " Fiction , War & Military",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Today Was a Terrible Day (Picture Puffin Books)",
        "Authors": "By Natti, Susanna (ILT) and Giff, Patricia Reilly",
        "Description": "Follow the humorous mishaps of a second grader who is learning to read. Nothing's going right for Ronald—he drops his pencils, inadvertently squirts water on Joy’s dress, mistakenly eats Jimmy’s sandwich, misses the ball during recess, loses his ice cream money, and drops Miss Tyler’s plant. But his teacher helps him get over his bad day with a confidence boosting note.\"Giff cleverly circumvents what could be a humdrum conclusion in a witty, satisfying way. Ronald’s growing frustrations are wonderfully captured in the woebegone expressions and childlike stances that Natti effectively balances with happy scenes of success.” —Booklist",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Les Bijoux, Vol. 5",
        "Authors": "By Lee, Seung-Ah (TRN), Sang-Sun, Park (ILT), and Eun ha, Jo",
        "Description": "",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "TokyoPop",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Tenjho Tenge VOL 01",
        "Authors": "By Great, Oh!, Oh! Great, Drzka, Sheldon (ADP), Drzka, Sheldon (TRN), and Drzka, Sheldon",
        "Description": "At Todoh High School, the students join warring martial arts clubs where they strive to be the baddest team around and one group, the Juken Club, tries to maintain discipline without getting killed.",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "CMX",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Statue of Liberty: Beacon of promise",
        "Authors": "By Bond, L. E",
        "Description": "",
        "Category": "",
        "Publisher": "Albion Pub. Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Secret Supper: A Novel",
        "Authors": "By Sierra, Javier and Manguel, Alberto (TRN)",
        "Description": "Milan, 1497: Leonardo da Vinci is completing his masterpiece, The Last Supper. Pope Alexander VI is determined to execute him after realizing that the painting contains clues to a baffling -- and blasphemous -- message, which he is determined to decode. The Holy Grail and the Eucharistic Bread are missing, there is no meat on the table and, shockingly, the apostles are portraits of well-known heretics -- none of them depicted with halos. And why has the artist painted himself into the scene with his back turned toward Jesus? The clues to Leonardo's greatest puzzle are right before your eyes....",
        "Category": " Fiction , Christian , Historical",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Belief in God in an Age of Science",
        "Authors": "By Polkinghorne, J. C.",
        "Description": "John Polkinghorne brings unique qualifications to his exploration of the possibilities of believing in God in an age of science: he is internationally known as a theoretical physicist and as a theologian. In this thought-provoking book, Polkinghorne focuses on the collegiality between science and theology, contending that the inquiries of these \"intellectual cousins\" are parallel.\"Polkinghorne [presents] a polished and logically coherent argument.\"—Freeman J. Dyson, New York Review of Books\"Short, accessible, and authoritative.\"—Carlin Romano, Philadelphia Inquirer\"This book should be widely read.\"—Colin Tudge, New Statesman and Society\"If you read one book on science and religion, this should be it.\"—Kirkus Reviews",
        "Category": " Science , Philosophy & Social Aspects",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "You Can't Take it with You",
        "Authors": "By Larsen, David C.",
        "Description": "Explains how inheritance tax works, offers advice on avoiding probate, and assesses the impact of the new tax laws",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "John Colter: His Years in the Rockies",
        "Authors": "By Harris, Burton",
        "Description": "John Colter was a crack hunter with the Lewis and Clark expedition before striking out on his own as a mountain man and fur trader. A solitary journey in the winter of 1807-8 took him into present-day Wyoming. To unbelieving trappers he later reported sights that inspired the name of Colter's Hell. It was a sulfurous place of hidden fires, smoking pits, and shooting water. And it was real. John Colter is known to history as probably the first white man to discover the region that now includes Yellowstone National Park. In a classic book, first published in 1952, Burton Harris weighs the facts and legends about a man who was dogged by misfortune and \"robbed of the just rewards he had earned.\" This Bison Book edition includes a 1977 addendum by the author and a new introduction by David Lavender, who considers Colter's remarkable winter journey in the light of current scholarship.",
        "Category": " History , Americas (North, Central, South, West Indies)",
        "Publisher": "Bison Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Pearl Buck's America",
        "Authors": "By Pearl S. Buck",
        "Description": "",
        "Category": "",
        "Publisher": "Bartholomew House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "James Madison: The Founding Father",
        "Authors": "By Rutland, Robert Allen",
        "Description": "Tracing Madison's role in the War of Independence, his fight for religious freedom, and his guidance of the Constitutional Convention, the author explores Madison's life from the drafting of the Bill of Rights and writing the \"Federalist Papers\" through his term as President",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Landscaping with Perennials (Rodale's Successful Organic Gardening)",
        "Authors": "By Burrell, C. Colston and Stell, Elizabeth",
        "Description": "Discusses soil and climate, tells how to plan perennial plantings, and recommends popular varieties",
        "Category": " Gardening , Organic",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Duct Tape Book",
        "Authors": "By Nyberg, Tim and Berg, Jim",
        "Description": "A humorous look at the many uses for duct tape, from taping the mailbox shut to avoid unwanted junk mail, advertising circulars, and bills, to a humane way to trap mice",
        "Category": " Humor , General",
        "Publisher": "Pfeifer-Hamilton Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Canterbury Tales: In Modern English (Penguin Classics)",
        "Authors": "By Chaucer, Geoffrey and Coghill, Nevill (TRN)",
        "Description": "A retelling of the medieval poem about a group of travelers on a pilgrimage to Canterbury and the tales they tell each other",
        "Category": " Poetry , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "At Home in the World",
        "Authors": "By Pearl, Daniel, Cooper, Helene (EDT), and Pearl, Mariane (FRW)",
        "Description": "Wall Street Journal reporter Daniel Pearl became the focus of international concern when he was kidnapped by Islamic extremists in Pakistan while investigating a story. News of his brutal murder in February 2002 was universally denounced, a tragic loss of a good man and a compassionate journalist who was at home anywhere in the world.  At Home in the World celebrates Pearl's life through 50 of his best stories. Edited by his longtime friend and colleague, Helene Cooper, At Home in the World gives testimony to Mr. Pearl's extraordinary skill as a writer and to his talent for friendship and collaboration. With datelines from the United States and abroad, the articles showcase a dogged reporter who never lost sight of the humanity behind the news. A foreword by his widow, Mariane Pearl, and a contribution by his father, Judea Pearl, celebrate his desire to change the world, his basic decency and fair-mindedness and his sense of fun and love of family.  Mr. Pearl's eye for quirky stories -- many of which appeared in the Journal's iconic \"middle column\" -- and his skill in tracking leads, uncovering wrongdoing and making friends of strangers of all backgrounds and cultures are apparent throughout this carefully assembled collection. The selections range from child beauty pageants in the South to the making of the world's largest Persian rug to the Taliban's exploitation of a gemstone market in order to fund terrorism. Anecdotes from friends and colleagues in the introduction to each section provide background, context and a glimpse of his life at the Journal.  At Home in the World keeps alive Daniel Pearl's spirit through his words and the work that was so important to him.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "All About the Recorder",
        "Authors": "By Various Contributors",
        "Description": "",
        "Category": "",
        "Publisher": "Trophy Music Co.",
        "Price Starting With ($)": "5.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "A Very Present Help",
        "Authors": "By Author Unknown",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Chariot Family Pub",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "365 Days of Creative Play",
        "Authors": "By Ellison, Sheila and Gray, Judith Anne",
        "Description": "\"Projects that you can do with your kids, and even better, activities they can do by themselves.\"-Family Circle\"Now there is a solution to every day of the year.\"-ParentingThis amazing resource of fun and thoughtful activities for kids ages two years and up will help encourage their creativity and learning through play. Using only safe, simple household supplies, 365 Days of Creative Play is great for parents, grandparents and childcare providers. Illustrated by children.",
        "Category": " Family & Relationships , Death, Grief, Bereavement",
        "Publisher": "Sourcebooks, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "True Love Waits Takes a Look at Courting, Dating, & Hanging Out",
        "Authors": "By Lifeway Students (COR)",
        "Description": "",
        "Category": " Religion , Christian Ministry , Youth",
        "Publisher": "LifeWay Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Hazy Mountain (Picture Puffin)",
        "Authors": "By Bisset, D.",
        "Description": "",
        "Category": "",
        "Publisher": "Puffin",
        "Price Starting With ($)": "24.94",
        "Publish Date": {
            "Month": "December",
            "Year": "1975"
        }
    },
    {
        "Title": "Nate the Great",
        "Authors": "By Sharmat, Marjorie Weinman",
        "Description": "Join the world’s greatest detective, Nate the Great, as he solves the mystery of the lost picture! Perfect for beginning readers and the Common Core, this long-running chapter book series will encourage children to problem-solve with Nate, using logical thinking to solve mysteries!   CAN NATE SOLVE THE CASE FOR HIS FRIEND ANNIE?  Nate the Great has a new case! His friend Annie has lost a picture. She  wants Nate to help her find it. Nate the Great must get all the facts,  ask the right questions, and narrow the list of suspects so he can solve  the mystery. Visit Nate the Great and Sludge! NatetheGreatBooks.com   Praise for the Nate the Great Series   ★ “Kids will like Nate the Great.” —School Library Journal, Starred    “A consistently entertaining series.” —Booklist   “Loose, humorous chalk and watercolor spots help turn this beginning reader into a page-turner.” —Publishers Weekly   “Nate, Sludge, and all their friends have been delighting beginning readers for years.” —Kirkus Reviews   “They don’t come any cooler than Nate the Great.” —The Huffington Post",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "The Further Rivals of Sherlock Holmes",
        "Authors": "By Greene, H.",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1974"
        }
    },
    {
        "Title": "Kissing in Manhattan",
        "Authors": "By Schickler, David",
        "Description": "At the Preemption, a mysterious apartment building with a prophetic doorman named Sender, the destinies of an offbeat group of tenants intertwine with the lives of three characters--James Branch, a shy accountant attached to the building's antique elevator; Wall Street lothario Patrick Rigg; and Rally McWilliams, an aspiring writer searching for a soulmate. A first novel. 55,000 first printing.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "The Dial Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Cry for Myth",
        "Authors": "By May, Rollo",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "The Life of Sir Arthur Conan Doyle: The Man Who Was Sherlock Holmes",
        "Authors": "By Carr, John Dickson",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Ghost Dance: A Play of Voices : A Novel",
        "Authors": "By Maso, Carole",
        "Description": "Vanessa Turin attempts to reconcile herself to her mother's death and regain her own sanity",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Pygmalion",
        "Authors": "By Shaw, Bernard (EDT)",
        "Description": "",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Modern Pub.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Transactional Analysis in Psychotherapy",
        "Authors": "By Berne,Eric",
        "Description": "",
        "Category": "",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Provence & the Cote D'Azur (Eyewitness Travel Guides)",
        "Authors": "By Williams, Roger",
        "Description": "Describes hightlights of the region, recommends hotels, restaurants, and shops, and briefly surveys the history of southern France",
        "Category": " Travel , Europe , France",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Finding Out About Sharks",
        "Authors": "By Petty, Kate",
        "Description": "",
        "Category": "",
        "Publisher": "Willowisp Pr",
        "Price Starting With ($)": "7.36",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Old Age is Not for Sissies: A Witty Look at Aging",
        "Authors": "By Kaufman, Lois L.",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Peter Pauper Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "I Love You More: How Everyday Problems Can Strengthen Your Marriage",
        "Authors": "By Parrott, Les",
        "Description": "How to make the thorns in your marriage come up roses. The big and little annoyances in your marriage are actually opportunities to deepen your love for each other. Relationship experts and award-winning authors Les and Leslie Parrott believe that your personal quirks and differences—where you squeeze the toothpaste tube, how you handle money—can actually help draw you together provided you handle them correctly. Turn your marriage’s prickly issues into opportunities to love each other more as you learn how to ? build intimacy while respecting personal space ? tap the power of a positive marriage attitude ? replace boredom with fun, irritability with patience, busyness with time together, debt with a team approach to your finances . . . and much, much more. Plus—get an inside look at the very soul of your marriage, and how connecting with God can connect you to each other in ways you never dreamed.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Spanking Watson: A Novel (Kinky Friedman Novels)",
        "Authors": "By Friedman, Kinky",
        "Description": "Just as every dog must have its day, so must every Sherlock have his Watson -- even if the Sherlock in question resides in a downtown loft with an ill tempered cat, a perpetually smiling puppet head, and ceiling badly in need of repair, all thanks in no small part to the often-less-than-light-on-its-feet lesbian dance class held daily in the loft above.  And just as misery loves company, so does Kinky Friedman, the erstwhile Sherlock in question, love his tormentors from above -- enough so that when someone sends a threatening missive to the head lesbian dance-person, Winnie Katz, Kinky, in a mood of forgive-and-forget, sets out to find the perpetrator and to save the day.  Of course, just as nothing is ever as it seems, so is Kinky \"Ace Private Big Dick\" Friedman, not quite so altruistic as he may appear -- for, in fact, it was the Kinkster himself who wrote the threatening note to Ms. Katz, and then called upon each of his ubiquitous Village Irregulars (the mighty Mike McGovern, the mercurial Ratso Sloman, the marvelous Stephanie Dupont, and the masterful Steve Rambam) to solve the mystery, and in the process give Kinky a first-rate opportunity to evaluate the effectiveness of each of his would-be Watsons.  But just as it's not where you start but where you finish, so does Kinky soon find himself caught up in a conundrum of Sherlockian proportions when the bogus death threat turns suddenly, chillingly real -- and an actual killer steps forward to carry out Kinky's impotent threat.  And just as all things must end, so must this flap copy.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Garden That Cares for Itself (Ortho library)",
        "Authors": "By Williams, Greg and Rae, Norm",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Top 10 US & British Virgin Islands (EYEWITNESS TOP 10 TRAVEL GUIDE)",
        "Authors": "By Lohr, Lynda",
        "Description": "Take this fully illustrated guide to the US and British Virgin Islands along for the perfect island getaway.",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Alaska's History: The People, Land, and Events of the North Country (Alaska Pocket Guide)",
        "Authors": "By Ritter, Harry",
        "Description": "A lively, take-along account of Alaska's sweeping history made vivid with historical photos and entertaining essays. Topics covered include Native lifestyles before contact with the Europeans; Alexander Baranov and the Russian fur trade; John Muir's visit to Glacier Bay in 1879; the Klondike gold rush stampede; pioneer climbs on Mount McKinley; the exploits of early Alaska Bush pilots; big game hunting in the North Country; Alaska's fisheries, where salmon is king; and today's Native traditions.   A history book that's fun to read, Alaska's History sets forth the Last Frontier's glorious past and challenging present.",
        "Category": " History , United States , General",
        "Publisher": "Alaska Northwest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Berlitz German Grammar Handbook (Berlitz Language Handbook)",
        "Authors": "By Wightwick, Christopher",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "Berlitz",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Teach Yourself German Vocabulary (Teach Yourself Books)",
        "Authors": "By Ashworth-Fiedler, Susan (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Dangerous Currents",
        "Authors": "By Thurow, Lester C.",
        "Description": "A leading liberal economist presents a critique of recently ascendant conservative economic theories, arguing that none of these theories offers an accurate picture of economic realities",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Unexpected News: Reading the Bible With Third World Eyes",
        "Authors": "By Brown, Robert McAfee",
        "Description": "Describes the ways that Asian, African, and South American Christians interpret the Bible, especially the story of Jesus' life",
        "Category": " Religion , Biblical Criticism & Interpretation , General",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Canadian Rockies: A History in Photographs",
        "Authors": "By Pole, Graeme",
        "Description": "",
        "Category": "",
        "Publisher": "Altitude Pub Canada Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Explorers: Atlas In The Round",
        "Authors": "By Watson, Charlie and Knight, Norman",
        "Description": "With full-color maps in a spectacular three-dimensional rendering, the Atlas in the Round series offers an amazing perspective on Earth Studies and Natural Science. History and geography come alive in Explorers, our innovative look at the way explorers of the past helped define our world today.",
        "Category": " Juvenile Nonfiction , History , Exploration & Discovery",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Basics of Life (The Artists Devotional Series)",
        "Authors": "By 4Him",
        "Description": "",
        "Category": " Religion , Faith",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Havana Room",
        "Authors": "By Harrison, Colin",
        "Description": "Bill Wyeth is a rising real estate attorney living the lofty heights of success. Then a tragic accident claims everything he has: his family, his fortune, his career. But this is Manhattan, and Bill has much further to fall. His downward spiral lands him at the table of Allison Sparks, the dangerously alluring owner of a midtown steakhouse. She needs a personal favor of him--to engineer a midnight trade-off in a shady multimillion-dollar real estate deal. For a man with nothing left to lose, the set-up is too lucrative to refuse, and like Allison, too forbidden to resist. But her favor draws him deeper into a web of sex, deception, and murder--and to a secret place at the back of her restaurant, the Havana Room, where a man might find both evil and redemption. The Havana Room is a great New York thriller from a modern master of the genre.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Picador",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Unhittable: Reliving the Magic and Drama of Baseball's Best-Pitched Games",
        "Authors": "By Buckley, James, Jr., Pepe, Phil, and Ryan, Nolan (FRW)",
        "Description": "The greatest and most dramatic performances by pitchers are featured in an illustrated study that includes Nolan Ryan's seven no-hitters and three perfect games by New York Yankees Larsen, Wells, and Cone, among others, in a volume that is accompanied by a companion DVD.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Triumph Books",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Surprise, Security, and the American Experience",
        "Authors": "By Gaddis, John Lewis",
        "Description": "September 11, 2001, distinguished Cold War historian John Lewis Gaddis argues, was not the first time a surprise attack shattered American assumptions about national security and reshaped American grand strategy. We've been there before, and have responded each time by dramatically expanding our security responsibilities.The pattern began in 1814, when the British attacked Washington, burning the White House and the Capitol. This early violation of homeland security gave rise to a strategy of unilateralism and preemption, best articulated by John Quincy Adams, aimed at maintaining strength beyond challenge throughout the North American continent. It remained in place for over a century. Only when the Japanese attacked Pearl Harbor in 1941 did the inadequacies of this strategy become evident: as a consequence, the administration of Franklin D. Roosevelt devised a new grand strategy of cooperation with allies on an intercontinental scale to defeat authoritarianism. That strategy defined the American approach throughout World War II and the Cold War.The terrorist attacks of 9/11, Gaddis writes, made it clear that this strategy was now insufficient to ensure American security. The Bush administration has, therefore, devised a new grand strategy whose foundations lie in the nineteenth-century tradition of unilateralism, preemption, and hegemony, projected this time on a global scale. How successful it will be in the face of twenty-first-century challenges is the question that confronts us. This provocative book, informed by the experiences of the past but focused on the present and the future, is one of the first attempts by a major scholar of grand strategy and international relations to provide an answer.",
        "Category": " History , United States , General",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Money and the Meaning of Life",
        "Authors": "By Needleman, Jacob",
        "Description": "If we understood the true role of money in our lives, writes philosopher Jacob Needleman, we would not think simply in terms of spending it or saving it. Money exerts a deep emotional influence on who we are and what we tell ourselves we can never have. Our long unwillingness to understand the emotional and spiritual effects of money on us is at the heart of why we have come to know the price of everything, and the value of nothing. Money has everything to do with the pursuit of an idealistic life, while at the same time, it is at the root of our daily frustrations. On a social level, money has a profound impact on the price of progress. Needleman shows how money slowly began to haunt us, from the invention of coins in Biblical times (when money was created to rescue the community good, not for self gain), through its hypnotic appeal in our money-obsessed era. This is a remarkable book that combines myth and psychology, the poetry of the Sufis and the wisdom of King Solomon, along with Jacob Needleman's searching of his own soul and his culture to explain how money can become a unique means of self-knowledge. As part of the Currency paperback line, it includes a \"User's Guide\" an introduction and discussion guide created for the paperback by the author -- to help readers make practical use of the book's ideas.",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Sunset Recipe Annual 1999",
        "Authors": "By n/a",
        "Description": "A cumulation of recipes published in Sunset magazine includes recipes for soups, salads, meat, poultry, seafood, vegetables, breads, appetizers and desserts",
        "Category": " Cooking , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Penguin Atlas of African History (Hist Atlas)",
        "Authors": "By McEvedy, Colin",
        "Description": "Uses nearly sixty maps to outline the history and development of Africa from prehistoric times to the present, emphasizing political divisions and population growth",
        "Category": " History , Africa , Central",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "A Baker's Field Guide to Cupcakes",
        "Authors": "By Wilson, Dede",
        "Description": "Who wants cupcakes? Long a staple dessert of birthdays and holidays, cupcakes are more popular than ever kids of all ages. In A Baker’s Field Guide to Cupcakes, you’ll find 15 master recipes for cake batters and frostings and 60 easy-to-follow recipes for creatively decorated cupcakes for holidays, special occasions, or anytime you need a treat! Adults will enjoy ringing in the New Year with “Champagne” Cupcakes or presenting someone special with a plateful of Heartfelt Cupcakes. On Mother’s Day, kids can help bake Mom a batch of Breakfast-in-Bed Cupcakes, and they’ll be delighted to dig into Dirt and Worms Cupcakes at a birthday party. With a color photograph of every recipe, A Baker’s Field Guide to Cupcakes gives you everything you need to make scrumptious, fun, and irresistible cupcakes at any time of the year!",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "365 Easy Soups & Stews",
        "Authors": "By Pardue, Staley",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Cookbook Resources, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Hillerman Country: A Journey Through the Southwest With Tony Hillerman",
        "Authors": "By Hillerman, Tony and Hillerman, Barney (PHT)",
        "Description": "Portrays Navajo country in the Arizona desert and describes the customs and culture of the native peoples",
        "Category": "",
        "Publisher": "Perennial",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Bitter Night Sweet Dawn",
        "Authors": "By Bedley, Janet",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Chariot Family Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Seasons of the Heart (Serenade/Saga Books)",
        "Authors": "By Feldhake, Susan C.",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Better homes and gardens sewing for your home",
        "Authors": "By ANAM",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Mrs. Kitching's Smith Island Cookbook",
        "Authors": "By Dowell, Susan Stiles",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Middle Atlantic States",
        "Publisher": "Cornell Maritime Pr/Tidewater Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "A Book of Poetry 1 (Perspectives in Literature)",
        "Authors": "By Secondary English (COR)",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt School",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Sound and Sense: An Introduction to Poetry",
        "Authors": "By Perrine, Laurence",
        "Description": "",
        "Category": " Poetry , General",
        "Publisher": "Harcourt College Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "The Berenstain Bears and the Nerdy Nephew",
        "Authors": "By Berenstain, Stan",
        "Description": "Brother and Sister Bear don't realize the problems they will face when they agree to help Professor Actual Factual's super-smart nephew fit in at school",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Baby Bop's counting book",
        "Authors": "By Dudko, Mary Ann",
        "Description": "Baby Bop, the green dinosaur, and a variety of familiar objects, from a yellow blanket to ten flowers, teach the numbers from one to ten",
        "Category": "",
        "Publisher": "Barney Pub",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Peter Pan (Treasury of Illustrated Classics)",
        "Authors": "By Barrie, J. M., Clift, Eva (ILT), and Arneson, D. J. (ADP)",
        "Description": "Recounts the adventures of Peter Pan, the boy who would not grow up.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Mary Magdalen: Myth and Metaphor",
        "Authors": "By Haskins, Susan",
        "Description": "Mary Magdalen has always been a predominant and fascinating figure for Christianity. But who was she really? The Gnostics hailed her as the companion of the Savior and the woman He loved most. Early Christian writers called her the Bride of Christ and the apostle to the apostles. But for centuries her most durable image has been that of a prostitute who repented and devoted her life to Jesus - an image that both shaped and to some extent reflected the Church's attitude toward women. Yet this figure does not appear in the New Testament.All that we know of the real Magdalen are the four facts noted in the Gospels: she was one of Christ's followers; she was present at His crucifixion; she was one of the earliest witnesses of His resurrection; and she was the first person to be charged with proclaiming the Christian message. But somewhere along the line she was confused with Mary, the sister of Lazarus, and with the woman taken in adultery whose life Jesus saved.Using evidence from early Christian writings, medieval sermons, devotional works, and the art and literature of nearly two thousand years, Susan Haskins shows how Mary Magdalen merged with other figures in the New Testament until she came to epitomize the condition of women in the Church and in society. Today, when women are assuming more active roles in both, Mary Magdalen is once again being reevaluated.",
        "Category": " Religion , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The House Book",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "12.6",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "At World's End (Pirates Of The Caribbean)",
        "Authors": "By Sutherland, Tui (ADP)",
        "Description": "Pirate afficionados old and young alike will dive into this entertaining retelling, embellished with full-color photos, of the continuing, bone-chilling adventures of Captain Jack Sparrow, Will Turner, and Elizabeth Swann as the battle for control of the seas heats up in the third Pirates of the Caribbean film.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Donovan's Daughter (The Californians, Book 4)",
        "Authors": "By Wick, Lori",
        "Description": "Forced to spend the night at Dr. Alexander Montgomery's house because of a blizzard, Marcail Donovan, the pretty new schoolteacher, must face the false accusations of Cordelia Duckworth, the wealthy woman who controls the town",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Solid Answers",
        "Authors": "By Dobson, James C.",
        "Description": "Value priced! How should a parent respond to such issues as premarital sex and AIDS? America's foremost family counselor does not shy away from the tough issues parents face. In this authoritative release, Dr. James Dobson compiles today's most demanding questions into a beneficial reference guide for families. Solid Answers looks at child training, discipline, sex education, and much more. A topical index draws the reader to dependable and biblically sound answers. Based on his best-sellingDr. Dobson Answers Your Questions, this up-to-date book offers guidance through our turbulent times to guide families safely in our new century.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Linked: How Everything Is Connected to Everything Else and What It Means for Business, Science, and Everyday Life",
        "Authors": "By Barabasi, Albert-Laszlo",
        "Description": "A cocktail party? A terrorist cell? Ancient bacteria? An international conglomerate?       All are networks, and all are a part of a surprising scientific revolution. Albert-László Barabási, the nation’s foremost expert in the new science of networks and author of Bursts, takes us on an intellectual adventure to prove that social networks, corporations, and living organisms are more similar than previously thought. Grasping a full understanding of network science will someday allow us to design blue-chip businesses, stop the outbreak of deadly diseases, and influence the exchange of ideas and information. Just as James Gleick and the Erdos?Rényi model brought the discovery of chaos theory to the general public, Linked tells the story of the true science of the future and of experiments in statistical mechanics on the internet, all vital parts of what would eventually be called the Barabási?Albert model.",
        "Category": " Science , Mechanics , Dynamics",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "New Dieter's Cookbook: Eat Well, Feel Great, Lose Weight (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "New Better Homes and Gardens kitchen-tested recipes make losing weight a delicious experience Handy ringbound format lies flat and pre-inserted tab dividers make finding recipes quick and easyVibrant full-color photography of every recipe entices dieters to prepare each dishFood exchanges with every recipe offers flexibility in meal planningThe latest advice and tips help dieters lose weight, eat well, and feel greatInformation especially designed to address the diet issues of children and adolescents helps adults understand, respond to, and manage weight issues that affect youth",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Dinnertime Easy: Slow Cooker Recipes (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books (COR)",
        "Description": "Complemented by lush, full-color photography and handy tips on shopping and food preparation, a tasty compilation of more than four hundred flavorful, easy-to-prepare slow cooker recipes includes everything from soups to desserts, including savory ethnic specialties, special occasion and holiday treats, meals for two, and a host of family favorites.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Rosie O'Donnell: Her True Story",
        "Authors": "By Mair, George and Green, Anna",
        "Description": "Provides a colorful, factual account of one of today's hottest TV stars, covering her childhood, her rise to fame, her other careers as a stand-up comic and film actress, and the professional and personal struggles she has endured along the way.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Birch Lane Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Handbags: The Power of the Purse",
        "Authors": "By Johnson, Anna and Morita, Eri (PHT)",
        "Description": "The Bolide. The Plume. The Birkin--object of lust in Sex in the City. Celebrating the must-have accessory for the fashion conscious woman, Handbags is an obsessive, irresistible visual extravaganza, featuring over 900 full-color photographs of the most luxurious, witty, covetable, talismanic examples of the bagmaker's art and history.The iconic Hermés Kelly bag, made from first stitch to last by a single craftsperson. Judith Leiber's whimsical minaudiFres, Moschino's smiley-face bag, Elsa Schiaparelli's surrealist \"bird cage,\" and the ne plus ultra of fashionable purses--the Chanel bag, reinvented for a new generation by Karl Lagerfeld. There are novelty bags, evening bags, sculptural bags, and class acts. Practical leather pochettes to carry a life, and elegant little reticules for nothing more than a credit card and a lipstick. Profiles of famous bagmakers: Jamin Puech, Kate Spade, Carlos Falchi, and the poet of utility, Bonnie Cashin, with her visionary \"Cashin Carry\" bags for Coach. Plus the anonymous Florentine artisans whose specialist leather workshops sprouted up in the 14th century.A labor of love written by Anna Johnson, author of Three Black Skirts, Handbags features over 900 bags from collections, museums, and designers around the world, most of them photographed in seductive full-color exclusively for the book. The perfectly matched complement to Shoes, Handbags is about fashion, about desire, about secrecy, craftsmanship, art, and imagination as well as about the changing roles of women--everything that's packed into every important bag. Includes timelines, fascinating captions, and the \"It\" bags--anyone for a Fendi baguette?",
        "Category": " Design , Fashion & Accessories",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The First Americans: Photographs from the Library of Congress (Library of Congress Classics)",
        "Authors": "By Library of Congress (COR) and Goetzmann, William H.",
        "Description": "Surveys the remarkable range of photography of Native Americans produced by professional photographers and filed for copyright at the Library of Congress between the Gilded Age and the Great Depression. Some 100 stunning b&w photographs (by Edward S. Curtis, among others) are accompanied by Goetzmann's lucid account of the photographers and of the public they supplied with its own chosen perceptions of native culture. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Photography , History",
        "Publisher": "Starwood Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Crime School: A Mallory Novel",
        "Authors": "By O'Connell, Carol",
        "Description": "Over the course of six novels, Carol O'Connell has become one of our most acclaimed writers of suspense. Her heroine, Kathy Mallory, is \"stunningly unique\" (Milwaukee Journal Sentinel). \"O'Connell conjures up a world of almost Faulkerian richness and complexity,\" said People, and the Chicago Tribune wrote simply, \"O'Connell has raised the standard for psychological thrillers.\"  A wild child turned New York City policewoman, Mallory was adopted off the streets as a small girl. Very little has ever really been known about what happened to her back then, how she lived-but the past is about to come alive. Crime School begins with the discovery of a woman found hanging in a burning apartment, tufts of her own blond hair stuck in her mouth and red candles scattered all around. Immediately, Mallory knows several things. The fire was set so the woman would be discovered. The crime is identical to another one twenty years old. And she knows this woman. She is a prostitute named Sparrow, who took her in all those many years ago, and then betrayed her. There is unfinished business between Mallory and Sparrow, and the quest to settle it will send her spinning back to a time of secrets and desperation, and into the mind of a criminal whose work has only just begun.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Elmo Loves You! (Little Golden Book)",
        "Authors": "By Albee, Sarah and Swanson, Maggie (ILT)",
        "Description": "Illustrations and rhyming text affirm the joy of being loved and being a friend, showing that, just as birds love to sing and kids love toys, Elmo loves little girls and boys",
        "Category": " Juvenile Fiction , Love & Romance",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Yee Haw",
        "Authors": "By Landoll",
        "Description": "",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Landoll Inc",
        "Price Starting With ($)": "8.48",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Ines of My Soul: A Novel",
        "Authors": "By Allende, Isabel",
        "Description": "A passionate tale of love, freedom, and conquest from the New York Times bestselling author of The House of the Spirits, Isabel Allende. Born into a poor family in Spain, Inés Suárez, finds herself condemned to a life of poverty without opportunity as a lowly seamstress. But it's the sixteenth century, the beginning of the Spanish conquest of the Americas. Struck by the same restless hope and opportunism, Inés uses her shiftless husband's disappearance to Peru as an excuse to embark on her own adventure. After learning of her husband's death in battle, she meets the fiery war hero, Pedro de Valdivia and begins a love that not only changes her life but the course of history. Based on the real historical events that founded Chile, Allende takes us on a whirlwind adventure of love and loss seen through the eyes of a daring, complicated woman who fought for freedom.",
        "Category": " Fiction , Historical , General",
        "Publisher": "HarperVia",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Praise and Worship: A Devotional for Little Ones",
        "Authors": "By Abraham, Ken, Abraham, Angela, Anderson, Terry, and Dunn, Kathleen",
        "Description": "This is the first devotional we've seen designed to teach children ages 3-8 that God wants His children to praise Him no matter where they go, how they feel, what they do or who they are with. Using beautiful illustrations and simple text, children learn the simplicity of praise and worship - and knowing God better through praise, prayer, singing, Bible stories and fun activities.",
        "Category": " Juvenile Nonfiction , Religious , Christian , Devotional & Prayer",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Sneakier Uses for Everyday Things (Volume 2) (Sneaky Books)",
        "Authors": "By Tymony, Cy",
        "Description": "How to Turn a Calculator into a Metal Detector, Carry a Survival Kit in a Shoestring, Make a Gas Mask with a Balloon, Turn Dishwashng Liquid into a Copy Machine, Convert a Styrofoam Cup into a Speaker, and Make a James Bond Spy Jacket with Everyday ThingsDid you know that your standard issue of Sports Illustrated magazine can be turned into over 20 useful gadgets? In author Cy Tymony's Sneakier Uses for Everyday Things, you'll learn how an average magazine can become many extraordinary gadgets such as a compass, hearing aid, magnifier, peashooter, and bottle opener.Sneakier Uses for Everyday Things covers 40 educational and unique projects that anybody can successfully complete with simple household items. The book includes a list of necessary materials, detailed sketches, and step-by-step instructions for each gadget and gizmo. Among the sneaky schemes are:* Creating a electroscope out of a glass jar* Turning a drinking cup into a speaker* Using an AM radio as a metal detector* Making a spy gadget jacket with over 20 individual sneaky uses ranging from a siren and whistle to a walkie-talkie and voice recorderThese days, \"be prepared\" applies to more than just the Boy Scouts. Sneakier Uses for Everyday Things provides loads of practical ideas, science projects, and captivating solutions for dealing with life's unexpected challenges. Great fun for the curious, inventive, and creative of all ages.",
        "Category": " Reference , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Puritan Dilemma: The Story of John Winthrop",
        "Authors": "By Morgan, Edmund S.",
        "Description": "",
        "Category": "",
        "Publisher": "Scott Foresman & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1962"
        }
    },
    {
        "Title": "The Holocaust Chronicle: A History in Words and Pictures",
        "Authors": "By Harran, Marilyn, Kuntz, Dieter (CON), Lemmons, Russel (CON), Michael, Robert Ashley (CON), Rickus, Keith (CON), and Roth, John K. (CON)",
        "Description": "At the not-for-profit price of six copies for $100 (including shipping), no library, school, religious institution, or bookstore has an excuse for not making available this portable Holocaust archive. A companion web site reinforces the message that the issues involved are ongoing. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , Holocaust",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "A Walk on the Beach: Tales of Wisdom From an Unconventional Woman",
        "Authors": "By Anderson, Joan",
        "Description": "From the author of the bestselling A Year By the Sea, comes the inspiring story about how her and Joan Erikson's friendship pushed them to remember the importance of transformation and sustained them through their unique challenges.  Shortly after arriving on Cape Cod to spend a year by herself, Joan Anderson’s chance   encounter with a wise and astonishing woman helped her usher in the self-discoveries that led to her ongoing renewal. First glimpsed as a slender   figure on a fogged-in beach, Joan Erikson was not only a friend and confidante when   she was most needed, but also a guide as Anderson stretched and grew into her unfinished   self. Joan Erikson was perhaps best known for her collaboration with her husband,   Erik, a pioneering psychoanalyst and noted author. After Erik’s death, she wrote   several books extending their theory of the stages of life to reflect her understanding   of aging as she neared ninety-five. But her wisdom was best taught through their   friendship; as she sat with Anderson, weaving tapestries of their lives with brightly   colored yarn while exploring the strength gathered from their accumulated experiences,   Joan Erikson’s lessons took shape on their small cardboard looms as well as in her   friend’s revitalized life. In writing about their extraordinary friendship, Anderson   reveals a need she didn’t know she had: for a mentor to help navigate the transitions   she faced as she grew beyond middle age. And when Joan Erikson had to face her husband’s   death and the growing limitations of her own body, Anderson was able to give back   some of the wisdom she had gleaned. To this poignant, joyful account, Joan Anderson   brings the candor and sensitivity that have made her an acclaimed speaker and writer   on midlife and its possibilities. A Walk on the Beach is an experience to savor and   treasure, a glimpse of the exuberant spirit that can be sustained and passed on in   all our friendships.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Before I Dream Bible Storybook",
        "Authors": "By Henley, Karyn",
        "Description": "Best-selling author Karyn Henley has designed this Bible storybook especially for a child's bedtime routine. Her stories are written in a soothing style that will help your child to relax and fall asleep resting on God's Word. Beautiful four-color art illustrates 60 Old and New Testament favorites and is recommended for children ages 3-8. This beautiful edition would make a wonderful gift and will be a treasured part of any family library. Be sure to check out the companionBefore I Dream CDs, which feature 18 of the stories from the storybook.",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Tyndale Kids",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "With This Ring (The Wedding Album Series #2)",
        "Authors": "By Wells, Marian",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Crane's Wedding Blue Book: The Styles and Etiquette of Announcements, Invitations and Other Correspondences",
        "Authors": "By Feinberg, Steven L.",
        "Description": "Lists types of wedding invitations available, and discusses the etiquette for using them",
        "Category": " Education , Reference",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "How to make your man more sensitive",
        "Authors": "By O'Connor, Dick and Glynn, Diane",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Water for Elephants: A Novel",
        "Authors": "By Gruen, Sara",
        "Description": "Over 10,000,000 copies in print worldwide #1 New York Times Bestseller A Los Angeles Times Bestseller A Wall Street Journal Bestseller A Newsday Favorite Book of 2006 A USA Today Bestseller A Major Motion Picture starring Reese Witherspoon, Robert Pattinson, and Christoph Waltz   Jacob Janowski’s luck had run out?orphaned and penniless, he had no direction until he landed on a rickety train that was home to the Benzini Brothers Most Spectacular Show on Earth. A veterinary student just shy of a degree, he was put in charge of caring for the circus menagerie. It was the Great Depression and for Jacob the circus was both his salvation and a living hell. There he met Marlena, the beautiful equestrian star married to August, the charismatic but brutal animal trainer. And he met Rosie, an untrainable elephant who was the great hope for this third-rate traveling show. The bond that grew among this group of misfits was one of love and trust, and ultimately, it was their only hope for survival.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Algonquin Books of Chapel Hill",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "America: A Narrative History Volume One",
        "Authors": "By Tindall, George Brown and Shi, David E.",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "W. W. Norton & Company, Incorporated",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Vampire Beach - Bloodlust & Initiation",
        "Authors": "By Duval, Alex",
        "Description": "Jason lives in hyper-cool Malibu and hangs out with the cool kids. He thinks he's pretty lucky to be considered a friend of the gorgeous Sienna. But only Jason and his friend know the secret behind Sienna's IT crowd - that they are partial to the taste of blood.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Fabulous Girl's Guide to Decorum",
        "Authors": "By Izzo, Kim and Marsh, Ceri",
        "Description": "Good manners will make you fabulous. Good manners will make you sexy. The well-mannered get invited to more dinner parties, see their career aspirations blossom, and have a wider array of friends and eligible suitors. So if you want to become your most fabulous self, read on–The Fabulous Girl’s Guide to Decorum is your ticket to becoming the girl you want to be.Authors Kim Izzo and Ceri Marsh know first-hand that today’s young women require etiquette advice that speaks to their modern sensibilities. Yes, we girls need to know how to write a perfect thank-you note and set a proper table–but we also need to know how to handle a one-night stand, how to ask for a promotion, what to wear at an art opening, and when a budding romance should move from supper to sex. With The Fabulous Girl’s Guide to Decorum, Izzo and Marsh have written the etiquette guide for the new millennium and created the ultimate icon of style for the 21st century: The Fabulous Girl. She’s liberated but chic, impeccably mannered but never a snob, confident but compassionate, full of verve instead of vanity. She’s the epitome of Audrey Hepburn-esque style and savoire faire at the workplace, at a dinner party, and even in the bedroom.The Fabulous Girl’s Guide to Decorum addresses all aspects of urban life, including careers, friendships, families, entertaining, socializing, romance, and sex (these days they don’t necessarily go hand in hand!) and provides invaluable advice on how to navigate these tricky waters with unfailing grace. From what to wear at a power lunch to how to behave at a film premier, Izzo and Marsh address topics such as:·Coping with an office backstabber·Taxi and door-holding protocol on dates·How to handle an affair with the boss·Hosting the perfect dinner party·How to handle fair weather friends·Protocol for first-night sex·The 10 things an FG will always have in her handbag·Saving face when a male buddy has become too attachedCharming, witty and eminently practical, The Fabulous Girl’s Guide to Decorum is as essential as the little black dress and a must for every young woman’s bookshelf.",
        "Category": " Reference , Etiquette",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "America Online For Dummies (America Online for Dummies, 6th ed)",
        "Authors": "By Kaufeld, John",
        "Description": "With more than 400,000 copies of previous editions in print, America Online For Dummies is a perennial favorite. Now thoroughly updated for AOL 5 and featuring an improved directory of AOLs most popular channels, this classic guide shows users how to make the most of the latest e-mail, chatting, browsing, and personalization features.",
        "Category": " Computers , Internet , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.75",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Dorie: The Girl Nobody Loved",
        "Authors": "By Lutzer, Erwin W., Van Stone, Dorie N., and Christenson, Evelyn (FRW)",
        "Description": "\"Someone has said that when you have nothing left but God,  you realize that God is enough. God had stood beside me when no one else  wanted me. He was not going to abandon me now. God would have to heal the emotional  pain that throbbed through my body.\"As a child, Dorie was rejected  by her mother, sent to live in an orphanage where she was regularly beaten by the  orphanage director, was beaten time and again by cruel foster parents, and was daily  told that she was ugly and unlovable. Dorie never knew love until a group of college  students visited the orphanage and told her that God loved her. As she accepted  that love, her life began to change. Dorie is a thrilling true account  of what God's love can do in a life. Doris Van Stone takes readers through the hard  years of her childhood into her fascinating years as a missionary with her husband  to the Dani tribe in New Guinea. With the rise of illegitimate births, the increase  in divorce statistics, and the frightening escalation of child abuse, this story  stands as a reminder that God's love, forgiveness, and grace are greater than human  hurt and sorrow. More than 170,000 in print.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "Peculiar Treasures: A Biblical Who's Who",
        "Authors": "By Buechner, Frederick",
        "Description": "The testimony of more than one hundred twenty-five biblical figures including David and Paul, Eve and Mary Magdalene, and Onesimus and Philemon emphasize that both the holiest and the most profane among us are irreducibly human",
        "Category": " Religion , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "If You Haven't Got the Time to Do It Right, When Will You Find the Time to Do It",
        "Authors": "By Mayer, Jeffrey J.",
        "Description": "A renowned time-management consultant offers his program to the general public in a comprehensive manual that details the principles of organization and improving productivity",
        "Category": " Business & Economics , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    }
]