[
    {
        "Title": "Making Kind Choices",
        "Authors": "By Newkirk, Ingrid and McCartney, Paul (FRW)",
        "Description": "Choosing a compassionate lifestyle that makes you feel good and positively impacts on the environment and on animals has never been easier. In this practical and accessible handbook, loaded with resources for all products that are mentioned, Ingrid Newkirk presents fabulous options that will not only enhance your life, but those of your neighbors, your community, animals, and the earth itself.  From comfortable home furnishings, to delicious foods, to fashionable clothing there are a myriad of choices to be made that can have a lasting positive effect on the well-being of animals and the environment, including:- recognizing hidden animal ingredients in cosmetics and household products- raising ecologically aware and animal-friendly kids- creating healthy, environmentally-friendly meals for everyday and special occasions- dressing with style without using leather or other animal products- dealing kindly with mice, insects, and other 'pests' in home or garden- adopting the right animal companion for you- volunteering and investing in eco- and animal-friendly companies- traveling with Eco-consciousness",
        "Category": " Nature , Animal Rights",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Emerging Churches: Creating Christian Community in Postmodern Cultures",
        "Authors": "By Gibbs, Eddie and Bolger, Ryan K.",
        "Description": "The \"emerging church\" movement is perhaps the most significant church trend of our day. The emerging church offers and encourages a new way of doing and being the church. While it largely resonates with an eighteen-to-thirty-four-year-old audience--the first fully postmodern generation--it is also gaining popularity with older Christians and encompasses a broad array of traditional and contemporary churches. Emerging Churches explores this movement and provides insight into its success.Filled with the latest research and interesting, anecdotal testimonies from those on the cutting edge of ministry, this book provides pastors, church leaders, and interested readers with an insightful glimpse into the thriving churches of today--and tomorrow.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Baker Academic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Southwest: New Mexico and Arizona (The Smithsonian Guides to Natural America)",
        "Authors": "By Page, Jake and Huey, George H. H. (PHT)",
        "Description": "Covers parks, wilderness preserves, and nature sanctuaries",
        "Category": " Travel , United States , West , Mountain (AZ, CO, ID, MT, NM, NV, UT, WY)",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "One Day in the Tropical Rain Forest",
        "Authors": "By George, Jean Craighead and Allen, Gary (ILT)",
        "Description": "Today is doomsday for a young Venezuelan Indian boy's beloved rain forest and its animal life—unless he and a visiting naturalist can save it.  \"George makes drama large and small out of the minute-by-minute events in an ecosystem . . . gripping ecological theater.\" —C.  \"An example of nonfiction writing at its best.\" —SLJ.   Notable 1990 Children's Trade Books in Social Studies (NCSS/CBC)Outstanding Science Trade Books for Children 1990 (NSTA/CBC)",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Red Kayak",
        "Authors": "By Cummings, Priscilla",
        "Description": "Brady loves life on the Chesapeake Bay with his friends J.T. and Digger. But developers and rich families are moving into the area, and while Brady befriends some of them, like the DiAngelos, his parents and friends are bitter about the changes. Tragedy strikes when the DiAngelos’ kayak overturns in the bay, and Brady wonders if it was more than an accident. Soon, Brady discovers the terrible truth behind the kayak’s sinking, and it will change the lives of those he loves forever. Priscilla Cummings deftly weaves a suspenseful tale of three teenagers caught in a wicked web of deception.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Traitor (Tommy Carmellini, Book 2)",
        "Authors": "By Coonts, Stephen",
        "Description": "When he is assigned to Paris, CIA officer Tommy Carmellini finds himself working for his old boss, Jake Grafton, who is the new CIA operations officer in charge of Europe. Grafton has a mission: He believes that the director of the French intelligence service has a secret agent among the leaders of Al Queda, and the Americans want access to that intelligence. Yet the director denies any such mole exits.While trying to ferret out the truth, Grafton and Carmellini are quickly cast into a labyrinth of espionage, deception, and murder. The French intelligence director has secret investments in the Bank of Palestine, and a killer is on the loose. If that weren't enough, the leaders of the G-8 industrialized nations will soon meet in Paris, an event that would make a tempting terrorist target. Throw into the mix the very beautiful and clever daughter of the French ambassador to Washington, an Israeli spy or two, and the stage is set for a tour de force of deception and drama in the world's most beautiful city: graceful, ageless Paris.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Mask Market: A Burke Novel (Burke Novels)",
        "Authors": "By Vachss, Andrew H.",
        "Description": "They meet in a no–name diner. A shadowy man hands Burke a CD dossier of someone he wants found. Minutes later, as Burke watches from an alley, his client is gunned down by a professional hunter–killer team. Burke slips away, unsure if he’s been spotted. Later, when he examines the dossier, he discovers that the missing woman is Beryl Preston, a girl he’d rescued from a brutal pimp twenty years earlier—when she was only thirteen—and returned to her father. Now he has to find her again—not only because she might be in danger, but also because he has to prove to himself that his rescue mission hadn’t been financed by a predator who wanted his “property” returned. His search will force him to confront a new kind of human ugliness and, finally, to practice the survivalist triage that has marked—and cursed—his life since childhood. In Mask Market, Burke the outlaw investigator finds himself searching for the truth: not only about a girl named Beryl, but also about himself.This is classic Burke: dark, dangerous, and galvanizing, from the opening scene to the explosive climax.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "White Sister: A Shane Scully Novel (Shane Scully Novels)",
        "Authors": "By Cannell, Stephen J.",
        "Description": "Back from the New York Times bestselling Cold Hit, Detective Shane Scully goes up against the beautiful, blonde wife of powerful hip-hop mogul--who stands at the center of a ruthless conspiracy Leaving L.A.'s Parker Center, Shane Scully and his wife, Alexa, agree to meet at home in one hour.  Shane gets there; Alexa doesn't.   This tale turns deadly, when in the middle of the night, he's called to a crime scene on Mulholland Drive, where the victim, who appears to be a gang member has been handcuffed and executed, gangland style.  What's worse is that the victim's body is in Alexa's car.  Her service revolver, which Shane discovers nearby, is probably the murder weapon.  But Alexa is missing. As Shane desperately tries to find his wife, his leads take him into the frightening world of gangsta rap music and into the center of a feud between two record companies, both heavily manned by Crips and Bloods.  At the center of this war is one of the most lethal adversaries he's ever encountered: Stacy Maluga, a trashy, beautiful Lady Macbeth-like white woman raised in Compton, married to a multi-millionaire rap mogul and known in the gangsta hip-hop world as the White Sister. Shane is no stranger to big trouble, but he's never had to face being a cop in jail with a hit out on him, while being smeared by urban activists as a \"racist cop.\"  Much, much worse than all that is the potential death of his beloved wife, Alexa.  In the White Sister, he may have met his match in a powerful and media-savvy enemy who will stop at nothing to forge her own criminal empire.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Betty Crocker's Step by Step Cookbook",
        "Authors": "By Crocker, Betty",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Taste of Home Holiday & Celebrations Cookbook 2008 (Taste of Home Holiday & Celebrations Cookbook 2008)",
        "Authors": "By Taste of Home",
        "Description": "",
        "Category": "",
        "Publisher": "Taste of home",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Each Little Bird That Sings",
        "Authors": "By Wiles, Deborah",
        "Description": "Ten-year-old Comfort Snowberger has attended 247 funerals. But that's not surprising, considering that her family runs the town funeral home. And even though Great-uncle Edisto keeled over with a heart attack and Great-great-aunt Florentine dropped dead--just like that--six months later, Comfort knows how to deal with loss, or so she thinks. She's more concerned with avoiding her crazy cousin Peach and trying to figure out why her best friend, Declaration, suddenly won't talk to her. Life is full of surprises. And the biggest one of all is learning what it takes to handle them.Deborah Wiles has created a unique, funny, and utterly real cast of characters in this heartfelt, and quintessentially Southern coming-of-age novel. Comfort will charm young readers with her wit, her warmth, and her struggles as she learns about life, loss, and ultimately, triumph.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "So You're About to Be a Teenager: Godly Advice for Preteens on Friends, Love, Sex, Faith and Other Life Issues",
        "Authors": "By Rainey, Dennis, Rainey, Barbara, Rainey, Samuel, and Rainey, Rebecca",
        "Description": "Samuel and Rebecca Rainey, preteens themselves not many years ago, add their perspective as young adults who vividly recall their own successes and failures as teenagers. Covering such topics as friends, peer pressure, boundaries, dating, and sex, the Raineys address the most common traps of adolescence and teach young people how to avoid making poor choices. Short, concise chapters are filled with engaging illustrations and practical applications. This book is essential reading for preteens.",
        "Category": " Family & Relationships , Life Stages , Adolescence",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Miss O and Friends: Trouble With a Capital O",
        "Authors": "By Speregen, Devra Newberger, Brindak, Hermine (ILT), and Miss O",
        "Description": "It’s a new school year, and Miss O’s new teacher is a complete nightmare! Mean, unfair, strict...and she has decided that Olivia is trouble with a capital O no you don't, young lady. School rumor has it that sometime in the misty past, the teacher threw a piece of chalk that took out a kid’s eye! Gross—but could it be true? When other mysterious stories around the school demand investigation, Miss O and her friends Justine, Harlie, and Isabella, along with her sister, Juliette, create a Web site to get to the bottom of them. Will it be Miss O who vindicates the very teacher who wants to fail her? This first book in the Miss O and Friends series introduces the five friends with a lively, engaging story that teaches about working with others, problem-solving, taking action, and keeping an open mind.Each book in the Miss O and Friends series is told from the perspective of one of the friends, focusing on her unique perspective and interests, and each one is fun to read, action-packed, and full of answers and sound advice for meeting the real-life challenges of tween girls.",
        "Category": " Juvenile Fiction , Social Issues , Friendship",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Emily Ever After: A Novel",
        "Authors": "By Dayton, Anne and Vanderbilt, May",
        "Description": "A quirky and quick-witted girl moves to Manhattan and holds on for dear life.Emily Hinton needs out. She comes from a small town in California where the church handbell choir concert passes for a decent way to spend a Saturday and she’s known all the boys since kindergarten. She dreams of sophisticated people, love, and Louis Vuitton. When she lands a job at the world-famous publishing house Morrow & Sons in New York, she knows that she is finally on her way. She packs her bags, says good-bye, and sets out for Manhattan, where she will fit in, even if it kills her.In spite of her naïveté, she quickly becomes friends with the girls at work and begins to learn a thing or two about how things are done in Manhattan. She soon attracts the attention of the handsome Bennett and is swept into a whirlwind romance, but an overnight visit to his parents’ home at Thanksgiving and his seemingly idle flirtations with one of her colleagues give her second thoughts about what Bennett really wants. Her uncertainty about her feelings escalates when one of the hometown boys she left behind reappears in her life. Emily’s days at the office are also becoming complicated: an ambitious editor is breaking all the rules to publish a controversial book that demeans everything she believes in. Will she stand up for what she knows is right and risk losing it all? Balancing her passion for the glamour of New York City with her determination to live by her morals turns out to be much more difficult than Emily ever imagined. Her roundabout quest for happiness will endear her to anyone who has ever dreamed of making it big, and faced more than a few pitfalls along the way.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "See You Later, Gladiator (Time Warp Trio #9)",
        "Authors": "By Scieszka, Jon and McCauley, Adam (ILT)",
        "Description": "Joe, Fred, and Sam demonstrate some of their favorite professional wrestling moves, including the \"Time Warp Trio Blind Ninja Smackdown,\" when they're transported to ancient Rome and forced to fight as gladiators in the Colosseum. 35,000 first printing.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Line of Fire (Star Trek: The Next Generation - Starfleet Academy, Book 2)",
        "Authors": "By David, Peter",
        "Description": "On his first mission at Starfleet Academy, young cadet Worf travels into deep space and must deal with the conflict between his Klingon heritage and his role in Starfleet. Original. 150,000 first printing. 75,000 ad/promo.",
        "Category": "",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Greatest Dog Stories Ever (omnibus)",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "Quill Tree Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Secret Clique (Replica 5)",
        "Authors": "By Kaye, Marilyn",
        "Description": "When Amy Candler wants to join the popular crowd at school, it doesn't make any sense to her friends, but neither do the other strange occurrences at Parkside Middle School, including student disappearances and whispers of dark secrets. Original.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "A Life God Rewards: Girls Only (Breakthrough Series)",
        "Authors": "By Wilkinson, Bruce and Thomas, Mack",
        "Description": "In A Life God Rewards, Bruce Wilkinson showed exactly how God designed each day here to be eternally significant. Here Bruce, along with veteran youth author Mack Thomas, speaks specifically to girls ages eight to twelve, ready for their lives to make a difference forever.",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "Multnomah Kidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "How to Stay Christian in High School",
        "Authors": "By Gerali, Steve",
        "Description": "We know full well the pressures and stress that high school students experience today. As if it weren’t hard enough to try to pass A.P. English, make the varsity football team, and stay out of trouble, students are constantly hearing about how they need to be a “good Christian.” It’s not easy. Being a Christian might be tough, but it’s worth it. Now updated for the next generation of teenagers going through high school, this bestselling resource teaches teens how to handle the temptations and pressures they face every day. Through reading about teenagers in the Bible who also faced huge issues in their lives, teens will be encouraged to make a difference in their world today.How to Stay Christian in High School will help teen readers grapple with their faith and make it real for whatever circumstance they face.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Think",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Downhill Megan (Magic Attic Club)",
        "Authors": "By Magraw, Trisha, Grote, Rich (ILT), and Leotti, Janice (ILT)",
        "Description": "A visit to the magic attic helps Megan overcome her cold feet at the thought of traveling alone to visit her father at a ski resort in Switzerland.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Magic Attic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Unfabulous #2: Split Ends",
        "Authors": "By Wasserman, Robin, Rose, Sue, and Paxson, Madellaine",
        "Description": "When picture day is unexpectedly moved up by a few weeks, Addie Singer isn't nervous, as she loves the camera, but when someone tells her she has flat hair, she's determined to fix it, with not-so-fabulous results.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "9.75",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "A Girl's Guide To College: Making the most of the best four years of your life",
        "Authors": "By Maynigo, Traci",
        "Description": "WELCOME TO COLLEGE, GIRLS!You've been waiting for this. Four years of freedom, parties, guys, and new experiences. You're bound to have a blast no matter what, but surviving college won't be easy. Are you ready for it?Don't fret, ladies, this guide will tell you everything you need to know about getting through the best four years of your life. It's got the basics that your mom would want you to know, like how to do your laundry, how to manage your money, and how to survive your classes. But it'll also spill the juice on the things you care about, like how to make your shoebox of a dorm room into your own little castle, how to keep fit and stay healthy, how to throw a great party, and how to deal with guys and sex (two things that for some reason are difficult to handle separately). It's a guide just for you girls, written by a girl who's been there.",
        "Category": " Study Aids , College Guides",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Coaching Youth Lacrosse: Includes 125 Drills",
        "Authors": "By American Sport Education Program (COR) and American Sport Education Program",
        "Description": "",
        "Category": " Sports & Recreation , Lacrosse",
        "Publisher": "HUMAN KINETICS+ PUBLISHERS INC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Things Hoped For (Things Not Seen)",
        "Authors": "By Clements, Andrew",
        "Description": "Seventeen-year-old Gwen is preparing to audition for New York City’s top music schools when her grandfather mysteriously disappears, leaving Gwen only a phone message telling her not to worry. But there’s nothing more stressful than practicing for her auditions, not knowing where her grandfather is, and being forced to lie about his whereabouts when her insistent great-uncle demands an audience with him. Then Gwen meets Robert, also in town for music auditions, and the two pair up to brave the city without supervision. As auditions approach and her great-uncle becomes more aggressive, Gwen and Robert make a startling discovery. Suddenly Gwen’s hopes are turned upside down, and she and Robert are united in ways neither of them could have foretold. . . .",
        "Category": " Young Adult Fiction , Family , Multigenerational",
        "Publisher": "Philomel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Iron Horse: Lou Gehrig in His Time",
        "Authors": "By Robinson, Ray",
        "Description": "A captivating biography of the legendary ball player Lou Gehrig, known for both his prowess on the field and his courage in life.Lou Gehrig will go down in history as one of the best ballplayers of all time. With a career average of .340 and 493 home runs, he played in a record-setting 2,130 consecutive games and  was elected to the Hall of Fame. He was robbed of his superb physical skills as a relatively young man by ALS, the degenerative disease now known as \"Lou Gehrig's Disease\", and died in 1941. Ray Robinson re-creates the life of this legendary ballplayer and also provides an insightful look at baseball through the Depression years, including all the great players of that era -- Babe Ruth, Ty Cobb, Miller Huggins, and more.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "HarperPb",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Sportscape: The Evolution of Sports Photography",
        "Authors": "By Barnes, Simon and Wombell, Paul",
        "Description": "",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Phaidon Press",
        "Price Starting With ($)": "9.73",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Daughter of the Queen of Sheba",
        "Authors": "By Lyden, Jacki",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "My Lives: A Memoir (P.S.)",
        "Authors": "By White, Edmund",
        "Description": "No one has been more frank, lucid, and entertaining about growing up gay in Middle America than Edmund White. Best known for his autobiographical novels, starting with A Boy's Own Story, White here takes fiction out of his story and delivers the facts of his life in all their shocking and absorbing verity. In My Lives, White shares his enthusiasms and his passions, and he introduces us to his lovers and predilections.",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "Ecco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Finding the Right Words",
        "Authors": "By Bockelman, Wilfred",
        "Description": "",
        "Category": " Religion , Christian Ministry , Pastoral Resources",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Little People Big Book About Holidays and Celebrations",
        "Authors": "By Time-Life Books",
        "Description": "A collection of original stories, retellings, informational articles, poems, activities, and games about holidays.",
        "Category": " Literary Criticism , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Classic cooking made easy: A cookbook and videotape program",
        "Authors": "By Fischer, C. P. and Piepenbrock, M.",
        "Description": "",
        "Category": "",
        "Publisher": "Barron's",
        "Price Starting With ($)": "7.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Toward Full Communion and Concordat of Agreement (Lutheran-Episcopal Dialogue Series III)",
        "Authors": "By Norgren, William A. (EDT)",
        "Description": "",
        "Category": " Religion , Christianity , General",
        "Publisher": "Forward Movement Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "101+ Hurry-up hamburger recipes",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Good Housekeeping All-American Cookbook",
        "Authors": "By Leblanc, Beverly, Maisner, Heather, Lyford, Irene, and Grayson, D. (EDT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Hearst Books - William Morrow & Co.",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Druid of Shannara (The Heritage of Shannara)",
        "Authors": "By Brooks, Terry",
        "Description": "The second volume of The Heritage of Shannara, which continues one of the most popular fantasy series of all timeAncient evil forces remain in control of the Four Lands. To restore the Kepp of the Druid Allanon, Walker Boh sets out on a journey to find the black Elfstone. After narrowly escaping death, he learns that the Elfstone lies in the hands of the Stone King. Now Walker Boh must venture into perilous, unknown lands with a strange band of fellow travelers that includes Morgan Leah, whose once-magic sword has been broken; Quickening, the daughter of the ancient King; and Pe Ell, an assassin who hatches his own dark, sinister plot. Thus continues the enthralling Shannara epic, a spellbinding tale of adventure, magic, and myth…",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Great Images of the 20th Century: The Photographs That Define Our Times",
        "Authors": "By Knauer, Kelly (EDT) and Time, Inc. (COR)",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Better Homes and Gardens Come Home to Country",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Shows examples of country style interior design for living rooms, dining rooms, bedrooms, baths, and kitchens",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "101 made-to-fit quilts for your home",
        "Authors": "By Stauffer, Jeanne and Hatch, Sandra L. - Editors",
        "Description": "",
        "Category": "",
        "Publisher": "House of White Birches",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Elf Queen of Shannara (Heritage of Shannara, Book 3)",
        "Authors": "By Brooks, Terry",
        "Description": "The third volume of The Heritage of Shannara, which continues one of the most popular fantasy series of all time“Find the Elves and return them to the world of Men!” the shade of the Druid Allanon had ordered Wren.It was clearly an impossible task. The Elves had been gone from the Westland for more than a hundred years. There was not even a trace of their former city of Arborlon left to mark their passing. No one in the Esterland knew of them -- except, finally, the Addershag.The blind old woman had given instructions to find a place on the coast of the Blue Divide, build a fire, and keep it burning for three days. “One will come for you.\"Tiger Ty, the Wing Rider, had come on his giant Roc to carry Wren and her friend Garth to the only clear landing site on the island of Morrowindl, where, he said, the Elves might still exist, somewhere in the demon-haunted jungle.Now she stood within that jungle, remembering the warning of the Addershag: “Beward, Elf-girl. I see danger ahead for you . . . and evil beyond imagining.\" It had proved all too true.Wren stood with her single weapon of magic, listening as demons evil beyond all imagining gathered for attack. How long could she resist?And if, by some miracle, she reached the Elves and could convince them to return, how could they possibly retrace her perilous path to reach the one safe place on the coast?",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Bug's Life Junior Novel: Scholastic Special Edition",
        "Authors": "By 56 - Disney Press",
        "Description": "",
        "Category": "",
        "Publisher": "HB Fenn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Speaking My Mind: Selected Speeches",
        "Authors": "By Reagan, Ronald",
        "Description": "",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Bug in Teacher's Coffee: And Other School Poems",
        "Authors": "By Reed, Mike (ILT) and Dakos, Kalli",
        "Description": "Kalli Dakos's twenty-three playful poems explore the secret lives of school lunches, jungle gyms, pencils, and more! Mike Reed's comical artwork perfectly brings to life everyday classroom objects. Beginning readers will relish finding out what really goes on at school.00 Children's Choices (IRA/CBC)",
        "Category": " Juvenile Nonfiction , Poetry , Humorous",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Dragon Rider",
        "Authors": "By Bell, Anthea and Funke, Cornelia Caroline",
        "Description": "Published before THE THIEF LORD in Germany, DRAGON RIDER established Cornelia Funke as a bestselling and critically acclaimed author. Now, this fantastical epic has come to America!Firedrake, a young dragon, receives a frightening warning one night: Humans are planning to destroy the valley in which he lives! All the dragons must flee. Their only refuge is a place above the clouds called the Rim of Heaven --- which may not even exist. Firedrake boldly volunteers to go ahead first. As he embarks on his journey, he meets Ben, a runaway boy. Together, the boy & dragon make their way toward the Rim of Heaven, all the while running a step ahead of Nettlebrand, a monster who will stop at nothing to hunt down Firedrake. Their quest will truly become an adventure like no other.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Chicken House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Henry and the Paper Route (Henry Huggins)",
        "Authors": "By Cleary, Beverly",
        "Description": "Newbery Medal–winning author Beverly Cleary gives readers a hero they'll relate to, and root for, in this comical and inspiring novel about Henry Huggins's mission to prove himself worthy of his very own paper route. All the older kids work their own paper route, but because Henry is not eleven yet, Mr. Capper won't let him. Desperate to change his mind, Henry tries everything he can think of to show he's mature and responsible enough for the job. From offering free kittens to new subscribers, to hauling hundreds of pounds of old newspapers for his school's paper drive, there's nothing Henry won't try. But it might just be the irrepressible Ramona Quimby who shows Mr. Capper just how capable Henry is.",
        "Category": " Juvenile Fiction , Business, Careers, Occupations",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Collected What If? Eminent Historians Imagine What Might Have Been",
        "Authors": "By Stephen E. Ambrose, Caleb Carr, David McCullough, John Lukas, John Keegan, James Bradley, Cecelia Holland, Alistair Horne, William H. McNeill",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Slaves Of Heaven",
        "Authors": "By Cooper, Edmund",
        "Description": "",
        "Category": "",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Garden Designs: Simple Steps to Beautiful Flower Gardens (Time Life How-To Gardening)",
        "Authors": "By Time-Life Books",
        "Description": "Includes thirty-five gardening projects, and explains how to test your soil, determine if there is enough sun and shade, and work with garden tools.",
        "Category": " Gardening , Landscape",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1866"
        }
    },
    {
        "Title": "Going After Cacciato",
        "Authors": "By O'Brien, Tim",
        "Description": "\"To call Going After Cacciato  a novel about war is like calling Moby  Dick a novel about whales.\" So wrote  The New York Times of Tim O'Brein's  now classic novel of Vietnam. Winner of the 1979  National Book Award, Going After  Cacciato captures the peculiar blend of horror and  hallucinatory comedy that marked this the strangest  of wars. Reality and fantasy merge in this  fictional account of one private's sudden discussion to  lay down his rifle and begin a quixotic journey  from the of Indochina to the streets of Paris. Will  Cacciato make it all the way? Or will he be yet  another casualty of a conflict that seems to have no  end? In its memorable evocation of men both  fleeing and meeting the demands of the battle,  Going After Cacciato stands as much more  than just a great war novel. Ultimately it's about  the forces of fear and heroism that do battle in  the hearts of us all.",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Laurel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Flipping the Switch: Unleash the Power of Personal Accountability Using the QBQ!",
        "Authors": "By Miller, John G.",
        "Description": "In his bestselling book QBQ! The Question Behind the Question, John G. Miller revealed how personal accountability helps to create opportunity, overcome obstacles, and achieve goals by eliminating blame, complaining, and procrastination. The result? Stronger organizations, more dynamic teams, and healthier relationships. Now Miller takes readers to the next level to show how they can use the power of the QBQ! and personal accountability every day. When a light switch is flipped the flow of energy that is released reaches the lightbulb in an instant, bringing it to life. Similarly, asking the right kind of question-a QBQ-is the first step to empowering what Miller calls the Advantage Principles-five essential practices that will lead to a richer experience in every aspect of life: - LEARNING: live an engaged and energized life through positive personal growth and change- OWNERSHIP: attain goals by becoming a solution-oriented person who solves problems- CREATIVITY: find new ways to achieve by succeeding \"within the box\"- SERVICE: build a legacy by helping others succeed- TRUST: develop deep and rewarding relationships With compelling real-life stories and keen insights, Miller demonstrates how anyone can find success and satisfaction by \"flipping the switch.\"",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Building Mental Muscle: Conditioning Exercises for the Six Intelligence Zones",
        "Authors": "By Gamon, David",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "At The Narrow Passage (The Timeliner Trilogy, Book 1)",
        "Authors": "By Richard C. Meredith",
        "Description": "",
        "Category": "",
        "Publisher": "Playboy",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "In the Last Analysis (Kate Fansler series)",
        "Authors": "By Cross, Amanda",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Killing Orders",
        "Authors": "By Paretsky, Sara",
        "Description": "V.I. Warshawski's latest case has alreasy opened  up old wounds. But when a silky voice on the phone  threatened to throw acid in her eyes, V.I. knew  this one could finish her off with some brand-new  ones. The sour-faced old aunt she had agreed to  help was accused of stealing millions in stock  certificates from a pious order of Dominican brothers.  V.I. knew the woman was a witch, not a thief, and  she soon smelled something rotten in the sanctum  sanctorum of Chicago's most powerful movers and  shakers -- the Church and the Mob. Now someone wants  to see V.I. burn in hell. But this tough cookie of  a private eye had her back up, a brand-new Smith &  Wesson, and a daring plan to make the bad guys go  to the devil first.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "The Adventures of Tom Sawyer (Mark Twain Library)",
        "Authors": "By Twain, Mark",
        "Description": "This is Mark Twain’s first novel about Huck Finn and Tom Sawyer, and it has become one of the world’s best-loved books. It is a fond reminiscence of life in Hannibal, Missouri, an evocation of Mark Twain’s own boyhood along the banks of the Mississippi during the 1840s. \"Most of the adventures recorded in this book really occurred,\" he tells us. This is a book one never forgets: Tom whitewashing Aunt Polly’s fence, Tom and Huck’s dreadful oath, their cure for warts (\"spunk water\" and dead cats), Tom’s puppy love for Becky Thatcher, the boys playing \"pirate\" on Jackson’s Island.This Mark Twain Library text is the only edition since the first (1876) to be based directly on the author’s manuscript and to include all of the \"200 rattling pictures\" Mark Twain commissioned from one of his favorite illustrators, True W. Williams.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "His Eye Is On the Sparrow So ... This is Really for the Birds",
        "Authors": "By Potterbaum, Charlene",
        "Description": "",
        "Category": "",
        "Publisher": "Logos International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Poems of Peter Davison",
        "Authors": "By DAVISON, Peter.",
        "Description": "The poetry of Peter Davison, of which this is the ninth volume, covers a broad range of subject matter. Musical and supple, with rewards for the eye, the ear, and the mind, concerned as much with country as with city matters, Davison's poems move past personality. They open questions of identity, explorations of the natural world, personal and religious conflict, and the mysterious workings of memory. His poetry, such as the long poem \"The Great Ledge,\" is especially moving and powerful when read aloud.This volume, combining Davison's most recent work with all the earlier poems he wishes to preserve, reveals a poet in his late middle age writing out of the midst of a life both active and contemplative, yet given over to poetry. He is a worthy heir to the passionate poetic tradition of Thomas Hardy and Robert Frost.",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "29.95",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Heaven in a Wildflower",
        "Authors": "By Brown, Joan and Wilson, Barbara (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "Peggy Pinson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "One Hundred and One Famous Poems",
        "Authors": "By Elizabeth Barrett Browning, George Gordon - Lord Byron, Emily Dickinson, George Eliot, Ralph Waldo Emerson, Robert Frost, Thomas Gray, John Keats, Rud",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Dictionary of Quotations",
        "Authors": "By Evans, Bergen",
        "Description": "This comprehensive compendium of famous and clever sayings--arranged alphabetically according to topic and author--contains a quotation for every occasion.",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "6.85",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Intimate Issues: Conversations Woman to Woman - 21 Questions Christian Women Ask About Sex",
        "Authors": "By Dillow, Linda and Pintus, Lorraine",
        "Description": "Intimate Issues answers the twenty-one questions about sex most frequently asked by Christian wives, as determined by a nationwide poll of over one thousand women.  Written from the perspective of two mature Christian wives and Bible teachers–women who you’ll come to know as teachers and friends–Intimate Issues is biblical and informative: sometimes humorous, other times practical, but always honest. Through its solid teaching warm testimonials, scriptural insights, and experts’ advise, you’ll find resolution for your questions and fears, surprising insights about God’s perspective on sex, and a variety of practical and creative ideas for enhancing your physical relationship with the husband you love.  With warmth and wisdom, authors Linda Dillow and Lorraine Pintus speak woman to woman: examining the teachings of Scripture, exposing the lies of the world, and offering real hope that every woman’s marriage relationship can become all it was intended to be in God’s design.",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "WaterBrook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Made in America: An Informal History of the English Language in the United States",
        "Authors": "By Bryson, Bill",
        "Description": "The author of Mother Tongue offers an affectionate and informative look at the origins of American English, including why strippers' apparel is called a G-string and what--or who--is the real McCoy. 75,000 first printing. $75,000 ad/promo. Tour.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Calvin & Hobbes Books, Tenth Anniversary Book",
        "Authors": "By Watterson, Bill",
        "Description": "Celebrating ten years of their crazy antics, author of the Calvin and Hobbes comic, Bill Watterson, invites readers to look back at the first ten years--featuring Watterson’s insights and classic comics.\"Watterson re-created the thoughts and feelings of a six-year-old with uncanny accuracy ... Calvin and Hobbes was, simply, the best comic strip.\" --Charles Solomon, Los Angeles TimesMany moons ago, the magic of Calvin and Hobbes first appeared on the funny pages and the world was introduced to a wondrous pair of friends -- a boy and his tiger, who brought new life to the comics page. To celebrate the tenth anniversary of this distinguished partnership, Bill Watterson prepared this special book, sharing his thoughts on cartooning and creating Calvin and Hobbes, illustrated throughout with favorite black-and-white and color cartoons.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Tales from Shakespeare (Puffin Classics)",
        "Authors": "By Lamb, Charles and Lamb, Mary",
        "Description": "Twenty of Shakespeare's plays, including both tragedies and comedies, retold in prose",
        "Category": " Young Adult Fiction , Classics",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "How To Study (5th Edition)",
        "Authors": "By Fry, Ronald W.",
        "Description": "Includes hints and techniques for managing time efficiently, taking notes, reading, using the library effectively, writing papers, and preparing for tests.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Career Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Secret Agencies: U.S. Intelligence in a Hostile World",
        "Authors": "By Johnson, Loch K.",
        "Description": "How has the end of the Cold War affected America’s intelligence agencies? When are aggressive clandestine operations justifiable, and who should be responsible for deciding to proceed with them? Should the United States engage in more aggressive economic espionage? These are just a few of the issues Loch Johnson examines in this thoughtful assessment of strategic intelligence and its vital role in modern governments.Johnson draws on historical data, more than five hundred interviews, and his own experience working for Congressional committees on intelligence. He begins by defining the functions of intelligence: espionage, counterintelligence, and covert action. He then provides an overview of America’s secret operations abroad, assesses the moral implications of clandestine operations, and offers guidelines for a more ethical approach to the use of secret power. Johnson explores the question of intelligence accountability, looking closely at how well intelligence agencies have been monitored through the forum of Congressional hearings. He compares America’s approach to intelligence with that of other nations, discusses the degree to which intelligence agencies should provide information about foreign businesses, and evaluates how well the U.S. intelligence agencies fared during the Cold War against the USSR. Secret agencies have the capacity not only to safeguard democracy but also to subvert it, says Johnson. As such, they deserve both our support and our scrutiny.",
        "Category": " History , United States , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Paid and Loving Eyes",
        "Authors": "By Gash, Jonathan",
        "Description": "Jonathan Gash's antiques-dealing, sleuthing rougue Lovejoy is back for a dazzling adventure that takes him from East Anglia to Paris, Zurich, and the heart of the underground antiques trade.While scraping by as a driver for Gaunt's Tryste Service - rented vans for romantic rendezvous - and having a sweetly passionate affair with a rich married woman he knows only as Almira, Lovejoy once again finds his divvying skills in demand. Local underworld figure Big John Sheehan orders him to judge an illicit competition involving an antique vase, and Lovejoy's ability to divine a genuine antique reveals that Big John has been duped. Soon afterward, when one member of the local antiques circle is killed and another gravely injured in a suspicious accident, Lovejoy realizes he has stumbled into an international ring of smuggling, forgery, and exploitation of the most sinister kind.Through circumstances he doesn't quite understand, Lovejoy is hired by Monsieur Troude, a powerful French entrepreneur, and soon finds himself juggling his love of antiques with his desire to stay alive. But before he can gain an understanding of the deadly scam, he must survive encounters with treasure troves of genuine and fake antiques, the Stolen and Purloined Antiques Rescue (KGB of the antiques trade), and a variety of beautiful, dangerous women.",
        "Category": " Fiction , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Idea of the University: A Reexamination",
        "Authors": "By Pelikan, Jaroslav Jan",
        "Description": "The crisis in university education has been the subject of vigorous debate in recent years. In this eloquent and deeply personal book, a distinguished scholar reflects on the character and aims of the university, assessing its guiding principles, its practical functions, and its role in society.Jaroslav Pelikan provides a unique perspective on the university today by reexamining it in light of John Henry Cardinal Newman's 150-year-old classic The Idea of a University and showing how Cardinal Newman's ideas both illuminate and differ from current problems facing higher education. Pelikan begins by affirming the validity of Newman's first principle: that knowledge must be an end in itself. He goes on to make the case for the inseparability of research and teaching on both intellectual and practical grounds, stressing the virtues--free inquiry, scholarly honesty, civility in discourse, toleration of diverse beliefs and values, and trust in rationality and public verifiability--that must be practiced and taught by the university. He discusses the business of the university--the advancement of knowledge through research, the extension and interpretation of knowledge through undergraduate and graduate teaching, the preservation of knowledge in libraries, museums, and galleries, and the diffusion of knowledge through scholarly publishing. And he argues that by performing these tasks, by developing closer ties with other schools at all levels, and by involving the community in lifelong education, the university will make its greatest contribution to society.",
        "Category": " Education , Higher",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Lights, Camera, War: Is Media Technology Driving International Politics?",
        "Authors": "By Neuman, Johanna",
        "Description": "Is CNN running foreign policy by dictating which wars we care about? Are leaders' role being usurped by a media whose technology can communicate faster and more emotionally to an unsuspecting public? Johanna Neuman debunks the common wisdom that we are experiencing a revolution in communication technology's influence over political decisions. What she unearths instead is an unrelenting pattern of change whenever new media inventions intersect with the political world, from movable type to the Internet.With a journalist's eye for detail, Neuman documents that each age thinks the technology that blesses its generation is revolutionary and unprecedented. Whenever a new media technology arrives, diplomats complain that their deliberation time is hastened, journalists boast that their influence is increased, and social commentators marvel that new technology will democratize all within its range. Just as predictable is the second pattern: Each generation eventually absorbs the changes demanded by technology and finds other ways of doing business. New technology may shorten the time it takes the public to receive information, but in the end, political leadership trumps media power.",
        "Category": " Political Science , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Best of Metal: The Essential CD Guide (Essential CD Guides)",
        "Authors": "By Elliott, Paul and Hotten, Jon",
        "Description": "",
        "Category": " Music , General",
        "Publisher": "Carlton Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Al Capone Does My Shirts (Tales from Alcatraz)",
        "Authors": "By Choldenko, Gennifer",
        "Description": "The Newbery Honor Book and New York Times Bestseller that is historical fiction with a hint of mystery about living at Alcatraz not as a prisoner, but as a kid meeting some of the most famous criminals in our history. Al Capone Does My Shirts has become an instant classic for all kids to read! Today I moved to Alcatraz, a twelve-acre rock covered with cement, topped with bird turd and surrounded by water. I'm not the only kid who lives here. There are twenty-three other kids who live on the island because their dads work as guards or cooks or doctors or electricians for the prison, like my dad does. And then there are a ton of murderers, rapists, hit men, con men, stickup men, embezzlers, connivers, burglars, kidnappers and maybe even an innocent man or two, though I doubt it. The convicts we have are the kind other prisons don't want. I never knew prisons could be picky, but I guess they can. You get to Alcatraz by being the worst of the worst. Unless you're me. I came here because my mother said I had to.A Newbery Honor BookA New York Times BestsellerA People magazine \"Best kid's Book\"An ALA Book for Young AdultsAn ALA Notable BookA School Library Journal Best Book of the YearA Krikus Reviews Editor's ChoiceA San Francisco Chronicle Best Book of the YearA Publishers Weekly Best Book of the YearA Parents' Choice Silver Honor BookA New York Public Library \"100 Titles for Reading and Sharing\" SelectionA New York Public Library Best Book for the Teen Age*\"Choldenko's pacing is exquisite. . . . [A] great read.\"—Kirkus Reviews, starred review*\"Exceptionally atmospheric, fast-paced and memorable!\"—Publishers Weekly, starred review*\"The story, told with humor and skill, will fascinate readers.\"—School Library Journal, starred review\"Al is the perfect novel for a young guy or moll who digs books by Gordon Korman, or Louis Sachar.\"—Time Out New York for Kids\"Funny situations and plot twists abound!\"—People magazine\"Heartstopping in some places, heartrending in others, and most of all, it is heartwarming.\"—San Francisco Chronicle",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "365 Foods Kids Love to Eat : Nutritious and Kid-Tested",
        "Authors": "By Ellison, Sheila and Gray, Judith",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Sourcebooks, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Uncle John's Bathroom Reader Plunges into History Again",
        "Authors": "By Bathroom Readers' Hysterical Society",
        "Description": "History repeats itself as Uncle John once again takes the plunge into the past! For our big number-two, we dug ever deeper into our bottomless vaults to bring you more of history’s most colorful characters, cultural milestones, funniest mishaps, and earth-shattering events. More than 500 pages of great stories, fascinating facts, and fun quizzes await you. Read about… * Philosophers who fought with fireplace pokers* “Mr. Gorbachev, tear down this Wall!”* Where are they now—the Goths* The golden age of wife-selling* History’s most horrible dentist award* The French monks who invented tennis* Women of the Gold RushAnd much, much more!",
        "Category": " Reference , Trivia",
        "Publisher": "Portable Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Dancing with Your Horse",
        "Authors": "By Anderson, Libby and Hazel-Groux, Leigh Ann",
        "Description": "",
        "Category": " Sports & Recreation , General",
        "Publisher": "Half Halt Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "You Can't Afford the Luxury of a Negative Thought",
        "Authors": "By McWilliams, Peter",
        "Description": "Explains the disease of negative thinking and prescribes the cure",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Going Crazy in Public: A Mac Fontana Mystery",
        "Authors": "By Emerson, Earl W.",
        "Description": "On a balmy night in June someone strikes a match and starts a fire, sparking outrage and fear in the sleepy town of Staircase, Washington. Fire Chief Mac Fontana's job is to restore the town's safety and stop the arsonist before he strikes again.The media descend on Staircase, and unexpectedly the town erupts with celebrity fever. A dramatic rescue effort by Mac's crew to pluck six people from another house on fire brings national attention, and the townsfolk fall all over themselves in adulation. But when reclusive actress Aimee Lee Culpepper is discovered living on the outskirts of town, thrusting her into the limelight for the first time since scandal ruined her reputation, things get complicated. Fontana's personal life - and his relationship with Aimee Lee - become tabloid fodder. And suddenly the newspapers begin to question his integrity.The arsonist continues on his burning binge, an innocent life is lost, and Mac must look for some unpleasant answers. Is Aimee Lee's young, fire-fascinated son the culprit? Or could it be one of Mac's own firefighters? Is Fontana the arsonist's ultimate target?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Chanting: Discovering Spirit in Sound",
        "Authors": "By Gass, Robert and Brehony, Kathleen",
        "Description": "Including details about chanting's history and traditions as well as new scientific findings about the many medical benefits of humming and vibration, this guide to vocal meditation provides readers with easy instructions, breathing techniques, and tips on how to create unique, personal chants. $30,000 ad/promo.",
        "Category": " Body, Mind & Spirit , Mindfulness & Meditation",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Adventures in Missing the Point: How the Culture-Controlled Church Neutered the Gospel",
        "Authors": "By Campolo, Tony",
        "Description": "How the Culture-Controlled Church Neutered the Gospel If you’re brave enough to take an honest look at the issues facing the culture–controlled church—and the issues in your own life—read on. Do you ever look at how the Christian faith is being lived out in the new millennium and wonder if we’re not doing what we’re supposed to be doing? That we still haven’t quite “gotten it”? That we’ve missed the point regarding many important issues? It’s understandable if we’ve relied on what we’ve been told to believe or what’s widely accepted by the Christian community. But if we truly turned a constructive, critical eye toward our beliefs and vigorously questioned them and their origins, where would we find ourselves? Best-selling authors Brian McLaren and Tony Campolo invite you to do just that. Join them on an adventure—one that’s about uncovering and naming faulty conclusions, suppositions, and assumptions about the Christian faith. In Adventures in Missing the Point, the authors take turns addressing how we’ve missed the point on crucial topics such as: salvation, the Bible, being postmodern, worship, homosexuality, truth, and many more.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to World Conflicts",
        "Authors": "By Strauss, Steven D.",
        "Description": "",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Care and Feeding of Dragons",
        "Authors": "By Seabrooke, Brenda",
        "Description": "In the sequel to The Dragon That Ate Summer, Alastair must put up with not only his fourth grade teacher, the dreaded Ms. Cassowary, but he must also keep away the dragonnappers who are after his pet dragon, Spike.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Quiltmaking Tips and Techniques: Over 1000 Creative Ideas to Make Your Quiltmaking Quicker, Easier, and a Lot More Fun (Rodale Quilt Book)",
        "Authors": "By Townswick, Jane",
        "Description": "Covers workspaces, fabric selection, patterns, applique, and quilting",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Whale Talk",
        "Authors": "By Crutcher, Chris",
        "Description": "“A truly exceptional book.”—Washington PostThere's bad news and good news about the Cutter High School swim team. The bad news is that they don't have a pool. The good news is that only one of them can swim anyway. Bestselling author Chris Crutcher’s controversial and acclaimed novel follows a group of outcasts as they take on inequality and injustice in their high school. \"Crutcher's superior gifts as a storyteller and his background as a working therapist combine to make magic in Whale Talk. The thread of truth in his fiction reminds us that heroes can come in any shape, color, ability or size, and friendship can bridge nearly any divide.”—Washington PostT.J. Jones hates the blatant preferential treatment jocks receive at his high school, and the reverence paid to the varsity lettermen. When he sees a member of the wrestling team threatening an underclassman, T.J. decides he’s had enough. He recruits some of the biggest misfits at Cutter High to form a swim team. They may not have very much talent, but the All-Night Mermen prove to be way more than T.J. anticipated. As the unlikely athletes move closer to their goal, these new friends might learn that the journey is worth more than the reward. For fans of Andrew Smith and Marieke Nijkamp. \"Crutcher offers an unusual yet resonant mixture of black comedy and tragedy that lays bare the superficiality of the high-school scene. The book's shocking climax will force readers to re-examine their own values and may cause them to alter their perception of individuals pegged as 'losers.'\"—Publishers WeeklyAn American Library Association Best Book for Young AdultsNew York Public Library Books for the Teen Age",
        "Category": " Young Adult Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Why Was I Adopted?",
        "Authors": "By Livingston, Carole",
        "Description": "A simple explanation of the adoption process designed to reinforce the young child's feelings of love and self-esteem",
        "Category": "",
        "Publisher": "Lyle Stuart",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "American Victorian: A Style and Source Book",
        "Authors": "By Grow, Lawrence and Von Zweck, Dina",
        "Description": "This fully-illustrated guide to the decorative elements of Victorian interior design covers both antiques and reproductions, and everything from furniture and fabrics to wallpaper and lighting",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Making And Decorating Your Own Paper: Innovative Techniques & Original Projects",
        "Authors": "By Blake, Kathy and Milne, Bill",
        "Description": "\"...How to construct new and recycle old paper; create books, cards, and frames; and embellish boxes....An eight-page gallery at the end, in addition to samples pictured throughout the text, helps make their vision real.\"--Booklist. \"...filled with low-cost techniques aimed at the individual artist who needs basic recipes and methods of papermaking...describe[s] how to decorate finished paper surfaces through the use of dyes, printing, stencils, and marbling....Visually appealing.\"--LJ.    144 pages (all in color), 8 1/2 x 10.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "A Setback is a Setup for a Comeback",
        "Authors": "By Wille Jolley",
        "Description": "",
        "Category": "",
        "Publisher": "Goko Management",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "What Me Incumbent",
        "Authors": "By Danzieger, Jeff",
        "Description": "",
        "Category": "",
        "Publisher": "Writings of Mary Baker Eddy",
        "Price Starting With ($)": "12.27",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Incredibly Awesome Crafts for Kids",
        "Authors": "By Treinen, Sara Jane",
        "Description": "Instructions showing forty-six craft projects for eight- to twelve-year-olds. Includes an index organized by topic, e.g. \"Gifts for your friends\" and \"Accessories for your room.\"",
        "Category": " Crafts & Hobbies , Crafts for Children",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Best Book of Volcanoes",
        "Authors": "By Adams, Simon and Dolan, Karen",
        "Description": "Explore the Earth's core, climb the world's highest peaks, and witness the dramatic eruptions of volcanoes. This enthralling introduction to one of the planet's mightiest physical forces shows how volcanoes are formed, where they are found and how they have changed the face of the Earth. Spectacular cut-away illustrations, fact panels, and a lively, informative text will keep young Earth Scientists on the boil. A reference section at the back of the book includes an illustrated glossary and a comprehensive index.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Earthquakes & Volcanoes",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Miranda Innes' Country Home Book: A Practical Guide to Restoring and Decorating in the Country Style",
        "Authors": "By Innes, Miranda",
        "Description": "Describes the country style of decorating, offers suggestions on furnishings, and demonstrates painting and stenciling techniques",
        "Category": " Architecture , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Around the World in 80 days",
        "Authors": "By Jules Verne",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "$14 In the Bank and a $200 Face in My Purse",
        "Authors": "By Guisewite, Cathy",
        "Description": "Chronicles the continuing crises in Cathy's life, as well as the misadventures of Baby Zenith, Andrea's daughter; Electra, the puppy; Mr. Pinkley, the boss; and her friend Charlene",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "American Family of the Civil War Era Paper Dolls in Full Color (Dover Paper Dolls)",
        "Authors": "By Tierney, Tom",
        "Description": "Travel back in time to the turbulent era of the American Civil War! This unique paper doll collection features 9 dolls, depicting three generations of a family. Their wardrobe of 36 authentic costumes offers realistic views of how people worked and played during the Civil War era. Extensive notes on apparel, fabrics, accessories, hairstyles, and other fashion elements provide fascinating period details.",
        "Category": " Juvenile Nonfiction , Activity Books",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "The Great Carnival Caper (Puzzle Masters)",
        "Authors": "By Speirs, John",
        "Description": "A series of picture puzzles in which the reader helps three young Puzzle Masters and their dog locate carnival entertainers, animals, and other attractions, decode messages, and find the villain responsible for wreaking havoc with the carnival.",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "SurfRiders: In Search of the Perfect Wave",
        "Authors": "By Warshaw, Matt",
        "Description": "How does it feel to be in the mouth of a 50-foot tube? To carve a perfect 200-degree turn? To get plowed under a thundering mountain of whitewater?   SurfRiders puts readers in the curl with 100 vivid full-color photographs and more than 20 stories by the greatest names in surfing. Chasing the swells from Waimea Bay to South Africa&#39;s Cape St. Francis, it brings to life the near-mystical allure of riding the big wave, the rush of shooting the tube, the draw of the pipeline. Along the way, it shows readers the pivotal points of surfing&#39;s development, explores the unique beach boy culture its spawned, provides a fascinating look at the evolution of the surfboard (or \"gun\" as its called) and recounts some of the most outrageous sets ever ridden.   In the tradition of Ski Fever! and The Olympic Spirit, this visually stunning book also features tons of sidebars, historic photos and incredible images of today&#39;s greatest champions. Designed for both die-hard surfers and landlocked dreamers alike, it is as close to hanging ten in big wave heaven as you can get without getting wet.",
        "Category": " Sports & Recreation , Water Sports",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "It's the Thought That Counts: For Better or for Worse 15th Anniversary Collection (Volume 14)",
        "Authors": "By Johnston, Lynn",
        "Description": "For years and years, Lynn Johnston has entertained, enlightened, and educated the world about the delights and disappointments of family life. Her strip is poignant and funny--and very often, universal. She captures a mother's frustration at an unruly teenager, a father's surprise in a growing daughter, and kids' various views about their future as they grow up.In It's the Thought That Counts, For Better or For Worse looks back on many of the series' high points through Lynn's hand-picked selection of color Sundays: the unexpected birth of baby April in 1991; the daring revelation that teenage family friend Lawrence was gay; the fear that comes with aging parents. The collection also includes those quietly funny moments in families: a father and his kids romping with abandon; a closet full of clothes that no longer span a middle-aged girth; a teenage son's first experience with a crush.Lynn Johnston fashioned the Patterson family after her own lively brood. Her real life experiences--divorce, childbirth, pets, and parents--show through in her work in the most wise and wonderful ways. Even better, this anniversary book contains Johnston's comments about some of her favorite strips in an amusing and informative narrative.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Chapman Your New Sailboat: Choosing It, Using It (A Chapman Nautical Guide)",
        "Authors": "By Marshall, Roger (CON) and Jessie, Diana B. (EDT)",
        "Description": "It’s always smooth sailing with this how-to guide from the premier name in boating. It lays out the possibilities, offers clever ideas for trying them out before buying, and shows you how to equip your boat and keep everything working wonderfully. A detailed questionnaire will help you select the perfect pleasure craft for your needs and budget.",
        "Category": " Transportation , Ships & Shipbuilding , General",
        "Publisher": "Hearst",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Young Rider",
        "Authors": "By Green, Lucinda",
        "Description": "Step-by-step instructions and sequential photographs teach young equestrians about all aspects of horsemanship, including how to ride and jump safely.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Camping & Outdoor Activities",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The First 20 Years of Monty Python",
        "Authors": "By Johnson, Kim \"Howard\"",
        "Description": "Offers a wide-ranging appreciation of the group's work, featuring exclusive interviews, rare photographs, an episode guide to the television shows, and discussions of the books, records and stage shows they have produced",
        "Category": " Performing Arts , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Journey to Cubeville :DILBERT",
        "Authors": "By Adams, Scott",
        "Description": "",
        "Category": "",
        "Publisher": "Andrews Mcmeel",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    }
]