[
    {
        "Title": "Insights into Excellence: Winning Game Plans from 22 Masters of Business Success",
        "Authors": "By Speakers Roundtable",
        "Description": "",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Executive Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Bulls, Bears & Golden Calves: Applying Christian Ethics in Economics",
        "Authors": "By Stapleford, John E.",
        "Description": "Self-interest, economic efficiency and private property rights are among the most basic assumptions of market economics. But can an economic theory built on these assumptions alone provide adequate insight into human nature, motivation and ultimate goals to guide our economic life?John Stapleford says no, along with those economists who recognize the limits of their discipline. He insightfully shows us in detail how ethics are inextricably intertwined with economic life and analysis. Writing from a Christian ethical perspective, he interacts with seven standard introductory economics texts, exploring the moral challenges embedded in various macro-, micro- and international economic theories and outlining a faithful response to them.The third edition includes two new chapters on economics as a science and global poverty plus expanded discussions of entitlements, government debt, healthcare reform and immigration reform. Keyed to seven of the most widely used introductory economics texts—Gwartney, Stroup & Sobel; Mankiw; Mansfield & Behravesh; McConnell & Brue; Miller; Samuelson & Nordhaus; and Stiglitz—this book will be especially useful for introductory courses in economics.",
        "Category": " Business & Economics , Economics , Theory",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Prisoner of Tehran: One Woman's Story of Survival Inside an Iranian Prison",
        "Authors": "By Nemat, Marina",
        "Description": "In her heartbreaking, triumphant, and elegantly written memoir, Prisoner of Tehran, Marina Nemat tells the heart-pounding story of her life as a young girl in Iran during the early days of Ayatollah Khomeini's brutal Islamic Revolution.What would you give up to protect your loved ones? Your life?   In her heartbreaking, triumphant, and elegantly written memoir, Prisoner of Tehran, Marina Nemat tells the heart-pounding story of her life as a young girl in Iran during the early days of Ayatollah Khomeini's brutal Islamic Revolution.   In January 1982, Marina Nemat, then just sixteen years old, was arrested, tortured, and sentenced to death for political crimes. Until then, her life in Tehran had centered around school, summer parties at the lake, and her crush on Andre, the young man she had met at church. But when math and history were subordinated to the study of the Koran and political propaganda, Marina protested. Her teacher replied, \"If you don't like it, leave.\" She did, and, to her surprise, other students followed.   Soon she was arrested with hundreds of other youths who had dared to speak out, and they were taken to the notorious Evin prison in Tehran. Two guards interrogated her. One beat her into unconsciousness; the other, Ali, fell in love with her.   Sentenced to death for refusing to give up the names of her friends, she was minutes from being executed when Ali, using his family connections to Ayatollah Khomeini, plucked her from the firing squad and had her sentence reduced to life in prison. But he exacted a shocking price for saving her life -- with a dizzying combination of terror and tenderness, he asked her to marry him and abandon her Christian faith for Islam. If she didn't, he would see to it that her family was harmed. She spent the next two years as a prisoner of the state, and of the man who held her life, and her family's lives, in his hands.   Lyrical, passionate, and suffused throughout with grace and sensitivity, Marina Nemat's memoir is like no other. Her search for emotional redemption envelops her jailers, her husband and his family, and the country of her birth -- each of whom she grants the greatest gift of all: forgiveness.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "To Turn from Idols",
        "Authors": "By Hamilton, Kenneth",
        "Description": "",
        "Category": "",
        "Publisher": "Wm.B. Eerdmans Pub. Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "God's Name In Vain: The Wrongs And Rights Of Relgion In Politics",
        "Authors": "By Carter, Stephen L.",
        "Description": "America faces a crisis of legitimacy. It's a crisis that dramatizes the separation of church and state. A crisis that, in the messages sent by our culture, marginalizes religion as a relatively unimportant human activity that plays an unimportant role in the national debate. Because the nation chooses to secularize the principal points of contact between government and people (schools, taxes, marriage, etc.), it has persuaded many religious people that a culture war has been declared. Stephen Carter, in this sequel to his best-selling Culture of Disbelief, argues that American politics is unimaginable without America's religious voice. Using contemporary and historical examples, from abolitionist sermons to presidential candidates' confessions, he illustrates ways in which religion and politics do and do not mesh well and ways in which spiritual perspectives might make vital contributions to our national debates. Yet, while Carter is eager to defend the political involvement of the religious from its critics, he also warns us of the importance of setting some sensible limits so that religious institutions do not allow themselves to be seduced, by the lure of temporal power, into a kind of passionate, dysfunctional, and even immoral love affair. Lastly, he offers strong examples of principled and prophetic religious activism for those who choose their God before their country.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Dillinger: A Novel",
        "Authors": "By Patterson, Harry",
        "Description": "After breaking out of prison in Indiana, John Dillinger heads for Mexico where he becomes involved with a ruthless gold mine owner and his beautiful niece",
        "Category": "",
        "Publisher": "Stein & Day Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Is It Good for the Jews?: The Crisis of America's Israel Lobby",
        "Authors": "By Schwartz, Stephen",
        "Description": "In 2005, two then-officials of the American Israel Public Affairs Committee were indicted for handing over classified information to a foreign power. That the power in question was assumed to be Israel brought fresh credibility to a conspiracy theory that had been floating around Washington for years: that a powerful “Jewish lobby” controls U.S. policy in the Middle East.    The run-up to the Iraq war had provided new grist for this theory. A group of largely Jewish neoconservatives were among the architects of the war, and their motivations for removing Saddam Hussein were alternately ascribed to oil interests and the need to protect Israel. The allegations against these neoconservatives—especially former Deputy Secretary of Defense Paul Wolfowitz—echoed the case of the notorious Jonathan Pollard who pled guilty of spying for Israel in 1986.  In this biting and incisive polemic, journalist and author Stephen Schwartz confronts the myth of a Jewish lobby head on, asking questions that no one else has dared to pose. What is the “Jewish lobby”? How powerful is it? What was its involvement in the preparations for war in Iraq? Was there really a “cabal” of neoconservative Jews in the administration of George W. Bush? How did AIPAC officials come to be accused, in 2004, of espionage? Above all, what is good for the Jews, and who decides it?  Many of us forget that in the 1930s, a genuine home-grown fascist movement arose in America. At that time, Schwartz reminds us, it was not the official representatives of the Jewish community that stood up to the fascist goons of New York City, but Jewish socialists—the antecedents of today’s neoconservatives. Likewise, today, it has not been the meek and timid leaders of the supposedly all-powerful Jewish Lobby that have defended the Jews but the reviled “neocons” in the Bush Administration. Their strategic vision projects a foreign policy that is both good for America and good for the Jews. As a result, Schwartz predicts an increasing turn for Jewish voters away from their dysfunctional marriage with the Democratic Party and toward the Republicans. Ultimately Schwartz concludes that in today's America, a “Jewish lobby” may no longer be necessary. In the face of the threatened collapse of the Lobby, he argues, American Jews should openly and proudly assume their proper role as moral and religious exemplars for their fellow Americans and cease acting like a frightened minority.",
        "Category": " Religion , Judaism , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Great Detectives: A Century of the Best Mysteries from England and America",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Book of the Month Club",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Mummies, Tombs, And Treasure: Secrets of Ancient Egypt",
        "Authors": "By Perl, Lila and Weihs, Erika",
        "Description": "A fascinating and thorough account of the Egyptian process of mummification and efforts to safeguard places of burial against thieves.",
        "Category": " Juvenile Nonfiction , History , Ancient",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Charlie Brown's Second Super Book of Questions and Answers: About the Earth and Space ... from Plants to Planets! : Based on the Charles M. Schulz C",
        "Authors": "By Schulz, Charles M.",
        "Description": "Charlie Brown, Lucy, Linus, and the rest of the Peanuts gang help teach readers interesting scientific facts about plants, geology, climate, astronomy, and space travel",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "Blood Types, Body Types And You (Revised & Expanded)",
        "Authors": "By Christiano, Joseph",
        "Description": "Why do some diets produce life-changing results for some people but not for others? World-renowned health and fitness coach Dr. Joe Christiano updates his tested and proven weight-loss program based on the simple concept that your blood type-O, A, B, or AB-determines your body's ability to absorb nutrients, fight off disease, and lose weight. Revised to include protocols for detoxification and address healthy colon function, this updated edition explains how a well-balanced eating plan based on blood type is pivotal for losing weight and keeping it off for life.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Siloam",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "No Retreat, No Surrender: One American's Fight",
        "Authors": "By Mansfield, Stephen and DeLay, Tom",
        "Description": "The candid memoir of one of the most effective, controversial figures in modern politics Very few people are on the fence about Tom DeLay, who was nicknamed “the Hammer” for his hard-charging, take-no-prisoners style of leadership. Liberals despise him, but for conservatives he’s a hero—one of the architects of the 1994 Republican revolution. For twelve years afterward, he was the driving force of the Republican majority in the House of Representatives. In this eagerly awaited memoir, DeLay will share fascinating stories from his entire career, starting with his early, raucous days in Texas; his personal conversion to Christ and how that changed his personal and political life; his work with other rebels to sow the seeds of the shocking 1994 takeover; and his ascension to the top leadership in the House. He offers a behind-the-scenes view of the most talked-about stories of the past decade, involving George W. Bush, Bill Clinton, Newt Gingrich, and many others. DeLay will also discuss his victories against the odds with the slimmest of margins; his passionate dedication to abused and neglected children; and his battle to fend off a ten-year barrage of malicious and frivolous allegations of wrongdoing, which ultimately led to his decision to resign from Congress. Perhaps most importantly, DeLay will unveil a blueprint agenda for the country’s next group of elected leaders, and show conservatives how to make it a reality.",
        "Category": " Political Science , American Government , Legislative Branch",
        "Publisher": "Sentinel HC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Crisis in the Village: Restoring Hope in African American Communities",
        "Authors": "By Franklin, Robert M.",
        "Description": "",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "90 Day Immune System Revised: This vital life-saving information will help you: · Protect your body from diseases and early aging · Maximize your ... and surveys · Boost your vitality a",
        "Authors": "By Maccaro, Janet C.",
        "Description": "GIVE YOURSELF 90 DAYS TO... Build and strengthen your immune system. Bring your body's system into proper balance Experience disease-free living. No matter what your health has been in the past, there is something you can do right now to give your entire body a complete makeover!Dr. Janet explains how you can improve the quality of your life with:    Valuable, interesting and easy self-test that help your monitor how well your body is functioning     Vital news about which food heal and which vitamins and supplements build and restore your health     Amazing facts- how your immune system is your miraculous internal pharmacy     Charts that help you see your progress at 30, 60 and 90 days     Delicious, health-enhancing recipies Imagine what your life could be like with a complete immune system makeover! You best days of health are ahead of you. What are you waiting for?",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Siloam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Uncommon Grace: Reminiscences and Photographs of Jacqueline Bouvier Kennedy Onassis",
        "Authors": "By Suares, Jean-Claude and Beck, J. Spencer",
        "Description": "Designed and edited by J.C. Suares, who worked with Jackie on various Doubleday projects, this collection of mostly familiar photographs chronicles her life from childhood and school years through marriages, motherhood, and later years.  The text that accompanies the 100 b&w photos is largely perfunctory but there are some worthwhile quotes from friends.  More revealing is an introduction by stepsister Nina Auchincloss, who offers an intimate look at a more fun-loving Jackie than the remote, ethereal presence who emerges in many of the photos. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Lickle Pub Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Month-By-Month Gardening in the Mid-Atlantic",
        "Authors": "By Heriteau, Jacqueline, Viette, Andre, and Viette, Mark",
        "Description": "The Month-By-Month series is the perfect companion to take the guesswork out of gardening. With this book, you'll know what to do each month to have gardening success all year. Written by authors in your state, the information is tailored to the issues that affect your garden the most. When is the best time to plant trees and shrubs? Should I fertilize my lawn now? Is it time to prune my roses? What should I be doing in my garden this month? You'll find the answers to these questions and much more inside. This easy-to-use book highlights each of the ten major plant categories using a monthly format. It guides you through each month of the year, telling you exactly what your garden needs. It is like having an expert in the garden with you all year long. Valuable hints are located throughout the book, and beautiful photographs will inspire you. Written just for gardeners where you live, you can be confident that the information is right for you-and your garden will show it.",
        "Category": " Gardening , Regional , Middle Atlantic (DC, DE, MD, NJ, NY, PA)",
        "Publisher": "Cool Springs Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Teaching Piano : A Comprehensive Guide and Reference Book for the Instructor (2 Vol's).",
        "Authors": "By Agay, Denes",
        "Description": "",
        "Category": "",
        "Publisher": "Music Sales Amer",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Author 101 Bestselling Book Proposals: The Insider's Guide to Selling Your Work",
        "Authors": "By Frishman, Rick, Spizman, Robyn Freedman, and Steisel, Mark",
        "Description": "Would-be authors are taken through all stages of developing a book proposal in this insider's guide to researching and writing an effective proposal, which comes complete with definitions, exercises, reviews, and other helpful advice. Original. 50,000 first printing.",
        "Category": " Language Arts & Disciplines , Publishing",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Robots: The Movie Storybook",
        "Authors": "By Egan, Kate",
        "Description": "You can shine no matter what you're made of. Rodney Copperbottom arrives in Robot City to find corruption and chaos everywhere. Will he be able to find his hero, Bigweld, and turn the city around, or will the evil Ratchet prove to be too much for a young robot from the country? Join Rodney and his friends, the Rusties, on their quest to save the city and in their fight to save themselves. Relive the excitement of the big-screen adventure with this photo-packed storybook!",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The Story of the Three Little Pigs and Other tales (Great Fairy Tale Classics)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Tormont Publ. Inc., Canada. No Date, Circa 1990's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Simply Romantic Dates on a Dime",
        "Authors": "By Bradford, Amy L., Breitenstein, Janel, and Clark, Margie",
        "Description": "",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Familylife",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "One Month to Live: Thirty Days to a No-Regrets Life",
        "Authors": "By Shook, Kerry and Shook, Chris",
        "Description": "Take the 30-Days to Live Challenge!  What if you only had  one month to live? How would you make each day meaningful? How would you relate to  others differently? What would you do to make the rest of your life really matter?  With eye-opening insights and soul-inspiring truths, One Month to Live will challenge  you to embrace the life God has entrusted to you and you alone, and to live it out  moment by moment with wholehearted authenticity, honesty, and integrity.  Each chapter  overflows with inspiring quotations, colorful true stories, and questions for reflection.  The four sections, which can be read over four weeks, help you examine the core areas  inside you that long to be exercised and expressed: how you’re made to live passionately,  love boldly, learn from your mistakes, and leave a legacy that endures for generations  after you’re gone. Complete with uplifting action points, each of the thirty chapters– one per day in a life-changing month–offers you fresh strategies for overcoming habits  that mire you in mediocrity.   Open yourself to the challenge of embracing your mortality  and being empowered to live each day engaged in being fully alive.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Waterbrook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "How Do We Dream?: And Other Questions About Your Body",
        "Authors": "By Myers, Jack (EDT) and Colrus, Bill (ILT)",
        "Description": "How do fish breathe? Can bulls really see red? Did unicorns really exist? Why do wolves howl at the moon? Can you get to China by digging a hole?Here in paperback are four outstanding books that will whet the appetite of any child who is curious about the world and how it works. Dr. Myers answers questions in a warm, informative manner that helps young readers understand the complexity of science. Boys and girls discover that science needn't be dull and dry--it can be fun and exciting. What makes these books even more special is that they feature questions and answers that have been collected from a quarter century of Highlights for Children. These are real questions from real kids.",
        "Category": " Juvenile Nonfiction , Science & Nature , Anatomy & Physiology",
        "Publisher": "Boyds Mills Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Lessons from a Father to His Son",
        "Authors": "By Thomas, Gary and Ashcroft, John",
        "Description": "Senator John Ashcroft writes about the values and spiritual principles he learned from his father who was a country preacher.Lessons from a Father to His Son is filled with stories about Senator Ashcroft's father who was a simple man, but profoundly spiritual. These stories will entertain and inspire, while imparting life lessons.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Trial of the Century, You be the Juror: See the OJ Simpson Trial Through the Eyes of a Juror--Interactive Trial Guide",
        "Authors": "By Smith, F. Lagard and Walton, Robert J.",
        "Description": "",
        "Category": " Law , General",
        "Publisher": "Marcon 3",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Closing the Gap",
        "Authors": "By Duncan, Todd",
        "Description": "Gaps happen…they happen to us spiritually, financially, physically, vocationally, and in our relationships. The distance between where we are and where we want to be can feel like miles. In Closing the Gap, motivational speaker Todd Duncan equips readers with perspective to see the distance in inches, not miles and suggests tools to close the gaps in life.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Quilter's Complete Guide",
        "Authors": "By Porter, Liz and Fons, Marianne",
        "Description": "Provides information and detailed instructions for beginning and advanced quilters on the techniques of quilting and on the details of making a variety of popular patchwork and quilting patterns",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "America Looks Up",
        "Authors": "By Lucado, Max",
        "Description": "When tragedy strikes, people desperately search for answers.  On September 11, 2001, our Nation began that desperate search.  There wasn't a city, a family, or a single person that survived unaffected by the horrific events of that infamous day. Best-selling author and  pastor Max Lucado points to the only real answer: Prayer. Derived from Max's prayer for the Nation in response to the attacks, America Looks Up explores how we should pray in these uncertain and confusing days.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Fantastic Cutaway Book of Flight (Fantastic Cutaway Series)",
        "Authors": "By Pang, Alex (ILT) and Richards, Jon",
        "Description": "Cross-section illustrations reveal the complex technology of 747s, helicopters, supersonic jets, and other vehicles of flight, in a book with an attached wallchart",
        "Category": " Juvenile Nonfiction , Technology , Aeronautics, Astronautics & Space Science",
        "Publisher": "Copper Beech",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "A Little Book of English Teas (Little Cookbook)",
        "Authors": "By Mashiter, Rosa",
        "Description": "Afternoon tea is an English ritual, a social as well as culinary affair. A Little Book of English Teas presents an exquisite array of afternoon tea fare, from dainty sandwiches and \"biscuits\" to heartier muffins and cakes. Traditional English recipes are given for such delights as Egg and Watercress Sandwiches, Lancashire Cheese Scones, Florentines, Maids of Honor, Crumpets, and many other favorites. Each recipe is accompanied by a delightful full-color illustration.",
        "Category": " Cooking , Beverages , Coffee & Tea",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "A Chance at Childhood Again: Restoring Freedom and Wonder to Everyday Life",
        "Authors": "By Wright, Alan D.",
        "Description": "To all of us too-serious, on-the-edge, busy-and-preoccupied adults, Alan Wright offers a reminder of Jesus' words regarding the heart of the child: \"...for of such is the kingdom of God.\" Many of us miss the freedom of childhood, but in ,A Chance At Childhood Again Wright reveals how we can recapture the unbridled freedom and joy of life we once knew. Mid-lifers (and all the rest of us who takes ourselves too seriously) will relate to Wright's words. Readers will look back with nostalgia, and much appreciation, at the simple joys of their growing-up years, and rediscover how their days can be characterized by a spirit of adventure and wide-eyed joy in the Lord.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The New Harvard Dictionary of Music (Harvard University Press Reference Library)",
        "Authors": "By Randel, Don Michael (EDT)",
        "Description": "Nearly six thousand entries and articles define musical terms, describe instruments, and discuss musical forms, concepts, and theory",
        "Category": " Music , Reference",
        "Publisher": "Belknap Press",
        "Price Starting With ($)": "8.57",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Harold's Fairy Tale (Further Adventures of with the Purple Crayon)",
        "Authors": "By Johnson, Crockett",
        "Description": "From the treasured creator of Harold and the Purple Crayon, Crockett Johnson, comes another adventure for Harold and his magical purple crayon.Unable to fall asleep one night, Harold uses his purple crayon to create his very own bedtime fairy tale, complete with castles, fairies, flying carpets, and an enchanted garden. “An ingenious and original little picture story in which a small boy out for a walk—happily with a crayon in his hand—draws himself some wonderful adventures.” (The Horn Book)",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "God Under My Roof: Celtic Songs and Blessings",
        "Authors": "By De Waal, Esther",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Paraclete Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Earth Book for Kids: Activities to Help Heal the Environment",
        "Authors": "By Schwartz, Linda",
        "Description": "Creative ideas with easy-to-follow instructions show kids how to make their own paper, compare phosphate levels in detergents, test the effects of oil pollution, conduct a recycling survey, create a trash sculpture, redesign a package, chart a flush, measure acidity and make a difference in many other exciting ways.Creative ideas with simple instructions show readers how to make a difference in saving the environment",
        "Category": " Juvenile Nonfiction , Science & Nature , Environmental Conservation & Protection",
        "Publisher": "Learning Works",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "When can I travel Upside Down? science",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "The Southwestern Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Gross Gifts",
        "Authors": "By Alvin, Julius",
        "Description": "Provides suggestions for a variety of unusual gifts, such as monster movie posters, pig snout glasses, plastic tarantulas, studded wrist bands, and joke books",
        "Category": " Humor , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Painted Ladies Revisited: San Francisco's Resplendent Victorians Inside and Out",
        "Authors": "By Keister, Douglas, Pomada, Elizabeth, and Larsen, Michael",
        "Description": "A photographic survey of the renovated and repainted Victorian houses restored to their place of pride by current owners and residents",
        "Category": " Architecture , General",
        "Publisher": "E.P. Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Water Gardening (Burpee American Gardening Series)",
        "Authors": "By Druse, Ken",
        "Description": "Gives a detailed description of plants suitable for growing in water, and presents advice on pumps and filters, fish, waterfalls, and selection of plants for color and design",
        "Category": " Gardening , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Outdoor Potted Bulb: New Approaches to Container Gardening With Flowering Bulbs",
        "Authors": "By Proctor, Rob",
        "Description": "This guide to outdoor container gardening with flowering bulbs features 125 photographs and watercolors that introduce gardeners of all experience levels to the concepts and methods of container gardening with flowering bulbs. Garden Bk Club Alt.",
        "Category": " Gardening , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The WPA Guide to New York City: The Federal Writers' Project Guide to 1930s New York",
        "Authors": "By Whyte, William H.",
        "Description": "",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Pantheon Books",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Bears in the Night",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "Illus. in full color. The Bears' adventures take them in, out, around, and about. \"A good job of combining words and pictures into a slapstick but cohesive story.\"--School Library Journal.",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1971"
        }
    },
    {
        "Title": "The Oxford Companion to American Literature (Oxford Companions)",
        "Authors": "By Hart, James David and Leininger, Phillip (EDT)",
        "Description": "For more than half a century, James D. Hart's The Oxford Companion to American Literature has been an unparalleled guide to America's literary culture, providing one of the finest resources to this country's rich history of great writers. Now this acclaimed work has been completely revised and updated to reflect current developments in the world of American letters.For the sixth edition, editors James D. Hart and Phillip Leininger have updated the Companion in light of what has happened in American literature since 1982. To this end, they have revised the entries on such established authors as Saul Bellow, Norman Mailer, and Joyce Carol Oates, and they have added more than 180 new entries on novelists (T. Coraghessan Boyle, Tim O'Brien, Louise Erdrich, Don De Lillo), poets (Rita Dove, Weldon Kees), playwrights (Wendy Wasserstein, August Wilson), popular writers (Stephen King, Louis L'Amour), historians (James M. McPherson, David Herbert Donald, William Manchester), naturalists (Aldo Leopold, Edward Abbey), and literary critics (Camille Paglia, Richard Ellmann). In addition, the Companion boasts more women's, African-American, and ethnic voices, with new entries on such luminaries as Charlotte Perkins Gilman, M.F.K. Fisher, William Least Heat-Moon, Ursula Le Guin, and Oscar Hijuelos, among many others.These additions represent only some of the revisions for the new edition. Of course, the basic qualities of the Companion that readers have grown to know and love over the years are as superb as ever. With over 5,000 total entries, The Oxford Companion to American Literature reflects a dynamic balance between past and contemporary literature, surveying virtually every aspect of our national literature, from the Pulitzer Prize to pulp fiction, and from Walt Whitman to William F. Buckley, Jr. There are over 2,000 biographical profiles of important American authors (with information regarding their styles, subjects, and major works) and influential foreign writers as well as other figures who have been important in the nation's social and cultural history. There are more than 1,100 full summaries of important American novels, stories, essays, poems (with verse form noted), plays, biographies and autobiographies, tracts, narratives, and histories. The new edition provides historical background and astute commentary on literary schools and movements, literary awards, magazines, newspapers, and a wide variety of other matters directly related to writing in America. Finally, the book is thoroughly cross-referenced and features an extensive and fully updated index of literary and social history.Ranging from Captain John Smith to John Updike, and from Anne Bradstreet to Anne Rice, the sixth edition of The Oxford Companion to American Literature is up to date, accurate, and comprehensive, a delight for both the casual browser and the serious student.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "7.32",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "A Three Dog Life: A Memoir",
        "Authors": "By Thomas, Abigail",
        "Description": "When Abigail Thomas’s husband, Rich, was hit by a car, his brain shattered. Subject to rages, terrors, and hallucinations, he must live the rest of his life in an institu­tion. He has no memory of what he did the hour, the day, the year before. This tragedy is the ground on which Abigail had to build a new life. How she built that life is a story of great courage and great change, of moving to a small country town, of a new family composed of three dogs, knitting, and friendship, of facing down guilt and discovering gratitude. It is also about her relationship with Rich, a man who lives in the eternal present, and the eerie poetry of his often uncanny perceptions. This wise, plainspoken, beautiful book enacts the truth Abigail discovered in the five years since the acci­dent: You might not find meaning in disaster, but you might, with effort, make something useful of it.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Harcourt, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Monochrome Days: A First-Hand Account of One Teenager's Experience With Depression (Adolescent Mental Health Initiative)",
        "Authors": "By Andrews, Linda Wasmer, Evans, Dwight L., and Irwin, Cait",
        "Description": "If you are one of the nearly twenty percent of adolescents who experience the symptoms of major depression before the end of high school, then you are probably already familiar with the sadness, isolation, and confusion that depression can bring. You may have questions about symptoms, medications, treatments, and how to deal with depression at school and at home. Monochrome Days: A Firsthand Account of One Teenager's Experience with Depression was written specifically for you.Cait Irwin was diagnosed with major depression at the age of fourteen, and she nearly lost her battle with the illness before she was able to receive the treatment she so desperately needed. In Monochrom Days, Irwin, now an adult and a successful artist, shares her experiences as a young woman who suffered from a crippling depression but was able to recover with the help of a supportive family and expert psychiatric care. In telling her remarkable story, Irwin and science writer Linda Andrews explain what is currently known about major depression in adolescents, demystifying the often confusing science behind the illness. In easy-to-understand language, the book also -Provides an accessible yet in-depth look at the causes, treatment, and management of depression -Discusses such difficult topics as psychiatric hospitalization and antidepressant medications -Offers tips on how to deal with depression both at school and at home, and how to talk about it to teachers, family, and friends Thoughtful, inspiring, and full of practical wisdom, Monochrome Days is both a compelling memoir and a useful resource that will help to ease the pain of major depression.  Cait Irwin's story is one that offers hope and guidance that you yourself can use to overcome the challenges of this illness, and go on to lead a healthy, productive life.",
        "Category": " Medical , Pediatrics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Children of the Self-Absorbed: A Grown-Up's Guide to Getting over Narcissistic Parents",
        "Authors": "By Brown, Nina W.",
        "Description": "Being a parent is usually all about giving of yourself to foster your child's growth and development. But what happens when this isn't the case? Some parents dismiss the needs of their children, asserting their own instead, demanding attention and reassurance from even very young children. This may especially be the case when a parent has narcissistic tendencies or narcissistic personality disorder. From the author of Working with the Self-Absorbed and Loving the Self-Absorbed, this major revision of a self-help classic offers a step-by-step approach to resolving conflict and building a meaningful relationship with a narcissistic parent. Children of the Self-Absorbed offers clear definitions of narcissism and narcissistic personality disorder to help you identify the extent of your parent's problem. You'll learn the different types of destructive narcissism and how to recognize their effects on relationships. With the aid of proven techniques, you'll discover that you're not helpless against your parent's behavior and that you needn't consider giving up on the relationship. Instead, realistic strategies and steps are suggested for learning to set mutually agreed upon behaviors that can help you fulfill your needs and expectations.",
        "Category": " Self-help , General",
        "Publisher": "New Harbinger Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Work Hard. Be Nice.",
        "Authors": "By Mathews, Jay",
        "Description": "When Mike Feinberg and Dave Levin signed up for Teach for America right after college and found themselves utter failures in the classroom, they vowed to remake themselves into superior educators. They did that—and more. In their early twenties, by sheer force of talent and determination never to take no for an answer, they created a wildly successful fifth-grade experience that would grow into the Knowledge Is Power Program (KIPP), which today includes sixty-six schools in nineteen states and the District of Columbia. KIPP schools incorporate what Feinberg and Levin learned from America's best, most charismatic teachers: lessons need to be lively; school days need to be longer (the KIPP day is nine and a half hours); the completion of homework has to be sacrosanct (KIPP teachers are available by telephone day and night). Chants, songs, and slogans such as \"Work hard, be nice\" energize the program. Illuminating the ups and downs of the KIPP founders and their students, Mathews gives us something quite rare: a hopeful book about education.",
        "Category": " Education , General",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The People of Sparks (The City of Ember Book 2)",
        "Authors": "By Duprau, Jeanne",
        "Description": "A modern-day classic. This highly acclaimed adventure series about two friends desperate to save their doomed city has captivated kids and teachers alike for almost fifteen years and has sold over 3.5  MILLION copies!   Lina and Doon have led the citizens of Ember to an exciting new world. When they discover a village called Sparks, they are welcomed, fed, and given places to sleep. But the town’s resources are limited and it isn’t long before resentment begins to grow between the two groups. When mysterious acts of vandalism cause tempers to erupt, putting everyone’s lives in danger, it’s up to our two heroes to find the courage to stop the conflict and bring peace.   Praise for the City of Ember books:   Nominated to 28 State Award Lists! An American Library Association Notable Children’s Book A New York Public Library 100 Titles for Reading and Sharing Selection A Kirkus Reviews Editors’ Choice A Child Magazine Best Children’s Book A Mark Twain Award Winner A William Allen White Children’s Book Award Winner   “A realistic post-apocalyptic world. DuPrau’s book leaves Doon and Lina on the verge of undiscovered country and readers wanting more.” —USA Today   “An electric debut.” —Publishers Weekly, Starred   “While Ember is colorless and dark, the book itself is rich with description.” —VOYA, Starred",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Yearling Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Arranging: The Basics of Contemporary Floral Design",
        "Authors": "By Cook, Hal",
        "Description": "Starting with basic theories on color and design and the simple skills involved in arranging, this illustrated how-to manual explains the techniques involved in creating a wide variety of floral arrangements",
        "Category": " Gardening , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Sister Pelagia and the White Bulldog",
        "Authors": "By Bromfield, Andrew (TRN) and Akunin, Boris",
        "Description": "“Pelagia’s family likeness to Father Brown and Miss Marple is marked, and reading about her supplies a similarly decorous pleasure.”–The Literary ReviewIn a remote Russian province in the late nineteenth century, Bishop Mitrofanii must deal with a family crisis. After learning that one of his great aunt’s beloved and rare white bulldogs has been poisoned, the Orthodox bishop knows there is only one detective clever enough to investigate the murder: Sister Pelagia.The bespectacled, freckled Pelagia is lively, curious, extraordinarily clumsy, and persistent. At the estate in question, she finds a whole host of suspects, any one of whom might have benefited if the old lady (who changes her will at whim) had expired of grief at the pooch’s demise. There’s Pyotr, the matron’s grandson, a nihilist with a grudge who has fallen for the maid; Stepan, the penniless caretaker, who has sacrificed his youth to the care of the estate; Miss Wrigley, a mysterious Englishwoman who has recently been named sole heiress to the fortune; Poggio, an opportunistic and freeloading “artistic” photographer; and, most intriguingly, Naina, the old lady’s granddaughter, a girl so beautiful she could drive any man to do almost anything.As Pelagia bumbles and intuits her way to the heart of a mystery among people with faith only in greed and desire, she must bear in mind the words of Saint Paul: “Beware of dogs–and beware of evil-doers.”“Critics on both sides of the Atlantic have praised [Akunin’s] clever plots, vivid characters and wit.”–Baltimore Sun“Akunin’s wonderful novels are always intricately webbed and plotted.”–The Providence Journal",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The American Home Front: 1941-1942",
        "Authors": "By Cooke, Alistair",
        "Description": "In nearly three thousand BBC broadcasts over fifty-eight years, Alistair Cooke reported on America, illuminating our country for a global audience. He was one of the most widely read and widely heard chroniclers of America?the Twentieth Century’s de Tocqueville. Cooke died in 2004, but shortly before he passed away a long-forgotten manuscript resurfaced in a closet in his New York apartment. It was a travelogue of America during the early days of World War II that had sat there for sixty years. Published to stellar reviews in 2006, though ?somewhat past deadline,” Cooke’s The American Home Front is a ?valentine to his adopted country by someone who loved it as well as anyone and knew it better than most” (The Plain Dealer [Cleveland]). It is a unique artifact and a historical gem, ?an unexpected and welcome discover in a time capsule.” (Washington Post) A portrait frozen in time, the book offers a charming look at the war through small towns, big cities, and the American landscape as they once were. The American Home Front is also a brilliant piece of reportage, a historical gem that ?affirms Cooke’s enduring place as a great twentieth-century reporter” (American Heritage).",
        "Category": " History , Military , World War II",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Tower of Babble: How the United Nations Has Fueled Global Chaos",
        "Authors": "By Gold, Dore",
        "Description": "A United Nations insider exposes how anti-American and antidemocratic forces have hijacked the UN and put America and its allies at risk Politicians and pundits are imploring the United States to give the UN a major role in American foreign policy. But as bestselling author Dore Gold reveals in Tower of Babble, it is absurd to look to the UN to fight aggression, combat terrorism, and preserve global order. The UN is an abject failure—a fatally flawed organization that has actually accelerated and spread global chaos. And it is dominated by anti-Western forces, dictatorships, state sponsors of terrorism, and America’s worst enemies.In his New York Times bestseller Hatred’s Kingdom, Gold blew the lid off Saudi support for terrorism, and now he uncovers an even more important story. As a former UN ambassador, he has a unique insider’s perspective on why the UN fails to address—or in many cases exacerbates—the very problems it was created to solve. He shows how President Franklin Roosevelt’s great vision has been corrupted beyond recognition. Using internal UN documents and classified cables, Gold presents stark evidence of how the UN ignores mass murder, emboldens terrorists, props up dictators, and otherwise betrays its mission to protect the world’s security. Tower of Babble reveals:• Why America can—and indeed must—go outside the UN to address the most serious threats to national security• How the UN jeopardizes the success of the war on terror—and how terrorist groups have actually penetrated UN organizations• How, in the space of a year, the UN turned a blind eye to two horrifying episodes of mass murder—and why the slaughters could have been prevented• How the oil-for-food scandal only hints at the UN’s repeated failures to deal with Saddam Hussein’s Iraq• How the UN’s new international criminal court threatens America’s sovereignty• How the UN’s startling record of failure has led Presidents Truman, Kennedy, Johnson, Clinton, and George W. Bush to bypass the UN Security CouncilAs this hard-hitting book reveals, it is, quite simply, a myth that the United Nations is a positive force for world order or the “sole source of international legitimacy.” And unless the United States and its allies recognize this now, they will continue to put themselves at risk.\"Dore Gold's book is informed and informative.  It can be read with pleasure and profit by anyone with a genuine interest in the United Nations.  I warmly recommend it.\"--Jeane J. Kirkpatrick, former Ambassador to the United Nations\"For anyone wondering what's wrong with the United Nations, this is the book to read.  Providing both a concise history and an urgent warning for our own time, Dore Gold in clear and lively detail explains how and why the UN too often promotes not peace, but problems--and what we can do about it.\"--Claudia Rosett, columnist, the Wall Street Journal's Opinionjournal.com\"Dore Gold's Tower of Babble is bound to be one of the most controversial critiques in the public debate on the UN.\"--Henry Kissinger, Former Secretary of State",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Crown Forum",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Green Babies, Sage Moms: The Ultimate Guide to Raising Your Organic Baby",
        "Authors": "By Fassa, Lynda",
        "Description": "From the trailblazing founder of Green Babies organic clothing comes the very first guide for new mothers in raising a \"green\" family-and doing it simply and inexpensively. Filled with necessary and convenient advice that takes the reader from the first months of pregnancy and beyond, this indispensable book explains:  - The safest ways to get the house ready for the baby - The best baby gear-from clothes to crib mattresses - Organic recipes for health-conscious breastfeeding moms - How to throw a green baby shower - The best solutions for storing breast milk safely - How to keep play areas safe from chemicals - How to handle the diaper dilemma: wash vs. toss - And much more!",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Deck & Patio Upgrades/05919 (Ortho library)",
        "Authors": "By Shakery, Karin and Moore, Richard (ILT)",
        "Description": "Provides detailed plans for building decks, patios, gazebos, benches, tables, chairs, and planters, and offers suggestions for decorating",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Cat Confidential: The Book Your Cat Would Want You to Read",
        "Authors": "By Halls, Vicky",
        "Description": "A behavioral guide for feline aficionados offers insight into cat psychology, counseling owners on how to address such challenges as aggressive behavior, over-grooming, and destructiveness.  Original.  20,000 first printing.",
        "Category": " Pets , Cats , General",
        "Publisher": "Gotham",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Guide to Residential Carpentry",
        "Authors": "By Feirer",
        "Description": "",
        "Category": "",
        "Publisher": "MacMillan Publishing Company",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Measuring America: How an Untamed Wilderness Shaped the United States and Fulfilled the Promise of Democracy",
        "Authors": "By Linklater, Andro",
        "Description": "Measuring America is the fascinating, provocative, and eye-opening story of why America has ended up with its unique system of weights and measures—the American Customary System, unlike any other in the world—and how this has profoundly shaped our country and culture. In the process, Measuring America reveals the colossal power contained inside the acres and miles, ounces and pounds, that we use every day without ever realizing their significance.The most urgent problem facing the newly independent United States was how to pay for the war that won the country its freedom; America's debt was enormous. Its greatest asset was the land west of the Ohio River, but for this huge territory to be sold, it had first to be surveyed—that is, measured out and mapped. And before that could be done, a uniform set of measurements had to be chosen for the new republic. English, Scottish, German, Dutch, Scandinavian, and other settlers had all brought their own systems with them (more than 100,000 different units are reckoned to have been in daily use), and in his first address to Congress, George Washington put the establishment of a single system of weights and measures immediately after a national defense and a currency as the United States' most urgent priority.The debate on this vital measure took place at a critical moment in the history of ideas, when the traditional, subjective view of the world was being increasingly challenged by objective, scientific reasoning. Thomas Jefferson—supported by Washington, Adams, Madison, Monroe, even Hamilton—championed the new idea of a scientific 10-based system derived from some universal constant such as time or the size of the earth. Such an alliance should have ensured a decimal America, but ranged against them was the invisible genius of Edmund Gunter, the seventeenth-century English mathematician whose twenty-two-yard surveying chain, introduced in 1607, had revolutionized land ownership in Britain and was still used by every surveyor in America—including Thomas Hutchins and his successors in charge of the land survey on the Ohio frontier.How we ultimately gained the American Customary System—the last traditional system in the world—and how Gunter's chain indelibly imprinted its dimensions on the land, on cities, and on our culture from coast to coast is both an exciting human and intellectual drama and one of the great untold stories in American history. At a time when the metric system may finally be unstoppable, Andro Linklater has captured the essential nature of measurement just as the Founding Fathers understood it. Sagely argued and beautifully written, Measuring America offers readers nothing less than the opportunity to see America's history—and our democracy—in a brilliant new light.",
        "Category": " History , United States , 19th Century",
        "Publisher": "Walker Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Furry Logic Parenthood",
        "Authors": "By Seabrook, Jane",
        "Description": "From the author-illustrator of the best-selling FURRY LOGIC comes a book of smile-provoking, truth-telling adages just for parents. Accompanied by touching water-color paintings of the most expressive animals you've ever seen, FURRY LOGIC PARENTHOOD will speak to the hearts, souls, and funny bones of anyone who's experienced the joys of being a mom or dad. Seabrook's paintings uncannily capture the highs and lows, loves and fears that all parents feel. Her koalas, giraffes, bald eagles, rabbits, and owls are rendered in delicate and biologically accurate detail using a tiny sable brush with a single hair at its tip. Cleverly complementing the paintings are sayings such as “Your children are growing up when they stop asking where they came from . . . and refuse to tell you where they're going” and “A perfect example of minority rule is a baby in the house.” Parents will find their inmost thoughts perfectly expressed within the pages of FURRY LOGIC PARENTHOOD.A humorous collection of quotes and drawings that capture the emotional essence of being a parent.An ideal gift for Mother's Day, Father's Day, baby showers, or just to perk up any parent's day.FURRY LOGIC has sold more than 130,000 copies.A six-copy counter display is available free with every order of six or more copies of FURRY LOGIC PARENTHOOD.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "King's Captain: An Alan Lewrie Naval Adventure",
        "Authors": "By Lambdin, Dewey",
        "Description": "Following the footsteps of Horatio Hornblower and Jack Aubrey, whose ripping adventures capture thousands of new readers each year, comes the heir apparent to the mantle of Forester and O'Brian: Dewey Lambdin, and his acclaimed Alan Lewrie series. In this latest adventure Lewrie is promoted for his quick action in the Battle of Cape St. Vincent, but before he's even had a chance to settle into his new role, a mutiny rages through the fleet, and the sudden reappearance of an old enemy has Lewrie fighting not just for his command, but for his life.\"A rip-roaring sea yarn brimming with riveting action and lusty diversions.\" - Booklist",
        "Category": " Fiction , Historical",
        "Publisher": "Griffin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Not in Our Classrooms: Why Intelligent Design Is Wrong for Our Schools",
        "Authors": "By Scott, Eugenie, Branch, Glenn, and Nye, Bill (FRW)",
        "Description": "The book . . . is an excellent resource to deal with the attack on evolution, which is a surrogate, and indeed a wedge, for a wide-ranging crusade against the scientific integrity of the public education system in America.\"--Rev. Barry W. Lynn from the ForewordMore than eighty years after the Scopes trial, creationism is alive and well. Through local school boards, sympathetic politicians, and well-funded organizations, a strong movement has developed to encourage the teaching of the latest incarnation of creationism—intelligent design—as a scientifically credible theory alongside evolution in science classes. Although intelligent design suffered a serious defeat in the recent Kitzmiller v. Dover trial, its proponents are bound to continue their assault on evolution education. Now, in Not in Our Classrooms, parents and teachers, as well as other concerned citizens, have a much-needed tool to use in the argument against teaching intelligent design as science.Where did the concept of intelligent design originate? How does it connect with, and conflict with, various religious beliefs? Should we teach the controversy itself in our science classrooms? In clear and lively essays, a team of experts answers these questions and many more, describing the history of the intelligent design movement and the lack of scientific support for its claims. Most importantly, the contributors—authorities on the scientific, legal, educational, and theological problems of intelligent design-speak specifically to teachers and parents about the need to defend the integrity of science education by keeping intelligent design out of science curriculums. A concluding chapter offers concrete advice for those seeking to defend the teaching of evolution in their own communities.Not in Our Classrooms is essential reading for anyone concerned about defending the teaching of evolution, uncompromised by religiously motivated pseudoscience, in the classrooms of our public schools.",
        "Category": " Religion , Religion & Science",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Playing President: My Close Ecounters with Nixon, Carter, Bush I, Reagan, and Clinton and How They Did Not Prepare Me for George W. Bush",
        "Authors": "By VIDAL, GORE",
        "Description": "Robert Scheer's interviews with and profiles of US presidents have shaped journalism history. Scheer developed close journalistic relationships with Presidents Nixon, Carter, Reagan, Clinton, and Bush I. His reporting on them had a tangible impact on national debate, such as the eminent 1976 Playboy interview in which Jimmy Carter, the then-presidential candidate, admitted to have lusted in his heart; and the 1980 interview with the L.A. Times, during which Bush I confessed to Scheer his dream of a \"winnable nuclear war.”In Playing President, Robert Scheer offers an unparalleled insight into the presidential mind. He analyses each administration since Nixon, and including George W. Bush, offering insights that will surprise the reader—particularly those with rigid preconceptions about the decision-making processes of our leaders. The volume will also include reprints of Scheer’s famous presidential interviews, along with previously unpublished interview transcripts and select previous writings.Robert Scheer is the author of six books, including Thinking Tuna Fish, Talking Death: Essays on the Pornography of Power; With Enough Shovels: Reagan, Bush and Nuclear War; and America After Nixon: The Age of Multinationals. Along with Christopher Scheer and Lakshmi Chaudhry, he is the coauthor of The Five Biggest Lies Bush Told Us About Iraq (Seven Stories/Akashic). Scheer is currently a clinical professor of communications at the Annenberg School at the University of Southern California. He is a nationally syndicated columnist based at the Los Angeles Times, a contributing editor at the Nation, and a host of NPR-affiliate KCRW's Left, Right, and Center.",
        "Category": " Political Science , American Government , Executive Branch",
        "Publisher": "Akashic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Heart Dance (Celta's HeartMates, Book 6)",
        "Authors": "By Owens, Robin D.",
        "Description": "Sixth in the bestselling futuristic romance series-from a RITA Award-winning author. First time in trade!  DuFleur Thyme is a scientist who's secretly experimenting with time. She'll allow no distractions from her work-not even from a HeartMate. Meanwhile, Saille T'Willow has sent his HeartGift out into the world in hopes of finding his HeartMate, who, it turns out, is DuFleur. Still, DuFleur wants nothing to do with Saille, especially when she discovers that it was his grandmother who brought about her father's ruin. Unfortunately, her body can't help but submit to the passion he stirs in her. But when a scandal threatens Saille's position as head of the family, will DuFleur stand by his side?",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Lillian Too's Basic Feng Shui: North American Edition",
        "Authors": "By Too, Lillian",
        "Description": "",
        "Category": " Philosophy , Eastern",
        "Publisher": "Oriental Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The DIABETIC Bible (Your All-in One Guide to Living Well with Diabetes)",
        "Authors": "By Armstrong, Dana and King, Allen Bennett",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Lee Considered: General Robert E. Lee and Civil War History (Civil War America)",
        "Authors": "By Nolan, Alan T",
        "Description": "Of all the heroes produced by the Civil War, Robert E. Lee is the most revered and perhaps the most misunderstood. Lee is widely portrayed as an ardent antisecessionist who left the United States Army only because he would not draw his sword against his native Virginia, a Southern aristocrat who opposed slavery, and a brilliant military leader whose exploits sustained the Confederate cause. Alan Nolan explodes these and other assumptions about Lee and the war through a rigorous reexamination of familiar and long-available historical sources, including Lee's personal and official correspondence and the large body of writings about Lee. Looking at this evidence in a critical way, Nolan concludes that there is little truth to the dogmas traditionally set forth about Lee and the war.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "The University of North Carolina Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "The Closet Book",
        "Authors": "By Schoen, Elin",
        "Description": "Provides suggestions for closets, shelves, cabinets, and other means of home storage that are both attractive and make the maximum use of limited space",
        "Category": "",
        "Publisher": "Harmony Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Lectionary for Mass Study Edition A cycle Sundays",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Pueblo Publishing Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Angel Fire",
        "Authors": "By Parkhouse, Steve and Parkhouse, Steve (ILT)",
        "Description": "John Dury is a corporate predator who hunts and kills businesses for money, power, and bonuses paid in designer drugs. The latest drug to hit the city is Angel Fire. A powerful sedative and hallucinogen that seems to open the door to the next world. Instead of finding the keys to heaven, John opens the door to hell - spiraling into a nightmare dimension of ghosts and demons and the faceless shadow that waits in the deepest blackest reaches of his own soul. Part Faustian fable, part Gothic horror storyAngel Fire is a powerful tale of corruption and redemption.",
        "Category": " Comics & Graphic Novels , Horror",
        "Publisher": "NBM Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Men of the Sea",
        "Authors": "By Willa Morley",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman Publishing",
        "Price Starting With ($)": "17.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Low Cholesterol Cook Book",
        "Authors": "By Sunset Books",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Cholesterol",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Kid's Money Book",
        "Authors": "By Godfrey, Neale S. and Novak, Justin (ILT)",
        "Description": "Traces the history of money, introduces banks, credit, and the stock market, and tells how to start a business",
        "Category": " Juvenile Nonfiction , Social Science , General",
        "Publisher": "Checkerboard Pr",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "United States v. George W. Bush et al.",
        "Authors": "By De La Vega, Elizabeth",
        "Description": "A New York Times BestsellerWhat if there were a fraud worse than Enron and no one did anything about it?In United States v. George W. Bush et. al., former federal prosecutor Elizabeth de la Vega brings her twenty years of experience and her passion for justice to the most important case of her career. The defendants are George W Bush, Richard Cheney, Donald Rumsfeld, Condoleezza Rice, and Colin Powell. The crime is tricking the nation into war, or, in legal terms, conspiracy to defraud the United States.Ms. de la Vega has reviewed the evidence, researched the law, drafted an indictment, and in this lively, accessible book, presented it to a grand jury. If the indictment and grand jury are both hypothetical, the facts are tragically real: Over half of all Americans believe the president misled the country into a war that has left 2,500 hundred American soldiers and countless Iraqis dead. The cost is $350 billion -- and counting.The legal question is: Did the president and his team use the same techniques as those used by Enron’s Ken Lay, Jeffrey Skilling, and fraudsters everywhere -- false pretenses, half-truths, deliberate omissions -- in order to deceive Congress and the American public?Take advantage of this rare opportunity to \"sit\" with the grand jurors as de la Vega presents a case of prewar fraud that should persuade any fair-minded person who loves this country as much as she so obviously does. Faced with an ongoing crime of such magnitude, she argues, we can not simply shrug our shoulders and walk away.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "What Do We Know About the Plains Indians?",
        "Authors": "By Taylor, Colin F.",
        "Description": "Surveys the major Native American nations of the Midwest, describing their languages, religions, and clothing, and exploring what daily life was like for a Plains Indian before and after the settlement of the West",
        "Category": " Juvenile Nonfiction , History , General",
        "Publisher": "Peter Bedrick Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Better Homes and Gardens Meals for One or Two",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Art of War (Tribal Art)",
        "Authors": "By Feest, Christian",
        "Description": "Examines tribal warfare in North America, Australia, Africa, and the Pacific, the weapons and strategies used, and the traditions of war and peace",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Caves (Let's-Read-And-Find-Out Science Book)",
        "Authors": "By Roma Gans",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Y. Crowell & Co.",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Beyond Shock and Awe: Warfare in the 21st Century",
        "Authors": "By Haney, Eric L. (EDT), Thomsen, Brian M. (EDT), and Mcthomsen, Brian M. (EDT)",
        "Description": "From one of the twelve founding members of Delta Force, a collection of commentary on the future of war.  Media commentator Eric Haney-a founding member of Delta Force and author of Inside Delta Force-along with other noted military analysts and award-nominated editor Brian M. Thomsen, examines how our military must evolve to face changing times, technology, and adversaries. From limited wars to possible large scale invasions of Syria or Iran-or a major military stand-down with North Korea-Beyond Shock and Awe is a fresh, provocative look at America's army of the future.  Articles include the work by Harlan K. Ullman and James P. Wade, Jr., which first used the term \"shock and awe;\" Kevin Dockery on the weapons of future wars; Professor William Forstchen on how precisionguided weaponry will eliminate \"problem\" individuals before they can start a war; Eugene Sullivan on such legal issues as pre-emptive attacks and military tribunals; Paul A. Thomsen on integrating military intelligence into strategic warfare; William Terdoslavich on how America's swift victory in the Iraq War gave way to a bloody stalemate; John Helfers on the importance of cultural knowledge in winning wars and building alliances; and Eric Haney on the many ways in which rapid dominance of an adversary can be gained through shock and awe.",
        "Category": " History , Military , Strategy",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Good Poems for Hard Times",
        "Authors": "By Keillor, Garrison (EDT)",
        "Description": "Chosen by Garison Keillor for his readings on public radio's The Writer's Almanac, the 185 poems in this follow-up to his acclaimed anthology Good Poems are perfect for our troubled times. Here, readers will find solace in works that are bracing and courageous, organized into such resonant headings as \"Such As It Is More or Less\" and \"Let It Spill.\" From William Shakespeare and Walt Whitman to R. S. Gwynn and Jennifer Michael Hecht, the voices gathered in this collection will be more than welcome to those who've been struck by bad news, who are burdened by stress, or who simply appreciate the power of good poetry.",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "A Quaker Book of Wisdom: Life Lessons In Simplicity, Service, And Common Sense",
        "Authors": "By Smith, Robert Lawrence",
        "Description": "\"The most valuable aspect of religion,\" writes Robert Lawrence Smith, \"is that it provides us with a framework for living. I have always felt that the beauty and power of Quakerism is that it exhorts us to live more simply, more truthfully, more charitably.\"Taking his inspiration from the teaching of the first Quaker, George Fox, and from his own nine generations of Quaker forebears, Smith speaks to all of us who are seeking a way to make our lives simpler, more meaningful, and more useful. Beginning with the Quaker belief that \"There is that of God in every person,\" Smith explores the ways in which we can harness the inner light of God that dwells in each of us to guide the personal choices and challenges we face every day. How to live and speak truthfully. How to listen for, trust, and act on our conscience. How to make our work an expression of the best that is in us.Using vivid examples from his own life, Smith writes eloquently of Quaker Meeting, his decision to fight in World War II, and later to oppose the Vietnam War. From his work as an educator and headmaster to his role as a husband and father, Smith quietly convinces that the lofty ideals of Quakerism offer all of us practical tools for leading a more meaningful life. His book culminates with a moving letter to his grandchildren which imparts ten lessons for \"letting your life speak.\"",
        "Category": " Religion , Inspirational",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Last Empress",
        "Authors": "By Min, Anchee",
        "Description": "The last decades of the nineteenth century were a violent period in China’s history marked by humiliating foreign incursions and domestic rebellion, ultimately ending in the demise of the Ch’ing dynasty. The only constant during this tumultuous time was the power wielded by one person, the resilient, ever-resourceful Tzu Hsi, Lady Yehonala -- or Empress Orchid, as readers came to know her in Anchee Min’s critically acclaimed novel covering the first part of her life.The Last Empress is the story of Orchid’s dramatic transition from a strong-willed, instinctive young woman to a wise and politically savvy leader who ruled China for more than four decades. Moving from the intimacy of the concubine quarters into the spotlight of the world stage, Orchid must face not only the perilous condition of her empire but also a series of devastating personal losses, as first her son and then her adopted son succumb to early death. Yearning only to step aside, and yet growing constantly into her role, only sheallied with the progressives, but loyal to the conservative Manchu clan of her dynastycan hold the nation’s rival factions together.Anchee Min offers a powerful revisionist portrait based on extensive research of one of the most important figures in Chinese history. Viciously maligned by the western press of the time as the Dragon Lady,” a manipulative, blood-thirsty woman who held onto power at all costs, the woman Min gives us is a compelling, very human leader who assumed power reluctantly, and who sacrificed all she had to protect those she loved and an empire that was doomed to die.",
        "Category": " Fiction , Historical",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The Yarn Girls' Guide to Simple Knits",
        "Authors": "By Carles, Julie and Jacobs, Jordana",
        "Description": "In their bustling New York City yarn shop Julie Carles and Jordana Jacobs—a.k.a. the Yarn Girls—have helped thousands of new and lapsed knitters rediscover the pleasures of knitting. Forget frumpy worsted wools and tiny needles; here are the gorgeous, wearable styles you’ve been looking for, with patterns that knit up so fast even inexperienced knitters can start a project on Saturday and wear it to work Monday morning. Made on big needles (sizes 9 to 36) and with a wide range of the chunky, luxurious new yarns that are now available, they couldn’t be easier to create, or more fun to wear. The Yarn Girls have selected thirty of their most popular basic-but-beautiful projects in a range of must-have styles, from trendy funnel-necks and classic cardigans to sexy tanks. Each project includes pointers to ensure that the finished project will fit properly and look like a million bucks. There are also patterns for creating accessories such as hats and scarves, as well as something for the guys and cozy throws for the home. Each pattern is designed to reinforce the fundamentals of knitting and help tentative knitters gain confidence. Clearly illustrated sections on techniques, plus a glossary and the Yarn Girls’ helpful tips throughout, practically guarantee a successful outcome the very first time.",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "Potter Craft",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Yarn Girls' Guide to Beyond the Basics",
        "Authors": "By Carles, Julie and Jacobs, Jordana",
        "Description": "The yarn girls  are upping the ante on quick-to-knit, sassy looks in beyond the basics. With the same friendly encouragement and big-sister know-how found in their previous books, The Yarn Girls’ Guide to Simple Knits and The Yarn Girls’ Guide to Kid Knits, Julie Carles and Jordana Jacobs are taking new knitters to the next level of stitch wizardry. But new knitters aren’t the only ones having fun — intermediate and experienced knitters won’t be able to resist the ingenious patterns that deliver nearly instant gratification.Without abandoning their straightforward instructions and fast-working chunky yarns, the Yarn Girls present thirty-four of their freshest patterns to introduce clever techniques such as cabling, color work, and shaping to turn a simple sweater into a smart number. Try a little intarsia to make a plain sweater a work of color sophistication. Knit up a cabled tank top for stunning warm-weather wear. The projects in this book cover a range of apparel and accessories — hip tees, cozy sweaters, chic hats, delicate scarves, stunning ponchos, and even blankets — enough to take you through all sorts of styles and seasons, with the investment of a little time and a few clever stitches.The yarn girls return to the scene with an exciting line of thirty-four brand-new stylish patterns that will wow experienced knitters while taking beginners to the next level. Inside, you’ll find easy-to-understand techniques for:• knitted cables• intarsia• slipped stitches",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "Potter Craft",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "A Certain Justice (Abe Glitsky)",
        "Authors": "By Lescroart, John T.",
        "Description": "Set in San Francisco, A Certain Justice is about justice denied in a most violent fashion, and the ultimately heroic actions of a so-called common man, Kevin Shea, who becomes involved with the law to the extent that he is hunted, hounded and nearly destroyed for an act he never committed. With him is a young woman, Melanie Sinclair, who also seems at first flush to be almost superficial, ordinary and predictable, but who becomes something much deeper as she joins forces with Kevin Shea in an urban and contemporary version, on one level, of a Thelma and Louise/Bonnie and Clyde, except that this couple is absolutely innocent.Leading the hunt for the fugitive pair is Abe Glitsky, Dismas Hardy's close friend, now chief of homicide, whose job it is to bring them in dead or alive. Compounding his troubles - and threatening the innocence not only of the accused but of those who would bring them to justice - is the overpowering presence of a key U.S. senator who demands a quick resolution to the matter, and whose ambitions extend beyond the mere fight for truth and justice...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Middle-Age Rage & Other Male Indignities",
        "Authors": "By Schoenberg, Fred and Edwards, Rob (ILT)",
        "Description": "Offers a humorous look at middle age, mid-life crisis, and the changes brought about by aging, including baldness, memory loss, and hypochondria.",
        "Category": " Psychology , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Lefties: A Book for Southpaws",
        "Authors": "By Lannamann, Margaret and Stites, Joe (ILT)",
        "Description": "History, humor, and facts every left-hander will want to know.",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Starting Your Own Business, Third Edition (3rd Edition)",
        "Authors": "By Paulson, Ed",
        "Description": "Sick of working the daily grind at the office?  Can't stop dreaming about striking it out on your own?  This book is a one-stop resource for the burgeoning entrepreneur.",
        "Category": " Business & Economics , Entrepreneurship",
        "Publisher": "Alpha",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Why Men Don't Have a Clue and Women Always Need More Shoes: The Ultimate Guide to the Opposite Sex",
        "Authors": "By Pease, Barbara and Pease, Allan",
        "Description": "Do you know the top seven things men do that drive women nuts? Or the real reason women cry more than men do? What are men really looking for in a woman—both at first sight and for the long-term? These are only the starting points for Barbara and Allan Pease as they discuss the very real—and often very funny—differences between the sexes. Why Men Don’t Have a Clue and Women Always Need More Shoes takes a look at some of the issues that have confused men and women for centuries. Using new findings on the brain, studies of social changes, evolutionary biology, and psychology, the Peases teach you how to make the most of your relationships—or at least begin to understand where your partner is coming from. They help women understand why men avoid commitment, what drives them to lie, and how to decode male speech to find out what they are really saying. They explain to men why women nag, how they use emotional blackmail, and how to understand (and take advantage of!)  the top-secret scoring system all women apply.  They also dish about the top turn-ons--and turn-offs--for both sexes. Laced with their trademark humor, Why Men Don’t Have a Clue and Women Always Need More Shoes addresses a host of nitty-gritty battlegrounds as well, from channel surfing and toilet seats to shopping and communication. Already a #1 bestseller in the United Kingdom, Germany, Japan, Holland, Spain, Brazil, Portugal, Belgium, Ireland, France, Czech Republic, India, Singapore, Malaysia, South Africa, New Zealand, and Australia, Why Men Don’t Have a Clue and Women Always Need More Shoes is the answer to understanding the opposite sex.",
        "Category": " Social Science , Gender Studies",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Terror in the Name of God: Why Religious Militants Kill",
        "Authors": "By Stern, Jessica",
        "Description": "For four years, Jessica Stern interviewed extremist members of three religions around the world: Christians, Jews, and Muslims. Traveling extensively—to refugee camps in Lebanon, to religious schools in Pakistan, to prisons in Amman, Asqelon, and Pensacola—she discovered that the Islamic jihadi in the mountains of Pakistan and the Christian fundamentalist bomber in Oklahoma have much in common.Based on her vast research, Stern lucidly explains how terrorist organizations are formed by opportunistic leaders who—using religion as both motivation and justification—recruit the disenfranchised. She depicts how moral fervor is transformed into sophisticated organizations that strive for money, power, and attention.Jessica Stern's extensive interaction with the faces behind the terror provide unprecedented insight into acts of inexplicable horror, and enable her to suggest how terrorism can most effectively be countered.A crucial book on terrorism, Terror in the Name of God is a brilliant and thought-provoking work.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Ecco",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "One Bite With A Stranger (The Others, Book 1)",
        "Authors": "By Warren, Christine",
        "Description": "When Regina's friends insist on setting her up a \"Fantasy Fix\" to help her get over her cheating ex, she dreams up some kinky out-of-this-world encounters that they could never possibly bring to life. But the next thing Regina knows, her friends have got her laced into a shiny black corset, tight leather pants, and a sexy pair of stilettos. It's time for some downtown vampire-fantasy fun. . . .The Vampire Ball in Manhattan's East Village isn't really Dmitri Vidâme's idea of a good time, but as a member of the Council that governs the Others, he has to keep an eye on all the young vamps who prey on the pretenders. After he feasts his dark eyes on fiery Regina at the bar, he knows that he must have her. But for the first time Dmitri meets a woman who is more than a match for his indomitable will. And he may be the fantasy Regina hoped for… until she—and her feisty friends—discover her sexy new lover's bloodsucking secret…",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Highland Fire",
        "Authors": "By Howell, Hannah",
        "Description": "New York Times bestselling author Hannah Howell delivers her most enthralling novel yet with the story of an innocent beauty and an unjustly accused laird who discover a rapturous passion as they embark upon a wondrous journey across the rugged Scottish highlands.  .  .    Swept overboard and stranded on the rocky shores of Scotland, Moira Robertson is left with only the tattered clothes on her back--and the mysterious stranger who came to her aid on the ship.  Although their close surroundings unsettle her, she soon cannot resist his touch which awakens a burning ache deep within her. But can she trust her life--and her heart--to this darkly seductive man?      Tavig MacAlpin is a condemned man. Accused of a murder he did not commit, his escape is thwarted by a flame-haired beauty. He must continue his search for justice, but fate has bound him to this Scottish lass--and to a slow, sensual desire that will not be denied.  .  .      Praise for Hannah Howell and her Highland novels.  .  .    \"Few authors portray the Scottish highlands as lovingly or colorfully as   Hannah Howell.\"  --Publishers Weekly   \"Expert storyteller Howell pens another Highland winner.\"  --Romantic Times",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Conversational German: Revised & Updated (Living Language Series)",
        "Authors": "By Kleinmann, Walter",
        "Description": "",
        "Category": " Foreign Language Study , German",
        "Publisher": "Living Language",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Don't Know Much About History: Everything You Need to Know About American History but Never Learned (Don't Know Much About Series)",
        "Authors": "By Davis, Kenneth C.",
        "Description": "“Reading [Kenneth C. Davis] is like returning to the classroom of the best teacher you ever had.” —People Revised, updated, and expanded, the Twentieth Anniversary Edition of Kenneth C. Davis’s classic anti-textbook Don’t Know Much About History revitalizes the landmark book’s ability to revolutionize the way we look at our past. Like Howard Zinn’s A People’s History of the United States, Davis’s Don’t Know Much About History captivates readers with a wry and lucid, comprehensive and comprehensible narrative. With a new section covering the twenty-first century’s most significant events, from the Great Recession to Hurricane Katrina to the election of Barack Obama and more, the Twentieth Anniversary Edition of Don’t Know Much About History reinvigorates the book’s crucial promise of delivering fascinating, insight-driven learning to a new generation of readers.",
        "Category": " History , United States , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "How To Say It From The Heart : Communicating With Those Who Matter Most In Your Personal and Professional Life",
        "Authors": "By Griffin, Jack",
        "Description": "Those times when saying the right words really matters are often the times we find ourselves with no words at all! Now a guide exists that teaches the reader to properly place emphasis and focus on the emotional side of communication.  How to Say It from the Heart offers practical advice and time-saving model conversations, letters, and e-mails that’ll help you speak and write with conviction, sincerity, and compassion to the people who matter most. Whether you want to encourage a friend through hard times, ask someone out on a date, comfort a grieving co-worker, or just let someone know that you care, this entry in the How to Say It series provides all the words you need to express your feelings beautifully.  You’ll find a wealth of ready-to-use models and guidelines covering 30 difficult to express subjects, including:   ·         Making graceful apologies ·         Expressing sincere thanks and appreciation ·         Offering meaningful sympathy and condolences ·         Writing romantic love letters ·         Providing truly constructive criticism—and real encouragement ·         Motivating your employees to work harder ·         Speaking to your children about death, divorce, drugs, and sex Filled with illuminating examples and telling notes, How to Say it from the Heart will become the one source to turn to when you’re looking for just the right words.",
        "Category": " Business & Economics , Skills",
        "Publisher": "Prentice-Hall Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "A Mighty Heart: The Brave Life and Death of My Husband, Danny Pearl",
        "Authors": "By Pearl, Mariane and Crichton, Sarah",
        "Description": "For five weeks the world waited for news about Danny Pearl, the Wall StreetJournal reporter who was kidnapped in Karachi, Pakistan...And then came thebroadcast of his shocking murder. The complete account of his abduction, the intense effort to rescue him, and the aftermath are told here - in astonishingdetail, and with courage and insight - by his surviving wife Mariane.A Mighty Heart is the unforgettable story of two journalists who fell inlove with their work - and with each other. Together, Mariane and Danny Pearltraveled across the globe, dedicated to journalism that increases the under-standing of international politics and of ethnic and religious conflict. In theend, Danny was caught in the dangerous fissure where warring cultures, politics,and ideologies collide. A Mighty Heart is both a portrait of a partner-ship built on the ideals of love, truth, and justice and a critical look at themethods and structure of the Al Qaeda network.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Big Red Sled, The (level 1) (Hello Reader)",
        "Authors": "By Burris, Priscilla (ILT) and Gerver, Jane E.",
        "Description": "While his parents are asleep, Little Fred goes out to ride his sled and play with his other friends, yet when he gets lost on the way home, Little Fred luckily hears the sound of his father's snoring in the distance and so follows it back until he returns safely. Original.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Only In Your Dreams (Gossip Girl #9)",
        "Authors": "By Von Ziegesar, Cecily",
        "Description": "Welcome to New York City's Upper East Side, where the girls are dazzling, the guys are gorgeous, and the summer heat is the perfect excuse to throw a fabulous roof-deck pool party. As if we need a reason!It's our last summer together before heading off to college, and things are sizzling -- no, it's not just the weather. Despite that steamy kiss on graduation night, Blair, Serena, and Nate have gone their separate ways...though not for long. Blair is off to London with her English Lord boyfriend, Serena's about to become a movie star -- as if she wasn't a star already! -- and Nate's rolling up his well-worn khakis and heading to the Hamptons. Back in New York, Dan and Vanessa are rekindling their love. Fiery! Watch out, this summer is going to be hotter than ever.",
        "Category": " Young Adult Fiction , School & Education , Boarding School & Prep School",
        "Publisher": "Poppy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Story Of The Declaration Of Independence Cornerstones of Freedom Series",
        "Authors": "By Richards, Norman",
        "Description": "",
        "Category": "",
        "Publisher": "Children's Press, Weekly Reader",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Experience of Retirement",
        "Authors": "By Weiss, Robert S. and Ekerdt, David J. (FRW)",
        "Description": "Retirement brings with it the promises of leisure and freedom as well as the risks of boredom and isolation. When retirees rid their schedules of anything resembling the kinds of obligations that once had been imposed by work, they will experience a sometimes-uncomfortable absence of structure. In The Experience of Retirement, the distinguished sociologist Robert S. Weiss provides a detailed description of how some people plan their retirement, what life in retirement is like, and what makes for a fulfilling retirement. His engaging book can thus serve as a most useful guide. Weiss shows us both retirement's benefits and its possible costs, both the relief retirees can feel once free of work's stresses and constraints and the discomfort that can be caused by loss of the positive aspects of working life.The book is based on extensive interviews with eighty-nine men and women before and after their retirement from middle-income careers. Weiss makes vivid their experiences by presenting, in their own words, their descriptions of leaving their careers, considering what to do with their time, confronting issues of income in retirement, dealing, sometimes, with social isolation, and reorganizing their lives. The interviews reveal the way in which retirement affects marriages and other familial relationships. Weiss concludes by presenting advice about retirement based on the actual experiences of retirees. For anyone approaching the age of retirement or already retired and looking for a more satisfying post-career life, for personnel managers, health care professionals, and all those who provide services for the retired, The Experience of Retirement will be an illuminating guidebook to this phase of life.",
        "Category": " Social Science , Gerontology",
        "Publisher": "ILR Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Engleby: A Novel",
        "Authors": "By Faulks, Sebastian",
        "Description": "Bestselling British author Sebastian Faulks reinvents the unreliable narrator with his singular, haunting creation—Mike Engleby.\"My name is Mike Engleby, and I'm in my second year at an ancient university.\" With that brief introduction we meet one of the most mesmerizing, singular voices in a long tradition of disturbing narrators. Despite his obvious intelligence and compelling voice, it is clear that something about solitary, odd Mike is not quite right. When he becomes fixated on a classmate named Jennifer Arkland and she goes missing, we are left with the looming question: Is Mike Engleby involved? As he grows up, finding a job and even a girlfriend in London, Mike only becomes more and more detached from those around him in an almost anti-coming-of-age. His inability to relate to others and his undependable memory (able to recall countless lines of text yet sometimes incapable of summoning up his own experiences from mere days before) lead the reader down an unclear and often darkly humorous path where one is never completely comfortable or confident about what is true.Mike Engleby is a chilling and unforgettable character, and Engleby is a novel that will surprise and beguile Sebastian Faulks' readership.",
        "Category": " Fiction , Literary",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Great Dessert Book",
        "Authors": "By Teubner, Christian and Schonfeldt, Sybil Grafin",
        "Description": "Professional guidance in making and serving more than 230 desserts, gathered from Europe and America, is enhanced by hundreds of color photographs, many on cooking procedures alone",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    }
]