[
    {
        "Title": "United States",
        "Authors": "By Gousha",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall & IBD",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Twin Sombreros",
        "Authors": "By Zane Grey",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Gene Autry and the Thief river outlaws;: An original story featuring Gene Autry, famous motion picture star, as the hero, by Bob Hamilton. Illustrated by Dan Muller",
        "Authors": "By Hamilton, Bob",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman Pub. Co",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1944"
        }
    },
    {
        "Title": "The Gift of Nothing",
        "Authors": "By McDonnell, Patrick",
        "Description": "What can Mooch the cat give Earl the dog when Earl has everything? The answer, of course, is nothing. This simple picture book story features characters from McDonnell's popular comic strip, \"Mutts.\" Illustrations.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "10-Minute Feng Shui",
        "Authors": "By Alexander, Skye",
        "Description": "Feng shui, the ancient Chinese art of placement, can transform your love life, financial situation, health, and overall happiness. And itÃ?s easier than you think to reap the rewards of this amazing art! Just a few simple changes to your dÂ¬cor can result in big benefits. -Put a vase of yellow flowers in your kitchen to increase your wealth. -Place a live plant in your bedroom to improve your love life. -Tie nine small bells on a red cord and hang it from your front door to bring happiness into your home. -Hang a mobile in a sick room to clear congestions and respiration problems.In just ten minutes, you can revive stagnant energy and bring \"ch'i\" into you home. Feng shui has been used successfully for centuries, and these tips are the best of what feng shui has to offer. TheyÃ?re simple, theyÃ?re fun, and they work!",
        "Category": " Body, Mind & Spirit , Feng Shui",
        "Publisher": "Fair Winds Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "DK Readers L0: Meet the Dinosaurs",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "The bestselling DK Readers series has a fresh new look featuring redesigned jackets and interiors, and up-to-date vocabulary throughout. In DKReaders, stunning photographs combine with lively illustrations and engaging age-appropriate stories, creating a multilevel reading program guaranteed to capture children's interest while developing their reading skills and general knowledge.Written by leading children's authors and compiled in consultation with literacy experts, these captivating books build reader confidence along with a lifelong appreciation for nonfiction, classic stories, and biographies. There is a DKReader to interest every child at every level, from preschool to grade four.With DK Readers, children learn to read — then read to learn!",
        "Category": " Juvenile Nonfiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The End of the Nation State: The Rise of Regional Economies",
        "Authors": "By Ohmae, Kenichi",
        "Description": "Nation states, asserts the world-renowned business strategist Kenichi Ohmae, are dinosaurs waiting to die. In this profoundly important book Ohmae argues that not only have nation states lost their ability to control exchange rates and protect their currencies, but they no longer generate real economic activity. As a result, he maintains, they have already forfeited their role as critical participants in the global economy. Once efficient engines of wealth creation, nation states today have become inefficient engines of wealth distribution, whose fates are increasingly determined by economic choices made elsewhere.  Ohmae contends that four great forces -- capital, corporations, consumers, and communication -- have combined to usurp the economic power once held by the nation state. In the first full-scale analysis of this global phenomenon, Ohmae explains exactly how communications now control the movement of capital and corporations across national borders, how demanding consumers determine the flow of goods and services, and how harmful government policies are increasingly disciplined by the actions of informed consumers, profit-seeking corporations, and currency markets.  Old habits die hard and the habits of power die hardest of all. While governments cling to jingoistic celebrations of nationhood that place far more value on emotion-grabbing symbols than on the welfare of their citizens, Ohmae reveals that within their borders a revolution has been born. He documents how affluent economic zones forming natural \"business units\" have arisen throughout the world, bringing real, concrete improvements in the quality of life. These new engines of prosperity, which Ohmae calls region states, have emerged, for example, between San Diego and Tijuana, Singapore and parts of Malaysia and Indonesia, Silicon Valley and the Bay Area, and Hong Kong and the adjacent portion of the Chinese mainland. He describes how these region states, each inhabited by 5 to 20 million people, have closer links to other region states in the global economy than to their \"host\" nations, and constitute essential growing markets for the goods and services of global corporations.  Ohmae concludes that the emergence of the region state changes deeply and forever the global logic that defines how corporations operate and how the governments of nation states understand their proper role in economic affairs. Managers and policymakers must remember that people came first, and borders came afterwards. This masterful analysis will redefine the workings of the global economy for generations to come.",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Bronze Mystique / Secrets in Silence",
        "Authors": "By Delinsky, Barbara and Wilson, Gayle",
        "Description": "Filled with suspense, passion, and love, two complete novels in one volume includes Barbara Delinsky's Bronze Mystique, in which Sasha Blakes meets the man of her dreams in Doug Donohue when her motorcycle crashes into his sports car, but she finds him too good to be true and fears she is facing disappointment. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Bone By Bone",
        "Authors": "By O'Connell, Carol",
        "Description": "Twenty years after his teenaged younger brother mysteriously disappears into the woods of northern California, former Army investigator Oren returns home for the first time and is horrified when bones he believes belong to his brother are delivered to him.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Proceedings at the ceremonies in commemoration of the one hundred and fiftieth anniversary of the first meeting of the Supreme Court of the United States, February one, nineteen hundred and forty.",
        "Authors": "By United States. Supreme Court.",
        "Description": "",
        "Category": "",
        "Publisher": "U. S. Government Printing Office",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1940"
        }
    },
    {
        "Title": "The Microwave Master",
        "Authors": "By Fandre, Donovan Jon",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Kqed",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Southern Living - Chicken Cookbook",
        "Authors": "By Jean Wickstrom",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1976"
        }
    },
    {
        "Title": "Winter's Child (A Deborah Knott Mystery (12))",
        "Authors": "By Maron, Margaret",
        "Description": "It's one month after their wedding, and the future looks bright for Judge Deborah Knott and Sheriff Deputy Dwight Bryant--until a disturbing call from Dwight's 8-year-old son Cal calls him back to Virginia.When he arrives, he is shocked to find that his ex-wife has left the boy alone for almost 24 hours. Worse, as Dwight tries to confront her, she takes the child and leaves town without a word. As Dwight embarks on an all-points search, Deborah hurries to his side. But will they be able to work together to decipher the ex-wife's motives--and, more importantly, will they find young Cal before he comes to harm?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "20.85",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Pillsbury: Best Muffins and Quick Breads: Favorite Recipes from America's Most-Trusted Kitchens",
        "Authors": "By Pillsbury Company",
        "Description": "The latest addition to the best-selling cooking series presents 175 of Pillsbury's finest recipes for home-baked sweet and savory muffins and quick breads, including such treats as Blueberry Muffins, Tomato-Basil Dinner Bread, and Jalapen+a1o Corn Biscuits. 75,000 first printing.",
        "Category": " Cooking , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Last Frontier",
        "Authors": "By Fast, Howard",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Ross's Gap",
        "Authors": "By Wisler, G. Clifton",
        "Description": "Returning home from the Civil War to reclaim his family from his half Comanche brother, Carter Ross finds himself in the midst of a brutal war between the Comanches an white settlers and must choose between family loyalty or helping his neighbors. Original.",
        "Category": " Fiction , Westerns",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Across the Nightingale Floor, Episode 1: The Sword of the Warrior (Tales of the Otori)",
        "Authors": "By Hearn, Lian",
        "Description": "In a novel set in ancient Japan, the first volume in The Tales of the Otori trilogy, a young boy named Takeo becomes a pawn in the ceaseless wars between rival warlord clans in a culture ruled by codes of honor and formal rituals. Reissue.",
        "Category": " Young Adult Fiction , Historical , Asia",
        "Publisher": "Firebird",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Versatile Rice Cooker (Nitty Gritty Cookbooks)",
        "Authors": "By Simmons, Bob",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Rice & Grains",
        "Publisher": "Bristol Publishing Enterprises Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Ideas for Great Bathrooms",
        "Authors": "By Sunset Books (EDT)",
        "Description": "Shows and describes some contemporary bathrooms, and offers advice on selecting cabinets, countertops, sinks, tubs, showers, and lighting fixtures,",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Stanley and the Magic Lamp",
        "Authors": "By Bjorkman, Steve (ILT) and Brown, Jeff",
        "Description": "The Lambchop family has just about recovered from Stanley?s flatness when their peace and quiet is disrupted once again, this time by a very eager-to-please young genie.He does the boys? homework instantly, produces a hybrid housepet called a liophant, and introduces Stanley and his family to the joys (and pitfalls) of fame, all because they wished for it . . . didn?t they? Long out of print, this high-spirited sequel to Flat Stanley should delight newly independent readers. (Originally published as A Lamp for the Lambchops.)",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Trophy Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Small Texan",
        "Authors": "By J. T. Edson",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Alvin and the Chipmunks: The Squeakquel: Meet the 'Munks (I Can Read Level 2)",
        "Authors": "By Long, Susan Hill (ADP)",
        "Description": "The Chipmunks are confident that they can win their school's singing contest, but their chances are threatened by Alvin's devotion to football and by the Chipettes, a rival group of female chipmunk singers.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Saving CeeCee Honeycutt: A Novel",
        "Authors": "By Hoffman, Beth",
        "Description": "Read Beth Hoffman's blogs and other content on the Penguin Community.   Steel Magnolias meets The Help in this Southern debut novel sparkling with humor, heart, and   feminine wisdom Twelve-year-old CeeCee Honeycutt is in trouble. For years, she has been the   caretaker of her psychotic mother, Camille-the tiara-toting, lipstick-smeared laughingstock of an entire town-a   woman trapped in her long-ago moment of glory as the 1951 Vidalia Onion Queen. But when Camille is hit by a   truck and killed, CeeCee is left to fend for herself. To the rescue comes her previously unknown great-aunt, Tootie   Caldwell.In her vintage Packard convertible, Tootie whisks CeeCee away to Savannah's perfumed world   of prosperity and Southern eccentricity, a world that seems to be run entirely by women. From the exotic Miz Thelma   Rae Goodpepper, who bathes in her backyard bathtub and uses garden slugs as her secret weapons, to Tootie's all-  knowing housekeeper, Oletta Jones, to Violene Hobbs, who entertains a local police officer in her canary-yellow   peignoir, the women of Gaston Street keep CeeCee entertained and enthralled for an entire summer.   Laugh-out-loud funny and deeply touching, Beth Hoffman's sparkling debut is, as Kristin Hannah says, \"packed full   of Southern charm, strong women, wacky humor, and good old-fashioned heart.\" It is a novel that explores the   indomitable strengths of female friendship and gives us the story of a young girl who loses one mother and finds   many others.    Watch a Video",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Pamela Dorman Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Love, Lies, and Jessica Wakefield (Sweet Valley University(R))",
        "Authors": "By Pascal, Francine and John, Laurie",
        "Description": "As Elizabeth goes through a difficult adjustment period, her twin sister Jessica is swept away by her mysterious new boyfriend who wants her to move in with him. Original.",
        "Category": "",
        "Publisher": "Sweet Valley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Surprise in the Story Book",
        "Authors": "By Asheron, Sara",
        "Description": "",
        "Category": "",
        "Publisher": "Wonder Books",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Grave Secrets: A Novel (Temperance Brennan Novels)",
        "Authors": "By Reichs, Kathy",
        "Description": "It was a summer morning in 1982 when soldiers ravaged the village of Chupan Ya, raping and killing women and children. Twenty-three victims are said to lie in the well where, twenty years later, Dr. Temperance Brennan and a team from the Guatemalan Forensic Anthropology Foundation now dig. No records were kept. To their families, the dead are \"the disappeared.\"  Forensic anthropologist for the medical examiners in North Carolina and Montreal, Tempe is in Guatemala for a month's service to help some families identify and bury their dead. She digs in a cold, damp pit where she finds a hair clip, a fragment of cloth, a tiny sneaker. Her trowel touches something hard: the hip of a child no more than two years old. It's heartbreaking work. Something savage happened here twenty years ago. The violence continues today. The team is packing up for the day when an urgent satellite call comes in. Two colleagues are under attack. Shots ring out, and Tempe listens in horror to a woman's screams. Then there is silence. Dead silence.  With this new violence, everything changes, both for the team and for Tempe, who's asked by the Guatemalan police for her expertise on another case. Four privileged young women have vanished from Guatemala City in recent months. One is the Canadian ambassador's daughter. Some remains have turned up in a septic tank, and Tempe unfortunately knows septic tanks. Teaming with Special Crimes Investigator Bartolomé Galiano, and with Montreal detective Andrew Ryan, who may have more than just professional reasons to join her on the case, Tempe soon finds herself in a dangerous web that stretches far beyond Guatemala's borders. The stakes are huge. As power, money, greed, and science converge, Tempe must make life-altering choices.  From cutting-edge science in the lab, where Tempe studies fetal bones and cat hair DNA, to a chilling en-counter in a lonely morgue, Grave Secrets is powerful, page-turning entertainment from a crime fiction superstar who combines riveting authenticity with witty, elegant prose.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Devious Derivations: Popular Misconceptions -- And More Than 1,000 True Origins of Common Words and P hrases",
        "Authors": "By Rawson, Hugh",
        "Description": "In this new book, word maven Hugh Rawson brings you a marvelously entertaining roundup of 1,000 spurious etymologies, then enlightens you with their genuine counterparts.Some wiseacre (which, by the way, has nothing to do with land measure) may have told you that a tip is something you give a waiter \"to insure promptness,\" or that James I once knighted a remarkable side of beef, saying, \"Arise, Sir Loin,\" but like hundreds of oft-repeated accounts of word origins, they're just too good to be true. People, it seems, are etymologizing creatures, and if a certain lexical lineage is unclear, they are sure to invent one.If you hear that pumpernickel was named by Napoleon Bonaparte, who, upon being served the dark German bread, derided it as \"pain pour Nicol\" (bread for his horse, Nicol), you can take it with a grain of salt (which since 1647 has been making questionable tales, like questionable meat, more palatable).With his third book, Hugh Rawson pulls off the literary equivalent of a hat trick (which is original not to ice hockey, it turns out, but to cricket).",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Steaklover's Companion: 170 Savory Recipes from America's Greatest Chefs",
        "Authors": "By Harrisson, John, Simon, Frederick J., and Kiffin, Mark",
        "Description": "Steak is no longer just a grill-em-and-eat-em food. It has matured into a gourmet experience of exquisite delight, tempting eager palates with tender mouthfuls of juicy flavor. For today&#39;s discriminating carnivores, here at last is a cookbook that they can really sink their teeth into. Celebrating the many different ways beef can be prepared, The Steaklover&#39;s Companion gives meat eaters a taste of the unique flavors of the different regions of the country. From Boston, there&#39;s Tenderloin Tips braised in Samuel Adams Beer. Florida offers Grillades and Grits with Fried Green Tomatoes. The Western Range serves up a tempting Mesquite-Grilled Rib-Eye Cowboy Steak with Black Bean Rellenos and Pico de Gallo Salsa. Mouthwatering recipes by leading chefs like Wolfgang Puck, Paul Prudhomme, Mark Miller and Stephen Pyles round out the selections, guaranteeing that this cookbook caters to every taste.   Beautifully designed, featuring 170 delicious recipes and 50 luscious four-color photographs and packed with invaluable tips on choosing, preparing and storing beef, this is truly the ultimate steaklover&#39;s companion.",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Mable Hoffman's Crockery Cookery",
        "Authors": "By Hoffman, Mable",
        "Description": "A New York Times bestseller, this cookbook established Mable Hoffman as a premier cooking enthusiast--well-deserved praise for one who has spent decades extolling the benefits of slow cooking. Her easy and affordable recipes for appetizers, soups, and main dishes are designed to bring out that \"simmered-in\" flavor that only slow cooking can provide. In addition to the new recipes, this edition contains many others that have been revised to reduce fat and calories.",
        "Category": " Cooking , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Gold medal blender cookbook (A Fawcett gold medal book)",
        "Authors": "By Hamm, Marie Roberson",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Publications",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Limbo of the Lost: Revised and Expanded with 16 Pages of Illustrations",
        "Authors": "By Spencer, John Wallace",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Gun Country",
        "Authors": "By Cotton, Ralph W.",
        "Description": "\"No one outruns Fast Larry Shaw--especially when he runs with them. In the delirium of a mysterious head wound, Shaw stumbles upon Dexter Lowe's boys on their way across the border. They're about to meet with Corio's Black River Guerrillas and heist a U.S. armament in the badlands. What better way to nab thieving scoundrels than to have them as your very own tour guides to the scene of the crime? But in his weakened condition, Shaw will need backup. So U.S. Marshal Crayton Dawson and Deputy Jedson Caldwell are on their way to help him clean up the border--by taking out the trash.\"--P. [4] of cover.",
        "Category": " Fiction , Westerns",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "An Impossible Attraction (The DeWarenne Dynasty, 7)",
        "Authors": "By Joyce, Brenda",
        "Description": "With her mother's passing, Alexandra Bolton gave up on love to take care of her family. Now, with the Bolton name in disgrace due to her father's profligate ways, marrying an elderly squire might be the only way to save her family from absolute ruin. But when she meets the infamous Duke of Clarewood, old dreams—and old passions—are awakened as never before. Yet she cannot accept his shocking proposition!He is the wealthiest, most powerful peer in the realm, and having witnessed the cold horror of marriage as a child, he has vowed never to wed. But Alexandra Bolton inflames him as no woman has ever done, and she also serves him his first rejection! Now Clarewood—who always gets what he wants—will choose which rules to play by. But when passion finally brings them together, a terrible secret threatens to tear them apart….",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "HQN Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Flawless",
        "Authors": "By Spanogle, Joshua",
        "Description": "A former medical detective for the Centers for Disease Control, Dr. Nate McCormick had seen enough suffering to last a lifetime. Now he’s left the CDC, determined to begin a new life with his girlfriend in San Francisco…until the vicious murder of a biotech researcher—an old friend—hurtles him back into the medical world he’d left behind. While the police hunt for a killer, Nate starts sifting through evidence, determined to find what his friend did to provoke his brutal death. And the truth he ultimately discovers far exceeds the very worst he had imagined.As a circle of treachery tightens around Nate, and the woman he loves is thrust into the line of fire, patients surface with agonizing stories to tell. Nate is about to make the most startling discovery of all: a secret alliance between crime, science, and a billion-dollar industry determined to hide its victims at any price. For Nate, that price will be the one person most important to him—unless he can expose the flaw in a perfect conspiracy of medicine and murder.From shocking evidence revealed under a microscope to the shattering testimony of those betrayed by the ruthlessness of the medical industry, Flawless takes us on a terrifying, adrenaline-charged journey. Taut, thrilling, and relentless, it will leave you pondering its questions long after the last page is turned.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "For A Dream Cometh",
        "Authors": "By Barr, Lily",
        "Description": "",
        "Category": "",
        "Publisher": "Ashley Books, Inc",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Missing May",
        "Authors": "By Rylant, Cynthia",
        "Description": "",
        "Category": "",
        "Publisher": "Yearling Books",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Bonnes (Folio) (French Edition)",
        "Authors": "By Jean Genet",
        "Description": "",
        "Category": "",
        "Publisher": "Gallimard Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "Rebel",
        "Authors": "By John Clagett",
        "Description": "",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Wild Rose of Ruby Canyon",
        "Authors": "By Nesbitt, John D.",
        "Description": "When his new neighbor, Van O'Leary, approaches him with a money-making scam, homesteader Henry Sommers learns that freeing himself of O'Leary is much harder then it looks and extremely dangerous. Original.",
        "Category": " Fiction , Westerns",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Gateway House",
        "Authors": "By Overholser, Wayne D.",
        "Description": "When his brother, who is barely clinging to life, implores him to find the fifty thousand dollars that he had buried before he was sent to prison, Ed Morgan sets out on a dangerous journey to recover the money before it ends up in the wrong hands. Reprint.",
        "Category": " Fiction , Westerns",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Great Silver Bonanza",
        "Authors": "By Martin, Don",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1979"
        }
    },
    {
        "Title": "The Game of Chess (A Penguin handbook)",
        "Authors": "By Golombek, H.",
        "Description": "",
        "Category": " Games , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "The Rider of the Ruby Hills",
        "Authors": "By L'Amour, Louis",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Deep Magic",
        "Authors": "By Nash, Joy",
        "Description": "As the Romans and Druids engage in war, Gwendolyn, an ethereal Druid priestess, and Marcus, a Roman blacksmith with a gift for creating magical weapons, find forbidden love as the sword Excalibur is forged. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Tall Stranger, The",
        "Authors": "By Louis L'Amour",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Gold Medal",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Action At Truxton",
        "Authors": "By Arthur, Burt & Budd",
        "Description": "",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Brass Command",
        "Authors": "By Fisher, Clay",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "The Last Viking (Viking (Love Spell))",
        "Authors": "By Hill, Sandra",
        "Description": "",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Sherman Letter: A Novel of History and Mystery",
        "Authors": "By Palmer, Leonard",
        "Description": "",
        "Category": "",
        "Publisher": "Write Way Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Texas! Chase: A Novel (Texas! Tyler Family Saga)",
        "Authors": "By Brown, Sandra",
        "Description": "In the second book in #1 New York Times bestselling author Sandra Brown’s beloved Texas! trilogy, readers meet another son of the troubled Tyler clan—Chase Tyler, a man hardened by life and desperately trying to outrun the sorrows of his past.   Chase Tyler has been the object of Marcie Johns’s desire since grade school. But when it came time to settle down, the handsome, laconic cowboy chose another woman to be his bride. Life was good for Chase—until things took an abrupt and tragic turn. Ravaged by grief, Chase has become a lost and embittered soul, a man without purpose, compassion, or hope.Then fate intercedes, reuniting Chase and Marcie, who was an unwitting player in Chase’s unfathomable family tragedy. Guilt weighs heavily on Marcie, but she’s also convinced that only the strength of her love can pull Chase back from the abyss. She’s willing to risk everything on a daring plan to rescue his business, save his life, and bring them together at last.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Vikings",
        "Authors": "By James Graham-Campbell, Dafydd Kidd",
        "Description": "",
        "Category": "",
        "Publisher": "British Museum Publications Ltd",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Leopard",
        "Authors": "By LA Plante, Richard",
        "Description": "The sequel to the thriller Mantis finds Josef Tanaka returning to Japan to find his brother's brutal killer, leading him into the strange world of sumo wrestling, ritual tatooing, and the Yakuza and a confrontation with a human killing machine.",
        "Category": " Fiction , General",
        "Publisher": "Forge",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "The Reluctant Daddy (Hometown Reunion)",
        "Authors": "By Conrad, Helen",
        "Description": "Assigned to an arson case that could spell trouble for many Tyler citizens, a reluctant investigator becomes involved with the prime suspect's daughter and her two toddlers but fears disaster when he learns she is hiding evidence. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Care and Taming of a Rogue (The Adventurers' Club)",
        "Authors": "By Enoch, Suzanne",
        "Description": "New York Times bestselling author Suzanne Enoch kicks off a new Regency romance series, in which adventure and heart-stopping romance go hand in hand, inThe Care and Taming of a Rogue. Rugged adventurer Bennett Wolfe, once presumed dead, has returned to London. He only has eyes for the exceedingly proper Philippa . . . and so she must teach him some manners before temptation sweeps her away . . .",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Pallbearers (Shane Scully Novels)",
        "Authors": "By Cannell, Stephen J.",
        "Description": "From the perennial New York Times bestseller comes a powerful new novel in which Detective Shane Scully, who grew up as an orphan, must revisit his painful childhood to find out who murdered the kind and charismatic man who became a father to him Abandoned by his parents as an infant, Scully was reared in an orphanage, Huntington House. The only positive thing in his young life was the attention of the Home’s director, Walter “Pop” Dix. Pop, an avid surfer, would take a small group of kids for early morning surfing. He was the father none of them had ever had. That was thirty years ago. Now, Shane is forced to revisit these memories when Pop is found dead, the victim of an apparently self-inflicted shotgun blast. He leaves a message asking six specific people, all of whom attended Huntington House, to be his pallbearers, and Shane is one of the chosen. He and his fellow pallbearers don’t believe it was a suicide. That leaves murder. But why, and by whom? Together, the pallbearers embark on a dangerous odyssey in pursuit of justice for Pop, and for retribution against those responsible for his death. Their journey takes them up against an unforeseen adversary whose power and influence far exceed anything they could have imagined.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St Martin's Press",
        "Price Starting With ($)": "16.42",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Ballpark Vacations: Great Family Trips to Minor League and Classic Major League Ballparks Across Ame rica (1st ed)",
        "Authors": "By Engel, Margaret and Adams, Bruce",
        "Description": "Baseball Vacations24 Unforgettable Family Trips to 75 of America's Most Fan-Friendly Minor League and Classic MajorLeague Ballparks\"A baseball lover's bible!\" -- Mike RoykoWant to know which team has the funniest mascot? Which ballpark has the best contests for fans? Which stadiums serve loganberry juice, buck-a-bone BBQ, and buttermilk pie? And what you can do before and after the game? (How about white water rafting, rollercoastering, country music concerts, or riding the steepest passenger railway in the world?) The authors cover the Baseball Hall of Fame and travel from the Cape Cod Leagues to California's Rancho Cucamonga. The fresh, lively anecdotes and compelling baseball trivia that fill every chapter are sure to amuse -- even if the family favorite doesn't win.To help you create years of great ballpark vacations, the Adams family, parents, and children tell all:How to get foul balls, collect autographs, and kibitz with the guys in the bull penFamily-friendly diners, cafeterias, and restaurantsWhere the visiting team staysThe best giveaways and contestsWhere to sit, where to park, what to eatFabulous family-trip tips galorePlus $150 in coupons for free kids' admission to ballparks nationwide - Maps for every region - A directory of every minor- and major-league ballpark in the country",
        "Category": " Travel , Special Interest , Sports",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Popular Proverbs & Sayings",
        "Authors": "By Titelman, Gregory",
        "Description": "An entertaining and informative A to Z dictionary of more than 1,500 well-known proverbs and sayings includes more than ten thousand illustrative explanations of familiar sayings from everyday American usage.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Healing Grace: Let God Free You From the Performance Trap",
        "Authors": "By Seamands, David A, Seamands, David",
        "Description": "",
        "Category": "",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Chasing Lincoln's Killer",
        "Authors": "By Swanson, James L.",
        "Description": "Based on rare archival material, obscure trial manuscripts, and interviews with relatives of the conspirators and the manhunters, CHASING LINCOLN'S KILLER is a fast-paced thriller about the pursuit and capture of John Wilkes Booth: a wild twelve-day chase through the streets of Washington, D.C., across the swamps of Maryland, and into the forests of Virginia. \"This story is true.  All the characters are real and were alive during the great manhunt of April 1865.  Their words are authentic and come from original sources: letters, manuscripts, trial transcripts, newspapers, government reports, pamphlets, books and other documents.  What happened in Washington, D.C., that spring, and in the swamps and rivers, forests and fields of Maryland and Virginia during the next twelve days, is far too incredible to have been made up.\"  So begins this fast-paced thriller that tells the story of the pursuit and capture of John Wilkes Booth and gives a day-by-day account of the wild chase to find this killer and his accomplices. Based on James Swanson's bestselling adult book MANHUNT: THE 12-DAY CHASE FOR LINCOLN'S KILLER, this young people's version is an accessible look at the assassination of a president, and shows readers Abraham Lincoln the man, the father, the husband, the friend, and how his death impacted those closest to him.",
        "Category": " Young Adult Nonfiction , History , United States , General",
        "Publisher": "Scholastic Press",
        "Price Starting With ($)": "142.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Junie B. Jones Has a Peep in Her Pocket (Junie B. Jones, No. 15)",
        "Authors": "By Brunkus, Denise (ILT) and Park, Barbara",
        "Description": "Barbara Park’s New York Times bestselling chapter book series, Junie B. Jones, is a classroom favorite and has been keeping kids laughing—and reading—for more than twenty years. Over 60 million copies in print and now with a bright new look for a new generation!Barbara Park’s New York Times bestselling chapter book series, Junie B. Jones, is a classroom  favorite and has been keeping kids laughing—and reading—for more than  twenty years. Over 60 million copies in print and now with a bright new  look for a new generation!   Meet the World’s Funniest  Kindergartner—Junie B. Jones! It’s almost the end of the school year,  and Room Nine is taking a field trip to a farm! There’s lots of fun farm  stuff there. Like a real actual barn. And a real actual farmer. There’s  even real alive animals you can pet! Only, where’s the gift shop?  That’s what Junie B. Jones would like to know. Surely no one would want  Junie B. to go home empty-handed. . . .   USA Today: “Junie B. is the darling of the young-reader set.”   Publishers Weekly: “Park convinces beginning readers that Junie B.—and reading—are lots of fun.”    Kirkus Reviews: “Junie’s swarms of young fans will continue to delight in her unique  take on the world. . . . A hilarious, first-rate read-aloud.”    TIME: “Junie B. Jones is a feisty six-year-old with an endearing penchant for honesty.”",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "America 1941: A Nation at the Crossroads",
        "Authors": "By Gregory, Ross",
        "Description": "A nostalgic look at the major events of a pivotal year that influenced a generation, now rapidly passing from the earth.",
        "Category": " History , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "6.07",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "The Visible Past: An Archaeological Reinterpretation of the Ancient World",
        "Authors": "By Grant, Michael",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Scribner Paper Fiction",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Secrets of 123 Classic Science Tricks and Experiments",
        "Authors": "By Lanners, Edi",
        "Description": "Shows and explains tricks involving eggs, dice, coins, chains, string, balls, cards, photographs, optical illusions, mirrors, crystals, sound, and matches",
        "Category": " Mathematics , General",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Pop Culture Wars: Religion & the Role of Entertainment in American Life",
        "Authors": "By Romanowski, William D.",
        "Description": "Entertainment has long been a source of controversy in American life. On the one hand, American popular culture is enormously desired, captivating audiences around the world. On the other hand, more and more critics blame it for the breakdown of morals and even civilization itself.In this groundbreaking book, William Romanowski brings something desperately needed to the discussion: an informed, systematic and challenging Christian perspective. Comprehensive and historically revealing, Pop Culture Wars bids to accomplish nothing less than to reframe and render more constructive a crucial but angry cultural debate.",
        "Category": " Religion , Ethics",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The Two American Presidents: A Dual Biography of Abraham Lincoln and Jefferson Davis",
        "Authors": "By Chadwick, Bruce",
        "Description": "In mostly alternating chapters, historian and journalist Chadwick juxtaposes the two men's paths to leadership, work as legislators, and their abilities as commanders-in-chief. He finds one factor in the outcome of the war to be the difference between a flexible Lincoln who could build coalitions among warring political factions, and the uncompromising Davis who could not. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Citadel",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Fairways and Greens",
        "Authors": "By jenkins, dan",
        "Description": "\"Tell me about plumbing, fine. Tell me about carpentry, terrace gardening, the timer on VCRs. Go ahead and explain cellophane. Tell me about all of these things, but don't try to tell me about golf, okay? Golf I know.\"--Dan JenkinsAfter four decades of covering golf-not to mention \"playing scratch from the blues and gambling for my own money when I didn't have any\", Dan Jenkins most definitely knows golf. He may, in fact, know the game better than anyone on the planet. Now, his latest and long awaited collection brings together his best writing on the game, from serious pieces on timeless classics like the 1954 Masters and the 1960 Open to humorous takes on everything from the best things in golf-the best bar is Club XIX in the Pebble Beach Lodge-to his unrequited love of golf carts. With a cast that includes everyone from Hogan, Palmer, and Nicklaus to all of the lurkers and spoilers on the PGA Tour, the book is a timeless addition to great golf literature.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Beyond Progress: An Interpretive Odyssey to the Future",
        "Authors": "By De Santis, Hugh",
        "Description": "In this dynamic portrait of the human community as it enters the twenty-first century, Hugh De Santis argues that in a world of dwindling resources, economic inequality, and unremitting violence, the belief in endless progress can no longer be sustained.Explaining that we have arrived at a great historic divide, De Santis asserts that the old modern order is giving way to an age of \"mutualism.\" He draws on world history and the study of international relations to explore the emerging future, in which new forms of social and political identity and regional associations and alignments will be needed to solve global problems. Demonstrating that mutualism will require a dramatic change in the way states, international institutions, corporations, and local communities interact, De Santis argues that this transformation will be especially difficult for the United States, which will have to abandon its exceptionalist identity and rejoin a world it can no longer escape.",
        "Category": " History , World",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "9.63",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "First Steps in Winemaking",
        "Authors": "By Berry, C. J. J.",
        "Description": "With more than two million copies sold, this comprehensive guide is the ideal introduction to the fascinating craft of winemaking.",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "G. W. Kent, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Patents and How to Get One: A Practical Handbook",
        "Authors": "By U. S. Department of Commerce",
        "Description": "What is a patent? What do “patent pending” and “patent applied for” mean? How do you go about applying for a patent? This indispensable handbook, originally published by the U.S. Government’s Patent and Trademark Office (PTO) not only answers these and many other questions frequently asked of the agency, but provides readers with general information about patents and how the PTO operates.Designed specifically for non-attorneys and written in clear, easy-to-understand language, the guide takes readers through the registration process step by step, beginning with general information about the functions of the Patent and Trademark Office. Accessible discussions follow about patent law, what can be patented, conditions for obtaining a patent, the process of registering patents, and who may apply. Also covered are filing and maintenance fees; models, exhibits, and specimens; correction of patents, the nature of patent rights, patent infringement, design and plant patents, treaties and foreign patents, and much more.Of immense use to inventors and prospective applicants, this brief general introduction to the subject will also be of value to students and other interested people.",
        "Category": " Law , Reference",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Evergence 2: The Dying Light",
        "Authors": "By Williams, Sean and Dix, Shane",
        "Description": "Renegade intelligence officer Morgan Roche risks her career and her life when she sets out to find Adoni Cane, the last of a group of genetically enchanced warriors, whose very existence threatens the future of humankind. Original.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Complete Encyclopedia of Natural Healing",
        "Authors": "By Null, Gary",
        "Description": "",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Kensington",
        "Price Starting With ($)": "6.74",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Politics In States And Communities",
        "Authors": "By Penberthy, Brittany L. and MacManus, Susan A.",
        "Description": "Uses a conflict management theme to illustrate state and community politicsPolitics in States and Communities is distinguished by its focus on politics, its comparative approach, its concern with thorough explanation, its interest in policy, and its focus on conflicts in states and communities. Several themes are carried on throughout the book that emphasize the importance of politics at the state and community level including the “conflict management” theme which emphasizes the sources and nature of conflict in society, how key decision makers act in conflict situations, and how “politicos” emerge and determine “who gets what.” MySearchLab is a part of the Dye/MacManus program. Research and writing tools, including access to academic journals, help students understand critical thinking in even greater depth. To provide students with flexibility, students can download the eText to a tablet using the free Pearson eText app.  ALERT: Before you purchase, check with your instructor or review your course syllabus to ensure that you select the correct ISBN. Several versions of Pearson's MyLab & Mastering products exist for each title, including customized versions for individual schools, and registrations are not transferable. In addition, you may need a CourseID, provided by your instructor, to register for and use Pearson's MyLab & Mastering products. Packages Access codes for Pearson's MyLab & Mastering products may not be included when purchasing or renting from companies other than Pearson; check with the seller before completing your purchase. Used or rental books If you rent or purchase a used book with an access code, the access code may have been redeemed previously and you may have to purchase a new access code. Access codes Access codes that are purchased from sellers other than Pearson carry a higher risk of being either the wrong ISBN or a previously redeemed code. Check with the seller prior to purchase. --0133745767 / 9780133745764 Politics in States and Communities Plus MySearchLab with eText -- Access Card PackagePackage consists of:    0205239927 / 9780205239924 MySearchLab with Pearson eText -- Valuepack Access Card0205994725 / 9780205994724 Politics in States and Communities",
        "Category": " Political Science , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Healing Light",
        "Authors": "By Sanford, Agnes",
        "Description": "The classic book on healing in America by one of our most renowned spiritual writers. Filled with practical advice, it is dedicated to helping people everywhere tap the creative energy that God offers to people of faith -- a love both limitless and available, if only we seek it.",
        "Category": " Body, Mind & Spirit , Healing , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Utah Blaine/Silver Canyon: Two Novels in One Volume (Louis L'Amour Centennial Editions)",
        "Authors": "By L'Amour, Louis",
        "Description": "Utah BlaineHeld captive south of the border, Colonel Utah Blaine escaped with nothing but the clothes on his back. Then he found new trouble by saving the life of a Texas rancher. The would-be executioners were the rancher’s own men, looking to steal his land. Now Utah has a unique proposition: Have the wealthy Texan play dead, introduce himself as the spread’s new foreman, and take care of the outlaws one by one. The wage to fight another man’s war? Generous. The cost of falling in love while earning that wage? Utah will soon find out—unless the bad guys get him first. Silver Canyon“You’re not wanted in Hattan’s Point,” Matt Brennan was told moments after arriving in town. “There’s trouble here and men are picking sides.” But Matt wasn’t going anywhere until he found out what the dispute was about—and got to know Moira Maclaren. She considered him nothing more than a drifting ranch hand, and he wanted to prove her wrong. To do it, he’d have to solve the mystery of the growing violence—a mystery that could make a man rich…or dead.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Eugenie Grandet (The Human Comedy)",
        "Authors": "By Balzac, Honore De",
        "Description": "Depicting the fatal clash between material desires and the liberating power of human passions, Honoré de Balzac's Eugénie Grandet is translated with an introduction by M.A. Crawford in Penguin Classics.  In a gloomy house in provincial Saumur, the miser Grandet lives with his wife and daughter, Eugénie, whose lives are stifled and overshadowed by his obsession with gold. Guarding his piles of glittering treasures and his only child equally closely, he will let no one near them. But when the arrival of her handsome cousin, Charles, awakens Eugénie's own desires, her passion brings her into a violent collision with her father that results in tragedy for all. Eugénie Grandet is one of the earliest and finest works in Balzac's Comédie humaine cycle, which portrays a society consumed by the struggle to amass wealth and achieve power. Here Grandet embodies both the passionate pursuit of money, and the human cost of avarice.  M. A. Crawford's lucid translation is accompanied by an introduction discussing the irony and psychological insight of Balzac's characterization, the role of fate in the novel, its setting and historical background.  For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1955"
        }
    },
    {
        "Title": "Cookshelf Wok & Stir-fry",
        "Authors": "By Siân Davies",
        "Description": "",
        "Category": "",
        "Publisher": "Paragon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Ordeal by Fire, Vol. 2: The Civil War",
        "Authors": "By McPherson, James M.",
        "Description": "",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "A Midsummer Night's Dream (Airmont Shakespeare Classics Series)",
        "Authors": "By Shakespeare, William",
        "Description": "The 1600 First Quarto edition of A Midsummer Night's Dream is the only text of the play to have been printed in Shakespeare's lifetime and has served as the source for virtually all subsequent editions. It has many features suggesting that it was printed from Shakespeare's 'foul papers' - his manuscript draft - and that this draft had undergone revision before reaching the publishing house.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Bbc Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Possum Magic (Voyager Books)",
        "Authors": "By Fox, Mem and Vivas, Julie (ILT)",
        "Description": "Grandma Poss uses her best bush magic to make Hush invisible. But when Hush longs to be able to see herself again, the two possums must make their way across Australia to find the magic food that will make Hush visible once more. “Another treat from Mem Fox that is sure to be treasured. The whimsical illustrations are a wonderful complement.”--Children’s Book Review Service",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Mrs. Fixit Pantry Power",
        "Authors": "By McGraw, Terri",
        "Description": "Mrs. Fixit, Terri McGraw, offers hundreds of ways to use everyday household products and tools to repair, clean and maintain a home.Information is presented in three sections: 1) alternative uses for everyday products; 2) better uses for everyday tools; 3) creative ways to repurpose items.Dozens of options for using what’s on hand—from dental floss to waxed paper—to get jobs done rather than wasting time or money on specialized products.Shows how to salvage broken or outdated furnishings with style.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "A Long Shadow: Jefferson Davis and the Final Days of the Confederacy",
        "Authors": "By Ballard, Michael B.",
        "Description": "",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Univ Pr of Mississippi",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "From Out of the Blue: Living With Change",
        "Authors": "By Roman France",
        "Description": "",
        "Category": "",
        "Publisher": "Tale Spin Press",
        "Price Starting With ($)": "10.21",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Nation Divided, Vol 3 Selected From the American Reader",
        "Authors": "By Paul M. Angle",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest Books",
        "Price Starting With ($)": "8.39",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "The Confederacy",
        "Authors": "By Kirwan, Albert D. (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Meridian Books, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Design Ideas for Curb Appeal (House Plan Bible)",
        "Authors": "By Connelly, Megan",
        "Description": "Homeowners want the exterior of their homes to be as attractive and welcoming as the interior spaces, and there are several reasons why. First, today’s homeowners are design savvy, thanks to TV and the print media. Second, outdoor areas provide an opportunity for additional living and entertaining space. Third, first impressions count, especially at resale time.Design Ideas for Curb Appeal shows readers how to dress up the exterior of a house. The book covers such topics as welcoming entries, including porches and doors; driveways and garages; landscaping; night appeal; and much more. Real-life makeovers are also included for inspiration. Design Ideas for Curb Appeal shows homeowners what they can do to make the outside of their home look its very best.",
        "Category": " House & Home , Decorating",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Pleasures of the Porch : Ideas for Gracious Outdoor Living",
        "Authors": "By Bowman, Daria Price and Lamarca, Maureen",
        "Description": "For every type of house and for every family's style, there is a perfect porch. Whether you want a quiet outdoor niche where family members can lounge with a good summer read, or a casual front porch that encourages passing neighbors to stop and chat, over the years porch styles have developed that foster these very activities.This beautifully photographed volume details the porch's illustrious past, from its origins as the portico, or covered entryway, of ancient Greece to its glory days as the elaborate outdoor sitting room of Victorian times. A discussion of different types of porches follows, with notes on the particular character of each.Suggestions for creating an area for solitude and respite as well as ideas for converting the space into an elegant room for a party include tips on planning for alfresco meals, decorating for festive occasions, and providing the essentials for relaxation.Pleasures of the Porch also introduces you to the furnishings and accesories of this most romantic of rooms. Bentwood rockers and white wicker settees, string hammocks and wide-striped awnings, floral-washed pillows and heavy Mexican glassware--these are the things that provide comfort and luxury, making the porch a favorite retreat. These chapters reveal which pieces are appropriately sturdy and weather resistant, as well as which are best suited to the ambience of the porch.Because the beauty of nature is often what draws us to the porch, Pleasures of the Porch devotes a special chapter to potted flowers, window boxes, and other plantings that bring color, scent, and pattern to the porch and surrounding areas.Filled with vibrant color photographs that capture the enchantment of porch living, this extravagant volume presents hundreds of ways to truly take pleasure in porches.For every type of house and for every family's style, there is a perfect porch. Whether you want a quiet outdoor niche where family members can lounge with a good summer read, or a casual front porch that encourages passing neighbors to stop and chat, over the years porch styles have developed that foster these very activities.This beautifully photographed volume details the porch's illustrious past, from its origins as the portico, or covered entryway, of ancient Greece to its glory days as the elaborate outdoor sitting room of Victorian times. A discussion of different types of porches follows, with notes on the particular character of each.Suggestions for creating an area for solitude and respite as well as ideas for converting the space into an elegant room for a party include tips on planning for alfresco meals, decorating for festive occasions, and providing the essentials for relaxation.Pleasures of the Porch also introduces you to the furnishings and accesories of this most romantic of rooms. Bentwood rockers and white wicker settees, string hammocks and wide-striped awnings, floral-washed pillows and heavy Mexican glassware--these are the things that provide comfort and luxury, making the porch a favorite retreat. These chapters reveal which pieces are appropriately sturdy and weather resistant, as well as which are best suited to the ambience of the porch.Because the beauty of nature is often what draws us to the porch, Pleasures of the Porch devotes a special chapter to potted flowers, window boxes, and other plantings that bring color, scent, and pattern to the porch and surrounding areas.Filled with vibrant color photographs that capture the enchantment of porch living, this extravagant volume presents hundreds of ways to truly take pleasure in porches.",
        "Category": " Architecture , Interior Design , General",
        "Publisher": "Rizzoli",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Foods That Heal",
        "Authors": "By Pamplona-Roger, George",
        "Description": "",
        "Category": "",
        "Publisher": "Review & Herald Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Job Smarts for Twentysomethings",
        "Authors": "By Richardson, Bradley G.",
        "Description": "A practical, easy-to-use guide to job hunting for young people seeking a career offers tips on coping with office politics, the art of job interviews, finding employment opportunities, and other valuable information. Original. 35,000 first printing.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Vintage Original",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Film as Art",
        "Authors": "By Arnheim, Rudolf",
        "Description": "Delineates the first thirty years of films, contextually analyzing their aesthetic value as mediums of expression and their relation to other forms of art",
        "Category": " Performing Arts , Film , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1957"
        }
    },
    {
        "Title": "Report to Saint Peter",
        "Authors": "By Hendrik Van Loon",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "19.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "Pendulum Power",
        "Authors": "By Nielsen, Greg",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "What's It Like to Be a Fish? (Let's-Read-and-Find-Out Science 1)",
        "Authors": "By Pfeffer, Wendy and Keller, Holly (ILT)",
        "Description": "Could you live underwater?You can&#39;t breathe underwater, but a fish can. You can&#39;t eat underwater, but a fish does it every day. A fish&#39;s body is perfectly designed for life in water, just as your body is perfect for living on land. Read and find out how a fish&#39;s sleek body, fins, scales, and gills keep him in the swim! Then read on to learn how to set up your own goldfish bowl.",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Party Time! Fun for Kids & Parents (Junior Cookbook Collection)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Unknown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Dye It! Paint It! Quilt It!: Making and Using One-Of-A-Kind Fabrics in Quilts",
        "Authors": "By Mori, Joyce and Myerberg, Cynthia",
        "Description": "",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Stopping the Clock: Dramatic Breakthroughs in Anti-Aging and Age Reversal Techniques",
        "Authors": "By Goldman, Robert and Klatz, Ronald",
        "Description": "Why many of us will live past 100--and enjoy our extra years. In Stopping the Clock, two pioneers of anti-aging medicine show how we can start now to regain energy and vitality, halt or reverse damage to our bodies, and avoid the diseases--heart attack, arthritis, cancer, diabetes--that do most to reduce current life expectancy.In sixteen fully-documented, information-packed chapters, Klatz and Goldman detail an up-to-the-minute longevity program, including:The key anti-aging hormones: Melatonin, DHEA, and human growth hormone, how to take them and precautions to use.The sex hormones: the role of estrogen and progesterone supplementation, including natural alternatives to prescription hormones--plus new research on testosterone supplementation for men and women. The role of the \"miracle minerals\"--chromium, selenium and magnesium--and the latest information on the key anti-oxidant vitamins and how to take them. A thyroid support program to avoid the many dangerous effects of thyroid deficiency. A sensible approach to anti-aging exercise--plus 25 ways to defeat the aging effects of stress. The life-long diet--including the top 25 healing foods. A longevity test to determine your current estimated lifespan. Personal longevity programs--including daily supplement regiments--from 28 leaders of anti-aging medicine. Glossary of 75 anti-aging substances available at health-food stores.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Twisted: The Collected Stories of Jeffery Deaver",
        "Authors": "By Deaver, Jeffery",
        "Description": "New York Times bestselling author Jeffery Deaver delivers an electrifying collection of sixteen award-winning stories that will widen your eyes and stretch your imagination. Diverse and provocative, Twisted showcases Deaver's amazing range and signature plot twists: a beautiful woman goes to extremes to rid herself of her stalker; a contemporary of William Shakespeare vows to avenge his family's ruin; and Deaver's most beloved character, brilliant criminalist Lincoln Rhyme, is back to solve a chilling Christmastime disappearance.",
        "Category": " Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Traceless",
        "Authors": "By Webb, Debra",
        "Description": "She’s in search of JUSTICE.Emily Wallace has no doubt about who killed her best friend ten years ago: Clint Austin, her then boyfriend. The key witness in his trial, Emily put Clint behind bars with her tearful testimony. But when Emily learns that Clint has been released on parole, she returns to her Alabama hometown to confront him—and make sure he never forgets the damage he has done. He is dead-set on revenge…After serving ten years for a crime he didn’t commit, Clint knows only the truth can set him free. Ignoring warnings from his old friend, now the chief of police, Clint will let no one stand in his way as he tries to prove his innocence—including Emily, the girl he once loved who ruined his life. Prison has made him a hard man, yet he yearns for Emily…and he can see in her eyes that, in spite of herself, she feels the same. But even if he can convince Emily to trust him, it might be too late to clear his name—before the real killer strikes again.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Gettysburg (The war of the Potomac)",
        "Authors": "By Catton, Bruce",
        "Description": "An account of the military political, and human aspects of the Battle of Gettysburg, documented with Civil War photographs and contemporary",
        "Category": " History , General",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Double, Double, Oil and Trouble (A John Putnam Thatcher Mystery)",
        "Authors": "By Emma Lathen",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1980"
        }
    },
    {
        "Title": "Harper's Pictorial History of the Civil War",
        "Authors": "By Guernsey, Alfred H. and Alden, Henry Mills",
        "Description": "Articles, engravings, and maps from Harper's Magazine issues of the 1860s make up a comprehensive, contemporaneous record of the War between the States, from the firing on Fort Sumter to Lincoln's assassination",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "The Fairfax Press",
        "Price Starting With ($)": "12.71",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    }
]