[
    {
        "Title": "The Terror Presidency: Law and Judgment Inside the Bush Administration",
        "Authors": "By Goldsmith, Jack",
        "Description": "Jack Goldsmith's duty as head of the Office of Legal Counsel was to advise President Bush what he could and could not do...legally. Goldsmith took the job in October 2003 and began to review the work of his predecessors. Their opinions were the legal framework governing the conduct of the military and intelligence agencies in the war on terror, and he found many—especially those regulating the treatment and interrogation of prisoners—that were deeply flawed.Goldsmith is a conservative lawyer who understands the imperative of averting another 9/11. But his unflinching insistence that we abide by the law put him on a collision course with powerful figures in the administration. Goldsmith's fascinating analysis of parallel legal crises in the Lincoln and Roosevelt administrations shows why Bush's apparent indifference to human rights has damaged his presidency and, perhaps, his standing in history.",
        "Category": " Political Science , American Government , Executive Branch",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "9.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Prize Stories 1984 : The O. Henry Awards",
        "Authors": "By Abrahams, William Miller",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Apocalypse",
        "Authors": "By Lalonde, Peter and Lalonde, Paul",
        "Description": "The unthinkable has happened. Buttons are pushed, nuclear missiles fill the skies, and the world waits for the end to come. But suddenly, mysteriously, the missiles vanish, along with 187 million people. At that very moment, an inspiring charismatic leader offers miracles and explanations for these incredible disappearances. Only Bronson Pearl and Helen Hannah, co-anchors of the World News Network, can reveal the truth. In an incredible sequence of scenes, readers are treated to a firsthand look at what the world might be like in the minutes and hours following the Rapture. This exciting novel is based on the video of the same name that has sold over 300,000 copies. It is the first in a series of fast-paced end-time thrillers.",
        "Category": " Fiction , Religious",
        "Publisher": "TransitBooks.com",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Oxford Dictionary of Phrase, Saying, & Quotation",
        "Authors": "By Ratcliffe, Susan Marie (EDT)",
        "Description": "Fully revised and updated, the third edition of the Oxford Dictionary of Phrase, Saying & Quotation adds proverbs and sayings from across the world to memorable phrases and quotations from across the centuries.  This rich collection is arranged under a wide range of subjects--from Ability to Youth--making it an ideal place to look for an apt or pithy expression, or to explore the background of an extensive selection of related sayings and phrases.   With 10% new material, in a new attractive page layout, the third edition includes many new quotations by a wide range of US authors, such as George W. Bush, Bill Gates, Georgia O'Keefe, Dolly Parton, Dan Rather, and Serena Williams.This new edition of an Oxford classic traces the links between treasured sayings in our language, and explains their varied origins. Oxford's unique language research has identified proverbs from non-Western languages newly adopted into English, and these are featured joining an abundance of well-chosen words from Biblical times to the present day.  A full keyword index and generous cross- referencing allow the Oxford Dictionary of Phrase, Saying & Quotation to function both as a look-up resource and a browser's delight.",
        "Category": " Reference , Quotations",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "41.75",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Swan's Grace",
        "Authors": "By Lee, Linda Francis",
        "Description": "HE WAS A MAN WHO MADE THE RULES, WHILE SHE WANTED ONLY TO BREAK THEM . . . .Grayson Hawthorne is everything blue-blooded Boston society admires--rich, ruthless, untainted by scandal.  While always keeping a tight rein on his emotions, he has never forgotten Sophie Wentworth, the spirited but awkward child who captivated his youth with music and a young girl's adoration.  But one night long ago, she left the city unexpectedly.  Now the toast of Europe, Boston's ugly duckling is returning home with the grace of a swan.Through provocative performances, Sophie has found great fame as a concert cellist.  She hopes to keep her past and her new life a secret--until she discovers that her family has bargained her away to Grayson, the lonely boy she once loved--now a cold, forbidding man with the power to break her tattered heart.  At that moment, she vows to bring Boston . . . and Grayson . . . to their knees.SWAN'S GRACE is the sophisticated, unforgettable story of a gifted but defiant woman and an unforgiving man who must find a gentleness in his soul to heal both their tarnished hearts.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Jane Eyre",
        "Authors": "By Black Dog & Leventhal Publishers",
        "Description": "",
        "Category": "",
        "Publisher": "Black Dog & Leventhal Publishers",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "The Unlikely Angel",
        "Authors": "By Krahn, Betina M.",
        "Description": "With her soft heart and angelic face, Madeline Duncan is no one's idea of a hardheaded businessman.  So when the lovely spinster comes into am unexpectedinheritance and uses her newfound wealth to start a business, she causes quite a stir...especially with Lord Cole Mandeville, who has been appointed by the courts to keep Madeline from frittering away her fortune.  Handsome, worldly, and arrogant, Cole knows just how ruthless the world can be--and that aninnocent like Miss Duncan is heading straight for heartbreak, bankruptcy, or worse.  But when he sets out to show Madeline the error of her ways, Cole is infor the surprise of his life...as he finds himself falling under the spell of a woman who won't believe the worst about anyone...even a jaded rogue like him.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Dream Stone",
        "Authors": "By McReynolds, Glenna",
        "Description": "A restless warrior...A fierce maiden...A magical love story of sorcery and passion...Orphaned as a child and raised by monks, Mychael ab Arawn had forsaken all things of the world-- until fiery visions drew him into the victorious battle to reclaim his ancestral home. Yet peace still eludes him, for the visions of mystical dragons and mysterious caverns linger. Armed as a warrior once more, Mychael prepares for his quest--to seek out the images that haunt him and conquer them once and for all.There are many who would stay Mychael, intent on using him for their own purposes. Only the beautiful Llynya, with her lavender scent and lightning-fast blade, joins him on his path. But Mychael may have little chance to taste the sensual power that draws him to the maiden. For soon his visions will lead them to a crossroads of destiny, where danger awaits in every cavern--and friends and ancient enemies of man threaten to destroy them.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Beyond The Limit (Morgan's Mercenaries)",
        "Authors": "By McKenna, Lindsay",
        "Description": "He's tackled tough military projects in hot spots around the globe&#133;but Marine engineer Major Pete Trayhern has never faced anything as challenging as civilian Calandra Roland. Attractive and vivacious, she's definitely not the kind of person he thought would be in charge of building a crucial power station in war-torn Afghanistan. Since they have to work together smoothly, Pete is determined to ignore the instant sparks between them.But Cali's courage and disarming directness are slowly making him drop his guard—and igniting feelings he'd given up trusting. Now, with day-to-day danger the only sure thing and a ruthless conspiracy fast closing in around them, Pete and Cali will put their future and lives on the line. But will their sacrifice destroy their chance for love worth a lifetime?",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "HQN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Law of Nines",
        "Authors": "By Goodkind, Terry",
        "Description": "A publishing event- #1 New York Times-bestselling author Terry Goodkind turns in a new direction and delivers a stunningly original thriller.Turning twenty-seven may be terrifying for some, but for Alex, a struggling artist living in the midwestern United States, it is cataclysmic. Inheriting a huge expanse of land should have made him a rich and happy man; but something about this birthday, his name, and the beautiful woman whose life he just saved, has suddenly made him-and everyone he loves-into a target. A target for extreme and uncompromising violence . . . In Alex, Terry Goodkind brings to life a modern hero in a whole new kind of high-octane thriller.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Who Knew?",
        "Authors": "By Bob Strauss",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling Innovation",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Gardenias for Breakfast",
        "Authors": "By Gunn, Robin Jones",
        "Description": "\"Everybody has a story. You listen to that story, Honeygirl, and your story will come find you.\"Her Grand Lady spoke these words when Abby was just a girl, spending the summer in rural Louisiana, surrounded by an extended, loving family. She's been listening carefully ever since.Now Abby is raising her own family thousands of miles away. And even though Hawaii might seem like paradise to some, it's a long way away from those idyllic days she remembers, sitting with her grandmother, learning about the beauty and mystery of life. So Abby has just one wish: that her daughter Hannah might be touched by the beauty of her 92-year-old Grand Lady's stories, before it's too late.But when Hannah finally does spend time with Grand Lady, the old woman crushes her tender spirit.And a mother-daughter journey home becomes an adventure of discovery-about the importance of family and the healing found in forgiveness.In Gardenias for Breakfast, mothers and daughters may recognize a branch or two from their own family trees and find themselves wishing not only for Grand Lady's guidance but also for Hannah's ability to smell the clouds.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Thomas Nelson Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2012"
        }
    },
    {
        "Title": "The Nature of Blood",
        "Authors": "By Phillips, Caryl",
        "Description": "A German Jewish girl whose life and death are shaped by the atrocities of World War II...her uncle, who undermines the sureties of his own life in order to fight for Israeli statehood...the Jews of the sixteenth-century Venetian ghetto, trapped both literally and figuratively by rabid prejudice...Othello, newly arrived in Venice...a young Ethiopian Jewish woman resettled in Israel: these are the people whose stories fill The Nature of Blood and who, despite their clear differences, share the weight of memory as burden and sustenance. Their individual voices - delineated with masterful precision - speak out of profound depths of feeling about their worlds and their experiences of persecution, courage, and betrayal. But they move beyond the particulars of their own stories as well, their voices twining in an intricate narrative fabric that tells the larger, timeless story of ethnic hatred and racism; of the powers of faith and the shock of its loss; of the cruel patterns of repetition that mar humankind's history, and the crystalline significance of each individual within its sweep.",
        "Category": " Fiction , General",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Play Football The NFL Way: Position-by-Position Techniques and Drills for Offense, Defense, and Special Teams",
        "Authors": "By Bass, Tom",
        "Description": "The First Instructional Manual for Football Players and Coaches Ever Published by the National Football LeaguePosition by position Guide to Learning to Play the GameQuarterbackRunning backReceiverOffensive LineDefensive LineLinebackerDefensive BackPlacekickerPunterKick Returner",
        "Category": " Sports & Recreation , Football",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Why Kerouac Matters: The Lessons of On the Road (They're Not What You Think)",
        "Authors": "By Leland, John",
        "Description": "Legions of youthful Americans have taken On the Road as a manifesto for rebellion and an inspiration to hit the road. But there is much more to the book than that. InWhy Kerouac Matters, John Leland embarks on a wry, insightful, and playful discussion of the novel, arguing that it still matters because it lays out an alternative road map to growing up. Along the way, Leland overturns many misconceptions aboutOn the Road as he examines the lessons that Kerouac?s alter ego, Sal Paradise, absorbs and dispenses on his novelistic journey to manhood, and how those lessons?about work and money, love and sex, art and holiness? still reverberate today.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "730 Easy Science Experiments with Everyday Materials",
        "Authors": "By E. Richard Churchill, Frances Zweifel",
        "Description": "",
        "Category": "",
        "Publisher": "Tess Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Shapes, Sizes & More Surprises: A Little Hands Early Learning Book (Williamson Little Hands Series)",
        "Authors": "By Braren, Loretta Trezzo (ILT) and Tomczyk, Mary",
        "Description": "Over sixty learning experiences explore shapes, numbers, and counting.",
        "Category": " Juvenile Nonfiction , Activity Books , General",
        "Publisher": "Williamson Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Biggest Loser Cookbook: More Than 125 Healthy, Delicious Recipes Adapted from NBC's Hit Show",
        "Authors": "By Lyons, Kim (FRW), Harper, Bob (FRW), Alexander, Devin, Biggest Loser Experts, and Kaplan, Karen",
        "Description": "Biggest Loser Cookbook Provides More Than 125 Healthy, Delicious Recipes From The Biggest Loser Experts and Cast—As Seen On NBC's Hit Show!By Chef Devin Alexander and The Biggest Loser Experts and Cast with Karen Kaplan and a Foreword by Bob Harper and Kim LyonsBuilding on the groundbreaking success of The Biggest Loser brand, this sequel to last year's best-selling book is sure to be a hit!The Biggest Loser Cookbook offers:• 125 recipes from The Biggest Loser cast, trainers, and fans• motivational before-and-after photographs of the cast• 50 beautiful 4-color food shots• dozens of trainer tips from The Biggest Loser trainers• inspiring stories of how the cast members did it• at-a-glance guides to The Biggest Loser Diet and The Biggest Loser Exercise planArmed with this arsenal of nutritional information and training tips, readers will be inspired to achieve the dramatic weight loss transformations that have amazed TV fans around the country.",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Dixie Betrayed: How the South Really Lost the Civil War",
        "Authors": "By Eicher, David J.",
        "Description": "A study in how governments can self-destruct during wartime. For more than a century, the conventional wisdom has been that the South lost because of overwhelming Union strength and bad luck. The Confederates have been lionized as noble warriors who fought for an honorable cause with little chance of succeeding. But historian Eicher reveals a calamity of political conspiracy, discord, and dysfunction. Drawing on previously unexplored sources, Eicher shows how President Jefferson Davis viciously fought with the Confederate House and Senate, governors, and his own cabinet. Confederate senators threatened each other with physical violence; some were brutal drunks, others, hopeless idealists. Military commanders were assigned not by skill but because of personal connections. Davis frequently interfered with his generals in the field, ignoring the chain of command. Also, some states wanted to set themselves up as separate nations, further undermining efforts to conduct a unified war effort.--From publisher description.Traces a political conspiracy and dysfunctional dynamics that the author believes were at the heart of the Confederacy's Civil War losses, in an account that reveals infighting between Jefferson Davis and the Confederate government.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Ordeal of Elizabeth Marsh: A Woman in World History",
        "Authors": "By Colley, Linda",
        "Description": "This is a book about a world in a life. Conceived in Jamaica and possibly mixed-race, Elizabeth Marsh (1735-1785) traveled farther and was more intimately affected by developments across the globe than the vast majority of men. She was the first woman to publish in English on Morocco, and the first to carry out extensive explorations in eastern and southern India. A creature of multiple frontiers, she spent time in London, Menorca, Rio de Janeiro, and the Cape of Africa. She speculated in Florida land, was caught up in the French and Indian War, linked to voyages to the Pacific, and enmeshed as victim or owner in three different systems of slavery. She was also crucially part of far larger histories. Marsh’s  experiences would have been impossible without her links to the Royal Navy, the East India Company, imperial warfare, and widening international trade. To this extent, her career illumines shifting patterns of Western power and overseas aggression. Yet the unprecedented expansion of connections across continents occurring during her lifetime also ensured that her ideas and personal relationships were shaped repeatedly by events and people beyond Europe: by runaway African slaves; Indian weavers and astronomers; Sephardi Jewish traders; and the great Moroccan sultan, Sidi Muhammad, who schemed to entrap her.   Many biographies remain constrained by a national framework, while global histories are often impersonal. By contrast, in this dazzling and original book, Linda Colley moves repeatedly and questioningly between vast geopolitical transformations and the intricate detail of individual lives. This is a global biography for our globalizing times.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Conjurer: A Martha Beale Mystery",
        "Authors": "By Biddle, Cordelia Frances",
        "Description": "From the celebrated coauthor of the Nero Blanc Crossword Puzzle Mysteries comes this elegant and richly nuanced new series debut in the tradition of The Alienist, Maisie Dobbs, and Girl with a Pearl Earring. Intrigue, passion, and murder surround the suspicious disappearance of Philadelphia financier Lemuel Beale in the winter of 1842. A victim of accidental drowning, according to the local constabulary, Beale leaves a sinister legacy of political and financial scheming---and a troubled heiress, his daughter, Martha, his only child. Martha Beale is unmarried at twenty-six, in an era when women are expected to become brides before turning twenty. Normally sheltered and shy, she instigates a search for her father, and in so doing, develops a romantic attachment to Thomas Kelman, an assistant to Philadelphia's mayor---and a man whose business is homicide investigation.  The inquiry into Lemuel's disappearance uncovers connections between the city's most affluent and most destitute: an escaped inmate from the infamous Eastern State Penitentiary; the freed African-American prisoner, Ruth; the ritual slayings of several young girl prostitutes; and Eusapio Paladino, a conjurer and necromancer who claims to communicate with the dead. Written with exquisite historical detail and fast-paced intrigue, The Conjurer is a thrilling start to an exceptional new series.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "3:16: The Numbers of Hope",
        "Authors": "By Lucado, Max",
        "Description": "A twenty-six word parade of hope: beginning with God, ending with life, and urging us to do the same. Brief enough to write on a napkin or memorize in a moment, yet solid enough to weather two thousand years of storms and questions. If you know nothing of the Bible, start here. If you know everything in the Bible, return here. We all need the reminder. The heart of the human problem is the heart of the human. And God's treatment is prescribed in John 3:16:For God so loved the world that he gave his one and only Son that whosoever believes in Him shall not perish but have eternal life.He loves. He gave. We believe. We live.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Heaven's Edge",
        "Authors": "By Gunesekera, Romesh",
        "Description": "In search of a dream, Marc leaves London for the land of his patrimony and family secrets - an island once said to be near the edge of heaven but now despoiled by war. There by a glittering lake he sees the subversive Uva, an eco-warrior, setting free a pair of emerald doves. When she disappears and their passionate affair is cut short, Marc must search for her among the mystical land's underground dens of iniquity and ghostly colonial mansions. As gun battles and foot races erupt, he is forced to confront the question his ancestors handled in such different ways: Is violence ever a proper path to freedom? In the midst of war, can he achieve a happiness he would defend with his life?",
        "Category": " Fiction , Romance , General",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Master of Ecstasy (Mackenzie Vampires, Book 1)",
        "Authors": "By Bangs, Nina",
        "Description": "Traveling back in time to 1785 Scotland for a vacation at the gloomy old MacKenzie castle, Blythe comes face to face with Darach, a sinfully handsome and seductive vampire. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "A Magical Christmas",
        "Authors": "By Graham, Heather",
        "Description": "Presents the riveting story of one family's desperate search for meaning in their lives, the discovery of the healing power of love, and the true spirit of the holiday season. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Topaz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Lonely Planet Ireland (Lonely Planet Ireland, 4th ed)",
        "Authors": "By Davenport, Fionn, Smallman, Tom, and Talbot, D.",
        "Description": "",
        "Category": " Travel , Europe , Ireland",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Fourth Bear: A Nursery Crime",
        "Authors": "By Fforde, Jasper",
        "Description": "Jack Spratt and Mary Mary return in their second adventure from the inimitable Jasper Fforde  Five years ago, Viking introduced Jasper Fforde and his upsidedown, inside-out literary crime masterpieces. And as they move from Thursday Next to Jack Spratt’s Nursery Crimes, his audience is insatiable and growing. Now, with The Fourth Bear, Jack Spratt and Mary Mary take on their most dangerous case so far as a murderous cookie stalks the streets of Reading.  The Gingerbreadman—psychopath, sadist, genius, and killer—is on the loose. But it isn’t Jack Spratt’s case. He and Mary Mary have been demoted to Missing Persons following Jack’s poor judgment involving the poisoning of Mr. Bun the baker. Missing Persons looks like a boring assignment until a chance encounter leads them into the hunt for missing journalist Henrietta “Goldy” Hatchett, star reporter for The Daily Mole. Last to see her alive? The Three Bears, comfortably living out a life of rural solitude in Andersen’s wood.  But all is not what it seems. How could the bears’ porridge be at such disparate temperatures when they were poured at the same time? Why did Mr. and Mrs. Bear sleep in separate beds? Was there a fourth bear? And if there was, who was he, and why did he try to disguise Goldy’s death as a freak accident?  Jack answers all these questions and a few others besides, rescues Mary Mary from almost certain death, and finally meets the Fourth Bear and the Gingerbreadman face-to-face.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Viking Penguin",
        "Price Starting With ($)": "29.96",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Essential SharePoint 2007",
        "Authors": "By Hanley, Susan, Jamison, Scott, and Cardarelli, Mauro",
        "Description": "Essential SharePoint® 2007  focuses on utilizing Microsoft Office SharePoint 2007 to improve collaboration and decision-making, streamline processes, and solve real-world business problems. Three leading SharePoint consultants systematically address the crucial success factors, intangibles, and \"gotchas\" in SharePoint deployment–showing exactly how to maximize business value and reduce project risk.     Drawing on their unsurpassed experience, the authors walk you through planning and architecting successful SharePoint solutions around the unique needs of your business. Next, they address the operational support and end-user functionality needed to make SharePoint 2007 work–with special attention given to the organizational and political issues that can make or break your project. Learn how to:      Define optimal, workable collaboration strategies    Build SharePoint applications people want to use    Architect SharePoint infrastructure for superior performance, reliability, and value. Provide your customers with state-of-the-art sites, blogs, and wikis    Use SharePoint content management to integrate documents, records, and Web content, and make it all searchable    Implement forms-based workflow to optimize virtually any business process      Quickly build business intelligence solutions using Web-base dashboards and server-based Excel Services    Organize and staff SharePoint support teams    Migrate efficiently from SharePoint 2003    Whether you're a project manager, consultant, analyst, line-of-business executive, or developer, this book helps you align your SharePoint project with your business strategy–and deliver quantifiable results fast.           Preface  Chapter 1 Your Collaboration Strategy: Ensuring Success    Chapter 2 Office SharePoint Server 2007: High-Impact Collaboration  Across the Extended Enterprise    Chapter 3 Introduction to the 2007 Office System as a Collaboration  and Solutions Platform  Chapter 4 SharePoint Architecture Fundamentals  Chapter 5 Planning Your Information Architecture    Chapter 6 Planning Your Move from SharePoint 2003 to 2007:  Upgrade or Rebuild?  Chapter 7 Disaster Recovery Planning     Chapter 9 Enterprise Content Management: Documents,  Records, and Web    Chapter 10 Enterprise Search  Chapter 11 Making Business Processes Work: Workflow and Forms    Chapter 12 Office 2007: Offline Options for MOSS 2007  Chapter 13 Providing Business Intelligence  Appendix A SharePoint User Tasks    Appendix B OS/Browser/Office Compatibility   Index",
        "Category": " Computers , Networking , Intranets & Extranets",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Where Is the Afikomen?",
        "Authors": "By Groner, J.",
        "Description": "A young girl tries to find the afikomen at the Passover seder.",
        "Category": " Juvenile Nonfiction , Religion , Judaism",
        "Publisher": "Kar-Ben Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Direction for Our Times, Vol. 1: Thoughts on Spirituality",
        "Authors": "By Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Direction for Our Times",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Deep-sea photography, (The Johns Hopkins oceanographic studies)",
        "Authors": "By Hersey, John Brackett",
        "Description": "",
        "Category": "",
        "Publisher": "Johns Hopkins Press",
        "Price Starting With ($)": "43.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The Long Pursuit: Abraham Lincoln's Thirty-Year Struggle with Stephen Douglas for the Heart and Soul of America",
        "Authors": "By Morris, Roy Jr.",
        "Description": "In this compelling narrative, renowned historian Roy Morris, Jr., expertly offers a new angle on two of America's most towering politicians and the intense personal rivalry that transformed both them and the nation they sought to lead in the dark days leading up to the Civil War.For the better part of two decades, Stephen Douglas was the most famous and controversial politician in the United States, a veritable \"steam engine in britches.\" Abraham Lincoln was merely Douglas's most persistent rival within their adopted home state of Illinois, known mainly for his droll sense of humor, bad jokes, and slightly nutty wife.But from the time they first set foot in the Prairie State in the early 1830s, Lincoln and Douglas were fated to be political competitors. The Long Pursuit tells the dramatic story of how these two radically different individuals rose to the top rung of American politics, and how their personal rivalry shaped and altered the future of the nation during its most convulsive era. Indeed, had it not been for Douglas, who served as Lincoln's personal goad, pace horse, and measuring stick, there would have been no Lincoln-Douglas debates in 1858, no Lincoln presidency in 1860, and perhaps no Civil War six months later. For both men—and for the nation itself—the stakes were that high.Not merely a detailed political study, The Long Pursuit is also a compelling look at the personal side of politics on the rough-and-tumble western frontier. It shows us a more human Lincoln, a bare-knuckles politician who was not above trading on his wildly inaccurate image as a humble \"rail-splitter,\" when he was, in fact, one of the nation's most successful railroad attorneys. And as the first extensive biographical study of Stephen Douglas in more than three decades, the book presents a long-overdue reassessment of one of the nineteenth century's more compelling and ultimately tragic figures, the one-time \"Little Giant\" of American politics.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Total Wellbeing",
        "Authors": "By Hamlyn",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Hunter Publishing+inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Lost & Found: One Daughter's Story of Amazing Grace",
        "Authors": "By Slattery, Kathryn",
        "Description": "",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "GuidepostsBooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Guy's Guide to Surviving Pregnancy, Childbirth and the First Year of Fatherhood",
        "Authors": "By Crider, Michael R.",
        "Description": "\"Absolutely hysterical. No matter what stage of fatherhood you're in -- whether you're still watching your wife expand (and listening to her gripe!) or if you're now up all night with the little one -- this book will provide much-needed comic relief.\" (Jenny McCarthy, author of Belly Laughs)From the moment he hears the unexpected news that the pregnancy test is positive to the end of his son's first year of life, Michael Crider is awed, anxious, and all-too-human. In between these milestones, he endures the aches and pains of his wife's pregnancy (which had a clear impact on his own bodily comfort), swallows his pride when bunny wallpaper replaces his beloved Budweiser mirror, has a short and only partially-appreciated stint as her labor coach on the Big Day, and experiences every one of his son's \"firsts\" as though they were his own. Honest, informative, hilarious, and heartwarming, The Guy's Guide to Surviving Pregnancy, Childbirth, and the First Year of Fatherhood is a must-read for all new parents.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Let's Explore, Baby Einstein Numbers",
        "Authors": "By Hyperion",
        "Description": "",
        "Category": "",
        "Publisher": "Hyperion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Chardonnay Charade: A Wine Country Mystery (Wine Country Mysteries)",
        "Authors": "By Crosby, Ellen",
        "Description": "The Chardonnay Charade begins with a daring helicopter flight in the middle of the night. Facing a freak spring frost that threatens to kill the grapes in her vineyard, Lucie Montgomery hires a chopper to fly over the vines in order to blow warm air on them. But her thoughts soon turn from grapes to murder when she discovers the body of Georgia Greenwood, a controversial political candidate, lying near the fields. Georgia's husband, Ross, Lucie's friend and doctor, immediately falls under suspicion. To make matters worse, Ross, a renowned collector of Civil War documents, has just discovered a letter that seems to prove that Confederate president Jefferson Davis had prior knowledge of the plot to assassinate Abraham Lincoln. In the small town of Atoka, Virginia -- proud home to the \"Gray Ghost,\" the Confederacy's legendary guerrilla commander -- the letter is a bombshell.Three years ago Ross saved Lucie's life after she was involved in a near-fatal car crash. Now she intends to return the favor and prove Ross's innocence. As the search for Georgia's killer escalates, Lucie crosses swords with her attractive but cantankerous winemaker, Quinn Santori, and confronts her own unwelcome feelings of jealousy over his new romance and job prospects. Her worries about her kid sister's out-of-control drinking and a second vineyard-related death further ratchet up the tension. Even though Lucie believes that in vino veritas -- in wine there is truth -- she finds that the path to uncovering a murderer involves making a heartbreaking decision that will alter the lives of those she loves.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Cinderella (Disney Classic) (Little Golden Book)",
        "Authors": "By Werner, Jane and Worcester, Retta Scott (ILT)",
        "Description": "The original Little Golden Book from the 1940s featuring Walt Disney’s Cinderella is back! This enchanting fairy tale is beautifully rendered with vintage artwork bringing Cinderella and her cruel stepsisters to life.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Golden/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Arizona the Grand Canyon State",
        "Authors": "By Walker, Steven L.",
        "Description": "",
        "Category": " Travel , United States , West , Mountain (AZ, CO, ID, MT, NM, NV, UT, WY)",
        "Publisher": "Canyonlands Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Unlocked: A Journey from Prison to Proust",
        "Authors": "By Ferrante, Louis",
        "Description": "From the freewheeling rush of hijacking trucks to the brutal race wars that marked his decade-long stint in jail, former Mafia insider Louis Ferrante describes his remarkable journey from rising mobster to federal prison inmate to full-time writer.As Louis Ferrante tells it, the bottom line was money—and his word was good. During his teenage years, Ferrante and his crew members hijacked delivery trucks and drove them to drop-offs all over New York, reselling the merchandise and pocketing thousands of dollars per load. For a seventeen-year-old who liked fist fighting and fast cars, it was the quickest money on the street, and it soon earned Ferrante the attention of the infamous Gambino crime family, led by late Mob boss John Gotti. In the early nineties, Ferrante's growing Mafia connections enabled him to pull off some of the most lucrative heists in American history—all by the age of twenty-one.But the same handshakes that once sealed deals soon could no longer be trusted, and the betrayal by several of his close friends brought the feds banging down Ferrante's door. Symptomatic of the nation's larger crackdown on organized crime, indictments came from the Secret Service, the Nassau County Organized Crime Force, and the FBI. By 1994, Ferrante faced a life sentence in prison. He pleaded guilty and would serve nearly a decade in some of the most notorious penitentiaries in America. With raucous violence teeming around him, Ferrante relied on his Mob connections and street smarts to keep him alive—until an unexpected exchange with a guard propelled him to a painful self-reckoning: Who am I? What is it that makes me this way? Do I have a purpose?Desperate to escape from his bleak surroundings, Ferrante immersed himself in the study of history and literature. Over the term of his incarceration, each book became a much-needed sanctuary from the brutal chaos of his everyday existence, each page a challenge to his rapidly expanding knowledge of the world. Ferrante read voraciously—a journey of the mind that took him from philosophy and ancient classics to nineteenth-century fiction. He also learned the art of writing and studied the major world religions, eventually deciding to become an Orthodox Jew. And with only limited access to legal texts, Ferrante taught himself enough about the American justice system to successfully appeal his own conviction, in a case that is now cited in courtrooms across the country. Gritty and hard-hitting, Ferrante's memoir recounts his rapid rise to the upper echelons of the Mafia hierarchy, his time in prison, and his struggle to turn his life around. Unlocked is an astonishing journey—a true story of personal transformation that is both shocking and unforgettable.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Patriot Battles: How the War of Independence Was Fought",
        "Authors": "By Stephenson, Michael",
        "Description": "Drawing on hundreds of specialist sources, contemporary and archival, Patriot Battles is the comprehensive one-volume study of the military aspects of the War of Independence. The first part of the book offers a richly detailed examination of the nuts and bolts of eighteenth-century combat: For example, who fought and what motivated them, whether patriot or redcoat, Hessian or Frenchman? How were they enlisted and trained? How were they clothed and fed? What weapons did they use, and how effective were they? When soldiers became casualties or fell ill, how did medical services deal with them? What roles did loyalists, women, blacks, and Indians play?The second part of the book gives a closer look at the war's greatest battles, with maps provided for each. Which men were involved, and how many? What was the state of their morale and equipment? What parts did terrain and weather play? What were the qualities of the respective commanders, and what tactics did they employ? How many casualties were inflicted? And no less important, how did the soldiers fight? Throughout, many cherished myths are challenged, reputations are reassessed, and long-held assumptions are tested. For all readers, Patriot Battles becomes not only one of the most satisfying and illuminating works to be added to the literature on the War of Independence in many years but also a refreshing wind blowing through some of its dustier corridors.",
        "Category": " History , Military , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Fathers and Sons: The Autobiography of a Family",
        "Authors": "By Waugh, Alexander",
        "Description": "If there is a literary gene, then the Waugh family most certainly has it—and it clearly seems to be passed down from father to son. The first of the literary Waughs was Arthur, who, when he won the Newdigate Prize for poetry at Oxford in 1888, broke with the family tradition of medicine. He went on to become a distinguished publisher and an immensely influential book columnist. He fathered two sons, Alec and Evelyn, both of whom were to become novelists of note (and whom Arthur, somewhat uneasily, would himself publish); both of whom were to rebel in their own ways against his bedrock Victorianism; and one of whom, Evelyn, was to write a series of immortal novels that will be prized as long as elegance and lethal wit are admired. Evelyn begat, among seven others, Auberon Waugh, who would carry on in the family tradition of literary skill and eccentricity, becoming one of England’s most incorrigibly cantankerous and provocative newspaper columnists, loved and loathed in equal measure. And Auberon begat Alexander, yet another writer in the family, to whom it has fallen to tell this extraordinary tale of four generations of scribbling male Waughs.The result of his labors is Fathers and Sons, one of the most unusual works of biographical memoir ever written. In this remarkable history of father-son relationships in his family, Alexander Waugh exposes the fraught dynamics of love and strife that has produced a succession of successful authors. Based on the recollections of his father and on a mine of hitherto unseen documents relating to his grandfather, Evelyn, the book skillfully traces the threads that have linked father to son across a century of war, conflict, turmoil and change. It is at once very, very funny, fearlessly candid and exceptionally moving—a supremely entertaining book that will speak to all fathers and sons, as well as the women who love them.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "5.45",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Hearts Touched by Fire: My 500 Most Inspirational Quotations",
        "Authors": "By Dole, Elizabeth (EDT)",
        "Description": "Former Secretary of Transportation, former Secretary of Labor, President of the American Red Cross, wife of co-campaigner Republican presidential nominee and icon Bob Dole, co-campaigner presidential candidate in her own right, and now a Senator from North Carolina, Elizabeth Dole has led a remarkably accomplished life in her climb to being one of the two most influential women in American politics. Her reputation as an effective and inspiring public speaker is not incidental to those accomplishments. In Hearts Touched By Fire, Dole recounts her inexperienced beginnings while running for student office at Duke University, and how understanding the importance of being able to communicate what she had to say ultimately helped to take her and others on her journey. In addition to her own development as a speaker, related with candor and insight, Dole presents 500 of the most time-honored, beloved, and, ultimately inspiring quotations?some of which were said to her personally?that she uses in her role as a leader, legislator and orator. Hearts Touched By Fire is a wonderful collection not only for those interested in public speaking but for anyone who is simply in need of empowering and uplifting words of wisdom.",
        "Category": " Reference , Quotations",
        "Publisher": "Carroll & Graf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Baptizing of America: The Religious Right's Plans for the Rest of Us",
        "Authors": "By Rudin, James and Rudin, A. James",
        "Description": "The Baptizing of America: Politics, Piety, and the Coming Theocracy exposes the systematic campaign by Christian fundamentalists to co-opt and take over every \"room\" of American society from the bedroom to the school room, hospital room, operating room, courtroom, work room, reading room and newsroom.This book focuses on the aggressive war currently being led by fundamentalist Christians to \"baptize America.\" It is a battle that will determine whether the United States remains a spiritually vital country but without an officially established religion, or whether it will become \"Christianized,\" a \"faith-based nation\" in which fundamentalist Christianity will be the sole legal dominant religion throughout the land. The war will decide whether America follows the path of many other nations and becomes a theocracy not unlike Iran and the former Taliban regime in Afghanistan.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Thunder's Mouth Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Stock Split Secret$: Profiting from a Powerful, Predictable, Price-Moving Event",
        "Authors": "By Nelson, Miles",
        "Description": "",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Lighthouse Pub Inc",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "America's Promise Restored: Preventing Culture, Crusade, and Partisanship from Wrecking Our Nation",
        "Authors": "By Ullman, Harlan",
        "Description": "America's Promise Restored is by one of America's foremost military and political thinkers. It shows how, if left unchecked, America’s current political culture and historical capacity for crusade — motivated and corrupted by ideology — will prove far more destructive than all of Bin Laden’s devilish intentions.Contemporary American politics is destroying America’s relevance and influence abroad and its democratic values at home. This book shows how these forces evolved and have been transformed, fragmented, and perverted such that America has been broken by old political mindsets and harsh partisanship; how religion, ideological overtones, and excesses prevent rational policy. We also see that the forces threatening American democracy are an “antique” form of government that seems to be in permanent gridlock since it is driven, distorted and corrupted by self-interest. These things have engaged the nation in the wrong war in the wrong place at the wrong time, as well as having intruded across inviolable political boundaries; and an extraordinarily dangerous yet misunderstood threat that can draw on tens of millions of converts — many of whom are prepared to die in the process of imposing a political-theological regime on a region rich in oil with access to nuclear weapons.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Carroll & Graf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Pathways in Scripture",
        "Authors": "By Winzen",
        "Description": "",
        "Category": "",
        "Publisher": "Servant Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1976"
        }
    },
    {
        "Title": "Touch and Go: A Memoir",
        "Authors": "By Terkel, Studs",
        "Description": "At nearly 95, Studs Terkel has written about everyone's life, it seems, but his own. Here he offers a memoir which--embodying the spirit of the man himself--is youthful and vivacious. Terkel begins by taking us back to his childhood, describing the hectic life of a family trying to earn a living in Chicago. He then goes on to his experiences--as a poll watcher charged with stealing votes for the Democratic machine, as a young theatergoer, and eventually as an actor himself in both radio and on the stage--giving us a portrait of the Chicago of the 1920s and 1930s. He tells of his beginnings as a disc jockey after World War II and as an interviewer and oral historian--a craft he would come to perfect. Finally, he discusses his involvement with progressive politics, leading to his travails during the McCarthy period when he was blacklisted.--From publisher description.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "New Press, The",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Golden Fever: A Rollicking Romp with Everyone's Buddy, the Golden Retriever",
        "Authors": "By Cochran, Bruce",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Willow Creek Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "How to Expand Love: Widening the Circle of Loving Relationships",
        "Authors": "By Dalai Lama XIV and Hopkins, Jeffrey",
        "Description": "In our quest for true happiness and fulfillment during the course of our lives, nothing is more essential than giving and receiving love. But how well do we understand love's extraordinarily transformative powers? Can we really cultivate and appreciate its priceless gifts? In How to Expand Love, His Holiness the Dalai Lama, winner of the Nobel Peace Prize, offers a simple yet illuminating program for transforming self-centered energy into outwardly directed compassion. Drawing on exercises and techniques established in Tibetan monasteries more than a thousand years ago, the Dalai Lama guides us through seven key stages.First, we learn ways to move beyond our self-defeating tendency to put others into rigid categories. We discover how to create and maintain a positive attitude toward those around us, in ever-widening circles. By reflecting on the kindnesses that close friends have shown us, particularly in childhood, we learn to reciprocate and help other people achieve their own long-term goals. And in seeking the well-being of others, we foster compassion, the all-encompassing face of love. In this accessible and insightful book, His Holiness the Dalai Lama helps us to open our hearts and minds to the experience of unlimited love, transforming every relationship in our lives and guiding us ever closer to wisdom and enlightenment.",
        "Category": " Religion , Buddhism , Tibetan",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Oxford Companion to United States History (Oxford Companions)",
        "Authors": "By Boyer, Paul S. (EDT), Dubofsky, Melvyn (EDT), Monkkonen, Eric H. (EDT), Numbers, Ronald L. (EDT), Oshinsky, David M. (EDT), and Rosenberg, Emily S. (EDT)",
        "Description": "Here is a volume that is as big and as varied as the nation it portrays. With over 1,400 entries written by some 900 historians and other scholars, it illuminates not only America's political, diplomatic, and military history, but also social, cultural, and intellectual trends; science, technology, and medicine; the arts; and religion.Here are the familiar political heroes, from George Washington and Benjamin Franklin, to Abraham Lincoln, Woodrow Wilson, and Franklin D. Roosevelt. But here, too, are scientists, writers, radicals, sports figures, and religious leaders, with incisive portraits of such varied individuals as Thomas Edison and Eli Whitney, Babe Ruth and Muhammed Ali, Black Elk and Crazy Horse, Margaret Fuller, Emma Goldman, and Marian Anderson, even Al Capone and Jesse James. The Companion illuminates events that have shaped the nation (the Great Awakening, Bunker Hill, Wounded Knee, the Vietnam War); major Supreme Court decisions (Marbury v. Madison, Roe v. Wade); landmark legislation (the Fugitive Slave Law, the Pure Food and Drug Act); social movements (Suffrage, Civil Rights); influential books (The Jungle, Uncle Tom's Cabin); ideologies (conservatism, liberalism, Social Darwinism); even natural disasters and iconic sites (the Chicago Fire, the Johnstown Flood, Niagara Falls, the Lincoln Memorial).  Here too is the nation's social and cultural history, from Films, Football, and the 4-H Club, to Immigration, Courtship and Dating, Marriage and Divorce, and Death and Dying. Extensive multi-part entries cover such key topics as the Civil War, Indian History and Culture, Slavery, and the Federal Government. A new volume for a new century, The Oxford Companion to United States History covers everything from Jamestown and the Puritans to the Human Genome Project and the Internet--from Columbus to Clinton. Written in clear, graceful prose for researchers, browsers, and general readers alike, this is the volume that addresses the totality of the American experience, its triumphs and heroes as well as its tragedies and darker moments.",
        "Category": " History , Reference",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Deathwish (Cal Leandros)",
        "Authors": "By Thurman, Rob",
        "Description": "In a nightmarish new york city, life is there for the taking in the fourth Cal Leandros novel from New York Times bestselling author Rob Thurman.Half-human Cal Leandros and his brother Niko are barely getting by with their preternatural investigative agency when the vampire Seamus hires them. He’s being followed, and he wants to know by whom. But the Leandros brothers have to do more than they planned when Seamus turns up dead (or un-undead).    Worse still is the return of Cal's nightmarish family—the Auphe. The last time Cal and Niko faced them, they were almost wiped out. Now, the Auphe want revenge. And Cal knows that before they get to him, they will destroy everything and everyone he holds dear. Because, for the Auphe, Cal's pain is a pleasure.   And they’re feeling good...",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Crunch: Why Do I Feel So Squeezed? (And Other Unsolved Economic Mysteries)",
        "Authors": "By Bernstein, Jared",
        "Description": "Is Social Security really going bust, and what does that mean to me? If I hire an immigrant, am I hurting a native-born worker? Why does the stock market go up when employment declines? Should I give that homeless guy a buck? What’s a “living wage”?  How much can presidents really affect economic outcomes? What does the Federal Reserve Bank really do?  And when the pundits say the economy’s doing so well, why do I still feel so squeezed? If you’d like some straight answers, premier economist Jared Bernstein is here to help. In Crunch he responds to dozens of questions he has fielded from working Americans, questions that directly relate to the bottom-line, dollars-and-cents concerns of real people.  Chances are if there’s a stumper you’ve always wanted to ask an economist, it’s solved in this book.  Bernstein is fed up with “Darth Vaders with PhDs” who use their supposed expertise to intimidate average citizens and turn economics into a tool for the rich and powerful. In the pages of Crunch, Bernstein lays bare the dark secret of economics: it’s not an objective scientific discipline. It’s a set of decisions about the best way to organize our society to produce and distribute resources and opportunities. And we all can, and must, participate in these decisions. “America is a democracy,” he writes. “And in a democracy all of us, not just the elites and their scholarly shock troops, get to weigh in on biggies like this.”  Our economy will be only as fair as we can make it. In this lively and irreverent tour through everyday economic mysteries, Bernstein helps us decode economic ”analysis,” navigate through murky ethical quandaries, and make sound economic decisions that reflect our deepest aspirations for ourselves, our families, and our country.",
        "Category": " Political Science , International Relations , Diplomacy",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "But I Trusted You: Ann Rule's Crime Files #14",
        "Authors": "By Rule, Ann",
        "Description": "THE MOST FATAL MISTAKE?    Trust. It's the foundation of any enduring relationship between friends, lovers, spouses, and families. But when trust is placed in those who are not what they seem, the results can be deadly. Ann Rule, who famously chronicled her own shocking experience of unknowingly befriending a sociopath in The Stranger Beside Me, offers a riveting, all-new collection from her true-crime files, with the lethally shattered bonds of trust at the core of each bloodsoaked account. Whether driven to extreme violence by greed or jealousy, passion or rage, these calculating sociopaths targeted those closest to them -- unwitting victims whose last disbelieving words could well have been \"but I trusted you....\" Headlining this page-turning anthology is the case of middle-school counselor Chuck Leonard, found shot to death outside his Washington State home on an icy February morning. A complicated mix of family man and wild man, Chuck played hard and loved many...but who crossed the line by murdering him in cold blood? And why? The revelation is as stunning as the shattering crime itself, powerfully illuminating how those we think we know can ingeniously hide their destructive and homicidal designs. Along with other shattering cases, immaculately detailed and sharply analyzed by America's #1 true-crime writer, this fourteenth Crime Files volume is essential reading for getting inside the mind of the hidden killers among us.",
        "Category": " True Crime , Murder , Serial Killers",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Edge of Tomorrow",
        "Authors": "By Asimov, Isaac",
        "Description": "",
        "Category": "",
        "Publisher": "Tor",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Lost Life of Eva Braun",
        "Authors": "By Lambert, Angela",
        "Description": "Eva Braun is one of history’s most famous nonentities. She has been dismissed as a racist, feathered-headed shop girl, yet sixty-two years after her death her name is still instantly recognizable.              She left her convent school at the age of seventeen and met Hitler a few months later.  She became his mistress before she was twenty. How did unsophisticated little Fraulein Braun, twenty-three years his junior, hold the most powerful man in Europe in an exclusive sexual relationship that lasted from 1932 until their joint suicide? Were they really lovers, and what were the background influences and psychological tensions of the middle-class Catholic girl from Munich who shared his intimate life? How can her ordinariness and apparent decency be reconciled with an unshakeable loyalty to the monster she loved?              She left almost no personal material or documents but her private diary and photograph albums show that her life with Hitler, far from being a luxurious sinecure, caused her emotional torture. His chauffeur called her “the unhappiest woman in Germany.”  The Führer humiliated her in public while the top Nazis’ wives, living in his privileged enclave on a Bavarian mountainside, despised her. Yet Albert Speer said: “She has been much maligned. She was very shy, modest. A man’s woman: gay, gentle, and kind; incredibly undemanding . . . a restful sort of girl. And her love for Hitler---as she proved in the end---was beyond question.”            Eva loved the Führer, not for his power, nor because, thanks to him, she lived in luxury.  His material gifts were nothing compared with the one thing she really wanted:  his child.  She remained invisible and unknown, a nonperson. They were never seen in public together and she never saw him alone except in the bedroom, yet their long relationship was a sort of marriage.              Angela Lambert reveals a woman the world never knew until the last twenty-four hours of her life. In the small hours of April 29, 1945, as Allied troops raced to capture Berlin and the bunker below the Reichskanzlei where the defeated Nazi leaders were hiding, Eva Braun finally achieved her life’s ambition by becoming Hitler’s wife. Next day they both swallowed cyanide and died instantly. She was young, healthy, and thirty-three years old.              Based on detailed new research, this is an authoritative biography, only the second life of Eva written in English.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "St Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Blackstone's Tricks Anyone Can Do",
        "Authors": "By Blackstone, Harry",
        "Description": "Explains how to perform a variety of magic tricks involving coins, cards, cigarettes, rope, string, and other household items",
        "Category": " Games & Activities , Magic",
        "Publisher": "Kensington Publishing Corp.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Civil War of Charleston South Carolina, a City Under Siege",
        "Authors": "By Lawrence Russell",
        "Description": "",
        "Category": "",
        "Publisher": "Charleston Postcard Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Temples, Tombs, and Hieroglyphs: A Popular History of Ancient Egypt",
        "Authors": "By Mertz, Barbara",
        "Description": "An eye-opening, edifying, and endlessly entertaining tour through an astonishing bygone world—the acclaimed classic history of ancient Egypt, now newly revised and updatedWriting as Elizabeth Peters, world-renowned Egyptologist Barbara Mertz is the author of the phenomenally popular New York Times bestselling mystery series featuring archaeologist Amelia Peabody. In Temples, Tombs, and Hieroglyphs, Dr. Mertz explores the breathtaking reality behind her fiction by casting a dazzling light on a remarkable civilization that, even after thousands of years, still stirs the human imagination and inspires awe with its marvelous mysteries and amazing accomplishments.A fascinating chronicle of an extraordinary epoch—from the first Stone Age settlements through the reign of Cleopatra and the Roman invasions—Temples, Tombs, and Hieroglyphs brings ancient Egypt to life as never before. Lavishly illustrated with pictures, maps, photographs, and charts, it offers tantalizing glimpses into Egyptian society and everyday life; amazing stories of the pharaohs and the rise and fall of great dynasties; religion and culture; folklore and fairy tales; stories of the explorers, scientists, and unmitigated scoundrels who sought to unravel or exploit the ageless mysteries; and breathtaking insights into the magnificent architectural wonders that rose up from the desert sands. Revised and updated to include the results of the most recent historical research and archaeological finds, Dr. Mertz's book is unhampered by stuffy prose and dry academic formality. Instead, it is a vibrant, colorful, and fun excursion for anyone who's ever fantasized about exploring the Valley of the Kings, viewing up close the treasures of the temple of Queen Hatshepsut, or sailing down the Nile on Cleopatra's royal barge.",
        "Category": " Social Science , Archaeology",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "29.95",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Biblioholism, Rev. Ed.: The Literary Addiction",
        "Authors": "By Raabe, Tom",
        "Description": "Book lovers will enjoy Raabe's outrageous ploys and solutions to excessive book acquisition mingled among the true accounts of famous bibliophiles.  His book parodies the self-help genre; fellow sufferer Raabe writes to help the reader cope with (rather than attempt to recover from) their addiction.  There are notes and bibliography, but no index. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Humor , Form , Essays",
        "Publisher": "Fulcrum Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Seduction of a Proper Gentleman (Last Man Standing)",
        "Authors": "By Alexander, Victoria",
        "Description": "To break a centuries-old curse, beautiful, headstrong Lady Kathleen MacDavid knows she must ignore every rule of propriety by seducing—and marrying—the Earl of Norcroft. So she sets off for London, braving scandal and ruin to achieve her goal . . . until a crazy bump on the head makes her forget nearly everything.The thrill of winning a bet—that he'd be the last of his set to wed—hasn't eased the earl's pain of losing his friends to marriage. Still, he'd be willing to settle down if he could meet someone worthy of his love—and desire. But he has met no such woman, until Kathleen is brought to him. Suspicious of her motives, he's determined to resist her seductive ways. But sometimes even the most proper gentleman finds it expedient to act improperly . . .",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "26.0",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Creative Correction",
        "Authors": "By Whelchel, Lisa and Omartian, Stormie (FRW)",
        "Description": "Drawing from her own family's experiences and from interaction with other parents, Lisa Whelchel offers creative solutions for parents who are out of ideas and desperate for new, proven approaches to discipline. In addition to advice on topics such as sibling conflict and lying, Whelchel offers a biblical perspective and down-to-earth encouragement to parents who are feeling overwhelmed. A handy reference guide that provides ideas for specific situations rounds out this resource that will be a blessing to parents and their children. Now in softcover.",
        "Category": " Religion , Christian Living , Family & Relationships",
        "Publisher": "Focus on the Family",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Cat O'Nine Tales: And Other Stories",
        "Authors": "By Archer, Jeffrey",
        "Description": "Cat o'Nine Tales is the fifth collection of irresistible short stories from the master storyteller. Ingeniously plotted, with richly drawn characters and Jeffrey Archer's trademark of deliciously unexpected conclusions, this new collection has the added bonus of thirteen charming illustrations by the internationally acclaimed artist Ronald Searle. Some of these twelve stories were inspired by the two years Jeffrey Archer spent in prison, including the story of a company chairman who tries to poison his wife while on a trip to St. Petersburg---with unexpected consequences. \"The Red King\" is a tale about a con man who discovers that an English lord requires one more chess piece to complete a set that would be worth a fortune. In another tale of deception, \"The Commissioner,\" a Bombay con artist ends up in the morgue after he uses the police chief as bait in his latest scam. \"The Perfect Murder\" reveals how a convict manages to remove an old enemy while he's locked up in jail, and then set up two prison officers as his alibi. In \"Charity Begins at Home,\" an accountant realizes he has achieved nothing in his life, and sets out to make a fortune before he retires. And then there is Archer's favorite, \"In the Eye of the Beholder,\" in which a handsome star athlete falls in love with a three-hundred-pound woman . . . who happens to be the ninth-richest woman in Italy. Jeffrey Archer is the only author to have topped international bestseller lists with his fiction, nonfiction, and short stories. Cat o'Nine Tales is Archer at his best: witty, poignant, sad, surprising, and unforgettable.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "St Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "We've Always Had Paris...and Provence: A Scrapbook of Our Life in France",
        "Authors": "By Wells, Patricia and Wells, Walter",
        "Description": "Patricia Wells, long recognized as the leading American authority on French food, and her husband, Walter, live the life in France that many of us have often fantasized about. After more than a quarter century, they are as close to being accepted as \"French\" as any non-natives can be. In this delightful memoir they share in two voices their experiences—the good, the bad, and the funny—offering a charming and evocative account of their beloved home and some of the wonderful people they have met along the way. Full of the flavor and color of the couple's adopted country, this tandem memoir reflects on the life that France has made possible for them and explores how living abroad has shaped their relationship.Written in lyrical, sensuous prose and filled with anecdotes, insights, and endearing snapshots of Walter and Patricia over the years, We've Always Had Paris . . . and Provence beautifully conveys the nuances of the French and their culture as only a practiced observer can. Literally a moveable feast to be savored and shared, including more than thirty recipes that will delight readers and cooks alike, the couple's valentine to France and to each other is delicious in every way.",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Confederate Women",
        "Authors": "By Bell Irvin Wiley",
        "Description": "",
        "Category": "",
        "Publisher": "-",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Romans: Life and Customs",
        "Authors": "By E. Guhl, W. Koner",
        "Description": "",
        "Category": "",
        "Publisher": "Konecky & Konecky",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The Greeks: Life and Customs",
        "Authors": "By E. Guhl, W. Koner",
        "Description": "",
        "Category": "",
        "Publisher": "Konecky and Konecky",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Single Lens: The Story of the Simple Microscope",
        "Authors": "By Ford, Brian J",
        "Description": "Traces the history of the microscope, looks at how the first specimens were prepared by Antony van Leeuwenhoek in the seventeenth century, and describes how the microscope has shaped the development of science",
        "Category": " Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "24.26",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Franklin D. Roosevelt: Launching the New Deal",
        "Authors": "By Freidel, Frank",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "26.44",
        "Publish Date": {
            "Month": "September",
            "Year": "1973"
        }
    },
    {
        "Title": "Managing Software Development Projects: Formula for Success",
        "Authors": "By Whitten, Neal",
        "Description": "A guide to keeping software development projects on time and within budget. This book addresses project discipline, communication between the people involved in the project, schedules, quality, managing priorities, product specifications, testing, and project review. Each chapter begins with revealing stories that illustrate how specific problems can be traced through a project and its people.",
        "Category": " Computers , Software Development & Engineering , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Everything Kids' Nature Book: Create Clouds, Make Waves, Defy Gravity and Much More!",
        "Authors": "By Kowalski, Kathiann M.",
        "Description": "The natural world holds secrets under every rock and around every tree. If you've ever wondered what life is like through a microscope, telescope, or with the naked eye--you'll love this book!You will:Run with the antelope across the American plains and learn about the food chain.Climb with a monkey to the highest tree in the rainforest and discover how photosynthesis keeps leaves green.Sink to the bottom of the ocean to follow creatures who have adapted to life in total darknessTravel with a meteor at speeds up to 160,000 miles per hour.Burrow with the earthworms in your own backyard. Through it all, you'll find out how things synergize, regenerate, and evaporate--and lots more! And don't worry about the big words--they are all defined and explained with familiar examples in this fascinating trip through the natural world.",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Brotherhood of War 01: The Lieutenants",
        "Authors": "By Griffin, W.E.B.",
        "Description": "In 1943 Tunisia, Major Robert Bellmon, a tank commander, is captured by the Germans",
        "Category": "",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Grossman's Guide to Wines, Spirits, and Beers",
        "Authors": "By Grossman, Harold J.",
        "Description": "",
        "Category": "",
        "Publisher": "New York: Charles Scribner's Sons, 1964",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Learning to Love Again",
        "Authors": "By Krantzler, Mel",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Attracting Birds In The Maryland Piedmont",
        "Authors": "By Solem, Joanne K., Editor, et al.",
        "Description": "",
        "Category": "",
        "Publisher": "Howard County Chapter of the Maryland Ornithological Society",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "When Grandma Visited Alaska She ...",
        "Authors": "By Richter, Bernd And Susan",
        "Description": "",
        "Category": "",
        "Publisher": "Saddle Pal",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Rai Companion No. 1 1993",
        "Authors": "By comic",
        "Description": "",
        "Category": "",
        "Publisher": "Valiant Comics",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Resiliency Advantage: Master Change, Thrive Under Pressure, and Bounce Back from Setbacks",
        "Authors": "By Siebert, Al",
        "Description": "Resiliency—the ability to adapt to life&apos;s changes and crises—is key to a healthy, productive life. Based on his deep knowledge of the new science of resiliency, Dr. Al Siebert explains how and why some people are more resilient than others and how resiliency can be learned at any age. Through anecdotes, exercises, and examples, Dr. Siebert details a unique five-level program for becoming more resilient. You’ll learn how to: Sustain health, energy, and positive feelings during the worst of times, Improve your analytical, creative, and practical problem-solving skills, Strengthen your self-esteem, self-confidence, and self-concept, Develop the specific attributes and skills found in highly resilient people, and Sharpen your talent for serendipity—the ability to convert accidents and misfortune into lucky accidents and good fortune. The Resiliency Advantage will enable you to bounce back quickly from setbacks, gain strength from adversity, and meet life head on.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Mr. Doodle Had a Poodle / by Jane Belk Moncure ; Illustrated by Linda Hohag and Lori Jacobson",
        "Authors": "By Moncure, Jane Belk",
        "Description": "",
        "Category": "",
        "Publisher": "Mankato, Minnesota : Child’s World",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Nanny Goat's Boat",
        "Authors": "By Moncure, Jane Belk / illust.by Joy Friedman",
        "Description": "",
        "Category": "",
        "Publisher": "child's world 1988",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Cricket",
        "Authors": "By Brannon, Robert",
        "Description": "",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "iUniverse",
        "Price Starting With ($)": "10.83",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Brothers of the Gun",
        "Authors": "By Smith, Cotton",
        "Description": "When his brutal half-brother Star McCallister goes on a murderous spree of vengeance after he escapes from jail, killing two of John's friends and kidnapping his sister's children, former Texas Ranger John Checker travels into the heart of the wilderness to confront him, but along the way discovers a dark secret that could destroy him. Original.",
        "Category": " Fiction , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The River Where America Began: A Journey Along the James",
        "Authors": "By Deans, Bob",
        "Description": "The River Where America Began takes readers on a journey along the James River from the earliest days of civilization nearly 15,000 years ago through the troubled English settlement at Jamestown and finishes with Lincoln&#39;s tour of the defeated capital of Richmond in 1865. Deans traces the historical course of a river whose contributions to American life are both immeasurable and unique. This innovative history invites us all to look into these restless waters in a way that connects us to our past and reminds us of who we are as Americans.",
        "Category": " History , United States , State & Local , South (AL, AR, FL, GA, KY, LA, MS, NC, SC, TN, VA, WV)",
        "Publisher": "Rowman & Littlefield Publishers, Inc.",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Introduction to Research: Understanding and Applying Multiple Strategies",
        "Authors": "By Depoy, Elizabeth, Ph.D. and Gitlin, Laura N., Ph.D.",
        "Description": "INTRODUCTION TO RESEARCH provides the reader with a foundation from which to critique and understand research designs and their applications to healthcare and human service settings. It is divided into four parts: Introduction, Thinking Processes, Design Approaches, and Action Processes.  The text reflects a new school of thought that recognizes and values multiple research strategies.  This perspective proposes that naturalistic and experimental-type research strategies have equal value and contribute in complementary and distinct ways to a science of practice.  Knowledge of these different research traditions presents new opportunities for addressing the complex health-related research questions that are emerging in today's health and human service environments. Includes a well-balanced, detailed discussion of both qualitative and quantitative methodologies, which provides a comprehensive and equal focus.  Features significantly expanded discussions on specific design strategies to facilitate the reader's ability to compare, contrast and integrate these strategies.  Contains a new chapter organization for a more logical flow of content, which is divided into four parts: Introduction, Thinking Processes, Design Approaches and Action Processes.  Provides expanded use of research examples, making the book more appropriate for a variety of healthcare and human service disciplines.  Features a conceptual framework in which a graphic appears throughout the text to highlight and integrate the two research traditions from a process perspective.  The concept emphasizes that each research tradition must address 10 essential thinking and action processes.  These processes are thought about and solved differently, depending upon the particular research methodology being pursued. It brings clarity and understandability to the material and ties the book together.  Contains an expanded, comprehensive glossary to aid student understanding of a sometimes challenging subject.  Includes case studies and field stories to provide real-life \"snapshots\" of what it is like to participate in different types of research processes.  Includes key terms, chapter outlines and hands-on learning exercises in each chapter.  Appropriate for occupational therapy, chiropractic, physical therapy, speech pathology, nursing, social work and other healthcare and human service professions.",
        "Category": " Medical , Research",
        "Publisher": "Mosby",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Schreber case: psychoanalytic profile of a paranoid personality,",
        "Authors": "By Niederland, William G",
        "Description": "",
        "Category": "",
        "Publisher": "Quadrangle/New York Times Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Blood Game: An Eve Duncan Forensics Thriller",
        "Authors": "By Johansen, Iris",
        "Description": "First comes darkness, then comes fear Eve Duncan is back! Blockbuster New York Times bestselling author Iris Johansen’s latest thriller brings Eve closer to discovering her daughter’s killer…and into a web of danger from which she may not be able to escape… Eve Duncan returns in a thriller that pits her against the most evil mind she has ever encountered: a ruthless killer who taunts her with his every move…and who has a special affinity for blood. When a Georgia senator’s daughter is found murdered, and her body drained of blood, Eve Duncan is drawn into the web of Kevin Jelak—a serial murderer who is on Eve’s short list of killers who might know something about her missing daughter Bonnie. When a goblet of blood is found in Eve’s refrigerator, she knows the taunting is over…and the games have begun. As Eve and Jelak engage in a dance of death, Eve must call upon those she loves and trusts the most…even if it means bringing them into the game as well.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Solo Traveler: Tales and Tips for Great Trips, 1st Edition (Travel Guide)",
        "Authors": "By Lane, Lea",
        "Description": "A quarter of all travelers hit the road without a companion each year, whether for business or pleasure.  In this personal book, solo travel expert, Lea Lane, reveals the joys of the experience as well as its challenges, and dispels the stigma of traveling solo, covering such topics as:• Dining alone• Solo-friendly lodgings• Group and special-interest travel—including ditching the group• Socializing with locals and finding romance along the way• Traveling with pets• Smart ways to save and spendWith warmth and wit, the seasoned, and award-winning journalist, Lane helps readers conquer their fears, make intelligent choices, and appreciate solo travel not just as a different way to go, but the ultimate way to go.",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Flights of Angels: Stories",
        "Authors": "By Gilchrist, Ellen",
        "Description": "The critically acclaimed author of Victory Over Japan offers an anthology of twenty new short stories that range in setting from a Los Angeles medical clinic that caters solely to hypochondriacs to the home of a large southern family gathering to attend their patriarch's deathbed.",
        "Category": "",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Why We Suck: A Feel Good Guide to Staying Fat, Loud, Lazy and Stupid",
        "Authors": "By Leary, Denis",
        "Description": "The four-time Emmy-nominated comic satirist of Rescue Me presents irreverent cultural observations about how society is taking itself too seriously, in an account that shares anecdotes from his Irish-Catholic upbringing, high-pressure family life, and work as a performing artist. 200,000 first printing.",
        "Category": " Humor , Topic , Adult",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "The Seven Sins: The Tyrant Ascending (Michael Tiranno The Tyrant)",
        "Authors": "By Land, Jon",
        "Description": "To Dream...To Dare..To Win...The ancient motto, inscribed in Latin on a mysterious golden medallion, recovered from the ruins of the Roman Empire, has guided Michael Tiranno to heights few men have achieved. Once an orphaned farm boy in his native Sicily, Michael made millions by mastering the intricate world of high finance, and is now the fabulously wealthy owner of Las Vegas' The Seven Sins, the grandest and most extravagant casino in the world. The lavish resort embodies the personal philosophy fueled by his lust for power: the greater the risk, the greater the reward.But he also has secrets, secrets that he and Naomi Burns, his driven corporate attorney and confidante, have gone to great lengths to bury. When an enemy from the past threatens to undermine everything he has built, his dark history must now be uncovered. Together, they must tear open painful scars in Michael’s heart and soul to discover the true identity of their unknown foe—before all of Las Vegas pays the price for Michael Tiranno’s realized dreams.The Seven Sins is a globe-spanning saga of one man's spectacular rise from rags to riches, the sins that brought him there, and the insidious vendetta that may cost him everything.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Tiger Warrior (Jack Howard)",
        "Authors": "By Gibbins, David",
        "Description": "Two ancient cultures, a lost treasure from the distant past: what powerful secrets does it conceal—and how far will some go to possess them? Dive into a new full-throttle hunt from master of the action-adventure thriller David Gibbins, as he unleashes…The trail starts in the Roman ruins and leads to a shipwreck off the coast of Egypt. Soon the world’s top marine archaeologist, Jack Howard, and his team of scientific experts and ex-Special Forces adventurers are pushing their way through the mysterious jungles of India, following in the footsteps of a legendary band of missing Roman legionnaires. Meanwhile, at a remote lake in Kyrgyzstan, a beautiful woman has found evidence of a secret knowledge that has cost the lives of countless seekers through the centuries. And what Jack uncovers will lead him to dig not only into the ancient past but into his own family history. For over a century earlier his great-great-grandfather returned from an archaeological expedition in India forever traumatized by what he’d experienced. And in order to lay the past to rest, Jack will have to unearth an artifact that might have been better left buried—and with it a power that some of history’s most ruthless tyrants have sought to rule the world….",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Business decisions and technological change",
        "Authors": "By DIEBOLD, John",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Memories of My Melancholy Whores",
        "Authors": "By Garcia Marquez, Gabriel and Grossman, Edith (TRN)",
        "Description": "A New York Times Notable BookOn the eve of his ninetieth birthday a bachelor decides to give himself a wild night of love with a virgin. As is his habit–he has purchased hundreds of women–he asks a madam for her assistance. The fourteen-year-old girl who is procured for him is enchanting, but exhausted as she is from caring for siblings and her job sewing buttons, she can do little but sleep. Yet with this sleeping beauty at his side, it is he who awakens to a romance he has never known. Tender, knowing, and slyly comic, Memories of My Melancholy Whores is an exquisite addition to the master’s work.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Essential Finance Guide",
        "Authors": "By Robinson, Marc (EDT)",
        "Description": "A handy and practical resource for personal money management features an abundance of questionnaires, charts, and graphs designed to help with crucial financial decisions and to promote confidence for building financial security.",
        "Category": " Business & Economics , Personal Finance , Retirement Planning",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "7.47",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Design for Great-Day",
        "Authors": "By Foster, Alan Dean and Russell, Eric Frank",
        "Description": "A full-length expansion of the original 1953 novella follows the adventures of a lone human who must outwit two alien races bent on catastrophic war with one another. By the author of The Spoils of War.",
        "Category": " Fiction , Science Fiction , Adventure",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "LL Cool J's Platinum Workout: Sculpt Your Best Body Ever with Hollywood's Fittest Star",
        "Authors": "By O'Connell, Jeff, L. L. Cool J, and Honig, Dave",
        "Description": "LL Cool J's Platinum WorkoutLL didn't always have a diesel body—he chiseled it the old-fashioned way, with hard work and discipline. Here he shares the secrets of his transformation in a uniquely creative, yet no-nonsense regimen—enlivened with humor and sheer force of personality—that will inspire readers to enjoy working out as never before, while building a body they never thought possible. The book offers four levels of fitness, from Bronze to Platinum, including:- a 4-week beginner's program that takes inches off the waist and boosts energy-a 5-week program for intermediates that increases strength while maintaining muscular and cardiovascular endurance- an advanced 9-week program that turns the body into a muscle-building and fat-burning machine—complete with 6-pack abs and as much energy as LL Cool J- the hardcore 3-week fat-torching program LL used for the \"Control Myself\" video—a new level in ripped-to-the-bone fitness and sex appeal- a special 4-week \"Diamond\" program for women seeking to shape up fast for summer or an upcoming event- meal plans and recipes that fuel workouts while burning fat with food",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Delta Search: Quest for Tomorrow",
        "Authors": "By Shatner, William",
        "Description": "Young Jim Endicott has but one dream - to attend the Terran Space Academy, the gateway to the stars and the far-flung civilization known as the Confederation.But unbeknownst to Jim, he has a secret encoded in his DNA. A secret that threatens an empire.Jim's Academy application sets off an explosive chain of terror, hurling the young man into an adventure beyond his wildest dreams. In his new life, he plumbs the depths of the \"Pleb\" underclass of the galaxy's outcasts, and soars through the forbidden reaches of cyberspace.With the help of a beautiful fellow outlaw named Cat, who is as tough as she is tender, Jim begins to unravel the shocking truth about his own origins - and uncovers the fatal deception that has split a bitter humanity into warring factions bent on mutual annihilation.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Harper Prism",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Fields of Greens: New Vegetarian Recipes From The Celebrated Greens Restaurant: A Cookbook",
        "Authors": "By Somerville, Annie",
        "Description": "The opening of Greens Restaurant on San Francisco Bay in 1979 changed forever the image of vegetarian cooking in America.  From the restaurant's imaginative mix of casual elegance, exciting tastes, and a subtle message of health and harmony, a distinctive cuisine was born that has continued to bring joy to many thousands of diners every year as well as to the hundreds of thousands of readers who delight in The Greens Cookbook. In its latest incarnation, the restaurant has evolved toward a lighter, leaner, simpler cuisine, one that keeps all the spirit and refinement of the original menu but depends more on the excitement of sparkling fresh produce and its integral relationship to the dishes it inspires.In close to 300 original recipes, the new Greens style includes exuberant salads, soups, the legendary crusty Greens pizzas, curries and hearty stews, grilled vegetables, and intriguing turnovers made with filo pastry, tortillas, and savory doughs.  And of course there are heavenly breads and the famous desserts, like ginger pound cake with poached apricots and cherries.  This cornucopia of brilliant dishes focuses on tantalizing tastes, with a new simplicity, clarity, and liveliness as its hallmark.Annie Somerville, the executive chef at Greens, goes right to the heart of the matter: extraordinary produce that's bursting with flavor, color, and texture.  Some of her favorites--like crinkly Bloomsdale spinach, candy-striped Chioggia beets, succulent Rosefir potatoes--are highlighted in the text for gardeners and farmers' market aficionados.  But the Greens style is above all accessible; ordinary red beets will be just fine if more exotic varieties are unavailable.  To help with availability, there's information on locating farmers' markets throughout the country as well as sources for plants, seeds, and local resources.Because the garden is at the center of this book, readers are encouraged to try their hand, in tiny backyards and windowsill boxes if necessary.  Invaluable growing tips are offered from Green Gulch Farm, the source of much of the stunning produce served at the restaurant.  Other special features include a section on low-fat cooking and another on pairing wine with vegetarian food.All of the abundance and exuberance that the title Fields of Greens implies is here, for the novice as well as the expert, for simple last-minute meals as well as extravagant occasions.  For truly inspired contemporary vegetarian cooking, Fields of Greens is the essential sourcebook.Annie Somerville trained under Deborah Madison, the founding chef at Greens Restaurant.  Under Somerville's guidance as executive chef, Greens has become a culinary landmark.  Her work has been featured in Gourmet, Food & Wine, Ladies' Home Journal, SF, and California magazine.  She also contributed to The Open Hand Cookbook and Women Chefs cookbook.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Bantam",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Arthur's Eyes: An Arthur Adventure (Arthur Adventures (Paperback))",
        "Authors": "By Brown, Marc Tolon",
        "Description": "Tormented by his classmates' teasing over his new eyeglasses, Arthur the aardvark simply stops wearing them, a move that creates havoc when the nearsighted Arthur mistakes the girls' bathroom for the boys'",
        "Category": " Juvenile Fiction , Social Themes , Peer Pressure",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "When the Devil Dances (Posleen War Series #3)",
        "Authors": "By Ringo, John",
        "Description": "After five years of battling the Posleen invaders, human civilization is down to this: A handful of valleys in the Rocky Mountains, the Appalachians, Fargo, North Dakota and the Cumberland Basin. The scattered survivors in the Andes, the Himalayas, the Alps and the Gujarat can't be defined as civilization. They're just meat in a lobster-leg; tasty but too much bother to pull out.Only in the Cumberland Basin and the Ohio Valley do humans retain culture, philosophy and learning. Only in the Appalachians and the Rockies do the humans hold onto their shattered defenses. Only there do they create larger aud larger engines of war to oppose the hated Posleen. Only there do they have hope. As they wait for the return of their forces. As they pray for survival.After five years of battling the Humans, the Posleen are tired and angry. Humans don't fight fair. They hide and borrow like the pestiferous abat. They strike from above with their hated artillery and from behind with their long range reconnaissance. After five years of hammering their crocodilian heads on the Appalachian Wall, the Army Corps of Engineers, the armored combat suits of Fleet Strike and the steel-hard veterans of the Ten Thousand, even the Posleen are ready for a change. And the name for that change is Tulostenaloor. He was beaten in Aradan V. But he has learned. And this is his day.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    }
]