[
    {
        "Title": "The Constructivist Leader",
        "Authors": "By Lambert, Linda, Walker, Deborah, Zimmerman, Diane P., Cooper, Joanne E., Lambert, Morgan Dale, Gardner, Mary E., and Szabo, Margaret",
        "Description": "",
        "Category": " Education , Leadership",
        "Publisher": "Teachers College Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Feng Shui: Mind & Body & Spirit & Home. Control and Enhance the Energies of Your House, Garden, and Inner Self By Understanding and Using Proven Ancient Techniques",
        "Authors": "By Gill Hale and Mark Evans",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The American Quilt Story: The How-To and Heritage of a Craft Tradition : Step by Step Directions for 30 Antiques Quilts",
        "Authors": "By Seward, Linda and Jenkins, Susan",
        "Description": "Illustrates and tells the history of fifty quilts from the author's collection, and includes complete directions for thirty of them",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Spark Notes AP Power Pack: World History",
        "Authors": "By David Clark, Sharon Cohen, Mark Engler, Margaret Welles",
        "Description": "",
        "Category": "",
        "Publisher": "Spark Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Story of a Soul: The Autobiography of St. Therese of Lisieux (the Little Flower) [The Authorized English Translation of Therese's Original Unaltered Manuscripts]",
        "Authors": "By Therese de Lisieux",
        "Description": "",
        "Category": "",
        "Publisher": "ICS Publications",
        "Price Starting With ($)": "5.2",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Conscious Kitchen: The New Way to Buy and Cook Food - to Protect the Earth, Improve Your Health, and Eat Deliciously",
        "Authors": "By Zissu, Alexandra",
        "Description": "Your everyday food choices can change the world—and make meals taste better than ever  For anyone who has read The Omnivore’s Dilemma or seen Food, Inc. and longs to effect easy green changes when it comes to the food they buy, cook, and eat, The Conscious Kitchen is an invaluable resource filled with real world, practical solutions.  Alexandra Zissu walks readers through every kitchen-related decision with three criteria in mind: what’s good for personal health, what’s good for the planet, and what tastes great. Learn, among other things, how to: - Keep pesticides, chemicals, and other harmful ingredients out of your diet- Choose when to spend your dollars on organic fruit and when to buy conventionally grown- Avoid plastic—including which kinds in particular and why- Figure out what seafood is safe to eat and is sustainable- Use COOL (country of origin labels) to your advantage- Determine if a vegetable is genetically modified just from reading its PLU (price look up) code- Decipher meat labels in the supermarket- Cook using the least energy—good for the earth and your wallet- Eat locally, even in winter - Understand what “natural” and other marketing terms really mean- Buy packaged foods wisely Navigate farmers’ markets, giant supermarkets, and every shop in between to find the freshest and healthiest local ecologically grown and produced meat, dairy, fruits, and vegetables—no matter where you live With The Conscious Kitchen as your guide, you will never again stand in the market bewildered, wondering what to buy. You can feel confident you are making the best possible choices for you, your family, and our planet.  ALEXANDRA ZISSU writes about green living, food, and parenthood. She is the author of The Conscious Kitchen, coauthor of The Complete Organic Pregnancy, and contributes the “Ask an Organic Mom” column to The DailyGreen.com. Her stories have appeared in The New York Times, The Green Guide, Cookie, Details, Bon Appétit, Self, and Health, among other publications. She is also a public speaker and “greenproofer,” an eco-lifestyle consultant. Visit her website, www.alexandrazissu.com.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Great Snacks & Appetizers",
        "Authors": "By Broderick, Orla and Matthews, Robin (PHT)",
        "Description": "Great Snacks & Appetizers provides inspiration for today's harried but health-conscious gourmet, offering something quick and delicious for any occasion.Orla Broderick creates a mix of traditional and innovative dishes, whether for a quick weekday meal, or a sophisticated starter for an elegant dinner party. Recipes take their inspiration from the classics of world cuisine, from Empanadas and Garlic Mushrooms, to innovative creations using fashionable ingredients, like Sweet Potato Fritters and Tomato & Tapenade Crostini.Recipes are divided into five sections: Hot & Spicy, Fancy Finger Food, Fast & Easy, Light & Healthy and Bread Bites. All are written in a clear concise style, with something for every palate and every occasion.",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "Rizzoli",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Super-Charged Smoothies: More Than 60 Recipes for Energizing Smoothies",
        "Authors": "By Barber, Mary Corpening, Whiteford, Sara Corpening, Eastwood, Alison (CON), and Altman, Jenifer (PHT)",
        "Description": "Best-selling authors Mary Corpening Barber and Sara Corpening Whiteford are back with Super-Charged Smoothies, the high-octane follow-up to Smoothies and Super Smoothies. Just as lively and colorful as their previous Smoothies titles, this latest installment stands out with all-new recipes for delicious elixirs rich with the nutrient-packed, disease-fighting, life-changing superfoods that promote energy and vitality. Learn to mix, blend, and sip your way to a healthier life with fruits, vegetables, and base ingredients (such as Greek yogurt and kombucha) containing the phytochemicals, omegas, and probiotic and antioxidant qualities that make one look and feel better every day. Super-Charged Smoothies = fast + yummy + good for you.",
        "Category": " Cooking , Beverages , Juices & Smoothies",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "6.44",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Better Homes and Gardens Meals With a Foreign Flair",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Web Applications (Hacking Exposed)",
        "Authors": "By Shema, Mike, Scambray, Joel, Wong, David, and Sambray, Joel",
        "Description": "Get in-depth coverage of Web application platforms and their vulnerabilities, presented the same popular format as the international bestseller, Hacking Exposed. Covering hacking scenarios across different programming languages and depicting various types of attacks and countermeasures, this book offers you up-to-date and highly valuable insight into Web application security.    \"Required reading for Web architects and operators.\" -- Erik Olson, Microsoft Program Manager, Security, ASP.NET  \"Just as the original Hacking Exposed revealed the techniques the bad guys were hiding behind, Hacking Exposed Web Applications will do the same for this critical technology. Its methodical approach and appropriate detail will enlighten, educate, and go a long way toward making the Web a safer place in which to do business.\" -- from the Foreword by Mark Curphey, Chair of the Open Web Application Security Project   \"This is a serious technical guide that is also great reading -- scary enough to motivate folks to take Web security seriously but approachable enough to be an effective learning tool. Required reading for Web architects and operators.\" -- Erik Olson, Program Manager, Security, ASP.NET   \"What better way to defend against hackers than to understand the tools and techniques that are used to penetrate your site?  Hacking Exposed Web Applications offers a detailed look at common vulnerabilities within your applications and explains how to protect yourself from them.\" -- Mike Mullins, Ecommerce Security Engineer for a leading specialty apparel retailer  \"At last, your personal guide to preventing the next generation of security threats. This book explains in intricate detail how you can do everything right when it comes to network security and still be owned at the Web application layer.\" -- Chip Andrews, www.sqlsecurity.com   \"If you're involved in writing Web-based applications using ASP/ASP.NET, Java, JSP, PHP, or other languages, the Hacking Exposed series is something you DEFINITELY need to read.  Before writing one line of code, this book will spark ideas about how to design and secure your Web applications. There are techniques potential hackers could use that I've never even thought of! Great resource!\" -- Steve Schofield, Creator and Managing Editor, ASPFree.com",
        "Category": " Computers , Security , General",
        "Publisher": "McGraw-Hill Osborne Media",
        "Price Starting With ($)": "5.95",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Spring (The Seasons)",
        "Authors": "By Roca, Nuria and Curto, Rosa Maria (ILT)",
        "Description": "Large and beautiful color illustrations on every page of this book&#151;one in a brand-new four-volume series&#151;will appeal especially to early grades boys and girls. Kids will also love having the simply written descriptive text read to them as they gaze at the charming pictures&#151;and as they get just a little older, they’ll be able to read the text by themselves! Both words and pictures evoke the moods and activities of spring, and the illustrations show children at seasonal play",
        "Category": " Juvenile Nonfiction , Concepts , Seasons",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "My First ABC Board Book (My 1st Board Books)",
        "Authors": "By Zarick, Nicole (EDT)",
        "Description": "Helping children learn about letters and letter sounds, this is an amazing first word and picture book.  DK proudly reintroduces 10 favorite board books from the beloved My First series, all with beautifully redesigned covers for a fresh new look. Filled with full-color photographs and large, easy-to-read text, My First Board Books provide children with an excellent platform for early learning. A variety of first concepts, such as colors, numbers, letters, and more are introduced in a fun, informative way to help children build the vocabulary and basic language skills that form the foundation of learning.",
        "Category": " Juvenile Nonfiction , Concepts , Alphabet",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Winnie the Pooh Meets Tigger",
        "Authors": "By Milne, A. A.",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Needlework styles for period furniture",
        "Authors": "By Hanley, Hope",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Welcome, Baby!: Baby Rhymes for Baby Times",
        "Authors": "By Sweet, Melissa (ILT) and Calmenson, Stephanie",
        "Description": "Sing a song for baby.Sing a song of joy!We have a little girl!We have a little boy!This joyous book welcomes babies to the world and celebrates their daily lives from birth up to toddlerhood. Catchy poems you'll soon know by heart and sparkling pictures that will make you smile show babies growing and learning about themselves, their families, and the world around them.From diaper changes to playing \"horsey\" and from splashing in the tub to giving Mommy a good-morning kiss, the love, happiness, and fun that babies bring to our lives are captured perfectly by Stephanie Calmenson and Melissa Sweet in this special book, a gift to the babies we love.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Dictionary of Bullshit: A Shamelessly Opinionated Guide to All That Is Absurd, Misleading and Insincere",
        "Authors": "By Webb, Nick",
        "Description": "Bull shit (n.; adj,; adv.; etc.)1: deceitful language; lies 2: jargon or cliches intended to place a positive spin on something plainly negative 3: anything said by a politician, CEO or PR flak 4: new age, modern, postmodern, cutting edge, meta or Xtreme 5: pretty much everything you read or hear these days.A hilarious, irreverent and generally subversive compendium of what passes for discourse today, The Dictionary of Bullshit savages politics, self-help, marketing, the media, all things new age, statistics, science and business.From the political credibility gap (aka lying) to the oxymoronic instant classic, whether you're in a paperless office or have been out-sourced, The Dictionary of Bullshit is an all-out offensive against all that is phony, stupid and just plain meaningless.",
        "Category": " Language Arts & Disciplines , Linguistics , General",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Understanding Biological Psychiatry",
        "Authors": "By Hedaya, Robert J.",
        "Description": "He explains how biological psychiatrists consider the biology of the individual as an integral part of the whole picture and demonstrates a new way of conceptualizing clinical problems. The book has a practical bent, discussing, for example, when and how to refer to a psychiatrist, even describing how to explain this new perspective to a patient. The author’s conversational style, as well as many figures, tables, and case illustrations, makes Understanding Biological Psychiatry a guide that is sure to be well-read and often referred to by therapists and physicians.",
        "Category": " Psychology , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Book of Poisonous Quotes",
        "Authors": "By Jarman, Colin (COM)",
        "Description": "Savor the world's celebrated wits in this entertaining compilation of more than two thousand of the most caustic quips ever to scorch paper. Enduring satirists Voltaire, Mark Twain, and Oscar Wilde join the likes of Dorothy Parker and H. L. Mencken and present-day curmudgeons such as P. J. O'Rourke and Fran Lebowitz in waging hilarious verbal warfare, while hundreds of other critics, humorists, and sharp-tongued wags offer their cutting commentary on everything from Hollywood to the White House, from modern art to the battle between the sexes. Egos are exploded, reputations run ragged, idols impeached, and the classics challenged.Perfect for reference, repartee, or revenge, this anthology is a must for all who believe that the pen - and the tongue - is mightier than the sword.",
        "Category": " Reference , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "A Cousin's Prayer (Indiana Cousins Book 2) (Indiana Cousins, Book 2)",
        "Authors": "By Wanda Brunstetter",
        "Description": "",
        "Category": "",
        "Publisher": "bARBOUR",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Design of Things to Come: How Ordinary People Create Extraordinary Products",
        "Authors": "By Vogel, Craig M., Cagan, Jonathan M., and Boatwright, Peter",
        "Description": "The iPod is a harbinger of a revolution in product design: innovation that targets customer emotion, self-image, and fantasy, not just product function. Read the hidden stories behind BodyMedia's SenseWear body monitor, Herman Miller's Mirra Chair, Swiffer's mops, OXO's potato peelers, Adidas' intelligent shoes, the new Ford F-150 pickup truck, and many other winning innovations. Meet the innovators, learning how they inspire and motivate their people, as they shepherd their visions through corporate bureaucracy to profitable reality.  The authors deconstruct the entire process of design innovation, showing how it really works, and how today's smartest companies are innovating more effectively than ever before.",
        "Category": " Technology & Engineering , Nanotechnology & MEMS",
        "Publisher": "Wharton School Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Clair: Four Screenplays",
        "Authors": "By Clair, Rene",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "8.72",
        "Publish Date": {
            "Month": "August",
            "Year": "1970"
        }
    },
    {
        "Title": "Cases in Global Marketing Strategies.",
        "Authors": "By Jean-Pierre Jeannet, H. David Hennessey",
        "Description": "",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Sister Wendy's Meditations on Love",
        "Authors": "By Beckett, Wendy",
        "Description": "Explores the spiritual message about love contained within nineteen works of art",
        "Category": " Self-help , Meditations",
        "Publisher": "DK",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Chasing the High: A Firsthand Account of One Young Person's Experience with Substance Abuse (Adolescent Mental Health Initiative)",
        "Authors": "By Keegan, Kyle and Moss, Howard B., M.D.",
        "Description": "Kyle Keegan was like many teenagers: eager to fit in at school, he experimented with alcohol and drugs. Soon, his abuse of these substances surpassed experimentation and became a ruthless addiction to heroin that nearly destroyed his life.Now in recovery, Keegan tells his remarkable story in Chasing the High. Starting with the early days of alcohol and drug use, Keegan charts his decline into crime and homelessness as his need for heroin surpassed all thoughts of family and friends, of right and wrong. He then goes on to use these experiences to offer guidance and practical advice to other young people who may be struggling with substance abuse.  In straightforward, easy-to-understand language and along with the psychiatric expertise of Howard Moss, MD, Keegan discusses what is known about the neurobiology of addiction in young people, how to seek treatment, and how to get the most out of professional help.  He also covers such topics as therapies which are used to combat addiction, how to talk to families and friends about substance abuse, and how to navigate risky situations.  Both an absorbing memoir and a useful resource for young people.Part of the Adolescent Mental Health Initiative series of books written specifically for teens and young adults, Chasing the High offers hope to young people who are struggling with substance abuse, helping them to overcome its challenges and to go on to lead healthy, productive lives.",
        "Category": " Young Adult Nonfiction , Social Topics , Drugs, Alcohol, Substance Abuse",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Understanding the Occult (Handbook of Today's Religions / Josh McDowell)",
        "Authors": "By McDowell, Josh and Stewart, Don",
        "Description": "",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Here's Life Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "God's Blueprint for Bible Prophecy: Daniel (The International Inductive Study Series)",
        "Authors": "By Arthur, Kay",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Total Workday Control Using Microsoft Outlook: The Eight Best Practices of Task and E-Mail Management",
        "Authors": "By Linenberger, Michael",
        "Description": "Total Workday Control Using Microsoft Outlook is a book for the over-extended office worker whose workday is out of control. It shows how to regain command of an over-committed workday and an overflowing, unmanaged e-mail in box. It does this by teaching the author's eight best practices of time, task, and e-mail management, and showing how to implement these in Microsoft Outlook.",
        "Category": " Computers , Enterprise Applications , General",
        "Publisher": "New Academy Publishers",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Stage Makeup",
        "Authors": "By Corson, Richard",
        "Description": "Widely referred to as the “bible of stage makeup,” the timely revision of this classic text addresses principles and techniques in the use of makeup for the contemporary performer.This extensive exploration of the application and use of stage makeup and makeup for a variety of performance venues covers all aspects in detail and contains over 400 photographs, drawings, and diagrams demonstrating step-by-step procedures. Thoroughly updated and revised, this classic text remains accurate and comprehensive, providing information from which all readers – whether students to the field or seasoned, professional makeup artists – will benefit.New to this edition:Updated photography throughout.Features the latest information on products and techniques throughout.New additions to chapters concerning hairpieces and wigs: making a pattern for a beard and mustache, making a pattern for a wig, fronting a wig, or sending accurate information for rentals, and the basic roller set for wigs.The source Appendix has been totally updated with new vendors and the latest website addresses.The materials Appendix has had the most current products added.There are new, blank makeup charts for class work and designing makeups.There is a color guide for a two-part silicone life cast.The new color section featuring Academy Award nominee, Christien Tinsley, steps for the Tinsley Transfers for cuts, bruises and prosthetics. (As seen in the movie The Passion Of The Christ.)A selection of makeup in color with complete instructions.Color photos of Academy Award winner, Matthew Mungle, special effects makeup for the CSI television show.Instructions for a new “creating a likeness” of Queen Elizabeth I.The Film and Television chapter now includes information about working with the latest HD digital technology.The color section now includes a series of photos illustrating the effects of gel colors on natural makeup.",
        "Category": " Performing Arts , Theater , General",
        "Publisher": "Taylor & Francis",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "Toning for Teens: The 20 Minute Workout That Makes You Look Good and Feel Great",
        "Authors": "By Vedral, Joyce L.",
        "Description": "Flat Abs. Tight Butt. Lean Thighs. Kickass Attitude. Get One Great Body! Have you been looking in the mirror and thinking, \"I hate my...I can't stand those...I have to hide my...\"? Do you want to feel strong and confident in whatever you wear, from jeans to a halter top? No matter what shape you're in now-star athlete or gym class wallflower, string bean, jelly belly, or chunky monkey-you can be fit and fabulous, safely and without starving yourself. America's #1 Fitness Expert, Joyce Vedral, has helped thousands of teens create their best body. Her foolproof techniques are designed to produce a tight, toned, dynamite figure-and you can start using them right now! The secret is not dieting obsessively. It is working out with Joyce's special toning program and eating right. In fact, with Joyce's daily food plan, you will probably eat more than you do now-but lose fat from the first day. And her 20-minute workout with weights is not only fun, but gives you visible results fast! With her program, you can: * Get a better body in just 3 weeks...and a terrific body in just 12 weeks! * Develop a figure that's firm and toned instead of soft and flabby * Burn fat...even in your sleep! * Get rid of cellulite * Go down a dress size every 3 weeks if you are overweight * Boost metabolism so you can eat more-without getting fat * Build exciting new strength, balance, and stamina, but no bulky muscles * Increase self-discipline to promote success in all areas of your life!",
        "Category": " Young Adult Nonfiction , Health & Daily Living , Fitness & Exercise",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Life Organizer: A Woman's Guide to a Mindful Year",
        "Authors": "By Louden, Jennifer",
        "Description": "Meeting with clients, hauling the kids to soccer, supervising the kitchen remodel — women today juggle so many commitments that many don’t find time to focus on their own dreams. First created for her own needs, Jennifer Louden’s Life Organizer is a datebook for the soul that helps women create the life they want. Divided into four sections, the first part defines “inner organizing” and explains how to use the book. Next, Louden defines “time monsters,” “minimum requirements,” “shadow comforts,” and other pertinent concepts. Fifty-two two-page spreads, one for each week of the year, include prompts for goal-setting and soul exploration. Stories accompanying each section show how other women have used the organizer to make a time for inner play and for finding the soul’s purpose. Most of all, the book helps women hold themselves gently accountable, giving them ideas to explore their inner needs and a place to record the progress they’ve made.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "New World Library",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "What's Age Got to Do With It?: Living Your Healthiest and Happiest Life",
        "Authors": "By Mcgraw, Robin",
        "Description": "Though it's her husband, Dr. Phil, who has his own nationally-syndicated talk show, Robin McGraw's appearances on the show draw thousands of questions from viewers of all ages who want to know how she looks and feels so fabulous at the age of fifty-five. In What's Age Got to Do with it?, Robin shares her journey, including the ups and downs, and the secrets for staying healthy and in shape.She also provides insider information from a panel of top experts in the areas of Fitness, Nutrition, Skin Care, Menopause, Hair, Makeup, and Fashion.Robin says, \"To me, aging gracefully isn't accepting what aging does to you. It means taking care of your health, wanting to look your best, and knowing that it is not conceited, egotistical, or selfish to do so.\"All rights reserved. No portion of this book may be reproduced, stored in a retrieval system, or transmitted in any form or by any means---electronic, mechanical, photocopy, recording, or any other---except for brief quotation in printed reviews, without the prior written permission of the publisher.This publication is intended to provide authoritative information in regard to the subject matter covered. The publisher and author are not engaged in rendering medical or other professional services and do not have financial or commericial interest in any of the products, services, or professionals mentioned in this book. If you require medical advice or other expert assistance, you should seek the services of a competent professional.If you've had these or similar thoughts, you're not alone. Robin McGraw receives thousands of emails from women asking her what she does to look and feel so vibrant, energetic, and healthy at the age of fifty-five. It all started back in Robin's twenties and thirties when pivotal moments made her realize that if she did not put her health and well-being first, no one else would. In her early thirties, Robin experienced the sudden death of her mother, a wonderful woman who put the needs of her family above her own and, as result, didn't know that her health was ailing. This tragedy made Robin realize that in order to be the best wife, mother, and woman possible, she had to take care of herself as if her life depended on it.Robin says, \"I wrote this book, not only to answer questions about what I do to stay healthy and in shape, but to remind women that it's time to move yourself to the top of your list of priorities. It's never too early to start taking care of yourself, but it's also never, ever too late.\"",
        "Category": " Self-help , Aging",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Fully Devoted",
        "Authors": "By Ortberg, John, Pederson, Laurie, and Poling, Judson",
        "Description": "What does it mean to do everything \"in Jesus’ name\"? Is that an ideal attainable only by a few \"super Christians\"--or is it a way of life we can all experience?Leader’s guide included!Fully Devoted group sessions are:What Is True Spirituality?GraceGrowthGroupsGiftsGiving\"We Know Him Well . . . \"",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "HarperChristian Resources",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The German Way : Aspects of Behavior, Attitudes, and Customs in the German-Speaking World",
        "Authors": "By Flippo, Hyde",
        "Description": "For All Students Ideal for a variety of courses, this completely up-to-date, alphabetically organized handbook helps students understand how people from German-speaking nations think, do business, and act in their daily lives.",
        "Category": " Travel , Europe , Germany",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Funtastic Math! Decimals and Fractions (Grades 4-8)",
        "Authors": "By Mitchell, Cynthia",
        "Description": "Ready-to-use activities, games, and reproducibles that will make teaching?and learning?about fractions and decimals fun for everyone. Students can visit the \"\"Mysterious Fration Zone\"\" to learn about equivalent fractions, play \"\"Shout It Out\"\" to practice adding and subtracting fractions, and review place value by solving a puzzle. Packed with creative and fun teaching ideas, plus assessment tips. Geared to the NCTM Standards. For use with Grades 4-8.",
        "Category": " Juvenile Nonfiction , Mathematics , Fractions",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Gift and Mystery: On the Fiftieth Anniversary of My Priestly Ordination",
        "Authors": "By John Paul II, Pope",
        "Description": "\"In Gift and Mystery we read 'For every priest, in every age, the greatest task is each day to discover his own priestly \"today\" in the \"today\" of Christ.' John Paul II understands that the event of the Incarnation of Jesus Christ in world history continues daily in a special way in the priestly brotherhood of those who have been chosen to follow in his footsteps--and indeed in every man and woman, all called through the gift of faith to a life of holiness. In concluding Gift and Mystery, the pope writes to his brother priests, 'Learn to see in your priesthood the Gospel treasure for which it is worth giving up everything.' Surely in the life of this pope we see an extraordinary example of someone who has treasured the gift of his priestly ministry for more than fifty years.\"- From the foreword of Carl A. Anderson, Supreme Knight, Knights of Columbus",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Image",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Cats of the World",
        "Authors": "By Natoli, Eugenia",
        "Description": "Features detailed chapters on the evolution and genetics of the cat, on the different breeds and their special characteristics, as well as discussions of training, behavior at home and on their own, and general care",
        "Category": " Technology & Engineering , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Child of Grace",
        "Authors": "By Copeland, Lori",
        "Description": "E. J. has built a successful career for herself, but is struggling with an unwanted pregnancy. She runs home to Cullen's Corner with her own intentions, yet in the quiet of her hometown she reconnects with family and God and discovers his plans for her life.",
        "Category": " Comics & Graphic Novels , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Sensation and Perception",
        "Authors": "By Goldstein, E. Bruce",
        "Description": "Long regarded as the gold standard in sensation and perception texts, E. Bruce Goldstein's SENSATION AND PERCEPTION has helped more than 100,000 students make the connection between perception and physiology. Goldstein has crafted an easier-to-understand, and more student-friendly book, without sacrificing the text's comprehensive examination of sensation and perception. Goldstein takes readers on an intriguing journey through their senses, and chronicles scientists' efforts to understand the fascinating behind the scenes activity that allows us to perceive. With balanced coverage of all senses, this book offers an integrated examination of how the senses work together. Goldstein shows readers how seemingly simple experiences are actually extremely complex mechanisms and examines both the psychophysical and physiological underpinnings of perception. All material is presented in a way students find interesting and easy to follow. The book's visually dynamic presentation includes numerous color plates that are presented as visual topic essays. In addition, more than 50 hands-on demonstrations illustrate perceptual experiences. All are simple enough for students to do and are seamlessly integrated into the flow of the text.",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Happy Hanukkah Rebus",
        "Authors": "By Adler, David A. and Palmer, Jan (ILT)",
        "Description": "Young children will understand more of their own Jewish heritage as they share their curiosity with Sharon, a modern little girl, and learn with the aid of pictures, symbols, and text",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Lusty Scripps: The Life of E. W. Scripps [1854-1926]",
        "Authors": "By Gardner, Gilson",
        "Description": "",
        "Category": "",
        "Publisher": "Vanguard Press",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1932"
        }
    },
    {
        "Title": "The Red Horse: A Novel",
        "Authors": "By Corti, Eugenio",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Ignatius Pr",
        "Price Starting With ($)": "6.46",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Hot Flash Club Chills Out: A Novel",
        "Authors": "By Thayer, Nancy",
        "Description": "Since opening up their day spa, The Haven, the wonderful women of the Hot Flash Club have been busy indulging the beleaguered, nerve-frazzled throngs. Now, in Nancy Thayer’s hilarious new Hot Flash novel, it’s the friends’ turn to grab some soothing, and much-deserved R&R.When a long-time Haven client asks the gals to housesit her Nantucket hideaway for the summer, they’re beyond thrilled; the cozy island enclave is the perfect place to shop, swim, chill, and plan Marilyn’s upcoming wedding to Ian, her Scottish fiancé. And Marilyn desperately needs the break, since Ian’s grown son has crashed at the couple’s place with no departure date in sight.Soon after they arrive, the other hot flashers surrender to their own summer flings: Shirley entertains a steamy dalliance with a scruffy, sexy local fisherman that could lead to something deeper; Faye finds her dream house, but restoring it could be a costly nightmare; craft-maven Polly is enthralled by the island’s bounty, from shell art to lightship baskets; and even hardboiled Alice swoons with romantic adventure–or is it seasickness?But this lovefest among the sand and ocean breezes is not without its consequences. Each woman must determine for herself what she is willing to give up in order to hold onto what she has found–and all of them fear that Shirley is on the brink of making a huge mistake, one that threatens their harmony and their business. But these concerns may be eclipsed by the mystery surrounding the disappearance of family heirlooms at the house where they are staying, and rumors that the place harbors spirits other than Grey Goose and Tanqueray.Nancy Thayer continues her hugely successful Hot Flash series with this wickedly funny, delightfully bawdy tale. These irresistible women spring to life–along with their passions, their sorrows, their joys, and, most importantly, their friendship. So pack your bags and join these fabulous five for a season of fun, sun, love, sex, and estrogen therapy.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Communication Systems",
        "Authors": "By Carlson, A. Bruce:",
        "Description": "",
        "Category": " Technology & Engineering , Electrical",
        "Publisher": "Mcgraw-Hill College",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "50 Chowders: 50 Chowders",
        "Authors": "By Wolff, Glenn (ILT) and White, Jasper",
        "Description": "When most of us think of chowder, New England-style fish or clam chowder is what comes to mind, but they are only two of the dozens of home-style chowders you can make from this book. Once you discover the diversity of ingredients you can cook into a chowder and see the scope of styles and colors open to you, you will wonder how we ever came to think there were only one or two chowders in the world.Authentic chowder is characterized by generous chunks of local seasonal ingredients served in a moderate amount of broth. Another basic characteristic of chowder is its ease of preparation—even chowders that take more than an hour to make don't require anything more than keeping an eye on the pot. A big pot of chowder is perfect for a large gathering of family and friends, and because chowder truly is best when made ahead, you'll have plenty of time to enjoy your company. 50 Chowders is the first hardcover cookbook to explore the many interpretations of chowders. On the familiar side, you will find a recipe for Corn Chowder explained with the kind of detail that ensures a sweet, mellow broth, succulent chunks of potatoes, and fresh golden kernels of corn. On the exotic side, there is a recipe for San Francisco Crab “Meatball” Chowder, an exciting dish whose deep and robust flavors make it really quite special. Here are a few of the more than fifty other chowders you will find: Shaker Fresh Cranberry Bean Chowder, Nova Scotia Lobster Chowder, Nantucket Veal Chowder, Pacific Northwest Salmon Chowder, and nine different clam chowders. Among this book's unique features: A chapter of chowder companion dishes, from Parker House Rolls to Buttermilk Biscuits; more than fifty illustrations of important cooking techniques and chowder ingredients; cook's notes for each recipe, giving possible substitutions, required equipment, and serving suggestions; a list of reliable mail-order suppliers of seafood and other chowder ingredients. Jasper White brings to 50 Chowders the same enthusiasm and flair that made his previous book, Lobster at Home, “like having a Down Easter by your side, distilling years of experience and telling you just what to do” (Corby Kummer of The Atlantic Unbound). With this treasure trove of information and expertise in your kitchen, you will never think of chowder in the same way again.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Lost Art of the Great Speech: How to Write One--How to Deliver It",
        "Authors": "By Dowis, Richard",
        "Description": "\"Splashy slides, confident body language, and a lot of eye contact are fine and well. But if a speech is rambling, illogical, or just plain boring, the impact will be lost. Now everyone can learn to give powerful, on-target speeches that capture an audience's attention and drive home a message. The key is not just in the delivery techniques, but in tapping into the power of language. Prepared by an award-winning writer, this authoritative speech-writing guide covers every essential element of a great speech, including outlining and organizing, beginning with a bang, making use of action verbs and vivid nouns, and handling questions from the audience. Plus, the book includes excerpts from some of history's most memorable speeches--eloquent words to contemplate and emulate.\"",
        "Category": " Business & Economics , Skills",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Gorgeously Green : 8 Simple Steps to an Earth-Friendly Life",
        "Authors": "By Uliano, Sophie and Roberts, Julia (FRW)",
        "Description": "Are you confused by all the advice you hear and see daily on how to \"go green\"? Do you want to incorporate earth-friendly practices into your life, but you don't know where to start? Don't stress! Green guru Sophie Uliano has sorted through all the eco-info out there and put everything you need to know about living a green lifestyle right at your fingertips.In Gorgeously Green, Sophie offers a simple eight-step program that is an easy and fun way to begin living an earth-friendly life. Each chapter covers topics from beauty to fitness, shopping to your kitchen—even your transportation. Whether it's finding the right lipstick, making dinner, buying gifts, or picking out a hot new outfit, finally, there is a book that tackles your daily eco-challenges with a take-charge plan. Just consider Sophie your go-to girl with all the eco-solutions. Find out how to: Green your entire beauty regimeDetoxify your homeIndulge in guilt-free shoppingAdopt a home fitness routinePrepare eco-licious treatsGive your kitchen a green makeoverBecome more aware of your impact on the earthThe book's dozens and dozens of eco-friendly tips, products, and practices combine to form a treasure trove of practical advice for every possible way to become stylishly green. Your questions about dressing, makeup, eating, shopping, cleaning, travel, and more are all answered right here.Adopting a green lifestyle is among the most positive, forward-thinking, and personally fulfilling choices that anyone can make—and Gorgeously Green shows that it doesn't have to be tedious, time-consuming, or glamourless!",
        "Category": " Science , Environmental Science",
        "Publisher": "WmMorrowPB",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Mel Bay's modern guitar method grade 1",
        "Authors": "By Bay, Melbourne Earl",
        "Description": "",
        "Category": "",
        "Publisher": "Mel Bay Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Six Steps to Spiritual Revival: God's Awesome Power in Your Life (LifeChange Books)",
        "Authors": "By Robertson, Pat",
        "Description": "Have you lost sight of the dreams God placed in your heart long ago? Revival will bring back to life those brittle, bruised, or dormant areas within you. Examining the steps to revival that God gave to King Solomon, Pat Robertson reveals an amazing Scriptural pattern. He describes radical transformations that occur when people hunger for God's presence and become living sacrifices of praise. Now -- as you radiate knowledge of God, others will be drawn to the fire of His presence. The unique qualities God placed within you before you were born will begin to bloom and bear fruit for His glory!",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The All-New Atkins Advantage: The 12-Week Low-Carb Program to Lose Weight, Achieve Peak Fitness and Health, and Maximize Your Willpower to Reach Life Goals",
        "Authors": "By Trager, Stuart L., M.d. and Heimowitz, Colette",
        "Description": "The proven diet that will slim you down, get you exercising, and change your lifeThe All-New Atkins Advantage is more than a diet: it features the Atkins proven-effective weight loss program in a 12-week, step-by-step plan, including instructions on how to incorporate healthy exercise into your life as well as guidance on maintaining the motivation to stick with the diet and exercise program.Each week builds on the one before it to raise your level of competence and confidence:Week 1: Combat cravings for sugars and starches with tasty, low-carb alternatives like veal parmesan and trout almondine.Week 4: Achieve peak fitness with the Atkins approach to exercise. Fully illustrated stretching, cardio, and strength training plans will get you energized.Week 6: Start an Atkins journal to maintain your motivation and continue your enthusiasm and success.Week 9: Get out of your lunch rut! Go out for a special but speedy meal at a restaurant, instead of the nearby deli.Week 12: All the work you’ve done thus far has prepared you for this moment: the beginning of the rest of your life!Turn your life around and give yourself a dietary, exercise, and lifestyle makeover with THE ALL-NEW ATKINS ADVANTAGE.The All-New Atkins Advantage will allow you to enjoy a wider variety of foods, tailor an individualized exercise plan, and do Atkinsyour way.The step-by-step program is designed to allow you to move at your own pace.Part I introduces you to the basics of the Atkins program, from a list of foods you'll want to have on hand to mental exercises to get you motivated.Part II features the 12-week Atkins Advantage Program, including a fitness component that allows you to design your own workout, no matter what your level of fitness.Part III includes 12 weeks' worth of delicious daily meal plans at varying carbohydrate levels.At the end of the twelve weeks, you will have changed the way you eat and become healthier, slimmer, and happier.STUART L. TRAGER, M.D. is a board certified orthopedic surgeon. He is an eight-time Ironman and a top ten finisher at the Ultraman World Championship who credits the Atkins Nutritional Approach for helping him achieve peak fitness and health.COLETTE HEIMOWITZ, M.Sc., has been featured on national television networks such as NBC, ABC, CBS, CNN, Fox News Channel, and MSNBC, and on radio programs across the country.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "St Martin's Press",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The Coupon Mom's Guide to Cutting Your Grocery Bills in Half: The Strategic Shopping Method Proven to Slash Food and Drugstore Costs",
        "Authors": "By Nelson, Stephanie",
        "Description": "A book that pays for itself! The creator of couponmom.com, with 1.6 million subscribers and counting, shares her strategic money-saving techniques for saving big while living wellAmericans are hungry for bargains these days, but one woman has developed the ultimate strategy for enjoying a feast of savings. Taking the nation by storm, with appearances ranging fromThe Oprah Winfrey Show Stephanie Nelson has shown countless women and men how to save thousands of dollars by becoming savvy coupon clippers-without sacrificing nutrition or quality. Now, inThe Coupon Mom's Guide to Cutting Your Grocery Bills in Half, Nelson demonstrates all of the tricks of the trade-beyond coupons and tailor-made for a variety of shopper lifestyles. Whether you're a \"busy\" shopper and have only a small amount of time each week to devote to finding the best deal; a \"rookie\" shopper who is ready to put more effort into cutting bills; or a seasoned \"varsity\" shopper who is looking for new ways to get the deepest discounts possible, this book offers techniques thatw ill make it easy to save money at any level and on any timetable. Extending her Strategic Shopping protocols to mass merchandisers, wholesale clubs, natural-food stores, drugstores, and other retailers, Nelson proves that value and variety can go hand in hand. With meal- planning tips, recipes, and cost-comparison guides, as well as inspiring real-life stories from the phenomenal Coupon Mom movement, this is a priceless guide to turning the checkout lane into a road of riches.Watch a Video",
        "Category": " Reference , Consumer Guides",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Winning Words of Champions",
        "Authors": "By Bielat, Larry",
        "Description": "",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "Testament",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "From Russia to the USSR: A Narrative and Documentary History",
        "Authors": "By Vaillant, Janet, Richards, John",
        "Description": "",
        "Category": "",
        "Publisher": "Longman Publishing Group",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Tales from the Boston College Sideline",
        "Authors": "By Flutie, Doug (FRW) and Oslin, Reid",
        "Description": "Many people do know that Boston College's most embarrassing football defeat may have saved the lives of hundreds of Eagles fans. They may also not know that Doug Flutie failed to see a wide-open receiver and instead heaved the ball to an apparently well covered Gerard Phelan to complete the \"Miracle in Miami.\" The stories behind those little known facts and many more are contained in Tales from the Boston College Sideline, an anecdotal history of Boston College football. Author Reid Oslin, who served as Boston College's sports information director for nearly a quarter of a century, has collected scores of stories about the many accomplishments--and occasional downfalls--of the Boston College Eagles. Material from the University Archives, dozens of personal interviews, and the author's own up-close recollections will make Tales from the Boston College Sideline a valuable resource--as well as enjoyable history--for any BC fan.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Sports Publishing LLC",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Democracy's Good Name: The Rise and Risks of the World's Most Popular Form of Government",
        "Authors": "By Mandelbaum, Michael",
        "Description": "The last thirty years have witnessed one of the most remarkable developments in history: the rapid rise of democracy around the world. In 1900, only ten countries were democracies and by 1975 there were only 30. Today, 119 of the world’s 190 countries have adopted this form of government, and it is by far the most celebrated and prestigious one.  How did democracy acquire its good name? Why did it spread so far and so fast? Why do important countries remain undemocratic? And why do efforts to export democracy so often fail and even make conditions worse?  In Democracy’s Good Name, Michael Mandelbaum, one of America’s leading foreign policy thinkers, answers these questions. He surveys the methods and risks of promoting democracy, and analyzes the prospects for the establishment of democratic governments in Russia, China, and the Arab world.  Written in Mandelbaum’s clear and accessible style, Democracy’s Good Name presents a lucid, comprehensive, and surprising account of the history and future of democracy from the American Revolution to the occupation of Iraq.",
        "Category": " Political Science , Political Ideologies , Democracy",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "53.96",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Maine Moose Watcher's Guide",
        "Authors": "By Silliker, Bill, Lemke, Richard L.",
        "Description": "",
        "Category": "",
        "Publisher": "RL Lemke Corp.",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Robert Ludlum's The Bourne Legacy",
        "Authors": "By Lustbader, Eric Van",
        "Description": "",
        "Category": "",
        "Publisher": "St Martin's Press",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Heirs of the Motherland (The Russians)",
        "Authors": "By Pella, Judith",
        "Description": "Count Dmitir Remizov returns to Russia after eighteen years of exile, while Sergei and Anna, still hiding in Katyk, must decide whether to return to St. Petersburg",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Making Saints: How the Catholic Church Determines Who Becomes a Saint, Who Doesn't, and Why",
        "Authors": "By Woodward, Kenneth L.",
        "Description": "From inside the Vatican, the book that became a modern classic on sainthood in the Catholic Church.Working from church documents, Kenneth Woodward shows how saint-makers decide who is worthy of the church's highest honor. He describes the investigations into lives of candidates, explains how claims for miracles are approved or rejected, and reveals the role politics -- papal and secular -- plays in the ultimate decision. From his examination of such controversial candidates as Archbishop Oscar Romero of El Salvador and Edith Stein, a Jewish philosopher who became a nun and was gassed at Auschwitz, to his insights into the changes Pope John Paul II has instituted, Woodward opens the door on a 2,000-year-old tradition.",
        "Category": " Religion , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Fitness Walking For Dummies",
        "Authors": "By Neporent, Liz",
        "Description": "Call it power walking, fitness walking, or just plain walking. Indoors or out, walking is one of the healthiest and most rewarding forms of exercise available to all sorts of people, young and old. In fact, walking burns about the same number of calories per mile as running (and it's a lot easier on your knees). Walking is one of the most adaptable workout activities around – you can walk for an hour straight to make your walking program effective and to achieve your goals, or you can accumulate this hour over the course of a day.Fitness Walking For Dummies is for anyone who wants to start an exercise program but may not have the knowledge or motivation to do it. If you're already a walking fanatic, you'll find out how to become a better fitness walker. This easy-to-understand guide is also for those who are on track toLose weightDecrease blood pressureControl cholesterolRelieve stressPrevent heart diseaseDeal with depressionExplore what it takes to begin an exercise program by setting goals, choosing shoes, and considering nutrition to optimize your workout. Fitness Walking For Dummies also covers the following topics and more:Warm-up and cool-down routinesStrength trainingThe four levels of walking: Lifestyle, Fitness, High-Energy, Walk-RunWeight-training routines and stretches that add varietyBuying and using a treadmillAge, pregnancy, and walking with your dogDealing with pain and injuriesLike 67 million other people in the United States who log over 201 million miles a year, you want to take advantage of all of the great things a regular walking program can do for you. Whether your goal is to improve your health or your appearance, lose weight, get stronger, feel good about yourself, or all of the above, walking can help you get to where you want to go. This book can help you do that by showing you everything you need to know about starting and maintaining a walking program.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Catholic Viewpoint On Censorship.",
        "Authors": "By H. G. Gardiner",
        "Description": "",
        "Category": "",
        "Publisher": "Image Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Teaching English Abroad: Talk Your Way Around the World! (4th ed)",
        "Authors": "By Griffith, Susan",
        "Description": "Describes teaching opportunities for native speakers of English",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Vacation-Work",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Microsoft® Office SharePoint® Server 2007 Administrator's Companion (Resource Kit)",
        "Authors": "By English, Bill and Microsoft Sharepoint Community Experts",
        "Description": "Get your mission-critical collaboration and information-management systems up and running with this essential, single-volume guide. This comprehensive reference details features and capabilities of SharePoint Server 2007. It delivers the easy-to-follow procedures, practical workarounds, and key troubleshooting tactics you need for on-the-job results. Discover how to:Install and deploy SharePoint Server 2007 Configure server farms and define a farm topology Create and manage content libraries, records repositories, and document workflowsManage enterprise search and indexing featuresDevelop and implement an information security policyConfigure other server platforms to work with SharePoint Server 2007Create a Business Data Catalog and manage data connections to other applications Monitor and fine-tune system performanceApply best practices for backup and recoveryCD features:Fully searchable eBook Code samples and additional resourcesA Note Regarding the CD or DVDThe print version of this book ships with a CD or DVD. For those customers purchasing one of the digital formats in which this book is available, we are pleased to offer the CD/DVD content as a free download via O'Reilly Media's Digital Distribution services. To download this content, please visit O'Reilly's web site, search for the title of this book to find its catalog page, and click on the link below the cover image (Examples, Companion Content, or Practice Files). Note that while we provide as much of the media content as we are able via free download, we are sometimes limited by licensing restrictions. Please direct any questions or concerns to booktech@oreilly.com.",
        "Category": " Computers , Networking , Intranets & Extranets",
        "Publisher": "Microsoft Press",
        "Price Starting With ($)": "8.46",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Monster in the Box: An Inspector Wexford Novel",
        "Authors": "By Rendell, Ruth",
        "Description": "The Monster In The Box is the latest addition to Ruth Rendell's classic and beguiling Inspector Wexford series. In this enthralling new book, Rendell, \"the best mystery writer in the English-speaking world\" (Time), takes Inspector Wexford back to his days as a young policeman, and to the man he has long suspected of murder -- serial murder.Outside the house where Wexford investigated his first murder case -- a woman found strangled in her bedroom -- he noticed a short, muscular man wearing a scarf and walking a dog. He gave Wexford an unnerving stare. Without any solid evidence, Wexford began to suspect that this man -- Eric Targo, he learned -- was the killer.Over the years there are more unsolved, apparently motiveless murders in the town of Kingsmarkham, and Wexford continues to quietly suspect that the increasingly prosperous Targo -- van driver, property developer, kennel owner, and animal lover -- is behind them.Now, half a lifetime later, Wexford spots Targo back in Kingsmarkham after a long absence. Wexford tells his longtime partner, Mike Burden, about his suspicions, but Burden dismisses them as fantasy. Meanwhile, Burden's wife, Jenny, has suspicions of her own. She believes that the Rahmans, a highly respectable immigrant family from Pakistan, may be forcing their daughter, Tamima, into an arranged marriage -- or worse.In The Monster in the Box, the twenty-second book in the Inspector Wexford series, fans will be thrilled to meet the now-aging inspector in the robust early days of his career. For new readers, no introduction to this spectacular writer and her compelling protagonist could be finer.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Love and Laughter: Delightful New Wisdom",
        "Authors": "By Marjorie Holmes",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1972"
        }
    },
    {
        "Title": "Who Am I, God? the Doubts, the Fears, the Joys of Being a Woman",
        "Authors": "By Holmes, Marjorie",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Boadicea's Chariot: The Warrior Queens",
        "Authors": "By Fraser, Antonia",
        "Description": "",
        "Category": "",
        "Publisher": "Weidenfeld and Nicolson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Chinese Art (World of Art)",
        "Authors": "By Tregear, Mary",
        "Description": "",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Bon Appetit Appetizers & Hors d'Oeuvres",
        "Authors": "By Bon Appetit",
        "Description": "",
        "Category": "",
        "Publisher": "Conde Nast Publications Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Disclosed: Inside the Palestinian Authority and the PLO",
        "Authors": "By Kushner, Arlene",
        "Description": "",
        "Category": " History , Middle East , Israel",
        "Publisher": "Pavilion Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Yellow Bird and Me",
        "Authors": "By Hansen, Joyce",
        "Description": "In a sequel to THE GIFT-GIVER, Doris reluctantly starts helping Yellow Bird, the class clown, with his reading problem. To her surprise, Doris finds that in caring for and helping Bird, she develops a new friend.",
        "Category": " Juvenile Fiction , People & Places , United States , African American",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Running: Getting Started",
        "Authors": "By Galloway, Jeff",
        "Description": "Running Getting Started will take anyone, at any level of fitness, into the running lifestyle.  Jeff Galloway, a US Olympian in 1972, has helped over 150,000 people into running while reducing or eliminating aches, pains, and injuries suffered during most training programs.  Jeff offers a step-by-step program that is easy to use and easy to understand.  Included will be lots of tips on nutrition, staying motivated, building endurance, shoes, stretching and strengthening, and much more.",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Meyer & Meyer Sport",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Young Joan",
        "Authors": "By Dana, Barbara",
        "Description": "In thisnovel we meet the young farm girl Joan before she becomes Joan of Arc, and witness her struggles to understand the extraordinary task she has been given by her saints. Told in her voice, it is a remarkable story of acceptance and spiritual courage. ‘A beautifully crafted fictional portrait of Joan of Arc, from her first visions until she leaves on her historic mission. . . . A convincing, unforgettable—and non-doctrinaire re-creation.’ —The Kirkus Reviews. This edition, abridged by the author, marks its first appearance in paperback. ‘Wise and profoundly moving . . . captivating and timeless.’—The Los Angeles Times Book Review. ‘Barbara Dana’s recreation of Joan of Arc’s early life, before she commanded an army, is entirely involving and convincing. Making no concessions to the twentieth century, Dana portrays a Joan true to her time.’—Bulletin of the Center for Children’s Books.",
        "Category": " Young Adult Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Complete Guide to Carb Counting",
        "Authors": "By Warshaw, Hope S., Kulkami, Karmen, and Kulkarni, Karmeen",
        "Description": "The ADA Complete Guide to Carb Counting is an A-Z guide to carbohydrate counting for people with diabetes. It addresses basic concepts as well as more advanced issues related to tight blood glucose control. Topics include portion control, food variation, the importance of protein in carbohydrate counting, the impact of fat on blood glucose, size and frequency of snacks, and exercise.",
        "Category": " Health & Fitness , Diseases , Diabetes",
        "Publisher": "American Diabetes Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Real Parents, Real Children: Parenting the Adopted Child",
        "Authors": "By Van Gulden, Holly",
        "Description": "Required reading for adoptive families, those considering adoption, or professionals in the field. This practical, informative book covers topics of vital importance to adoptive parents with sensitivity and insight. The authors bring years of experience to the complex emotional issues that parents will negotiate, and expert advice on establishing a healthy, loving parent-child relationship.",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "Crossroad",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Traditional Peoples Today: Continuity and Change in the Modern World (Illustrated History of Humankind, Vol. 5)",
        "Authors": "By Burenhult, Goran (EDT)",
        "Description": "A look at history in the making features modern cultures, including those of the Australian aborigines, Arctic survivors, and North American Indians, while speculating on the future of the human species on this planet and in outer space.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "7.82",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Dimaggio: An Illustrated Life",
        "Authors": "By Stout, Glenn and Johnson, Dick (EDT)",
        "Description": "A full-length biography of the legendary Yankee Clipper examines his astonishing career and also includes five essays, by Ted Williams and other notable figures, that consider his place in baseball history.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Walker & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "How to Find a Ghost",
        "Authors": "By Kelley, True (ILT) and Deem, James M.",
        "Description": "Informs young readers about ghosts and how to find them, beginning with a section on the various types of ghosts and spirits and continuing with a section on how to conduct research to improve the odds of seeing a ghost",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Bedlam South",
        "Authors": "By Grisham, Mark and Donaldson, David",
        "Description": "",
        "Category": " Fiction , Historical",
        "Publisher": "State Street Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Hadassah Covenant",
        "Authors": "By Tenney, Tommy and Olsen, Mark Andrew",
        "Description": "Leah, the young queen's candidate Esther wrote to in Hadassah, is delegated to the \"rejected\" category--virtually a prisoner for life in the king's palace, with no hope and no future--when the successor to Xerxes, who has no love for the Jews, discovers her wearing a Star of David medallion.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Looking for Lincoln: The Making of an American Icon",
        "Authors": "By Kunhardt, Philip B., Kunhardt, Peter W., Donald, David Herbert (FRW), and Goodwin, Doris Kearns (INT)",
        "Description": "In honor of the bicentennial of Abraham Lincoln’s birth, an extensively researched, lavishly illustrated consideration of the myths, memories, and questions that gathered around our most beloved—and our most enigmatic—president in the years between his assassination and the dedication of the Lincoln Memorial in 1922. A sequel to the enormously successful Lincoln: An Illustrated Biography, Looking for Lincoln picks up where the previous book left off, examining how our sixteenth president’s legend came into being.Availing themselves of a vast collection of both published and never-before-seen materials, the authors—the fourth and fifth generations of a family of Lincoln scholars—bring into focus the posthumous portrait of Lincoln that took hold in the American imagination, becoming synonymous with the nation’s very understanding of itself. Told through the voices of those who knew the man—Northerners and Southerners, blacks and whites, neighbors and family members, adversaries and colleagues—and through stories carefully selected from long-forgotten newspapers, magazines, and family scrapbooks, Looking for Lincoln charts the dramatic epilogue to Lincoln’s extraordinary life when, in a process fraught with jealousy, greed, and the struggle for power, the scope of his historical significance was taking shape.In vibrant and immediate detail, the authors chart the years when Americans struggled to understand their loss and rebuild their country. Here is a chronicle of the immediate aftermath of the assassination; the private memories of those closest to the slain president; the difficult period between 1876 and 1908, when a tired nation turned its back on the former slaves and betrayed Lincoln’s teachings; and the early years of the twentieth century when Lincoln’s popularity soared as African Americans fought to reclaim the ideals he espoused.Looking for Lincoln will deeply enhance our understanding of the statesman and his legacy, at a moment when the timeless example of his leadership is more crucial than ever.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.77",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "The Norton Anthology of World Literature, Volume B: 100 to 1500",
        "Authors": "By Lawall, Sarah N. (EDT) and MacK, Maynard (EDT)",
        "Description": "Seven years ago, Norton changed the way world literature is taught by introducing The Norton Anthology of World Masterpieces, Expanded Edition. Leading the field once again, Norton is proud to publish the anthology for the new century, The Norton Anthology of World Literature, Second Edition. Now published in six paperback volumes, the new anthology boasts slimmer volumes, thicker paper, a bolder typeface, and dozens of newly included or newly translated works from around the world. The Norton Anthology of World Literature represents continuity as well as change. Like its predecessor, the anthology is a compact library of world literature, offering an astounding forty-three complete longer works, more than fifty prose works, over one hundred lyric poems, and twenty-three plays. More portable, more suitable for period courses, more pleasant to read, and more attuned to current teaching and research trends, The Norton Anthology of World Literature remains the most authoritative, comprehensive, and teachable anthology for the world literature survey.",
        "Category": "",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Electronic Devices (Merrill's International Series in Engineering Technology)",
        "Authors": "By Floyd, Thomas L.",
        "Description": "New edition (previous: 1984 and 1988) of a text covering discrete devices and circuits in the first half and dealing with linear integrated circuits (with emphasis on the operational amplifier) in the second. Includes many examples and self-tests (with answers). Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Merrill Pub Co",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Switching to VoIP: A Solutions Manual for Network Professionals",
        "Authors": "By Wallingford, Ted",
        "Description": "More and more businesses today have their receive phone service through Internet instead of local phone company lines. Many businesses are also using their internal local and wide-area network infrastructure to replace legacy enterprise telephone networks. This migration to a single network carrying voice and data is called convergence, and it's revolutionizing the world of telecommunications by slashing costs and empowering users. The technology of families driving this convergence is called VoIP, or Voice over IP.VoIP has advanced Internet-based telephony to a viable solution, piquing the interest of companies small and large. The primary reason for migrating to VoIP is cost, as it equalizes the costs of long distance calls, local calls, and e-mails to fractions of a penny per use. But the real enterprise turn-on is how VoIP empowersbusinesses to mold and customize telecom and datacom solutions using a single, cohesive networking platform. These business drivers are so compelling that legacy telephony is going the way of the dinosaur, yielding to Voice over IP as the dominant enterprise communications paradigm.Developed from real-world experience by a senior developer, O'Reilly's Switching to VoIP provides solutions for the most common VoIP migration challenges. So if you're a network professional who is migrating from a traditional telephony system to a modern, feature-rich network, this book is a must-have. You'lldiscover the strengths and weaknesses of circuit-switched and packet-switched networks, how VoIP systems impact network infrastructure, as well as solutions for common challenges involved with IP voice migrations. Among the challenges discussed and projects presented:building a softPBXconfiguring IP phonesensuring quality of servicescalabilitystandards-compliancetopological considerationscoordinating a complete system ?switchover?migrating applications like voicemail and directoryservicesretro-interfacing to traditional telephonysupporting mobile userssecurity and survivabilitydealing with the challenges of NATTo help you grasp the core principles at work, Switching to VoIP uses a combination of strategy and hands-on \"how-to\" that introduce VoIP routers and media gateways, various makes of IP telephone equipment, legacy analog phones, IPTables and Linux firewalls, and the Asterisk open source PBX software by Digium.You'll learn how to build an IP-based or legacy-compatible phone system and voicemail system complete with e-mail integration while becoming familiar with VoIP protocols and devices. Switching to VoIP remains vendor-neutral and advocates standards, not brands. Some of the standards explored include:SIPH.323, SCCP, and IAXVoice codecs802.3afType of Service, IP precedence, DiffServ, and RSVP802.1a/b/g WLANIf VoIP has your attention, like so many others, then Switching to VoIP will help you build your own system, install it, and begin making calls. It's the only thing left between you and a modern telecom network.",
        "Category": " Computers , Internet , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Cracker! The Best Dog on the Battlefield",
        "Authors": "By Kadohata, Cynthia",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Quick-method quilts with style",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Leisure Arts",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Match: The Day the Game of Golf Changed Forever",
        "Authors": "By Frost, Mark",
        "Description": "In 1956, a casual bet between two millionaires eventually pitted two of the greatest golfers of the era -- Byron Nelson and Ben Hogan -- against top amateurs Harvie Ward and Ken Venturi.  The year: 1956. Decades have passed since Eddie Lowery came to fame as the ten-year-old caddie to U.S. Open Champion Francis Ouimet. Now a wealthy car dealer and avid supporter of amateur golf, Lowery has just made a bet with fellow millionaire George Coleman. Lowery claims that two of his employees, amateur golfers Harvie Ward and Ken Venturi, cannot be beaten in a best-ball match, and challenges Coleman to bring any two golfers of his choice to the course at 10 a.m. the next day to settle the issue. Coleman accepts the challenge and shows up with his own power team: Ben Hogan and Byron Nelson, the game's greatest living professionals, with fourteen major championships between them. In Mark Frost's peerless hands, complete with the recollections of all the participants, the story of this immortal foursome and the game they played that day-legendarily known in golf circles as the greatest private match ever played-comes to life with powerful, emotional impact and edge-of-your-seat suspense.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "The Dragon Heir",
        "Authors": "By Chima, Cinda Williams",
        "Description": "The covenant that was meant to keep the wizard wars at bay has been stolen, and Trinity must prepare for attack.  Everyone is doing their part -- Seph is monitoring the Weirwalls; Jack and Ellen are training their ghostly army; even Anaweir Will and Fitch are setting booby traps around the town's perimeter.  But to Jason Haley, it seems like everyone wants to keep him out of the action.  He may not be the most powerful wizard in Trinity, but he's prepared to fight for his friends.  When Jason finds a powerful talisman --a huge opal called the Dragonheart--buried in a cave, his role takes on new importance.  The stone seems to sing to Jason's very soul -- showing him that he is meant for more than anyone guessed.  Trinity's guardians take the stone away after they realize that it may be a weapon powerful enough to save them all.  Without any significant power of his own, and now without the stone, what can Jason possibly do to help the people he cares about -- and to prove his mettle? Madison Moss can feel the beating heart of the opal, too.  The desire for it surges through her, drawing her to it.  But Maddie has other things besides the Dragonheart on her mind.  She has a secret.  Ever since absorbing the magical blow that was meant to kill Seph, she's been leaking dark powers.  Although Maddie herself is immune to magic, what would her friends think if they knew what kind of evil lay within her?  Trinity's enemies are as enthusiastic about her powers as she is frightened.  They think they can use her to get to the Dragonheart -- and they'll use anyone Maddie cares about to make her steal the stone for them.  Moral compasses spin out of control as a final battle storms through what was once a sanctuary for the gifted.  With so much to lose, what will Jason and Maddie be willing to fight for -- and what will they sacrifice?  Every man is for himself in this thrilling conclusion to the Heir trilogy.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Hyperion Book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Chi: Your Body's Energy- A Practical Introduction to the Secrets of Vitality from Both East and West",
        "Authors": "By Mitchell, Emma (EDT)",
        "Description": "A beautifully illustrated guide to the body's energy zones introduces a wide array of techniques and theories based on chi, from accupressure to Tibetan energy massage. Original.",
        "Category": " Body, Mind & Spirit , Healing , Energy (Qigong, Reiki, Polarity)",
        "Publisher": "Thorsons Pub",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The sea-gull cry,",
        "Authors": "By Robert nathan",
        "Description": "",
        "Category": "",
        "Publisher": "A.A. Knopf",
        "Price Starting With ($)": "23.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1942"
        }
    },
    {
        "Title": "Great American Quilts: Book 5 (Bk.5)",
        "Authors": "By Leisure Arts, Inc. (COR) and Newbill, Carol L. (EDT)",
        "Description": "Offers patterns, fabric requirements, and instructions for twenty-two quilts, ranging in skill level from very easy to moderately challenging, and includes a chapter of unique inspirational quilts for the reader's viewing pleasure. Original.",
        "Category": " Art , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Dreaming Back",
        "Authors": "By Hirsh, M. E.",
        "Description": "Leigh Haring endangers her life to discover why her sister died and becomes involved in an effort to prevent a government seizure of a valuable resource on native American reservation land. By the author of Kabul.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Great Famine Ireland's Potato Famine 1845-51",
        "Authors": "By Percival, John",
        "Description": "Describes the events and tragic consequences of the potato famine of 1845, and examines the long-term effects on Ireland's social and political structure",
        "Category": " History , General",
        "Publisher": "Viewer Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Gulliver's Travels (Barnes & Noble Classics Series) (B&N Classics)",
        "Authors": "By Swift, Jonathan and Seidel, Michael",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RGulliver's Travels&&L/I&&R, by &&LB&&RJonathan Swift&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&RConsidered the greatest satire ever written in English, &&LB&&RJonathan Swift&&L/B&&R’s &&LI&&RGulliver’s Travels&&L/I&&R chronicles the fantastic voyages of Lemuel Gulliver, principally to four marvelous realms: Lilliput, where the people are six inches tall; Brobdingnag, a land inhabited by giants; Laputa, a wondrous flying island; and a country where the Houyhnhnms, a race of intelligent horses, are served by savage humanoid creatures called Yahoos.&&LBR&&R&&LBR&&RBeneath the surface of this enchanting fantasy lurks a devastating critique of human malevolence, stupidity, greed, vanity, and short-sightedness. A brilliant combination of adventure, humor, and philosophy, &&LI&&RGulliver’s Travels&&L/I&&R is one of literature’s most durable masterpieces.&&LBR&&R&&L/DIV&&R&&LDIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&RMichael Seidel&&L/B&&R&&L/B&&R is Jesse and George Siegel Professor in the Humanities at Columbia University. He has written widely on eighteenth-century literature. His books include &&LI&&RSatiric Inheritance: Rabelais to Sterne&&L/I&&R (1979), &&LI&&RExile and the Narrative Imagination&&L/I&&R (1986), and &&LI&&RRobinson Crusoe: Island Myths and the Novel&&L/I&&R (1991). &&L/P&&R&&L/DIV&&R",
        "Category": " Fiction , General",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Amelia Bedelia, Rocket Scientist? (I Can Read Level 2)",
        "Authors": "By Sweat, Lynn (ILT) and Parish, Herman",
        "Description": "After being called a rocket scientist by Mr. Rogers after washing his reading glasses in the dishwasher, housekeeper Amelia Bedelia wreaks havoc when she volunteers to be a judge at the school science fair. Reprint.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Half Broke Horses: A True-Life Novel",
        "Authors": "By Walls, Jeannette",
        "Description": "Jeannette Walls's The Glass Castle was \"nothing short of spectacular\" (Entertainment Weekly). Now she brings us the story of her grandmother -- told in a voice so authentic and compelling that the book is destined to become an instant classic.\"Those old cows knew trouble was coming before we did.\" So begins the story of Lily Casey Smith, in Jeannette Walls's magnificent, true-life novel based on her no-nonsense, resourceful, hard working, and spectacularly compelling grandmother. By age six, Lily was helping her father break horses. At fifteen, she left home to teach in a frontier town -- riding five hundred miles on her pony, all alone, to get to her job. She learned to drive a car (\"I loved cars even more than I loved horses. They didn't need to be fed if they weren't working, and they didn't leave big piles of manure all over the place\") and fly a plane, and, with her husband, ran a vast ranch in Arizona. She raised two children, one of whom is Jeannette's memorable mother, Rosemary Smith Walls, unforgettably portrayed in The Glass Castle.  Lily survived tornadoes, droughts, floods, the Great Depression, and the most heartbreaking personal tragedy. She bristled at prejudice of all kinds -- against women, Native Americans, and anyone else who didn't fit the mold. Half Broke Horses is Laura Ingalls Wilder for adults, as riveting and dramatic as Isak Dinesen's Out of Africa or Beryl Markham's West with the Night. It will transfix readers everywhere.",
        "Category": " Fiction , Biographical",
        "Publisher": "Scribner",
        "Price Starting With ($)": "12.16",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Amelia Bedelia 4 Mayor (I Can Read Level 2)",
        "Authors": "By Sweat, Lynn (ILT) and Parish, Herman",
        "Description": "The race is on!Amelia Bedelia always does what she's told. So when Mr. Rogers tells her she should run for Mayor Thomas's office, she picks up her shirt, and dashes off to City Hall. She knows just what she'd do in the mayor's shoes (polish them, of course). With Amelis Bedelia in the race, politics will never be the same!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Game Change: Obama and the Clintons, McCain and Palin, and the Race of a Lifetime",
        "Authors": "By Heilemann, John and Halperin, Mark",
        "Description": "“It’s one of the best books on politics of any kind I’ve read. For entertainment value, I put it up there with Catch 22.” —The Financial Times “It transports you to a parallel universe in which everything in the National Enquirer is true….More interesting is what we learn about the candidates themselves: their frailties, egos and almost super-human stamina.” —The Financial Times “I can’t put down this book!” —Stephen Colbert Game Change is the New York Times bestselling story of the 2008 presidential election, by John Heilemann and Mark Halperin, two of the best political reporters in the country. In the spirit of Richard Ben Cramer’s What It Takes and Theodore H. White’s The Making of the President 1960, this classic campaign trail book tells the defining story of a new era in American politics, going deeper behind the scenes of the Obama/Biden and McCain/Palin campaigns than any other account of the historic 2008 election.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Germany (National Geographic Traveler)",
        "Authors": "By n/a",
        "Description": "Explores the environment of the Central African rain forest and presents a variety of elephants, snakes, primates, insects and other animals that struggle for survival there.",
        "Category": " Television: National Geographic",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Song Yet Sung",
        "Authors": "By McBride, James",
        "Description": "March, 1850. In the tense days, before the Civil War, a slave breakout in the labyrinthine swamps of Maryland's eastern shore sets loose a riveting drama of violence, hope, and redemption among slave catchers, plantation owners, watermen, runaway slaves, and free blacks. Liz Spocott, a beautiful runaway slave, shot and near death, is wracked by disturbing visions of the future as she lies shackled to an old woman in the prison attic of the notorious female slave-trader Patty Cannon and her gang. The ancient nameless woman reveals \"the Code,\" a fiercely guarded cryptic means of communication for slaves on the run. Armed with an array of words that she does not understand, Liz escapes once again, but now must evade an enraged Patty Cannon and a new nemesis, Denwood Long - a troubled slave catcher and waterman, who is coaxed our of retirement to break the Code. As she makes her desperate run, Liz is thrust upon the denizens of the swampy peninsula: the handsome slave Amber, the terrifyingly wild Woolman, the widowed Kathleen Sullivan. Meanwhile Liz's extraordinary dreams of tomorrow create a freedom-seeking furor among the once complacent slave community. The mysterious disappearance of two children, one white and one black, seeds an explosive ending.Filled with rich history - much of the story is drawn from historical events - and told in McBride's signature lyrical style, Song Yet Sung brings into full view a world long misunderstood in American fiction: slavery's haunting choices, pressing both whites and blacks to search for relief in a world where all seemed to lose their moral compass. This is a story of tragic triumph, violent decisions, and unexpected kindness.",
        "Category": " Fiction , Historical",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Isla Grande",
        "Authors": "By hughes, richard",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Silver Mountain Pr",
        "Price Starting With ($)": "7.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    }
]