[
    {
        "Title": "General and Social Systems",
        "Authors": "By Berrien, Kenneth",
        "Description": "",
        "Category": "",
        "Publisher": "Rutgers Univ Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1968"
        }
    },
    {
        "Title": "Hot Summer Nights",
        "Authors": "By McLane, Luann",
        "Description": "Three steamy stories, centering around Sander's City, where baseball--among other things--is everyone's favorite pastime, find the playing field getting even hotter when the game moves from the stadium to the bedroom. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "God Has Never Failed Me, But He's Sure Scared Me To Death A Few Times",
        "Authors": "By Toler, Stan",
        "Description": "Do you really believe that God is faithful? Do you know for certain that He won't be late with the help you need in your life right now? For anyone who has ever felt frazzled, stressed, confused, hurt, angry, undone, or any other emotional response to the difficulties and uncertainties of life, Stan Toler serves up a delightful combination of poignant-and hilarious-reminders that God is still at work in the world. And He is 100% faithful! No wonder they can declare that pinto beans and fried bologna are a feast of faith. Because that's what a group of loving friends brought to Stan's home on a Christmas morning when he was five years old-and there was no food left in the house. No, God is never late! So when nothing seems to be happening in your life, something really is happening. Yes, it is possible to cope with life even if you don't know how to program a VCR. Yes, the God who sits on a throne in Heaven is interested in you right now!",
        "Category": " Humor , Topic , Religion",
        "Publisher": "David C. Cook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Shocking Truth About Bowling Shoes and Other Bizarre Tales",
        "Authors": "By Smarsnick, Willard A. and McPherson, John (ILT)",
        "Description": "Short features and cartoons provide a humorous look at topics of interest to young people, such as food, music, and high school.",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "How to Get a Job in Europe (Insider's Guide Series)",
        "Authors": "By Sanborn, Robert and Matherly, Cheryl",
        "Description": "Lists more than twenty-five hundred names and telephone numbers of employers and the best cities to work in, tells how to get working papers, and suggests twelve steps towards finding work",
        "Category": " Travel , Europe , General",
        "Publisher": "Surrey Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Cases in strategic management",
        "Authors": "By Hill, Charles W. L., Jones, Gareth R.",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Money Guide to Living Well in Retirement",
        "Authors": "By Ellis, Junius and Ellis, Lisa",
        "Description": "Offers advice on financial planning for retirement, and suggests how much money it will take to retire early and how much is neccessary to live comfortably in retirement",
        "Category": " Business & Economics , Personal Finance , Retirement Planning",
        "Publisher": "People Weekly",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Confessions of a Late Night Talk Show Host",
        "Authors": "By Rensin, David and Shandling, Garry",
        "Description": "With the wit and charm and wit that have made him one of America's most beloved, and now most sorely missed, television personalities, Larry Sanders tells here the story behind the man -- Larry -- from his emotionally barren beginnings in Mound, Minnesota, to his ten-year run as the man millions went to bed with every night. (He had a very big bed.) Confessions of a Late Night Talk Show Host is a Hollywood autobiography like no other because it reveals all -- the loves and losses, the pain and joy, the shrinks and doctors -- and it is uproariously funny. Larry Sanders has written a book that will have the same ten-year run that his show did.  Larry Sanders is no ordinary man, and this book will show America and the world how very different he is. Fueled by an enormous need to be loved and gifted with a talent beyond even his own, Sanders has risen to the top of his field -- and dropped -- while retaining all of his dignity and modesty. As he says on the first page of his story, \"I'm famous. Actually, I'm very, very, very famous.\" Sanders's story is laced with the names (and some of the faces) of the thousands of celebrities who have sought his attention for a decade -- and Sanders tells the world what he thinks of all of them, even if it hurts his own feelings.  Confessions of a Late Night Talk Show Host is a Hollywood tell-all that will forever change the nature of this kind of book. While Geraldo Rivera used his sexual exploits to shamelessly promote his book, Sanders uses his conquests of thousands of women to illustrate his compassion and grace. \"If it sells, it sells,\" Sanders says. \"There was never a hidden agenda.\" While Roseanne used her book to promote her many personalities, Sanders's book shows how a straight-shooter can not only survive but thrive in Hollywood. Most of all, Sanders, in truthfully disclosing all aspects of his life and those of people he has never met, hopes to heal and entertain. Sanders has written a wonderfully hilarious book that will make some of his fans wish he were back.",
        "Category": " Humor , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Blood Pressure: Questions You Have...Answers You Need",
        "Authors": "By People's Medical Society (EDT)",
        "Description": "",
        "Category": " Health & Fitness , Diseases , Heart",
        "Publisher": "Peoples Medical Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Breaking the Surface:",
        "Authors": "By Louganis, Greg and Marcus, Eric",
        "Description": "No one who watched the 1988 Olympics on television will ever forget seeing Greg Louganis hit his head on the diving board during the ninth dive of the springboard preliminaries. Millions felt his pain and then held their breath as the two-time gold medalist returned to the board only minutes later, with four stitches and a waterproof patch, and executed what was perhaps the best dive of the 1988 Olympics.People around the world knew they were witnessing a singular moment of extraordinary courage and perseverance. Many still remember the dramatic images of the days that followed: Greg's spectacular diving despite the patch and the stitches, Greg smiling as he tapped his heart to show how hard it was beating, Greg on the platform praying before his final dive, Greg winning his third and fourth gold medals, the very symbol of the Olympic spirit.At a team banquet after the diving was over, Greg thanked his coach, Ron O'Brien, saying, \"Nobody will ever know what we went through, nobody.\" And apart from O'Brien and a handful of people close to Louganis, nobody did know - until the publication of this book - that several months prior to the '88 Olympics, Greg had tested positive for HIV.Breaking the Surface is the unflinchingly honest story of a man breaking free of a lifetime of silence and isolation. Born to a young Samoan father and Northern European mother, adopted at nine months by Pete and Frances Louganis, Greg began performing at age three in local dance and acrobatic competitions. He started diving lessons at age nine, and at sixteen he won a silver medal at the 1976 Montreal Olympics. But despite his astonishing athletic skill and artistry on the diving board. Greg struggled with late-detected dyslexia, prejudice toward his dark skin coloring, and anguish over his sexual orientation, which he felt compelled to hide.Being in the spotlight intensified difficulties with personal relationships and substance abuse. Like many other elite athletes, Greg found that the highs that came with winning never compensated for the lows. But despite his demons and personal disappointments, he always conveyed a warmth and grace that people remembered long after the '88 Olympics.Greg returned to national prominence when he stepped forward at the 1994 Gay Games in New York City and then urged the U.S. Olympic Committee to move the 1996 volleyball preliminaries from the Georgia county that had passed a resolution condemning gay people.By speaking out at this time, Greg hopes to raise awareness about a number of key issues, including AIDS prevention and research and domestic violence. \"I'm doing it now,\" he says, \"because I want to tell my story in my own words while I still have the chance. I'm finally ready to tell my story. I hope you're ready to hear it.\"",
        "Category": " Sports & Recreation , Swimming & Diving",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Cold Sassy Tree",
        "Authors": "By Burns, Olive Ann",
        "Description": "Young Will Tweedy becomes chaperone, co-conspirator, and confidant to his renegade grandpa, E. Rucker Blakeslee, and the old man's young new wife, Miss Love Simpson",
        "Category": "",
        "Publisher": "Laurel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "An Evening with Richard Nixon",
        "Authors": "By VIDAL, GORE",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Red Express: The Greatest Rail Journey from the Berlin Wall to the Great Wall of China",
        "Authors": "By Cordell, Michael and Solness, Peter",
        "Description": "The contrast between the surge of democracy in Eastern Europe and the brutal repression in China forms the backdrop for a journey on the Trans-Siberian Express",
        "Category": " Travel , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "7.69",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Jewish Renewal: Path to Healing and Transformation, A",
        "Authors": "By Lerner, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Living by Fiction",
        "Authors": "By Dillard, Annie",
        "Description": "Living by Fiction is written for--and dedicated to--people who love literature. Dealing with writers such as Nabokov, Barth, Coover, Pynchon, Borges, García Márquez, Beckett, and Calvino, Annie Dillard shows why fiction matters and how it can reveal more of the modern world and modern thinking than all the academic sciences combined. Like Joyce Cary's Art and Reality, this is a book by a writer on the issues raised by the art of literature. Readers of Pilgrim at Tinker Creek and Holy the Firm will recognize Dillard's vivid writing, her humor, and the lively way in which she tackles the urgent questions of meaning in experience itself.",
        "Category": " Literary Criticism , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The beachwalker's guide: The seashore from Maine to Florida",
        "Authors": "By Ricciuti, Edward R.",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Illustrated Index to Traditional American Quilt Patterns",
        "Authors": "By Mills, Susan Winter",
        "Description": "",
        "Category": "",
        "Publisher": "Arco Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Strong Family",
        "Authors": "By Swindoll, Charles R.",
        "Description": "Offers advice, based on Biblical teachings, on how to strengthen and enrich one's family life, and includes exercises in self-examination of values",
        "Category": "",
        "Publisher": "Multnomah Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "American Lung Association Family Guide to Asthma and Allergies",
        "Authors": "By American Lung Association Asthma Advisory Group (COR) and Edelman, Norman H., M.D.",
        "Description": "A complete guide to asthma and allergies in both children and adults answers questions about triggers, treatment, and preventive help, and offers suggestions on how to recognize the symptoms of these common problems. Simultaneous. 25,000 first printing. Tour.",
        "Category": " Health & Fitness , Allergies",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Behaving Like Adults: A Novel",
        "Authors": "By Maxted, Anna",
        "Description": "Meet Holly, the sunny twenty-nine-year-old owner of Girl Meets Boy, a dating service for those who are \"beautiful inside and out.\" Though she's a successfulmatchmaker, she hasn't quite fulfilled her own relationship dreams (her ex-fiancé, Nick, seems unlikely to progress from his job as Mr. Elephant, children's party entertainer). So when her friends dare her to pick a man off the top of the pile, she's game.But in one awful evening, the seemingly perfect Stuart turns out to be a completecad, and Holly's belief in the goodness of humanity takes a hit. What does it mean for her business and her romantic future if she can no longer trust her ability to read people? Holly's friends and colleagues are drawn into the complicated drama of her life, while Holly learns her most important lesson: to trust herself.Rueful and hilarious, Behaving Like Adults is a must-read novel of men and women growing up -- in spite of themselves.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Now That You Are His",
        "Authors": "By Shibley, David",
        "Description": "You have made a commitment of your life to Christ as Lord and Savior. Now that you are His, what specific things can you do to grow as a Christian? This book will help guide you through the important steps of:  Publicly confessing your faith in Christ Being baptized in water Being filled with the Holy Spirit Fellowship with others in a strong local church Getting your foundation of faith right Being grounded in God?s word Developing a dynamic prayer life Reaching others for Jesus Trusting God's promise  Let this book set you on the path of a fruitful life in Christ!",
        "Category": " Religion , Christian Life , General",
        "Publisher": "New Leaf Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Alcatraz: The Story Behind the Scenery (English and German Edition)",
        "Authors": "By Gnass, Jeff (PHT) and Delgado, James P",
        "Description": "",
        "Category": " History , United States , State & Local , West (AK, CA, CO, HI, ID, MT, NV, UT, WY)",
        "Publisher": "KC Publications,Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Aural rehabilitation",
        "Authors": "By Derek A. Sanders",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "How to Beat Burnout: Help for Men and Women",
        "Authors": "By Minirth, Hawkins and Meier, Flournoy",
        "Description": "",
        "Category": "",
        "Publisher": "Northfield Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Loving Your Wife: How to strengthen your marriage in an imperfect world",
        "Authors": "By Heald, Cynthia and Heald, Jack",
        "Description": "This topical Bible study for men, written by Navigator authors Jack and Cynthia Heald, will help you see that marriage can be a tremendously fulfilling experience. In 12 sessions, explore 12 proven ways to improve your relationship with your wife through love and faithfulness.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "How to write a usable user manual (The Professional writing series)",
        "Authors": "By Weiss, Edmond H",
        "Description": "",
        "Category": "",
        "Publisher": "I.S.I. PRESS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Fischer/Brown Low Cholesterol Gourmet",
        "Authors": "By Fischer, Lynn and Brown, Virgil",
        "Description": "Discusses the importance of reducing cholesterol in the diet, and gathers healthful recipes for salads, appetizers, soups, pasta, rice, meat, poultry, fish, vegetables, breads and desserts",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Cook It Light Classics",
        "Authors": "By Jones, Jeanne",
        "Description": "More than two hundred recipes from the author's nationally syndicated column stress reduced sodium, fat, calories, and cholesterol and are accompanied by complete nutritional breakdowns. By the author of Cook It Light.",
        "Category": " Cooking , Reference",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Home Wisdom: A Commonsense Guide to Solving Everyday Problems (Old Farmer's Almanac)",
        "Authors": "By Vara, Jon",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Honest Doubt (Kate Fansler Novels)",
        "Authors": "By Cross, Amanda",
        "Description": "Professor Charles Haycock, an expert on Victorian literature, is dead from a hearty dose of his own heart medication, slipped into his drink during a party at his home. The mystery is not why Haycock was murdered - very few could stomach the woman-hating, power-hungry prof - but who did the deed. As Woody proceeds, she finds herself engulfed in a quagmire of infighting and deceit, literary allusions and overinflated egos. And it's time to call in the reinforcements.Enter Kate Fansler, professor and crime solver extraordinaire. Together, Woody and Kate start to pull at the loose ends of the very tangled Clifton College English Department. Woody's list of suspects is longer than the freshman survey reading list: Antonia Lansbury, the lone tenured woman on the staff - and thereby the target of Haycock's venomous, misogynistic ire; Professor David Longworth, weary of Haycock's controlling ways and now first in line for Department Chair; Rick Fowler, a professor forced out of Clifton because of his liberal views and out-and-proud principles; and Haycock's wife, who was about to file for divorce when her husband gasped his last breath.As Kate and Woody defuse the host of literary land mines set out for them, Woody suspects they're only scratching the surface of a very large and sinister plot. And it will take both women's expertise and cunning to solve the murder of a man no one was sorry to see go.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Washington, D.C.: A Pictorial Souvenir",
        "Authors": "By Highsmith, Carol M. and Landphair, Ted",
        "Description": "Carved out, at the close of the eighteenth century, of some of the thickest woods and foulest swamps north of Georgia, the glorious city of Washington D.C., is among America's most stately, most beautiful, and most impressive.  Indeed, once maligned by Charles Dickens as simply \"spacious avenues that begin in nothing and lead nowhere; streets a mile long that only want houses, roads, and inhabitants; public buildings that need but a public to be complete, \" Washington, D.C. today is a powerful symbol not only of our nation but of democracy.Spanning the Potomac in majestic fashion, the city fans out gracefully, offering a multitude of pleasures to the more than twenty million tourists who visit annually.  From official Washington (the imposing Lincoln and Jefferson Memorials, the White House, the Capitol, the souring obelisk of the Washington Monument) to its lush public parks and gardens; from Arlington National Cemetery to the Capitol reflecting pool; the Museum of Natural History's fabled elephant; the charm of its celebrated Cherry Blossom Festival to the somber beauty of the Vietnam Wall; from the massive FBI Building to the profoundly moving Holocaust Museum—Washington D.C., A Pictorial Souvenir, a marvelously evocative portrait in words and pictures, captures this historic city memorably.A wonderful keepsake for anyone who has ever visited Washington, and an enticing gift for those who merely dream of strolling down Pennsylvania Avenue, America's \"Main Street,\" Washington D.C., A Pictorial Souvenir succeeds in conveying all the grandeur of the nation's capital while reminding us that this splendor belongs, of course, to all who prize democracy.",
        "Category": " History , United States , State & Local , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Perfect Witness",
        "Authors": "By Siegel, Barry",
        "Description": "Lawyer Greg Monarch must delve deep into a world of deceit and betrayal in order to destroy the charming facade of a beautiful witness bent on destroying his client, Ira Sullivan, who has been wrongly accused of murder. A first novel. By the author of A Death in White Bear Lake.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Official Guide to the Smithsonian National Air and Space Museum",
        "Authors": "By Smithsonian Institution",
        "Description": "",
        "Category": " Travel , Museums, Tours, Points of Interest",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Fugitive Nights",
        "Authors": "By Wambaugh, Joseph",
        "Description": "A beautiful private investigator, a hard-drinking, burnt-out detective, and an over-zealous cop yearning for a position on the lush Palm Springs police force team up to capture a mysterious desert fugitive",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Natural Healing Foods Encyclopedia",
        "Authors": "By FC A",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "FC&A Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Talking It Over",
        "Authors": "By Barnes, Julian",
        "Description": "The relationship between longtime friends Stuart and Oliver is undermined when Oliver falls madly in love with Stuart's new wife, Gillian, in a story of love, jealousy, guilt, deceit, retribution, and atonement",
        "Category": " Fiction , General",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "How to Plan for a Secure Retirement",
        "Authors": "By Dickman, Barry and Lieberman, Trudy",
        "Description": "Packed with expert advice and up-to-date information, How to Plan for a Secure Retirement is designed to help you make the most of your retirement - regardless of your age, income, assets, or personal circumstances.A comprehensive reference source and practical adviser, How to Plan for a Secure Retirement takes you step-by-step through each of the four major categories of retirement planning: income, health care, housing, and estate planning. Younger readers will find hands-on support in getting started and building a retirement nest egg. Older readers will learn how to tap the equity in their homes, avoid redundant health insurance policies, and set up trusts. All readers will benefit from savings and investment strategies, tax tips, cautions to keep in mind when investing, and pointers on coping with inflation.Featuring charts, listings of government agencies and pertinent organizations, plus convenient, easy-to-use worksheets, How to Plan for a Secure Retirement covers pension plans, including IRAs, Keoghs, and 401(k) plans; Social Security; annuities; life insurance; Medicare, Medicaid, and supplementary health insurance; and continuing-care communities. It offers practical suggestions on how to maximize housing tax breaks and minimize estate taxes. In addition, it discusses such critical issues as early retirement, catastrophic health insurance, choosing the best investments, making a living will, converting savings into a steady income stream, selecting a legal or professional financial adviser, and appointing an executor.Whether you are in mid-career, approaching retirement, or already retired, How to Plan for a Secure Retirement can be a prudent investment - one that will pay dividends many times over in enhancing your life after work and ensuring your peace of mind.",
        "Category": " Business & Economics , General",
        "Publisher": "Consumer Reports Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Trash to Treasure: The Recycler's Guide to Creative Crafts (Memories in the Making Series)",
        "Authors": "By Leisure Arts, Inc. (COR) and Van Wagner Childs, Anne (EDT)",
        "Description": "",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Careers For Artistic Types (Pb",
        "Authors": "By KAPLAN, Andrew",
        "Description": "Interviews with fourteen people who work in careers of interest to young people who like art",
        "Category": " Young Adult Nonfiction , Art , General",
        "Publisher": "Millbrook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "101 Best Home-Based Businesses for Women: Everything You Need to Know About Getting Started on the Road to Success",
        "Authors": "By Huff, Priscilla Y.",
        "Description": "Everything women need to know about 101 different businesses based in the home, including start-up costs, financing sources, marketing, pricing, and the income potential of each business, is complemented by stories of success and advice from actual businesswomen. Original. IP.",
        "Category": " Business & Economics , Home-Based Businesses",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Pain: The Challenge and the Gift",
        "Authors": "By Matthews, Marti Lynn",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Stillpoint Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Moonbeams Come at Dark Times: Turning 50 in the 90's",
        "Authors": "By White-Bowden, Susan",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "White-Bowden Assoc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Leading with Soul: An Uncommon Journey of Spirit (Jossey-Bass Management)",
        "Authors": "By Bolman, Lee G. and Deal, Terrence E.",
        "Description": "Inspired by such visionary writers as M. Scott Peck and Max De Pree, authors Lee Bolman and Terry Deal have crafted a powerful story of one beleaguered executive's quest for passion and purpose in work and in life. This contemporary parable chronicles the journey of Steve, a dispirited leader in search of something deeper and more satisfying than a preoccupation with the bottom line. He seeks answers from Maria, a sage whose wisdom was forged in her own hard-won business career. Although Maria's initial questions seem far afield from business, Steve unexpectedly discovers the true meaning of leadership. By finding his own soul, he learns to ignite the spirit of his organization.The authors draw upon many of the world's major spiritual traditions, poetry and philosophy, social science teachings on leadership and organizations, and their own extensive consulting experience. They offer inspiration, guidance, and an invitation to participate with them in understanding the ties that bind spirituality and leadership together.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Secrets of the Simple Youth Ministry",
        "Authors": "By Blunt, Carl A.",
        "Description": "",
        "Category": " Fiction , Religious",
        "Publisher": "Winepress Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Drinking, Smoking and Screwing: Great Writers on Good Times",
        "Authors": "By Nickles, Sara (EDT)",
        "Description": "Before the notion of \"political correctness\" encroached on the ways people spoke, wrote, and conducted themselves in public and private, some of America's best writers embraced unsafe sex, excessive alcohol, and a good cigar. From the classically libidinous Henry Miller to the hilariously contemporary Fran Lebowitz, Drinking, Smoking and Screwing includes novel excerpts, essays, poems, and short stories in a bawdy and thoroughly entertaining anthology with no warnings -- and no apologies.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "San Francisco a la Carte",
        "Authors": "By Junior League of San Francisco",
        "Description": "More than five hundred fifty recipes drawn from the ethnic diversity and prime sea-coast location of San Francisco are organized in chapters that highlight particular sections of the city by means of historical anecdotes and photographs",
        "Category": " Cooking , Regional & Ethnic , American , California Style",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "Herbal Pleasures: Cooking & Crafts/How to Use Herbs in the Home, With over 120 Original Recipes, Decorations, Gifts and Bathtime Preparations",
        "Authors": "By Richmond, Katherine",
        "Description": "A cookbook and guide to using herbs provides more than 120 original recipes including Rosemary Bread and Ginger Mint Preserve, and a variety of home-enhancing projects including herbal wreaths, topiaries, and candles.",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Ben-Gurion",
        "Authors": "By Robert. St. John",
        "Description": "",
        "Category": "",
        "Publisher": "Jarrolds",
        "Price Starting With ($)": "8.81",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "sendmail (Nutshell Handbook)",
        "Authors": "By Robbins, Arnold and Dougherty, Dale",
        "Description": "This second edition of sendmail covers sendmail Version 8.8 from Berkeley and the standard versions available on most systems. It is far  and away the most comprehensive book ever written on sendmail, the program  that acts like a traffic cop in routing and delivering mail on Unix-based  networks. Although sendmail is used on almost every Unix system, it's one  of the last great uncharted territories--and most difficult utilities to  learn--in Unix system administration.This book provides a complete sendmail tutorial, plus extensive reference  material on every aspect of the program. What's more, it's authoritative,  having been coauthored by Eric Allman, the developer of sendmail. In  addition to Version 8.8, it covers earlier versions available on many  systems, such as those found on Sun workstations. Part One is a tutorial  on understanding sendmail; Part Two covers the building, installation, and  m4 configuration of sendmail; Part Three covers practical issues in sendmail  administration; Part Four is a comprehensive reference section; and Part  Five consists of appendixes and a bibliography.In this second edition an expanded tutorial demonstrates hub's cf file and nullclient.mc. Other topics include the #error delivery agent, sendmail's exit values, MIME headers, and how to set up and use the user database, mailertable, and smrsh. Solution-oriented examples  throughout the book help you solve your own sendmail problems. Plus, this  edition is cross-referenced with section numbers.",
        "Category": " Computers , Operating Systems , UNIX",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Handbook of psychodiagnostic testing: Personality analysis and report writing",
        "Authors": "By Kellerman, Henry",
        "Description": "",
        "Category": "",
        "Publisher": "Grune & Stratton",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Microeconomics: Principles, Problems, and Policies",
        "Authors": "By Brue, Stanley L. and McDonnell, Campbell R.",
        "Description": "",
        "Category": " Business & Economics , Economics , Microeconomics",
        "Publisher": "McGraw-Hill College",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Introducing a New Hymnal: How to Improve Congregational Singing",
        "Authors": "By Sydnor, James",
        "Description": "",
        "Category": " Music , Religious , Hymns",
        "Publisher": "GIA Publications",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Charles Kuralts American Moments",
        "Authors": "By Kuralt, Charles and Freundlich, Peter",
        "Description": "AMERICAN MOMENT: a small truth of the kind easily overlooked by people in a hurry.  Charles Kuralt is a national treasure, a reporter and man of the world who was to many the real and true voice of America. To several generations Kuralt was the Mark Twain of television, a wanderer transfixed by the richness and greatness that he found in practically every corner of the country. For more than thirty years, he delighted us with his On the Road reports, as anchor of CBS News Sunday Morning, and with bestselling books that include On the Road with Charles Kuralt and Charles Kuralt's America. As Time magazine wrote, he was \"the laureate of the common man.\"  The project that Kuralt was working on before he died was An American Moment with Charles Kuralt, a series of brief television essays about the people, places, and ideas that define the national spirit: the man who handcrafts the president's shoes; the Keeper of the Flame on Liberty Island; Paul Bunyan's hometown of Bemidji, Minnesota; the Pony Express Museum; cowboy hats; Ferris wheels; and more.  Kuralt's longtime friend and CBS colleague Peter Freundlich, who wrote and produced the American Moment series for television in collaboration with Kuralt, has edited and collected the essays for this book. The result is a collection of enchanting and sometimes touching stories that brings back Charles Kuralt's distinctive voice and celebrates the quintessential American character and traditions that he so loved.",
        "Category": " Travel , United States , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Charles Cresson on the American Flower Garden (Burpee Expert Gardner)",
        "Authors": "By Cresson, Charles O.",
        "Description": "Describes the characteristics and care requirements of hundreds of popular flowers, and tells how to evaluate garden sites, create planting schemes, and follow environmentally sound gardening practices",
        "Category": " Gardening , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "6.16",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Feed Me, I'm Yours",
        "Authors": "By Lansky, Vicki",
        "Description": "",
        "Category": "",
        "Publisher": "Meadowbrook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "A More Perfect Union: Poems and Stories about the Modern Wedding",
        "Authors": "By Hartman, Virginia (EDT) and Esstman, Barbara (EDT)",
        "Description": "A charming anthology centers around the theme of getting married and includes works by Myra Epping, Carson McCullers, Mark Twain, Anne Tyler, Alice McDermott, Stephen Dixon, Francine Prose, Alice Munro, Sharon Olds, and Faye Moskowitz. 20,000 first printing.",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Portrait of a Marriage: V. Sackville-West and Harold Nicolson",
        "Authors": "By Nigel Nicolson",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Thank You, Lord, for My Home",
        "Authors": "By Tchividjian, Gigi",
        "Description": "",
        "Category": "",
        "Publisher": "World Wide Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "Jesus and His Times (Reader's Digest Books)",
        "Authors": "By Editors of Reader's Digest",
        "Description": "Prepared with the help of leading Biblical scholars and illustrated with paintings of the people and their culture, photographs of the ancient lands today, and maps, this volume documents the historical background of Jesus and the key events of his life",
        "Category": " Religion , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Simpsons Xmas Book",
        "Authors": "By Groening, Matt",
        "Description": "The Simpson family reacts to the holiday season in its own inimitable way, as Bart gets a tattoo, Marge spends all their money having it removed, and Homer tries to get more funds",
        "Category": "",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Millennium Meltdown: The Year 2000 Computer Crisis",
        "Authors": "By Jeffrey, Grant R.",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Frontier Research Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Celestine Prophecy: An Experiential Guide",
        "Authors": "By Redfield, James and Adrienne, Carol",
        "Description": "THE #1 BESTSELLING INTERNATIONAL PHENOMENON - NOW WITH A NEW PREFACEYou have never read a book like this before -- a book that comes along once in a lifetime to change lives forever.In the rain forests of Peru, an ancient manuscript has been discovered. Within its pages are 9 key insights into life itself -- insights each human being is predicted to grasp sequentially; one insight, then another, as we move toward a completely spiritual culture on Earth. Drawing on ancient wisdom, it tells you how to make connections among the events happening in your life right now and lets you see what is going to happen to you in the years to come. The story it tells is a gripping one of adventure and discovery, but it is also a guidebook that has the power to crystallize your perceptions of why you are where you are in life and to direct your steps with a new energy and optimisim as you head into tomorrow.Praise for The Celestine Prophecy\"A gripping adventure story filled with intrigue, suspense, and spiritual revelations.\" - Commonwealth Journal\"A spiritual classic...a book to read and reread, to cherish, and to give to friends.\" - Joan Borysenko, PhD, author of Fire in the Soul\"In his inimitable style of great storytelling, Redfield opens us up to a world of insight, inspiration, synchronicity, and power.\" - Deepak Chopra",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Life in the Balance: A Companion to the Audubon Television Specials",
        "Authors": "By Wallace, David Rains",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "MCSE Test Success(TM): NT Server 4",
        "Authors": "By Donald, Lisa, Cabiroy, Frank, and Moran, Bruce",
        "Description": "Provides a method for testing and reinforcing knowledge and understanding of the Microsoft Certified System Engineer exam, covering implementing and support of Microsoft Windows NT Server 4, and includes test-simulation software on the CD-ROM. (Advanced)",
        "Category": " Computers , Operating Systems , Windows Server & NT",
        "Publisher": "Sybex Inc",
        "Price Starting With ($)": "12.15",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "The ROA story: A chronicle of the first 60 years of the Reserve Officers Association of the United States",
        "Authors": "By John T. Carlton, John F. Slinkman",
        "Description": "",
        "Category": "",
        "Publisher": "ROA",
        "Price Starting With ($)": "6.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Cimarron Rose",
        "Authors": "By Burke, James Lee",
        "Description": "Texas attorney and former Texas Ranger Billy Bob Holland has many secrets in his dark past. Among them is Vernon Smothers's son Lucas, a now-teenaged boy about whom only Vernon and Billy Bob know the truth. Lucas is really Billy Bob's illegitimate son, and when Lucas is arrested for murder, Billy Bob knows that he has no choice but to confront the past and serve as the boy's criminal attorney.Billy Bob's son is a country musician, abused by his stepfather, and haunted by the possibility that he killed his girlfriend, who was thought to be pregnant. But Billy Bob knows the propensity of the town, Deaf Smith, Texas, to make scapegoats out of the innocent and to exploit and sexually use those who are without power. The East Enders, the children of the wealthy and effete, were with Billy Bob's son and the murdered girl the night of her death. During Lucas's trial, Billy Bob realizes that he will have to bring injury upon Lucas as well as himself in order to save his son. And as a result, Billy Bob incurs enemies that are far more dangerous than any he faced as a Texas Ranger.",
        "Category": " Fiction , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Terror",
        "Authors": "By Pohl, Frederik",
        "Description": "Terrorists find and take over a top secret government project near Hawaii which uses a nuclear bomb and a dormant volcano to create a weapon which can destroy the world",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Book of Garden Ornament 2076",
        "Authors": "By Lynch, Kenneth",
        "Description": "",
        "Category": "",
        "Publisher": "CANTERBURY PUBLISHING COMPANY",
        "Price Starting With ($)": "23.52",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "When You Come to a Fork in the Road, Take It!: Inspiration and Wisdom from One of Baseball's Greatest Heroes",
        "Authors": "By Berra, Yogi and Kaplan, David",
        "Description": "Yogi Berra (1925-2015), a fifteen-time Major League Baseball All Star, played on a record ten World Series champion teams for the New York Yankees. Off the field, Berra's wit and humor made him \"one of the most universally beloved figures in American life\" (Washington Post).In When You Come to a Fork in the Road, Take It!, Berra provides his inspiring, funny, and surprisingly moving thoughts on life, happiness and getting through slumps. From \"It ain't over til it's over\" (persistence) and \"A nickel aunt worth a dime anymore\" (teaching kids the value of money), these essays illustrate how the rules of life and baseball are uncannily similar. The book is a joyful, insightful legacy of \"baseball's greatest catcher\" (Wall Street Journal) and an \"American treasure\" (Fox Sports).",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Grieving Child: A Parent's Guide",
        "Authors": "By Fitzgerald, Helen",
        "Description": "Making a Child's World Whole Again  Explaining death to a child is one of the most difficult tasks a parent or other relative can face. The Grieving Child offers practical, compassionate advice for helping a child cope with the death of a parent or other loved one. Parents of children from preschool age to the teen years will find much-needed guidance, covering:  &#149; Helping a child visit the seriously ill or dying  &#149; Using language appropriate to a child's age level  &#149; Selecting useful books about death  &#149; Handling especially difficult situations, including murder and suicide &#149; Deciding whether a child should attend a funeral  With a new chapter devoted to the special issues of the bereaved toddler, The Grieving Child provides invaluable suggestions for dealing with a child's emotional responses (including anger, guilt, and depression) and helping a child adjust to a new life.",
        "Category": " Self-help , Emotions",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "You Are Not Your Illness",
        "Authors": "By Topf, Linda Noble and Bennett, Hal Zina (EDT)",
        "Description": "The author, who has lived with multiple sclerosis most of her adult life, delves deeply into her own experience to reveal the keys to regaining emotional and spiritual wholeness when a serious illness or injury threatens to destroy one's sense of self.While serious illness, injury, or disability can physically alter the course of your life, it can also cause great emotional upheaval. It is not uncommon to feel anger, frustration, grief, fear, and denial as you try to accept a new way of living. As you lose your ability to do things you once considered routine, you may even feel that you are losing your self-worth, that your physical condition is threatening your identity. Through a step-by-step process designed to show that real healing has little to do with the state of the physical body, Noble Topf offers a compassionate and inspirational message to anyone whose sense of self is threatened by physical limitations.",
        "Category": " Medical , Healing",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Clear Pictures: First Loves First Guides",
        "Authors": "By Price, Reynolds",
        "Description": "The author of \"A Long and Happy Life\" and \"Kate Vaiden\" offers a memoir of his small-town Southern childhood, sketching vivid portraits of those who shaped him",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "The Only Menopause Guide You'll Need",
        "Authors": "By Moore, Michele",
        "Description": "Offers a variety of ways to make informed decisions about the treatment and symptoms of all phases of menopause by drawing upon traditional, alternative, and holistic medical practices.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Sons of Fortune (Archer, Jeffrey)",
        "Authors": "By Archer, Jeffrey",
        "Description": "NEW YORK TIMES BESTSELLING author Jeffrey Archer-one of 11 the top ten storytellers in the world\" (Los Angeles Times)-returns with a powerful tale of twins separated by fate and reunited by destiny. In Hartford, Connecticut, in the late 1940s, a set of twins is parted at birth-not by accident. Nat Cartwright goes home with his parents, a schoolteacher and an insurance salesman, while his twin brother begins his days as Fletcher Davenport, son of a millionaire and his society wife. During the 1950s and 1960s, the two brothers grow up apart, following similar paths that take them in different directions. Nat leaves college at the University of Connecticut to serve in Vietnam, then finishes school, earns his MBA, and becomes a successful currency dealer. Fletcher, meanwhile, graduates from Yale University with a bachelor's and a law degree, going on to distinguish himself as a criminal defense lawyer. At various times in their lives, both men are confronted with challenges and obstacles, tragedy and betrayal, loss and hardship, before they both decide to run for governor, unaware they are brothers.... In the tradition of Jeffrey Archer's most popular books, Sons of Fortune is as much a chronicle of a nation in transition as it is the story of the making of these two men -and how they eventually discover the truth-and its tragic consequences.",
        "Category": " Fiction , Sagas",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Baby Boomer's Guide to Caring for Aging Parents",
        "Authors": "By Astor, Bart",
        "Description": "Provides information and advice for handling the medical, business, and legal affairs of aging parents",
        "Category": " Social Science , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Changing of the Guard (Tom Clancy's Net Force, Book 8)",
        "Authors": "By Clancy, Tom, Perry, Steve, Pieczenik, Steve R., Segriff, Larry, Clancy, Tom (CON), and Pieczenik, Steve R. (CON)",
        "Description": "The eighth novel in Tom Clancy's #1 New York Times bestselling Net Force series.Though the head of a major multinational corporation—and a key player in world affairs—Samuel Walker Cox has a past that few people know about. But that group is about to get bigger. A computer disk has fallen into the hands of the Net Force, outing the powerful American businessman as a former Russian spy. Cox is willing to see the world in ruins to protect his name. Lucky for the United States that Net Force is on the job—and is about to prove that no man is above the law.",
        "Category": " Fiction , War & Military",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Lighting Solutions (Do It Now Do It Fast Do It Right)",
        "Authors": "By Snyder, Tim (EDT) and Powell, Melanie (ILT)",
        "Description": "Houses need new lighting, especially when they get new owners. Lighting Solutions focuses on high-impact, low-cost projects for all skill levels and tastes that can be completed in one to three days and includes step-by-step photos that cover every aspect of the job and information on all tools and materials. With more light fixtures and lighting options available than ever before, this practical, well-illustrated guide gives readers all the information and design inspiration they need to select and install new lighting everywhere in the house.",
        "Category": " House & Home , Decorating",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Dark of the Moon",
        "Authors": "By Daugharty, Janice",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Prophets of Past Time: Seven Autobiographers, 1880-1914",
        "Authors": "By Dawson, Carl",
        "Description": "",
        "Category": " Literary Criticism , General",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Ireland in poetry: With paintings, drawings, photographs, and other works of art",
        "Authors": "By Charles Sullivan",
        "Description": "Poems deal with Ireland's landscapes, history, people, heritage, religion, politics, and future",
        "Category": "",
        "Publisher": "Abrams",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "American Views: 2 (A Studio book)",
        "Authors": "By Deak, Gloria-Gilda",
        "Description": "",
        "Category": "",
        "Publisher": "Studio",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1976"
        }
    },
    {
        "Title": "Walls",
        "Authors": "By Schaewen, Deidi von",
        "Description": "",
        "Category": "",
        "Publisher": "Pantheon Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Functions of Sleep",
        "Authors": "By Hartmann, Ernest",
        "Description": "This remarkable book brings together vast amounts of information and knowledge about a question that has always captured man’s imagination: Why do we sleep?The author begins with a pungent review of historical and contemporary theories of the functions of sleep and of recent research in sleep deprivation and synchronized (non-dreaming) and desynchronized (dreaming) sleep. Citing his own studies, he investigates the reasons for variable sleep patterns and finds that sleep requirements are influenced by differences in personality, as well as age, life style, and mental state. He then explores the effects on sleep of psychological stress, physical and intellectual activity, and the use of drugs and of other chemicals. The different kinds of tiredness and the role of dreaming in sleep function are also studied. Written clearly enough for the layman to understand, this book is nevertheless a sophisticated theoretical contribution to the literature on sleep. Hartmann combines the rigor of the laboratory scientist with the sensitivity of the clinician. His conclusions offer some fascinating controversial notes on the relationship between the brain and the mind.",
        "Category": " Medical , Neuroscience",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "6.25",
        "Publish Date": {
            "Month": "September",
            "Year": "1973"
        }
    },
    {
        "Title": "Alien Invasion",
        "Authors": "By Devine, Robert S.",
        "Description": "Natural America Under Siege  Exotic species, those plants and animals not native to the environments in which they thrive, represent one of the greatest but least known threats to the environment, not just in the United States, but all over the world. Only a few, like the boll weevil, the zebra mussel, and the infamously invasive kudzu, have penetrated the public consciousness, but hundreds of other exotics are spreading like wildfire across the land. These aliens have already transformed our landscapes, depleted our biological diversity, and cost us billions of dollars. They need to be brought under control.  \"We can't afford to keep ignoring or underestimating the invasion,\" writes Robert Devine as he takes the measure of this extraordinary ecological assault, explaining where alien species come from, how they establish their beachheads and expand, why they seem so much hardier than the indigenous species they displace, and what we can do to neutralize them. A fascinating and informative book that ranges from Hawaii to Florida, Alien Invasion combines state-of-the-art environmental science with vivid personal stories of the impact of exotics, from a firefighter's gripping tale of a fatal cheatgrass blaze to an eerie boat ride through an Everglades grove where all other life has been choked out by a foreign tree.",
        "Category": " Science , Environmental Science",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Europe: Road to Unity",
        "Authors": "By Lewis, Flora",
        "Description": "Presents a series of country-by-country portraits that capture the essence and idiosyncracies of each nation and reveal the issues crucial to the continent as a whole, including the unification of Germany, the breakup of the Soviet Union, and the changes leading to economic unity",
        "Category": " History , General",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Sciencing: An Involvement Approach to Elementary Science Methods",
        "Authors": "By Cain, Sandra E. and Evans, Jack M.",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Merrill Pub Co",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Poet Auden: A Personal Memoir",
        "Authors": "By Rowse, A. L.",
        "Description": "Part memoir, part literary criticism, this collection of caring and witty reflections by a friend and colleague of the poet includes portraits of the members of the writer's circle in which Auden traveled and a look at the culture in which he flourished",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Olympic Marketing Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "His Picture in the Papers: A Speculation on Celebrity in America Based on the Life of Douglas Fairbanks, Sr.",
        "Authors": "By Richard Schickel",
        "Description": "",
        "Category": "",
        "Publisher": "Charterhouse, New York",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Forbidden Fruit: The True Story of My Secret Love Affair With Ireland's Most Powerful Bishop",
        "Authors": "By Murphy, Annie",
        "Description": "After eighteen years of secrecy, culminating in one of the greatest scandals ever to befall the Catholic Church, here at last is the true - and the only authorized - account of Annie Murphy and her love affair with Eamonn Casey, Bishop of Galway, Ireland. Romantic, spellbinding, and often shocking, the haunting passion of this profound love story is quite simply unforgettable and rivals any in recent fiction.Annie Murphy came to Ireland from the United States in 1973 after the breakup of a turbulent marriage. She made the trip hoping to find spiritual peace under the guidance of a distant cousin, Eamonn Casey, then Bishop of Kerry. Instead, she found a charming, dynamic man - and the attraction was immediate and mutual. Within weeks the two were lovers, caught up in a whirlwind romance at Casey's hilltop retreat on the Atlantic coast.Fifteen months after Annie's arrival, she and Eamonn became parents. But sadly for Annie, the love Eamonn felt for her - and the Church - did not extend to his son, Peter. Fearing scandal, the Bishop did everything possible to force Annie to give Peter up for adoption - and even went so far as to interfere with her medical attention when she developed a life-threatening infection after the birth. When Annie resisted and returned to America to raise her child alone, the Bishop did his best to cover up Peter's existence, shunning contact with his secret family and providing only sporadic financial support.Despite Casey's efforts, however, knowledge of Peter - and the Bishop's affair with Annie Murphy - could not remain a secret forever. In May of 1992, Annie and the son the Bishop tried so desperately to hide went public and forced Casey to acknowledge the truth. The disclosure caused Casey, the Bishop of Galway, to resign from his diocese - and added fuel to the ongoing debate over the Church's positions on celibacy, birth control, abortion, and the role of the clergy.Forbidden Fruit is an astonishing and unique story of a union so powerful it rocked the foundations of the Catholic Church. Replete with intrigue, drama, and breathtaking emotion, it is ultimately a story not only of deception and denial but, most important, of love and forgiveness. For despite all the controversy, the extraordinary passion between Annie Murphy and the Bishop of Galway blazed so brightly that it still reverberates through both their lives, all these years later.",
        "Category": " Religion , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Hole in the Universe: How Scientists Peered over the Edge of Emptiness and Found Everything",
        "Authors": "By Cole, K. C.",
        "Description": "Welcome to the world of cutting-edge math, physics, and neuroscience, where the search for the ultimate vacuum, the point of nothingness, ground zero of theory, has rendered the universe deep, rich, and juicy. \"Modern physics has animated the void,\" says K. C. Cole in her entrancing journey into the heart of Nothing. Every time scientists and mathematicians think they have reached the ultimate void, new stuff appears: a black hole, an undulating string, an additional dimension of space or time, repulsive anti-gravity, universes that breed like bunnies. Cole's exploration at the edge of everything is as animated and exciting as the void itself. Take Cole's hand on this adventure into the unknown, and you'll come back informed, amused, and excited.",
        "Category": " Science , Philosophy & Social Aspects",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Wiesenthal File, The",
        "Authors": "By Levy, Alan",
        "Description": "Simon Wiesenthal spent four and a half years in Nazi concentration camps during World War II. Eighty-nine family members and relatives were exterminated, and he himself ended the war a living skeleton. Almost fifty years later, Wiesenthal remains undauntedly committed to the cause of justice for the Jewish people and to the pursuit of Nazi war criminals. The cases he has pursued are many - he has brought eleven hundred Nazis to trial - and his name has frequently hit world headlines in connection with such figures as Adolf Eichmann, Franz Stangl, Josef Mengele, and Kurt Waldheim.Of his enormous personal courage there is no doubt. But so long after the war, is Wiesenthal's work still important? Does it have meaning? Is he making a positive contribution to post-Holocaust Judaism? Wiesenthal's answer is resolute: \"We live in a modern world. We know there is pollution. The air is bad, the water is bad, the skies are dirty. But there is another sort of pollution that people ignore. In many countries people are living between murderers, and that is the biggest pollution of all.\"This book by internationally known author and journalist Alan Levy - an acquaintance of Wiesenthal for many years - is the first critical examination of Wiesenthal's life and work. The story of Wiesenthal's pursuit of war criminals - often detailed in Wiesenthal's own words - offers reading as exciting as any thriller. But The Wiesenthal File is much more than that. It is an examination by an independent-minded Jew of the work of one of the greatest Jewish figures of our century.",
        "Category": " History , General",
        "Publisher": "Wm. B. Eerdmans Pub. Co.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "This Noble Land:: My Vision for America",
        "Authors": "By Michener, James A.",
        "Description": "Deteriorating race relations, a growing disparity between rich and poor, the decline of education and a growing anti-intellectualism, inadequate health care - these are among the fracture points that Mr. Michener believes threaten America's vitality and its future. As a scholar of world history, a dedicated, lifelong public servant, and a student of his own and other cultures, Michener offers a broad and learned perspective on these much debated issues. He compares America's shift from a producer to a consumer nation to a similar movement in sixteenth-century Spain - a movement that presaged the decline of the Spanish empire. In today's control of vast wealth by a tiny handful of people, he sees parallels with the Catholic Church's monopoly on wealth in pre-Reformation Europe. He evaluates the Contract with America and other current political initiatives in light of the Founding Fathers' understanding of the social contract and the responsibility the more fortunate have to those who are less privileged. And as a lifelong practitioner and patron of the arts, Michener writes movingly of the arts as agents for change - for transforming the soul and ensuring a civilization's greatness - even as he condemns the anti-art stance of many politicians today.Michener draws not only on his knowledge of history but also on over eight decades of living as an American. He recalls how as a young boy in a Pennsylvania schoolhouse he pledged allegiance to the flag, and through the years his reverence for the sound principles on which America was founded has remained strong. Through the trials of young manhood during the Great Depression and the Second World War, and through the decades since, James Michener has been deeply involved in America's political life. He has experienced and studied the qualities that have made America what he calls \"the outstanding success\" among nations, and in his wise, opinionated, and impassioned book he calls on Americans to hold fast to America's sound historical standards and principles as we struggle to solve today's crises and to meet the challenges of tomorrow.",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Mismeasure of Woman: Why Women Are Not the Better Sex, the Inferior Sex or the Opposite Sex",
        "Authors": "By Tavris, Carol",
        "Description": "A work that challenges accepted notions about the sexes traces the deep-rooted sense of guilt and deficiency in women that has been caused by the practice of defining man as the norm and woman as his opposite. 30,000 first printing. Tour.",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Angel Letters",
        "Authors": "By Burnham, Sophy (EDT)",
        "Description": "In her bestselling first book about the beautiful presence of celestial beings in human affairs, A BOOK OF ANGELS, Sophie Burnham generated a wave of response from readers all across America. Now, in ANGEL LETTERS, Burnham shares the moving stories of readers who have written to her of their personal encounters describing experiences of healing, rescue, warning, comfort and blessings .",
        "Category": " Religion , Inspirational",
        "Publisher": "Wellspring/Ballantine",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Caroline's Daughters",
        "Authors": "By Adams, Alice",
        "Description": "An incisive portrait of the interconnected lives of thrice-married Caroline Carter and her five very different daughters--Sage, Liza, Fiona, Jill, and Portia--is set against the colorful backdrop of San Fransicco",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "For the Record: From Wall Street to Washington",
        "Authors": "By Regan, Donald T.",
        "Description": "The deposed Chief of Staff charts his political rise and fall, offering a lively critique of the Reagan administration, particularly \"Irangate\" and the ensuing chaos for which many blamed Regan",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Happy Hours: Alcohol in a Woman's Life",
        "Authors": "By Jersild, Devon",
        "Description": "Did You KnowFemale alcoholics are twice as likely to die as male alcoholics in the same age groupWomen metabolize alcohol differently from men, more quickly developing such physical complications as liver disease, high blood pressure, and hepatitis. A female alcoholic is more likely to suffer from depression, anxiety, and eating disorders, which may not go away even if she stops drinking.  An astonishing four million women in the U.S. meet the diagnostic criteria for abuse or dependence. When a woman drinks, she is five times more likely to be raped.These are just a few of the alarming facts you will learn from this book -- facts every woman needs to know. Mixing cutting-edge research with affecting stories of women who struggle with alcohol problems, Happy Hours challenges our assumptions and expands our awareness of the role alcohol plays in women's lives.",
        "Category": " Self-help , Substance Abuse & Addictions , Alcohol",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Bergdorf Blondes: A Novel",
        "Authors": "By Sykes, Plum",
        "Description": "A wealthy and spoiled young woman living at the peak of New York society searches for true love and the meaning of life while coping with her broken engagement, stalkers, dermatologists, premieres, eyebrow waxes, shopping, and endless telephone calls from England from her mother, who is pressuring her to marry the Earl next door. A first novel. Reprint.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Miramax",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Life Strategies",
        "Authors": "By McGraw, Phillip C., Ph.D.",
        "Description": "Some people spend their lives reacting to what life hands them, while others craft life to fit their goals. Author Phillip C. McGraw, who is a psychologist but describes himself as a strategist, is determined to make sure that his readers are the creators of their lives, not created by their lives. By accepting that you are personally accountable for every element of your life, McGraw says, you can erase the negative \"epidemic behaviors\" (found in all of American society: denial, false assumptions, inertia, deceptive masking) in your life and reach your goals.Written in a tough-love, sometimes cantankerous tone, this self-help book is not for those looking to explore their inner child or visualize away negative energy. No, this is pull-yourself-up-by-the-bootstraps advice from someone who's done just that. McGraw opens with a scene describing how he helped Oprah Winfrey survive--and win--the 1998 \"Mad Cow\" lawsuit in Texas, when she was having difficulty coping with the reality of what was happening to her. He helped her face the facts about the lawsuit, after which she was better able to participate in crafting a strategy to win it. McGraw first forces you to take a good hard look at who you are by dissecting your personality. It may be painful to realize that you fall into the \"Porcupine\" or \"Perfecto\" or any of the other personality types McGraw delineates, but here it's true that there's no gain without pain, because (Life Law No. 4) \"You Can't Change What You Don't Acknowledge.\" He then describes in depth all 10 \"Life Laws\"--the rules by which the world plays--that he learned the hard way. Laws such as \"You Either Get It, or You Don't,\" \"Life Is Managed; It Is Not Cured,\" and \"You Have to Name It to Claim It\" make up the bulk of the book and McGraw's realist philosophy. If you learn and abide by the Life Laws and go on to create a Life Strategy, McGraw claims you will not only know yourself better and eliminate negative behaviors, you will also know how to reach any goal you set for yourself. --Stefanie Durbin",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Hyperion-Acquired Assets",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Big Russ and Me: Father and Son: Lessons of Life",
        "Authors": "By Russert, Tim",
        "Description": "The acclaimed journalist offers a heartwarming memoir of life with his father, describing growing up in the 1950s in working-class Buffalo with his extraordinary father, a proud WWII veteran, as well as the influence of his Catholic upbringing, his passion for sports, and the importance of hard work, responsibility, and patriotism. Reprint.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Miramax",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    }
]