[
    {
        "Title": "A Separate Peace with Connections (HRW Library)",
        "Authors": "By Holt Mcdougal (COR)",
        "Description": "",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Holt McDougal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Inner Revolution",
        "Authors": "By Thurman, Robert A. F.",
        "Description": "The New York Times calls him \"America's number one Buddhist.\" He is the co-founder of Tibet House New York, was the first American Tibetan Buddhist monk, and has shared a thirty-five-year friendship with the Dalai Lama. Now,Robert Thurman presents his first completely original book, an introduction to Buddhism and \"an inspiring guide to incorporating Buddhist wisdom into daily life\" (USA Today). Written with insight, enthusiasm, and impeccable scholarship,Inner Revolution is not only a national bestseller and practical primer on one of the world's most fascinating traditions, but it is also a wide-ranging look at the course of our civilization--and how we can alter it for the better. \"Part spiritual memoir, part philosophical treatise and part religious history, Thurman's book is a passionate declaration of the possibilities of renewing the world\" (Publishers Weekly, starred review).",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Lost Cities of the Maya (Discoveries)",
        "Authors": "By Baudez, Claude F. and Picasso, Sydney",
        "Description": "The story of the rediscovery of the lost Mayan ruins eight to ten centuries after their abandonment, lavishly illustrated and including historical documents. Originally published in French in 1987 (Gallimard). Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Social Science , Archaeology",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Life in Ancient Egypt",
        "Authors": "By Erman, Adolf",
        "Description": "What was it like to live in the ancient land watered by the Nile, thousands of years before Christ was born? How did a man earn his living, what did he wear, where did he go in his leisure time? What was the relationship between an ordinary Egyptian and his government, his wife, his children? Was life for him grim or optimistic, difficult or easy, reverent or worldly? Did his people travel, explore, conquer? Were they very much different from those of the other great civilizations of antiquity, the Greek and the Roman? What was the nature of their science, art, magic, religion? If the past has lessons for the present, what can we deduce from ancient Egyptian life that is of value to us today?For generations, scholar, specialists, and general readers have been turning to a monumental sourcebook for the answers to such questions: Life in Ancient Egypt by Adolf Erman. It is one of the most influential and frequently consulted works on Egyptology ever written, a classic in its field and the basis of numerous other studies and works. It is still one of a very few books that offer the modern reader so satisfying, informative, and complete a survey in one volume.Erman, a rigorously trained scholar, Director of the Egyptian Museum in Berlin, and author of standard works on Egyptology, covers his subject thoroughly and with a wealth of interesting, concrete detail. He examines ancient Egypt’s political structure, crime and police systems, domestic life and kinships, dress, amusements, religion, learning, mathematics, magic and folk beliefs, literature, art, agriculture, trades, arts and crafts, commerce, warfare, and much else. His objective point of view, eschewing romanticism on the one hand and frigid pedantry on the other, gives us a treatment that is as trustworthy in fact as it is evocative in effect — as Professor Jon Manchip White says in his new introduction for this edition, “From first to last … a superb performance.” The scholar, the student and the merely curious can do no better than to go to this first, great authority on ancient Egypt. Profusely illustrated throughout.",
        "Category": " History , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "25 Bicycle Tours in New Jersey",
        "Authors": "By Zatz, Aline and Zatz, Joel",
        "Description": "Describes bicycle tours in each section of the state, provides detailed directions, and includes information on the length, terrain, and traffic of each route",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Countryman Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "The World of the Ancient Maya",
        "Authors": "By Henderson, John S.",
        "Description": "\"General overview of the ancient Maya begins with summary discussions of the history of Maya studies, the environment and geography of the Maya world, and the European invasion. Text is devoted primarily to a synthesis of the history of Maya cultural traditions based primarily on archaeological data and complemented by epigraphic and ethnohistorical information\"--Handbook of Latin American Studies, v. 57.",
        "Category": " Social Science , Archaeology",
        "Publisher": "Cornell Univ Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "A delicately personal matter: A J.D. Mulroy mystery novel",
        "Authors": "By Werry, Richard R.",
        "Description": "",
        "Category": "",
        "Publisher": "Dodd, Mead",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Terrorism and Democracy",
        "Authors": "By Turner, Stansfield",
        "Description": "Admiral Stansfield Turner is a former director of central intelligence (1977-1981) and a former commander-in-chief of NATO's Southern Flank. He looks at the policies of eight presidents in dealing with terrorism and suggests how to balance pragmatism and democratic principles. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "A Son of Thunder: Patrick Henry and the American Republic",
        "Authors": "By Mayer, Henry",
        "Description": "Patrick Henry was a brilliant orator whose devotion to the pursuit of liberty fueled the fire of the American Revolution. As a lawyer and a member of the Virginia House of Burgess, Henry spoke eloquently of the inalienable rights all men are born with. His philosophy inspired the Declaration of Independence, the Constitution, and, most significantly, the Bill of Rights. Famous for the line \"Give me liberty or give me death!\" Patrick Henry was a man who stirred souls and whose dedication to individual liberty became the voice for thousands. A Son of Thunder is as eloquent, witty, charged, and charismatic as its subject.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Cam Jansen and the Triceratops Pops Mystery #15",
        "Authors": "By Adler, David A. and Natti, Susanna (ILT)",
        "Description": "The Cam Jansen series is perfect for young readers who are making the transition to chapter books. The first ten books in the series have received updated covers, bringing new life to these perennial bestsellers. Now the series redesign continues with five more books, giving Cam a cool, modern look!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Summerland",
        "Authors": "By Chabon, Michael",
        "Description": "For over a century, the people of Clam Island, Washington, have enjoyed barbecues and baseball games at Summerland, on the Western tip of the island, where it never rains. The small beings - known as ferishers - who ensure this perfect weather, however, are threatened by an ancient enemy, and need a hero - a baseball star, in fact - to vanquish their foe. Summerland is the story of Ethan Feld, the worst ball player in the history of the game, recruited by a hundred-year-old scout called Ringfinger Brown, himself a Negro League Legend. Accompanied by his determined friend, Jennifer T. Rideout, and guided by a friendly werefox, Ethan struggles to defeat giants, bat-winged goblins, and one of the toughest ballclubs in the realms of magic, to save all the Summerlands, and ultimately the world.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Hyperion Books",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Three Gospels",
        "Authors": "By Price, Reynolds (EDT)",
        "Description": "A decade after he published his famous first novel, A Long and Happy Life, Reynolds Price began a serious study of the Hebrew and Greek narratives which combine to form that crucial document of Western civilization we call the Bible. Since early childhood, Price had known Bible stories of patriarchs, kings, prophets, and the boldly assertive women of Ancient Israel, as well as the four-fold gospel story of the life of Jesus -- another Jew whose career has exerted immense fascination on subsequent history.  In Price's early middle age, however, he felt compelled to go further than simple reading; he began to investigate the rudiments of the Bible stories as deeply as possible. He focused on the Hebrew and Greek originals that are unquestionably the most discussed and annotated texts with the close assistance of other literal versions and of numerous scholarly commentaries, old and modern. He was likewise encouraged and helped by frequent discussions with distinguished scholar-colleagues at Duke University, where he has taught since 1958.  As the work continued over several years, Price expanded his translation attempts into the Greek New Testament. And soon he had begun an informal navigation of the shoals of Koine Greek -- that common Mediterranean dialect in which a good deal of the business of the Roman empire was conducted and in which the gospels and all other books of the New Testament were written. Gradually, his translations of separate incidents from the four gospels evolved into a literal translation of the whole of the oldest gospel, Mark. His first version of Mark appeared, along with other translations from the Old and New Testaments, in A Palpable God (Atheneum, 1978). The book met with a wide and favorable reception from scholars, writers, and critics.  Price's studies have expanded steadily in the intervening decades; and in recent years he has worked at both a revised version of his early translation of Mark and an entirely new literal version of the Gospel of John (John is the lastpublished gospel and almost surely the one that comes, at its core, from an eyewitness of the life of Jesus). To his new translations, Price has added extensive prefaces, which he hopes will be of interest to scholars and casual readers alike. The prefaces are the result not only of his own work as a translator and his discussions with New Testament scholars of more than twenty years reading in textual exegesis, in the life of the first-century Roman world (including the immensely complicated realities of Roman Palestine), but also in consideration of thewidespread and ongoing attempt to reconsider the historical bases of our knowledge of Jesus.  Finally, after twice teaching a semester-long seminar on the gospels of Mark and John at Duke University, Price has written a gospel of his own. The new gospel, which he calls \"apocryphal\" in a non-canonical sense, makes a fresh attempt at a compact narrative of the life and work of Jesus. Yet it is an attempt grounded meticulously in the earliest available historic, biographical, and theological evidence. In a third and final preface, Price describes the motive for writing a gospel of his own. In brief, his new gospel (like the whole of Three Gospels) aims to render the highest possible contemporaryjustice to a life lived two thousand years ago, a life presented in -- and, to a startling extent, still recoverable from -- documents that have proved the most influential in Western history.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Creative Conversations: The Writer's Complete Guide to Conducting Interviews",
        "Authors": "By Schumacher, Michael",
        "Description": "Offers practical advice on preparing for, arranging, and conducting interviews, shows how to use an interviewee's words, and discusses legal and ethical aspects",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Doing It",
        "Authors": "By Burgess, Melvin",
        "Description": "I mean-I like girls. I get on well with them. And I like sex. Not that I've had all that much experience of it-not with another person being in the room at the same time, anyway. I just can't somehow put the two together. I can be getting on really well with a girl but as soon as I get an inkling that there might be a chance of anything happening, I just freeze up. It's scary.Everything you never wanted to know about sex and boys-but probably should Dino, Jonathan, and Ben have got some problems, mostly with Jackie, Deborah, and Alison. Dino's girlfriend Jackie, the most beautiful girl in school, drives him mad with lust, but won't go all the way and relieve Dino of his desperately unwanted virginity.Jonathan likes Deborah. She's smart and funny and she makes him feel very sexy, but she's kind of plump and his mates won't let him hear the end of it. Ben's been seduced by Alison, the pretty young drama teacher at school. And what seems like a dream come true is actually making him miserable. Award-winning author Melvin Burgess has written a daringly honest and often hilarious account of contemporary teenage life, and the ups and downs that surround \"doing it.\" I mean-I like girls. I get on well with them. And I like sex. Not that I've had all that much experience of it-not with another person being in the room at the same time, anyway. I just can't somehow put the two together. I can be getting on really well with a girl but as soon as I get an inkling that there might be a chance of anything happening, I just freeze up. It's scary.Everything you never wanted to know about sex and boys-but probably should Dino, Jonathan, and Ben have got some problems, mostly with Jackie, Deborah, and Alison. Dino's girlfriend Jackie, the most beautiful girl in school, drives him mad with lust, but won't go all the way and relieve Dino of his desperately unwanted virginity.Jonathan likes Deborah. She's smart and funny and she makes him feel very sexy, but she's kind of plump and his mates won't let him hear the end of it. Ben's been seduced by Alison, the pretty young drama teacher at school. And what seems like a dream come true is actually making him miserable. Award-winning author Melvin Burgess has written a daringly honest and often hilarious account of contemporary teenage life, and the ups and downs that surround \"doing it.\"",
        "Category": " Young Adult Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Henry Holt and Co. (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Wind in the Willows (Children's Classics)",
        "Authors": "By Kenneth Grahame",
        "Description": "",
        "Category": "",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "500 Full-Size Patchwork Patterns",
        "Authors": "By Malone, Maggie",
        "Description": "Provides templates for making traditional patchwork quilts, and briefly explains how to plan a quilt, cut pieces, and assemble quilt blocks",
        "Category": " Art , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Cases in managerial finance (The Dryden Press series in finance)",
        "Authors": "By Eugene F Brigham",
        "Description": "",
        "Category": "",
        "Publisher": "Dryden Press",
        "Price Starting With ($)": "11.01",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Stress And The Family: Coping With Normative Transitions (Psychosocial Stress Series)",
        "Authors": "By McCubbin, Hamilton I. (EDT)",
        "Description": "First published in 1983. Routledge is an imprint of Taylor & Francis, an informa company.",
        "Category": " Psychology , Psychotherapy , Couples & Family",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Demon of the Waters: The True Story of the Mutiny on the Whaleship Globe",
        "Authors": "By Gibson, Gregory",
        "Description": "Documents the mutiny aboard the whaler Globe, which was organized by twenty-one-year-old Samuel Comstock, his plan to build an island kingdom, and the rescue voyage of the Navy schooner Dolphin.",
        "Category": " History , Modern , 19th Century",
        "Publisher": "Little Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Tiananmen Papers : The Chinese Leadership's Decision to Use Force Against Their Own People - In Their Own Words",
        "Authors": "By Liang, Zhang (COM), Nathan, Andrew J. (EDT), Link, Perry (EDT), Nathan, Andrew J., Zhang, Liang, Link, E. Perry (EDT), Zhang, Liang (EDT), Link, E. Perry, and Liang, Zhang",
        "Description": "On the night of June 3-4, 1989, Chinese troops violently crushed the largest pro-democracy demonstrations in the history of the communist regime. In this extraordinary collection of hundreds of internal government and Communist Party documents, secretly smuggled out of China, we learn how these events came to pass from behind the scenes. The material reveals how the most important decisions were made; and how the turmoil split the ruling elite into radically opposed factions. The book includes the minutes of the crucial meetings at which the Elders decided to cashier the pro-reform Party secretary Zhao Ziyang and to replace him with Jiang Zemin, to declare martial law, and finally to send the troops to drive the students from the Square.Just as the Pentagon Papers laid bare the secret American decision making behind the Vietnam War and changed forever our view of the nation's political leaders, so too has The Tiananmen Papers altered our perception of how and why the events of June 4 took the shape they did. Its publication has proven to be a landmark event in Chinese and world history.",
        "Category": " History , Asia , China",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Struggle for Intimacy (Adult Children of Alcoholics series)",
        "Authors": "By Woititz, Janet Geringer",
        "Description": "Janet Woititz, mother of the recovery movement, sensitively addresses the barriers of trust and intimacy that children learn in an alcoholic family. She provides suggestions for building loving relationships with friends, partners, and spouses.",
        "Category": " Self-help , Codependency",
        "Publisher": "Health Communications Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "550 Home Landscaping Ideas",
        "Authors": "By Fell, Derek and Erler, Catriona",
        "Description": "Encompassing more than eighty design topics--including regional and international garden styles, color and plant themes, accents, and seasonal gardens--this inspirational sourcebook features 550 practical and creative landscaping ideas.",
        "Category": " Gardening , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Money Harmony: Resolving Money Conflicts in Your Life and Relationships",
        "Authors": "By Mellan, Olivia",
        "Description": "\"For most of us, money is never just money,\" writes Olivia Mellan. It can also represent love, power, happiness, security, self-esteem, and so much more. As a result, we have intense feelings about money - feelings we often hide from - which prevent us from dealing with it productively, and which make it a primary source of anxiety and conflict in our lives and relationships.Olivia Mellan knows how to help individuals and couples resolve their money conflicts. In Money Harmony, she presents the innovative program she has successfully used for more than a decade in her private practice and in workshops and seminars nationwide. Her reassuring, positive approach gives readers insight through real-life examples and conversations and self-knowledge exercises; teaches readers how to evaluate the impact of childhood experiences on their current money attitudes and behaviors; demystifies the common myths about money that can lead to extreme actions, running the gamut from overspending to avoidance to hoarding; and explains the strengths and weaknesses of various money personality styles, allowing readers to come to terms, comfortably, with their own styles.The second half of Money Harmony is devoted to couples, whose hidden money agendas and often opposing styles can cause conflict. Mellan offers a variety of proven communication techniques: dynamic activities and creative \"moneytalks\" that teach couples how to appreciate and respect differing styles, to resolve simple and complex money conflicts, and to set individual and joint goals. For anyone whose life or relationship is affected by money, Money Harmony is essential reading.",
        "Category": " Family & Relationships , General",
        "Publisher": "Walker & Co",
        "Price Starting With ($)": "16.49",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Who Says Elephants Can't Dance?:  Inside IBM's Historic Turnaround",
        "Authors": "By Gerstner, Louis V., Jr.",
        "Description": "In 1990, IBM had its most profitable year ever. By 1993, the computer industry had changed so rapidly the company was on its way to losing $16 billion and IBM was on a watch list for extinction -- victimized by its own lumbering size, an insular corporate culture, and the PC era IBM had itself helped invent.Then Lou Gerstner was brought in to run IBM. Almost everyone watching the rapid demise of this American icon presumed Gerstner had joined IBM to preside over its continued dissolution into a confederation of autonomous business units. This strategy, well underway when he arrived, would have effectively eliminated the corporation that had invented many of the industry's most important technologies.Instead, Gerstner took hold of the company and demanded the managers work together to re-establish IBM's mission as a customer-focused provider of computing solutions. Moving ahead of his critics, Gerstner made the hold decision to keep the company together, slash prices on his core product to keep the company competitive, and almost defiantly announced, \"The last thing IBM needs right now is a vision.\"Who Says Elephants Can't Dance? tells the story of IBM's competitive and cultural transformation. In his own words, Gerstner offers a blow-by-blow account of his arrival at the company and his campaign to rebuild the leadership team and give the workforce a renewed sense of purpose. In the process, Gerstner defined a strategy for the computing giant and remade the ossified culture bred by the company's own success.The first-hand story of an extraordinary turnaround, a unique case study in managing a crisis, and a thoughtful reflection on the computer industry and the principles of leadership, Who Says Elephants Can't Dance? sums up Lou Gerstner's historic business achievement. Taking readers deep into the world of IBM's CEO, Gerstner recounts the high-level meetings and explains the pressure-filled, no-turning-back decisions that had to be made. He also offers his hard-won conclusions about the essence of what makes a great company run.In the history of modern business, many companies have gone from being industry leaders to the verge of extinction. Through the heroic efforts of a new management team, some of those companies have even succeeded in resuscitating themselves and living on in the shadow of their former stature. But only one company has been at the pinnacle of an industry, fallen to near collapse, and then, beyond anyone's expectations, returned to set the agenda. That company is IBM.Lou Gerstener, Jr., served as chairman and chief executive officer of IBM from April 1993 to March 2002, when he retired as CEO. He remained chairman of the board through the end of 2002. Before joining IBM, Mr. Gerstner served for four years as chairman and CEO of RJR Nabisco, Inc. This was preceded by an eleven-year career at the American Express Company, where he was president of the parent company and chairman and CEO of its largest subsidiary. Prior to that, Mr. Gerstner was a director of the management consulting firm of McKinsey & Co., Inc. He received a bachelor's degree in engineering from Dartmouth College and an MBA from Harvard Business School.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Expert's Guide To Backyard Birdfeeding",
        "Authors": "By Adler, Bill, Hughes, Heide, and Hughes, Heidi",
        "Description": "Analyzes and rates more than 250 bird gadgets, including birdfeeders, birdhouses, birdseeds, birdbaths, and anti-squirrel devices",
        "Category": " Science , General",
        "Publisher": "Crown Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Totline 123 Puppets (1 2 3 Series:  Language Ages 2-6)",
        "Authors": "By Warren, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Warren Publishing House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "American Artists On Art: From 1940 To 1980 (Icon Editions)",
        "Authors": "By Johnson, Ellen H. (EDT)",
        "Description": "From the Preface:The fact that so much of modern art has devoted itself to the exploration and assertion of its own identity is reflected in, but does not explain, the increasing amount of writing and talking on the part of contemporary artists. Rather, the whole history of the changing role of art and artists in a democratic, industrial, and technological society stands behind the spate of artists' words and the public's hunger for them?even some of the general public out there beyond art's little circle. Statements by artists appeal somewhat the way drawings do: they bring us, or at least they hold the promise of bringing us, closer to the artist's thoughts and feelings and to an understanding of his or her modus operandi; they hold the keys to a mysterious realm. And sometimes they offer us the sheer pleasure of good reading. Such is the primary raison d'?e of this book.Its other motivation is educational, and stems from the frustrating lack, in teaching contemporary art, of any single compilation of statements by American artists from 1940 to the present.? This anthology differs in several respects from those others that do include documents of American art since 1940.? The selection I have made is devoted exclusively to statements of artists; it is limited to the last four decades; it presents in a single volume a representative and fairly comprehensive coverage of major developments in American art beginning with Abstract Expressionism; and, whenever possible, it cities the first, or among the very earliest, documents signalizing a shift in the definition, intent, or direction of art.?",
        "Category": " Art , Criticism & Theory",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "Swan watch",
        "Authors": "By Budd Schulberg",
        "Description": "",
        "Category": "",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The American musical theater;: A consideration (A CBS Legacy collection book)",
        "Authors": "By Engel, Lehman",
        "Description": "",
        "Category": "",
        "Publisher": "Distributed by the Macmillan Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The Princess Test (Princess Tales)",
        "Authors": "By Andersen, Hans Christian, Levine, Gail Carson, Elliott, Mark (ILT), and Elliott, Mark",
        "Description": "Gail Carson Levine charmed the world with Ella Enchanted, her spirited retelling of the Cinderella story. Now this award-winning author turns her attention to two more classic fairy tales, and deftly turns them upside down and inside out with her trademark wit and hilarity. In The Fairy's Mistake, two very different sisters have two very different encounters with the fairy Ethelinda. Rosella is kind and helpful. Her reward: Jewels and gems tumble out of her mouth whenever she speaks. Myrtle is rude and spiteful. Her punishment: Bugs and vipers slither out of her mouth. The fairy Ethelinda feels she's meted out justice just right--until she discovers Rosella has been locked up by a greedy prince and Myrtle is having the time of her life!  In The Princess Test, King Humphrey has decided its time for his son, Prince Nicholas, to marry. But he must make sure the bride is a real princess. So he devises a series of princess tests, designed to weed out the phonies and the fakes. Meanwhile, Nicholas has fallen in love with Lorelei, a mere blacksmith's daughter. She's no princess, but he wants to marry her all the same--but how will she ever pass the terrible tests?In these first two delightfully entertaining, laugh-out-loud Princess Tales, Gail Levine gently spoofs the notion that fairies are always right and that tests can never prove a persons worth, but holds fast to the notion that true love will always win in the end.",
        "Category": " Juvenile Fiction , Royalty",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Nature of Theatre.",
        "Authors": "By Roberts, Vera Mowry",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "7.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Interactive Bulletin Boards",
        "Authors": "By Prizzi, Elaine and Hoffmann, Jeanne",
        "Description": "",
        "Category": "",
        "Publisher": "Lake Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Parthian Words",
        "Authors": "By Storm Jameson",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.86",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Best Cat Stories",
        "Authors": "By O'Mara, Lesley and Geldart, William Geldart (ILT)",
        "Description": "23 fabulous feline tales.  A literary feast for cat lovers, here are the finest of cats stories from James Herriot, P.G. Wodehouse, Damon Runyon, Doris Lessing, Patricia Highsmith, et al.  Introduction by Doris Lessing.  Line art throughout.",
        "Category": " Pets , Cats , General",
        "Publisher": "Wings",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Religion in America: An historical account of the development of American religious life",
        "Authors": "By Hudson, Winthrop Still",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Why Can't I Fall in Love? A 12-Step Program",
        "Authors": "By Boteach, Shmuel",
        "Description": "If any of this sounds familiar, you're not alone. We've become a nation of lonely serial daters, consumed by work, suspicious of romance, so unsure of finding lasting love that we settle for dispiriting blind dates and the company of friends. In short, we've forgotten how to fall in love.But help is on the way. In Why Can't I Pall in Love? Shmuley Boteach, author of the international bestseller Kosher Sex, offers hope for anyone who wonders why love is so hard to find. Bringing love into your life, he counsels, is about more than just sizing up candidates and waiting for a ring. It's about finding your way back to innocence -- back to the Garden, where Adam and Eve invented romance.Combining anecdotes with practical tips, Boteach proposes a radical new approach to love, an approach designed to help singles and those in long-term relationships alike. And his Twelve LoveSteps program describes measures anyone can take to make the dream of love a reality, including:Heal your love woundCall a moratorium on datingLet go of people who are wasting your timeRecapture your mental virginityFilled with helpful exercises -- including a Declaration of Dependence to be signed and shared with potential mates -- Why Can't I Fall in Love? offers a refreshingly positive strategy to help you embrace love...and change your life.",
        "Category": " Religion , Judaism , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Wolf in the Shadows (A Sharon Mccone Mystery)",
        "Authors": "By Muller, Marcia",
        "Description": "Successful in her investigative work for All Souls Legal Cooperative, happy with her newly renovated house, and feeling somewhat more secure in her relationship with the mysterious environmental activist, Hy Ripinsky, Sharon is shocked to find herself suddenly faced with a wrenching ultimatum. No longer a small, informal co-op, All Souls has grown. New legal partners, exasperated with Sharon's free-wheeling ways, want to kick her upstairs with a raise, perks, and a \"career opportunity\" that will chain her to a desk forever.Offered a take-it-or-leave-it deal, Sharon is in turmoil. And to make matters worse, Hy has disappeared. His abandoned plane, wrecked rental car, and a road map point to RKI, a firm of international security consultants with a reputation for questionable, unorthodox tactics and clients engaged in controversial research. Sharon discovers that they hired Hy as a free-lance operative and that they, too, are looking for him.Determined to find out what has happened, Sharon pushes aside her career concerns at All Souls and plunges into a search that will force her to take unlikely sanctuary in her abandoned San Diego childhood home and find and unexpected ally in her wild, unpredictable brother John. From the drive-by hiring hall for illegal aliens in Imperial Beach to an opulent villa on the Mexican coast, she will track down every clue in a complex plot that builds to a breathtaking climax on the treacherous canyon trails that lead back across the border. There, in a no-man's-land where terrified pollos defy la migra in a desperate bid for freedom...and where decisions won't wait, Sharon must make the tough choices that put her own life, her own freedom, and everything she holds dear at deadly risk.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Just Build the Ark and the Animals Will Come:: Children on Bible Stories",
        "Authors": "By Heller, David",
        "Description": "Young children relate their own intriguing versions of famous biblical stories, including the tales of Noah, Samson and Delilah, the Tower of Babel, and Sodom and Gomorrah. 50,000 first printing.",
        "Category": " Religion , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "A Man for All Seasons: A Play in Two Acts",
        "Authors": "By Bolt, Robert",
        "Description": "The classic dramatization of Sir Thomas More's historic conflict with Henry VIII—a compelling portrait of a courageous man who died for his convictions.Sir Thomas More—the brilliant nobleman, lawyer, humanist, author of such works as Utopia—was a long-time friend and favorite of Henry VIII, ascending to the position of Lord Chancellor in 1529. Yet he was also a staunch Catholic, and when Henry broke with the Church in 1531 after the Pope had refused to grant him a divorce from Catherine of Aragon, More resigned the Chancellorship. In 1534, Parliament passed a bill requiring all subjects to take an oath acknowledging the supremacy of England's king over all foreign sovereigns—including the Pope. More refused, was imprisoned, and finally was executed in 1535. An enduring modern classic, A Man for All Seasons \"challenges the mind, and, in the end, touches the heart\" (New York Times).",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Jeremy: The Tale of an Honest Bunny",
        "Authors": "By Karon, Jan and Weidner, Teri (ILT)",
        "Description": "Jeremy is a handmade English bunny with honesty sewn into his very being. So when he learns that he was made for someone in North Carolina, Jeremy hops right off to deliver himself to his new owner. But North Carolina is a long way from England, as Jeremy quickly learns. Before he can be safely home, Jeremy must rely on help from many people. There's old Mr. Pruneholt, who shows Jeremy where to find America; the kindly sea captain and his chattering parrot, Jethro, who see Jeremy across the water, and the unforgettable Village Dear. Most important of all are the family of young bunnies who teach Jeremy how wonderful it is to be needed. Though he'd love to stay with them, Jeremy can't forget that he has someone waiting for him and must keep moving until he arrives at her doorstep.   Jeremy, the Tale of an Honest Bunny is a story of adventure and friendship, full of humor, inspiration, and joy. It is the story of any child who is away from home-and the miracles found on the way to being safe at last.   Jan Karon says, \"I wanted to do something for my daughter that would last a long time-perhaps even a lifetime. So I wrote a book about a bunny named Jeremy who went on a journey. In the story I included the consoling verse from Psalm 91, the verse we might all hope and pray for our children: \"He will give his angels charge over you, to keep you in all your ways.\"   Throughout the book there are detailed watercolor illustrations from acclaimed artist Teri Weidner. Designed with an old-fashioned charm to match the story's flavor, the book even includes a ribbon with which to keep your place as you read.   Make a place on your shelf for Jeremy alongside your favorite books from childhood-and then be ready to take it down from the shelf again and again.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Invisible No More: The Secret Lives of Women Over 50",
        "Authors": "By Fisher, Renee, Kramer, Joyce, Peelen, Jean, and Llc, Invisible No More",
        "Description": "",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "iUniverse",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Harrap's Spanish and English Pocket Dictionary (Harrap's Dictionaries)",
        "Authors": "By Alvarez Garcia, Teresa (EDT), Rodger, Liam (EDT), and Ron Diaz, Elena (EDT)",
        "Description": "The ideal portable reference for beginners or intermediate learners of SpanishHarrap’s Spanish and English Pocket Dictionary is the most comprehensive portable dictionary available today. Fully revised and up-to-date, this authoritative reference features more than 57,000 references, 90,000 translations, and thorough coverage of Latin American Spanish.Concise and exceptionally easy to use, it’s the perfect dictionary for use at home or in school. In addition, this highly accessible guide:Covers hundreds of new words and expressions, including slang, colloquial usage, technical language, and Internet terms Provides numerous usage notes to help users avoid translation pitfalls Includes a handy guide to Spanish verbs Uses Harrap’s extensive language databases and large-scale reading programs to guarantee thorough coverage of all areas of vocabulary and monitor new words",
        "Category": " Reference , Dictionaries",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The National Air and Space Museum",
        "Authors": "By Bryan, C. D. B.",
        "Description": "",
        "Category": "",
        "Publisher": "Abrams",
        "Price Starting With ($)": "11.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Free Flight: From Airline Hell to a New Age of Travel",
        "Authors": "By Fallows, James M.",
        "Description": "Fallows, a correspondent for  Atlantic Monthly , explores future trends in commercial aviation technology that may make airline travel easier and quicker than the current hub system.  He focuses on three separate groups of innovators who are developing a NASA small plane research program, a small airplane with a parachute for the entire plane, and an inexpensive jet plane for air taxi services. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Industries , Hospitality, Travel & Tourism",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Book of Massage: The Complete Step-by-Step Guide To Eastern And Western Techniques",
        "Authors": "By Lidell, Lucinda, Thomas, Sara, Cooke, Carola Beresford, and Porter, Anthony",
        "Description": "Features instructions on basic holistic massage and discusses the practice of Shiatsu",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "The practice of social research",
        "Authors": "By Babbie, Earl",
        "Description": "",
        "Category": "",
        "Publisher": "Wadsworth Pub. Co",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Endangered Pleasures: In Defense of Naps, Bacon, Martinis, Profanity, and Other Indulgences",
        "Authors": "By Holland, Barbara",
        "Description": "Here is a refreshing look at life as it ought to be.  Bare feet, gardening, dawdling over the newspaper, oversleeping, and idle summer vacations are infinitely more satisfying than counting fat grams, eating only vegetables, and sitting behind that desk every day.  So toss out the guilt and rebel.  Don't just stop and smell the flowers--call in sick and lie among them, preferably with a good friend, a bottle of wine, and a handful of chocolates.  Endangered Pleasures is a delightful reminder that rest and relaxation are more rewarding than a job performance review.  After all, life's too short.  Why not have some fun while you're supposed to be living it?",
        "Category": " Health & Fitness , Sexuality",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Hosting the Birds: How to Attract Birds to Nest in Your Yard",
        "Authors": "By Mahnken, Jan",
        "Description": "On the nesting cycle, with chapters on migration, courtship, nest building, egg laying, care of nestlings and fledglings, and final preparation for winter. The reference section details 175 species, including range, preferred nesting site, clutch size, and incubation and nesting period. 200 pen and ink drawings and 14 color plates. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Garden Way Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Families on the Fault Line",
        "Authors": "By Rubin, Lillian B.",
        "Description": "The author of Worlds of Pain draws on nearly four hundred interviews with adults and children to examine the commonalities among working-class people despite economic forces that create seemingly unbridgeable ethnic divisions. 35,000 first printing; $50,000 ad/promo.",
        "Category": " Social Science , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Our Last Best Shot: Guiding our Children Through Early Adolescence",
        "Authors": "By Stepp, Laura Sessions",
        "Description": "Our Last Best Shot presents the personal stories of twelve girls and boys from across America. Their stories, and Laura Sessions Stepp's extensive research, provide real insight for parents trying to raise well-adjusted children in this difficult age. Filled with wisdom and common sense, based on cutting-edge research, and featuring an invaluable resource list, this is a book that parents and educators cannot afford to be without.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Intermediate Algebra Functions and Authentic Applications",
        "Authors": "By Lehmann, Jay",
        "Description": "This book addresses emphasizes the reform movement in mathematics, discovery learning, and curve fitting. The combination of a strong reference quality along with creative, conceptual, sometimes-applied problems, makes a powerful impression on traditionalists and reformers.  Chapter topics include linear functions, quadratic functions, exponential functions, modeling with sequences and series, rational functions, and radical functions.  For reference use in the study of Intermediate Algebra.",
        "Category": " Mathematics , Algebra , General",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Clustering of America",
        "Authors": "By Weiss, Michael J.",
        "Description": "Offers a detailed analysis of geodemographic statistics, listing the forty basic lifestyle types that can be found in the country's 250,000 neighborhoods and providing a picture of how American lifestyles have changed",
        "Category": " Social Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Nelson Rockefeller,: A biography",
        "Authors": "By Morris, Joe Alex",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "The PreHistory of The Far Side: A 10th Anniversary Exhibit (Volume 14)",
        "Authors": "By Larson, Gary",
        "Description": "A Far Side retrospective, celebrating its tenth anniversary.1989 FarWorks, Inc. All Rights Reserved. The Far Side and the Larson signature are registered trademarks of FarWorks, Inc.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews And McMeel Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Double Buckeyes: A Story of the Way America Used to Be",
        "Authors": "By Shuster, Bud",
        "Description": "In western Pennsylvania during World War II, eleven-year-old Little Buck makes a shocking discovery when his beloved grandfather dies, causing him to question his very identity.",
        "Category": " Juvenile Fiction , Historical , General",
        "Publisher": "White Mane Pub",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Investment Biker: Around the World With Jim Rogers",
        "Authors": "By Rogers, Jim",
        "Description": "Set against the background of a transworld motorcycle adventure, the author surveys the state of the world's economies and their currencies, and offers some disturbing predictions about the direction of the U.S. economy. Reprint.",
        "Category": " Business & Economics , General",
        "Publisher": "Adams Media Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Lyndon Baines Johnson: Late a President of the United States: Memorial Services in the Congress of the United States and tributes in eulogy",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "U.S. Congress, Joint Committee on Printing",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Readings in art history",
        "Authors": "By Spencer, Harold",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Shakedown: Exposing The Real Jesse Jackson",
        "Authors": "By Timmerman, Kenneth R.",
        "Description": "Reporter Timmerman presents an all-out attack on Jesse Jackson. According to Timmerman, Jackson exploits racial politics to extort money from big corporations for the enrichment of himself and his friends. After bringing himself to national political prominence by lying about being the last person Martin Luther King Jr. talked to and then faking his title of Reverend, Jackson consorted with communists, mobsters, KGB agents, drug dealers, dictators, diamond smugglers, and terrorists. He also led a sordid personal life. Timmerman's wide-ranging discussion finds absolutely no redeeming qualities in Jackson. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Civil Rights",
        "Publisher": "Regnery Publishing, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Man Who Saw Through Time (The Scribner Library, Lyceum Editions, No. SL429)",
        "Authors": "By Eiseley, Loren C.",
        "Description": "Examines the life, career, and thought of the Elizabethan philosopher and writer, evaluating the quality and accuracy of his vision of the future",
        "Category": " Philosophy , General",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1973"
        }
    },
    {
        "Title": "Speaking Out for Animals: True Stories About People Who Rescue Animals",
        "Authors": "By Stallwood, Kim W. (EDT)",
        "Description": "",
        "Category": " Nature , Animals , General",
        "Publisher": "Lantern Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2019"
        }
    },
    {
        "Title": "Message from Forever: A Novel of Aboriginal Wisdom",
        "Authors": "By Morgan, Marlo",
        "Description": "Following her modern classic and worldwide bestseller Mutant Message Down Under, Marlo Morgan&#39;s long-awaited new novel is a tale of self-enlightenment about aboriginal twins separated at birth and the search for roots that reunites them form opposite sides of the globe.Once more Morgan unveils the inspiring aboriginal worldview while pointedly exposing the plight of an ancient race rapidly becoming extinct as a result of more than two hundred years of systematic discrimination.Message from Forever follows the lives of Australian aboriginal twins who were taken form their young mother by Christian missionaries. The baby boy is sent to a huge sheep ranch, where he grows up with little adult supervision and random affection. On his own, Geoff develops his talent as an artist, producing work at a level well beyond his five years. The boy is adopted by an American minister and is raised in  New England with little sense of who he is or of his cultural heritage. His sister  is given only the first name Beatrice by the nuns at an Australian orphanage, where she encounters continual racism and experiences shattering looses for the first eighteen years of her life.  Upon reaching adulthood, Beatrice leaves the orphanage to work at a boardinghouse. Beatrice hungers to know more about her ancestral roots. She walks away from her life in the city to strike out into the northern desert nation, where she goes on a walkabout with a small band of Aborigines.  Geoff does not fare so well in America. As a teen, he runs away from home and slips into a life of crime, alcohol, and alienation. His addictions destroy him, and he finds himself on Death Row with little sense of how he got there. After decades of learning about people in the Outback, Beatrice leaves her nomadic life to become a \"runner between both worlds.\" She returns to the Mutant world as a political activist fighting for aboriginal rights of citizens arrested and convicted of crimes in foreign countries, as well as a champion of the rights of adults who were taken from their native culture as children. Her life&#39;s work bring her into contact with her lost brother, though neither is aware of their relationship. Beatrice gives Geoff the \"message from forever,\" which outlines aboriginal philosophy and principles of good living, along with an offer to return to Australia. As we read the message with Geoff, we are challenged to stretch our concepts of identity, spirituality, and openness transcends injustice and degradation, directing us to live our lives in accordance with ageless values and simple wisdom.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "A Prophet In His Own Country: The Triumphs and Defeats of Adlai E. Stevenson",
        "Authors": "By Kenneth S. Davis",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "36.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Hacking Exposed: Network Security Secrets & Solutions, Third Edition (Hacking Exposed)",
        "Authors": "By McClure, Stuart, Scambray, Joel, and Kurtz, George",
        "Description": "The new edition of this powerful best-seller contains a CD-ROM with links to security tools mentioned in the book, key security tools for download from the CD, and a password database. Inside the book, you'll also get all-new security information on 802.11 (Wireless) hacking, Windows XP, Windows.NET Server (code named Whistler), and IIS 5--plus a whole lot more!",
        "Category": " Computers , Security , General",
        "Publisher": "Mcgraw-Hill Osborne Media",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Aditi: The Living Arts of India",
        "Authors": "By Adams, Robert and Sethi, Rajeev (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Smithsonian Institution Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Shuffle Up and Deal: The Ultimate No Limit Texas Hold 'em Guide (World Poker Tour)",
        "Authors": "By Sexton, Mike",
        "Description": "A poker primer from the hosts and stars of the World Poker Tour, offering basic strategy, trivia, and an inside look at this runaway hit. The World Poker Tour has revolutionized the game of poker by putting cameras under the table and raising awareness and enthusiasm to an international level. The World Poker Tour: Shuffle Up and Deal is aimed at the millions of passionate fans of the WPT, whether they're ambitious up–and–comers on the poker circuit, or casual players hoping to take the pot at their next Wednesday night game. Shuffle Up and Deal will be a solid poker primer, covering set–up, play, and basic poker strategy, along with many of the interactive elements of the WPT TV show: poker trivia, definitions of poker terms using examples from the show, profiles of WPT star players, insights into the world of professional poker, and an inside look at the show.",
        "Category": " Games & Activities , Card Games , Poker",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Practical Small Gardens",
        "Authors": "By McHoy, Peter",
        "Description": "",
        "Category": " Gardening , Vegetables",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "A Taste for Love: A Romantic Cookbook for Two",
        "Authors": "By Harbison, Elizabeth M. and McGowan, Mary",
        "Description": "In the spirit of romance, A Taste for Love presents an imaginative selection of menus—plus romantic verse, decorating ideas and music selections—designed specifically to stir a lover's passion.  Create the ultimate in intimate dining experiences with such tantalizing treats as:- Soupe de Provence avec Pistou- Angel Hair Pasta with Braised Garlic- Simple Oven-Baked Beef Stew- Herb-Roasted Tomatoes with Romano Cheese- Pleasantly Puffed Scallops- Chocolate Kahlúa Soufflé- Broadway Cappuccino Custard- Raspberry Tortaand much more!",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Venom of Argus",
        "Authors": "By Avery, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1976"
        }
    },
    {
        "Title": "The Closing of the American Mind",
        "Authors": "By Bloom, Allan",
        "Description": "THE BRILLIANT AND CONTROVERSIAL CRITIQUE OF AMERICAN CULTURE WITH NEARLY A MILLION COPIES IN PRINT  In 1987, eminent political philosopher Allan Bloom published The Closing of the American Mind, an appraisal of contemporary America that “hits with the approximate force and effect of electroshock therapy” (The New York Times) and has not only been vindicated, but has also become more urgent today. In clear, spirited prose, Bloom argues that the social and political crises of contemporary America are part of a larger intellectual crisis: the result of a dangerous narrowing of curiosity and exploration by the university elites. Now, in this twenty-fifth anniversary edition, acclaimed author and journalist Andrew Ferguson contributes a new essay that describes why Bloom’s argument caused such a furor at publication and why our culture so deeply resists its truths today.",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Fight Fat After Forty",
        "Authors": "By Peeke, Pamela",
        "Description": "It's a fact: stress makes you fat. Renowned clinician and scientist Dr. Pamela Peeke goes beyond diet and exercise with a lifestyle program that shows women how to stop being diet \"POWs\" (\"Prisoners Of Weight\") or victims of \"Toxic Stress\" and how to evolve into physically and mentally stress-resilient individuals. Peeke helps women identify their stress-eating profiles (Are you a stress-overeater? A stress-undereater?) and explains that to remove weight, you have to lift weight. She explains what to eat and, equally as important, when to eat by navigating the afternoon \"CortiZone,\" the hours of highest vulnerability to stress eating. Learn how to put it all together through the fine art of regrouping.Women can tailor this accessible program to their individual needs using Peeke's three behavior templates:* Stress-resilient nutrition* Stress-resilient physical activity* Stress-resilient regroupingDr. Peeke's program is a must for women who want to break the stress-fat cycle that has thickened their after-forty waistlines.",
        "Category": " Health & Fitness , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "On the Edge of Cliff",
        "Authors": "By Pritchett, V. S.",
        "Description": "The celebrated writer offers a new collection of nine short stories that are marked by their wit, comic exuberance, and authenticity in portraying the idiosyncrasies of characters",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Romans",
        "Authors": "By Navigators",
        "Description": "Living, Dying, ResurrectingWhat does Jesus’ life, death, and resurrection mean for my life, death, and resurrection? In Romans, Paul—one of Christianity’s first theologians—sets out to answer that question. Tracing numerous threads through the Old Testament, Paul shows how Jesus’ death on the cross draws together humanity’s collective failures and transforms them into a rich tapestry. Sin and death lose their power as we are bound up into resurrection life with God. Follow the threads and find your place in the story God is weaving into the world through Christ.LifeChangeLifeChange Bible studies will help you grow in Christlikeness through a life-changing encounter with God’s Word. Filled with a wealth of ideas for going deeper so you can return to this study again and again.FeaturesCover the entire book of Romans in 20 lessonsEquip yourself to lead a Bible studyImagine the Bible’s historical worldStudy word origins and definitionsExplore thoughtful questions on key themesGo deeper with optional projectsAdd your notes with extra space and wide marginsFind the flexibility to fit the time you have",
        "Category": " Religion , Biblical Studies , New Testament , Paul's Letters",
        "Publisher": "NavPress",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2018"
        }
    },
    {
        "Title": "Ain't You Glad You Joined the Republicans?: A Short History of the Gop",
        "Authors": "By Batchelor, John Calvin",
        "Description": "John Calvin Batchelor's \"Ain't You Glad You Joined the Republicans?\" (Abraham Lincoln's 1860 campaign slogan) is the truth, and nothing but the unbelievable truth, of the Grand Old Party of the Republic. Born in the cataclysm of the antislavery movement, the Republican Party was from the first - and remains today - the most successful revolutionary party in the history of democracy. And the Party's story - from Lincoln to Teddy Roosevelt to Nixon, Reagan, and Gingrich - is the pageant of American politics.Using primary sources long overlooked by traditional historians and employing a novelist's eye and ear for the telling detail, Batchelor, in his sweeping narrative, encompasses one and a half centuries of Republican battle and paradox.",
        "Category": " Political Science , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Professional: Lyndon B. Johnson",
        "Authors": "By White, William Smith",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "12.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Don't Know Much About the Bible: Everything You Need to Know About the Good Book but Never Learned",
        "Authors": "By Davis, Kenneth C.",
        "Description": "Nine out of ten Americans own a Bible, but how much do they know about the one book that has influenced human history more than any other? Don't Know Much About the Bible by New York Times bestselling author Kenneth C. Davis is designed to illuminate everything we need to know about the Good Book but never learned.With wit, authority, and intelligence, Davis brings the world of the Old and New Testaments to vivid life, setting the panorama of the Scriptures against the historical events that shaped them; clearing up misconceptions and mistranslations; summarizing Bible stories, parables, and miracles; and adding fresh new insights to the world's most owned, least understood book.Davis is uniquely qualified for the assignment. The creator of the bestselling Don't Know Much About series, which has more than 1.6 million copies in print, he now illuminates the bestselling book of all time using his inimitable question-and-answer approach and providing a key to the people, places, and \"household names\" we need to unlock \"The Greatest Story Ever Told.\"Relying on up-to-date research and improved translations, Davis set out to uncover what the Bible says -- and doesn't say. Don't Know Much About the Bible is the result of his efforts and includes the following observations: There are two different Creation stories told in Genesis, but no apple in the Garden of Eden story. Noah invented wine and cursed the son who had seen him drunk and naked. There was no \"coat of many colors\" in the story of Joseph and his jealous brothers, but rather a long-sleeved robe. Moses didn't write the Torah and he didn't part the Red Sea in his escape from Pharaoh. The Sixth Commandment does not condemn all killing. Jericho's walls may have tumbled down because the city lies on a fault line. King David probably didn't kill Goliath and didn't write the Psalms.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Power of Nice",
        "Authors": "By Dale, Jim, Shapiro, Ronald M., and Jankowski, Mark A.",
        "Description": "Demonstrates how Robert Shapiro, an agent and attorney for some of the most famous baseball figures of the present day, successfully makes a deal and skillfully bargains so that all involved walk away a winner. Reprint. 30,000 first printing. $50,000 ad/promo. Tour.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "7.37",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Bringing Out the Best in Your Child: 80 Ways to Focus on Every Kid's Strengths",
        "Authors": "By Tobias, Cynthia Ulrich and Funk, Carol",
        "Description": "",
        "Category": "",
        "Publisher": "Vine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Dave Barry's Stay Fit and Healthy Until You're Dead",
        "Authors": "By Barry, Dave",
        "Description": "In Stay Fit and Healthy Until You're Dead, Dave Barry says that fitness and vitality can be yours-- provided you have the discipline, drive, and the plain old-fashioned guts required to procure the necessary steroids. This manual may help, too, but you'll just have to buy it and find out.Barry on executive fitnessToday's top executives eat teeny meals and run 10 miles and play tennis and work out every day. Of course, they're so busy getting fit that many don't even know where their offices are. That's why the entire U.S. economy is now manufactured overseas.Barry on fitness after deathA quick chill, to approximately 325 degrees below zero, yields a muscle tone that we normally associate only with world-class body builders and certain minerals!Barry on nutritionEvery morning you should take a vitamin A pill, followed by a vitamin D, followed by an E, until you've spelled the healthful mnemonic phrase: \"A DEAD CAD BAKED A BAD CAKE, ACE.\" And eat all the fiber-rich foods you can shove down your throat; these would be mainly your cotton candy and your Slim Jims.Barry on junk foodsWhite bread and refined sugar, if eaten, cause death within hours. So it's important to watch what you eat, at least until you get it inside your mouth. After that it becomes pretty disgusting.",
        "Category": " Humor , Topic , Sports",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Language and Myth",
        "Authors": "By Cassirer, Ernst",
        "Description": "In this important study Ernst Cassirer analyzes the non-rational thought processes that go to make up culture. He demonstrates that beneath both language and myth there lies an unconscious \"grammar\" of experience, whose categories and canons are not those of logical thought. He shows that this prelogical \"logic\" is not merely an undeveloped state of rationality, but something basically different, and that this archaic mode of thought still has enormous power over even our most rigorous thought, in language, poetry and myth.The author analyzes brilliantly such seemingly diverse (yet related) phenomena as the metaphysics of the Bhagavat Gita, the Melanesian concept of Mana, the Naturphilosophie of Schelling, modern poetry, Ancient Egyptian religion, and symbolic logic. He covers a vast range of material that is all too often neglected in studies of human thought.These six essays are of great interest to the student of philosophy or the philosophy of science, the historian, or the anthropologist. They are also remarkably timely for students of literature, what with the enormous emphasis placed upon \"myth\" in modern literary speculation. This book is not superficial speculation by a dabbler, but a penetrating study by one of the most profound and sensitive philosophic minds of our time.",
        "Category": " Philosophy , Religious",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "June",
            "Year": "1953"
        }
    },
    {
        "Title": "Ripken: Cal on Cal",
        "Authors": "By Ripken, Cal, Jr., Iooss, Walter (PHT), and Vancil, Mark (EDT)",
        "Description": "Calvin Edwin Ripken Jr. was voted American League Rookie of the Year in 1982, and in the following year was named the league's Most Valuable Player - an award he received again in 1991.Named to his league's All-Star team twelve times, he has been a consistent offensive force, amassing more career home runs than any other shortstop, and he has fielded his position with captivating skill. In one season (1990) he played every inning and committed only three errors, attaining the highest fielding percentage (.996) of any shortstop in any year.The statistical achievements of Cal Ripken are one legend still in the making. How this Maryland lad grew into a star performer and spiritual inspiration for his teammates and opponents also is the stuff of legend. Here is the Cal Ripken story in pictures and in his own words, modest but forthright like the man himself.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Summit Publishing Group",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "German in 32 Lessons (Gimmick Series)",
        "Authors": "By Adrienne",
        "Description": "",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "24 Essential Lessons for Investment Success: Learn the Most Important Investment Techniques from the Founder of Investor's Business Daily",
        "Authors": "By O'Neil, William J.",
        "Description": "The Wall Street Journal, New York Times, BusinessWeek, and USA Today Business Bestseller!From the publisher of Investor's Business Daily and best-selling author of How to Make Money in Stocks, comes the National Bestseller, 24 Essential Lessons for Investment Success, two dozen of the most important lessons for investors. In this one accessible guide, William J. O'Neil puts his popular and easy-to-follow techniques for building a profitable portfolio firmaly in the hands of investors­­and the goal of long-term financial security easily within their reach.24 Essential Lessons for Investment Success is based upon the closely followed \"26 Weeks to Investment Success\" editorials that appear in Investor's Business Daily. Edited and updated, O'Neil's timeless advice encapsulates such investing nuggets as buy high and sell higher to making a million in mutual funds. Concentrate your investments in a few areas, know them well, and watch them carefully.Don't just rely upon PE ratios and other common technical tools. Learn to use Relative Price Strength to help you choose stocks. O'Neil's cautionary yet pro-active advice has helped to make Investor's Business Daily one of America's fastest growing and most respected newspapers. Now investor's can benefit from his timeless words of wisdom, collected in one easy-to-use resource.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Many Waters",
        "Authors": "By L'Engle, Madeleine",
        "Description": "When twins Sandy and Dennys Murry accidentally interrupt one of their father's experiments, they are hurtled out of their ordinary world, across time and space into a mysterious desert land populated by unicorns, seraphim, and other mythic creatures",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "The Last Debate:  A Novel of Politics and Journalism",
        "Authors": "By Lehrer, James, Smith, Peter (EDT), and Osnos, Peter",
        "Description": "Tom Chapman's reporting begins innocently enough. It's the eve of the one and only presidential debate, and he's been sent to Colonial Williamsburg by his magazine, The New American Tatler, to cover the event. An important assignment, but pretty routine for a journalist of Chapman's abilities.The campaign itself, however, has been anything but routine. The American people face an impossible choice between apparent evil and apparent incompetence: The Republican candidate, David Donald Meredith, a handsome, charismatic figure and a riveting speaker, is a fundamentalist demagogue, a nativist, and probably a racist - none but the most fervent ideologues doubts that his election would tear the country apart. The Democrat, Paul L. Greene, is everything Meredith is not - liberal, earnest, and utterly colorless - and is so far behind in the polls that he has all but conceded the race weeks before the election.As the handlers, the press corps, the camera crews, and the campaign operators assemble in Williamsburg for the final battle of the campaign, a different sort of battle is taking place on the debate panel. Reporters have been given devastating anonymous reports about Meredith's personal life. There's no time to check them out, but using them could throw the election to Greene. In utter secrecy, a decision is made. By the time the debate is over, American politics and journalism have been changed forever and the four panelists have vaulted to mega-stardom. And Tom Chapman is hot on the trail of the biggest story of his career: the debate behind the last debate.",
        "Category": " Fiction , Political",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Parents in Charge: Setting Healthy, Loving Boundaries for You and Your Child",
        "Authors": "By Chidekel, Dana",
        "Description": "How many times have you said, \"How many times do I have to tell you...?\" Why do the terrible twos exist and what makes them so terrible -- and for whom? In Parents in Charge, Dr. Dana Chidekel answers these questions while providing a road map to raising children who will become competent, responsible, thoughtful, and successful adults.  Full of uncommon wisdom and common sense, based solidly in developmental theory and the most recent brain research, this empowering guide offers practical solutions to everyday parenting dilemmas: What is effective discipline, and when and how do you use it? How do you promote real self-esteem in kids? How can you stop saying no all the time? With honesty and simplicity, Dr. Chidekel also tackles hot-button topics of current parenting practice, including children's calling adults by their first names, out-of-control birthday parties, and the limits parents must put on their own behavior.  Enlivened with stories, anecdotes, and a healthy dose of humor, Parents in Charge gives you the tools you need to raise children that you -- and other people -- will love and enjoy.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Prep (Junior Library Guild Selection)",
        "Authors": "By Coburn, Jake",
        "Description": "Nick and his friends have every advantage: expensive clothes, beautiful homes in Manhattan, peerless private-school educations. However, beneath the picture-perfect veneer lies a violent subculture that is gritty and dangerous, with binge drinking, heavy drug use, casual sex, vandalism, and gangs. Nick is in love with his best friend, Kris, and imagines a future with her outside the violence of their circle. When Kris's younger brother becomes a gang target, Nick is compelled to navigate the complex politics of the prep world, come to terms with his past gang experience, and put his own life at risk. Brutally realistic, Prep is a powerful, gripping exposé of America's most affluent youth.",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "This Lullaby",
        "Authors": "By Dessen, Sarah",
        "Description": "From the award-winning and New York Times bestselling author of Once and for All   She’s got it all figured out.   Or does she? When it comes to relationships, Remy’s got a whole set of rules.   Never get too serious. Never let him break your heart. And never, ever date a musician.   But then Remy meets Dexter, and the rules don’t seem to apply anymore.   Could it be that she’s starting to understand what all those love songs are about?   “Remy and Dexter jump off the pages into the hearts of readers, who will wish for a romance like this of their own.” —Booklist  Sarah Dessen is the winner of the Margaret A. Edwards Award for her contributions to YA literature, as well as the Romantic Times Career Achievement Award. Books by Sarah Dessen:That SummerSomeone Like YouKeeping the MoonDreamlandThis LullabyThe Truth About Forever Just ListenLock and KeyAlong for the RideWhat Happened to GoodbyeThe Moon and MoreSaint AnythingOnce and for All",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "Speak",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "No mean city,: An inquiry into civic greatness,",
        "Authors": "By McKeldin, Theodore R",
        "Description": "",
        "Category": "",
        "Publisher": "Author / Maryland Historical Society",
        "Price Starting With ($)": "10.1",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "ROLLING THUNDER: Jet Combat From WW II to the Gulf War",
        "Authors": "By Rendall, Ivan",
        "Description": "\"The jet fighter is one of the great icons of the second half of the twentieth century, a symbol of achievement, of technical excellence, of ultimate modernity, of latent military power.\"  So begins Ivan Rendall, a former Royal Air Force pilot, in this thrilling first-ever history of the most seductive and deadly of all of man's weapons of war. From its birth in battle during the last days of World War II to its current aeronautical peak, the jet fighter has always been the king of the sky. Rendall's Rolling Thunder is the celebration of a machine, and a culture, for which \"winning is about accepting that there is no such thing as second-best.\"  Rendall's scrupulous history is driven by a strong thesis: jets may depend upon technological advances, but the human edge supplied by their pilots has determined their success or failure in all times and places. In this respect, the West has triumphed over its enemies. Beginning with the dangerously fast but hopelessly outnumbered German Me 262, jets and the men who flew them quickly became potent physical and psychological weapons. From the ruins of a defeated Germany came the now-familiar look of swept-back wings and with them the secret of supersonic flight. Less than a decade later, the two World War II allies most responsible for Germany's defeat would meet as enemies in Korea. Their planes -- the American F-86 Saber and Russian MiG-15 -- clashed over the Yalu River in what American pilots called \"MiG Alley.\" Diving from 40,000 feet and flying through dry riverbeds so low that their engines kicked up dirt, both sides' machines soon proved their worth.  In Vietnam, American fighter pilots involved in the costly \"Rolling Thunder\" campaign again proved the value of the American emphasis on individualism as taught in the \"Top Gun\" school of aeronautics. Rendall vividly describes pilots in F-4 Phantoms and F-105 Thunderchiefs dodging SA-2 surface-to-air missiles in the \"ultimate test of man versus machine.\"  Recent uses of air power, from the legendary \"Instant Thunder\" campaign in the Gulf War to the enforcement of No-Fly Zones in Bosnia, have proved that the jet fighter remains as versatile and dangerous as ever. But today, with $100 million mach 3 machines capable of climbing 65,000 feet -- twice the height of Everest -- in a minute, many have argued that the pilot has become the weak link in the jet fighter's lethal equation. Rendall shows that the argument to remove the pilot from his machine -- seemingly complete with NASA's new unmanned X-36 -- is as old as the machine that broke the sound barrier, Chuck Yeager's X-1. The ability to balance the grace and brutality of a machine that has evolved into a perfect combination of form and function will remain the unique province of the fighter pilot -- the \"quintessential warrior of our times.\"",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Everything Cover Letter Book (Everything)",
        "Authors": "By Graber, Steven and Lipsman, Mark",
        "Description": "Parsing the allimportant cover letter, this career guide to crafting effective correspondance during a job search includes advice on writing cold letters, cover letters, thank letters, followup letters, and much more. Original. $250,000 ad/promo.",
        "Category": " Business & Economics , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Norman Mark's Chicago: Walking, bicycling & driving tours of the city",
        "Authors": "By Mark, Norman",
        "Description": "",
        "Category": "",
        "Publisher": "Chicago Review Press",
        "Price Starting With ($)": "8.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Believing in Jesus",
        "Authors": "By Foley, Leonard",
        "Description": "",
        "Category": "",
        "Publisher": "St. Anthony Messenger Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Irish Druids and Old Irish Religions",
        "Authors": "By Bonwick, James",
        "Description": "",
        "Category": " Religion , Ethnic & Tribal",
        "Publisher": "Hippocrene Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Eat Smart for a Healthy Heart Cookbook",
        "Authors": "By Cooley, Denton A., M.D. and Moore, Carolyn E.",
        "Description": "More than 350 healthy yet appetizing recipes are incorporated into well-balanced menus that list nutritional values for low-sodium, low-fat, and low-cholesterol main courses, soups, salads, vegetable dishes and desserts. Reprint. LJ.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Barron's Educational Series, inc",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "I Can Print A to Z (Wipe-off Activity Book--Reusable)",
        "Authors": "By Enterprises Incorporated Trend",
        "Description": "",
        "Category": "",
        "Publisher": "Trend Enterprises Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "1-2-3 Murals: Simple Murals to Make from Children's Open-Ended Art",
        "Authors": "By Warren, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Warren Publishing House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "A Book of Americans",
        "Authors": "By Benet, Rosemary",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar and Rinehart, inc",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1933"
        }
    },
    {
        "Title": "The Pleasures of Watching Birds",
        "Authors": "By Oberman, Lola and Swan, Joy (ILT)",
        "Description": "The author shares her observations on various species of birds, answers questions about bird pests, and discusses bird counts and the care of injured birds",
        "Category": " Science , General",
        "Publisher": "Walker & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Young Men and Fire",
        "Authors": "By MacLean, Norman",
        "Description": "On August 5, 1949, a crew of fifteen of the United States Forest Service's elite airborne firefighters, the Smokejumpers, stepped into the sky above a remote forest fire in the Montana wilderness. Two hours after their jump, all but three of these men were dead or mortally burned. Haunted by these deaths for forty years, Norman Maclean puts back together the scattered pieces of the Mann Gulch tragedy.Young Men and Fire won the National Book Critics Circle Award in 1992.\"A magnificent drama of writing, a tragedy that pays tribute to the dead and offers rescue to the living.... Maclean's search for the truth, which becomes an exploration of his own mortality, is more compelling even than his journey into the heart of the fire. His description of the conflagration terrifies, but it is his battle with words, his effort to turn the story of the 13 men into tragedy that makes this book a classic.\"—from New York Times Book Review Editor's Choice, Best Books of 1992\"A treasure: part detective story, part western, part tragedy, part elegy and wholly eloquent ghost story in which the dead and the living join ranks cheerfully, if sometimes eerily, in a search for truth and the rest it brings.\"—Joseph Coates, Chicago Tribune\"An astonishing book. In compelling language, both homely and elegant, Young Men and Fire miraculously combines a fascinating primer on fires and firefighting, a powerful, breathtakingly real reconstruction of a tragedy, and a meditation on writing, grief and human character.... Maclean's last book will stir your heart and haunt your memory.\"—Timothy Foote, USA Today\"Beautiful.... A dark American idyll of which the language can be proud.\"—Robert M. Adams, The New York Review of Books\"Young Men and Fire is redolent of Melville. Just as the reader of Moby Dick comes to comprehend the monstrous entirety of the great white whale, so the reader of Young Men and Fire goes into the heart of the great red fire and comes out thoroughly informed. Don't hesitate to take the plunge.\"—Dennis Drabelle, Washington Post Book World\"Young Men and Fire is a somber and poetic retelling of a tragic event. It is the pinnacle of smokejumping literature and a classic work of 20th-century nonfiction.\"—John Holkeboer, The Wall Street Journal\"Maclean is always with the brave young dead. . . . They could not have found a storyteller with a better claim to represent their honor. . . . A great book.\"—James R. Kincaid, New York Times Book Review",
        "Category": " Nature , Plants , Trees",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    }
]