[
    {
        "Title": "A Directory of Antique Furniture: The Authentic Classification of European and American Designs",
        "Authors": "By HINCKLEY",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Whose Wedding Is It Anyway? (Red Dress Ink)",
        "Authors": "By Senate, Melissa",
        "Description": "Eloise Manfred has been offered a free $100,000 wedding in exchange for being featured as a real-life \"modern bride,\" but as she watches advertisers dictate every aspect of a wedding for which she is not even sure she is ready, her dream turns into a nightmare. Original. 60,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "New York Times New England Heritage Cook Book",
        "Authors": "By Hewitt, Jean",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , New England",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Cocktail Bible",
        "Authors": "By Linda Doeser",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Ortho All About Perennials (Ortho's All About Gardening)",
        "Authors": "By Ortho (EDT), Ortho Books (COR), Lovejoy, Ann, and Riggenbach, Jan",
        "Description": "Shows readers how to achieve breathtaking color year after year.Designed so book is visually compelling and easy to use.Unique, easy-to-understand system of combining colors and bloom seasons makes perennial design easy.Loaded with revolutionary new labor-saving techniques.Detailed growing instructions for more than 300 varieties.Author Ann Lovejoy is a high-profile contributor to Horticulture Magazine and the author of numerous award-winning books on gardening.",
        "Category": " Gardening , Flowers , Perennials",
        "Publisher": "Ortho",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Chocolate for a Woman's Soul P.O.B.",
        "Authors": "By Allenbaugh, Kay",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Raising a Modern Day Knight: A Father's Role in Guiding His Son to Authentic Manhood",
        "Authors": "By Lewis, Robert",
        "Description": "What does it mean to be a man? Moreover, how does a father instill these qualities in his son? ByRaising a Modern-Day Knight. Beginning with a biblical perspective of manhood, Robert Lewis shares a unique approach to shaping a boy into a man by equipping him with three essential elements: a vision, a code of conduct, and a cause (Christianity) in which to invest his life. Complete with ceremony ideas to celebrate accomplishments and ingrain them in his mind, this softcover is as insightful as it is practical in raising a boy to be a chivalrous, godly man.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Focus on the Family",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Success One Day At A Time by John C. Maxwell (2001-05-03)",
        "Authors": "By Maxwell, John C.",
        "Description": "",
        "Category": "",
        "Publisher": "J. Countryman/Hallmark Cards",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Home and Heart: Simple, Beautiful Ways to Create Spirit, Harmony, and Warmth in Every Room",
        "Authors": "By Pagram, Beverly",
        "Description": "When you walk into your home at the end of a grueling day, do the stresses and strains fall away, or does clutter and disharmony add further to your headaches? Is your home the nurturing haven it should be, or is it a continuation of the chaos of the outside world?Home and Heart shows you how to make your home a stylish, relaxing, healthy, rejuvenating and nurturing place to be. It takes the elements, the seasons, the senses, and the human spirit and uses them as a foundation to inspire and teach us how to enhance our homes in practical, beautiful, and spirit-filled ways. From choosing textures in fabrics to finding colors that work together to transform rooms, Home and Heart is the first book to combine lovely and easy-to-do decorating ideas with spiritual principles.",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Lonely Planet Tibet (Lonely Planet Travel Survival Kit)",
        "Authors": "By Taylor, Chris",
        "Description": "",
        "Category": " Travel , Asia , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Broadway Musicals - Show by Show",
        "Authors": "By Green, Stanley and Green, Kay",
        "Description": "The most comprehensive and widely used Broadway reference book has been expanded and updated to include more than 300 of the most important and memorable productions of the American musical theatre. Chronologically arranged beginning with The Black Crook in 1866, this edition includes show entries up through the latest hits (Rent, Sunset Boulevard, Kiss of the Spider Woman, Victor/Victoria, Passion) and all the latest big revivals (Show Boat, How to Succeed in Business Without Really Trying, The King and I). Features a wealth of statistics, inside information, critical reception, cast lists, and pithy commentary about each show. Includes seven completely revised, cross-referenced indexes and over 200 photographs.",
        "Category": " Music , Genres & Styles , Musicals",
        "Publisher": "Hal Leonard Corporation",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "A Horse of Your Own",
        "Authors": "By Stoneridge, M. A.",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1980"
        }
    },
    {
        "Title": "Culture and the Radical Conscience",
        "Authors": "By Goodheart, Eugene",
        "Description": "Debates on culture, politics, and the university have hardly abated since the 1960s when the radical assault on the authority of culture first challenged the classical conception of higher education with imperious demands for relevance and ideological correctness. Since then, campus unrest on the part of students has given way to a radicalized faculty characterized by contempt for high culture, fetishization of pop culture, and increasing absorption by feminism and identity politics.",
        "Category": " Literary Criticism , General",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Che Guevara: A Revolutionary Life",
        "Authors": "By Anderson, Jon Lee",
        "Description": "This New York Times ?Notable Book of the Year” is the definitive biography on Che Guevara, whose epic dream was to end poverty and injustice in Latin America through armed revolution. Anderson’s biography traces Che’s extraordinary life, from his comfortable Argentine upbringing to the Cuban revolution, from the halls of power in Castro’s government to his failed campaign in the Congo and assassination in the Bolivian jungle.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Strategic planning systems",
        "Authors": "By Lorange, P.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "I Am America (And So Can You!)",
        "Authors": "By Colbert, Stephen, Dahm, Richard, Dinello, Paul, and Silverman, Allison",
        "Description": "Congratulations--just by looking at this webpage, you became 25% more patriotic.From Stephen Colbert, the host of television's highest-rated punditry show The Colbert Report, comes the book to fill the other 23¿ hours of your day. I Am America (And So Can You!) contains all of the opinions that Stephen doesn't have time to shoehorn into his nightly broadcast.Dictated directly into a microcassette recorder over a three-day weekend, this book contains Stephen's most deeply held knee-jerk beliefs on The American Family, Race, Religion, Sex, Sports, and many more topics, conveniently arranged in chapter form.Always controversial and outspoken, Stephen addresses why Hollywood is destroying America by inches, why evolution is a fraud, and why the elderly should be harnessed to millstones. You may not agree with everything Stephen says, but at the very least, you'll understand that your differing opinion is wrong.I Am America (And So Can You!) showcases Stephen Colbert at his most eloquent and impassioned. He is an unrelenting fighter for the soul of America, and in this book he fights the good fight for the traditional values that have served this country so well for so long.Please buy this book before you leave the store",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Grandfather's Memories To His Grandchild",
        "Authors": "By Paull, Candy and Kinkade, Thomas (ILT)",
        "Description": "Featuring the art of Thomas Kinkade, Grandfather's Memories to His Grandchild is a beautiful record book that will be treasured for generations.  Helpful prompts and questions enable grandfathers to pass wisdom and family heritage on to their grandchildren.  Themes range from childhood stories to advice on living a life with God.  Photo journal pages allow the inclusion of special photographs or momentos.  Scripture verses highlight the pages, helping create this personal way for families to pass the legacy of faith from generation to generation.",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Smart Negotiating: How to Make Good Deals in the Real World",
        "Authors": "By Freund, James C.",
        "Description": "If you've ever tried to make a deal, reach an agreement, close a sale, or negotiate in everyday business, Smart Negotiating shows you how to avoid the pitfalls and achieve your goals.  James C. Freund is a skilled, seasoned lawyer who negotiates for a living, and the techniques he presents in Smart Negotiating have been proven effective in real-world bargaining situations.  Freund emphasizes basic negotiating skills -- how to use leverage, how to get the information you need from the other side, how to build your own credibility, and the importance of good judgment. He then shows you how to design a winning game plan: how to develop realistic expectations on key issues, choose the right starting position, plan your concessions in advance, and anticipate the final agreement.  Fresh, clever, practical -- and packed with vivid real-world examples -- Smart Negotiating will help anyone succeed at negotiating a deal.",
        "Category": " Business & Economics , Negotiating",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Worst Christmas Ever",
        "Authors": "By Remlinger-Trounstine, Connie",
        "Description": "When Callie goes to sixth grade at a private school the year her grandmother dies, she is embarrassed that her family sells Christmas trees, until her grandfather helps her learn the value of family and traditions",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Small Island: A Novel",
        "Authors": "By Levy, Andrea",
        "Description": "It is 1948 in an England that is still shaken by war. At 21 Nevern Street, London, Queenie Bligh takes into her house lodgers who have recently arrived from Jamaica. She feels she has no choice. Her husband, Bernard, whom she married to escape her dreary upbringing on a farm in the Midlands, was posted to India with the RAF during the war, but when the conflict was over he did not return. What else could she do?Among her tenants are Gilbert and his new wife Hortense. Gilbert Joseph was one of the serveral thousand Jamaican men who joined the RAF to fight against Hitler. Returning to England after the war he finds himself treated very differently now that his is no longer in a blue uniform. It is desperation that makes him remember a wartime friendship with Queenie and knock at her door.Hortense shared Gilbert's dream of leaving Jamaica and coming to England to start a better life - that's why she married him. But when she at last joins her husband, she is shocked by London's shabbiness and horrified at the way the English live. Even Gilbert is not the man she thought he was.Queenie's neighbors do not approve of her choice of tenants, and neither would her husband, were he there. England may be recovering from a war but at 21 Nevern Street it has only just begun.",
        "Category": " Fiction , Family Life",
        "Publisher": "Picador",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Steichen at War: The Navy's Pacific Air Battles",
        "Authors": "By Phillips, Christopher",
        "Description": "Air and naval operations and the activities of and men aboard U.S. aircraft carriers during World War II are seen through the cameras of Edward Steichen",
        "Category": "",
        "Publisher": "Harry N. Abrams, Inc.",
        "Price Starting With ($)": "8.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Nixie's Song (Beyond The Spiderwick Chronicles, Book 1)",
        "Authors": "By DiTerlizzi, Tony and Black, Holly",
        "Description": "The Spiderwick Chronicles leave the old-fashioned charm of New England far behind and head south for some fiendish faerie fun in the hot Florida sun. Eleven-year-old Nicholas Vargas only thinks his life has been turned upside down after his developer father remarries and moves his new wife and daughter into the soon-to-be completed Mangrove Hollow.   But an \"expedition\" to a nearby lake turns up a little nixie with a giant problem - the huge, lumbering, fire-breathing variety - and it's up to Nick; his stepsister, Laurie; and his big brother, Julian (plus a familiar face from the original Spiderwick Chronicles) to figure out the best way to stop a host of rampaging giants before all of Florida goes up in smoke.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Hop on Pop",
        "Authors": "By Seuss, Dr.",
        "Description": "A condensed, board book version of the classic bestseller, perfect for babies and toddlers. Introduces the youngest readers to the wonderful world of Seussian word play.",
        "Category": " Juvenile Fiction , Transportation , Railroads & Trains",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Crisscross Shadow (The Hardy Boys, No. 32)",
        "Authors": "By Dixon, Franklin W.",
        "Description": "When a man selling leather goods door-to-door steals the key to their detective father’s file cabinet, Frank and Joe Hardy set out to track him down. An odd mark on a key case which the man sold to their mother leads the teenage sleuths to an Indian village, whose chiefs begs them to help him find valuable tribal possessions and the deed for his land. How Frank and Joe find the missing deed and Ramapan treasures, how they prevent the phony leather-goods salesman from carrying out a ruthless scheme and how they help their father solve the top-secret case he is working on for the U.S. government makes exciting reading for all fans of the Hardy boys.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Follow the Money: How George W. Bush and the Texas Republicans Hog-Tied America",
        "Authors": "By Anderson, John",
        "Description": "With its barbecues, new Cadillacs, and $4,000 snakeskin cowboy boots, Texas is all about power and money -- and the power that money buys. This detailed and wide-scope account shows how a group of wealthy Texas Republicans quietly hijacked American politics for their own gain.   Getting George W. Bush elected, we learn, was just the tip of the iceberg....  In Follow the Money, award-winning journalist and sixth-generation Texan John Anderson shows how power in Texas has long been vested in the interconnected worlds of Houston's global energy companies, banks, and law firms -- not least among them Baker Botts, the firm controlled by none other than James A. Baker III, the Bush family consigliere. Anderson explains how the Texas political system came to be controlled by a sophisticated, well-funded group of conservative Republicans who, after elevating George W. Bush to the American presidency, went about applying their hardball, high-dollar politicking to Washington, D.C.   When George Bush reached the White House, he brought with him not only members of the Texas legal establishment (among them former White House counsel Harriet Miers and Attorney General Alberto Gonzales) but empowered swarms of Republican lobbyists who saw in Bush's arrival a way to make both common cause and big money.   Another important Beltway Texan was Congressman Tom DeLay, the famous \"Exterminator\" of Houston's Twenty-second District, who became majority leader in 2003 and controlled which bills made it through Congress and which did not. DeLay, in turn, was linked to lobbyist Jack Abramoff, who used his relationships with both DeLay and Karl Rove on behalf of his clients, creating a shockingly corrupt flow of millions of dollars among Republican lobby groups and political action committees. Washington soon became infected by Texas-style politics. Influence-peddling, deal-making, and money-laundering followed -- much of it accomplished in the capital's toniest restaurants or on the fairways and beaches of luxurious resorts, away from the public eye.   The damaging fallout has, one way or another, touched nearly all Americans, Democrat and Republican alike. Follow the Money reveals the hidden web of influence that links George W. Bush, Dick Cheney, and the Texas Republicans to the 2000 recount in Florida; the national tort-reform movement; the controversial late-hour, one-vote passage of the Medicare Reform Act; congressional redistricting schemes; scandals in the energy sector; the destruction of basic constitutional protections; the financial machinery of the Christian right; the manipulation of American-Indian tribe casinos; the Iraq War torture scandals; the crooked management of the Department of the Interior; the composition of the Supreme Court; and the 2007 purges of seasoned prosecutors in the Justice Department.   Some of the actors are in federal prison, others are on their way there, and many more have successfully eluded a day of reckoning.   Told with verve, style, and a not-so-occasional raised eyebrow, Anderson's account arcs directly into tomorrow's headlines. Startling in its revelations, Follow the Money is sure to spark controversy and much-needed debate concerning which direction this country goes next.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "A Short Introduction to Numerical Analysis",
        "Authors": "By Wilkes, M. V.",
        "Description": "This short book sets out the principles of the methods commonly employed in obtaining numerical solutions to mathematical equations and shows how they are applied in solving particular types of equations. Now that computing facilities are available to most universities, scientific and engineering laboratories and design shops, an introduction to numerical method is an essential part of the training of scientists and engineers. A course on the lines of Professor Wilkes's book is given to graduate or undergraduate students of mathematics, the physical sciences and engineering at many universities and the number will increase. By concentrating on the essentials of his subject and giving it a modern slant, Professor Wilkes has written a book that is both concise and that covers the needs of a great many users of digital computers; it will serve also as a sound introduction for those who need to consult more detailed works.",
        "Category": " Mathematics , Mathematical Analysis",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "December",
            "Year": "1966"
        }
    },
    {
        "Title": "Poppleton: Poppleton Everyday",
        "Authors": "By Rylant, Cynthia and Teague, Mark (ILT)",
        "Description": "In a new addition to the popular Poppleton series that contains three charming, easy-to-read stories by an award-winning author, Poppleton the pig goes stargazing, buys a bed, and sails. Simultaneous.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Blue Sky Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Locked in the Library!",
        "Authors": "By Stephen Krensky",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Internal Combustion: How Corporations and Governments Addicted the World to Oil and Derailed the Alternatives",
        "Authors": "By Black, Edwin",
        "Description": "Internal Combustion is the compelling tale of corruption and manipulation that subjected the U.S. and the world to an oil addiction that could have been avoided, that was never necessary, and that could be ended not in ten years, not in five years, but today. Edwin Black, award-winning author of IBM and the Holocaust, has mined scores of corporate and governmental archives to assemble thousands of previously uncovered and long-forgotten documents and studies into this dramatic story. Black traces a continuum of rapacious energy cartels and special interests dating back nearly 5,000 years, from wood to coal to oil, and then to the bicycle and electric battery cartels of the 1890s, which created thousands of electric vehicles that plied American streets a century ago. But those noiseless and clean cars were scuttled by petroleum interests, despite the little-known efforts of Thomas Edison and Henry Ford to mass-produce electric cars powered by personal backyard energy stations. Black also documents how General Motors criminally conspired to undermine mass transit in dozens of cities and how Big Oil, Big Corn, and Big Coal have subverted synthetic fuels and other alternatives. He then brings the story full-circle to the present day oil crises, global warming and beyond. Black showcases overlooked compressed-gas, electric and hydrogen cars on the market today, as well as inexpensive all-function home energy units that could eliminate much oil usage. His eye-opening call for a Manhattan Project for immediate energy independence will help energize society to finally take action. Internal Combustion, and its interactive website www.internalcombustionbook.com, will generate a much-needed national debate at a crucial time. It should be read by every citizen who consumes oil -- everyone. Internal Combustion can change everything, not by reinventing the wheel, but by excavating it from where it was buried a century ago.                           Edwin Black is the award-winning, New York Times best-selling journalist and author of five previous books, including IBM and the Holocaust and War Against the Weak. He has been nominated eight times for the Pulitzer Prize, twice for the National Book Award. In 2003, Black won the top two awards of the American Society of Journalists and Authors, Best  Book of the Year and Best Investigative Article of the year, both for IBM and the Holocaust.                                                       Internal Combustion is the compelling tale of corruption and manipulation that subjected the U.S. and the world to an oil addiction that could have been avoided, that was never necessary, and that could be ended not in ten years, not in five years, but today. Edwin Black, award-winning author of IBM and the Holocaust, has mined scores of corporate and governmental archives to assemble thousands of previously uncovered and long-forgotten documents and studies into this dramatic story. Black traces a continuum of rapacious energy cartels and special interests dating back nearly 5,000 years, from wood to coal to oil, and then to the bicycle and electric battery cartels of the 1890s, which created thousands of electric vehicles that plied American streets a century ago. But those noiseless and clean cars were scuttled by petroleum interests, despite the little-known efforts of Thomas Edison and Henry Ford to mass-produce electric cars powered by personal backyard energy stations. Black also documents how General Motors criminally conspired to undermine mass transit in dozens of cities and how Big Oil, Big Corn, and Big Coal have subverted synthetic fuels and other alternatives. He then brings the story full-circle to the present day oil crises, global warming and beyond. Black showcases overlooked compressed-gas, electric and hydrogen cars on the market today, as well as inexpensive all-function home energy units that could eliminate much oil usage. His eye-opening call for a Manhattan Project for immediate energy independence will help energize society to finally take action.                              \"Black spins the history of oil's ascendancy to dominance over the global energy market into a sordid tale of conspiracy, deception and murder . . . Through it all, Black manages to keep this complex history compelling. By the time the author makes his final, impassioned plea for a bold new solution to the world's energy crisis, he has already made his case with devastating clarity.\"?Publishers Weekly                                                                               \"Black spins the history of oil's ascendancy to dominance over the global energy market into a sordid tale of conspiracy, deception and murder. This enthralling book begins in the vast forests of Cyprus, whose wood fueled the ancient Mediterranean, and extends through the Elizabethan era, in which the Hostmen guild of Newcastle exerted political influence by monopolizing the British coal supply. The central thread of this well-researched book, which draws upon a vast array of archival sources and an extensive list of secondary texts, picks up centuries later with the competition in the American automotive market between electric power and oil-fueled internal combustion. The definitive blow in favor of oil comes with WWI, which prompted increased demand for gas-powered vehicles at the very moment Thomas Edison and Henry Ford aborted plans to develop an affordable electric car. The decades-long 'General Motors conspiracy' solidifies the demise of electrically powered mass transit in American cities. Through it all, Black manages to keep this complex history compelling. By the time the author makes his final, impassioned plea for a bold new solution to the world's energy crisis, he has already made his case with devastating clarity.\"?Publishers Weekly",
        "Category": " History , Modern , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Blue Sword (Newbery Honor Roll)",
        "Authors": "By McKinley, Robin",
        "Description": "Read this modern classic of young adult fantasy from award-winning, New York Times bestselling author Robin McKinleyHarry Crewe is an orphan girl who comes to live in Damar, the desert country shared by the Homelanders and the secretive, magical Free Hillfolk. When Corlath, the Hillfolk King, sees her for the first time, he is shaken—for he can tell that she is something more than she appears to be. He will soon realize what Harry has never guessed: She is to become Harimad-sol, King’s Rider, and carry the Blue Sword, Gonturan, which no woman has wielded since the legendary Lady Aerin, generations past.  * “This is a zesty, romantic heroic fantasy with an appealingly stalwart heroine, a finely realized mythical kingdom, and a grounding in reality that enhances the tale’s verve as a fantasy.”—Booklist (starred review)  “McKinley knows her geography of fantasy, the nuances of the language, the atmosphere of magic . . . .”—The Washington Post A Newbery Honor Book An ALA Notable Book An ALA Best Book for Young Adults",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Clayt",
        "Authors": "By James Schnabel",
        "Description": "",
        "Category": "",
        "Publisher": "Romar Books, Ltd.",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Clambakes & Fish Fries",
        "Authors": "By Loomis, Susan Herrmann and Borowski, Diane (ILT)",
        "Description": "There's nothing more pleasurable--or nourishing--than a clambake. The same goes for a shrimp boil at Bayou Petit Caillou, an oyster gala on Maryland's Eastern Shore, and real fried smelts at The Port Washington Smelt Fry. It's seafood, it's festive, and it's time for seconds. A celebration of 23 seafood celebrations, with over 100 recipes--from a classic Maine clambake to an informal swordfish barbecue among dockworkers in San Pedro, California--CLAMBAKES & FISH FRIES is Susan Herrmann Loomis's first Passionate Cookbook, and passionate it is. Selection of the Book-of-the-Month Club's HomeStyle Book.",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "RUNNING ON EMPTY",
        "Authors": "By Peterson, Peter G.",
        "Description": "The national bestseller, described by Tom Brokaw as the \"wake-up call we cannot ignore,\" with a new preface by the author Acclaimed by all sides of the political spectrum, Peter Peterson's Running on Empty not only traces the deterioration of America's finances but offers solutions. This national bestseller is required reading for everyone concerned with America's long-term economic survival. In clear and concise prose, Peterson offers America not only a vision but the practical steps by which to ensure our children's economic future. Running on Empty is not only a warning, it is also a manifesto calling for the next administration to finally confront a deep and disturbing problem that politicians of all parties have insisted on ignoring for too long.",
        "Category": " Political Science , Political Economy",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Hunting Trophy Deer",
        "Authors": "By Wootters, John",
        "Description": "",
        "Category": "",
        "Publisher": "Winchester Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "World Atlas of Archaeology",
        "Authors": "By Wood, Michael",
        "Description": "A geographical and chronological reconstruction of every region and period, with an account of the area and discussions of special discoveries, events, and archeological conclusions in those regions",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "10.5",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Decorating With Flowers (Abradale)",
        "Authors": "By Otis, Denise",
        "Description": "",
        "Category": "",
        "Publisher": "Abradale/Abrams",
        "Price Starting With ($)": "8.61",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Complete Kodak Book of Photography (Revised Edition)",
        "Authors": "By Thomas Dickey",
        "Description": "",
        "Category": "",
        "Publisher": "KODAK",
        "Price Starting With ($)": "7.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Problems and Other Stories",
        "Authors": "By Updike, John",
        "Description": "In this midcareer collection of twenty-three short stories, John Updike tackles such problems as separation, divorce, and remarriage, parents and children, guns and prostitution, leprosy, swooning, suffocation, and guilt. His self-seeking heroes tend to be forty; his heroines are asleep, seductive, longing, or reproachful. None of these characters is innocent, and all are looking vainly for the road back to an imagined Paradise. Pain and comedy closely coexist in this mainly domestic world of the 1970s, where life is indistinguishable from a television commercial (but what is it advertising?) and every morning’s paper brings news of lost Atlantises.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "CMP GD FURN FINSH",
        "Authors": "By Bernard Gladstone",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "Books - From Writer to Reader",
        "Authors": "By Crown",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Bill of Rights: A Users Guide",
        "Authors": "By Monk, Linda R.",
        "Description": "Describes the history and development of the first ten Constitutional amendments, also known as the Bill of Rights, and presents stories of the many people who have helped to keep it a living document",
        "Category": " Young Adult Nonfiction , Social Science , General",
        "Publisher": "Close Up Foundation",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Seventh Grade Rumors (Fabulous Five, Book 1)",
        "Authors": "By Haynes, Betsy",
        "Description": "Jana Morgan and the other members of the \"Fabulous Five\" encounter new challenges as they move on to Wakeman Junior High School and discover new rivals, \"The Fantastic Foursome\"",
        "Category": "",
        "Publisher": "Skylark",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Essence of Security",
        "Authors": "By Robert S. McNamara",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Biscuit's Hanukkah",
        "Authors": "By Young, Mary O'Keefe (ILT), Capucilli, Alyssa Satin, and Schories, Pat (ILT)",
        "Description": "Come along wit Biscuit as he makes a beautiful menorah to celebrate Hanukkah. It's a great time for stories, songs, food and friends! Ages 2 – 6",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Hanukkah",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Onions Onions Onions: Delicious Recipes for the World's Favorite Secret Ingredient",
        "Authors": "By Griffith, Linda, Griffith, Fred, and Halbert, Michael (ILT)",
        "Description": "More than 200 lusty recipes, featuring not only onions but all the other members of the allium kingdom -- garlic, leeks, chives, and shallots.",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Chapters Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Dinosaur Plots and Other Intrigues in Natural History",
        "Authors": "By Krishtalka, Leonard",
        "Description": "A distinguished paleontologist explores a range of mysteries in natural history and offers imaginative, even fanciful, explanations for paleontological puzzles, covering everything from dinosaurs to early humans",
        "Category": " Science , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Hope's Boy: A Memoir",
        "Authors": "By Bridge, Andrew",
        "Description": "From the moment he was born, Andrew Bridge and his mother Hope shared a love so deep that it felt like nothing else mattered. Trapped in desperate poverty and confronted with unthinkable tragedies, all Andrew ever wanted was to be with his mom. But as her mental health steadily declined, and with no one else left to care for him, authorities arrived and tore Andrew from his screaming mother's arms. In that moment, the life he knew came crashing down around him. He was only seven years old. Hope was institutionalized, and Andrew was placed in what would be his devastating reality for the next eleven years--foster care. After surviving one of our country's most notorious children's facilities, Andrew was thrust into a savagely loveless foster family that refused to accept him as one of their own. Deprived of the nurturing he needed, Andrew clung to academics and the kindness of teachers. All the while, he refused to surrender the love he held for his mother in his heart. Ultimately, Andrew earned a scholarship to Wesleyan, went on to Harvard Law School, and became a Fulbright Scholar. Andrew has dedicated his life's work to helping children living in poverty and in the foster care system. He defied the staggering odds set against him, and here in this heartwrenching, brutally honest, and inspirational memoir, he reveals who Hope's boy really is.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Blue Smoke and Murder",
        "Authors": "By Lowell, Elizabeth",
        "Description": "Jill Breck was just doing her job as a river guide when she saved the life of Lane Faroe, son of two of St. Kilda Consulting's premier operators. But when a string of ominous events—including a mysterious fire that kills her great-aunt and a furor in the Western art world raised by a dozen Breck family paintings—culminates in a threat to her life, Jill reluctantly calls in a favor.Zach Balfour works part-time as a consultant for St. Kilda. His expertise is gathering and analyzing information from unlikely and often dangerous sources. Though he's got the skills to be a highly effective bodyguard, being a bullet catcher isn't his preferred way to spend time.Protecting Jill will take him into familiar territory—among a strange, savagely competitive bunch of collectors who'll do anything to stay at the top. But Jill is in deeper waters than she's ever known; as she soon discovers, the perils of running wild rivers are tame compared with the hidden dangers in the high-stakes game of art collecting.From the cozy rooms of the Breck homestead cabin to the cold multimillion-dollar galleries of the Western art circuit, Zach and Jill must race against time to unmask a ruthless killer hidden in a blue smoke of money, threats, lies, and death. . . .",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Revolt in the Boardroom: The New Rules of Power in Corporate America",
        "Authors": "By Murray, Alan",
        "Description": "Throughout the 20th century, American corporations were governed by autocratic, almost unaccountable chief executives. Their word was law and the only check on their power was a board of directors composed of their friends and allies.Then, in a stunning reversal, a momentous series of firings deposed the heads of some of the world's best-known companies: AIG, Morgan Stanley, Boeing, Hewlett-Packard and Pfizer, just to name a few. Formerly unchallenged CEOs found themselves under fire, often from their own handpicked boards. The number of deposed executives is astonishing. In 2004, the leaders of 600 companies were asked to leave. That number more than doubled in 2005 and reached 1,400 companies in 2006.Flexing new muscles, directors are assuming new and unfamiliar responsibilities. In Revolt in the Boardroom, Alan Murray reveals the inner workings of the new seat of power. Using the access afforded to him by his influential Wall Street Journal column, Murray tells the story of three seminal board revolts—the now-famous Hewlett-Packard drama, the ousting of Boeing's Harry Stonecipher and the end of the reign one of the world's most autocratic executives, Hank Greenberg at AIG.Murray goes further to chart the history of the corporation, the rise of governance and the effects of the new power gained by outside institutions like hedge funds and interest groups. Through it all, Murray shows how the job of chief executive has rapidly and permanently changed. Leaders like A. G. Lafley and Jeff Immelt govern instead of rule, build alliances and support instead of dictating direction and pay careful attention to a broader range of stakeholders than ever before.Revolt in the Boardroom is the first look at the new world of corporate power and the last word on the transformational events of the last two years.",
        "Category": " Business & Economics , Corporate & Business History",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Anastasia on Her Own (Anastasia Krupnik Series)",
        "Authors": "By Lowry, Lois",
        "Description": "Help! Anastasia Krupnik's mother must organize her chaotic life. So Anastasia, who is a very organized person, and her father invent the solution to Mrs. Krupnik's problem: the Krupnik Family Nonsexist Housekeeping Schedule.But when Mrs. Krupnik goes to California on a ten-day business trip, Anastasia finds that the problem isn't solved at all. It's hard to stick to a schedule that doesn't leave room for her little brother, Sam, who's come down with the chicken pox, and her father's former girlfriend, who's invited herself to dinner. How is Anastasia supposed to cope with these interruptions when she's planning her first dream-date dinner for Steve Harvey?It's a cinch. As long as she sticks to the Krupnik Romantic Dinner Week Schedule, what could possibly go wrong?",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "The 15 Minute Vegetarian Gourmet",
        "Authors": "By Mitchell, Paulette",
        "Description": "Provides vegetarian recipes for appetizers, soups, salads, main dishes, and desserts, and explains how to plan a vegetarian meal",
        "Category": "",
        "Publisher": "MacMillan Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Networking Health: Prescriptions for the Internet",
        "Authors": "By Committee on Enhancing the Internet for Health Applications: Technical Requirements and Implementation Strategies, Computer Science and Telecommunicat",
        "Description": "Though the popular press has focused on Web sites that provide information of specific diseases, offer advice and mutual support, and sell health products, the research committee identifies many more applications of the Internet in health, including public health, biomedical research, health care finance and administration, and the maintenance of electronic health records. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Medical , Research",
        "Publisher": "National Academies Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Blender Recipes",
        "Authors": "By Oster, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "Oster",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "The Korean War: History And Tactics",
        "Authors": "By Rees, David",
        "Description": "A study of the Korean conflict reveals how and why the confrontation in the Korean Peninsula occurred",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "True Thai: The Modern Art of Thai Cooking",
        "Authors": "By Laursen, Byron, Sodsook, Victor, and Laursen, Theresa",
        "Description": "True Thai is one of those rare and important cookbooks where cuisine and culture meet. Food lovers will come away with layers of understanding, discovering the soul of a country where cuisine is a sacred art.True Thai takes us from the jostling Bangkok streets and canals to countryside rice paddles and mango groves, from distant mountain villages to Thailand's stately Royal Palace, delivering True Thai taste in every sense of the word.Victor Sodsook, a native Thai, chef/owner of Los Angeles's celebrated Siamese Princess restaurant, has written the authoritative Thai cookbook that American cooks have been waiting for. True Thai satisfies an increasing public interest in the seductive flavors of Thai cuisine, and a decreasing emphasis on high-fat, high-calorie red meats, eggs, and oils. The lively, easy-to-follow recipes are tailor-made for today's adventurous, aware cook.Most of the tools and ingredients used in True Thai are probably already in your kitchen. And its wide-ranging glossary of ingredients will help you select the most flavorful spices and freshest produce, as well as the best brands of key Thai ingredients like coconut milk and fish sauce. Among True Thai's 250 recipes, you'll find the many Thai dishes that have already won over Americans, such as Crispy Sweet Rice Noodles (mee krob) and soothing, aromatic Chicken-Coconut Soup with Siamese Ginger and Lemon Grass (tom kha kai). Everything is here, from the deliciously spiced barbecued chickens found in Thai provinces to the elaborate and time honored cuisines served to Thailand's royal family, such as King Rama V's Fried Rice. Since Thailand teems with both fresh- and saltwater fish and shellfish, you'll find an abundance of healthful, provocative seafood dishes, such as Ayuthaya Haw Mok Talay, a scrumptious mousse of curried fish, shrimp, and crab, redolent with chili and coconut milk, grilled and served in fragrant banana leaves.Surprisingly light preparations for meat include Fiery Grilled Beef Salad, a classic of Bangkok cafe cuisine, and mu kratiem phrik Thai, a simple stir-fry of pork medallions sizzling with garlic and black pepper. The Thai Vegetarian Cooking chapter is really a whole book unto itself, encompassing its own blend of curry pastes, soups, appetizers, entrees, and one-dish meals-all completely free of animal or fish products. The Thai Salads chapter showcases such recipes as Coconut, Lemon, and Ginger Salad or Grilled Lobster Salad with Green Mango that demonstrate the great variety and sensuousness of this branch of Thai cooking. Drinks and desserts include such ethereal treats as Rose-Petal Sorbet and the refreshingly herbaceous Lemon Grass Tea, wonderful either hot or cold. There's also a chapter that shows how to marry these newfound Thai tastes with classic American cooking, through such improvisations as Bangkok Burgers with Marinated, Grilled Onions and Spicy Thai Ketchup.True Thai is more than a cookbook; it is a collection of grace notes exemplifying Thai cuisine's dedication to pleasing the senses. There's even a chapter on preparing Thai-style table decorations, many of them as edible as they are lovely.True Thai's 250 recipes, each with helpful and fascinating notes, present Thai cuisine with simplicity and elegance. True That is the most authentic, authoritative, and accessible Thai cookbook ever printed in English.",
        "Category": " Cooking , Regional & Ethnic , Thai",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Art of the Sandwich",
        "Authors": "By Harlow, Jay",
        "Description": "Shares recipes for hot, cold, open-face, and stuffed and rolled sandwiches, as well as breads and sandwich spreads",
        "Category": " Cooking , Methods , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "I Was There: Gigs That Changed the World",
        "Authors": "By Paytress, Mark",
        "Description": "The Definitive Guide to the Most Talked AboutMusical Performances of the Past Century.Woodstock.  The Isle of Wight.  Bowie at the Hammersmith Odeon, 1972.  Nirvana at Reading, 1992.  Gigs that changed the face of music and the very foundations of popular culture.  Now, leading rock journalist Mark Paytress recreates the sights, smells, and sounds of the 20th Century's most talked about moments in the history of live music,   debunking myths and recreating the bands' --and the fans'--experiences.  There's something here for every musical taste-- from Benny Goodman at Carnegie Hall in 1938, to Bob Dylan, to Live Aid.  Complete with amazing photographs that capture the essence of these now legendary shows, this is a true compendium for any music fan or anybody who's ever thought, \"I wonder what it was like to be there?\"",
        "Category": " Music , Reference",
        "Publisher": "Cassell",
        "Price Starting With ($)": "8.72",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "100 American Flags: A Unique Collection of Old Glory Memorabilia (The Collector's Eye)",
        "Authors": "By Heffernan, Terry (PHT), Hinrichs, Kit, and Hirasuna, Delphine",
        "Description": "The American flag has been raised high in wartime triumph and peacetime celebration; sewn lovingly onto quilts, caps, pillows, and bags; appropriated by popular culture; and faithfully honored every Fourth of July. This vibrant collection of 100 Stars and Stripes artifacts ranges from Civil War-era banners and Native American braided moccasins to an early 20th-century \"friendship\" kimono and original flag art by several of the world's leading designers. Destined to captivate folk-art aficionados, history buffs, and collectors, 100 AMERICAN FLAGS provides a stunning visual history of America's most treasured symbol. A timely, patriotic full-color book presenting 100 American flag artifacts from one of the world's most eminent collectors, designer Kit Hinrichs. Selected images from LONG MAY SHE WAVE in an affordable, collectible edition. Election year and wartime keepsake, displaying nonpartisan national pride.",
        "Category": " Antiques & Collectibles , Americana",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Sidelights on Relativity",
        "Authors": "By Einstein, Albert",
        "Description": "In 1905, a German technical journal, Annalen der Physik, published a remarkable paper by a young clerk in the patent office at Berne, Switzerland. The clerk was Albert Einstein. The paper outlined his Special Theory of Relativity, a revolutionary physical theory which discarded the concept of absolute motion in favor of relative motion in the context of a four-dimensional continuum of space-time. It proved to be the most profound revolution in physics since Newton.About ten years later, building on his earlier work, Einstein formulated the General Theory of Relativity in which he offered a new solution to the great problem of gravitation, postulating the non-Euclidean character of the space-time continuum. Together, the two theories constituted a radically reoriented way of looking at the physical universe, an approach that solved many of the unresolved difficulties of classical mechanics and paved the way for great advances in 20th-century physics. This concise volume contains two addresses by Dr. Einstein outlining aspects of the theories. Ether and Relativity (1920), delivered at the University of Leyden, discusses the properties demanded of the ether of space by the theory of relativity. Geometry and Experience (1921), given at the Prussian Academy of Sciences, describes the limits within which the Euclidean or any other practical geometric system can be held to be approximately true in connection with the concept of a finite universe.Both lectures are reprinted here complete and unabridged; both express elegant ideas in simple prose devoid of complicated equations or abstruse terminology; both offer scientists and laypeople unparalleled insight into the seminal thinking of the 20th century's greatest physicist.",
        "Category": " Mathematics , Geometry , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "The Now Habit: A Strategic Program for Overcoming Procrastination and Enjoying Guilt-Free Play",
        "Authors": "By Fiore, Neil",
        "Description": "Learn how to overcome procrastination and enjoy guilt-free play!  One of the most effective programs to combat procrastination, THE NOW HABIT has sold over 100,000 copies, has been translated into 11 languages, and is now revised and updated.         Featuring a new introduction and a new section providing strategies to understand and deal with the role technology plays in procrastination today, THE NOW HABIT offers a comprehensive plan to help readers lower their stress and increase their time to enjoy guilt-free play. Dr. Fiore’s techniques will help any busy person start tasks sooner and accomplish them more quickly, without the anxiety brought on by the negative habits of procrastination and perfectionism.",
        "Category": " Psychology , Developmental , General",
        "Publisher": "Putnam-Tarcher",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Presentation Zen: Simple Ideas on Presentation Design and Delivery",
        "Authors": "By Reynolds, Garr",
        "Description": "FOREWORD BY GUY KAWASAKI  Presentation designer and internationally acclaimed communications expert Garr Reynolds, creator of the most popular Web site on presentation design and delivery on the Net — presentationzen.com — shares his experience in a provocative mix of illumination, inspiration, education, and guidance that will change the way you think about making presentations with PowerPoint or Keynote. Presentation Zen challenges the conventional wisdom of making \"slide presentations\" in today’s world and encourages you to think differently and more creatively about the preparation, design, and delivery of your presentations. Garr shares lessons and perspectives that draw upon practical advice from the fields of communication and business. Combining solid principles of design with the tenets of Zen simplicity, this book will help you along the path to simpler, more effective presentations.",
        "Category": " Computers , Desktop Applications , Presentation Software",
        "Publisher": "New Riders Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Sky Isn't Visible from Here: Scenes from a Life",
        "Authors": "By Sullivan, Felicia C.",
        "Description": "Felicia Sullivan's volatile, beautiful, deceitful, drug-addicted mother disappeared on the night Sullivan graduated from college, and has not been seen or heard from in the ten years since. Sullivan, who grew up on the tough streets of Brooklyn in the 1980s, now looks back on her childhood—lived among drug dealers, users, and substitute fathers. Sullivan became her mother's keeper, taking her to the hospital when she overdosed, withstanding her narcissistic rages, succumbing to the abuse or indifference of so-called stepfathers, and always wondering why her mother would never reveal the truth about the father she'd never met. Ashamed of her past, Sullivan invented a persona to show the world. Yet despite her Ivy League education and numerous accomplishments, she, like her mother, eventually succumbed to alcohol and drug abuse. She wrote The Sky Isn't Visible from Here, a testament to the resilience of the human spirit, when she realized it was time to kill her own creation.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Michael Jackson's Great Beer Guide",
        "Authors": "By Jackson, Michael",
        "Description": "A noted beer critic presents a compact guide to five hundred of the world's finest beers, offering an alphabetically organized reference that includes information on the history of the brew, tasting notes, alcohol content, region of origin, serving suggestions, and more for both traditional favorites and the newest products from modern microbreweries. Original.",
        "Category": " Cooking , Beverages , Beer",
        "Publisher": "DK",
        "Price Starting With ($)": "11.96",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Unbounding Future: the Nanotechnology Revolution",
        "Authors": "By Peterson, Chris, Drexler, K. Eric, and Pergamit, Gayle",
        "Description": "Nanotechnology involves the ability to manipulate matter on a molecular level with an atom-by-atom level of precision. The authors explain in a nontechnical way what nanotechnology is, how it works, and its potential to radically alter industry, medicine, economics, military research, and the environment. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Technology & Engineering , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Symbols of the Church",
        "Authors": "By Whittemore, Carroll E. (EDT)",
        "Description": "This resource, with over 200 full-color photographs and illustrations depicts a variety of symbols, explains often-misunderstood symbols commonly seen in churches. The book shares the origin and meaning of hundreds of symbols of the Christian faith, as well as fascinating stories behind many symbols. It includes symbols from the Old and New Testaments, the Christian tradition, those representing apostles and saints are discussed, plus denominational emblems.Help the children of your church recognize Christian symbols with a resource developed exclusively for them! Symbols of Faith can be found  in the Related Products Section Below.Examine Worship Connection for ideas and resources for all the ways we worship. Did you know. . .Religious symbolism appeals to both the intellect and the emotions.Symbols were widely used by the early Christian church; Christian denominations have created logos, often using many of the images and symbols of the faith, to give visual expression to its character, beliefs, history, and mission.",
        "Category": " Religion , Biblical Commentary , General",
        "Publisher": "Abindgon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "The Jungle Book",
        "Authors": "By Kipling, Rudyard and Eichenberg, Fritz (ILT)",
        "Description": "Includes Kipling's classic stories of the boy Mowgli and his wolf pack, and other animal friends, Toomai the elephant boy, and Rikki-Tikki-Tavi",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "Small Changes, Big Results: A 12-Week Action Plan to a Better Life",
        "Authors": "By James-Enger, Kelly and Krieger, Ellie",
        "Description": "An easy-to-start, simple-to-maintain, scientifically sound, and eminently usable twelve-week program of small steps on the road to better health Small Changes, Big Results is not about cutting all the carbohydrates out of your diet. Or replacing every single gram of sugar with omega-3 fatty acids. It’s not about doing one hundred sit-ups a day, or getting on the treadmill whenever you have a free second. In fact, it’s not about any of the total lifestyle-replacement gimmicks—whether diet, exercise, or pop psychology—that have swept our culture in recent years, putting untold millions of Americans on the risky roller coaster of success and failure that defines fad diets and programs. Not here. Small Changes, Big Results is about reality—the reality of what you can do, the reality of what you want to do, and the reality of what works. It’s about introducing a series of small changes each week for three months in the three core areas of diet and nutrition; exercise and fitness; and emotional wellness. For each of the twelve weeks, nutritionist Ellie Krieger introduces a very finite, completely practical action plan for the week—and not only are these tasks incredibly doable, they’re in fact so accessible that it’s tough not to be inspired. For example, in Week 1 the nutrition task is merely to go shopping, buy some healthful pantry items, and start keeping track of what you eat; the exercise consists of taking three twenty-minute walks; and the wellness aspect is to do a five-minute breathing exercise. That’s it. And it doesn’t really get any harder. But these small changes do in fact lead to big results. At the end of twelve weeks, a totally unhealthy diet has been overhauled: armed with easy, delicious recipes and tips, you’ve removed unhelpful munchies and replaced them with healthful snacking, you’ve cut down on lethal trans fats while adding beneficial fat choices, you’ve replaced refined grains with whole grains, you’re eating more fish and less red meat, and so forth. Yet you’ve never been forbidden to eat a single thing: instead of prohibiting entire food groups, Ellie categorizes foods as Usually, Sometimes, and Rarely—and now you should be eating more from the Usually choices, less from the Rarely category. Furthermore, you’ve integrated physical activity into your life, and you’ve developed a set of tools to help you deal with stress—you’re not only eating better, but you’re also exercising better and feeling better. The beauty of this program is that none of these action steps is remotely intimidating, because they’re not a full immersion into a totally new lifestyle. Instead, it’s a series of incremental changes—removing bad habits one by one, while at the same time adding good ones. There’s nothing to scare you off—on the contrary, here’s a whole book full of small changes that produce big results.From the Hardcover edition.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Our Lady of Emmitsburg: The Center of Her Immaculate Heart",
        "Authors": "By Forker, Dom",
        "Description": "",
        "Category": "",
        "Publisher": "Queenship Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Echoes of Combat",
        "Authors": "By Turner, Fred",
        "Description": "Exploring the parallels between the healing of Vietnam veterans and America's cultural recovery from the war, an analysis of the link between private trauma and public memory connects individual and social suffering and explains how our understanding of Vietnam has been transformed.",
        "Category": " History , Military , Vietnam War",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Harper Collins Atlas of World History",
        "Authors": "By Geoffrey, Editor Barraclough",
        "Description": "",
        "Category": "",
        "Publisher": "Borders/HarperCollins, 1999.",
        "Price Starting With ($)": "6.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Plain Living: A Quaker Path to Simplicity",
        "Authors": "By Whitmire, Catherine",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Sorin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Media and the War on Terrorism",
        "Authors": "By Brookings Institution (COR), Hess, Stephen (EDT), Kalb, Marvin L. (EDT), and Joan Shorenstein Center on the Press, Politics, and Public Policy (COR)",
        "Description": "These candid conversations capture the difficulties of reporting during crisis and war, particularly the tension between government and the press. The participants include distinguished journalists?American and foreign, print and broadcast?and prominent public officials, past and present. They illuminate the struggle to balance free speech and the right to know with the need to protect sensitive information in the national interest. As the Information Age collides with the War on Terrorism, that challenge becomes even more critical and daunting.  \"We are very careful in what we talk about publicly. We do not want to paint a picture for the bad guys. So we don't talk very much at all about what we're going to do going forward.\"?Victoria Clarke, Department of Defense  \"This was a war that was very different. It was conducted primarily by about 200 to 250 special forces soldiers on the ground. There were no reporters with those soldiers until after the fall of Kandahar, until the war was essentially over. There were no eyes and ears, and that's the way the Pentagon wants it.\"?John McWethy, ABC News  \"I covered Capitol Hill for a very long time and was always astounded by the nonpolitical motivation of a lot of people that are up there who really do want to make the world better, want to make the U.S. better. So don't come away believing that because there are political implications that there are always political motivations.\"?Candy Crowley, CNN  \"There is a feeling among the community, Muslim Americans, and also overseas that we might become the new enemy. But so far nobody knows whether it is just because of the war or if it's going to last.\"?Hafez Al-Mirazi, Al-JazeeraCosponsored with the Shorenstein Center on the Press, Politics and Public Policy at the Kennedy School, Harvard University.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "6.39",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Unwise Passions : A True Story of a Remarkable Woman and the First Great Scandal of 18th Century America",
        "Authors": "By Crawford, Alan Pell",
        "Description": "In the spring of 1793, eighteen-year-old Nancy Randolph, the fetching daughter of one of the greatest of the great Virginia tobacco planters, was accused, along with her brother-in-law, of killing her newborn infant. Once one of the loveliest and most sought-after young women in Virginia society, she was immediately denounced as a ruined Jezebel, and the great orator Patrick Henry and future Supreme Court justice John Marshall were retained to defend her in her sensational trial.  In the tradition of Midnight in the Garden of Good and Evil, Alan Pell Crawford brings to life this gripping account of murder, infanticide, and prostitution charges, and of unimaginable treachery, moral decline, and great heroism played out in the intimate lives of this nation's Founding Fathers. It is the true story of the privileged and pampered children of the new  country's aristocratic families as they struggle to find their place in an increasingly democratic America, where their values and position in society are under siege. Above all, it is the story of the indomitable Nancy Randolph, who is hounded out of Virginia by a scandal that will haunt her and everyone she loves for the rest of their lives.  In the early 1790s, after Nancy goes to live with her sister Judith and handsome brother-in-law Richard at their remote plantation, called Bizarre, rumors fly throughout Virginia that Nancy has given birth and Richard, knowing the child to be his, has killed it. After an inquest, Nancy is ordered off the plantation by her cousin John Randolph and, reduced to poverty, she must find her way in a new and forbidding world.  Eventually she flees to New York where she forms an unlikely alliance with  the immensely rich Gouverneur Morris, a signatory of the Declaration of Independence. Meanwhile John Randolph, a protégé of Thomas Jefferson who becomes a notorious wit and controversial member of Congress, a duelist and a drug addict, spends most of his life campaigning against her. After Morris's death, Nancy must fight for her honor once again -- Morris's relatives are eager to have a piece of his estate and to see her disinherited.  American history at its richest, with a cast of characters including not only the haughty Randolphs, but Jefferson, Henry, Morris, and Marshall, Unwise Passions is as riveting and revealing as any current scandal -- in or out of Washington.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Jeffrey Gitomer's Little Gold Book of Yes! Attitude: How to Find, Build and Keep a Yes! Attitude for a Lifetime of Success",
        "Authors": "By Gitomer, Jeffrey",
        "Description": "Every business winner has one thing in common: a YES! Attitude that's powerful enough to help them achieve the impossible! When you've got a YES! Attitude, you assume everything will start with \"YES!\" ...and you'll find a way to \"YES!\" even when the first, second, and third answer you hear is \"NO!\" You say you weren't born with a YES! Attitude? No problem! Jeffrey Gitomer will give you all the tools you need to build one. As the world's #1 expert in selling (and the author of the best-sellersLittle Red Book of Selling and Little Red Book of Sales Answers.) Gitomer knows more about attitude than anyone. Now he's brought those lessons together in a book you can read in one sitting... a book that'll change your life! What makes this book unique? It's not just \"inspiration\": it's a complete, step-by-step, fully-integrated game plan for understanding and mastering your attitude. You'll learn 7.5 specific things you can do to maintain your intensity, drive, and commitment... discover 20.5 \"attitude gems\" that capture the value of thousands of dollars of books and courses... learn how to overcome the 10.5 most dangerous \"attitude busters\"... then learn how to maintain your YES! Attitude every day, for the rest of your life! Don't just read this book once: study it, live it -- and win!",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "Ft Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Between Here and April",
        "Authors": "By Kogan, Deborah Copaken",
        "Description": "When a deep-seated memory suddenly surfaces, Elizabeth Burns becomes obsessed with the long-ago disappearance of her childhood friend April Cassidy. Driven to investigate, Elizabeth discovers a thirty-five-year-old newspaper article revealing the details that had been hidden from her as a child—shocking revelations about April's mother, Adele.Elizabeth, now herself a mother, seeks out anyone who might help piece together the final months, days, and hours of this troubled woman's life, but the answers yield only more questions. And those questions lead back to Elizabeth's own life: her own compromised marriage, her increasing self-doubt and dissatisfaction, and finally, a fearsome reckoning with what it means to be a wife and mother.",
        "Category": " Fiction , Literary",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Unclutter Your Personal Life: A Learning Annex Book",
        "Authors": "By Wright, Susan",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Citadel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "India: Granta 57",
        "Authors": "By Jack, Ian (EDT) and Granta (EDT)",
        "Description": "",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Granta Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "They Called Her Mrs Doc (Women of the West #5)",
        "Authors": "By Oke, Janette",
        "Description": "As the daughter of a successful Montreal physician, Cassandra Dell Winston is used to city life, so when she falls in love with a conscientious young doctor who intends to practice in his hometown on the frontier, she can only hope that life out west will prove to be temporary",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Danny Gospel",
        "Authors": "By Athey, David",
        "Description": "A disillusioned mail carrier still known by his childhood nickname of \"Danny Gospel,\" due to his family's free concerts, sets off to find a woman who appeared in his apartment and kissed him before disappearing mysteriously.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Weapons Grade: How Modern Warfare Gave Birth to Our High-Tech World",
        "Authors": "By Hambling, David",
        "Description": "Understanding how business is likely to evolve in the coming years is itself a multi-million dollar business. Plenty of gurus, academics and snake-oil salesmen will tell you all about the future ? for a price. What all of these experts often overlook is that the future is already here. Chances are, the products and services we will buy and sell tomorrow are available ? to a very limited clientele ? at a top-secret research institute near you.Throughout human history war and the threat of war have driven innovation and accelerated the uptake of new technology ? from the nomadic warriors who introduced the stirrup and the kebab to the world, to the British Navy’s funding of Marconi’s new-fangled radio. And since 1945 the relationship between military needs and modern business has grown ever closer, especially in the United States. David Hambling traces the history of this relationship in the modern era and shows how precision eye surgery emerged out of the military quest for a ?death ray,’ how transistors and silicon chips first helped build better bombs, and exactly why the 747 has such a distinctive shape.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "8.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Be Heard the First Time: The Woman’s Guide to Powerful Speaking (Capital Business)",
        "Authors": "By Miller, Susan D., Ph.D.",
        "Description": "Dr. Susan Miller’s passion is to empower women with effective compelling communication skills so they can articulate and achieve their goals, communicate their needs, and master the art of “being heard” where it counts. Be Heard the First Time is an operator’s manual for oral communication and shares the seven key skills of all competent speakers, plus Dr. Miller’s proven strategies for breath and pitch control.  For beginners, she shows how to focus on posture, presence, comfort level, and the message itself. For the more skilled speaker, Dr. Miller provides effective strategies for combating dry mouth, retrieving words, and answering aggressive questioning when faced with a high-level public meeting or press conference.     Be Heard the First Time promises to help reticent women walk, stand, or sit powerfully, even if you feel insecure; like the sound of your voice; breathe deeply and slowly when you are anxious; say the last word of a sentence without trailing off; express your opinions, desires, and experiences clearly; vary the loudness, pitch, and duration of your voice when speaking; entertain others with stories, presentations, and tall tales; finish your statement without interruption; interview, clarify, object, debate, and negotiate powerfully; and respond assertively to criticism.     Now the soft-spoken patent attorney, for example––when promoted to the CEO position––can quickly learn how to make a confident and visible entry to a conference or reception room, and how to speak quite differently than she did before her promotion. And, for those aiming for promotion, this book reveals how to “be heard the first time” so you can achieve your goals.",
        "Category": " Language Arts & Disciplines , Speech & Pronunciation",
        "Publisher": "Capital Books",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Discovery Channel: Weather: An Explore Your World Handbook",
        "Authors": "By MOGIL, H. MICHAEL",
        "Description": "Offers background information and hands-on meteorological advice while explaining how weather works, discussing the seven climate zones, and demonstrating weather forecasting",
        "Category": " Nature , Weather",
        "Publisher": "Discovery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Stoned images",
        "Authors": "By Hoefer, Hans",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton Paperback, 1978",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Plain Truth: A Novel",
        "Authors": "By Picoult, Jodi",
        "Description": "A shocking murder shatters the picturesque calm of Pennsylvania's Amish country -- and tests the heart and soul of the lawyer who steps in to defend the young woman at the center of the storm....  Plain Truth  The discovery of a dead infant in an Amish barn shakes Lancaster County to its core. But the police investigation leads to a more shocking disclosure: circumstantial evidence suggests that eighteen-year-old Katie Fisher, an unmarried Amish woman believed to be the newborn's mother, took the child's life. When Ellie Hathaway, a disillusioned big-city attorney, comes to Paradise, Pennsylvania, to defend Katie, two cultures collide -- and, for the first time in her high-profile career, Ellie faces a system of justice very different from her own. Delving deep inside the world of those who live \"plain,\" Ellie must find a way to reach Katie on her terms. And as she unravels a tangled murder case, Ellie also looks deep within -- to confront her own fears and desires when a man from her past reenters her life.  Moving seamlessly from psychological drama to courtroom suspense, Plain Truth is a fascinating portrait of Amish life -- and a moving exploration of the bonds of love, friendship, and the heart's most complex choices.",
        "Category": " Fiction , Amish & Mennonite",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Thin Edge: Coast and Man in Crisis",
        "Authors": "By simon, anne w.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "7.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Brain Builders!: A Lifelong Guide to Sharper Thinking, Better Memory, and an Age-Proof Mind",
        "Authors": "By Leviton, Richard",
        "Description": "Hundreds of ways to preserve, restore and improve the brain's potential. These all-natural techniques help boost brain power and prevent mental aging. They represent the latest developments in scores of disciplines, including meditation, yoga, nutrition, vitamins, herbs and more.",
        "Category": " Self-help , Personal Growth , Memory Improvement",
        "Publisher": "Prentice-Hall Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The American Heritage History of Railroads in America / by Oliver Jensen",
        "Authors": "By Oliver Jensen",
        "Description": "",
        "Category": "",
        "Publisher": "American Heritage Publishing",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Backgrounds of Romanticism; English Philosophical Prose of the Eighteenth Century",
        "Authors": "By Trawick, Leonard M.",
        "Description": "",
        "Category": "",
        "Publisher": "Indiana",
        "Price Starting With ($)": "10.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "An Illustrated History of the United States Navy",
        "Authors": "By Hearn, Chester G.",
        "Description": "",
        "Category": "",
        "Publisher": "Salamander Books",
        "Price Starting With ($)": "7.98",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Deep in the Green: An Exploration of Country Pleasures",
        "Authors": "By Raver, Anne",
        "Description": "As gardening columnist for the New York Times, Anne Raver is one of our foremost authorities on making things grow. Even non-gardeners will find this book of essays a source of profound pleasure, for Raver is a writer who transcends her subject even as she illuminates it, writing with such passion, wisdom and stylishmess that her book will enchant anyone who reads it.",
        "Category": " Gardening , Essays & Narratives",
        "Publisher": "Knopf Doubleday Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "the impact of sociology",
        "Authors": "By Douglas",
        "Description": "",
        "Category": "",
        "Publisher": "Appleton-Century-Crofts",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "A Musical Christmas With Peter Duchin",
        "Authors": "By Duchin",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston, Inc.",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "Woman's day Christmas cross stitch",
        "Authors": "By Perrone, Lisbeth",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold Inc.,U.S.",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Curriculum Vitae, Autobiography",
        "Authors": "By Spark, Muriel",
        "Description": "The author of Symposium and The Prime of Miss Jean Brodie explores her own life in an autobiography designed to answer her reader's most-asked question, \"are your novels autobiographical?\"",
        "Category": "",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Sarah's Key",
        "Authors": "By De Rosnay, Tatiana",
        "Description": "",
        "Category": "",
        "Publisher": "Saint Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Beautiful Windows: Stylish solutions from Hunter Douglas",
        "Authors": "By Connors, Jill (EDT), Douglas, Hunter, McKay, Gary (EDT), and Hunter Douglas Inc. (COR)",
        "Description": "One of the leading providers of window coverings assists readers in making the right window fashion choices that will best suit their home's architectural and furnishing style; blends the themes of light, comfort, privacy, style, and safety in creating gorgeous rooms; and provides expert advice, resource sections, and photographs. Original. 40,000 first printing.",
        "Category": " House & Home , Decorating",
        "Publisher": "Hunter Douglas",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Shade gardens (The Time-Life encyclopedia of gardening)",
        "Authors": "By Allen, Oliver E.",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Art of Reading: Forty Illustrators Celebrate RIF's 40th Anniversary",
        "Authors": "By Marcus, Leonard S. (FRW)",
        "Description": "For forty years, the nonprofit literacy organization Reading Is Fundamental has been putting books into the hands of children across America. To commemorate its fortieth anniversary, it has brought together forty of the most celebrated children’s book illustrators working today and asked them each to re-imagine a classic book from their childhood. The result is a collection of beautiful and captivating images and insightful essays that remind us how a child’s early experiences with books can be powerful and lasting—and can help to create writers and artists.This gift book includes a foreword by Leonard Marcus, noted historian, author, and critic in the field of children’s literature.",
        "Category": " Juvenile Nonfiction , Art , General",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "10.03",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Who by Fire: A Novel (P.S.)",
        "Authors": "By Spechler, Diana",
        "Description": "Bits and Ash were children when the kidnapping of their younger sister, Alena—an incident for which Ash blames himself—caused an irreparable family rift. Thirteen years later, Ash is living as an Orthodox Jew in Israel, cutting himself off from his mother, Ellie, and his wild-child sister, Bits. But soon he may have to face them again; Alena's remains have finally been uncovered. Now Bits is traveling across the world in a bold and desperate attempt to bring her brother home and salvage what's left of their family.Sharp and captivating, Who by Fire deftly explores what happens when people try to rescue one another.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Spotlight on Shimmer! (Miss Spider)",
        "Authors": "By Kirk, David",
        "Description": "Shimmer discusses what her life is like as an adopted bug and big sister.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    }
]