[
    {
        "Title": "Empire of Blue Water: Captain Morgan's Great Pirate Army, the Epic Battle for the Americas, and the Catastrophe That Ended the Outlaws' Bloody Reign",
        "Authors": "By Talty, Stephan",
        "Description": "He challenged the greatest empire on earth with a ragtag bunch of renegades—and brought it to its knees. Empire of Blue Water is the real story of the pirates of the Caribbean.Henry Morgan, a twenty-year-old Welshman, crossed the Atlantic in 1655, hell-bent on making his fortune. Over the next three decades, his exploits in the Caribbean in the service of the English became legendary. His daring attacks on the mighty Spanish Empire on land and at sea determined the fates of kings and queens, and his victories helped shape the destiny of the New World.Morgan gathered disaffected European sailors and soldiers, hard-bitten adventurers, runaway slaves, and vicious cutthroats, and turned them into the most feared army in the Western Hemisphere. Sailing out from the English stronghold of Port Royal, Jamaica, “the wickedest city in the New World,” Morgan and his men terrorized Spanish merchant ships and devastated the cities where great riches in silver, gold, and gems lay waiting. His last raid, a daring assault on the fabled city of Panama, helped break Spain’s hold on the Americas forever. Awash with bloody battles, political intrigues, natural disaster, and a cast of characters more compelling, bizarre, and memorable than any found in a Hollywood swashbuckler—including the notorious pirate L’Ollonais, the soul-tortured King Philip IV of Spain, and Thomas Modyford, the crafty English governor of Jamaica—Empire of Blue Water brilliantly re-creates the passions and the violence of the age of exploration and empire.",
        "Category": " History , Caribbean & West Indies , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Irish Eyes: The Dark Beginnings of Sherlock Holmes (Nuala Anne McGrail Novels)",
        "Authors": "By Greeley, Andrew M.",
        "Description": "Nuala Anne McGrail now lives in Chicago with her husband, Dermot, and their new baby, Nelliecoyne. As Nuala fans may suspect, Nelliecoyne is no ordinary baby: she is fey like her mother and can see into the past as well as the future. Nuala is having a hugely successful career as a folksinger but she is being brutally attacked in the media by a schlock-jock named Nick Farmer, who says he's out to push her off the charts. Obsessed with Nuala, he's even gone so far as to threaten to institute proceedings to have her baby taken away from her.Both Nuala and her daughter have sensed strange vibrations from a place on the Lake where a shipload of Irish Americans lost their lives a hundred years ago. The indomitable Nuala, with her ever-faithful husband and the strange and curious help of her infant daughter, begins to work on unraveling the mystery of why and how the ship was sunk and what might be at the bottom of the Lake. In the course of the investigation they make some dangerous enemies and eventually have to solve a murder and find a buried treasure. Will Nuala survive the attacks of Nick Farmer and a dangerous run-in with the Balkan Mafia? And how does the diary kept by a young Irishwoman in the early 1900s play into these events?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Poetry Tree",
        "Authors": "By John T. West, Jr.",
        "Description": "",
        "Category": "",
        "Publisher": "White's Creek Publisher",
        "Price Starting With ($)": "6.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Sri Isopanisad",
        "Authors": "By Bhaktivedanta, S. Prabhupada",
        "Description": "The 108 Upanishads are considered the essence of all the Vedas, and Shri Ishopanishad is foremost among them. Discover the distilled essence of all knowledge in these eighteen enlightening verses.",
        "Category": " Philosophy , General",
        "Publisher": "Krishna Books Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Easy to Kill",
        "Authors": "By Christie, Agatha",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books / Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Let's Have Breakfast Fun for Kids & Parents (Junior Cookbook Collection)",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Rand McNally Children's Atlas of the United States",
        "Authors": "By Rand McNally and Company (NA)",
        "Description": "Maps and text present information about the topography, population, emblems, and other aspects of the different states in the United States",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Seaside Gardening: Plantings, Procedures, and Design Principles",
        "Authors": "By Littlefield, Susan S. H.",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Our 50 States: A Family Adventure Across America",
        "Authors": "By Preiss-Glasser, Robin (ILT) and Cheney, Lynne V.",
        "Description": "\"As I've traveled our great country, I have been struck again and again by its beauty and variety and reminded of how rich our history is. Travel a few miles in any direction, and you'll encounter an amazing story that helps explain all the multitude of ways our country came to be.\" -- Lynne Cheney   Lynne Cheney and Robin Preiss Glasser, creators of the bestselling America: A Patriotic Primer and A is for Abigail: An Almanac of Amazing American Women, take you on an unforgettable tour of America -- from the Everglades of Florida to the grasslands of Kentucky to the Sierra Mountains of California.   Listening to her grandchildren's enthusiastic account of all they saw and did on a family road trip inspired Lynne Cheney to collaborate with Robin Preiss Glasser and create Our 50 States -- the greatest family vacation imaginable. Pack your bags and celebrate our diverse heritage state by state and sea to shining sea in this treasure trove of America's people, places, and history.   A scholar of American history, Mrs. Cheney has drawn on a lifetime of study and travel for Our 50 States. Robin Preiss Glasser has brought her inimitable wit and exuberance to every illustration. Together they have created a joyful book that reminds us how fortunate we are to call America our home.",
        "Category": " Juvenile Nonfiction , People & Places , United States , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Civil War Through the Camera: A Complete Illustrated History of the Civil War",
        "Authors": "By Elson, Henry W. (EDT)",
        "Description": "Contemporary photographs help retell the story of the Civil War, campaign by campaign, and what life was like for soldiers and civilians",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Galahad Books",
        "Price Starting With ($)": "8.61",
        "Publish Date": {
            "Month": "May",
            "Year": "1980"
        }
    },
    {
        "Title": "Seeing Stars",
        "Authors": "By Seiger, Barbara and Calsbeek, Craig (ILT)",
        "Description": "A large full-color poster that comes complete with four hundred glow-in-the-dark star stickers accompanies an informative study of facts and lore about the thirty-five most familiar constellations. Original.",
        "Category": " Juvenile Fiction , Nature & the Natural World , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Bone Magician",
        "Authors": "By Higgins, F. E.",
        "Description": "Pin Carpue is on his own in the world. His mother is dead and his father is missing after being labeled a suspect in a rash of murders. Pin finds a job working for the local undertaker as a body watcher, making sure people are really dead before they’re buried. The body he’s supposed to be watching tonight is currently surrounded by three people engaged in a most unusual ceremony. An old man, a bone magician, and his young female assistant are waking a woman so her grieving fiancé can have one last goodbye with her. Pin can’t believe it will work, but then the dead woman sits up and speaks.Pin is determined to discover how the magic works. He cannot believe they are raising the dead. He cannot believe his father is a murderer. Then Pin himself nearly becomes the killer’s next victim.As this mysterious tale unfolds with delicious creepiness, Pin will learn more about the bone magician, the girl Juno, and a hideous creature called the Gluttonous Beast that is kept in a local tavern where people pay for a glimpse.Once again, F.E. Higgins delivers a story that is full of intrigue and suspense.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Feiwel & Friends",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Handyman Complete Guide To Home Maintenance",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "banner press inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Leaving Mother Lake: A Girlhood at the End of the World",
        "Authors": "By Namu, Yang Erche and Mathieu, Christine",
        "Description": "In the remote Himalayas, on the shores of magnificent Lake Lugu, there is a place the Chinese call \"the Country of Daughters.\" This is the home of the Moso, a remarkable society in which women rule men. In the Moso tradition, marriage is considered a backward practice, and property is passed from mother to daughter. Every household has a matriarch who oversees the family's customs, rituals, and economics. Daughters are prized above sons, and both live their entire lives in the house where they were born.In the extraordinary story of Yang Erche Namu, life among the Moso is revealed for the first time in fascinating, intimate detail. Leaving Mother Lake is the story of one girl's coming-of-age in a world of women. From Namu we learn of a young girl's \"skirt ceremony,\" of how courtship is conducted through dance and song, and of the private \"flower chambers\" where young women consort with their lovers. Despite the freedoms Namu enjoys, they aren't the freedoms she desires. Her impulsive, restless nature drives her to leave her mother's house, defying the tradition that holds Moso culture together. She learns she must venture out into the larger world to see better the one she leaves behind.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Go For It! Inspiring Words of Determination",
        "Authors": "By Jo Ryan",
        "Description": "",
        "Category": "",
        "Publisher": "Tangent Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "From the Heart: Eight Rules to Live By",
        "Authors": "By Roberts, Robin",
        "Description": "A co-anchor for Good Morning America argues against popular beliefs about \"outside the box\" thinking as a method for success, identifying eight life principles she believes must be adhered to in order to achieve true and meaningful success. Reprint. 60,000 first printing.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "May I Kiss You? A Candid Look at Dating, Communication, Respect, & Sexual Assault Awareness",
        "Authors": "By Domitrz, Michael",
        "Description": "",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Awareness Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Voices of Courage: Inspiration from Survivors of Sexual Assault",
        "Authors": "By Domitrz, Michael",
        "Description": "Twelve accounts from sexual assault survivors.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Awareness Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Patron Saints By Michael Freze",
        "Authors": "By Freze, Michael",
        "Description": "",
        "Category": " Religion , History",
        "Publisher": "Our Sunday Visitor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Betty Crocker Annual Recipes 2009 by betty crocker (2009) Hardcover",
        "Authors": "By Betty Crocker",
        "Description": "",
        "Category": "",
        "Publisher": "General Mills, Inc, Minneapolis, Minnesota, U.S.A., 2009",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Helping Your Child Learn Math with Activities for Children Aged 5 Through 13",
        "Authors": "By Patsy F. Kanter",
        "Description": "",
        "Category": "",
        "Publisher": "D.C. Heath and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "African Americans: Voices of Triumph : Creative Fire",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "A third volume in the history of African-American contributions to U.S. culture explores the seminal role of African-American music, storytelling traditions, and love of drama in transforming American film, music, literature, and the visual arts.",
        "Category": " Art , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "365 Last-Minute Meals (Better Homes & Gardens Cooking)",
        "Authors": "By Better Homes and Gardens Books (NA)",
        "Description": "365 delicious, fast and family-friendly recipes.Recipes are divided into spring, summer, winter, and fall sections so readers can quickly find ideas that sound just right for the season.Each recipe has 7 or fewer ingredients to minimize shopping and prep work.Included with each recipe is a menu showcasing super-easy side dishes. For example, transform bagged lettuce by adding strawberries, blueberries, sliced almonds, and bottled balsamic dressing.Two 16-page sections are packed with appetizing color photos of many of the book's recipes.Includes a helpful list of items to keep in the pantry for the quick-and-easy serve-along side dishes.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Small Business Marketing For Dummies",
        "Authors": "By Schenck, Barbara Findlay",
        "Description": "Having your own business isn’t the same as having customers, and one is useless without the other. Whether your business is a resale store or a high-tech consulting firm, a law office or a home cleaning service, in today’s competitive environment, strategic marketing is essential.Small Business Marketing For Dummies, Second Edition is updated from the original version that won rave reviews and inspired thousands of small businesses on their way to becoming big businesses. Updates include more information on online marketing, a whole new section on getting and keeping customers, new cost-effective, fast-acting ideas for instant impact, and more. The book covers:Marketing basics that prepare you to rev up your business and jumpstart your marketing programInformation to help you define your business position and brandAdvice on bringing in professionalsA quick-reference guide to mass media and a glossary of advertising jargonHow-tos for creating print and broadcast ads that workIdeas for getting the word out without advertising, including information on direct mail, brochures, publicity, promotions, and moreTen steps to follow to build your own easy-to-assemble marketing planWith pages of ideas for low-cost, high-impact marketing from author Barbara Findlay Schenck, a marketing consultant with more than 20 years experience with clients ranging from small businesses to Fortune 500 companies, Small Business Marketing For Dummies, Second Edition helps you reach and keep new customers. Whether you’re running a home office, a small firm, a family business, a nonprofit organization, or a retail operation, you’ll discover how to:Custom design your own marketing programCreate effective marketing messagesProduce marketing communications that workNo matter what field you’re in, Small Business Marketing For Dummies, 2nd Edition will help you make your dreams come true. If you buy it, read it, and implement some of the marketing strategies discussed, customers will come.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Time to Cook Low Carb in 10, 20 & 30 Minutes",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Biggest Book of Grilling: Hundreds of Sizzlin' Recipes for Charcoal and Gas Grills (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books (EDT) and Holcomb, Carrie E. (EDT)",
        "Description": "More than 400 recipes for beef, pork, lamb, veal, poultry, and seafood offer grilling variety.Cooks can grill an entire meal with recipes for sides, salsas, sauces, vegetables, snacks, and appetizers.Handy cooking charts help cooks time and grill to perfection.Barbecue basics for charcoal and gas grills, plus hints on safety and proper equipment carefully guide novice grillers.Includes bonus chapter on indoor grilling and smoke grilling.Advice on how to prepare and season meats makes grilled dishes more flavorful.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Fisherman's Bend (Jane Bunker)",
        "Authors": "By Greenlaw, Linda",
        "Description": "When former Miami homicide detective Jane Bunker left her big city life for Green Haven, Maine, she thought she was also leaving behind the pollution, noise, and dead bodies. Well--as any New Englander will tell you--two out of three ain't bad. After solving a murder and surviving a couple of attempts on her life (recounted in the bestselling mystery Slipknot), Jane Bunker believes she's finally earned a respite from murder and intrigue. But if she thinks it's time for her to soak up the peace and quiet she's been seeking, she should think again. On her way back from a routine investigation into some smashed equipment, Jane takes a moment to appreciate the beauty of a Maine autumn--there's the sublime rainbow foliage of the highlands, the serene reflections of the setting sun on the bay's gentle waves, the elegant silhouette of a lobster boat on the bay. But her calm lasts only as long as it takes for Jane to make the chilling discovery that the vessel is in serious trouble with nobody aboard--and that its owner has vanished without a trace. And that's the least of the mysteries. A young mariner dead of a heroin overdose; the real agenda of a charismatic Indian leader; a missing bait iron and a corpse painted red--nothing is what it seems. Fisherman's Bend brings us Greenlaw's pitch-perfect ear for all things maritime. From the eccentric denizens of little Green Haven--Audrey, the punk rock waitress, the delightful Vickersons with their all-mussel cookbook--to the dark undercurrents that run beneath this seemingly idyllic coastal village, Greenlaw's flair for combining humor and Down East flavor with roller-coaster suspense makes this a mystery that will grab you hook, line, and sinker.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "What You Need to Know About the New Age Movement (Conversations With the Cults)",
        "Authors": "By Smith, F. Lagard",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Madoff Chronicles: Inside the Secret World of Bernie and Ruth",
        "Authors": "By Ross, Brian",
        "Description": "The collapse of Bernie Madoff's Ponzi scheme led to the instant evaporation of $65 billion of wealth.  The effects of Madoff's brazen fraud were felt most closely in New York and Palm Beach but the story was, and continues to be, front page news across the country. Now, Brian Ross and his team of investigators shed an unyielding light onto Madoff's scheme--how he got started, how he succeed for so long, who helped him, and who shielded him from early investigations.  From hard hitting revelations to fascinating anecdotes, this is an incisive and voyeuristic look into this first family of financial crime . This is both news and the most addictive kind of true crime reading, certain to appeal to both Madoff junkies and neophytes who will love a juicy story filled with intrigue, betrayal, and billions and billions of dollars. The Madoff Chronicles includes a vast array of news and material that readers won't find anywhere else.Contains a reproduction of Bernie's Little Black Book.  The essential contacts contained here were always kept close at hand.  This material has been extremely useful to the FBI investigation as they try to determine the roles that ther people played in the fraud.Ross has also secured Madoff's calendar for the past three years and other never-before-seen documents from inside the Madoff empire, straight from his desk.Read key details of how Madoff carried out his scam and the revelation that he began the fraud from almost the first day, in the 1960s. Hear how investigators tell believe that a billion dollars or more may have been hidden by Madoff.Learn what was going on inside the Madoff apartment as Bernie prepared for his life in prison and Ruth prepared for life in self-imposed confinement.Extensive cooperation by Madoff's personal assistant, Eleanor Squillari. Extensive cooperation by Little Rick-a former employee who used to fetch drugs for the Madoffs.  Little Rick knows all their dirty secrets.  We learn that Bernie also liked prostitutes.  He kept his favorites' names and numbers in his Little Black Book.Detailed chronicle of Madoff's conversations and movement inside and outside the office in the days before his arrest.  Contains incriminating connections between Madoff and certain members of the SEC.Cooperation of childhood friends and neighbors has enabled Ross to write a compelling portrait of Bernie and Ruth in their early years.",
        "Category": " Biography & Autobiography , Criminals & Outlaws",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Postcard Killers",
        "Authors": "By Marklund, Liza and Patterson, James",
        "Description": "Paris is stunning in the summerNYPD detective Jacob Kanon is on a tour of Europe's most gorgeous cities. But the sights aren't what draw him--he sees each museum, each cathedral, and each cafe through the eyes of his daughter's killer.The killing is simply marvelousKanon's daughter, Kimmy, and her boyfriend were murdered while on vacation in Rome. Since then, young couples in Paris, Copenhagen, Frankfurt, and Stockholm have been found dead. Little connects the murders, other than a postcard to the local newspaper that precedes each new victim. Wish you were hereNow Kanon teams up with the Swedish reporter, Dessie Larsson, who has just received a postcard in Stockholm--and they think they know where the next victims will be. With relentless logic and unstoppable action, The Postcard Killers may be James Patterson's most vivid and compelling thriller yet.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Mary of Nazareth",
        "Authors": "By Howell, Kenneth",
        "Description": "",
        "Category": "",
        "Publisher": "Queenship Publishing Company",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Psychology, Fifth Edition",
        "Authors": "By Hockenbury, Don H. and Hockenbury, Sandra E.",
        "Description": "More than any other psychology textbook, Don and Sandra Hockenbury’s Psychology relates the science of psychology to the lives of the wide range of students taking the introductory course. Now Psychology returns in a remarkable new edition that shows just how well-attuned the Hockenburys are to the needs of today’s students and instructors. Psychology began with a basic idea: combine scientific authority with a narrative that engages students and relates to their lives. From decades of experience teaching, the Hockenburys created a book filled with cutting-edge science and real-life stories that draw students of all kinds into the course.",
        "Category": " Psychology , General",
        "Publisher": "Worth Publishers",
        "Price Starting With ($)": "6.22",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Mosaicos: Spanish as a World Language, 5th Edition",
        "Authors": "By Lapuerta, Paloma, Castells, Matilde Olivella De, Guzman, Elizabeth E., and Liskin-Gasparro, Judith E.",
        "Description": "The 5th edition of Mosaicos: Spanish as a World Languageprovides a fresh, 2lst-century perspective on language teaching and learning in the context of a dynamic introduction to the Hispanic world and its people. Rich contextualization of vocabulary combined with contextualized, functional grammatical instruction gives students an authentic, communicative introduction to the Spanish language. Deeply integrated culture and detailed listening, speaking, reading and writing practice bring all the pieces together for today’s students.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Red Queen: A Novel (The Plantagenet and Tudor Novels)",
        "Authors": "By Gregory, Philippa",
        "Description": "The inspiration for the critically acclaimed Starz miniseries The White Queen, #1 New York Times bestselling author Philippa Gregory brings to life Margaret Beaufort, heiress to the red rose of Lancaster, who charts her way through treacherous alliances to take control of the English throne.Margaret Beaufort never surrenders her belief that her Lancaster house is the true ruler of England, and that she has a great destiny before her. Married to a man twice her age, quickly widowed, and a mother at only fourteen, Margaret is determined to turn her lonely life into a triumph. She sets her heart on putting her son on the throne of England regardless of the cost to herself, to England, and even to the little boy. Disregarding rival heirs and the overwhelming power of the York dynasty, she names him Henry, like the king; sends him into exile; and pledges him in marriage to her enemy Elizabeth of York’s daughter. As the political tides constantly move and shift, Margaret masterminds one of the greatest rebellions of all time—all the while knowing that her son has grown to manhood, recruited an army, and awaits his opportunity to win the greatest prize in all of England.  The Red Queen is a novel of conspiracy, passion, and coldhearted ambition, the story of a proud and determined woman who believes that she alone is destined, by her piety and lineage, to shape the course of history.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "14.25",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Angelina: An Unauthorized Biography",
        "Authors": "By Morton, Andrew",
        "Description": "\"I like to collect knives,\" says Angelina Jolie, \"but I also collect first edition books.\" At first glance, she might seem to be someone without any secrets, talking openly about her love life, sexual preferences, drug use, cutting, and tattoos--and why she kissed her brother on the lips in public. And yet mysteries remain: What was really going on in her brief, impulsive marriages to Jonny Lee Miller and Billy Bob Thornton, and whatis going on in her partnership with Brad Pitt? What's behind the oft-reported feud with her father, the Oscar-winning actor Jon Voight? What drove her to become a mother of six children in six years? And--perhaps most puzzling of all--what about the other side of Angelina: How did this talented but troubled young actress, barely 35 years old, become a respected Goodwill Ambassador for the United Nations as well as the \"most powerful celebrity in the world\" (unseating Oprah Winfrey) onForbes' 2009 Celebrity 100 list? The answers that Andrew Morton has uncovered are astonishing, taking us deep inside Angelina's world to show us what shaped her as a child, as an actress, and as a woman struggling to overcome personal demons that have never before been revealed. In this spellbinding biography, Andrew Morton draws upon far-reaching original interviews and research, accompanied by exclusive private photographs, to show us the true story behind both the wild excesses of Angelina's youth and her remarkable work with children and victims of poverty and disaster today.",
        "Category": " Biography & Autobiography , Rich & Famous",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "The Glass Rainbow: A Dave Robicheaux Novel",
        "Authors": "By Burke, James Lee",
        "Description": "James Lee Burke’s eagerly awaited new novel finds Detective Dave Robicheaux back in New Iberia, Louisiana, and embroiled in the most harrowing and dangerous case of his career. Seven young women in neighboring Jefferson Davis Parish have been brutally murdered. While the crimes have all the telltale signs of a serial killer, the death of Bernadette Latiolais, a high school honor student, doesn’t fit: she is not the kind of hapless and marginalized victim psychopaths usually prey upon. Robicheaux and his best friend, Clete Purcel, confront Herman Stanga, a notorious pimp and crack dealer whom both men despise. When Stanga turns up dead shortly after a fierce beating by Purcel, in front of numerous witnesses, the case takes a nasty turn, and Clete’s career and life are hanging by threads over the abyss. Adding to Robicheaux’s troubles is the matter of his daughter, Alafair, on leave from Stanford Law to put the finishing touches on her novel. Her literary pursuit has led her into the arms of Kermit Abelard, celebrated novelist and scion of a once prominent Louisiana family whose fortunes are slowly sinking into the corruption of Louisiana’s subculture. Abelard’s association with bestselling ex-convict author Robert Weingart, a man who uses and discards people like Kleenex, causes Robicheaux to fear that Alafair might be destroyed by the man she loves. As his daughter seems to drift away from him, he wonders if he has become a victim of his own paranoia. But as usual, Robicheaux’s instincts are proven correct and he finds himself dealing with a level of evil that is greater than any enemy he has confronted in the past. Set against the backdrop of an Edenic paradise threatened by pernicious forces, James Lee Burke’s The Glass Rainbow is already being hailed as perhaps the best novel in the Robicheaux series.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "The Enjoyment of Music (Essential Listening Edition)",
        "Authors": "By Forney, Kristine",
        "Description": "The Essential Listening Edition connects students with the music, providing them with the strongest and most affordable media and listening packages available in music appreciation, all designed to help them build listening skills and understand the essentials of music history.",
        "Category": " Music , Instruction & Study , Appreciation",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "American Government: Power and Purpose (Brief Eleventh Edition)",
        "Authors": "By Ginsberg, Benjamin, Lowi, Theodore J., Shepsle, Kenneth A., and Ansolabehere, Stephen",
        "Description": "In this major revision, new coauthor Stephen Ansolabehere sharpens the contemporary analytical perspective in the political behavior chapters, and a new primer on “Analyzing the Evidence” in Chapter 1 sets the stage for sections in every chapter that highlight the political science behind the findings reported in the text. Throughout the book, the authors have brought in recent examples and data.",
        "Category": " Political Science , American Government , National",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Lacuna: A Novel (P.S.)",
        "Authors": "By Kingsolver, Barbara",
        "Description": "New York Times BestsellerNational Bestseller: Washington Post, Boston Globe, Los Angeles Times, Wall Street Journal, USA Today, San Francisco Chronicle (#1), Chicago Tribune (#1), Denver Post (#1), Minneapolis Star-Tribune (#1), Publishers WeeklyIndie Next Bestseller (#1)Best Book of the Year: New York Times Notable, Chicago Tribune, San Francisco Chronicle, Seattle Times, Kansas City StarPrize-winning Author: National Humanities Medal, Pulitzer Prize Finalist, Orange Prize for Fiction, Dayton Literary Peace Prize (Richard C. Holbrooke Distinguished Achievement Award)In The Lacuna, her first novel in nine years, Barbara Kingsolver, the acclaimed New York Times bestselling author of The Poisonwood Bible and Animal, Vegetable, Miracle: A Year of Food Life, tells the story of Harrison William Shepherd, a man caught between two worlds—an unforgettable protagonist whose search for identity will take readers to the heart of the twentieth century’s most tumultuous events.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Landmark: The Inside Story of America’s New Health-Care Law-The Affordable Care Act-and What It Means for Us All (Publicaffairs Reports)",
        "Authors": "By Washington Post (COR)",
        "Description": "The Washington Post’s must-read guide to the health care overhaul What now? Despite the rancorous, divisive, year-long debate in Washington, many Americans still don’t understand what the historic overhaul of the health care system will—or won’t—mean. In Landmark, the national reporting staff of The Washington Post pierces through the confusion, examining the new law’s likely impact on us all: our families, doctors, hospitals, health care providers, insurers, and other parts of a health care system that has grown to occupy one-sixth of the U.S. economy.Landmark’s behind-the-scenes narrative reveals how just how close the law came to defeat, as well as the compromises and deals that President Obama and his Democratic majority in Congress made in achieving what has eluded their predecessors for the past seventy-five years: A legislative package that expands and transforms American health care coverage.Landmark is an invaluable resource for anyone eager to understand the changes coming our way.",
        "Category": " Political Science , Public Policy , Social Policy",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Exercise Physiology: Theory and Application to Fitness and Performance",
        "Authors": "By Powers, Scott K. and Howley, Edward T.",
        "Description": "\"Written especially for exercise science and physical education students, this text provides a solid foundation in theory illuminated by application and performance models to increase understanding and to help students apply what they've learned in the classroom and beyond. \"--",
        "Category": " Education , Physical Education",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "GIS Fundamentals: A First Text on Geographic Information Systems, 3rd edition",
        "Authors": "By Bolstad, Paul",
        "Description": "",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Eider Pr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Advertising and Integrated Brand Promotion",
        "Authors": "By O'Guinn, Thomas C., Allen, Chris T., and Semenik, Richard J.",
        "Description": "Powerful and practical, current and cutting-edge, ADVERTISING AND INTEGRATED BRAND PROMOTION, 5e captures the thrill of advertising with its integrated learning experience, solid theory, real-world examples, and coverage of emerging trends.",
        "Category": " Business & Economics , Advertising & Promotion",
        "Publisher": "South-Western College Pub",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Live to Tell: A Detective D. D. Warren Novel",
        "Authors": "By Gardner, Lisa",
        "Description": "He knows everything about you—including the first place you’ll hide. On a warm summer night in one of Boston’s working-class neighborhoods, an unthinkable crime has been committed: Four members of a family have been brutally murdered. The father—and possible suspect—now lies clinging to life in the ICU. Murder-suicide? Or something worse? Veteran police detective D. D. Warren is certain of only one thing: There’s more to this case than meets the eye.Danielle Burton is a survivor, a dedicated nurse whose passion is to help children at a locked-down pediatric psych ward. But she remains haunted by a family tragedy that shattered her life nearly twenty-five years ago. The dark anniversary is approaching, and when D. D. Warren and her partner show up at the facility, Danielle immediately realizes: It has started again.A devoted mother, Victoria Oliver has a hard time remembering what normalcy is like. But she will do anything to ensure that her troubled son has some semblance of a childhood. She will love him no matter what. Nurture him. Keep him safe. Protect him. Even when the threat comes from within her own house. In New York Times bestselling author Lisa Gardner’s most compelling work of suspense to date, the lives of these three women unfold and connect in unexpected ways, as sins from the past emerge—and stunning secrets reveal just how tightly blood ties can bind. Sometimes the most devastating crimes are the ones closest to home.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Wiley/National Geographic College Atlas of the World",
        "Authors": "By De Blij, Harm J. (EDT) and Downs, Roger (EDT)",
        "Description": "* 90 pages of stunning world thematic maps cover the vital natural and human topics of today.* Striking satellite images open each continent.* Oceans are mapped from coast to coast, revealing incredible illustrations of depth and seafloor topography.* Each continent receives special economic coverage assessing regional and global activity.* A place-name index includes 55,000 entries.* Extensive \"World Facts\" section comprises demographic and socioeconomic information, geographic comparisons, and a glossary.",
        "Category": " Social Science , Human Geography",
        "Publisher": "Wiley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "America: A Concise History, Volume 1: To 1877",
        "Authors": "By Henretta, James A. and Brody, David",
        "Description": "Brief and affordable, yet careful not to sacrifice elements vital to student learning, America gives students and instructors everything they want — and nothing they don’t. The authors’ own abridgement preserves the hallmark explanatory power of the parent text, helping students to understand not only what happened but why — so they’re never left wondering what’s important. A unique seven-part narrative structure highlights the crucial turning points in American history and explores the dynamic forces shaping each period, facilitating students’ understanding of continuity and change. The narrative is enriched and reinforced by vibrant full-color art and carefully crafted maps, which provide invaluable tools for student comprehension and enrichment. Two primary-source features in every chapter ensure that students understand historical events as they were viewed nationally and internationally. The result is a brief book that, in addition to being an excellent price, is an excellent value.",
        "Category": " History , United States , General",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Essential Readings in Comparative Politics",
        "Authors": "By O'Neil, Patrick H. (EDT) and Rogowski, Ronald (EDT)",
        "Description": "Essential Readings in Comparative Politics, Third Edition, is the most affordable reader that combines classic theoretical works, contemporary scholarship, and serious journalistic pieces for undergraduate comparative politics courses. Designed to complement the text, the reader’s chapters are organized thematically around major topics. The third edition includes 40% new readings.",
        "Category": " Political Science , Comparative Politics",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Cases in Comparative Politics",
        "Authors": "By O'Neil, Patrick H., Share, Don., and Fields, Karl",
        "Description": "Cases in Comparative Politics, Third Edition, is a set of thirteen country studies that describe politics in the United Kingdom, the United States, France, Germany, Japan, Russia, China, India, Iran, Brazil, Mexico, South Africa, and Nigeria. This casebook applies the conceptual framework developed in the text across countries with a consistent organization that facilitates comparison and aids understanding.",
        "Category": " Political Science , Comparative Politics",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "6.32",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "A Topical Approach to Lifespan Development",
        "Authors": "By Santrock, John W.",
        "Description": "This accessible, visually appealing undergraduate text offers color photos in a color layout. While most textbooks on life-span development are organized chronologically, this one is organized topically, with sections on the life-span perspective, biological processes and physical development, cognitive processes, socioemotional development, social contexts of development, and death, dying, and grieving. The three main themes are research, applications, and contexts, with sections on each within each chapter. Each chapter begins with a map of main ideas and learning goals, and includes profiles of real professionals, boxes on research and diversity, review and reflection questions, and key terms and people. A companion web site contains research material for case exercises, plus video clips, self-inventories, and other exercises. For this fifth edition, much material has been rewritten and edited for clarity, and there is new and expanded material on numerous areas, such as criticisms of evolutionary psychology, the heredity/environment interaction, and neuroscience insights on intelligence. Santrock is affiliated with the University of Texas-Dallas. Annotation ©2010 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Psychology , Developmental , Lifespan Development",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "7.84",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Data Analysis and Decision Making with Microsoft Excel: Includes Microsoft Office Excel 2007 Applications, Revised 3rd Edition",
        "Authors": "By Winston, Wayne L., Albright, S. Christian, and Zappe, Christopher",
        "Description": "Master data analysis, modeling, and spreadsheet use with DATA ANALYSIS AND DECISION MAKING WITH MICROSOFT EXCEL! With a teach-by-example approach, student-friendly writing style, and complete Excel integration, this quantitative methods text provides you with the tools you need to succeed. Margin notes, boxed-in definitions and formulas in the text, enhanced explanations in the text itself, and stated objectives for the examples found throughout the text make studying easy. Problem sets and cases provide realistic examples that enable you to see the relevance of the material to your future as a business leader. The CD-ROMs packaged with every new book include the following add-ins: the Palisade Decision Tools Suite (@RISK, StatTools, PrecisionTree, TopRank, and RISKOptimizer); and SolverTable, which allows you to do sensitivity analysis. All of these add-ins have been revised for Excel 2007.",
        "Category": " Business & Economics , Management Science",
        "Publisher": "South-Western College Pub",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Washington Rules: America's Path to Permanent War (American Empire Project)",
        "Authors": "By Bacevich, Andrew J.",
        "Description": "The bestselling author of The Limits of Power critically examines the Washington consensus on national security and why it must changeFor the last half century, as administrations have come and gone, the fundamental assumptions about America's military policy have remained unchanged: American security requires the United States (and us alone) to maintain a permanent armed presence around the globe, to prepare our forces for military operations in far-flung regions, and to be ready to intervene anywhere at any time. In the Obama era, just as in the Bush years, these beliefs remain unquestioned gospel.In a vivid, incisive analysis, Andrew J. Bacevich succinctly presents the origins of this consensus, forged at a moment when American power was at its height. He exposes the preconceptions, biases, and habits that underlie our pervasive faith in military might, especially the notion that overwhelming superiority will oblige others to accommodate America's needs and desires—whether for cheap oil, cheap credit, or cheap consumer goods. And he challenges the usefulness of our militarism as it has become both unaffordable and increasingly dangerous.Though our politicians deny it, American global might is faltering. This is the moment, Bacevich argues, to reconsider the principles which shape American policy in the world—to acknowledge that fixing Afghanistan should not take precedence over fixing Detroit. Replacing this Washington consensus is crucial to America's future, and may yet offer the key to the country's salvation.",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "Metropolitan Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "The Carb Lovers Diet: Eat What You Love, Get Slim for Life!",
        "Authors": "By Kunes, Ellen, Largeman-roth, Frances, and Health Magazine (COR)",
        "Description": "The editors of Health Magazine (and top nutrition scientists) have big news: Eating carbs is the best way to get and stay slim. Breakthrough research revealed in this book shows how certain carb-rich foods-especially those with the amazing natural ingredient called Resistant Starch-act as powerful metabolism boosters and appetite suppressants. Rather than making you fat and bloated, as decades of low-carb diet gurus claimed, CARBS make you thin. They shrink fat cells, especially in your belly; boost fat burning; increase muscle mass; curb cravings; keep you feeling full longer than other foods; control blood sugar, and lower cholesterol and triglycerides! Health Magazine, the expert when it comes to healthy living, takes this revolutionary new science and turns it into an easy-to-follow, real women-tested, dietitian-approved road map proven to melt off 10, 35, even 100 plus pounds forever. Our test kitchen chefs and registered dietitians also developed 85 delicious, simple recipes and foolproof meal plans that help you lose weight while you enjoy the foods you've craved for years.  Phase 1 of The CarbLovers Diet eases you back into a world of yummy, satisfying meals and snacks, while dropping weight-especially belly fat-fast and permanently. Phase 2 is nothing short of life-changing: Dieters savor generous portions of their favorite foods (think steak and potato dinners, French toast for breakfast, sandwiches dripping with cheese, chocolate torte for dessert)-while their clothes get loose, their skin glows, their energy soars! Bottom line: CarbLovers shows you how to eat your favorite carb-filled foods-and helps you get thinner and happier than you ever imagined. We've included fun-to-follow eating rules, tricks and tips, grocery lists, and  amazing recipes anyone can make, enjoy, and share with others. Don't feel like cooking? No problem. We've got hundreds of quick bites, frozen foods and restaurant menu items too. Get ready to feel satisfied, happy, and oh-so-slim. Get ready for your fabulous new life as a CarbLover!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "TI Inc. Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "The Mentor Leader: Secrets to Building People and Teams That Win Consistently",
        "Authors": "By Dungy, Tony and Whitaker, Nathan (CON)",
        "Description": "“Your only job is to help your players be better.” That single idea had a huge impact on Tony Dungy when he heard it from one of his earliest mentors, and it led him to develop the successful leadership style so admired by players and coaches throughout the NFL. Now, a storied career and a Super Bowl victory later, Tony Dungy is sharing his unique leadership philosophy with you. In The Mentor Leader, Tony reveals what propelled him to the top of his profession and shows how you can apply the same approach to virtually any area of your life. In the process, you’ll learn the seven keys of mentoring leadership—and why they’re so effective; why mentor leadership brings out the best in people; how a mentor leader recovers from mistakes and handles team discipline; and the secret to getting people to follow you and do their best for you without intimidation tactics. As a son, a football player, and a winning coach, Tony has always learned from others on his path to success. Now you can learn to succeed for your team, family, or organization while living out your values—by becoming a mentor leader.",
        "Category": " Religion , Christian Living , Personal Growth",
        "Publisher": "Tyndale Momentum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Animal Physiology, Second Edition",
        "Authors": "By Hill, Richard W., Wyse, Gordon A., and Anderson, Margaret",
        "Description": "Now in its second edition, this large and generous textbook discusses animal physiology, from cell biology and genomics to reproductive and digestive systems. Hill (Michigan State U.), Wyse (U. of Massachusetts, Amherst) and Anderson (Smith College) have improved the first edition by rereading every sentence and scrutinizing every graphic, improving readability for biology and anatomy students, as well as those working in the veterinarian sciences. Oversize: 9.5x11.25\". Annotation ©2008 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Science , Life Sciences , General",
        "Publisher": "Sinauer Associates, Inc.",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Guide to the Code of Ethics for Nurses: Interpretation and Application (American Nurses Association)",
        "Authors": "By Fowler, Marsha D.M., Ph.D. (EDT)",
        "Description": "",
        "Category": " Medical , Nursing , Fundamentals & Skills",
        "Publisher": "American Nurses Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Staffing Organizations",
        "Authors": "By Judge, Timothy A. and Heneman, Herbert G., III",
        "Description": "Heneman and Judge’s Staffing Organizations, 6/e, is based on a comprehensive staffing model. Components of the model include staffing models and strategy, staffing support systems (legal compliance, planning, job analysis and rewards), core staffing systems (recruitment, selection, employment), and staffing system and retention management. Up-to-date research and business practices are the hallmarks of this market leading text. In-depth applications (cases and exercises) at the end of chapters provide students with skill-building and practice in key staffing activities and decision-making. A comprehensive running case involving a fictitious retailing organization provides even greater opportunity for in-depth analysis and skill building. Students also have the opportunity to address ethical issues at the end of each chapter.",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "McGraw-Hill/Irwin",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "The Economics of Money, Banking, and Financial Markets: Business School Edition",
        "Authors": "By Mishkin, Frederic S.",
        "Description": "The Economics of Money, Banking, and Financial Markets set the standard for money and banking courses when it published in its first edition, and it continues to be the worldwide market leader. The historic economic events and financial crises of late 2008 have changed the entire landscape of money and banking. Having just served as Governor of the Federal Reserve, only Mishkin has the unique insider's perspective needed to present the current state of money and banking and explain the latest debates and issues for today’s readers. For professors who teach with less emphasis on monetary theory and prefer to focus more time on financial institutions, the Business School Edition is the ideal alternative.    Introduction: Why Study Money, Banking, and Financial Markets?; An Overview of the Financial System; What Is Money? Financial Markets: Understanding Interest Rates; The Behavior of Interest Rates; The Risk and Term Structure of Interest Rates; The Stock Market, the Theory of Rational Expectations, and the Efficient Market Hypothesis. Financial Institutions: An Economic Analysis of Financial Structure; Financial Crises and the Subprime Debacle; Banking and the Management of Financial Institutions; Economic Analysis of Financial Regulation; Banking Industry: Structure and Competition; Nonbank Finance; Financial Derivatives; Conflicts of Interest in the Financial Industry. Central Banking and the Conduct of Monetary Policy: Structure of Central Banks and the Federal Reserve System; The Money Supply Process; Tools of Monetary Policy; What Should Central Banks Do? Monetary Policy Goals, Strategy, and Tactics. International Finance and Monetary Policy: The Foreign Exchange Market; The International Financial System. Monetary Policy: The Demand for Money; Aggregate Demand and Supply Analysis; Transmission Mechanisms of Monetary Policy: The Evidence; Money and Inflation.    For all readers interested in money, banking, and financial markets.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "6.81",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Community Health Nursing, Promoting and Protecting the Public's Health (Community Health Nursing (Allender))",
        "Authors": "By Allender, Judith Ann, Rector, Cherie, Ph.D., and Warner, Kristine D., Ph.D.",
        "Description": "Now in its Seventh Edition, this comprehensive text provides unique coverage of vulnerable aggregate populations while using the levels of prevention approach. The book focuses on public health concerns including health promotion and protection, provides strong nursing application coverage, and addresses timely issues such as disaster nursing, urban clients, and clients with disabilities/chronic illness. This edition retains popular features such as \"Stop and Think\" boxes, levels of prevention displays, and Using the Nursing Process and includes new features such as Evidence: The Bridge to Practice, Healthy People 2020, Student Voices, and appendices of communicable diseases.",
        "Category": " Medical , Nursing , Home & Community Care",
        "Publisher": "Lippincott Williams & Wilkins",
        "Price Starting With ($)": "7.85",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "International Management: Culture, Strategy, and Behavior",
        "Authors": "By Luthans, Fred and Doh, Jonathan P.",
        "Description": "Changes in the global business environment continue at an accelerated pace. The challenges for international management reflect this dynamism and the increasing unpredictability of global economic and political events. The challenge in today’s uncertain geopolitical and economic environment is to learn and effectively practice international management. Past assumptions must always be tested and challenged, and best practices will continuously evolve in response to changing environmental and competitive conditions. Those with the knowledge and skills to apply the contents of this text on international management will be taking a huge step toward gaining a competitive advantage over those who do not have such a perspective. They will be in a strong position to gain a broad understanding and to take specific steps for implementation of effective managing across cultures.In the seventh edition of International Management, Luthans and Doh have taken care to retain the effective foundation gained from research and practice over the past decades. At the same time, they have fully incorporated important new and emerging developments that have changed what international managers are currently facing and likely to face in the coming years. Of special importance is that students of international management understand what will be expected of them from the range of stakeholders with whom they interact.",
        "Category": " Business & Economics , International , General",
        "Publisher": "McGraw-Hill/Irwin",
        "Price Starting With ($)": "11.04",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Inside Terrorism (Columbia Studies in Terrorism and Irregular Warfare)",
        "Authors": "By Hoffman, Bruce",
        "Description": "Bruce Hoffman's Inside Terrorism has remained a seminal work for understanding the historical evolution of terrorism and the terrorist mindset. In this revised edition of the classic text, Hoffman analyzes the new adversaries, motivations, and tactics of global terrorism that have emerged in recent years, focusing specifically on how al Qaeda has changed since 9/11; the reasons behind its resiliency, resonance, and longevity; and its successful use of the Internet and videotapes to build public support and gain new recruits. Hoffman broadens the discussion by evaluating the potential repercussions of the Iraqi insurgency, the use of suicide bombers, terrorist exploitation of new communications media, and the likelihood of a chemical, biological, radiological, or nuclear terrorist strike.Closer to home, Hoffman reconsiders the Timothy McVeigh case and the threats posed by American Christian white supremacists and abortion opponents as well as those posed by militant environmentalists and animal rights activists. He argues that the attacks on the World Trade Center fundamentally transformed the West's view of the terrorist threat. More relevant and necessary than ever, Inside Terrorism continues to be the definitive work on the history and future of global terrorism.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "My Freshman Year: What a Professor Learned by Becoming a Student",
        "Authors": "By Nathan, Rebekah",
        "Description": "After fifteen years of teaching anthropology at a large university, Rebekah Nathan had become baffled by her own students. Their strange behavior—eating meals at their desks, not completing reading assignments, remaining silent through class discussions—made her feel as if she were dealing with a completely foreign culture. So Nathan decided to do what anthropologists do when confused by a different culture: Go live with them. She enrolled as a freshman, moved into the dorm, ate in the dining hall, and took a full load of courses. And she came to understand that being a student is a pretty difficult job, too. Her discoveries about contemporary undergraduate culture are surprising and her observations are invaluable, making My Freshman Year essential reading for students, parents, faculty, and anyone interested in educational policy.",
        "Category": " Education , Student Life & Student Affairs",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Toward Healthy Aging: Human Needs and Nursing Response (Toward Healthy Aging (Ebersole))",
        "Authors": "By Ebersole, Priscilla, Hess, Patricia, Touhy, Theris A., Jett, Kathleen, Ph.D., and Luggen, Ann Schmidt",
        "Description": "As the most comprehensive resource on health promotion and maintenance for older adults and their families and caregivers, Toward Healthy Aging, 7th Edition includes the most current information you need to provide effective holistic care, promote healthy lifestyle choices, and address end-of-life issues. Grounded in the core competencies recommended by the AACN in collaboration with the Hartfound Institute for Geriatric Nursing and using Maslow's hierarchy of needs, this book includes complete coverage of both common and uncommon conditions in the older adult. Towards Healthy Aging also highlights key aging issues with sections devoted to basic physiologic needs, safety and security, the need to belong, self-esteem, and self-actualization.A strong focus on health and wellness emphasizes a positive approach to aging.Disease processes are discussed in the context of healthy adaptation, nursing support, and responsibilities.Careful attention to age, cultural, and gender differences are integrated throughout to help you remember these important considerations when caring for older adults.Up-to-date content on AIDS provides important information on addressing this growing concern among older adults.Consistent chapter is organization with objectives, case studies, critical thinking questions, research, and study questions make information easy to find and use.Assessment guidelines are incorporated throughout in helpful tables, boxes, and forms for quick access.Case studies at the end of most chapters explore realistic patient care scenarios to help you expand your knowledge and understanding.Resource lists and appendices provide opportunities for further research and study.With over 200 illustrations, the full-color design is engaging and easy to read.Healthy People 2010 boxes address healthy aging considerations.Evidence-Based Practice boxes help you incorporate the latest research findings into practice and advise you on how to avoid potentially harmful practices.A Nutritional Needs chapter includes the most current nutritional guidelines for older adults to help you better address patients' nutritional needs.Includes the latest scales and guidelines for assessing the gerontologic patient in the Health Assessment in Gerontological Nursing chapter.Expanded coverage of end-of-life issues helps you meet the needs of older adults and their families and caregivers during this difficult transition.Economics of aging discussions help you better understand the financial challenges your patients may face.The latest pharmacologic and nonpharmacologic pain management information helps you reduce pain and discomfort for your patients and helps you provide more effective care.",
        "Category": " Medical , Nursing , Gerontology",
        "Publisher": "Mosby",
        "Price Starting With ($)": "7.18",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Accounting Information Systems: Controls and Processes",
        "Authors": "By Turner, Leslie and Weickgenannt, Andrea",
        "Description": "Master the technological tools of today's accounting professionIn your grandfather's day, the ledger book was the accountant's bible. Today, technology is king. From simple programs such as UBS and MYOB to complex enterprise-level systems, accounting systems play a critical function in maintaining accounting data and administering internal controls in any organization. Any aspiring accountant must fully grasp how information systems work, what their capabilities are, and their incorporation into a company's business processes and internal controls.Stressing simplicity and accessibility while avoiding confusing jargon, Accounting Information Systems: The Processes and Control introduces you in simple and clear language to the technology utilized by accountants. Using simple process maps, document flowcharts, and data flow diagrams, this comprehensive yet easily comprehended book defines business processes and explains the foundational concepts of accounting information systems (AIS). It goes on to give you a solid understanding of:* The proper control environment for overseeing and controlling processes* Ethics and fraud prevention, corporate and IT governance, and auditing procedures, including the COSO framework and the Trust Principles* Business processes--from revenue and cash collection to expenditure and administrative--and the internal controls in organizations* The hardware, software, and systems that support the business processesOffering real-world examples, helpful screen captures, exercises, and other features designed to enhance your mastery of the material, this book prepares you for working with the accounting information systems that are so essential to the profession today.",
        "Category": " Business & Economics , Information Management",
        "Publisher": "Wiley",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "A Pocket Style Manual, Fifth Edition",
        "Authors": "By Hacker, Diana, Sommers, Nancy, Jehn, Tom, and Rosenzweig, Jane",
        "Description": "Click here to find out more about the 2009 MLA Updates and the 2010 APA Updates. The first of its kind, A Pocket Style Manual continues to help student writers get answers to their writing and research questions. Its concise and straightforward content is flexible enough to suit the needs of writers in the humanities, social sciences, sciences, health professions, business courses, fine arts, teacher training courses, and beyond. Its slim format, brief length, and spiral binding make it a portable and practical tool. With its signature Diana Hacker quick-reference features, A Pocket Style Manual has always provided quick solutions to writing problems. Supplemented by the best free and open Web resources, A Pocket Style Manual offers the best value for students.In the Hacker tradition, the new contributing authors — Nancy Sommers, Tom Jehn, Jane Rosenzweig, and Marcy Carbajal Van Horn — have crafted solutions for the challenges today’s college students face. Together they give us a new edition that provides more help with research writing and one that works better for a wider range of students.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "American Government and Politics Today 2009-2010 Edition (American Government & Politics Today)",
        "Authors": "By Schmidt, Steffen W., Bardes, Barbara A., and Shelley, Mack C.",
        "Description": "Students are often hesitant to become involved in the political process, but American Government and Politics Today 2009-2010 Edition, 14e inspires readers to take action. The book uses intriguing examples and hands-on exercises to engage readers in the fascinating intricacies of American government -- including details from the recent presidential election. As it introduces concepts, it illustrates that active participation can be as simple as calling a local politician to share an opinion, registering to vote, or viewing a town council meeting on local access cable -- demonstrating how small steps can make a big difference.",
        "Category": " Political Science , American Government , National",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "7.23",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Public Policy: Politics, Analysis, and Alternatives",
        "Authors": "By Kraft, Michael E. and Furlong, Scott R.",
        "Description": "Click here to preview chapter 1.Professors: Order your exam copy today by clicking on the \"Request an Exam Copy\" link above.Public policy textbooks need to give students a thorough explanation of the policy process, but why do so many relegate policy analysis to a single, final chapter—or not cover it at all? In the third edition of their innovative text, Kraft and Furlong take a decidedly different tack. They introduce and integrate an evaluative approach to policy throughout their text, encouraging critical and creative thinking on issues ranging from economic policy and the financial bailout to homeland security and natural disasters.Public Policy starts with the basics and concisely reviews institutions, policy actors, and major theoretical models. The authors then discuss the nature of policy analysis and its practice, and show students how to employ evaluative criteria in six substantive policy areas. At its core, Public Policy guides students through policy alternatives, arming them with analytic tools for understanding how the motivations of policy actors—both within and outside of government—influence a complex, yet comprehensible, policy agenda. Professors will appreciate its authoritative, balanced approach, and its accessibility will engage students and keep them reading.Important features for enhanced readability include: Working with Sources and Steps to Analysis feature boxes that help students apply evaluative criteria; Policy scenario chapter openers;End-of-chapter discussion questions, suggested readings and websites, and keyword lists; A wealth of tables, figures, charts, and photos; and A helpful keyword glossary in the appendix.In addition to updating throughout all chapters to account for recent events, issues, and policy debates through the end of the Bush presidency, the third edition includes expanded and new coverage of: the mortgage crisis, financial bailout, and ensuing recession;the wars in Afghanistan and Iraq; the use of private contractors for military support and operations; homeland security and its implications for civil liberties; national energy policy and high gasoline prices, including proposals for increased offshore drilling;climate change issues and politics; the government’s capacity to handle natural disasters, such as Hurricanes Katrina, Gustav, and Ike; andimmigration controversies, including construction of fencing along the U.S.-Mexican border.",
        "Category": " Political Science , Public Affairs & Administration",
        "Publisher": "CQ Press",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "First Aid/CPR?AED for the Workplace: Participant's Workbook",
        "Authors": "By Staywell",
        "Description": "",
        "Category": "",
        "Publisher": "StayWell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Norton Field Guide to Writing with Handbook (Second Edition with 2009 MLA Updates)",
        "Authors": "By Weinberg, Francine and Bullock, Richard",
        "Description": "Easy to use, flexible, and a great value. With just enough detail – and color-coded links that send students to more detail if they need it – this is the rhetoric that tells students what they need to know and resists the temptation to tell them everything there is to know. The first rhetoric designed for easy reference—with menus, directories, and a glossary/index that make it easy to use.The Norton Field Guide to Writing with Handbook is 2 books in one—the rhetoric is up front, providing the guidance students need on writing and research; the handbook is in the back, helping them edit what they write.",
        "Category": " Language Arts & Disciplines , Rhetoric",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Kaleidoskop (Textbook only) (English and German Edition)",
        "Authors": "By Moeller, Jack",
        "Description": "Kaleidoskop is essentially two books in one: a cultural and literary reader with a comprehensive review of grammar. This combination allows maximum flexibility for instructors to design their own programs. The 10 topics of the Lektüre section contain a variety of texts and activities, and the 10 Kapitel of the self-contained grammar section (Grammatik) allow instructors to work with the grammar topics in whatever order they choose; the grammar chapters may be treated independently of the reading chapters or used concurrently with the Themen of the same number. Given these materials the instructor can provide a learner-centered classroom with activities that lend themselves to cooperative learning.Kaleidoskop features a flexible four-skills, learner-centered approach that promotes communication and focuses on the literature and culture of the German-speaking world. Reading plays an important role in this text, with exercises for listening, speaking and writing revolving around the wide range of authentic reading selections. These texts are authentic and include advertisements, charts, newspaper and magazine articles, letters, e-mails, forum mails, polls, interviews, biographies, songs, poems, and fiction.",
        "Category": " Foreign Language Study , German",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Writers Dreaming",
        "Authors": "By Epel, Naomi",
        "Description": "On a spring morning in the early seventies, William Styron woke to the resonant, lingering image of a woman he had known before. She was, he recalls, \"entering the hallway of this humble boarding house in Flatbush with a book under her arm, looking very beautiful in the middle of summer with a sort of summer dress on and her arm bared and the tattoo visible. . . . I was seized by this absolute sense of necessity - I had to write the book.\" Styron immediately went to his studio and, abandoning the novel he had been struggling to complete, wrote the opening paragraphs of Sophie's Choice.A remarkable number of talented artists find ideas and inspiration in the intermingling of dreams with their working life. The deep connection between the subconscious and the imagination has allowed these writers to solve problems, rewrite scenes and discover hidden truths in their writing. \"Part of the beauty of dreams,\" explains Allan Gurganus, \"is that they're eternally mysterious. And that's part of their meaning and power for us. They seem to have a kind of wisdom that we don't have in our waking lives.\"In this fascinating book, dream researcher and radio-show host Naomi Epel has compiled hours of interviews with twenty-six well-known writers to offer a behind-the-scenes look at the workings of the imagination. In their own words, they discuss the dreams that have had a powerful effect on their work and their lives, revealing in the process their philosophies, habitual rituals and ways of solving creative problems.Writers Dreaming is a unique anthology of wisdom from some of the most important writers in contemporary literature, allowing us to understand how they summon forth their ideas and fashion them into art. Its frank and revealing narrative provides a rare insight into the wellsprings of creativity.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Business Essentials",
        "Authors": "By Ebert, Ronald J. and Griffin, Ricky W.",
        "Description": "The #1 brief Introduction to Business text.Business Essentials continues to provide a solid foundation of the essential topics that first-semester business students need to understand. Its focus on practical skills, knowledge of the basics, and important developments in business makes for a brief book, but a rich experience.The recent events in domestic and global economies are presenting unprecedented challenges, excitement, and disappointments for business–and a need for a change in the Introduction to Business course and text. The eighth edition captures the widespread significance of these developments and presents their implications on businesses today.",
        "Category": " Business & Economics , General",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Crimes Against Liberty: An Indictment of President Barack Obama",
        "Authors": "By Limbaugh, David",
        "Description": "As Americans, liberty is an inalienable right that is granted to us by God, protected by the Constitution, and upheld by our government. Yet, Barack Obama doesn’t seem to share that view. To him, liberty is a threat to the government’s power and something to be squashed by any means possible, as bestselling author David Limbaugh shows to devastating affect in his new book, Crimes Against Liberty. In Crimes Against Liberty, Limbaugh issues a damning indictment of President Barack Obama for encroaching upon and stripping us of our individual and sovereign rights. Laying out his case like he would a criminal complaint, Limbaugh presents the evidence—count-by-count—against Obama. From exploiting the financial crisis for political gain, to restricting our personal freedoms through invasive healthcare and “green” policies, to endangering America with his feckless diplomacy and reckless dismantlement of our national security systems, Limbaugh proves—beyond a reasonable doubt—that Obama is guilty of crimes against liberty. Comprehensive and compelling, this is Limbaugh’s most powerful book yet.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "The Gebusi: Lives Transformed in a Rainforest World",
        "Authors": "By Knauft, Bruce",
        "Description": "Written specifically for students, this ethnography provides an engaging, real-life account of the transition from a traditional to a modern culture. It uses vibrant personal stories and ethnographic examples to connect developments among the Gebusi of Papua New Guinea to key topics in cultural anthropology, including comparative features of subsistence, kinship, politics, religion, gender, ethnicity, nationalism, and modern development.  In the early 1980s, the Gebusi conducted ritual dances and spirit seances, practiced alternative sexual customs, and endured high rate of violence.  By 1998, most Gebusi had converted to Christianity and were actively engaged in market activity, disco music, sports leagues, and school.  In 2008, however, public services and the cash economy had deteriorated, and people relied increasingly on their traditional customs and practices.This second edition of The Gebusi vividly portrays both the traditions and the modern challenges of Gebusi society and culture with updated content throughout and surprising new conclusions based on the author's return to the Gebusi in 2008.",
        "Category": " Social Science , Anthropology , General",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Mary Cassatt: Paintings (Miniature Masterpieces)",
        "Authors": "By Cassatt, Mary",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Worlds of Music: An Introduction to the Music of the World's Peoples",
        "Authors": "By Titon, Jeff Todd (EDT), Cooley, Timothy J. (CON), Locke, David (CON), McAllester, David P. (CON), and Rasmussen, Anne K. (CON)",
        "Description": "Writings about music in East Asia and Japan.",
        "Category": " Music , Ethnomusicology",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "12.53",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Sensation and Perception (Available Titles CengageNOW)",
        "Authors": "By Goldstein, E. Bruce",
        "Description": "E. Bruce Goldstein's SENSATION AND PERCEPTION, the best-seller which has helped over 150,000 students understand the ties between how we sense the world and how the body interprets these senses, is now in a brilliant full-color Seventh Edition. A key strength of this text has always been the ability to show the student what they are learning through examples and visuals. Now, the book takes this visual learning one step further by using color throughout as a learning tool. As the sole author of the text, Goldstein's singular voice combines with his extensive classroom experience and most innovative research to create a visual text unparalleled in the field. The text walks the student through an intriguing journey of the senses with a mixture of clarity and thoroughness. The accompanying, \"Virtual Lab\" media exercises (available both on CD-ROM, within the Perception PsychologyNowTM student tutorial platform, and in the online WebTutorTM Advantage product) offer a wide array of animations and examples designed to stimulate understanding of difficult concepts. Every chapter has been updated for currency and readability, and a new chapter six on Visual Attention rounds off this timely revision.",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Barron's AP Statistics",
        "Authors": "By Sternstein, Martin",
        "Description": "One Diagnostic and five full-length Advanced Placement Practice Exams are presented in the manual with all questions answered and explained. Equally valuable to prospective test takers is the author’s 15-chapter topic review, covering virtually everything they will encounter on the actual exam. Topics for review are divided into four general themes: Exploratory Analysis, Planning a Study, Probability, and Statistical Inference. Additional multiple-choice and free-response questions with answers are presented at the end of all 15 chapters. Detailed appendices include exam-taking advice, an AP scoring guide, a guide to basic uses of TI-83/TI-84 calculators, and more. This manual may be purchased alone or with an optional CD-ROM containing two additional full-length practice exams, giving students a total of eight practice exams. The free-response questions in all exams have been replaced in this new edition in order to bring practice tests completely up to date and accurately reflect the latest AP Statistics exams.",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "21 Debated: Issues in World Politics (2nd Edition)",
        "Authors": "By Scott, Gregory M. (EDT), Jones, Randall J. (EDT), and Furmanski, Louis S. (EDT)",
        "Description": "This collection of recent, opposing articles on 21 of the most talked-about topics in world politics offers readers a way to tie together theory and concepts with today's headlines. Its informative yet provocative readings encourage discussions, questions, and analytical and critical thought.   A seven-part organization covers complexities under the headings of: Global Community, Democracy in the World, Terrorism and Response, Nuclear Weapons and NATO, International Conflict Resolution, International Political Economy, and Environment and Health. MARKET: For anyone interested in international relations, global issues, and world politics.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Pearson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Public and Private Families: An Introduction",
        "Authors": "By Cherlin, Andrew J.",
        "Description": "In this text for undergraduate students of sociology Cherlin (public policy and sociology, Johns Hopkins U.) discusses the social dynamics of the \"private family\"--comprising two or more people in a longstanding emotionally intimate relationship--and the \"public family\"--consisting of the commitment that adults make to society at large (e.g. to provide for the children and the elderly). Coverage includes historical and contemporary contexts;  gender, class, and race-ethnicity; sexuality, partnership, and marriage; links across the generations; and conflict, disruption, and reconstitution. While the majority of material speaks to American trends, families in many international societies are discussed throughout the text. Updates in this fifth edition include new coverage of topics including the Mexican-American family, same-sex marriage, Hurricane Katrina's relationship to poverty and family, and the financing of Social Security and Medicaid. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "We the People: An Introduction to American Politics (Full Seventh Edition (with policy chapters))",
        "Authors": "By Ginsberg, Benjamin, Lowi, Theodore J., and Weir, Margaret",
        "Description": "The Seventh Edition has been thoroughly updated to include extensive coverage of the pivotal 2008 elections and important recent events and issues. Complemented by a rich package of multimedia tools for instructors and students, including an expanded DVD with more popular culture content, We the People is now more pedagogically effective than ever.",
        "Category": " Political Science , American Government , National",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "7.93",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Incidents in the Life of a Slave Girl (Dover Thrift Editions)",
        "Authors": "By Jacobs, Harriet",
        "Description": "The true story of an individual's struggle for self-identity, self-preservation, and freedom, Incidents in the Life of a Slave Girl remains among the few extant slave narratives written by a woman. This autobiographical account chronicles the remarkable odyssey of Harriet Jacobs (1813–1897) whose dauntless spirit and faith carried her from a life of servitude and degradation in North Carolina to liberty and reunion with her children in the North.Written and published in 1861 after Jacobs' harrowing escape from a vile and predatory master, the memoir delivers a powerful and unflinching portrayal of the abuses and hypocrisy of the master-slave relationship. Jacobs writes frankly of the horrors she suffered as a slave, her eventual escape after several unsuccessful attempts, and her seven years in self-imposed exile, hiding in a coffin-like \"garret\" attached to her grandmother's porch.A rare firsthand account of a courageous woman's determination and endurance, this inspirational story also represents a valuable historical record of the continuing battle for freedom and the preservation of family.",
        "Category": " Biography & Autobiography , Cultural, Ethnic & Regional , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Management Information Systems, Sixth Edition",
        "Authors": "By Oz, Effy",
        "Description": "With a clear emphasis on the business and management elements of information technology, Management Information Systems, Sixth Edition continues to be the ideal resource for upper-level business students and MBA students. Updated to include the latest information technologies, practices, and trends, this book uses more real-world examples and case studies than ever before, providing skills and knowledge that are easily transferable to the business world. From overviews of the information age to online business and business intelligence, readers will gain a sound balance of the technical and business elements of information technology.",
        "Category": " Computers , Management Information Systems",
        "Publisher": "Course Technology",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Courting Disaster: How the CIA Kept America Safe and How Barack Obama Is Inviting the Next Attack",
        "Authors": "By Thiessen, Marc A.",
        "Description": "White House speechwriter Marc Thiessen was locked in a secure room and given access to the most sensitive intelligence when he was tasked to write President George W. Bush’s 2006 speech explaining the CIA’s interrogation program and why Congress should authorize it. Few know more about these CIA operations than Thiessen, and in his new book, Courting Disaster, he documents just how effective the CIA’s interrogations were in foiling attacks on America, penetrating al-Qaeda’s high command, and providing our military with actionable intelligence. Thiessen also shows how reckless President Obama has been in shutting down the CIA’s program and releasing secret documents that have aided our enemies. Courting Disaster proves:How the CIA program thwarted specific deadly attacks against the U.S.Why &#147;enhanced interrogation” was not torture by any reasonable legal or moral standardHow the information gained by &#147;enhanced interrogation” could not have been acquired any other wayHow President Obama’s actions since taking office have left America much more vulnerable to attackIn chilling detail, Thiessen reveals how close the terrorists came to striking again, how intelligence gained from &#147;enhanced interrogation” repeatedly stymied their plots, and how President Obama’s dismantling of this CIA program is inviting disaster for America.",
        "Category": " Political Science , Political Ideologies , General",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Seagull Reader: Poems (Second Edition)",
        "Authors": "By Kelly, Joseph (EDT)",
        "Description": "Each volume offers an inviting mix of classics and less familiar pieces, complemented by concise genre introductions, short headnotes and annotations, brief author biographies, and a glossary of terms. The Readers also include access to innovative writing tips, study and review material, and much more at LitWeb and Norton Literature Online.",
        "Category": " Literary Criticism , Poetry",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Be Happy: Remember to Live, Love, Laugh and Learn (Gift of Inspiration, 12)",
        "Authors": "By Zadra, Dan (COM)",
        "Description": "",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Compendium, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "New Dimensions In Women's Health",
        "Authors": "By Alexander, Linda Lewis, Larosa, Judith H., Bader, Helaine, Garfield, Susan, and Alexander, William James",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Jones & Bartlett Learning",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Student Solutions Manual for Elementary Statistics",
        "Authors": "By Loyer, Milton",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , Mathematics",
        "Publisher": "Pearson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Perl Cookbook: Tips and Tricks for Perl Programmers",
        "Authors": "By Christiansen, Tom and Torkington, Nathan",
        "Description": "The Perl Cookbook is a comprehensive collection of problems, solutions, and practical examples for anyone programming in Perl. Topics range from beginner questions to techniques that even the most experienced of Perl programmers will learn from. More than just a collection of tips and tricks, the Perl Cookbook is the long-awaited companion volume to Programming Perl, filled with previously unpublished Perl arcana.The Perl Cookbook contains thousands upon thousands of examples ranging from brief one-liners to complete applications. Covered topic areas spread across nearly four hundred separate \"recipes,\" including:Manipulation of strings, numbers, dates, arrays, and hashesReading, writing, and updating text and binary filesPattern matching and text substitutionsSubroutines, libraries, and modulesReferences, data structures, objects, and classesSignals and exceptionsAccessing text, hashes, and SQL databasesScreen addressing, menus, and graphical applicationsManaging other processesWriting secure scriptsClient-server programmingInternet applications programming with mail, news, ftp, and telnetThese recipes were rigorously reviewed by scores of the best minds inside and outside Perl, foremost of which was Larry Wall, the creator of Perl himself.The Perl Cookbook is written by Tom Christiansen, Perl evangelist  and coauthor of the bestselling Programming Perl and Learning Perl;  and Nathan Torkington, Perl trainer and co-maintainer of the Perl  Frequently Asked Questions list.",
        "Category": " Computers , Programming , Object Oriented",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Study Guide for Society: The Basics",
        "Authors": "By Macionis, John J.",
        "Description": "",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Brief Penguin Handbook with Exercises: MLA Update (3rd Edition)",
        "Authors": "By Faigley, Lester",
        "Description": "Including the most current MLA citation, documentation, and style guidelines, The Brief Penguin Handbook continues to revolutionize the way handbooks present information.  The Third Edition of this extraordinary handbook continues to lead the market with complete new chapters on using database and Web sources, a new visual five-step guide to the documentation process, and updated and expanded documentation coverage. Started with ideas and suggestions from real students, this handbook gives you the information you need in the format you want.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Longman",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Writing Today",
        "Authors": "By Paine, Charles and Johnson-Sheehan, Richard",
        "Description": "With a clear and easy-to-read presentation, visual instruction, and pedagogical support, Writing Today is a practical and useful guide to writing in college and beyond.      Check us out on Facebook at www.facebook.com/johnsonsheehanpaine!",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Pearson",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Rewriting: How To Do Things With Texts",
        "Authors": "By Harris, Joseph",
        "Description": "\"Like all writers, intellectuals need to say something new and say it well. But unlike many other writers, what intellectuals have to say is bound up with the books we are reading . . . and the ideas of the people we are talking with.\"What are the moves that an academic writer makes? How does writing as an intellectual change the way we work from sources? In Rewriting, a textbook for the undergraduate classroom, Joseph Harris draws the college writing student away from static ideas of thesis, support, and structure, and toward a more mature and dynamic understanding. Harris wants college writers to think of intellectual writing as an adaptive and social activity, and he offers them a clear set of strategies—a set of moves—for participating in it.",
        "Category": " Education , Teaching Methods & Materials , Arts & Humanities",
        "Publisher": "Utah State University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Academic Writer's Handbook",
        "Authors": "By Rosen, Leonard J.",
        "Description": "With its unique focus on source-based writing and writing across the curriculum, The Academic Writer’s Handbook contains all the features of a traditional handbook combined with the tools you need in order to read, write, and conduct research in the disciplines. It contains up-to-the-minute coverage of documentation styles and reflects the 2008 MLA Style Manual and Guide to Scholarly Publishing updates.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Longman",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The Pain Chronicles: Cures, Myths, Mysteries, Prayers, Diaries, Brain Scans, Healing, and the Science of Suffering",
        "Authors": "By Thernstrom, Melanie",
        "Description": "Each of us will know physical pain in our lives, but none of us knows when it will come or how long it will stay. Today as much as 10 percent of the population of the United States suffers from chronic pain. It is more widespread, misdiagnosed, and undertreated than any major disease. While recent research has shown that pain produces pathological changes to the brain and spinal cord, many doctors and patients still labor under misguided cultural notions and outdated scientific dogmas that prevent proper treatment, to devastating effect.In The Pain Chronicles, a singular and deeply humane work, Melanie Thernstrom traces conceptions of pain throughout the ages—from ancient Babylonian pain-banishing spells to modern brain imaging—to reveal the elusive, mysterious nature of pain itself. Interweaving first-person reflections on her own battle with chronic pain, incisive reportage from leading-edge pain clinics and medical research, and insights from a wide range of disciplines—science, history, religion, philosophy, anthropology, literature, and art—Thernstrom shows that when dealing with pain we are neither as advanced as we imagine nor as helpless as we may fear.Both a personal meditation and an intellectual exploration, The Pain Chronicles illuminates and makes sense of the all-too-human experience of pain—and confronts with extraordinary grace and empathy its peculiar traits, its harrowing effects, and its various antidotes.",
        "Category": " Medical , Pain Medicine",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Governing States and Localities, 2nd Edition",
        "Authors": "By Smith, Kevin B., Greenblatt, Alan, and Mariani, Michele",
        "Description": "Smith (U. of Nebraska at Lincoln), Greenblatt (Governing magazine), and Mariani (Pew Center on the States) present the second edition of an undergraduate-level introductory textbook on state and local government in the United States. Chapters cover federalism and state constitution; political attitudes and participation; parties and interest groups; legislatures, executives, courts, and the bureaucracy; the structure, authority, and responsibilities of local government; regional relations among local governments; and the policy areas of finance, education, criminal justice, and health and welfare. The new edition is updated to include analysis of recent legislative and gubernatorial elections, state supreme court decisions and constitutional debates, changes in campaign and elections regulations, demographic changes of immigration and aging, and events and issues such as Hurricane Katrina and climate change. Annotation ©2008 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , American Government , State",
        "Publisher": "CQ Press",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Merriam-Webster's French-English Dictionary, Newest Edition, Mass-Market Paperback (English and French Edition)",
        "Authors": "By Merriam-Webster",
        "Description": "\"A bilingual, bidirectional guide to French and North American English with extensive coverage of Canadian French.  More than 80,000 entries and 100,000 translations. Abundant examples of words used in context.\"",
        "Category": " Foreign Language Study , French",
        "Publisher": "Merriam-webster+ Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "400 Calorie Fix Cookbook 400 All-new Simply Satisfying Meals",
        "Authors": "By Liz Vaccariello",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Effective Writing: A Handbook for Accountants",
        "Authors": "By May, Claire B., Ph.D. and May, Gordon S.",
        "Description": "The best-selling book of its kind, discusses the communication, both written and oral, actually done by professional accountants.It uses real-world accounting situations and includes major sections on Communication Strategies, Business Documents, and Oral Communication. This book is written for the accountant who wants to sharpen their communication and critical thinking skills in order to be more effective in the workplace.  For Accounting, Business Communication, and Technical Writing courses.",
        "Category": " Business & Economics , Accounting , General",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Making Globalization Work",
        "Authors": "By Stiglitz, Joseph E.",
        "Description": "The Nobel Prize-winning economist and leading critic of globalization offers a fresh new approach to the issue that explains how to restructure an unstable global financial system, how nations can grow economically without damaging the environment, and how to devise a framework for free and fair global trade. Reprint. 25,000 first printing.",
        "Category": " Political Science , Globalization",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Barron's AP Calculus (Barron's: The Leader in Test Preparation)",
        "Authors": "By Bock, David and Hockett, Shirley O.",
        "Description": "Both Calculus AB and Calculus BC are covered in this comprehensive AP test preparation manual. Prospective test takers will find four practice exams in Calculus AB and four more in Calculus BC, with all questions answered and solutions explained. The manual also provides a detailed 10-chapter review covering topics for both exams. The authors also offer an overview of the AP Calculus exams, which includes advice to students on making best use of their graphing calculators.",
        "Category": " Mathematics , Calculus",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    }
]