[
    {
        "Title": "The Amateur Marriage: A Novel",
        "Authors": "By Tyler, Anne",
        "Description": "From the inimitable Anne Tyler, a rich and compelling novel about a mismatched marriage—and its consequences, spanning three generations.They seemed like the perfect couple—young, good-looking, made for each other. The moment Pauline, a stranger to the Polish Eastern Avenue neighborhood of Baltimore (though she lived only twenty minutes away), walked into his mother’s grocery store, Michael was smitten. And in the heat of World War II fervor, they are propelled into a hasty wedding. But they never should have married.Pauline, impulsive, impractical, tumbles hit-or-miss through life; Michael, plodding, cautious, judgmental, proceeds deliberately. While other young marrieds, equally ignorant at the start, seemed to grow more seasoned, Pauline and Michael remain amateurs. In time their foolish quarrels take their toll. Even when they find themselves, almost thirty years later, loving, instant parents to a little grandson named Pagan, whom they rescue from Haight-Ashbury, they still cannot bridge their deep-rooted differences. Flighty Pauline clings to the notion that the rifts can always be patched. To the unyielding Michael, they become unbearable.  From the sound of the cash register in the old grocery to the counterculture jargon of the sixties, from the miniskirts to the multilayered apparel of later years, Anne Tyler captures the evocative nuances of everyday life during these decades with such telling precision that every page brings smiles of recognition. Throughout, as each of the competing voices bears witness, we are drawn ever more fully into the complex entanglements of family life in this wise, embracing, and deeply perceptive novel.",
        "Category": " Fiction , General",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Straight Up and Dirty: A Memoir",
        "Authors": "By Klein, Stephanie",
        "Description": "\"I did have my own friends, my own salary, my health, and TiVo: all the important things we're likely to take for granted. Still, when it hit that I'd now have to date again, I panicked. Dating meant nightclubs, heels, and black. It meant, 'No, thank you. Really, I'm full.' It meant matching bras and underwear. Clothes with the micro used to describe them. Because until you date again, people will hiccup lines about getting back on horses. So you invest in an Agent Provocateur whip and a subscription to an online dating service. . . .\"--from Straight Up and DirtyShe had every girl's dream: the perfect marriage to the perfect guy in the perfect apartment on the Upper East Side. Marriage fit Stephanie Klein like a glove . . . but unfortunately it fit her husband like a noose. And then, just like that, Klein found herself \"divorced when you're firm, fashionable, and let's face it—fetching.\"Celebrated bloggist, photographer, and freelance writer Stephanie Klein lets it all hang out in this juicy tell-all tracing her jump back into single life following her divorce. On the dating advice of her therapist, Klein attempts to keep \"a pair and a spare\" of men always on hand and has lots of bawdy fun along the way. But when the anniversary of the devastating breakup from her \"wasband\" forces her to revisit what happened, she finds herself wanting more than her therapist's recommended gimmick to keep her emotionally safe.Straight Up and Dirty demonstrates that the true measure of success isn't what's crossed off life's to-do list. It's having the grace and fortitude to move through change, curls intact and smiling",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The On-Time, On-Target Manager: How a \"Last-Minute Manager\" Conquered Procrastination",
        "Authors": "By Blanchard, Kenneth H. and Gottry, Steven R.",
        "Description": "Ken Blanchard's phenomenal bestsellers, such as The One Minute Manager and Raving Fans, have made him a globally recognized business legend. Millions look to Blanchard for innovative approaches to management, leadership, customer service, and much more. Now, he has joined with noted business author Steve Gottry to explore one of the most common and insidious problems plaguing the workplace—procrastination.The On-Time, On-Target Manager is the story of Bob, a typical middle manager who puts things off to the last minute. As a result, he misses deadlines because his lack of focus causes him to accomplish meaningless tasks before getting to the important things. Like many professionals, Bob rationalizes, justifies, and tries to explain. Luckily, Bob is sent to his company's CEO—which stands for \"Chief Effectiveness Officer\"—who helps him deal with the three negative side effects of procrastination: lateness, poor work quality, and stress to himself and others. Bob learns how to transform himself from a crisis-prone Last-Minute manager into a productive On-Time, On-Target manager.With this engaging parable, Blanchard and Gottry offer practical strategies any professional can put into practice to improve his or her performance.",
        "Category": " Business & Economics , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Uncommon Valor: A Story of Race, Patriotism, and Glory in the Final Battles of the Civil War",
        "Authors": "By Claxton, Melvin and Puls, Mark",
        "Description": "\"With the air of intimacy that only comes from intensive research, Uncommon Valor vividly shows us the contributions made by escaped slaves, ex-slaves, and freemen to the Union cause.\"--Gene Smith, author of Lee and GrantChristian Fleetwood had mixed feelings about America, and America had mixed feelings about him. As a free twenty-three-year-old black man living in Baltimore, with the Civil War raging, he understood well all that was worrisome and all that was inspiring in his war-torn country. A few days after Gettysburg, as his hometown was flooded with horribly wounded soldiers, Fleetwood made a momentous and patriotic decision. He enlisted.Uncommon Valor tells the powerful story of how Sergeant Fleetwood and his fellow \"colored\" troops overcame oppression, suspicion, derision, and a ceaseless torrent of Confederate gunfire to overrun a heavily fortified rebel position against impossible odds. For outstanding bravery and devotion beyond the call of duty, Fleetwood and thirteen of his comrades were awarded the Congressional Medal of Honor.Based on personal diaries, letters, and other firsthand accounts, this riveting tale takes you deep into the heat of battle and beyond, as these heroic soldiers are forced to fight two wars at once--one against the enemy, the other against their own white commanders and fellow troops.The Civil War produced hundreds of heroes and thousands of thrilling accounts of their brave and glorious deeds. None is more moving, compelling, or inspiring than Uncommon Valor.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Call: Discovering Why You Are Here",
        "Authors": "By Mountain Dreamer, Oriah",
        "Description": "The Call exhorts us to heed the voice inside us, calling us to discover and to live fully our true selves and our heart's desires - finding our own unique calling, not in the expectations of others and in the outside world, but deep within ourselves. I have heard it all my lifeA voice calling a name I recognized as myown.Sometimes it comes as a soft-belliedwhisper.Sometimes it holds an edge of urgency.But always it says: Wake up my love. Youare walking asleep.There's no safety in that!The Call, like Oriah's previous books, starts with an evocative, richly textured prose poem. In it, Oriah challenges readers to discard what they know of themselves as seen through other people and the world around them, and to delve deep into their own selves to find who they truly are. She persuades the reader that there is nothing as essential as what you believe yourself to be, and that it's not necessary to search for meaning in other people and the world's agendas; just be confident of your own distinct gifts, challenges and dreams.",
        "Category": " Religion , Inspirational",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Better Homes and Gardens Old-Fashioned Dolls and Toys",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Offers instructions for twenty-six toy and dollmaking projects, including raggedy dolls, a wooden Noah's ark, and a jack-in-the-box",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Democracy in America, Volume 1 (Vintage Classics)",
        "Authors": "By Tocqueville, Alexis de, Boorstin, Daniel J., Bowen, Francis, Bradley, Phillips, Boorstin, Daniel J. (COR), and Boorstin, Daniel J. (INT)",
        "Description": "Out of Alex de Tocqueville's travels through the U.S. in the 1830's came an insightful study of a young democracy and its institutions. This 2 volume edition presents Tocqueville's original text. Footnotes, bibliography.",
        "Category": " Political Science , Political Ideologies , Democracy",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Democracy in America, Volume 2 (Vintage Classics)",
        "Authors": "By Tocqueville, Alexis de, Boorstin, Daniel J., Reeve, Henry, Bowen, Francis, Bradley, Phillips, and Boorstin, Daniel J. (COR)",
        "Description": "Volume 2 of the classic commentary on the influence of democracy on the intellect, feelings, and actions of Americans. With an introduction by Phillips Bradley.",
        "Category": " Political Science , Political Ideologies , Democracy",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The United States Navy: 200 years",
        "Authors": "By Beach, Edward Latimer",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Let No One Deceive You",
        "Authors": "By Brown, Michael L.",
        "Description": "",
        "Category": " Religion , Christianity , Pentecostal & Charismatic",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Walking With Frodo: A Devotional Journey Through the Lord of the Rings",
        "Authors": "By Arthur, Sarah",
        "Description": "Tolkien's Lord of the Rings epic tale has long captivated readers with its parallels to biblical truth. And now, Walking with Frodo looks at the biblical themes found in the classic Lord of the Rings trilogy. The 18 devotions pair vices and virtues (deception vs. honesty, light vs. darkness, good vs. evil) displayed by characters in The Lord of the Rings and bring to light what the Bible has to say. A must-have for longtime and new series fans.",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Dilbert - A Treasury Of Sunday Strips: Version 00 (Volume 16)",
        "Authors": "By Adams, Scott",
        "Description": "Everyone who's in business, works for a business, or even just gives others the business is amazed: Scott Adams never lacks for yet another way to lampoon the corporate world. It's not that Adams is anti-business. He's more anti-bad boss than anything. But poor management practices, the effects of bad decisions, and what it all means for the average worker add up to more comedic material than even the man who created Dilbert can tame. Since Dilbert was first syndicated in 1989, Adams has built a following that would be the envy of any corporate sales and marketing team. His work not only generates howls from readers as they rush to plaster it on lunch-room refrigerators and scan it into interoffice e-mails, it has those same fans reading about \"their\" workplaces every Sunday in a multiple-panel, color format.And that's what this treasury, The Collected Dilbert Sundays, collects for the first time-all the colorful Sunday cartoons of the past five years! This 16th collection published by Andrews McMeel Publishing offers yet another glimpse into the zany life of Dilbert, Dogbert, Ratbert, and the rest of the crazy cube crew through the masterpiece Sunday comics. Here's even more of the great Adams's irony, sarcasm, and satire that so many have come to depend upon to cope with the corporate workplace. Many of this collection's Sunday cartoons have never before appeared in color. A great number will be new even to loyal Dilbert followers. But all of them, without fail, will include that trademark humor that has made Adams and his office-bound alter ego icons of the popular American scene. Dilbert, in fact, has grown far beyond its original place on newspaper pages. The strip and its characters have translated to the Dilbert television show on UPN, calendars, cards, watches, balloons, and even Dilberitos, Adams's recent real-life push to create a nutritious food. All this points to the strength, appeal, and empathetic tone that the Dilbert phenomenon represents. The Collected Dilbert Sundays humorously continues the tradition of poking fun at the world of business from which we all seek to temporarily escape.Bank",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Sight Hound: A Novel",
        "Authors": "By Houston, Pam",
        "Description": "This is the story of a woman, Rae, and her dog, Dante, a wolfhound who teaches \"his human\" that love is stronger than fear (the dog has always known this). Dante is the catalyst for change in other characters as well, and they step forward with their narratives: Rae's house-tender; her therapist; two veterinarians; and an anxiety-ridden actor, Howard, who turns out to be as stalwart as Dante himself. As the \"seer\" who hunts by sight rather than smell, Dante has some things to add, as does Rose, another dog who lives at Rae's heels, and Stanley the cat. Among and above these myriad voices, Rae voices her own challenges. With the wit and dead-on candor we've come to expect from Pam Houston, Sight Hound unfolds a story that illuminates the intangible covenant between loved ones. Here, dogs and humans are simply equal creatures, looking to connect and holding on for dear life when they do.",
        "Category": " Fiction , Romance , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Island of the Day Before",
        "Authors": "By Weaver, William (TRN), Eco, Umberto, and Weaver, William",
        "Description": "Roberto della Griva, a seventeenth-century nobleman, finds himself stuck upon a ship from which he cannot escape, so he explores the ship and reminisces about the various chapters and experiences of his life. Reprint.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The Washington County Hospital School of Nursing: Highlights relating to its beginning and development, 1906-1971",
        "Authors": "By Huffer , Julia Lizer .",
        "Description": "",
        "Category": "",
        "Publisher": "Washington County Hospital School of Nursing Alumnae Association",
        "Price Starting With ($)": "19.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Photographing Your Baby: Tips for Taking Great Pictures",
        "Authors": "By Eastman Kodak Company",
        "Description": "Offers practical advice on photographing infants during their first two years and provides information on all the technical aspects involved",
        "Category": " Photography , General",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Sportin' a 'Tude: What Your Attitude Says When You're Not Looking",
        "Authors": "By Clairmont, Patsy",
        "Description": "",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Guideposts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Designing Enterprise Applications with the J2EE¿ Platform (2nd Edition)",
        "Authors": "By Johnson, Mark, Stearns, Beth, and Inderjeet, Singh (EDT)",
        "Description": "Continuing the approach of the first edition, this edition describes the architecture and design principles employed in creating J2EE applications, with a sample application included.  The reader will need to be familiar with the J2EE platform or learning it concurrently as they use this text.  Issues concerning security, deployment, transaction management, and internationalization are discussed.  A glossary of terms is provided. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Hardware , Personal Computers , General",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "5.93",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Courage To Start: A Guide To Running for Your Life",
        "Authors": "By Bingham, John",
        "Description": "“The miracle isn't that I finished. The miracle is that I had the courage to start.” Take your first step toward fitness and a happier, healthier life.Has the idea of running crossed your mind, but you haven't acted on it because you don't think you have the body of a runner? Have you thought about running but quit before you started because you knew that you would be breathless at the end of your driveway? Well, put aside those fears because you can do it. John Bingham, author of the popular Runner's World column “The Penguin Chronicles,” transformed himself from an overweight couch potato who smoked into a runner who has completed eleven marathons and hundreds of road races. Forget about the image of a perfect body in skintight clothes, and don't worry about how fast or how far you go. Bingham shows how anyone can embrace running as a life-enhancing activity—rather than as a competition you will never win. In an entertaining blend of his own success story and practical advice, Bingham provides reasonable guidelines for establishing a program of achievable goals; offers tips on clothing, running shoes, and other equipment; and explains how anyone can prepare for and run distances ranging from a few miles to marathons. After all, in running and in life, the difference between success and failure sometimes comes down to a single step. Waddle on, friends.",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Le Cid Corneille (Crofts Classics)",
        "Authors": "By Corneille, Pierre and Lapp, John C.",
        "Description": "Edited and translated by John C. Lapp, this edition of Le Cid for performance and study includes an introduction, which interprets the contemporary political, social, and romantic themes that give this tragedy its complex, interwoven structure. Also included are a selected bibliography and a list of the principal dates in the life of Corneille.",
        "Category": " Literary Collections , European , Spanish & Portuguese",
        "Publisher": "Wiley-Blackwell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Growing Strong Daughters: Encouraging Girls to Become All They’re Meant to Be",
        "Authors": "By McMinn, Lisa Graham",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Baker Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "A History of the End of the World: How the Most Controversial Book in the Bible Changed the Course of Western Civilization",
        "Authors": "By Kirsch, Jonathan",
        "Description": "\"[The Book of] Revelation has served as a \"language arsenal\" in a great many of the social, cultural, and political conflicts in Western history. Again and again, Revelation has stirred some dangerous men and women to act out their own private apocalypses. Above all, the moral calculus of Revelation&#8212the demonization of one's enemies, the sanctification of revenge taking, and the notion that history must end in catastrophe&#8212can be detected in some of the worst atrocities and excesses of every age, including our own. For all of these reasons, the rest of us ignore the book of Revelation only at our impoverishment and, more to the point, at our own peril.\"The mysterious author of the Book of Revelation (or the Apocalypse, as the last book of the New Testament is also known) never considered that his sermon on the impending end times would last beyond his own life. In fact, he predicted that the destruction of the earth would be witnessed by his contemporaries. Yet Revelation not only outlived its creator; this vivid and violent revenge fantasy has played a significant role in the march of Western civilization. Ever since Revelation was first preached as the revealed word of Jesus Christ, it has haunted and inspired hearers and readers alike. The mark of the beast, the Antichrist, 666, the Whore of Babylon, Armageddon, and the Four Horsemen of the Apocalypse are just a few of the images, phrases, and codes that have burned their way into the fabric of our culture. The questions raised go straight to the heart of the human fear of death and obsession with the afterlife. Will we, individually or collectively, ride off to glory, or will we drown in hellfire for all eternity? As those who best manipulate this dark vision learned, which side we fall on is often a matter of life or death. Honed into a weapon in the ongoing culture wars between states, religions, and citizenry, Revelation has significantly altered the course of history. Kirsch, whom the Washington Post calls \"a fine storyteller with a flair for rendering ancient tales relevant and appealing to modern audiences,\" delivers a far-ranging, entertaining, and shocking history of this scandalous book, which was nearly cut from the New Testament. From the fall of the Roman Empire to the Black Death, the Inquisition to the Protestant Reformation, the New World to the rise of the Religious Right, this chronicle of the use and abuse of the Book of Revelation tells the tale of the unfolding of history and the hopes, fears, dreams, and nightmares of all humanity.",
        "Category": " Religion , Christianity , History",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Ortho's Home Repair Problem Solver",
        "Authors": "By Ortho Books (COR), Beckstrom, Robert J., and Smith, Sally W.",
        "Description": "Provides advice on handling indoor and outdoor home maintenance problems",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Ortho",
        "Price Starting With ($)": "6.08",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Malory: The Knight Who Became King Arthur's Chronicler",
        "Authors": "By Hardyment, Christina",
        "Description": "Sir Thomas Malory's Morte Darthur (1469) is one of the most renown books in the world. Virtually all modern versions of the Arthurian legends are derived from its energetic, memorably phrased and remarkably individual telling of the stirring exploits of King Arthur and his Knights of the Round Table. Yet the identity of the fifteenth-century knight who wrote it has remained an enigma for centuries. The existing records of his life imply that he was a criminal&#8212accused of rape, ambush, rustling and attacks on abbeys&#8212and in prison for most of his life.Using evidence from new historical research and deductions from the only known manuscript copy of Malory's masterpiece, Christina Hardyment resolves the contradictions in this brilliant story of a man who was marked by great achievement along with deep disgrace. She depicts Malory as an experienced soldier&#8212who fought against the French with Henry V and was closely connected with the Knights Hospitallers' battles against the Turks in Rhodes&#8212an expert on tournaments, a connoisseur of literature, a loyal subject who was deeply involved in the troubled politics of the Wars of the Roses, and a writer who intended his great work to inspire the princes and knights of his own time to high endeavors and noble acts. Christina Hardyment has not only given Sir Thomas Malory a biography worthy of King Arthur's greatest chronicler, she has also set it against a fascinating background: an age that would see the high-water mark of medieval chivalry and would also come to be seen as a bridge between the Middle Ages and the modern world.",
        "Category": " Literary Criticism , European , English, Irish, Scottish, Welsh",
        "Publisher": "HARPER COLLINS PUBLISHERS",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "What Came Before He Shot Her",
        "Authors": "By George, Elizabeth",
        "Description": "The brutal, inexplicable death of Inspector Thomas Lynley's wife has left Scotland Yard shocked and searching for answers. Even more horrifying is that the trigger was apparently pulled by a twelve-year-old boy. Who is he? Where did he come from? And what were the circumstances that led to his final act of desperation?That story begins on the other side of London, in rough North Kensington, where the three mixed-race, virtually orphaned Campbell children are bounced first from their grandmother then to their aunt. The oldest, fifteen-year-old Ness, is headed for trouble as fast as her high-heeled boots will take her. That leaves the middle child, Joel, to care for the youngest, Toby. No one wants to put it into words, but something clearly isn't right with Toby.Before long, there are signs that Joel himself has problems. A local gang starts harassing him and threatening his brother. To protect his family, Joel makes a pact with the devil—a move that leads straight to the front doorstep of Thomas Lynley.The anatomy of a murder, the story of a family in crisis, What Came Before He Shot Her is a powerful, emotional novel full of deep psychological insights, a novel that only the incomparable Elizabeth George could write.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Last Cato",
        "Authors": "By Carmell, Pamela (TRN)",
        "Description": "A masterful blending of Christian scholarship and pure thrilling adventure, comes a novel about the race to find the secret location of the Vera Cruz, the True Cross on which Christ was crucified, and the ancient brotherhood sworn to protect it from Infidel hands.    Holy relics are disappearing from sacred spots around the world -- and the Vatican will do whatever it takes to stop thieves from their incredible goal; to steal what is left of the scattered and miniscule splinters of the True Cross the Catholic Church has in its possession.   Dr. Ottavia Salina, a brilliant and highly esteemed paleographer toils away at her classified workspace deep within Vatican City, analyzing and restoring some of the world's most valuable religious artifacts, until she is called upon by the highest levels of the Roman Catholic Church and charged with a mysterious new assignment: she is to decipher the strange tattoos -- seven Greek letters and seven crosses -- found on an Ethiopian man's corpse. Found next to what was left of the body were three pieces of wood -- suspected by Vatican scholars to be fragments of the Vera Cruz, actual splinters from the Cross on which Christ was crucified.   With the help of the captain of the Pope's infamous and tradition-rich Swiss Guard and a renown archaeologist from the ancient city of Alexandria, Dr. Salina is able to uncover a shocking truth: for hundreds of years, a secret brotherhood which refers to itself as the Staurofilakes, and headed by a mysterious figure called Cato, has been hiding the True Cross and means to gather all remaining fragments for themselves. The markings on the Ethiopian corpse, they soon discover, correspond with each of the Seven Deadly Sins, and are part of the complicated, possibly deadly, initiation ritual used to deem candidates worthy of membership into the brotherhood.   Having discovered a connection between the brotherhood and Dante's Divine Comedy, they use clues within the text as a roadmap which leads them on a race across the globe to Christianity's ancient capitals. As they travel from Rome to Antioch, with several harrowing stops in between, they must brave a series of unimaginable challenges that put their faith -- and their very lives -- to the ultimate test. If they are to uncover the secrets of the ancient brotherhood, and discover the location of the True Cross, they must do so at their own peril.",
        "Category": " Fiction , Historical",
        "Publisher": "Rayo",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Primary Colors: A Novel of Politics",
        "Authors": "By Klein, Joe",
        "Description": "Young Henry Burton, a former congressional aide of mixed race and the grandson of a legendary civil rights leader, is going through a precocious midlife crisis. Tired of the back-scratching and back-stabbing and back-watching of legislative politics, he's wondering what to do next with his Beltway experience and abilities when Jack Stanton, the governor of a small southern state who has set his sights on the presidency, half flatters, half shanghais him into a campaign-staff job. What follows for Henry - and the reader - is an education in modern American electoral politics that in dramatic power, humor, psychological acuity, and insider knowledge beggars a hundred textbooks and a thousand lectures.Henry hopes against hope that he has at last found a leader he can believe in. He then watches in admiration and dismay as, in his quest for votes, Governor Stanton combines calculation and sincerity, dodges a draft-controversy bullet, gorges on barbecue and poaches food off others' plates, seduces the occasional bystander, and confronts the resulting sex scandals. Henry's attempts to manage this impulsive pol - a prodigy of altruism and appetite - force him to confront his own ambivalence about political ethics, racial identity, and love.Primary Colors has its rich rewards as a savvy insider's look at life on the stump. But it travels far beyond mere gossip and expose and discovers a convincing world of its own, peopled by smart cookies, nutcases, and wheeler-dealers, whose public and private lives illuminate each other - sometimes by casting dark shadows. This story spans the novelistic spectrum from bedroom farce to high moral drama, and it paints a picture of the political state of the nation so vivid and authentic that one finds in it the deepest kind of truth - the kind of truth that only fiction can tell.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Get Your Tongue Out of My Mouth, I'm Kissing You Good-bye!",
        "Authors": "By Heimel, Cynthia",
        "Description": "A collection of humorous, insightful essays by the author of Sex Tips for Girls tackles such timely topics as feminism, family values, sex, sexual harassment, the men's movement, the L.A. riots, and more. Reprint.",
        "Category": " Humor , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Handbook for Mortals: Guidance for People Facing Serious Illness",
        "Authors": "By Harrold, Joan K. (EDT), Lynn, Joanne (EDT), and Center to Improve Care of the Dying (COR)",
        "Description": "Modern medical technology has changed not only the way we live but also the way we die. Until two generations ago, people usually died suddenly, after an accident or serious illness. Now, most of us may expect our dying to take longer, to require more care, and to demand more forethought than ever before.Handbook for Mortals is warmly addressed to all those who wish to approach the final years of life with greater awareness of what to expect and greater confidence about how to make the end of our lives a time of growth, comfort, and meaningful reflection. Written by Dr. Joanne Lynn and a team of expert physicians, this book provides equal measures of practical information and wise counsel. Readers will learn what decisions they will need to face, what choices are available to them, where to look for help, how to ease pain and other symptoms, what to expect with specific diseases, how the health-care system operates, and how the entire experience affects dying persons, their families, and their friends. Such practical information is indispensable. But equally important are the personal stories included here of how people have come to terms with dying, how they have faced their fears and made their choices. These give us moving firsthand insights into a profoundly important process, one that is increasingly kept hidden in our culture.From down-to-earth advice on how to talk to your doctor to inspiring quotes from such writers as Emily Dickinson, W. H. Auden, Jane Kenyon, and others,Handbook for Mortals encompasses the needs of both the body and the spirit in our final years.",
        "Category": " Medical , Critical Care",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Reviving the American Dream: The Economy, the States, and the Federal Government",
        "Authors": "By Rivlin, Alice M.",
        "Description": "The American dream is fading: for nearly two decades, the economy has been performing below par, the quality of life has deteriorated, and the government has not confronted the public problems that concern citizens most. In this provocative book, Alice Rivlin offers a straightforward, nontechnical look at the issues threatening the American dream and proposes a solution: restructure responsibilities between the federal and state government.Under her plan, the federal government would eliminate most of its programs in education, housing, highways, social services, economic development, and job training, enabling it to move the federal budget from deficit toward surplus. States would pick up these responsibilities, carrying out a \"productivity agenda\" to revitalize the American economy. Common shared taxes would give the state adequate revenues to carry out their tasks and would reduce intrastate competition and disparities. The federal government would be freer to deal with increasingly complex international issues and would retain responsibility for programs requiring national uniformity. A primary federal job would be the reform of health care financing to ensure control of costs and to mandate basic insurance coverage for everyone.Published in the summer of 1992,  Reviving the American Dream was read by presidential candidate Bill Clinton; by year's end, President Clinton appointed its author, Alice Rivlin, as deputy budget director. Today, the ideal in Rivlin's book&#151;and Rivlin herself&#151;are having an impact inside the administration.Selected as one of Choice magazine's Outstanding Books of 1993",
        "Category": " Business & Economics , General",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Monica",
        "Authors": "By Sutherland, Christine",
        "Description": "In the tradition of The Spy Wore Silk, Sutherland recounts the true story of elegant Monica Massy-Beresford de Wichfeld, who risked her life to become a spy. From the glamour of Europe's most sumptuous villas to the dangers of a world ravaged by war, whether she was harboring paratroopers or transporting explosives, Monica's blend of courage and grace made her a legend. 8 pages of photographs.",
        "Category": " Biography & Autobiography , Reference",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "The Burning Times: A Novel of Medieval France",
        "Authors": "By Kalogridis, Jeanne",
        "Description": "Of the Black Death, they said it was the end of the world; I knew better. The world can withstand the sickness of the body, but it remains to be seen whether it will survive the sickness that eats at the souls of our persecutors...  So professes Mother Marie Françoise, born Sybille, a poor midwife who is taught pagan ways and magic by her grandmother and is forced to take refuge among the Franciscan sisterhood as the Inquisition threatens. Her extraordinary life story unfolds when a monk is charged with determining whether the mysterious abbess is a saint or a witch.  Sybille is possessed of exceptional powers, and she is in full command of them -- practicing white and black magic, winning the hearts of people with her wisdom, and terrorizing church authorities with her cunning. But even witches are not immune to earthly love, and Sybille embarks on a passionate, dangerous quest to be reunited with her beloved. As she confronts an exceptional destiny -- one that will require her to face the flames in order to save others like her -- she relates a tale of impossible triumph that forever changes the inquisitor who hears it.  The Burning Times brilliantly weaves the mythology of the Knights Templar, witchcraft, and gnosticism against a backdrop of actual historical events: the Black Death, the Hundred Years' War, and the catastrophic defeat of France by England. Demonstrating the same meticulous research and page-turning plotting that made her Diaries of the Family Dracul series a success, Jeanne Kalogridis crafts a vivid portrait of this turbulent and fascinating period in world history and, at the same time, delivers a searing love story with a redeeming moral of its own: The greatest magic is that of",
        "Category": " Fiction , Historical",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "SOMETHING WARM FROM OVEN",
        "Authors": "By Goudge, Eileen",
        "Description": "I love baking almost as much as I do writing. So what better way to bring the two together than this book of my favorite recipes?  Baking has often played a leading role in Eileen Goudge's best-selling novels. In Such Devoted Sisters, Annie becomes a chocolatier. In One Last Dance and Taste of Honey, Kitty sells her famous sticky buns at the Tea & Sympathy tearoom. The baked goods described so delectably in her novels inspired hundreds of fans to write to Eileen requesting the recipes, and the idea for Something Warm from the Oven was born.   Ever since she was a child, Eileen has been baking for family and friends. In her first cookbook, she presents a collection of 150 recipes for cakes, pies, tarts, cookies, puddings, breads, and more. Eileen believes that the process of baking should be just as enjoyable as devouring the results. All of her recipes are simple, honest, and uncomplicated, from easy mix-and-go muffins to more elaborate desserts like Red Velvet Cake with Mocha Frosting, just like her mother and grandmother used to make.   No matter what your weakness, you'll find plenty of recipes in Eileen's collection you won't be able to resist, from homey classics like Oatmeal Bread, Lemon Chiffon Pie, Birthday Banana Cake, and Blackberry-Rhubarb Cobbler to newer innovations such as Pumpkin Ricotta Cheesecake, Maple Cream Sandwich Cookies, Pesto Biscuits, and Kahlua Brownies.   It's time to relax and indulge. After all, who doesn't love something warm from the oven?",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Joy; expanding human awareness, by William C. Schutz",
        "Authors": "By Schutz, William C.",
        "Description": "",
        "Category": "",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "You Can Do It!: The Boomer's Guide to a Great Retirement",
        "Authors": "By Pond, Jonathan D.",
        "Description": "Don't be scared by the media and the financial industry, which have a vested interest in convincing all those who don't have a seven-figure income or a family trust fund that they're woefully underprepared for retirement. In You Can Do It!, Jonathan D. Pond, the man who's been called \"America's financial planner,\" shows how anyone can have a financially safe, happy, and comfortable retirement in this comprehensive and easy-to-use guide.Packed with practical wisdom on how to save, understanding the key elements of investing, managing your expenses, and much more, You Can Do It! features Jonathan's famous and distinctively ebullient voice. So whether you're worried about getting a late start, skyrocketing health-care expenses, or the difficulty of paying for a college education, You Can Do It! will show you—in straightforward, easy-to-implement ways—how you too can make sure your retirement is fun and financially secure.",
        "Category": " Business & Economics , Personal Finance , Retirement Planning",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Golden Egg Book (Golden Lap Book)",
        "Authors": "By Brown, Margaret Wise and Weisgard, Leonard (ILT)",
        "Description": "When a lonely bunny plays with an egg that hatches, he and the emerging duckling are friends",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Simple Principles to Eat Smart & Lose Weight",
        "Authors": "By Lluch, Alex A.",
        "Description": "Over 60 percent of all Americans are either obese or overweight. Many of them could lose unwanted pounds by making a few simple changes in their lifestyle and eating habits. Simple Principles to Eat Smart and Lose Weight gives readers practical tips they can apply immediately to help them lose weight and keep it off. In a direct, easy-to-read style, this book provides the basics on topics such as counting calories, increasing physical activity, planning balanced meals, and making healthy lifestyle choices. No matter their age or physical condition, readers will find ideas they can apply immediately to begin losing weight. No special foods are needed. The wisdom contained in Simple Principles to Eat Smart and Lose Weight will benefit readers no matter what diet they are currently following. In addition to the 200 powerful principles for losing weight and their supporting text, this book contains detailed information on everything the reader must know for a successful weight-loss program.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "WS Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Metaphysical Meditations (Self-Realization Fellowship)",
        "Authors": "By Yogananda, Paramahansa",
        "Description": "A collection of prayers and meditations to be used by beginning and experienced meditators to awaken the soul's inner freedom",
        "Category": " Religion , Spirituality",
        "Publisher": "Self-Realization Fellowship",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "June",
            "Year": "1967"
        }
    },
    {
        "Title": "Deck Plans (Includes complete plans for 12 decks)",
        "Authors": "By Beckstrom, Bob",
        "Description": "Provides instructions for building decks and gives advice on framing, steps, benches, and railings",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Ortho Books/Chevron",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "After the Black Death: A Social History of Early Modern Europe (Interdisciplinary Studies in History)",
        "Authors": "By Huppert, George",
        "Description": "",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Indiana University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Sacred Voices: Women of Genesis Speak",
        "Authors": "By Shunfenthal, Sherri Waas",
        "Description": "",
        "Category": " Poetry , Subjects & Themes , Inspirational & Religious",
        "Publisher": "Pocol Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2015"
        }
    },
    {
        "Title": "How the Garcia Girls Lost Their Accents (Plume Contemporary Fiction)",
        "Authors": "By Alvarez, Julia",
        "Description": "Eagerly embracing their new American culture in Miami, the four Garcia women iron their hair, smoke cigarettes, date American men, forget their Spanish, and lose their accents all in their journey toward adulthood. Reprint. 25,000 first printing.",
        "Category": " Fiction , Literary",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The Adventures of Rama: With Illustrations from a Sixteenth-Century Mughal Manuscript",
        "Authors": "By Beach, Milo Cleveland",
        "Description": "",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Smithsonian Inst Pr",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "The Hungry Ocean: A Swordboat Captain's Journey",
        "Authors": "By Greenlaw, Linda",
        "Description": "THE NEW YORK TIMES BESTSELLER--NOW AVAILABLE IN PAPERBACK!Known to millions of readers of The Perfect Storm as the captain of the Hannah Boden, sister ship to the Andrea Gail, Linda Greenlaw is also known as one of the best sea captains on the East Coast. Here she offers an adventure-soaked tale of her own, complete with danger, humor, and characters so colorful they seem to have been ripped from the pages of Moby Dick.\"A beautiful book . . . a story of triumph, of a woman not only making it but succeeding at the highest level in one of the most male-dominated and most dangerous professions.\" -- Douglas Whynott,The New York Times Book Review\"An authentic, insightful account of the intensity of captaining a crew of strong men in an ocean which does what it wants.\" -- Daniel Hays, co-author ofMy Old Man and the Sea\"A crystal-clear account of fishing the Grand Banks in a modern swordfish boat. Greenlaw is an excellent captainand an excellent writer.\" -- John Casey, author ofSpartina",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Andorra",
        "Authors": "By Cameron, Peter",
        "Description": "Leaving the United States after a personal tragedy, a man finds himself in the small country of Andorra, which is bizarrely influenced by his imagination and begins to relfect his past",
        "Category": " Fiction , Literary",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Hours: A Novel (Picador Modern Classics)",
        "Authors": "By Cunningham, Michael",
        "Description": "A daring, deeply affecting third novel by the author of A Home at the End of the World and Flesh and Blood. In The Hours, Michael Cunningham, widely praised as one of the most gifted writers of his generation, draws inventively on the life and work of Virginia Woolf to tell the story of a group of contemporary characters struggling with the conflicting claims of love and inheritance, hope and despair. The narrative of Woolf's last days before her suicide early in World War II counterpoints the fictional stories of Samuel, a famous poet whose life has been shadowed by his talented and troubled mother, and his lifelong friend Clarissa, who strives to forge a balanced and rewarding life in spite of the demands of friends, lovers, and family. Passionate, profound, and deeply moving, this is Cunningham's most remarkable achievement to date.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Vows: The Story of a Priest, a Nun, and Their Son",
        "Authors": "By Manseau, Peter",
        "Description": "The 1950s was a boom time for the Catholic Church in America, with large families of devout members providing at least one son or daughter for a life of religious service. Boston was at the epicenter of this explosion, and Bill Manseau and Mary Doherty -- two eager young parishioners from different towns -- became part of a new breed of clergy, eschewing the comforts of homey parishes and choosing instead to minister to the inner-city poor. Peter Manseau's riveting evocation of his parents' parallel childhoods, their similar callings, their experiences in the seminary and convent, and how they met while tending to the homeless of Roxbury during the riot-prone 1960s is a page-turning meditation on the effect that love can have on profound faith. Once married, the Manseaus continued to fight for Father Bill's right to serve the church as a priest, and it was into this situation that Peter and his siblings were born and raised to be good Catholics while they witnessed their father's personal conflict with the church's hierarchy. A multigenerational tale of spirituality, Vows also charts Peter's own calling, one which he tried to deny even as he felt compelled to consider the monastic life, toying with the idea of continuing a family tradition that stretches back over 300 years of Irish and French Catholic priests and nuns.It is also in Peter's deft hands that we learn about a culture and a religion that has shaped so much of American life, affected generations of true believers, and withstood great turmoil. Vows is a compelling tale of one family's unshakable faith that to be called is to serve, however high the cost may be.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Letters of Wolfgang Amadeus Mozart",
        "Authors": "By Mozart, Wolfgang Amadeus",
        "Description": "Over 100 often hilarious, sometimes sad, but always articulate letters from one of the most charismatic composers in history. Candid self-portrait emerges revealing his witty observations of royalty and their patronage, music, his family, his debilitating and humiliating poverty. One facsimile.",
        "Category": " Music , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2016"
        }
    },
    {
        "Title": "Jacqueline Bouvier Kennedy Onassis: A Life",
        "Authors": "By Spoto, Donald",
        "Description": "The first full biography of Jackie O since her death contains surprising revelations about her life and the life of JFK, chronicling her work as a mother, editor, and spiritual seeker. By the author of The Hidden Jesus. 75,000 first printing.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Quetzal and the Cool School (Pictureback(R))",
        "Authors": "By Thompson, Dana (ILT), Thompson, Del (ILT), Ruby, Cliff, Anderson, Bendix, and Lesser, Elana",
        "Description": "It's almost the first day of school, but Max is afraid to go. So his big sister Emmy suggests that he practice going to school--in Dragon Land! Will Quetzal and the other dragons be able to help Max realize that school is cool?",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Match Me If You Can: A Novel",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "You met quarterback Kevin Tucker in This Heart of Mine. Now get ready to meet his shark of an agent, Heath Champion, and Annabelle Granger, the girl least likely to succeed.Annabelle's endured dead-end jobs, a broken engagement . . . even her hair's a mess! But that's going to change now that she's taken over her late grandmother's matchmaking business. All Annabelle has to do is land the Windy City's hottest bachelor as her client, and she'll be the most sought-after matchmaker in town.Why does the wealthy, driven, and gorgeous sports agent Heath Champion need a matchmaker, especially a red-haired screw-up like Annabelle Granger? True, she's entertaining, and she does have a certain quirky appeal. But Heath is searching for the ultimate symbol of success -- the perfect wife. And to make an extraordinary match, he needs an extraordinary matchmaker, right?Soon everyone in Chicago has a stake in the outcome, and a very big question: When the determined matchmaker promised she'd do anything to keep her star client happy . . . did she mean anything? If Annabelle isn't careful, she just might find herself going heart-to-heart with the toughest negotiator in town.",
        "Category": " Fiction , Romance , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "How to Study the Bible for Yourself",
        "Authors": "By LaHaye, Tim F.",
        "Description": "",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "How to Plan and Design Additions",
        "Authors": "By Musgrave, John R. and Thompson, Fred B.",
        "Description": "Describes different types of additions, explains how to analyze the layout of one's home, and discusses design considerations, financing, and architect selection",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "A turning wheel: Three decades of the Asian revolution as witnessed by a correspondent for The New Yorker",
        "Authors": "By SHAPLEN, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Growth of Philosophic Radicalism",
        "Authors": "By Halevy, Elie",
        "Description": "",
        "Category": "",
        "Publisher": "The Beacon Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Ecocide in the USSR: The Looming Disaster in Soviet Health and Environment",
        "Authors": "By Feshbach, Murray & Alfred Friendly, Jr.",
        "Description": "Murray Feshbach, the world's foremost specialist on Soviet health and population, and Alfred Friendly, Jr., a Moscow correspondent turned environmental writer, give the first authoritative measure of the Soviet ecological breakdown, the political forces it has aroused, and the costs of repairing the damage.In 103 cities, home to seventy million people, the air is unfit to breathe...Pollution fouls 75 percent of the surface water...Four out of five rural hospitals lack hot water, and surgeons make do with razor blades in place of scalpels...An inland sea turns to desert...Infant mortality rises and life expectancy falls...The medical and environmental crisis that burst over the USSR in the Gorbachev years developed in secrecy, but exploded--along with Chernobyl--in civic protest against the polluters who squandered resources and the people's health and against the leadership that deprived the sick of modern medicines and humane care.The cost of any cure will be high in time, funds, and technology, but the Soviets' lethal neglect and abuse of nature carries consequences no citizen of the planet can dare ignore.",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "21.83",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "How to Take Good Pictures",
        "Authors": "By Kodak",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Unfit to Practice",
        "Authors": "By O'Shaughnessy, Perri",
        "Description": "It’s the moment every attorney fears most...one careless moment that threatens careers, reputations, lives. For Nina Reilly, it will change everything—and ignite a case where her own clients are witnesses against her...and where the defendant is Nina herself.As an attorney championing desperate people, Nina Reilly has skirted the edges of legal ethics in pursuit of a just result, but she has never before broken the rule of absolute protection of her clients’ secrets. One September night in Lake Tahoe when her unlocked truck is stolen, her life changes forever. Gone are her most sensitive case files, complete with the sometimes brutally candid notes she took while interviewing her clients. It’s every attorney’s nightmare. And now the worst has happened: The secrets are being revealed, one by one, in ways that will cause the greatest harm. Nina’s own clients complain to the State Bar of California, and suddenly Nina is fighting for her license and her livelihood in a legal proceeding that may ultimately lead her to disbarment. In desperation, Nina turns to her ex-husband, celebrated San Francisco lawyer Jack McIntyre, to represent her. And as personal tensions erupt between McIntyre and Nina’s sometime boyfriend, private investigator Paul van Wagoner...as reputations are ruined and people begin to die...a chilling pattern of rage and revenge comes into focus. Someone is bent on destroying the lives of Nina’s clients and, in the process, Nina Reilly.",
        "Category": " Fiction , Legal",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The City of Falling Angels",
        "Authors": "By Berendt, John",
        "Description": "The #1 New York Times bestseller!Twelve years ago, Midnight in the Garden of Good and Evil exploded into a monumental success, residing a record-breaking four years on the New York Times bestseller list (longer than any work of fiction or nonfiction had before) and turning John Berendt into a household name. The City of Falling Angels is Berendt's first book since Midnight, and it immediately reminds one what all the fuss was about. Turning to the magic, mystery, and decadence of Venice, Berendt gradually reveals the truth behind a sensational fire that in 1996 destroyed the historic Fenice opera house. Encountering a rich cast of characters, Berendt tells a tale full of atmosphere and surprise as the stories build, one after the other, ultimately coming together to portray a world as finely drawn as a still-life painting.",
        "Category": " History , Europe , Italy",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Rosie",
        "Authors": "By Lamott, Anne",
        "Description": "From the New York Times bestselling author of Help, Thanks, Wow; Small Mercies; and Stitches, a wise and witty novel about motherhood. Look out for Anne's next book, Hallelujah Anyway, coming in 2017.In Anne Lamott’s wise and witty novel, the growing pains of motherhood are portrayed with rare humor and honesty. If Elizabeth Ferguson had her way, she’d spend her days savoring good books, cooking great meals, and waiting for the love of her life to walk in the door. But it’s not a man she’s waiting for, it’s her daughter, Rosie—her wild-haired, smart-mouthed, and wise-beyond-her-years alter ego. With Rosie around, the days aren’t quite so long, but Elizabeth can’t keep the realities of the world at bay, and try as she might, she can’t shield Rosie from its dangers or mysteries. As Rosie grows older and more curious, Elizabeth must find a way to nurture her extraordinary daughter—even if it means growing up herself.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Leslie Weatherhead: A personal portrait",
        "Authors": "By Weatherhead, Andrew Kingsley",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Essential Siberian Husky",
        "Authors": "By Dunbar, Ian (EDT), Winter, Kerrin (EDT), and Churchill, Dale (EDT)",
        "Description": "Pet owners will enjoy this attractively priced, four-color series of books that are filled with useful information in an attractive design.The Essential Guides have all of the information that the new or experienced pet owner needs for a successful relationship with his or her pet. Packed with interesting sidebars, the books discuss bringing your new pet home; the optimal way to feed your pet; and how to properly groom your pet. Also included are comprehensive chapters on health care and how to train your pet like an expert; as well as a special chapter filled with fun facts about your specific pet.The many fun and descriptive photos in the Essential Guides are taken by a professional photographer, and each book contains perforated fact cards with lots of helpful pet care tips for your convenience.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Records of the Columbia Historical Society of Washington, D.C. (v. 51)",
        "Authors": "By Flack",
        "Description": "",
        "Category": "",
        "Publisher": "University of Virginia Press",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Which Way to the Future?: Selected Essays From Analog (R)",
        "Authors": "By Schmidt, Stanley",
        "Description": "\"It's easy to imagine ways the future can be ugly and depressing. It's harder, but more worthwhile, to imagine plausible ways we can make it better,\" says Stanley Schmidt, and he should know. As the editor of Analog (and a science-fiction writer himself), he's thought about the future more than most. Since the golden age of John W. Campbell (editor from 1938-72), Analog magazine has been renowned for editorials that provoke, prod, inspire, anger, and ignite the magazine's readers into thinking, questioning their own assumptions, and looking at the world with fresh insights. From 1978 to the present, the man challenged to light a fire under the readers month after month has been editor Stanley Schmidt. He has succeeded in exemplary fashion, which helps to explain why he's a twenty-two-time nominee for the best editor Hugo Award. Now, for the first time, thirty-five of his stimulating essays have been gathered in book form. In \"King of the Hill (No Matter What)\" he considers the questions of animal and machine intelligence. \"The Fermi Plague\" offers a frightening answer to Enrico Fermi's famous paradox about the apparent absence of alien civilizations. \"Invisible Enemies, Intelligent Choices\" examines the proper role of science in public policy. Running the gamut from how to challenge scientific orthodoxy to the flaws of our educational system, from the serious value of humor to the difficult choices between jobs and conservation, all the pieces are, in different ways, answers to the question asked by the title: Which way to the future? Schmidt's answers will engage anyone with an eye on tomorrow.",
        "Category": " Literary Criticism , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Forbes Book of Business Quotations : 14,173 Thoughts on the Business of Life",
        "Authors": "By Goodman, Ted (EDT)",
        "Description": "Now including thousands of new quotations, this bestselling compilation of business wit and wisdom is the ultimate desk reference for speakers, writers, CEOs, managers, and employees alike. This handsome collection, featuring nearly 2,000 new quotations, new topics, and a fresh new look, is a trove of enlightening and useful witticisms about the world of business, drawn from across the centuries and all corners of the globe. It features a wide range of germane wisdom from such contemporary luminaries as Katherine Graham, Susan Sontag, Bill Gates, Ronald Reagan, Fran Lebowitz, Gore Vidal, and Donald Trump alongside timeless quotes from Ovid, Ralph Waldo Emerson, Gertrude Stein, Mahatma Gandhi, Henry Ford, Helen Keller, John D. Rockefeller, Oscar Wilde, J.R.R. Tolkien, Virginia Woolf, George Bernard Shaw, and thousands of others—not to mention hundreds of quotes from the Forbes men themselves. Fully indexed for easy use as a speaker’s or writer’s reference, this inspiring volume comes straight from the most trusted and widely read business magazine of all time.",
        "Category": " Reference , Quotations",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Creatures of the Desert World",
        "Authors": "By Gibson, Barbara (ILT), Gibson, Barbara, Urquhart, Jennifer C, and National Geographic Society (U. S.) Special Publications Division (COR)",
        "Description": "An interactive pop-up book about desert animals that’s as educational as it is fun!   This National Geographic Action Book takes readers through a day in the Sonoran Desert, starting with the kestrel’s morning flight and ending with night prowlers hunting under a full moon. The story bounces around from animal to animal with the large cast including mountain lions, roadrunners, and rattlesnakes. As children learn about these creatures and their arid yet beautiful habitat, they are given the opportunity to use pull tabs to make birds fly, snakes slither, and pack rats play. The text also prompts readers to seek out hidden animals like foxes and Gila monsters taking refuge from the hot sun. Look closely under rocks and plants to find the shade seekers.    Whether or not they are reading yet, children are sure to love this multitiered pop-up book, teeming with gorgeously illustrated saguaro cacti, birds of prey, and other Sonoran Desert mainstays.",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "14.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Moneymaker: How an Amateur Poker Player Turned $40 into $2.5 Million at the World Series of Poker",
        "Authors": "By Paisner, Daniel and Moneymaker, Chris",
        "Description": "In 2004 the number of entrants -- and the winning pool -- at the World Series of Poker tripled, thanks in large part to Chris Moneymaker, an amateur player who came out of nowhere to win the 2003 Series, and prove to newcomers and poker pros alike that anything is possible with a chip and a chair.Moneymaker was a young accountant from Tennessee who loved to gamble but only took up cards after college. Three years later he was playing a $40 game of online Texas Hold 'Em and won a coveted seat at the 2003 World Series of Poker. Borrowing money to get to Las Vegas, he entered his first real-time tournament and spent the next four days battling for a top spot at the final table.Filled with everything from his early gambling ventures to a play-by-play of his major hands at the World Series of Poker, Moneymaker is a gripping, fast-paced story for anyone who has ever dreamed of winning it big.",
        "Category": " Games & Activities , Card Games , Poker",
        "Publisher": "It Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Devil's Corner",
        "Authors": "By Scottoline, Lisa",
        "Description": "When prosecutor Vicki Allegretti arrives at a rowhouse to meet a confidential informant, she finds herself in the wrong place at the wrong time -- and is almost shot to death. She barely escapes with her life, but cannot save the two others gunned down before her disbelieving eyes. Stunned and heartbroken, Vicki tries to figure out how a routine meeting on a minor case became a double homicide.Vicki's suspicions take her to Devil's Corner, a city neighborhood teetering on the brink of ruin -- thick with broken souls, innocent youth, and a scourge that preys on both. But the deeper Vicki probes, the more she becomes convinced that the murders weren't random and the killers were more ruthless than she thought.When another murder thrusts Vicki together with an unlikely ally, she buckles up for a wild ride down a dangerous street -- and into the cross-hairs of a conspiracy as powerful as it is relentless.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Greatest Treasure : Timeless Quotes of Wisdom : Volume 1",
        "Authors": "By Christopher Michaels",
        "Description": "",
        "Category": "",
        "Publisher": "Rosecrest Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "It's Obvious You Won't Survive By Your Wits Alone (Volume 6)",
        "Authors": "By Adams, Scott",
        "Description": "\"Adams scrapes his pen across the fears and absurdities of an age we entered when we weren't paying attention-the age of the bureaucratic vacuum.\" Dilbert is the Everyman in the down-sized, techno-centered workplace. He's the corporately innocent engineer who experiences the absurdities and oddities of office life from his (sometimes shrinking) cubicle. Complemented by his sarcastic and power-hungry dog, Dogbert (aspiring Supreme Ruler of the Earth whose secret happiness is \"High expectations and your own bag of chips\"), Dilbert provides humor on one of life's most insidious subjects: work. It's Obvious You Won't Survive by Your Wits Alone features nearly two years of Dilbert comic strips (including Sunday cartoons!) that have never appeared in book form.",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Fitting the Pieces Together: A Collection of Poems",
        "Authors": "By Souders, Bruce",
        "Description": "",
        "Category": "",
        "Publisher": "ROAD Publishers",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "New and Healthy Brand Name Cookbook",
        "Authors": "By Levine, Hedi",
        "Description": "",
        "Category": "",
        "Publisher": "DS-MAX Canada",
        "Price Starting With ($)": "8.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Musician's Home Recording Handbook",
        "Authors": "By Greenwald, Ted",
        "Description": "(Reference). This is the ideal handbook for musicians who want to make high-quality recordings at home. The author's basic philosophy is that musicianship, not equipment, is the essential ingredient in a great recording. With skill, creativity, and a can-do attitude, anyone can produce CD-quality recorded music at home with a minimum of technology and training. The book makes general, practical musical sense of the complex technology of home recording. It will prove useful to those just getting started in home recording, to those trying to fill in holes in their recording background, and to musicians who would just like to understand more clearly what goes on in the studio. The book is based on a popular series of columns in Guitar Player magazine.",
        "Category": " Music , Instruction & Study , Techniques",
        "Publisher": "Backbeat Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Money Power: Easy Proven Secrets You Can Use to Save Hundreds, Even Thousands of Dollars",
        "Authors": "By Publishing, Keystone",
        "Description": "",
        "Category": "",
        "Publisher": "Keystone Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Adams vs. Jefferson: The Tumultuous Election of 1800 (Pivotal Moments in American History Series)",
        "Authors": "By Ferling, John E.",
        "Description": "It was a contest of titans: John Adams and Thomas Jefferson, two heroes of the Revolutionary era, once intimate friends, now icy antagonists locked in a fierce battle for the future of the United States. The election of 1800 was a thunderous clash of a campaign that climaxed in a deadlock in the Electoral College and led to a crisis in which the young republic teetered on the edge of collapse.Adams vs. Jefferson is the gripping account of a turning point in American history, a dramatic struggle between two parties with profoundly different visions of how the nation should be governed. The Federalists, led by Adams, were conservatives who favored a strong central government.  The Republicans, led by Jefferson, were more egalitarian and believed that the Federalists had betrayed the Revolution of 1776 and were backsliding toward monarchy.  The campaign itself was a barroom brawl every bit as ruthless as any modern contest, with mud-slinging, scare tactics, and backstabbing. The low point came when Alexander Hamilton printed a devastating attack on Adams, the head of his own party, in \"fifty-four pages of unremitting vilification.\" The stalemate in the Electoral College dragged on through dozens of ballots. Tensions ran so high that the Republicans threatened civil war if the Federalists denied Jefferson the presidency. Finally a secret deal that changed a single vote gave Jefferson the White House. A devastated Adams left Washington before dawn on Inauguration Day, too embittered even to shake his rival's hand.With magisterial command, Ferling brings to life both the outsize personalities and the hotly contested political questions at stake. He shows not just why this moment was a milestone in U.S. history, but how strongly the issues--and the passions--of 1800 resonate with our own time.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Best Home Businesses for People 50+: 70+ Businesses You Can Start From Home in Middle-Age or Retirement",
        "Authors": "By Edwards, Sarah and Edwards, Paul",
        "Description": "For the fastest-growing segment of our population, here is a comprehensive guide to starting and running a home-based business in midlife and retirement.A baby boomer turns fifty every seven seconds, creating what will soon be the largest and most influential senior generation in history. These dynamic seniors have both a desire and a need to continue their working lives past the age when their parents retired. Boomers have been the primary buyers of more than one million self-employment guides by Paul and Sarah Edwards-and they now have the perfect handbook to take them into the second half of life. The Best Home Businesses for People 50+ features seventy comprehensive profiles that show how to select, start, run, and build a home-based business suited to the needs, talents, and ideals of the over-fifty generation. Each business listing-for careers ranging in diversity from Makeup Artist to Tax Preparer to Information Broker-addresses the concerns of boomers and seniors, including:- Businesses that people 50+ can continue working in for 10-15 years.- Businesses that supplement your retirement income.- Businesses adaptable to a wide variety of locations.- Businesses with flexible hours to allow for family, travel, and other priorities.- Businesses suited to a broad range of health and wellness needs.Profiles of successful business owners and a treasury of online and easy-to-access resources round out The Best Home Businesses for People 50+ to create an indispensable resource for this new generation of career-oriented seniors.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Bridging the Global Gap: A Handbook to Linking Citizens of the First and Third Worlds",
        "Authors": "By Benjamin, Medea and Freedman, Andrea",
        "Description": "Looks at the development of internationalism, interviews average U.S. citizens who are committed to helping the world's poor, and lists internationalist organizations",
        "Category": " Social Science , General",
        "Publisher": "Seven Locks Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Production/Operations Management (Irwin Series in Production Operations Management)",
        "Authors": "By Stevenson, William J.",
        "Description": "",
        "Category": " Business & Economics , Production & Operations Management",
        "Publisher": "Richard d Irwin",
        "Price Starting With ($)": "8.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "A Season in Purgatory",
        "Authors": "By Dunne, Dominick",
        "Description": "Dominick Dunne turns the secrets of power and privilege into his most shocking and important novel. In A Season in Purgatory, Dunne explores a wealthy Catholic family, a sinister murder of an innocent girl, and its twenty-year cover-up.When Harrison Burns first meets the family of his boarding school chum Constant Bradley, he is awed by their wealth and generosity. But the Bradleys are a family of strong social aspirations and unrelenting political ambition, and Harrison soon learns that friendship with the Bradleys has its price.As Harrison Burns strips away the facade of wealth and acquisition, he brings the reader face to face with the inner structure of a large family at odds with the religion that is at its core, and the terrible secret that is his purgatory to bear.",
        "Category": " Fiction , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Killshot",
        "Authors": "By Leonard, Elmore",
        "Description": "Armand Degas and Richie Nix combine their criminal credentials, their ease with killing, and their lust for adventure and take off on a spree that has innocent victims running for cover",
        "Category": " Fiction , General",
        "Publisher": "Arbor House",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "More Civil War Ghosts",
        "Authors": "By Susan Crites",
        "Description": "",
        "Category": "",
        "Publisher": "Butternut Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "A Beasty Story",
        "Authors": "By Kellogg, Steven, Kellogg, Steven (ILT), and Martin, Bill",
        "Description": "In a dark, dark house, in a dark, dark wood lurks a creepy, beasty . . . BEAST! But fear not--this beast may not be so beastly after all. The talents of Bill Martin Jr and Steven Kellogg come together for the first time to create a ghoulish story that’s both scary and snug. Cuddle up but beware--you’re in for a big, beasty surprise!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "12.49",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Great American Hotels",
        "Authors": "By Tackach, Jame",
        "Description": "Presents the history, architecture, decor, service, and cuisine of fifteen of America's greatest hotels, and views their lobbies, ballrooms, restaurants, guest rooms, and other facilities",
        "Category": " Architecture , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Across Frontiers: Hispanic Crafts of New Mexico",
        "Authors": "By Cirillo, Dexter",
        "Description": "Across Frontiers is the first book to do justice to the modern artwork created in the four-hundred-year-old tradition of Hispanic crafts: dramatic Rio Grande weavings, finely crafted woodwork and furniture, imaginative tinwork and straw applique, and richly carved and painted santos. Including interviews with local artists and a fascinating history of the area by author Dexter Cirillo, this portrait of a remarkable cultural landscape describes how Spanish, Mexican, and American frontiers have overlapped to create an entirely unique indigenous aesthetic.",
        "Category": " Crafts & Hobbies , Crafts for Children",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Use This Book!: The Only Book You'll Ever Need!",
        "Authors": "By Heckscher, Melissa",
        "Description": "It’s the Swiss Army Knife of Books!   It slices! It dices! Use This Book can be employed in thousands of everyday situations:        •  Gardening Labels      •  Table Setting      •  Weight Chart      •  Cootie Catcher      •  Thank You Card      •  Signs      •  Emergency Procedures      •  Calendar      •  Survival Tips   And that’s just the beginning. Make the perfect paper airplane. Study maps of the world. Save your space with a no parking sign. And much, much more. Don’t leave home without it!",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Invisible Pyramid",
        "Authors": "By Eiseley, Loren",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Ring out!: A book of bells,",
        "Authors": "By Yolen, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "Seabury Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The early years of Alec Waugh",
        "Authors": "By Waugh, Alec",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar, Straus",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "The Real Thing",
        "Authors": "By Stoppard, Tom",
        "Description": "The play begins with Max and Charlotte, a couple whose marriage seems about to rupture. But nothing one sees on a stage is the real thing, and some things are less real than others. But is it the real thing?The Real Thing was first performed at the Strand Theatre, London, on 16 November 1982.",
        "Category": " Drama , General",
        "Publisher": "Tom Stoppard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "A Day of Pleasure",
        "Authors": "By Isaac Bashevis Singer",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Dead Man Walking: The Eyewitness Account Of The Death Penalty That Sparked a National Debate",
        "Authors": "By Prejean, Helen",
        "Description": "In 1982, Sister Helen Prejean became the spiritual advisor to Patrick Sonnier, the convicted killer of two teenagers who was sentenced to die in the electric chair of Louisiana’s Angola State Prison. In the months before Sonnier’s death, the Roman Catholic nun came to know a man who was as terrified as he had once been terrifying. She also came to know the families of the victims and the men whose job it was to execute—men who often harbored doubts about the rightness of what they were doing.        Out of that dreadful intimacy comes a profoundly moving spiritual journey through our system of capital punishment. Here Sister Helen confronts both the plight of the condemned and the rage of the bereaved, the fears of a society shattered by violence and the Christian imperative of love. On its original publication in 1993, Dead Man Walking emerged as an unprecedented look at the human consequences of the death penalty. Now, some two decades later, this story—which has inspired a film, a stage play, an opera and a musical album—is more gut-wrenching than ever, stirring deep and life-changing reflection in all who encounter it.",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The God of Stones and Spiders: Letters to a Church in Exile",
        "Authors": "By Colson, Charles",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Crossway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Arriba!: Comunicacion Y Cultura (Spanish Edition)",
        "Authors": "By Zayas-Bazan, Eduardo and Fernandez, Jose B.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Bloodsworth: The True Story of the First Death Row Inmate Exonerated by DNA (Shannon Ravenel Books)",
        "Authors": "By Junkin, Tim",
        "Description": "Charged with the rape and murder of a nine-year-old girl in 1984, Kirk Bloodsworth was tried, convicted, and sentenced to die in Maryland’s gas chamber. From the beginning, he proclaimed his innocence, but when he was granted a new trial because his prosecutors improperly withheld evidence, the second trial also resulted in conviction. Bloodsworth read every book on criminal law in the prison library and persuaded a new lawyer to petition for the then-innovative DNA testing. After nine years in one of the harshest prisons in America, Kirk Bloodsworth was vindicated by DNA evidence. He was pardoned by the governor of Maryland and has gone on to become a tireless spokesman against capital punishment.",
        "Category": " True Crime , Murder , General",
        "Publisher": "A Shannon Ravenel Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Creating Country Style: Inspirational and Practical Decorating Projects for the Home",
        "Authors": "By Walton, Stewart and Walton, Sally",
        "Description": "",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Lorenz Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Pubis Angelical (An Aventura Original)",
        "Authors": "By Puig, Manuel",
        "Description": "This novel, about the conscious and unconscious lives of two women, focuses on a woman of the seventies convalescing in a hospital bed and a Viennese actress of the thirties",
        "Category": " Fiction , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Time After Time",
        "Authors": "By Alexander, Karl",
        "Description": "Transported to contemporary San Francisco by using H. G. Wells's time machine, Jack the Ripper, amazed by the sexual freedom around him, determines to seduce and slaughter the city's female population",
        "Category": "",
        "Publisher": "The Delacorte Press",
        "Price Starting With ($)": "123.42",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Women Respond to the Men's Movement: A Feminist Collection",
        "Authors": "By Hagen, Kay Leigh (EDT)",
        "Description": "A collection of responses by women to the \"Men's Movement\" includes contributions by Nicole Hollander, Rosemary Radford Ruether, Margo Adair, Ursula K. LeGuin, Barbara Kingsolver, and Starhawk. By the author of Prayers to the Moon. Original.",
        "Category": " Social Science , Men's Studies",
        "Publisher": "Pandora Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Harrowsmith Illustrated Book of Herbs",
        "Authors": "By Lima, Patrick and Forsyth, Turid",
        "Description": "A guide to growing a herb garden in Canada or the northern United States, discussing herbs for the kitchen, for shade and color, for teas and for fragrance",
        "Category": " Gardening , Herbs",
        "Publisher": "Firefly Books Ltd",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Doris Herman's Preschool Primer for Parents : A Question-And-Answer Guide to Your Child's First School Experience",
        "Authors": "By Herman, Doris",
        "Description": "A nursery school teacher and expert on preschool education offers guidance and reassurance to parents of preschoolers, answering their most commons questions and concerns, and addressing such subjects as health, social skills, and separation anxiety. Original.",
        "Category": " Education , Preschool & Kindergarten",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    }
]