[
    {
        "Title": "More Reflections on the Meaning of Life",
        "Authors": "By Friend, David (EDT)",
        "Description": "A collection of 140 color and duotone photographs by the world's leading photographers is accompanied by the observations and meditations on the meaning of life by such notables as Jonas Salk, Garrison Keillor, Corazon Aquino, and others. 15,000 first printing.",
        "Category": " Philosophy , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Expanded Universe: The New Worlds of Robert A. Heinlein",
        "Authors": "By Heinlein, Robert A.",
        "Description": "A fictional account of America's rise to prominence is supplemented by expository essays expressing the distinguished science-fiction writer's opinions on such diversified subjects as crime, nuclear power, teenagers' sex lives, and patriotism",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    },
    {
        "Title": "The Rise and Fall of a 10th Grade Social Climber",
        "Authors": "By Mechling, Lauren and Moser, Laura",
        "Description": "After the collapse of her parents’ marriage, Mimi Schulman leaves her mother in Houston to look after her befuddled photographer father in New York. Too preoccupied with family problems to think much about her new life, Mimi’s first hour at The Baldwin School—an institution where teachers offer psychoanalysis in lieu of grades and students hold cocktail parties in the bathroom between classes—leaves her spinning. When Sam, her childhood best friend, bets her she can’t befriend the “cool girls,” Mimi accepts the challenge, only to discover that social climbing in New York is no easy task. Fitting in with the blond, all-American popular girls back in Texas was nothing compared to joining Baldwin’s clique of raccoon-eyed waifs. Rubbing shoulders with the offspring of diplomats and celebrities, all with secrets and dysfunctions that put her own domestic worries to shame, Mimi finds herself in one bizarre situation to the next—a fake-ID deli, a topless bar, a jacuzzi in Trump Tower—and in the position of winning a bet that threatens to make her lose sight of herself. A coming-of-age story about friendship and betrayal, about brutal honesty and its consequences, The Rise and Fall of a 10th-Grade Social Climber is a novel with heart and a wicked sense of humor.",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Economics of Money, Banking, and Financial Markets, The (Addison-Wesley Series in Economics)",
        "Authors": "By Mishkin, Frederic S.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Massage: The Ultimate Illustrated Guide",
        "Authors": "By Maxwell-Hudson, Clare and Lousada, Sandra (PHT)",
        "Description": "Drawing on the unrivaled experience and knowledge of Clare Maxwell-Hudson, one of the world's foremost practitioners, Massage is the most up-to-date and beautifully illustrated guide available.State-of-the-art photography captures movement on the page, showing exactly how each stroke should be performed. A series of unique international masterclasses features routines ranging from Thai and traditional Indian bridal massage to shiatsu and Swedish massage.",
        "Category": " Health & Fitness , Massage & Reflexotherapy",
        "Publisher": "DK",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Wall Street Journal Guide to Planning Your Financial Future : The Easy-to-read Guide to Lifetime Planning for Retirement",
        "Authors": "By Morris, Virginia B., Morris, Kenneth M., and Siegel, Alan M.",
        "Description": "Initiates readers into the world of financial planning and retirement and explores the nature of unexpected retirement, pension plans, 401(k)s, Social Security, life and health insurance, and estate planning. Original. 100,000 first printing.",
        "Category": "",
        "Publisher": "Lightbulb Press,c1995.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Understanding human communication",
        "Authors": "By Adler, Ronald B.",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Word For Windows?95 For Dummies (For Dummies (Computers))",
        "Authors": "By Gookin, Dan",
        "Description": "Offers an introduction to Microsoft Word for Windows 95, shows how to create, edit, file, and print documents, and suggests solutions to common problems",
        "Category": " Computers , Desktop Applications , Word Processing",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.84",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Wings",
        "Authors": "By Steel, Danielle",
        "Description": "From a house on the edge of her family's dusty  farmland airstrip near Chicago, the child Cassie  O'Malley would sneak into the night to look at the  planes sitting shimmering in the moonlight. Her  World War I veteran father, Pat, wanted his son to  be a pilot, not his reckless, red-haired  daughter. But it was Cassie who had the gift. Ever since  she could remember, Cassie felt the pull of  getting in a cockpit and taking to the skies.  Observing all the while was her father's junior partner,  Nick \"Stick \" Galvin, a fellow war ace  and airborne daredevil. Nick would become her  confidant and best friend, willing to break all the  rules to teach her to fly, knowing that the  greatest gift he could give her was the freedom of  flying. When California entrepreneur Desmon Williams  sees Cassie in a local airshow, he invites her to  California where she breaks new ground as a test  pilot. Soon Cassie's record-breaking flights make  her a media darling. Drawn by Desmond's plans for  her to break Amelia Earhardt's records, but  determined to avoid her mistakes, Cassie trains for  the remarkable journey around the world. From  public appearances to press conferences, easily used  by both her husband and the press, Cassie realizes  that there is more to life than making headlines.  Risking her life, pushing herself to her limits,  she decides to chart her own course and pursue  her own destiny, whatever it costs her. Wings is set in a time of constant change,  when the world was on the brink of war and the  skies were filled with adventurers, a time when  courage and daring forever changed modern-day  aviation.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Ulysses Airborne",
        "Authors": "By Mauricio Obregon",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "An Irish Country Childhood: Memories of a Bygone Age",
        "Authors": "By Walsh, Marrie",
        "Description": "The reminiscences of a Irish woman's childhood takes the reader to a magical Ireland where the reality of spring wells and peat fires mixes with the fantasy worlds the adults are always spinning in their tales.",
        "Category": " History , Europe , Ireland",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Autistic Children: A Guide for Parents",
        "Authors": "By Wing, Lorna",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Kensington Publishing Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Valentine Pontifex",
        "Authors": "By Silverberg, Robert",
        "Description": "Before assuming the role of Pontifex and retiring into the Labyrinth, Lord Valentine struggles with his probable successor, the pragmatic Hissune, over how to deal with turbulence on the planet Majipoor",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Arbor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Walt Disney's Donald Duck: Some Ducks Have All the Luck",
        "Authors": "By Walt Disney",
        "Description": "Donald Duck fears he can never compete with the amazingly lucky Gladstone Gander in picking out the most spectacular birthday present for Daisy.",
        "Category": "",
        "Publisher": "Golden Books Publishing Company, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "De-Coding Da Vinci: The Facts Behind the Fiction of The Da Vinci Code",
        "Authors": "By Welborn, Amy",
        "Description": "Looks at the theories about Christian origins and church history suggested in the novel, \"The Da Vinci Code,\" and explains how they ignore or misinterpret the available information as it has been understood in Catholic tradition.",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "Our Sunday Visitor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Big Horse",
        "Authors": "By McGinniss, Joe",
        "Description": "00  \"The big horse,\" in racing vernacular, is the animal that brings fame and fortune to a stable. He's the heavyweight champion, the All-American quarterback, the four-legged Michael Jordan of the barn. Seabiscuit was once Tom Smith's \"big horse.\" A generation ago, Secretariat was Lucien Lauren's. In 2003, Funny Cide was Barclay Tagg's. In sixty years as a trainer, P. G. Johnson had never had one -- until Volponi.  P. G. Johnson was a blue-collar wizard, a hardscrabble tough guy who had come east from Chicago, determined to make his mark on New York. And he did. He became leading trainer at all three New York tracks -- Saratoga, Belmont, and Aqueduct -- as well as at Florida's Tropical Park. And he did it without ever winning a Triple Crown or Breeders' Cup event, or having \"the big horse.\"  \"I never knew how to kiss rich people's asses, and I got too old to learn. If no owner was going to give me a big horse, I figured I'd have to find one myself,\" he said. He did that, in his seventies, buying a mare for $8,000, breeding her to a $20,000 stallion, and in 1998 producing Volponi, the horse that would change his life.  In October 2002, weakened by surgery and radiation treatment for cancer, P. G. watched Volponi -- the longest shot in the field at 43 to 1 -- bring home more than $2 million by winning the Breeders' Cup Classic, the richest race in America.  The following summer at Saratoga, McGinniss -- journalist, investigative reporter, and horse racing obsessive -- began showing up, more Tuesdays with Morrie than Guys and Dolls, at P. G.'s barn in the predawn hours to listen to the inside racing stories and lore P. G. had gathered. McGinniss came to appreciate that Johnson was not only a stellar horseman but an American original whose wit and wisdom carried far beyond the confines of the racetrack.  As for Volponi, the big horse had given P. G. the perfect Disney ending with the Breeders' Cup victory, and, indeed, Disney soon bought film rights to P. G.'s life story. \"He'll be even better next year,\" P. G. had said, but by the time McGinniss got to Saratoga, Volponi had not won a race in nine months. His faith undiminished, P. G. continued to race Volponi against the best, at Saratoga and beyond, until in the end it came down to the 2003 Breeders' Cup Classic in Santa Anita, a race only one horse in history had ever won twice. As fires burned in the Southern California hills, Volponi -- with Funny Cide's jockey, Jose Santos, in the saddle -- ran the last race of his life.  This book is about what happened that day, about what came after, and about much of what had come before. It's the most exciting, rewarding, and heartwarming story about the world of horse racing that you'll ever read, by one of America's finest writers, at the top of his form.  \"The big horse,\" in racing vernacular, is the animal that brings fame and fortune to a stable. He's the heavyweight champion, the All-American quarterback, the four-legged Michael Jordan of the barn. Seabiscuit was once Tom Smith's \"big horse.\" A generation ago, Secretariat was Lucien Lauren's. In 2003, Funny Cide was Barclay Tagg's. In sixty years as a trainer, P. G. Johnson had never had one -- until Volponi.  P. G. Johnson was a blue-collar wizard, a hardscrabble tough guy who had come east from Chicago, determined to make his mark on New York. And he did. He became leading trainer at all three New York tracks -- Saratoga, Belmont, and Aqueduct -- as well as at Florida's Tropical Park. And he did it without ever winning a Triple Crown or Breeders' Cup event, or having \"the big horse.\"  \"I never knew how to kiss rich people's asses, and I got too old to learn. If no owner was going to give me a big horse, I figured I'd have to find one myself,\" he said. He did that, in his seventies, buying a mare for $8,000, breeding her to a $20,000 stallion, and in 1998 producing Volponi, the horse that would change his life.  In October 2002, weakened by surgery and radiation treatment for cancer, P. G. watched Volponi -- the longest shot in the field at 43 to 1 -- bring home more than $2 million by winning the Breeders' Cup Classic, the richest race in America.  The following summer at Saratoga, McGinniss -- journalist, investigative reporter, and horse racing obsessive -- began showing up, more Tuesdays with Morrie than Guys and Dolls, at P. G.'s barn in the predawn hours to listen to the inside racing stories and lore P. G. had gathered. McGinniss came to appreciate that Johnson was not only a stellar horseman but an American original whose wit and wisdom carried far beyond the confines of the racetrack.  As for Volponi, the big horse had given P. G. the perfect Disney ending with the Breeders' Cup victory, and, indeed, Disney soon bought film rights to P. G.'s life story. \"He'll be even better next year,\" P. G. had said, but by the time McGinniss got to Saratoga, Volponi had not won a race in nine months. His faith undiminished, P. G. continued to race Volponi against the best, at Saratoga and beyond, until in the end it came down to the 2003 Breeders' Cup Classic in Santa Anita, a race only one horse in history had ever won twice. As fires burned in the Southern California hills, Volponi -- with Funny Cide's jockey, Jose Santos, in the saddle -- ran the last race of his life.  This book is about what happened that day, about what came after, and about much of what had come before. It's the most exciting, rewarding, and heartwarming story about the world of horse racing that you'll ever read, by one of America's finest writers, at the top of his form.",
        "Category": " Sports & Recreation , Horse Racing",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Mothers Who Think: Tales of Real-Life Parenthood",
        "Authors": "By Peri, Camille (EDT) and Moses, Kate (EDT)",
        "Description": "A selection of candid, thought-provoking essays from the pages of Salon magazine offers a fascinating look at modern parenthood, featuring articles and writings by Susie Bright, Ariel Gore, Susan Straight, Alex Witchell, Anne Lamott, Stephanie Coontz, and other notable women authors. 35,000 first printing.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Liberal Judaism at Home: the Practices of Modern Reform Judaism",
        "Authors": "By Morrison David Bial",
        "Description": "",
        "Category": "",
        "Publisher": "UNION OF AMERICAN HEBREW CONGREGATIONS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Totally Awesome Money Book for Kids (And Their Parents)",
        "Authors": "By Berg, Adriane G. and Bochner, Arthur Berg",
        "Description": "Chosen as one of the best books of the year by the American Library Association, this highly acclaimed popular guide for readers from ten to seventeen includes quizzes, games, forms, charts. stories, and drawings on the basics o saving, investing, borrowing, working, and taxes.",
        "Category": "",
        "Publisher": "Newmarket Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Five Thousand One and Two-Liners for Any and Every Occasion",
        "Authors": "By Fechtner, Leopold",
        "Description": "",
        "Category": " Pets , Essays & Narratives",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Adventures of a Verbivore",
        "Authors": "By Lederer, Richard",
        "Description": "Led by a self-proclaimed verbivore--someone who makes a daily diet of words--this journey through the marvels and complexities of the English language celebrates oxymorons, confusables, anagrams, and more. By the author of Crazy English.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Week by Week to a Strong Heart: An Action Plan for Preventing and Treating Heart Disease and Other Circulatory Problems",
        "Authors": "By Moser, Marvin, M.D. and Becker, Brenda L.",
        "Description": "Despite what you may think...You do not have to go on a rigid diet to lose weight or prevent heart disease. You do not have to swear off meat, eggs, ice cream, or other foods you enjoy. Week by Week to a Strong Heart shows you how to reduce your intake of fat and cholesterol - yet still eat your favorite foods!Despite popular misconception...You do not have to jog miles a day or do jumping jacks to stay healthy and live a long life. You do not have to join an expensive health club. Week by Week to a Strong Heart takes you through a simple, enjoyable exercise program that has been shown to be just as effective at preventing heart disease as sweatier alternatives!At last...Here is a book by a world-recognized authority that clearly explains the science, facts, and myths about heart disease, stroke, high blood pressure, angina, varicose veins, and other diseases of the circulatory system. Here is a book that tells you, in easy-to-understand language, how to prevent and treat diseases of the heart and arteries. It takes you through a Year-Long Cardiovascular Action Plan that can be followed without a major commitment of time and money!",
        "Category": " Health & Fitness , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "How to Develop and Promote Successful Seminars and Workshops: The Definitive Guide to Creating and Marketing Seminars, Workshops, Classes, and Conferences",
        "Authors": "By Shenson, Howard L.",
        "Description": "A complete guide to succeeding in today's burgeoning seminar business--from developing a program and market testing, to pricing, promotion, advertising, and more! How to Develop & Promote Successful Seminars & Workshops The adult education business--seminars, workshops, classes, conferences--is one of the fastest growing industries in the country and, for many, extremely profitable. Now, Howard Shenson shares proven-effective, research-based strategies responsible for filling more than one million seminar seats, to allow anyone with marketable knowledge to succeed in the seminar business. You'll learn:* How to select a marketable subject and test market any seminar for about $1,000 or less* How to develop a dynamic program and effective program materials* How to create a powerful, registration producing marketing strategy and design winning promotional materials* How to assess promotional effectiveness and fine-tune marketing to increase sales* How to evaluate and choose where and when to conduct your seminar or workshop* How to select hotel and conference facilities* How to price your program to ensure maximum registrations/profitability* How to develop or obtain program materials and how to add to your profits through back-of-the-room sales of products and services* How to creatively select and rent mailing lists, and maximize your direct mail response while reducing marketing expense",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Bankrupt: The Intellectual and Moral Bankruptcy of Today's Democratic Party",
        "Authors": "By Limbaugh, David",
        "Description": "If you want the dirt on the Democrats--and all in their own self-damning words--here it is. Republicans and conservatives would welcome a responsible opposition party to keep them sharp and to debate the crucial issues facing our country--but the Democrats aren't it. In sobering detail, commentator Limbaugh shows why, and highlights the dangers of what a Democratic resurgence could mean for America. He lays bare the gamut of Democratic moral and intellectual bankruptcy--from liberal activist judges who want to rewrite the Constitution, to left-wing moral relativists who want to overturn traditional morality in the name of liberal \"values,\" to unrepentant left-wing racism, to economic ideas that are no more than tired class warfare.--From publisher description.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Passing It On: Four Generations of Graham Traditions",
        "Authors": "By Tchividjian-Graham, Gigi",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "McCracken Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Life@Work Book",
        "Authors": "By Swindoll, Charles R., Hybels, Bill, and Burkett, Larry",
        "Description": "More than ever before, our society hungers for an integrated existence that somehow brings together all the different parts of life. Fortunately, Scripture not only affirms the importance of work, but also addresses the inextricable link between a life of vibrant faith and the labor we are each called to do.We're talking everyday, business work here-- not just what we like to call \"Christian ministry.\" This book helps readers learn how to better integrate faith and work and why it is crucial that we do so.The contributors of The Life@Work Book raise such questions as:How can I put my faith into practice in the workplace without being ridiculed?Can I be \"called\" to a secular job?How does my work relate to God?How does my work relate to others and the needs they have?Am I fulfilling all that God called me to be?With fourteen insightful, chapter-length excerpts from respected authors such as Bill Hybels, Chuck Colson, Charles Swindoll, and Laura Beth Jones,The Life@Work Book explores the integration of work and faith. If you want your work to be about something more than just putting bread on the table, readThe Life@Work Book today and discover how to live out your calling in a way that honors God and maximize your spiritual own impact.",
        "Category": " Religion , Leadership",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Oh the Glory of It All",
        "Authors": "By Wilsey, Sean",
        "Description": "\"In the beginning we were happy. And we were always excessive. So in the beginning we were happy to excess.\" With these opening lines Sean Wilsey takes us on an exhilarating tour of life in the strangest, wealthiest, and most grandiose of families.  Sean's blond-bombshell mother (one of the thinly veiled characters in Armistead Maupin's bestselling Tales of the City) is a 1980s society-page staple, regularly entertaining Black Panthers and movie stars in her marble and glass penthouse, \"eight hundred feet in the air above San Francisco; an apartment at the top of a building at the top of a hill: full of light, full of voices, full of windows full of water and bridges and hills.\" His enigmatic father uses a jet helicopter to drop Sean off at the video arcade and lectures his son on proper hygiene in public restrooms, \"You should wash your hands first, before you use the urinal. Not after. Your penis isn't dirty. But your hands are.\"  When Sean, \"the kind of child who sings songs to sick flowers,\" turns nine years old, his father divorces his mother and marries her best friend. Sean's life blows apart. His mother first invites him to commit suicide with her, then has a \"vision\" of salvation that requires packing her Louis Vuitton luggage and traveling the globe, a retinue of multiracial children in tow. Her goal: peace on earth (and a Nobel Prize). Sean meets Indira Gandhi, Helmut Kohl, Menachem Begin, and the pope, hoping each one might come back to San Francisco and persuade his father to rejoin the family. Instead, Sean is pushed out of San Francisco and sent spiraling through five high schools, till he finally lands at an unorthodox reform school cum \"therapeutic community,\" in Italy.  With its multiplicity of settings and kaleidoscopic mix of preoccupations-sex, Russia, jet helicopters, seismic upheaval, boarding schools, Middle Earth, skinheads, home improvement, suicide, skateboarding, Sovietology, public transportation, massage, Christian fundamentalism, dogs, Texas, global thermonuclear war, truth, evil, masturbation, hope, Bethlehem, CT, eventual salvation (abridged list)-Oh the Glory of It All is memoir as bildungsroman as explosion.",
        "Category": " Family & Relationships , Divorce & Separation",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "God Is My CEO: Following God's Principles in a Bottom-Line World",
        "Authors": "By Julian, Larry S.",
        "Description": "Business leaders face the difficult task of reconciling their personal beliefs with the bottom-line demands of their business obligations. Often, it seems like the conflict between short-term business strategies and their desire to \"do the right thing\" pull them in opposite directions.In God Is My CEO, readers will learn how to:Develop their God-given talents and skills, while developing a spiritual centerGain ideas and encouragement through real-life stories of successful business leaders who have faced the same challengesLearn to apply a practical daily plan to overcome the toughest business issuesFocus their energies and thoughts on moving forward with a sense of purposeMany business leaders struggle with the dilemma of being successful and living a life with purpose.God Is My CEO offers a practical and inspirational source of guidance for achieving a balanced and accomplished life.",
        "Category": " Religion , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Frogs Wore Red Suspenders",
        "Authors": "By Prelutsky, Jack and Mathers, Petra (ILT)",
        "Description": "Jack Prelutsky is the undisputed master of hilarious verse for the youngest child. And Petra Mathers, has no equal when it comes to bringing anything with fur or feathers uproariously to life. Put the two of them together -and you have a modern classic.Here are poems about people and animals, set in such far-flung places as Minot, Minneapolis, Tuscaloosa, Tucumcari, and the Grand Canyon. Impossible to read only once (and memorized by the third reading), these exuberant poems and irresistible pictures will be loved by children from Miami to Seattle.",
        "Category": " Juvenile Nonfiction , Poetry , Humorous",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "A Virginian in Yankeeland",
        "Authors": "By Dean, Benjamin Evans",
        "Description": "",
        "Category": "",
        "Publisher": "B.E. Dean",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "American Cornucopia: Treasures of the Winterthur Library",
        "Authors": "By Martinez, Katherine",
        "Description": "",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Winterthur",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Autocad and Its Applications/Release 12",
        "Authors": "By Madsen, David A. and Shumaker, Terence M.",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Goodheart-Willcox Pub",
        "Price Starting With ($)": "9.24",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Adolescent Psychiatry, Volume 18",
        "Authors": "By Feinstein, Sherman C. (EDT)",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "University of Chicago Press Journals",
        "Price Starting With ($)": "18.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "203 Home Based Businesses That Will Make You Rich",
        "Authors": "By Hicks, Tyler G.",
        "Description": "",
        "Category": "",
        "Publisher": "Prima Publishing",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "A Cook's Tour of Sonoma: 200 Recipes and the Best of the Region's Food and Wine",
        "Authors": "By Jordan, Michele Anna",
        "Description": "Describes Sonoma County foods, and shares recipes for appetizers, soups, sandwiches, breads, pizza, pasta, seafood, poultry, meat, vegetables, salads, and desserts",
        "Category": " Cooking , Regional & Ethnic , African",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Report 2000: a Man's Guide to Women. Wild Nights, Hot Days Perfect Relationships, Great Sex",
        "Authors": "By Larry (Ed). Keller",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "A Voice of One's Own: Conversations with America's Writing Women",
        "Authors": "By Pearlman, Mickey and Henderson, Katherine Usher",
        "Description": "Includes interviews with Alison Lurie, Amy Tan, Gail Godwin, Marge Piercy, M.F.K. Fisher, Laurie Colwin, and Joyce Carol Oates",
        "Category": " Literary Criticism , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Magician's Nephew, Collector's Edition (The Chronicles of Narnia)",
        "Authors": "By Lewis, C. S. and Baynes, Pauline (ILT)",
        "Description": "Don’t miss one of America’s top 100 most-loved novels, selected by PBS’s The Great American Read. A full-color paperback edition of The Magician's Nephew, book one in the classic fantasy series, The Chronicles of Narnia. This edition is complete with full-color cover and interior art by the original illustrator, Pauline Baynes.On a daring quest to save a life, two friends are hurled into another world, where an evil sorceress seeks to enslave them. But then the lion Aslan's song weaves itself into the fabric of a new land, a land that will be known as Narnia. And in Narnia, all things are possible.The Magician's Nephew is the first book in C. S. Lewis's classic fantasy series, The Chronicles of Narnia, which has captivated readers of all ages for over sixty years. This is a stand-alone novel, but if you would like to journey through the wardrobe and back to Narnia, read The Lion, the Witch and the Wardrobe, the second book in The Chronicles of Narnia.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Ted Williams (Baseball Legends)",
        "Authors": "By Wolff, Rick",
        "Description": "Recounts the illustrious career of famed Boston Red Sox slugger Ted Williams, nicknamed \"The Splendid Splinter,\" known as baseball's purest hitter, and who was, in 1941, the last Major League ballplayer to bat over .400.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Sports & Recreation",
        "Publisher": "Chelsea House Pub",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "On My Honor The Beliefs That Shape My Life",
        "Authors": "By Thomas, Gary and Ashcroft, John",
        "Description": "On the first day of his Senate confirmation hearings, John Ashcroft raised his right hand and vowed, \"I swear to unhold the laws of the United States of America, so help me God.\"People who knew him intimately knew they could count on this.And so will others as they read On My Honor, a book that reveals Ashcroft's personal beliefs on racism, abortion, capital punishment, our judicial system, his faith in God, and more.These beliefs were not designed to answer his critics in the Senate. They are beliefs he has held for years, written when he still expected to serve a second term in the Senate.Here is an opportunity to judge this extraordinary man from his own words and deeds. As Ashcroft says, \"The verdict of history is inconsequential; the verdict of eternity is what counts.\"On My Honor was previously published as Lessons From a Father to His Son, ISBN 07852-75401.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Path",
        "Authors": "By Jones, Laurie Beth",
        "Description": "Individuals and companies have been learning what history has demonstrated all along--that people or groups with carefully defined missions have always led and surpassed those who have none. Yet the process of outlining that mission statement has been, up to now, an arduous one that all too few have committed the time, energy, and resources to undertake. In The Path, best-selling author Laurie Beth Jones provides inspiring and practical advice to lead readers through every step of both defining and fulfilling a mission. With more than ten years' experience in assisting groups and individuals, Jones offers clear, step-by-step guidance that can make writing a mission statement take a matter of hours rather than months or years. Rich with humor, exercises, mediations, and case histories, The Path is essential reading for anyone seeking a lighter, clearer way in the world.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Hyperion-Acquired Assets",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Dimensions of professional nursing",
        "Authors": "By Kelly, Lucie Young",
        "Description": "",
        "Category": "",
        "Publisher": "Collier Macmillan",
        "Price Starting With ($)": "11.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Extraordinary People: A Novel",
        "Authors": "By Gervais, Paul",
        "Description": "As Sam, a young boy with a never-present father and a wild mother, grows from a boy into an adult, he reveals his concerns and observations as he recounts the events in his family life",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Bodybuilding Nutrition",
        "Authors": "By Tanny, Mandy",
        "Description": "This unique book examines the diet and nutritional needs of an active athlete, offers nutritional information to fit specific types of exercise, and includes over 200 delicious recipes to help athletes plan meals that fit their individual needs.",
        "Category": " Sports & Recreation , Bodybuilding & Weight Training",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Emily Post on Weddings: Revised Edition",
        "Authors": "By Post, Elizabeth L",
        "Description": "Your wedding day. It should be one of the happiest days of your life, not one of the most harried. The perfect wedding doesn't just happen--it takes planning. Things you never thought about suddenly occupy your every waking hour: How are the invitations worded? What is a semiformal wedding anyway? Why are announcements sent out, and who receives them anyway? What obligations does a wedding invitation confer on the recipient? Do guidelines exist for selecting a wedding gift? Who gives the wedding showers? Are there any guidelines for finding and working with a videographer?Brides and grooms and their parents will find the answers to these questions and much more in the pages of this indispensable book.",
        "Category": " Reference , Etiquette",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Real McCoy",
        "Authors": "By Strauss, Darin",
        "Description": "The New York Times Book Review called Chang and Eng, Darin Strauss's extraordinary debut novel, \"a spirited story of heroic longing.\" Joyce Carol Oates called it \"a remarkable first novel...one of the most riskily imagined and successfully realized novels I've read in years.\" Now this uncommonly gifted storyteller brings us another strikingly original novel.  Are you the Real McCoy?  Loosely based on the real life of a turn-of-the-century icon and charlatan, The Real McCoy introduces a character like no other in recent contemporary fiction. \"Kid\" McCoy was a man of many talents and faces: championship boxer, jewel thief, scam artist, and grifter extraordinaire. Unfolding against the tumultuous backdrop of history, his story becomes a fascinating mirror of the times as he moves from city to city in pursuit of the next con, always living life as he becomes a legend and a symbol of all that's true in America. An audacious and unforgettable novel about identity, illusion, and the search for love, The Real McCoy is bound to become another literary sensation.",
        "Category": " Fiction , Literary",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Pentecost Alley",
        "Authors": "By Perry, Anne",
        "Description": "The ritual murder of a prostitute named Ada McKinley in a bedroom on decrepit Pentecost Alley would ordinarily occasion no stir in Victoria's great metropolis. But under the victim's body the police find a Hellfire Club badge inscribed with the name Finlay Fitzjames - a name that instantly draws Superintendent Thomas Pitt into the case.Finlay's father - immensely wealthy, powerful, and dangerous - refuses to consider the possibility that his son has been in Ada McKinley's bed. The implication is clear: Pitt is to arrest someone other than Finlay Fitzjames for Ada's demise.But Thomas Pitt is not a man to be intimidated, and with the help of his quick-witted wife, Charlotte, and her well-connected friends, he stubbornly pursues his investigation - one that twists and turns like London's own ancient streets....",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Format C:",
        "Authors": "By Black, Edwin",
        "Description": "An epic battle between the forces of good and evil centers around the desperate struggle to fix the Millennium Bug as Chicago investigative reporter Dan Levin, his girlfriend Park, and her teenage computer whiz son Sal become the only hope for stopping power-hungry computer mogul Ben Hinnom. IP.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Brookline Books, Lumen Editions",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "What Your Second Grader Needs to Know: Fundamentals of a Good Second-Grade Education Revised (Core Knowledge Series)",
        "Authors": "By Hirsch, E. D. (EDT)",
        "Description": "Give your child a smart start with What Your Second Grader Needs to Know   What will your child be expected to learn in the second grade? How can you help him or her at home? This book answers these all-important questions and more, offering the specific shared knowledge that hundreds of parents and teachers across the nation have agreed upon for American second graders. Designed for parents and teachers to enjoy with children, featuring a new Introduction, this second-grade volume of the Core Knowledge Series presents the knowledge and skills that should be at the core of a challenging second-grade education, including   • Favorite poems—old and new, from “Caterpillars” to Gwendolyn Brooks’s prizewinning “Rudolph Is Tired of the City” • Literature—from around the world, with African folktales, American tall tales, European fairy tales, and classic myths from ancient Greece • Learning about language—the basic building blocks of written English, all explained with a touch of humor and common sense • World and American history and geography—visit Japan, explore ancient Greece, travel the Underground Railroad with Harriet Tubman • Visual arts—with activities and full-color illustrations of masterworks by El Greco, Van Gogh, Matisse, and others • Music—basic theory, great composers, instruments, and fun-to-sing songs such as “I’ve Been Working on the Railroad” and “Do-Re-Mi” • Math—challenging lessons ranging from telling time to doing fractions, numbers to 100, and a first look at geometry • Science—the cycle of life and the seasons, levers and magnets, the wonder of the human body, and more, with lots of hands-on activities and stories about famous scientists",
        "Category": " Education , Curricula",
        "Publisher": "Delta",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2013"
        }
    },
    {
        "Title": "Nathan's Run: A Novel",
        "Authors": "By Gilstrap, John",
        "Description": "Beginning with a savage killing at a suburban Virginia juvenile detention center, Nathan's Run hurtles its diminutive protagonist, twelve-year-old Nathan Bailey, through a terrifying gauntlet. Accused of murder and branded a cop killer, Nathan becomes the target of a nationwide manhunt even as a vicious hit man is closing in on him. Orphaned and alone, Nathan has nowhere to turn for help.To stay alive he can count only on himself: on his agility, natural cleverness, and honesty. Ironically, the latter proves a formidable weapon as the boy endears himself to a national radio talk-show host and, along the way, pleads his case to a rapt nation.Still, \"justice\" will not be denied, and as an army of police and a dogged contract killer draw closer, Nathan is tested to the very limits of his endurance.Ultimately it will fall to one heart-scarred cop to hold out the helping hand Nathan so sorely needs.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Ricochet: A Novel",
        "Authors": "By Brown, Sandra",
        "Description": "#1 NEW YORK TIMES BESTSELLING AUTHOR SANDRA BROWN IS BACK WITH A SPINE-TINGLING STORY OF MURDER AND BETRAYAL -- AND A HOMICIDE DETECTIVE'S STRUGGLE WITH HIS OWN RULES OF CONDUCT.When Detective Sergeant Duncan Hatcher is summoned to the home of Judge Cato Laird in the middle of the night to investigate a fatal shooting, he knows that discretion and kid-glove treatment are the keys to staying in the judge's good graces and keeping his job.At first glance, the case appears open-and-shut: Elise, the judge's trophy wife, interrupted a burglary in progress and killed the intruder in self-defense. But Duncan is immediately suspicious of Elise's innocent act. His gut feeling is that her account of the shooting is only partially true -- and it's the parts she's leaving out that bother him.Determined to learn the dead man's connection to the Lairds and get at the truth, Duncan investigates further and quickly finds his career, as well as his integrity, in jeopardy -- because he can't deny his increasing attraction to Elise Laird, even if she is a married woman, a proven liar, and a murder suspect.When Elise seeks Duncan out privately and makes an incredible allegation, he initially dismisses it as the manipulative lie of a guilty woman. But what if she's telling the truth? Then that single fatal gunshot at her home takes on even more sinister significance, possibly involving Duncan's nemesis, the brutal crime lord Robert Savich.And then Elise goes missing . . .Ricochet's plot twists -- as only Sandra Brown can write them -- and palpable suspense combine to create this gripping thriller, in which a decent cop's worst enemy may be his own conscience, and trusting the wrong person could mean the difference between life and death.  #1 NEW YORK TIMES BESTSELLING AUTHOR SANDRA BROWN IS BACK WITH A SPINE-TINGLING STORY OF MURDER AND BETRAYAL -- AND A HOMICIDE DETECTIVE'S STRUGGLE WITH HIS OWN RULES OF CONDUCT.When Detective Sergeant Duncan Hatcher is summoned to the home of Judge Cato Laird in the middle of the night to investigate a fatal shooting, he knows that discretion and kid-glove treatment are the keys to staying in the judge's good graces and keeping his job.At first glance, the case appears open-and-shut: Elise, the judge's trophy wife, interrupted a burglary in progress and killed the intruder in self-defense. But Duncan is immediately suspicious of Elise's innocent act. His gut feeling is that her account of the shooting is only partially true -- and it's the parts she's leaving out that bother him.Determined to learn the dead man's connection to the Lairds and get at the truth, Duncan investigates further and quickly finds his career, as well as his integrity, in jeopardy -- because he can't deny his increasing attraction to Elise Laird, even if she is a married woman, a proven liar, and a murder suspect.When Elise seeks Duncan out privately and makes an incredible allegation, he initially dismisses it as the manipulative lie of a guilty woman. But what if she's telling the truth? Then that single fatal gunshot at her home takes on even more sinister significance, possibly involving Duncan's nemesis, the brutal crime lord Robert Savich.And then Elise goes missing . . .Ricochet's plot twists -- as only Sandra Brown can write them -- and palpable suspense combine to create this gripping thriller, in which a decent cop's worst enemy may be his own conscience, and trusting the wrong person could mean the difference between life and death.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Race and Nationality in American Life",
        "Authors": "By Handlin, Oscar",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday Anchor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Naughty or Nice",
        "Authors": "By Dickey, Eric Jerome",
        "Description": "Heat up the holidays with New York Times bestselling author Eric Jerome Dickey, the unsurpassed master of the contemporary relationship novel. Making a list? Checking it twice? Eric Jerome Dickey knows who's naughty or nice.  The New York Times bestselling author promises to deliver all the humor, heart, and superb storytelling that have made him one of the biggest names in African-American fiction. Wrapped up in a gift-sized, gift-priced, beautiful package, Naughty or Nice has all the elements Eric Jerome Dickey's fans have come to love-humor, heart, and soul, with a considerable dose of spice to thaw out those cold winter nights. Hot on the heels of his surefire summer blockbuster, The Other Woman, Naughty or Nice is the present every Dickey fan will want to give as a gift (and keep for themselves)!",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Chill of Fear",
        "Authors": "By Hooper, Kay",
        "Description": "New York Times bestselling author Kay Hooper turns up the heat even as she chills readers to the bone with a new suspense novel that distills the essence of fear itself. In this relentless thriller, two psychics put more than their lives on the line to stop a killer darker and more evil than they could ever imagine. . . .FBI agent Quentin Hayes always knew he had an unusual talent, even before he was recruited by Noah Bishop for the controversial Special Crimes Unit. But, as gifted as he is, for twenty years he’s been haunted by a heartbreaking unsolved murder that took place at The Lodge, a secluded Victorian-era resort in Tennessee. Now he’s returned one final time, determined to put the mystery to rest.Diana Brisco has come there hoping to unlock the mystery of her troubled past. Instead, she is assailed by nightmares and the vision of a child who vanished from The Lodge years ago. And an FBI agent is trying to convince her that she isn’t crazy but that she has a rare gift, a gift that could catch a killer.Quentin knows that this is his last chance to solve a case that has become a dangerous obsession. But can he persuade Diana to help him, knowing what it could cost her? For something cold and dark and pure evil is stalking the grounds of The Lodge. Something Diana may not survive. Something Quentin never felt before: the chill of fear.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Being Perfect",
        "Authors": "By Quindlen, Anna",
        "Description": "A few times in your life, someone will tell you something so right, so deeply true that it changes you forever. That is what Anna Quindlen, author of the timeless bestseller A Short Guide to a Happy Life, does here.In Being Perfect, she shares wisdom that, perhaps without knowing it, you have longed to hear: about “the perfection trap,” the price you pay when you become ensnared in it, and the key to setting yourself free. Quindlen believes that when your success looks good to the world but doesn’t feel good in your heart, it isn’t success at all. She asks you to set aside your friends’ advice, what your family and co-workers demand, and what society expects, and look at the choices you make every day. When you ask yourself why you are making them, Quindlen encourages you to give this answer: For me. “Because they are what I want, or wish for. Because they reflect who and what I am. . . . That way lies dancing to the melodies spun out by your own heart.”At the core of this beautiful book lies the secret of authentic success, the inspiration to embrace your own uniqueness and live the life that is undeniably your own, rich in fulfillment and meaning.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Christmas Shoes (Christmas Hope Series #1)",
        "Authors": "By Vanliere, Donna",
        "Description": "Sometimes, the things that can change your life will cross your path in one instant-and then, in a fleeting moment, they're gone.  But if you open your eyes, and watch carefully, you will believe....Robert is a successful attorney who has everything in life-and nothing at all.  Focused on professional achievement and material rewards, Robert is on the brink of losing his marriage.  He has lost sight of his wife, Kate, their two daughters, and ultimately himself.  Eight year old Nathan has a beloved mother, Maggie, whom he is losing to cancer.  But Nathan and his family are building a simple yet full life, and struggling to hold onto every moment they have together.  A chance meeting on Christmas Even brings Robert and Nathan together-he is shopping for a family he hardly knows and Nathan is shopping for a mother he is soon to lose.  In this one encounter, their lives are forever altered as Robert learns an important lesson:  sometimes the smallest things can make all the difference.  The Christmas Shoes is a universal story of the deeper meaning of serendipity, a tale of our shared humanity, and of how a power greater than ourselves can shape, and even save, our lives.",
        "Category": " Fiction , Religious",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "From Potter's Field",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "#1 bestselling author Patricia Cornwell returns to the chilling world of gutsy medical examiner Kay Scarpetta in this suspense classic.An unidentified nude female sits propped against a fountain in Central Park. There are no signs of struggle. When Dr. Kay Scarpetta and her colleagues Benton Wesley and Pete Marino arrive on the scene, they instantly recognize the signature of serial killer Temple Brooks Gault. Scarpetta, on assignment with the FBI, visits the New York City morgue on Christmas morning, where she must use her forensic expertise to give a name to the nameless—a difficult task. But as she sorts through conflicting forensic clues, Gault claims his next victim. He has infiltrated the FBI’s top secret artificial-intelligence system developed by Scarpetta’s niece, and sends taunting messages as his butchery continues, moving terrifyingly closer to Scarpetta herself.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Scientific Genius and Creativity (Readings from Scientific American)",
        "Authors": "By Gingerich, Owen",
        "Description": "",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Family Health Guide and Medical Encyclopedia",
        "Authors": "By Reader's Digest Association",
        "Description": "",
        "Category": "",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "Newton's Madness: Further Tales of Clinical Neurology",
        "Authors": "By Klawans, Harold L.",
        "Description": "More engaging anecdotes from the writing neurologist. No index or bibliography. For a general audience. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Medical , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Ethan Frome",
        "Authors": "By Wharton, Edith",
        "Description": "",
        "Category": "",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Breakthrough",
        "Authors": "By Richard Cowper",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "An Acquaintance with Darkness",
        "Authors": "By Rinaldi, Ann",
        "Description": "Chaos reigns in Washington, D.C., after President Lincoln’s assassination. But for fourteen-year-old Emily Pigbush, the Union’s turmoil is nothing compared to her own struggle. Sent to live with her uncle Valentine after her mother’s untimely death, Emily realizes that her best friend’s mother was one of John Wilkes Booth’s accomplices. And even worse, she suspects that her uncle is breaking the law.",
        "Category": " Young Adult Fiction , Health & Daily Living , General",
        "Publisher": "Harcourt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Appetizers (Cooking with Bon Appetit)",
        "Authors": "By Bon Appetit",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Knapp Pr",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Altar Ego",
        "Authors": "By Lette, Kathy",
        "Description": "Becky Steele has a black belt in tongue fu.  She holds the Girl's Night Out record for the shortest amount of time between meeting a man and going to bed with him ( nine minutes).  So why is she getting married?  Sure, Julian's the right man, but has she had enough wrong ones?  Jilting Julian at the alter, Becky embark's on a wild affair with a young rap star, who's as raunchy as hubby, a human rights lawyer, is stodgy.  Complications arise, however, when Julian winds up representing Becky's new boy toy in an obscene lyrics suit and starts doing the horizontal tango with Becky's best friend.  Will Becky get in touch with her Inner Adult? Will Julian learn to give good hedonism.  Is it okay to have an affair with your own husband?  Sex, lies, and relationships angst play out to hilarious consequences in this absolutely fabulous, sexy comic novel.",
        "Category": " Fiction , General",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Annual Encyclopedia",
        "Authors": "By Kilmer, John",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Automating your financial portfolio: An investor's guide to personal computers",
        "Authors": "By Woodwell, Donald R",
        "Description": "",
        "Category": "",
        "Publisher": "Dow Jones-Irwin",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Apology for the life of William Mueller: The growth of an existentialist",
        "Authors": "By Mueller, William",
        "Description": "",
        "Category": "",
        "Publisher": "Bodine",
        "Price Starting With ($)": "13.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Airwaves: A Collection of Radio Editorials from the Golden Apple (Communications and Media Studies)",
        "Authors": "By O'Shaughnessy, William",
        "Description": "AirWAVES!, a collection of more than thirty years of editorials and commentary given by William O’Shaughnessy, encompasses a wide spectrum of Westchester life, from politics to just plain citizens.O’Shaughnessy, hailed \"The Squire of Westchester,\" by former governor Mario Cuomo, brings together a retrospective for the Golden Apple, Westchester County, providing the reader with not only a slice of his articulate style and graceful persona, but also an historiography of events and happenings in and around the county.",
        "Category": " Performing Arts , Radio , General",
        "Publisher": "Fordham University Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Short Fiction of Charles W. Chesnutt",
        "Authors": "By Chesnutt, Charles Waddell",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Howard Univ Pr",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Colonial Williamsburg Decorates for Christmas: Step-By-Step Illustrated Instructions for Christmas Decorations That You Can Make for Your Home",
        "Authors": "By Oliver, Libby H., Babb, Betty, Booth, Elizabeth, Kent, Betsy, and Marquardt, M.",
        "Description": "Detailed instructions and diagrams show how to make traditional colonial-style Christmas decorations",
        "Category": " House & Home , General",
        "Publisher": "Colonial Williamsburg Foundation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Nukespeak",
        "Authors": "By Bell, Richard C., O'Connor, Rory, and Hilgartner, Stephen",
        "Description": "Examines the public relations efforts of the nuclear power industry and analyzes its use of euphemisms and confusing language in order to encourage the development of nuclear energy",
        "Category": " Social Science , General",
        "Publisher": "Viking Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Where Angels Fear to Tread (Dover Thrift Editions)",
        "Authors": "By Forster, E. M.",
        "Description": "Like his novel A Room with a View, E. M. Forster's Where Angels Fear to Tread focuses on a group of English men and women living and traveling in Italy. A young Englishman journeys to Tuscany to rescue his late brother's wife from what appears to be an unsuitable romance with an Italian of little fortune. In the events surrounding that match and its fateful consequences, Forster weaves an exciting and eventful tale that intriguingly contrasts English and Italian lives and sensibilities. As in Forster novels, among them Howards End and A Passage to India, Where Angels Fear to Tread reveals the author's deep fascination with all of human experience — sexual, moral, spiritual, imaginative, material. Acutely observant of the ways of the English middle class, he is as critical here of its snobbishness, greed, and cultural insensitivity as he is respectful of its decency and kindness, common sense, and goodwill. This splendid novel reveals the great breadth of his gifts as both storyteller and humanist — attributes that continue to make him one of the twentieth century's most admired novelists.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "The Scarlet Letter (Dover Thrift Editions: Classic Novels)",
        "Authors": "By Hawthorne, Nathaniel",
        "Description": "First published in 1850, The Scarlet Letter is Nathaniel Hawthorne's masterpiece and one of the greatest American novels. Its themes of sin, guilt, and redemption, woven through a story of adultery in the early days of the Massachusetts Colony, are revealed with remarkable psychological penetration and understanding of the human heart. Hester Prynne is the adulteress, forced by the Puritan community to wear a scarlet letter A on the breast of her gown. Arthur Dimmesdale, the minister and the secret father of her child, Pearl, struggles with the agony of conscience and his own weakness. Roger Chillingworth, Hester's husband, revenges himself on Dimmesdale by calculating assaults on the frail mental state of the conscience-stricken cleric. The result is an American tragedy of stark power and emotional depth that has mesmerized critics and readers for nearly a century and a half.A selection of the Common Core State Standards Initiative.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Quintessence",
        "Authors": "By Edwards, Owen and Cornfeld, Betty",
        "Description": "Examines the outstanding features of a variety of products including Crayola crayons, Lacoste shirts, Levi's jeans, and the Stetson hat",
        "Category": " Humor , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "Simon and Schuster Roses (Paperback)",
        "Authors": "By Stelvio Coggiatti",
        "Description": "",
        "Category": "",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "DHTML for the World Wide Web (Visual QuickStart Guide)",
        "Authors": "By Teague, Jason Cranford",
        "Description": "An easy, visual approach to DHTML.  Part step-by-step step-by-step guide and part quick reference, it uses screen shots and images, clear instructions, tips, fingertabs, and a detailed index to cover all of DHTML's features. Enables Web designers using any browser on any platform to position elements anywhere on the page and control their visibility; manipulate font sizes and formats; adjust kerning, leading, spacing, indents, text alignment, margins, borders, and bullets; set colors and backgrounds; and create headlines, sidebars, titles, and columns. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Programming Languages , General",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Curriculum Planning: A New Approach",
        "Authors": "By Glen Hass",
        "Description": "",
        "Category": "",
        "Publisher": "Allyn and Bacon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "First Fiction: An Anthology of the First Published Stories by Famous Writers",
        "Authors": "By Kiernan, Kathy and Moore, Michael M. (EDT)",
        "Description": "An intriguing compilation of the debut published stories of some of the twentieth century's finest writers features the work of Ernest Hemingway, Eudora Welty, Isaac Bashevis Singer, Anne Tyler, John Updike, James Baldwin, and others. Simultaneous. QPB.",
        "Category": " Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "The Age of the Reformation.",
        "Authors": "By Bainton, Roland Herbert",
        "Description": "",
        "Category": "",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1956"
        }
    },
    {
        "Title": "Return of the Jedi (Step-Up Movie Adventures)",
        "Authors": "By Levy, Elizabeth",
        "Description": "HAN SOLO IS being held prisoner at Jabba’s palace. The empire is building a new Death Star. Luke Skywalker and his friends are back on their quest to save the galaxy in this final episode of courage, love, hate, and redemption.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "How Would Jesus Vote?: A Christian Perspective on the Issues",
        "Authors": "By Kennedy, D. James and Newcombe, Jerry",
        "Description": "The 2008 election is shaping up to be one of the most important political contests in American history. In fact, Dr. D. James Kennedy believes it will be a watershed moment that could impact our very survival as a nation under God.Values voters–people whose political views and votes are based on their faith in God–are being targeted as never before. As we move forward in the campaign season, the significant players will debate terrorism, radical Islam, nuclear threats, global warming, social issues, gay marriage, immigration, education, health care, and many other essential issues that can create sharp ideological divisions. Into this overwhelmingly complex political situation, Dr. Kennedy and Jerry Newcombe bring a clear, compelling, and nonpartisan exploration of what God’s Word has to say on these critical matters. How Would Jesus Vote? isn’t intended to tell you which candidates to support; rather it offers you a Christ-centered understanding of the world to help you draw your own political conclusions. This election, don’t cast an uninformed vote that fails to reflect your values. Instead, learn how to apply your faith and obedience to God to your ballot. This timely, helpful, and hopeful book will enable you to do just that.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "WaterBrook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Parenting Isn't for Cowards",
        "Authors": "By Dobson, James C.",
        "Description": "Speaking both as a therapist and as a parent-on a landmark study of 35,000 patients-Dobson offers time-proven insights on why some children really are harder to raise than others. With over 1 million copies sold, this classic parenting handbook provides sound guidance and \"tough love\" principles for raising healthy children.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Walking with Dinosaurs: A Natural History",
        "Authors": "By Haines, Tim",
        "Description": "Haines (series producer of the Discovery Channel program  Walking with Dinosaurs  upon which the text is based) answers questions such as what these super-beasts ate, how they mated, how they survived, whether they were hot or cold blooded, whether they hunted in packs or alone, and how they came to be extinct. The smallest dinosaurs (such as the Coelophysis, an early carnivore) to the giants (including the fearsome Tyrannosaurus) are portrayed in rich color images which combine simulated nature photography and computer graphics. Geared towards the young adult. Oversize: 10x11.25",
        "Category": " Juvenile Nonfiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Bush on the Couch: Inside the Mind of the President",
        "Authors": "By Frank, Justin A.",
        "Description": "With the Bush administration in permanent crisis, a renowned Washington psychoanalyst updates his portrait of George W.'s public persona—and how it has damaged the presidency.Insightful and accessible, courageous and controversial, Bush on the Couch sheds startling new light on George W. Bush's psyche and its impact on the way he governs, tackling head-on the question few seem willing to ask: Is our president psychologically fit to run the country? With an eye for the subtleties of human behavior sharpened by thirty years of clinical practice, Dr. Justin A. Frank traces the development of Bush's character from childhood through his presidency, identifying and analyzing his patterns of thought, action, and communication. The result is a troubling portrait filled with important revelations about our nation's leader—including disturbing new insights into:How Bush reacted to the 2006 Democratic sweep in Congress with a new surge of troops into IraqHis telling habits and coping strategies—from his persistent mangling of English to his tendency to \"go blank\" in the midst of crisisThe tearful public breakdown of his father, George H. W. Bush, and what it says about the former president's relationship to his prominent sonsThe debacle of Katrina—the moment when Bush's arrogance finally failed himWith a new introduction and afterword, Bush on the Couch offers the most thorough and candid portrait to date of arguably the most psychologically damaged president since Nixon.",
        "Category": " Psychology , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Wildflowers in Your Garden: A Gardener's Guide",
        "Authors": "By Ferreniea, Viki and Bolt, Carol (ILT)",
        "Description": "Viki Ferreniea, one of America's foremost wildflower experts, begins this invaluable gardening guide by presenting ten stunning garden designs to suit a variety of habitats and levels of gardening expertise. Her carefully chosen gardens include spring woodlands, a fern garden, waterside and meadow gardens, a treasure-filled rock garden, as well as perennial borders for both sun and shade. These gardens - with the exception of the highly specialized bog garden - can be adapted to grow well in most North American climates by the selection of appropriate plant material. Each design is accompanied by a detailed planting diagram and illustrated with an exquisite watercolor painting of the garden at its height.In addition to these glorious garden designs, Ferreniea has included an indispensable mini-encyclopedia of the best wildflowers to grow in your garden, along with companion plants such as ferns, shrubs, and small trees. This section is illustrated with more than one hundred color photographs, which enhance its use as both an identification and a growing guide.The final section of Wildflowers in Your Garden is a detailed, nitty-gritty guide filled with all the practical information and recommendations needed to create, plant and grow each type of garden described in the book.Uniquely comprehensive and authoritative, beautifully and richly illustrated with 170 color photographs, 40 paintings and plans, and 50 black and white line drawings, Wildflowers in Your Garden will be the definitive resource on wildflowers for years to come.",
        "Category": " Gardening , Flowers , Wildflowers",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Flowering Bulbs Indoors and Out",
        "Authors": "By James, Theodore and Haralambou, Harry (PHT)",
        "Description": "A brightly illustrated guide to growing more than eighty different types of bulbs provides step-by-step instructions on soil preparation, seasonal plantings, cultivation, indoor and outdoor plants, landscaping suggestions, and more.",
        "Category": " Gardening , Flowers , Bulbs",
        "Publisher": "Macmillan Company",
        "Price Starting With ($)": "14.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Southern Living Garden Problem Solver",
        "Authors": "By Bender, Steve (EDT)",
        "Description": "Examines some of the most common garden pests and plant diseases found in Southern gardens, and offers advice on damage control",
        "Category": " Gardening , Reference",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Stephen Girard Founder",
        "Authors": "By Cheesman A Herrick",
        "Description": "",
        "Category": "",
        "Publisher": "Girard College",
        "Price Starting With ($)": "11.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1923"
        }
    },
    {
        "Title": "Keep the Change",
        "Authors": "By McGuane, Thomas",
        "Description": "Joe Starling, a man teetering on the edge of spectacular failures--as an artist, rancher, lover, and human being--is also a man of noble ambitions. His struggle to right himself is mesmerizing, hilarious, and profoundly moving.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The Art of Japanese Management: Applications for American Business",
        "Authors": "By Pascale, Richard T.",
        "Description": "Examines important differences between the management techniques used by Japanese and American businesses and discusses how Japanese methods can be adapted by American companies to increase productivity and success",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "DK Readers: Volcanoes and Other Natural Disasters (Level 4: Proficient Readers) (DK Readers Level 4)",
        "Authors": "By Griffey, Harriet",
        "Description": "Earthquakes,   volcanoes, fires, and floods—discover the awesome power of nature   unleashed! Stunning photographs combine with lively illustrations and engaging, age-appropriate stories in DK Readers, a multilevel reading program guaranteed to capture children's interest while developing their reading skills and general knowledge. With DK Readers, children will learn to read—then read to learn!",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Earthquakes & Volcanoes",
        "Publisher": "DK CHILDREN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Bernard Shaw: 1856-1898 : The Search for Love",
        "Authors": "By Holroyd, Michael",
        "Description": "",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Main Street pocket guide to quilts",
        "Authors": "By Haders, Phyllis",
        "Description": "",
        "Category": "",
        "Publisher": "Main Street Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Webster's New World Compact School and Office Dictionary",
        "Authors": "By Neufeldt, Victoria (EDT) and Sparks, Andrew N. (EDT)",
        "Description": "Designed specifically for handy reference, this compact edition features more than 58,000 entries, a unique new syllabification system, clear, readible type -- larger than any other compact dictionary, common abbreviations, etymologies, and more. It's perfect for everyday use!",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Webster's New World",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Keepin' It Real: A Young Teen Talks With God",
        "Authors": "By Humphrey, Sandra McLeod",
        "Description": "Through a series of letters to God from a shy teenage girl, explores such questions as \"How important is prayer?\", \"What do you expect from God?\", and \"What does God expect from you?\"",
        "Category": " Religion , General",
        "Publisher": "Css Pub Co",
        "Price Starting With ($)": "6.64",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "In the Moment: Celebrating the Everyday",
        "Authors": "By Barker, Teresa and Rich, Harvey L.",
        "Description": "In this enlightening work, popular psychoanalyst Harvey Rich offers a philosophy for living that transforms the flow of everyday moments into a celebrated life. Most of us recognize celebration as an event, but as Rich describes it, celebration is much deeper; it is the internal experience of ourselves in the moment that leaves a long-lasting imprint on our psyche. Whether we are experiencing the beauty of a sunset, the pain of loss, the chemistry of love, the sting of harsh words, soul-crushing boredom, or the thrill of accomplishment, what we learn when we fully engage ourselves in the experience of a moment can affect us forever.Rich describes a celebratory process that unfolds when we recognize a moment as special, and open ourselves to the fullest sensory experience of it. In this deliberate engagement we enrich our understanding of ourselves and our lives in the context of family, friendship, love relationships, and work. Celebration carries us through the joys and adversities of life, and connects us to our spiritual center.Drawing upon his own life experience, family history, and his training in theology, art, literature, medicine, psychiatry, and psychoanalysis, Rich shows us how we can capture the moments of our lives and bring our own histories and aspirations to bear upon those moments -- a celebration that is the antidote to the blur of our often high-tech, fast-paced lives.Celebrating the daily moments of our lives serves as a means of including ourselves in the fullest experience of life -- our profound inner life, our spiritual dimension, the life of our culture, and the history of humankind.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Awakening",
        "Authors": "By Chopin, Kate",
        "Description": "First published in 1899, a seminal novel by one of America's first feminist writers features a businessman's wife who, while spending the summer in a seaside resort away from her husband, begins to yearn for freedom and personal fulfillment. Reissue.",
        "Category": " Fiction , Classics",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "The Cay",
        "Authors": "By Taylor, Theodore",
        "Description": "Follows the adventures, joys, and heartaches of a privileged and prejudiced Dutch boy stranded on a remote tropical island with a kindly and wise West Indian, following an enemy attack on a boat leaving Curacao",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Creating Money: Keys to Abundance",
        "Authors": "By Roman, Sanaya and Packer, Duane",
        "Description": "Spirit teachers explain the spiritual laws of money and offer advice on listening to one's inner guidance and draw money into one's life",
        "Category": " Body, Mind & Spirit , Spiritualism",
        "Publisher": "HJ Kramer",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    }
]