[
    {
        "Title": "Ethics in Psychology: Professional Standards and Cases (Oxford Series in Clinical Psychology)",
        "Authors": "By Koocher, Gerald P. and Keith-Spiegel, Patricia",
        "Description": "Psychologists today must deal with a broad range of ethical issues--from charging fees to maintaining a client's confidentiality, and from conducting research to respecting clients, colleagues, and students.  As the field of psychology has grown in size and scope, the role of ethics has become more important and complex whether the psychologist is involved in teaching, counseling, research, or practice. Now this most widely read and cited ethics text in psychology has been revised to reflect the ethics questions and dilemmas that psychologists encounter in their everyday work. Ethics in Psychology has been completely updated in response to evolving trends in psychological research and practice, as well as extensive changes in the American Psychological Association's ethics code. Gerald P. Koocher and Patricia Keith-Spiegel take a practical, commonsense approach to ethics in modern-day psychological practice, and offer constructive suggestions for both preventing problems and resolving ethical predicaments. In this book, their main intent is to present the full range of contemporary ethical issues in psychology as not only relevant and intriguing, but also as integral and unavoidable aspects of the profession. The authors make extensive use of actual case studies in order to illustrate how the APA guidelines apply to specific situations, such as fee setting, advertising for clients, research ethics, sexual attraction, classroom ethics, managed care issues, confidentiality, and much more. The most recent ethics code of the American Psychological Association (1992) is used here only as a starting point. The authors go well beyond the APA code and incorporate the input of many experts. In addition to the analysis of a wide variety of general situations, new problematic areas are identified and explored. The book includes two appendixes - Ethical Principles of Psychologists and Code of Conduct, adopted by American Psychological Association, Rules and Procedures of the Ethics Committee of the American Psychological Association - both in an easy-to-use format.  In addition, each chapter lists summary guidelines along with current and valuable references. Highly readable, the book unites a straightforward, lively writing style with humorous anecdotes that highlight the human side of ethics and make the book a pleasure to read. Ethics in Psychology will be an indispensable guide to ethical decision-making for all psychologists and students in psychology.",
        "Category": " Psychology , Research & Methodology",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "8.19",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Experiencing the Heart of Jesus: Knowing His Heart, Feeling His Love",
        "Authors": "By Lucado, Max",
        "Description": "The Experiencing the Heart of Jesus Workbook is designed to be a very unique approach to bringing people closer to the very heart and soul of Jesus, and to help them have a more intimate knowledge of how His gospel flows through His relationship with us, and our relationships with others.This book explores the beautiful human qualities of Jesus that we emulate in order to find peace in the midst of chaos.Features Include: 50 Intimate Lessons on the Person of Jesus ChristTen chapters focusing on the key characteristics of JesusFive weekly follow-up lessons that will take you one step closer to JesusSections for journaling throughout",
        "Category": " Religion , Christian Living , General",
        "Publisher": "HarperChristian Resources",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Haunted Wood: Soviet Espionage in America - The Stalin Era",
        "Authors": "By Weinstein, Allen. and Vassiliev, Alexander",
        "Description": "A history of Soviet espionage in the United States draws on previously unavailable information from the KGB archives to discuss Soviet operations in America during the 1930s, World War II, and its aftermath, profiling noted spies and their work. 25,000 first printing. Tour.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Politics of Miscalculation in the Middle East (Arab and Islamic Studies)",
        "Authors": "By Parker, Richard B.",
        "Description": "Why do international crises seem to occur so often in the Middle East? Former U.S. diplomat Richard B. Parker presents three detailed studies of policy failures that he believes were precipitated by miscalculations on the part of diplomats and of government and military leaders in one or more Middle Eastern countries, the United States, and the former USSR. They are the Soviet-Egyptian miscalculation leading to the June 1967 war between Israel and the Arab states, the U.S.-Israeli miscalculation leading to Soviet military intervention in Egypt in 1970, and the U.S.-Israeli miscalculation leading to the disastrous Lebanese-Israeli peace agreement of May 17, 1983.Parker’s many-sided, often gripping account of the way in which these crises unfolded illustrates how the same events can be viewed very differently by the observers and actors involved, and how political decisions can precipitate reactions that are often very different from those anticipated. Although the book highlights the unavoidably uncertain and contingent element in all diplomatic activity, it also shows that careful attention to history, to past performance, and to prevailing mindsets in the countries involved can be invaluable aids in diplomatic crisis management. The many sources assembled and the careful weighing of their accuracy and reliability, along with the combined perspective of the practitioner and the scholar, make this book an important resource for diplomats, policymakers, and students of diplomacy.",
        "Category": " History , World",
        "Publisher": "Indiana University Press",
        "Price Starting With ($)": "9.64",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Price Waterhouse Personal Tax Adviser, 1995-1996",
        "Authors": "By Price Waterhouse LLP",
        "Description": "Explains how to organize one's tax records according to tax laws; answers questions about deductions, tax shelters, itemization, capital gains, and charitable contributions; and suggests tax strategies",
        "Category": " Law , General",
        "Publisher": "Irwin Professional Pub",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "The Broken Window: A Lincoln Rhyme Novel",
        "Authors": "By Deaver, Jeffery",
        "Description": "Bestselling master of suspense Jeffery Deaver is back with a brand-new Lincoln Rhyme thriller.    Lincoln Rhyme and partner/paramour Amelia Sachs return to face a criminal whose ingenious staging of crimes is enabled by a terrifying access to information....   When Lincoln's estranged cousin Arthur Rhyme is arrested on murder charges, the case is perfect -- too perfect. Forensic evidence from Arthur's home is found all over the scene of the crime, and it looks like the fate of Lincoln's relative is sealed.   At the behest of Arthur's wife, Judy, Lincoln grudgingly agrees to investigate the case. Soon Lincoln and Amelia uncover a string of similar murders and rapes with perpetrators claiming innocence and ignorance -- despite ironclad evidence at the scenes of the crime. Rhyme's team realizes this \"perfect\" evidence may actually be the result of masterful identity theft and manipulation.   An information service company -- the huge data miner Strategic Systems Datacorp -- seems to have all the answers but is reluctant to help the police. Still, Rhyme and Sachs and their assembled team begin uncovering a chilling pattern of vicious crimes and coverups, and their investigation points to one master criminal, whom they dub \"522.\"   When \"522\" learns the identities of the crime-fighting team, the hunters become the hunted. Full of Deaver's trademark plot twists, The Broken Window will put the partnership of Lincoln Rhyme and Amelia Sachs to the ultimate test.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Kate's Choice: What Love Can Do ; Gwen's Adventure in the Snow : Three Fire-Side Stories to Warm the Heart",
        "Authors": "By Alcott, Louisa May and Hines, Stephen W.",
        "Description": "",
        "Category": " Juvenile Nonfiction , Study Aids , General",
        "Publisher": "Riveroak Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Dean Acheson: The State Department Years",
        "Authors": "By McLellan, David S.",
        "Description": "",
        "Category": "",
        "Publisher": "Dodd, Mead & Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Church in History",
        "Authors": "By Booty, John E.",
        "Description": "",
        "Category": " Religion , Christianity , History",
        "Publisher": "Seabury Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "Furniture Finishing",
        "Authors": "By Sunset Books",
        "Description": "Discusses tools and materials, explains basic repairs and preparation of projects, and describes special decorative techniques",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Coalitions Building and Maintenance: Gulf War, Kosovo, Afghanistan, War On Terrorism",
        "Authors": "By Georgetown University, Pierre, Andrew J., and American Academy of Diplomacy",
        "Description": "",
        "Category": "",
        "Publisher": "Georgetown University",
        "Price Starting With ($)": "5.95",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Graveyards of the Pacific: From Pearl Harbor to Bikini Island",
        "Authors": "By Ballard, Robert D. and Morgan, Michael Hamilton",
        "Description": "The famed oceanographer and marine explorer offers a richly illustrated underwater tour of World War II Pacific battle sites at Midway, Guadalcanal, Truk Lagoon, Pearl Harbor, and Bikini Island, in a volume that is complemented by firsthand account of Ballard's expeditions, rare archival photographs, and the stories of eyewitnesses to the Pacific conflicts.",
        "Category": " Science , Earth Sciences , Oceanography",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "6.52",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "An Introduction to Civil War Small Arms",
        "Authors": "By Thomas, Dean S. and Coates, Earl J.",
        "Description": "",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Thomas Pubns",
        "Price Starting With ($)": "7.16",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Birth Order Connection: Finding and Keeping the Love of Your Life",
        "Authors": "By Leman, Kevin",
        "Description": "",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Government by the People, Brief Version (7th Edition)",
        "Authors": "By Magleby, David B., O'Brien, David M., Light, Paul Charles, Peltason, J. W., and Cronin, Thomas E.",
        "Description": "\"Discusses the make-up and function of the U.S. system of government. Its primary focus is on the modern political system in the United States. This focus centers on how the federal and state governments are constructed and the comparative political ideologies that influence how those governments operate\"--Provided by publisher.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Plumbing",
        "Authors": "By Books, Time Life",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life+ Books Inc",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Home Improvements Manual: A Do-it-yourself Guide to Renovating, Modernizing, and Adding Space to Your Home (Updated)",
        "Authors": "By Reader's Digest Association",
        "Description": "Provides comprehensive, step-by-step guidance, accompanied by more than two thousand illustrations, in every area of do-it-yourself home improvement, alteration, and renovation--including the construction of major additions",
        "Category": " House & Home , General",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Legally Dead: A Novel",
        "Authors": "By Buchanan, Edna",
        "Description": "U.S. Marshal Michael Venturi of the Witness Protection Program relocates a mobster, now a government witness, to a small rural town after creating a new identity for him. The man proves to be a monster unleashed on an unsuspecting community. The results are tragic. To make amends Venturi leaves the Marshals Service and assembles a team of close confidants to secretly create new identities for innocent men and women whose lives have been ruined through no fault of their own -- people who really deserve fresh starts in new lives. But before they are relocated and reborn, each must change a lifetime of habits and actually become someone else, with new traits, tastes, and personalities.And before being declared \"legally dead\" -- they have to die. The result is a combination of Extreme Makeover, Mission Impossible, and CSI -- the last in reverse. In these \"deaths,\" some of them spectacular, phony forensics must be created to fit the \"facts\" and fool the experts.His fascinating experiment works -- for a time. But as Venturi continues to relocate the deserving, evil begins to stalk Venturi and his legally dead clients.Soon one is dead.Really dead.Are the relentless killers from his own past, or was one of his clients not so innocent after all? His own loved ones are now targets because of his attempts to atone for a tragedy that haunts him.In a desperate race to protect those he has relocated, Venturi must call upon his former training in both the U.S. Marines Force Recon and the Marshals Service, as he is hunted by police, prosecutors, ruthless killers, and his own former federal colleagues.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Buckingham Palace Gardens: A Novel",
        "Authors": "By Perry, Anne",
        "Description": "Anne Perry’s Charlotte and Thomas Pitt mysteries are perhaps the best loved of all her Victorian bestsellers, luring us into the multilayered richness of London, from the great mansions and secluded drawing rooms to the city’s festering slums. Now, in her most mesmerizing novel yet, she invites us to a house-party at Buckingham Palace. The Prince of Wales has asked four wealthy entrepreneurs and their wives to the palace to discuss a fantastic idea: the construction of a six-thousand-mile railroad that would stretch the full length of Africa. But, alas, the prince’s gathering proves disastrous when the mutilated body of a prostitute hired for a late-night frolic (after the wives have retired to bed) turns up among the queen’s monogrammed sheets in a palace linen closet.With great haste, Thomas Pitt, brilliant mainstay of Special Services, is summoned to resolve the crisis. The Pitts’ cockney maid, Gracie, is also recruited–to pose as a palace servant and listen in on the guests’ conversations, scan their bedrooms, and scrutinize their troubled faces for clues to hidden rivalries and attachments that could have lead to murder. If Pitt and Gracie fail to find out who brutally murdered the young woman–as seems increasingly likely–Pitt’s career will be over, and the scandal may just cause the monarchy to fall.With a cast of wonderful characters, among them the gentle Princess of Wales, and a twisting plot that takes us into the hidden world of the royal family, Anne Perry probes deeply the hearts of men and women ensnared by their own emotions. Never has this distinguished novelist told a story with more truth and passion.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Control Trap, The",
        "Authors": "By Sullivan, Barbara A.",
        "Description": "A women's guide to freedom from the need to manage people and circumstances through trusting God's sovereign grace. The results are transforming.",
        "Category": " Religion , Inspirational",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Destination Bride",
        "Authors": "By Light, Lisa",
        "Description": "The author outlines the necessary steps for planning a great wedding, including travel arrangements and coordinating the ceremony, covering specific information about desireable wedding locales. Original.",
        "Category": " Reference , Weddings",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.27",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "D.W. Thinks Big (D. W. Series)",
        "Authors": "By Brown, Marc Tolon",
        "Description": "He's been on the scene in your stores and selling in big numbers for almost twenty-five years: Arthur, the bestselling aardvark. Now his Emmy award-winning, number-one rated children's TV show, Arthur, has catapulted his book sales to new heights. Arthur has sold in the past, continues to sell in record numbers in the present, and Now Little, Brown offers a fantastic promotion to make sure Arthur and D.W. will be star performers this fall and always. The promotion features an eye-catching display, extensive print and television advertising, and lots of prizes for booksellers and customers, too.Arthur's been around for almost twenty-five years, and if he's going anywhere, it's up -- in sales and in the ratings! Stay tuned to Little, Brown for more adventures from loveable Arthur, his sister, D.W., and their pals, for now and always.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Deepest Cut: A Novel (Nan Vining)",
        "Authors": "By Emley, Dianne",
        "Description": "Back from the dead. That’s how it feels for Nan Vining–a Pasadena homicide cop, a struggling single mother, and a woman determined to find the brutal madman who left her for dead a year ago. Now, in Dianne Emley’s brilliant new thriller, Nan Vining must face the truth: her attacker is still out there and he’s killed at least three other women.She has given a name to her unknown assailant: T. B. Mann–The Bad Man. On the job, Nan breaks rules and steals evidence, building a case file based on the dead certainty that T. B. Mann is obsessed with women who wear uniforms or carry guns, that he hunts them and kills them, then adorns them with a pearl necklace. At the crime scene of her official assignment, the murder of an ex-con in a clown suit, Nan spots a graffiti tag and is sure, against all reason, that T. B. Mann was there, too. But she is fearful to share her suspicions.Further complicating matters is Nan’s developing relationship with Detective Jim Kissick. In the grip of her secret obsession, she knows that opening her heart means losing control.Within this sprawling panorama T. B. Mann reemerges, bringing Nan to the sudden, horrifying realization that her killer has baited the perfect trap.Smart and gut-wrenching, deeply felt and passionate, The Deepest Cut startles and astounds from the first page to the last.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Hold Tight",
        "Authors": "By Coben, Harlan",
        "Description": "Tia and Mike Baye never imagined they'd become the type of overprotective parents who spy on their kids. But their sixteen-year-old son Adam has been unusually distant lately, and after the suicide of his classmate Spencer Hill, they can't help but worry. Within days of installing a sophisticated spy program on Adam's computer, they are jolted by a message from an unknown correspondent addressed to their son: \"Just stay quiet and all safe.\"As if Mike Baye isn't dealing with enough, he also learns that Lucas Loriman, the sweet kid who grew up next door, is in urgent need of a kidney transplant. As the boy's doctor, Mike suddenly finds himself in possession of an explosive secret that threatens to rip the Loriman family apart at the seams.Nearby, while browsing through an online memorial for Spencer, Betsy Hill discovers a surprising detail about the night of her son's death. Before she can find out more, Adam disappears, taking the truth with him and sending shock waves through the neighborhood.As the lives of these families collide in tragic, unexpected, and violent ways, long-hidden connections in their small suburb begin to work their way to the surface. And when an unidentified Jane Doe is beaten to death not far away, those connections threaten to turn this quiet community upside down - and force these desperate parents to decide whether there is any line they won't cross to protect those they love most in the world.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Dark Summer",
        "Authors": "By Johansen, Iris",
        "Description": "It begins with a single shot.Devon Brady is a devoted veterinarian working in a makeshift hospital on a remote search and rescue mission. When a man arrives with his wounded black Lab, Ned, she has no idea that she is about to be plunged into a whirlwind of terror and destruction. Jude Marrock is out for revenge and has no choice but to involve Devon in a high-stakes cat-and-mouse game with an escalating body count. She doesn’t trust him one bit, but when the shots start flying and friends start falling, she finds herself with nowhere else to run. And there are innocent lives, both human and animal, at stake, including Ned and his mysterious pack. Is Jude her salvation or her damnation? Are the secrets he’s protecting worth killing for . . . or dying for? With a lightning-fast pace, unforgettable characters, and gut-wrenching action, Dark Summer is compelling new terrain for this master storyteller.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Crazy for Cats",
        "Authors": "By Morris, Barbara Bradlyn",
        "Description": "",
        "Category": "",
        "Publisher": "Gollehon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Lessons of Terror: A History of Warfare Against Civilians: Why It Has Always Failed and Why It Will Fail Again",
        "Authors": "By Carr, Caleb",
        "Description": "In The Lessons of Terror, novelist and military historian Caleb Carr examines terrorism throughout history and the roots of our present crisis and reaches a provocative set of conclusions: the practice of targeting enemy civilians is as old as warfare itself; it has always failed as a military and political tactic; and despite the dramatic increases in its scope and range of weapons, it will continue to fail in the future.International terrorism—the victimization of unarmed civilians in an attempt to affect their support for the government that leads them—is a phrase with which Americans have become all too familiar recently. Yet while at first glance terrorism seems a relatively modern phenomenon, Carr illustrates that it has been a constant of military history. In ancient times, warring armies raped and slaughtered civilians and gratuitously destroyed property, homes, and cities; in the Middle Ages, evangelical Muslims and Christian crusaders spread their faiths by the sword; and in the early modern era, such celebrated kings as Louis XIV revealed a taste for victimizing noncombatants for political purposes.It was during the Civil War that Americans themselves first engaged in “total war,” the most egregious of the many euphemisms for the tactics of terror. Under the leadership of such generals as Stonewall Jackson, the forces of the South tried to systematize this horrifying practice; but it fell to a Union general, William Tecumseh Sherman, to achieve that dubious goal. Carr recounts Sherman’s declaration of war on every man, woman, and child in the South—a policy that he himself knew was badly flawed, had nothing to do with his military successes (indeed, it hampered them), and brought long-term unrest to the American South by giving birth to the Ku Klux Klan.Carr’s exploration of terror reveals its consistently self-defeating nature. Far from prompting submission, Carr argues, terrorism stiffens enemy resolve: for this reason above all, terrorism has never achieved—nor will it ever achieve—long-term success, however physically destructive and psychologically debilitating it may become. With commanding authority and the storyteller’s gift for which he is renowned, Caleb Carr provides a critical historical context for understanding terrorist acts today, arguing that terrorism will be eradicated only when it is perceived as a tactic that brings nothing save defeat to its agents.",
        "Category": " History , Military , United States",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Shade Gardening (Burpee American Gardening Series)",
        "Authors": "By Zeman, Anne M.",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Acceptance",
        "Authors": "By Coll, Susan",
        "Description": "Acceptance is a satire of America's overachievers, a novel set over one year in the college application process, when students and parents surrender their evenings, their weekends, and their sanity to the race for admission. Maya, Taylor, and \"AP\" Harry (so named for all the advanced placement courses under his belt) are high school students in a Washington, D.C. suburb called Verona, each gunning for admission to the most prestigious colleges. Olivia is an overworked admissions officer, under siege from applications and every kind of desperate appeal. The application process threatens to overrun all of their lives, and Acceptance follows each character's struggle for their sanity against the relentless pressure of competition.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Alexandria, VA At Your Fingertips",
        "Authors": "By P.K. Johnson",
        "Description": "",
        "Category": "",
        "Publisher": "Attic Window Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Growing Up in God's Family: Bible Study Guide",
        "Authors": "By Charles R. Swindoll",
        "Description": "",
        "Category": "",
        "Publisher": "Insight for Living",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Scents (Chic Simple Components)",
        "Authors": "By Gross, Kim Johnson, Stone, Jeff, and King, Janine",
        "Description": "Provides an inspirational guide to the aromatic world of potpourri, scented candles, sprays, and essences, as well as a study of the variety of scents--from citrus and spice to floral and woodland--available. 75,000 first printing. $25,000 ad/promo.",
        "Category": " Social Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Extraordinary Women: Fantasies Revealed: 58 Women of Accomplishment Portray Hidden Dreams and Real Hopes",
        "Authors": "By Nicholas, George and Blackmore, Clay (PHT)",
        "Description": "Extraordinary Women is a book about precisely that-extraordinary women, though not in the roles we usually see them. Each of the 58 prominent women in this insightful book was asked what they dreamed of becoming when they were children; they were then photographed in that role. Thus, former secretary of state Madeline Albright can be seen as a chess champion, actress Linda Carter as an Olympic athlete, gymnast Dominic Dawes as a justice of the Supreme Court, feminist Betty Friedan as a mystery writer.",
        "Category": " Photography , Subjects & Themes , Portraits & Selfies",
        "Publisher": "Stewart, Tabori and Chang",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Building a Healthy Lawn: A Safe and Natural Approach",
        "Authors": "By Franklin, Stuart",
        "Description": "Included are chapters on mowing, watering, fertilizing, soil building, equipment selection, seeding, weed control, diseases and insects, ground covers, and mulches.",
        "Category": " Gardening , Techniques",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Bread Machine Baker",
        "Authors": "By Harbison, Elizabeth M.",
        "Description": "Enjoy the tantalizing taste and aroma of homemade bread from your own kitchen with easy bread machine recipes, including:-Sally Lunn Bread-Challah-Chili Corn and Cheese Bread-Brioche-Mint and Yogurt Bread-Oregano Parmesan Cheese Bread-Bagels-Tomato Basil Pizza Dough-Piña Colada BreadAnd much more!",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "SEAPORT SAVORIES A cook's Tour of Historic Alexandria, Virginia",
        "Authors": "By The Twig, The Junior Auxiliary of Alexandria Hospital",
        "Description": "",
        "Category": "",
        "Publisher": "The Twig",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "No Excuse! I'm Doing It",
        "Authors": "By Rifenbary, Jay",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Possibility Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Handbook of Emotionally Intelligent Leadership: Inspiring Others to Achieve Results",
        "Authors": "By Feldman, Daniel A.",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Leadership Performance Solutions pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Performance Consulting (CL)",
        "Authors": "By Robinson, Dana Gaines and Robinson, James C.",
        "Description": "The traditional training process confuses training activity with performance improvement by focusing on employees' learning needs, rather than on their performance needs. Traditional programs focus on developing excellent learning experiences, while failing to ensure that the newly acquired skills are transferred to the job. Thus, to be effective, training professionals must become \"\"performance consultants, \"\" shifting their focus from training delivery to the performance of the company and its individual contributors. Dana & Jim Robinson describe an approach suitable for use in any organizational setting or industry and with any content area. Dozens of useful tools, illustrative exercises, and a case study that threads through the book show how the techniques described are applied in an organizational setting.",
        "Category": " Technology & Engineering , Technical Writing",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Party Animals, Washington, D.C",
        "Authors": "By Gittens, Tony (EDT), Woo, John (EDT), McSweeny, Dorothy (EDT), Stovall, Lou (EDT), and D. C. Commission on the Arts and Humanities (COR)",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Orange Frazer Pr Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "QuIck Guide: Trim: Step-by-Step Installation Techniques (Quick Guide)",
        "Authors": "By Feirer, Mark",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Creative Arts & Crafts",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Chips and Dips",
        "Authors": "By McQuillan, Claudia and McArthur, Pete (PHT)",
        "Description": "What summer barbecue or holiday party would be complete without a flavorful array of chips and dips? From good old-fashioned potato and tortilla chips to zesty garlic bagel chips and spicy Caribbean plantain chips, dunked in salsa or swirled in a creamy dip, they're the snack of choice -- and great appetizers, too! Chips and Dips offers a fabulous variety of dip and chip recipes for every taste and style, from extra-rich and savory to astonishingly low-fat. Inspired by a range of ethnic traditions, the recipes include old and new favorites for bean, vegetable, cheese, and seafood dips as well as peerless complementary chips. Served hot or cold, these irresistible snacks are essential for entertaining, whatever the party season.",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Becoming Vegetarian: The Complete Guide to Adopting a Healthy Vegetarian Diet",
        "Authors": "By Davis, Brenda, Melina, Vesanto, and Harrison, Victoria",
        "Description": "",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Book Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Doing Things: A Guide to Programing Activities for Persons with Alzheimer's Disease and Related Disorders",
        "Authors": "By Zgola, Jitka M.",
        "Description": "Doing Things shows how to provide a positive environment for persons with Alzheimer's disease by offering opportunities for social interaction and constructive, enjoyable activities. Zgola outlines the ways in which a patient's functional impairment can be assessed; the strengths, weaknesses, and needs most commonly encountered among persons with Alzheimer's disease; and ways activities can be tailored to accommodate them. She offers step-by-step instructions for selecting and presenting appropriate activities and includes cooking and crafts projects, a sample exercise routine, and a sample daily schedule. The techniques she describes are designed to promote a sense of security and self-esteem, by avoiding possible sources of confusion or confrontation.Based on the highly successful program developed at one day-care facility for persons with dementia, Doing Things offers an invaluable guide for professionals and volunteers supervising activities at day-care centers and extended-care facilities—as well as for individuals who are caring for patients at home. Throughout, Zgola's emphasis is on treating persons who have Alzheimer's disease with empathy, courtesy, and dignity.",
        "Category": " Medical , Geriatrics",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Dear Silver (Palisades Pure Romance)",
        "Authors": "By McCourtney, Lorena",
        "Description": "When Silver receives an icy letter ending her relationship with Chris Bentley, she is shocked-mainly because she doesn't know the man! Wanting to alert him to his mistake, she responds to the letter-but their meeting turns fiery when she berates Chris for the insensitive way he handled their \"break-up.\"",
        "Category": " Fiction , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Lessons Learned the Hard Way",
        "Authors": "By Gingrich, Newt",
        "Description": "The powerful and controversial Speaker of the House discusses the principles and ideas that have shaped his life, both personal and political, and shares the lessons he has learned during his career. 250,000 first printing. $350,000 ad/promo.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Life's a Campaign: What Politics Has Taught Me About Friendship, Rivalry, Reputation, and Success",
        "Authors": "By Matthews, Chris",
        "Description": "Chris Matthews is like no other TV interviewer. Life’s a Campaign is like no other book on success. Famous for demanding the truth from his Hardball guests, Chris Matthews now reveals what the people running this country rarely confess: the secrets of how they got to the top. Here is the first book on power with insight snatched from those who wield it. Life’s a Campaign exposes the tactics, tricks, and truths that help people get ahead–and can help you, too, whatever your field of ambition.Written in the assertive, good-natured style that is Matthews’s trademark, Life’s a Campaign is the most useful kind of investigative reporting. You’ll benefit from his insider’s scrutiny of the Congress, the White House, and the national news media. Here are the methods, showcased in fascinating anecdotes and case histories, that presidents, senators, and other powerful people use to persuade others and win–and the life lessons they provide for the rest of us.You’ll learn about Bill Clinton’s laser-focused ability to listen to those he wants to seduce–and how he’s been teaching that craft to his wife, Hillary; how Ronald Reagan employed his basic optimism to win history to his side; the simple steps in human diplomacy that the first President Bush exploited to assemble a worldwide posse to attack Saddam Hussein and gain global approval in a way his son has failed to do; how Nancy Pelosi became the first woman Speaker of the House by practicing the most fundamental of human qualities: hardnosed loyalty. You’ll also find out, for the first time, about Matthews’s own wild ride through the turbulent, converging rapids of politics and journalism. The big payoff in Life’s a Campaign is what you’ll learn about human nature:• People would rather be listened to than listen.• People don’t mind being used; what they mind is being discarded. • People are more loyal to the people they’ve helped than the people they’ve helped are loyal to them.• Not everyone’s going to like you. • No matter what anybody says, nobody wants a level playing field. Knowing such truths is the successful person’s number one advantage in life. As you’ll learn in Life’s a Campaign, mastering–and employing–these truths separates the leaders from the followers.",
        "Category": " Political Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Carpenter's Cloth: Christ's Journey to the Cross and Beyond",
        "Authors": "By Brouwer, Sigmund",
        "Description": "Exquisitely designed in full color and illustrated with classical art, this narrative of \"Christ's Journey to the Cross and Beyond\" is true to Scripture and to historical facts. At the same time,The Carpenter's Cloth enables you to see these events with new eyes as you \"journey with the man who accepted death on a cross for all of us.\"",
        "Category": " Religion , Biblical Commentary , New Testament",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "War on Terror: Unfolding Bible Prophecy",
        "Authors": "By Jeffrey, Grant R.",
        "Description": "The World Changed Forever on September 11, 2001Best-selling author Grant R. Jeffrey explores the motives and plans of the Islamic terrorists that declared war on America. War on Terror examines the truth “behind the headlines” about this vital struggle that affects all of us. Learn how the American-led alliance will use our powerful intelligence and military forces to destroy the thousands of terrorists as well as the governments of Iraq, Sudan, and Yemen that support terrorism.Key features include:·Compelling evidence Iraq is behind Bin Laden’s attacks on America·The war on terror against Iraq was prophesied by Jeremiah 2500 years ago·The nations that support Islamic terror·Why Islamic terrorists hate America, Israel, and Arab governments·How America will defeat the global threat from Islamic terrorists·The Taliban–the Pashtun tribe and the Ten Lost Tribes·Terror attacks on Israel–America’s key strategic ally in the Middle East·Russia’s Strategic Goal–to turn the coalition against Israel·New surveillance and counter-terrorism technology and world government·The need for security versus our privacy and freedom",
        "Category": " Religion , Biblical Studies , Prophecy",
        "Publisher": "WaterBrook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Secret in the Woods (Young Mandie Mystery Series #5)",
        "Authors": "By Leppard, Lois Gladys",
        "Description": "Some mysteries are better left alone. That’s what Mandie’s best friend, Joe, says when strange things begin happening in the woods that surround their homes. Unexplained noises, spooky shadows, and weird voices all convince Joe that they should stay away. But Mandie won’t have any of that! She declares there’s no mystery too scary to solve. At least, there hasn’t been until now. . . .",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Jess (American Girl Today)",
        "Authors": "By Casanova, Mary and Papp, Robert (ILT)",
        "Description": "When ten-year-old Jess McConnell meets a new friend on her trip to the ancient Maya ruins in Belize, she is invited on an eco-adventure and makes some real discoveries--about the dangers in the Belizean jungle, about the people who have lived there since long ago, and about herself.When ten-year-old Jess McConnell meets a new friend on her trip to the ancient Maya ruins in Belize, she is invited on an eco-adventure and makes some real discoveries--about the dangers in the Belizean jungle, about the people who have lived there sincelong ago, and about herself.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Amer Girl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Second-Grade Star",
        "Authors": "By Alberts, Nancy and Ribes, Fredericka (ILT)",
        "Description": "Dreaming of becoming a star at the forthcoming Spring concert, Kelly copes with disappointment and jealousy when her friends land important parts and she is assigned to folding programs, until she learns how to shine brightly on her own. Original.",
        "Category": "",
        "Publisher": "Little Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Aging and Mental Health: Positive Psychological and Biomedical Approaches",
        "Authors": "By Butler, Robert N., Lewis, Myrna I., and Sunderland, Trey",
        "Description": "Thorough coverage of the nature and problems of old age healthy, successful old age; common emotional problems; psychiatric disorders; organic mental disorders; special concerns in connection with race and ethnicity, gender issues, crime, alcoholism, deafness, blindness, and sexuality and evaluation, treatment, and prevention. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Merrill Pub Co",
        "Price Starting With ($)": "6.52",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Cat's Cradle",
        "Authors": "By Curzon, Clare",
        "Description": "When the local outcast of Thames Valley is found shot to death, Detective-Superintendent Mike Yeadings investigates the old woman's murder and quickly comes up with a long list of suspects. By the author of The Blue-Eyed Boy.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Common Sense and Other Writings (Barnes & Noble Classics Series)",
        "Authors": "By Paine, Thomas and Appleby, Joyce (INT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LDIV&&R&&LI&&RCommon Sense and Other Writings&&L/I&&R, by &&LB&&RThomas Paine&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&RThough he did not emigrate from England to the American colonies until 1774, just a few months before the Revolutionary War began, &&LB&&RThomas Paine&&L/B&&R had an enormous impact on that war and the new nation that emerged from it. &&LI&&RCommon Sense&&L/I&&R, the instantly popular pamphlet he published in January 1776, argued that the goal of the struggle against the British should be not simply tax reform, as many were calling for, but complete independence. His rousing, radical voice was balanced by the equally independence-minded but more measured tones of Thomas Jefferson, who wrote the Declaration of Independence later that year.&&LBR&&R&&LBR&&RIn later works, such as &&LI&&RThe Rights of Man&&L/I&&R, &&LI&&RThe Age of Reason&&L/I&&R, and other selections included in this volume, Paine proved himself a visionary moralist centuries ahead of his time. He believed that every human has the natural right to life’s necessities and that government’s role should be to provide for those in dire need. An impassioned opponent of all forms of slavery, he understood that no one in poverty is truly free, a lesson still to be learned by many of our leaders today.&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&R&&LDIV&&R&&LB&&RJoyce Appleby&&L/B&&R, Professor Emerita at the University of California, Los Angeles, has followed the trajectory of American nation-building in her books &&LI&&RCapitalism and a New Social Order: The Republican Vision of the 1790s&&L/I&&R, &&LI&&RInheriting the Revolution: The First Generation of Americans&&L/I&&R, &&LI&&RThomas Jefferson&&L/I&&R, and &&LI&&RA Restless Past: History and the American Public&&L/I&&R. &&L/DIV&&R&&L/DIV&&R&&L/DIV&&R",
        "Category": " Political Science , Political Ideologies , Democracy",
        "Publisher": "Barnes & Noble Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Woe Is I: The Grammarphobe's Guide to Better English in Plain English, Second Edition",
        "Authors": "By O'Conner, Patricia T.",
        "Description": "An expanded edition of the best-selling guide to English grammar and usage encompasses the latest updates to the English language, providing straightforward coverage of common mistakes and usage errors while offering a new chapter on Internet and e-mail language. Reprint.",
        "Category": " Language Arts & Disciplines , Grammar & Punctuation",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "War and Decision: Inside the Pentagon at the Dawn of the War on Terrorism",
        "Authors": "By Feith, Douglas J.",
        "Description": "In the years since the attacks of September 11, 2001, journalists, commentators, and others have published accounts of the Bush Administration's war on terrorism. But no senior Pentagon official has offered an inside view of those years, or has challenged the prevailing narrative of that war—until now.   Douglas J. Feith, the head of the Pentagon's Policy organization, was a key member of Donald Rumsfeld's inner circle as the Administration weighed how to protect the nation from another 9/11. In War and Decision, he puts readers in the room with President Bush, Vice President Cheney, Rumsfeld, Paul Wolfowitz, Condoleezza Rice, Colin Powell, General Tommy Franks, and other key players as the Administration devised its strategy and war plans. Drawing on thousands of previously undisclosed documents, notes, and other written sources, Feith details how the Administration launched a global effort to attack and disrupt terrorist networks; how it decided to overthrow the Saddam Hussein regime; how it came to impose an occupation on Iraq even though it had avoided one in Afghanistan; how some officials postponed or impeded important early steps that could have averted major problems in Iraq's post-Saddam period; and how the Administration's errors in war-related communications undermined the nation's credibility and put U.S. war efforts at risk.   Even close followers of reporting on the Iraq war will be surprised at the new information Feith provides—presented here with balance and rigorous attention to detail. Among other revelations, War and Decision demonstrates that the most far-reaching warning of danger in Iraq was produced not by State or by the CIA, but by the Pentagon. It reveals the actual story behind the allegations that the Pentagon wanted to \"anoint\" Ahmad Chalabi as ruler of Iraq, and what really happened when the Pentagon challenged the CIA's work on the Iraq?al Qaida relationship. It offers the first accurate account of Iraq postwar planning—a topic widely misreported to date. And it presents surprising new portraits of Rumsfeld, Rice, Powell, Richard Armitage, L. Paul Bremer, and others—revealing how differences among them shaped U.S. policy.   With its blend of vivid narrative, frank analysis, and elegant writing, War and Decision is like no other book on the Iraq war. It will interest those who have been troubled by conflicting accounts of the planning of the war, frustrated by the lack of firsthand insight into the decision-making process, or skeptical of conventional wisdom about Operation Iraqi Freedom and the global war on terrorism—efforts the author continues to support.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Harper",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "101 Questions Your Cat Would Ask Its Vet If Your Cat Could Talk",
        "Authors": "By Fogle, Bruce and Ward, Lalla (ILT)",
        "Description": "",
        "Category": " Pets , Birds",
        "Publisher": "Castle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Heirloom Gardener",
        "Authors": "By Jabs, Carolyn",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Sierra Club Books",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Accidental Happiness: A Novel",
        "Authors": "By Page, Jean Reynolds",
        "Description": "Someone once told me that groupings of objects should be displayed in threes. Three provides both tension and balance among items of varying size and heft. My sister’s accident made me an only child; my husband’s accident made me a widow. Part of me will always believe that Angel was the third, the one that left me with hope.After her husband’s unexpected death at the age of thirty-six, Gina Melrose becomes a “live-aboard” on his boat, docked at a marina in coastal South Carolina, near the home she and Ben once shared. In this temporary, borrowed existence on the water, she settles into numb survival. But Gina finds her life taking yet another dramatic turn late one night when a woman named Reese disrupts her quiet world. With Reese comes a daughter: a charming girl named Angel.After a rough start, Gina realizes that, strange as it may seem, she’s drawn to both Reese and Angel. Their sudden appearance shatters the stillness–and Gina is remade. She is fascinated by Reese, who seems both invincible and vulnerable–and whose past may hold the key to Gina’s future. Gina begins to realize that for the first time since Ben’s death, she’s getting her senses back. As both pain and joy reenter her world, Gina discovers that she is able to accept feeling in order to live fully once more.But the biggest surprise for Gina is her relationship with Angel. After the painful loss of her sister during childhood, Gina had decided that she would never have children of her own. Struggling through conflicted emotions, Gina’s finds her life unexpectedly transformed by the precocious little girl who may be Ben’s daughter. This tender, poignant novel movingly explores the bonds of family and the resilience of hope. In the accomplished tradition of the novels of Elizabeth Berg and Anita Shreve, Jean Reynolds Page’s Accidental Happinessis a lyrical, enthralling drama unafraid to examine complex relationships with a clear eye and an honest heart.From the Hardcover edition.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Napa Valley Winery Guide Rev",
        "Authors": "By Allegra, Antonia and Gillette, Richard (PHT)",
        "Description": "A guide to the wineries of the Napa Valley briefly describes wine making and local history, features winery tours, and provides detailed descriptions of selected wineries",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Passion Of Christ",
        "Authors": "By Erika Swanson Geiss",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "I Love My Daddy",
        "Authors": "By Braun, Sebastien",
        "Description": "Sometimes daddies are loud and playful. Other times they are quiet and compassionate. And they are always loving. Sebastien Braun's appealing text and charming illustrations follow a day in the life of a bear and his bear cub in this celebration of the bond between father and child.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Practical home decorating: curtains & shades (vol. 1) (Reader's Digest - Practical Home Decorating)",
        "Authors": "By Paine, Melanie and Crockett, Michael (PHT)",
        "Description": "Guides the amateur decorator through various techniques for creating simple and sophisticated window treatments, from evaluating a window for appropriate curtains or shades, to choosing the right colors, patterns, pleatings, valances, and embellishments.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Crafts to Decorate Your Home",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "We Remember: Women Born at the Turn of the Century Tell the Stories of Their Lives in Words and Pictures",
        "Authors": "By Laskas, Jeanne Marie and Johnson, Lynn (PHT)",
        "Description": "Twenty-four women born in 1900 reflect on a century of social and political changes, discussing the triumphs of family and career, struggles with discrimination, and the heartbreaks of losing spouses to war and death camps.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Deck Planner: 25 Outstanding Decks You Can Build",
        "Authors": "By Home Planners, Inc.",
        "Description": "",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Home Planners",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Do-It-Yourself Fabric Decor : Pillows, Window Treatments, and Slipcovers for Your Home",
        "Authors": "By Creative Publishing International (EDT)",
        "Description": "",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Quick Guide: Wiring: Step-by-Step Repair Procedures",
        "Authors": "By Editors of Creative Homeowner",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Creative Arts & Crafts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Will Rogers' World",
        "Authors": "By Rogers, Will, Sterling, Bryan B., and Sterling, Frances N.",
        "Description": "A collection of humorous writings by a foremost American wit attests to his wide-ranging areas of comedic concern",
        "Category": " Literary Collections , Essays",
        "Publisher": "M. Evans and Company, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Forever Dad; Inspiring Words on Fatherhood",
        "Authors": "By Editor-Sean Keogh",
        "Description": "",
        "Category": "",
        "Publisher": "Tangent Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Abriendo paso: Lectura",
        "Authors": "By Diaz, Jose M. and Collins, Stephen J.",
        "Description": "",
        "Category": "",
        "Publisher": "Heinle & Heinle Pub",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "An Anchor for the Soul: Help for the Present, Hope for the Future",
        "Authors": "By Pritchard, Ray",
        "Description": "People have honest doubts and questions about God that deserve solid  answers. How do we explain the Gospel of Jesus Christ in a way we can all understand?  Ray Pritchard has updated this best-selling presentation of the gospel in a clear,  straightforward way using simple language and clear Scripture references.An  Anchor for the Soul is written with doubters, seekers, and skeptics in mind.  In a clear, straightforward presentation, he answers questions such as: What is  God like? How can I know Him? Who is Jesus and what did He do? What does it mean  to be a Christian? Through stories and illustrations, Pastor Pritchard very personally,  yet gently, challenges his readers with the Good News of Jesus Christ.",
        "Category": " Religion , Christian Ministry , Evangelism",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Birds Without Wings",
        "Authors": "By De Bernieres, Louis",
        "Description": "In his first novel since Corelli’s Mandolin, Louis de Bernières creates a world, populates it with characters as real as our best friends, and launches it into the maelstrom of twentieth-century history. The setting is a small village in southwestern Anatolia in the waning years of the Ottoman Empire. Everyone there speaks Turkish, though they write it in Greek letters. It’s a place that has room for a professional blasphemer; where a brokenhearted aga finds solace in the arms of a Circassian courtesan who isn’t Circassian at all; where a beautiful Christian girl named Philothei is engaged to a Muslim boy named Ibrahim. But all of this will change when Turkey enters the modern world. Epic in sweep, intoxicating in its sensual detail, Birds Without Wings is an enchantment.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Brief Wondrous Life of Oscar Wao",
        "Authors": "By Diaz, Junot",
        "Description": "Winner of: The Pulitzer Prize The National Book Critics Circle Award The Anisfield-Wolf Book Award The Jon Sargent, Sr. First Novel Prize A Time Magazine #1 Fiction Book of the Year One of the best books of 2007 according to: The New York Times, San Francisco Chronicle, New York Magazine, Entertainment Weekly, The Boston Globe, Los Angeles Times, The Washington Post, People, The Village Voice, Time Out New York, Salon, Baltimore City Paper, The Christian Science Monitor, Booklist, Library Journal, Publishers Weekly, New York Public Library, and many more... Nominated as one of America’s best-loved novels by PBS’s The Great American ReadOscar is a sweet but disastrously overweight ghetto nerd who—from the New Jersey home he shares with his old world mother and rebellious sister—dreams of becoming the Dominican J.R.R. Tolkien and, most of all, finding love. But Oscar may never get what he wants. Blame the fukú—a curse that has haunted Oscar’s family for generations, following them on their epic journey from Santo Domingo to the USA. Encapsulating Dominican-American history, The Brief Wondrous Life of Oscar Wao opens our eyes to an astonishing vision of the contemporary American experience and explores the endless human capacity to persevere—and risk it all—in the name of love.",
        "Category": " Fiction , Cultural Heritage",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Secret Warriors (Men at War, 2)",
        "Authors": "By Griffin, W. E. B.",
        "Description": "Washington D.C., 1942. With the help of Charles A. Lindbergh, ace OSS pilot Richard Canidy sets up an air maneuver that will drop agents into the Belgian Congo to smuggle out uranium ore essential to the arms race. But this time, Canidy is not in the saddle; he's the backup pilot.  And though he's not used to waiting for something to go wrong, he knows that it will...",
        "Category": " Fiction , Historical",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Book of Guys Cassette: Stories",
        "Authors": "By Keillor, Garrison and Keillor, Garrison (NRT)",
        "Description": "Unabridged selections from a humorous, poignant, and witty collection of short stories tackle the intriguing subject of the American guy. Read by Garrison Keillor. Book available.",
        "Category": " Humor , General",
        "Publisher": "HighBridge Audio",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Shadow Bear",
        "Authors": "By Cassie Edwards",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Edge of Winter",
        "Authors": "By Rice, Luanne",
        "Description": "Neve Halloran and her daughter have shared a fierce love for the austere beauty of Rhode Island’s South County ever since Neve guided Mickey’s first baby steps along the sandy shore.  Now, with Mickey a teenager and Neve’s last hope for happiness with her daughter’s loving but unstable father gone, both will struggle to make a new life together amid the windswept landscape that sustains them.  Captivated by a fragile wildlife sanctuary, Mickey will move toward womanhood in the company of a lonely boy who shares her instinctive way with the creatures of the coast. And Neve will find herself drawn to a man who has devoted his life to the sanctuary, but who is unable to share the pain of a recent loss—or reconnect with the father who still bears the scars of World War II.As winter gives way to spring, and spring to summer, a secret will emerge that has lain buried in the depths just offshore for decades, a secret that will galvanize the small seaside community. For the waters bear their own vestige of the past—and their ceaseless rhythms may point the way to hope and new beginnings.  Lyrical, luminous, and utterly captivating, The Edge of Winter is Luanne Rice at her most penetrating and insightful, in a moving exploration of the bonds that shape us and set us free.",
        "Category": " Fiction , Sagas",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Hawke's Cove",
        "Authors": "By Wilson, Susan",
        "Description": "After the death of her first child, Evangeline Worth returns to her grandmother's home to await the return of her husband from World War II, but news that John is MIA and the arrival of a handsome stranger will complicate the simple life she has fashioned for herself",
        "Category": " Fiction , Romance , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "A Much Married Man: A Novel (Thomas Dunne Books)",
        "Authors": "By Coleridge, Nicholas",
        "Description": "From one of the sharpest observers of the modern scene comes this witty, intelligent, and irresistible novel in the tradition of Gosford Park and Snobs.  Anthony Anscombe has everything he could ever want: an exquisite family estate, enviable social standing, and a desirable inheritance. But Anthony still has an aching desire for one thing: the perfect match. Running headlong into marriage is Anthony's forte . . . and his greatest weakness. As he surveys his beautiful house in the English countryside, Anthony has the distinct feeling that he's under siege. He may be surrounded by his sprawling estate, but lurking in the village are more than one or two reminders of his complicated past, including three ex-wives, a mistress, and a legion of children and stepchildren, all dependent on him and all determined to do whatever it takes to get what they want.A Much Married Man is a wickedly funny social satire with characters that will stay with readers long after the final page. Like a modern-day Edith Wharton or Anthony Trollope, Nicholas Coleridge delivers a sensational glimpse inside the salacious world of the upper classes.",
        "Category": " Fiction , Literary",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Hannah Montana #6: Crush-Tastic! (Hannah Montana Junior Novel, 6)",
        "Authors": "By Beechwood, Beth (ADP)",
        "Description": "Series Description:Miley Stewart looks like a regular girl-next-door, but she’s got a big secret. When the lights go down, Miley is the famous teen pop sensation Hannah Montana! Miley may be a celebrity when she’s on stage, but she wants the rest of her life to be as normal as possible. The only people who know the truth about Miley’s dual identity are her father, brother, and best friends Lilly and Oliver. But keeping that secret?and balancing school and homework with her newfound fame and fortune?is harder than Miley ever thought it would be.  Book description:Miley just can’t get her mind off cutie Jake Ryan, but should she tell him how she feels? Then, Miley ends up confessing her love for Jake on a home movie that her Aunt Dolly is making, and the tape ends up in Jake’s hands by mistake! Will Aunt Dolly she be able to help Miley get the tape back before her secret is revealed? Plus, Miley gets more than she bargained for when she tries out for cheerleading!",
        "Category": " Juvenile Fiction , Social Themes , Dating & Relationships",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "2,001 Amazing Cleaning Secrets",
        "Authors": "By Bredenberg, Jeff",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Essential Abraham Lincoln",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Value Proprietary",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Something Rotten (Thursday Next Novels)",
        "Authors": "By Fforde, Jasper",
        "Description": "The fourth installment in Jasper Fforde’s New York Times bestselling series follows literary detective Thursday Next on another adventure in her alternate reality of literature-obsessed England—from the author of Early RiserThe popularity of Jasper Fforde’s one-of-a-kind series of genre-bending blend of crime fiction, fantasy, and top-drawer literary entertainment builds with each new book. Now in the fourth installment, the resourceful literary detective Thursday Next returns to Swindon from the BookWorld accompanied by her son Friday and none other than the dithering Hamlet. But returning to SpecOps is no snap—as outlaw fictioner Yorrick Kaine plots for absolute power, the return of Swindon’s patron saint foretells doom, and, if that isn’t bad enough, The Merry Wives of Windsor is becoming entangled with Hamlet. Can Thursday find a Shakespeare clone to stop this hostile takeover? Can she vanquish Kaine and prevent the world from plunging into war? And will she ever find reliable child care? Find out in this totally original, action-packed romp, sure to be another escapist thrill for Jasper Fforde’s legions of fans.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Power of a Praying® Parent",
        "Authors": "By Omartian, Stormie",
        "Description": "",
        "Category": " Religion , Prayer",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "A Pocket Guide to Writing in History",
        "Authors": "By Rampolla, Mary Lynn",
        "Description": "Its concise yet comprehensive coverage of every step of the research and writing process--with detailed advice on documenting sources and avoiding plagiarism -- have madeA Pocket Guide to Writing in History a best-seller over four editions. For the fifth edition, Mary Lynn Rampolla -- who is active in the fields of both history and composition -- provides more practical help with basic skills and new coverage of more sophisticated critical-thinking skills such as analyzing an assignment, reading critically, and constructing a strong argument. Organizational changes over several chapters make it even easier for students at all levels to find the information they need to succeed in their course, saving instructors valuable class time.",
        "Category": " Literary Criticism , Reference",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Biggest Book of Soups & Stews (Better Homes and Gardens Cooking)",
        "Authors": "By McConnell, Shelli (EDT)",
        "Description": "More than 350 recipes for all seasons and reasons: casual or elegant, fast or slow-crafted, as a starter or a hearty meal.The best ragus, stews, chilis, chowders, chilled soups, bisques, and more.Super-fast soups, ready to serve in less than 30 minutes.2 bonus chapters: Simmering Slow Cooker Recipes and Serve-along Breads and Salads.Make-ahead suggestions for soups that freeze and reheat well.More than 50 beautiful full-color photos.Prep and cook times and nutrition information with every recipe. Popular lay-flat binding for easy reference while cooking.",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Better Homes & Gardens",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Transcendental Meditation TM Book : How to Enjoy the Rest of Your Life",
        "Authors": "By Denniston, Denise",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Fairfield Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2013"
        }
    },
    {
        "Title": "California (Eyewitness Travel Guides)",
        "Authors": "By Begley, Slaney (EDT), Leveque, Joanne (EDT), and Ross, Zoe (EDT)",
        "Description": "DK Eyewitness Travel's full-color guidebooks to hundreds of destinations around the world truly show you what others only tell you. They have become renowned for their visual excellence, which includes unparalleled photography, 3-D mapping, and specially commissioned cutaway illustrations. DK Eyewitness Travel Guides are the only guides that work equally well for inspiration, as a planning tool, a practical resource while traveling, and a keepsake following any trip.Each guide is packed with the up-to-date, reliable destination information every traveler needs, including extensive hotel and restaurant listings, themed itineraries, lush photography, and numerous maps.",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Smoky the Cowhorse",
        "Authors": "By James, Will",
        "Description": "",
        "Category": "",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "879.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1926"
        }
    },
    {
        "Title": "New York (Eyewitness Travel Guides)",
        "Authors": "By Berman, Eleanor",
        "Description": "Describes points of interest in each section of the city, provides floor plans of public buildings and landmarks, and recommends hotels, restaurants, and shopping areas.",
        "Category": " Travel , General",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Southern Living: 30 Years of Our Best Recipes",
        "Authors": "By Gunter, Julie Fisher (EDT) and Gunderson, Mary (EDT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Five lilies of France",
        "Authors": "By Du Vivier, Paul F",
        "Description": "",
        "Category": "",
        "Publisher": "s.n",
        "Price Starting With ($)": "6.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "God's Little Instruction Book II: More Inspirational Wisdom on How to Live a Happy and Fulfilled Life",
        "Authors": "By Honor Books",
        "Description": "",
        "Category": "",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Titanic: Destination Disaster",
        "Authors": "By Eaton, John P. and Haas, Charles A.",
        "Description": "No other ship, nor maritime tragedy, holds more fascination than the Titanic - at the time of her launch, the world's largest moving man-made object. Over eighty years after the most famous sinking of all time, two of the world's foremost authorities present this popular account of the sea's best-known disaster.Myth and legend have long been part of the story. The authors explore many of the misconceptions that have developed over the years concerning the ship, the people and the sinking, and give the most likely explanations based on present-day research and knowledge.The whole story is expertly summarized - from building and launching, to a fascinating account of the remarkable discovery of the wreck, two-and-a-half miles down, by unmanned submersible. New to this edition is coverage of the subsequent crewed dives including the authors' own photographic visit to the site, and the artifact recovery expeditions. It all adds up to a book that will appeal to general reader and dedicated Titanic expert alike.",
        "Category": " History , Modern , 20th Century",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Small Renaissance bronzes (Cameo)",
        "Authors": "By Dupre, Maria Grazia Ciardi",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn",
        "Price Starting With ($)": "4.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "What Went Wrong with America... and How to Fix It: Reclaiming the Power That Rightfully Belongs to You",
        "Authors": "By Ankarlo, Darrell and Beck, Glenn (FRW)",
        "Description": "In What Went Wrong with America...And How to Fix It, radio host Darrell Ankarlo identifies the key elements of how our society is rotting from within, mostly due to an uninformed and uninvolved citizenry. Providing inspiration from the Founding Fathers and modern American movements, he shows how he has used the platform of his radio show to inform his listeners and encourage them to get involved in their communities. In order to encourage citizens to use the power they already have, he provides a practical road map for ordinary Americans to follow in making their voices heard. He equips readers to change the pattern of disengagement by utilizing broadcast and print media to spread their messages, organize rallies and protests, to engage in effective letter-writing and e-mail campaigns to rally support for their ideas, even to the point of running for elected office if necessary. Find out how one talk-radio host who loves his country and its troops organized a massive demonstration of support for the American military and sparked a nationwide movement of pro-American, pro-troop rallies. These achievements were accomplished by average Americans who took the time to make a difference. What Went Wrong with America ... And How to Fix It provides the tools necessary for anyone who cares about the future of the nation and wants to make a big difference on the local, state, and national level.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Cumberland House Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Official Price Guide to Collectibles of the '50s & '60s",
        "Authors": "By Jordan, Charles J.",
        "Description": "Lists the current value of art, pottery, Avon containers, furniture, advertisements, books, magazines, comics, dolls, toys, records, baseball cards, and memorabilia",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "House of Collectibles",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Disney: Winnie the Pooh's: Rainy-Day Activities",
        "Authors": "By Hopler, Sharee and Stanton, Brian (ILT)",
        "Description": "Winnie the Pooh and his friends can transform a dreary day into a fun-filled day in this delightful volume that features sixteen craft projects that are accompanied by simple instructions, full-color photographs, a page of stickers, and excerpts from classic Winnie the Pooh stories.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    }
]