[
    {
        "Title": "Holiday in Stone Creek: An Anthology (A Stone Creek Novel)",
        "Authors": "By Miller, Linda Lael",
        "Description": "A Stone Creek ChristmasStone Creek veterinarian Olivia O&#39;Ballivan communicates easily with animals, but men are another story. Especially rugged architect-turned-rancher Tanner Quinn. Olivia&#39;s uncanny bond with his daughter Sophie&#39;s pony has him questioning her sanity, while she wonders if he&#39;s not just a drugstore cowboy. Then twelve-year-old Sophie conspires with Olivia to get Tanner into the spirit of Christmas. But will a holiday miracle transform the globe-trotting Tanner into a rancher&#151;and family man&#151;for all seasons?At Home In Stone CreekEveryone in Ashley O&#39;Ballivan&#39;s life is marrying and starting families&#151;except her. But why bother dating when no one can compare to Jack McCall, the man who left her heartbroken years ago? Now he&#39;s back in town &#151;and maybe he isn&#39;t who she thinks he is.While recovering from a dangerous mission for the DEA, security expert Jack rents a room in Ashley&#39;s bed-and-breakfast. For both their sakes, he tries to keep his distance, though neither can deny the growing spark between them. But when his past catches up with him, he&#39;ll have to leave again&#133;just as he realizes where he&#39;s always belonged&#151;in Stone Creek.",
        "Category": " Fiction , Romance , Western",
        "Publisher": "HQN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Secrets of Bella Terra: A Scarlet Deception Novel",
        "Authors": "By Dodd, Christina",
        "Description": "Brooding and sexy Rafe Di Luca has returned to his family's luxurious vineyard resort for one reason: to find out who attacked his beloved grandmother. His homecoming stirs up a decades-old feud, forcing him to work with Brooke Petersson, the woman he once seduced and betrayed...but never forgot.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "Stronger Than Pain: Indescribable Pain, Multiple Surgeries, Repeated Setbacks: Is God Able?",
        "Authors": "By Kauffman, Arlene and Yoder, Lori",
        "Description": "This is the story of one woman's triumph over indescribable pain, multiple surgeries, and multiple setbacks. Her hospital experiences were in a number of the leading universities of the eastern United States. Names were changed to protect doctors and universities. Arlene's illness was regarded by the medical profession as extremely rare. Highly respected doctors were frustrated in their inability to find answers to this highly unusual case. In the end, there were few satisfactory answers. Through the years of physical pain and disability, I have prayed many times that God would use me in His service and that He would create in me a heart like Jesus.\u009d Arlene Kauffman uttered these words, which were put into the forward of her book. Arlene Kauffman knew pain like most of us can only imagine. Her resolute faith and trust in God to the end is both remarkable and exemplary. This is a wonderful faith-building book that is difficult to lay aside.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Vision Publishers LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "A Field Guide to Coral Reefs of the Caribbean and Florida Including Bermuda and the Bahamas (The Peterson Field Guide Series)",
        "Authors": "By Kaplan, Eugene",
        "Description": "Depicts the ecology and formation of coral reefs and describes the various animals that inhabit the reefs of southern Florida and the Caribbean",
        "Category": " Nature , Marine Life",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "Modern Management - Custom Edition for UMUC (BMGT 364) (Concepts and skills)",
        "Authors": "By Certo",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Custom Learning Soluti",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Code Word: Geronimo",
        "Authors": "By Dye, Dale, Dye, Julia, and Kissell, Gerry (ILT)",
        "Description": "The leader of SEAL Team 6 uttered, \"Geronimo\", and the world let out a sigh of relief. The symbol of ultimate evil was no more. \"Code Word: Geronimo\" is the amazing, moment-by-moment story of the clandestine raid on Osama bin Laden's compound in Abbottabad, Pakistan. Told by military insider and Hollywood consultant, Captain Dale Dye (USMC, Ret.), with Dr. Julia Dye, Ph.D., this historic tribute details the bravery and valor of SEAL Team 6 as it descends into a foreign land and achieves the near impossible.",
        "Category": " Comics & Graphic Novels , Nonfiction , General",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "Pyramid (EXPERIENCE)",
        "Authors": "By Chrisp, Peter",
        "Description": "Presents the history of Egypt's pyramids, detailing how and why Khufu's Great Pyramid was designed and built at Giza, and tells how and when the pyramids were excavated.",
        "Category": " Juvenile Nonfiction , History , Ancient",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Required Reading Remixed Volume 3: Featuring Little Women in Black",
        "Authors": "By Robyn, Lezli, Alcott, Louisa May, Hautala, Rick, Tessier, Thomas, Laidlaw, Marc, Piccirilli, Tom",
        "Description": "Android of Green Gables, Little Women in Black, Sen. Joe McCarthy vs. Killer Frogs, The Mob vs. Witchcraft, and Anime run amok!",
        "Category": " Fiction , Humorous , General",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Required Reading Remixed Volume 1: Featuring Dredd Island",
        "Authors": "By Dubisch, Mike, Menton3, Lansdale, Joe R. (COR), Youers, Rio (COR), and Shirley, John (COR)",
        "Description": "Features cultural icons as you've never seen them before. This title includes Huck Finn vs Cthulhu, Billy the Kid meets Frankenstein, Poe vs The Doors, Albert Einstein: Nazi fighter, and Captain Ahab in the Great White North.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Required Reading Remixed Volume 2: Fairest of Them All",
        "Authors": "By Taylor, Sean, Ryall, Chris, Morris, Mark",
        "Description": "Alice vs. Snow White, Asgard 90210, The Sex Pistols vs. Voodoo, Dickinson and Death, and Dr. Moreau vs. Hollywood!",
        "Category": " Fiction , Humorous , General",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Leave it to love (Barbara Cartland's library of love)",
        "Authors": "By Wynne, Pamela",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "St. Patrick's Day: A Love Story",
        "Authors": "By St. Claire, P. D.",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Virtualbookworm.com Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Frommer's Paris 2003 (Frommer's Complete Guides)",
        "Authors": "By Porter, Darwin and Prince, Danforth",
        "Description": "You'll never fall into the tourist traps when you travel with Frommer's. It's like having a friend show you around, taking you to the places locals like best. Our expert authors have already gone everywhere you might go -- they've done the legwork for you, and they're not afraid to tell it like it is, saving you time and money. No other series offers candid reviews of so many hotels and restaurants in all price ranges. Every Frommer's Travel Guide is up-to-date, with exact prices for everything, dozens of color maps, and exciting coverage of sports, shopping, and nightlife. You'd be lost without us!Completely updated every year (unlike most of the competition), Frommer's Paris features gorgeous full-color photos of the sights and experiences that await you. It covers all the traditional tourist favorites but also lets you in on local finds, neighborhood hangouts, and little-known gems.In case you're worried about the city's high prices, we've included tips on finding the best airfare, plus a host of affordable hotels and restaurants. And if money is no object, we'll show you the best places to spend it, from the Ritz to the hippest new boutique hotels, from grand dining rooms serving classic haute cuisine to the latest cutting-edge restaurants.You'll rely on Frommer's for a complete guide to the city's sights, from the Louvre to Notre-Dame. We've included suggested itineraries plus a whole chapter full of detailed walking tours that will help you get acquainted with the most intriguing neighborhoods. We'll help you find the city's best pastries, enjoy the best after-dark diversions, and shop til you drop; then we'll take you on side trips to Versailles, Chartres, Fontainebleau, and Giverny. It's all here in one easy-to-use guide, complete with a color fold-out map and an online directory that makes trip-planning a snap!",
        "Category": " Travel , Europe , France",
        "Publisher": "Frommer's",
        "Price Starting With ($)": "6.88",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Shakespeare",
        "Authors": "By Wood, Michael",
        "Description": "In this absorbing historical detective story, acclaimed broadcaster and historian Michael Wood takes an entirely fresh approach to the Bard's life, vividly re-creating the turbulent times through which he lived and painting a more convincing and complete portrait of the artist than has ever before been thought possible. Drawing on an extensive range of sources, Wood takes us back into the staterooms and back alleys of Elizabethan England. Marked by murderous plots and government-sponsored terror, religious divisions and rebellious movements, the Spanish Armada and the colonization of the Americas, the dramatic world in which Shakespeare moved is here conjured up like never before. We enter the lodgings where he wrote his greatest plays and meet the real-life characters who inspired his work: doctors, landladies, musicians, foreigners, and members of London's contemporary black population. With 130 illustrations, full-color and black-and-white, Shakespeare is a book to enjoy on many levels-as both a world-class work of historical investigation and a fascinating yet informative visual feast. Filled with fresh discoveries, Michael Wood's pathbreaking work gloriously reinstates the image of William Shakespeare as a thinking artist, a man who held up a mirror to his age, but who was also, as his friend Ben Jonson said, \"not of an age, but for all time.\"",
        "Category": " Drama , American , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Extreme Dinosaurs",
        "Authors": "By Martin, Stuart (ILT) and Mash, Robert",
        "Description": "Dinosaurs were among the most incredible creatures ever to walk this Earth. From small beginnings (around 230 million years ago) they evolved into colossal killers with jaws big enough to swallow a human whole, gigantic plant eaters who shook the ground as they moved, and streamline-bodied sprinters, capable of sprinting at sustained speeds.From the mammoth ARGENTINOSAURUS, which was as heavy as twenty elephants, to the tiny meat-eating MICRORAPTOR, which was smaller than a chicken, here are the dinosaur record breakers. Read about daggerlike fangs, switchblade claws, gigantic skulls, and flesh-ripping horns. Discover how the best-armed dinosaurs deterred their enemies with fearsome suits of armor or how the tallest of the tall stood as high as five-story buildings.",
        "Category": " Juvenile Nonfiction , Science & Nature , Fossils",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Faith That Breathes for Women: Real Stories, Real Faith",
        "Authors": "By Ross, Michael and Ross, Tiffany",
        "Description": "",
        "Category": " Religion , Christianity , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Focus on Collaborative Learning: Classroom Practices in Teaching English, 1988",
        "Authors": "By Golub, Jeff (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Council of Teachers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Silence, Simplicity and Solitude: A Guide for Spiritual Retreat",
        "Authors": "By Cooper, David A.",
        "Description": "",
        "Category": "",
        "Publisher": "Bell Tower/Harmony Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Learning from the pros (The Artist's painting library)",
        "Authors": "By American Artist Magazine",
        "Description": "",
        "Category": "",
        "Publisher": "Watson-Guptill Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Saint Germain's Prophecy for the New Millennium: What to Expect Through 2025",
        "Authors": "By Prophet, Elizabeth Clare",
        "Description": "This is a book about hope. Even though sages and seers of ancient and modern times, such as Nostradamus, Edgar Cayce and Mother Mary, have prophesied world war, pestilence, plague and even planetary cataclysm for the new millennium, Saint Germain comes with a way out. Includes prophecies through 2025.",
        "Category": " Body, Mind & Spirit , New Thought",
        "Publisher": "Summit University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Genealogist's Address Book",
        "Authors": "By Bentley, Elizabeth Petty",
        "Description": "Provides contact information for state and national archives, government agencies, historical and genealogical societies, publications, and ethnic and religious organizations. Includes a directory of stores, books, and assorted services. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Reference , Genealogy & Heraldry",
        "Publisher": "Genealogical Pub Co",
        "Price Starting With ($)": "6.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Quilts to Make for Kids",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "Offers instructions for creating crib quilts, a cloth play farm, quilts with fanciful and imaginative themes, and quilts for teenagers",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The Vegetable Bible",
        "Authors": "By Teubner, Christian, Levin, Hans-George (CON), Lange, Elisabeth (CON), and Miessmer, Andreas (CON)",
        "Description": "Nature’s bounty has never looked so good. Vegetables in every color, shape and form from every corner of the globe are gloriously photographed and described. A multitude of preparations are clearly presented along with scrumptious recipes accompanied with step by step directions.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Chartwell Books",
        "Price Starting With ($)": "7.34",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Moment of Creation: Big Bang Physics from Before the First Millisecond to the Present Universe (Dover Science Books)",
        "Authors": "By Trefil, James S.",
        "Description": "Trefil, one of the founders of modern quark theory, describes what we think happened in the moment after the Big Bang, and how what we think may be wrong. Being a quark master, he turns to the role of particles and quarks in the construction and maintenance of the universe, describes the attempts to come up with a grand unification theory, and how what we think about the moment after the big bang may be right after all. In the final chapters he explores Planck Time and the ultimate fate of the universe. This is a reprint of the edition by Collier Books, Macmillan Publishing Company. Cited in Books for College Libraries, 3d ed. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Science , Cosmology",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "A Survival Kit for the Special Education Teacher (J-B Ed: Survival Guides)",
        "Authors": "By Pierangelo, Roger",
        "Description": "This practical resource provides a tremendous store of tested tips, techniques and materials to help educators in every aspect of their work with special needs children. Comes complete with ready-to-use forms, checklists, handouts and sample letters.",
        "Category": " Education , Special Education , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Kennedy Brothers: The Rise and Fall of Jack and Bobby",
        "Authors": "By Mahoney, Richard D.",
        "Description": "A New York Times Best Seller!Books about the Kennedys are legion. Yet missing until now has been the exploration of the bond between Jack and Bobby, and  the part that it played in their rise and fall. Eight years apart in  age, they were wildly different in temperament and sensibility.  Jack was the born leader&#151;charismatic, ironic, capable of extraordinary growth and reach, yet also pathologically reckless. Bobby  was the fearless, hardworking Boy Scout&#151;unafraid of dirty work  and ruthless about protecting his brother and destroying their enemies. Jack, it was said, was the first Irish Brahman, Bobby the last  Irish Puritan.  As Mahoney demonstrates with brilliant clarity in this impeccably  documented, magisterial book, the Kennedys lived their days of  power in dangerous, trackless territory. The revolution in Cuba  had created a poisonous cauldron of pro- and anti-Castro forces,  the CIA, J. Edgar Hoover’s FBI, and the Mafia. Mahoney gives us  Jack and Bobby in all their hubris and humanity, youthfulness and  fatalism. Here is American history as it unfolds. The Kennedy Brothers is  a fresh and masterful account of the men whose legacy continues  to hold the American imagination. Originally published under the title Sons and Brothers.Skyhorse Publishing, as well as our Arcade imprint, are proud to publish a broad range of books for readers interested in history--books about World War II, the Third Reich, Hitler and his henchmen, the JFK assassination, conspiracies, the American Civil War, the American Revolution, gladiators, Vikings, ancient Rome, medieval times, the old West, and much more. While not every title we publish becomes a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Arcade Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Cooking Light Way to Cook: The Complete Visual Guide to Everyday Cooking",
        "Authors": "By Quinlivan, Rachel (EDT), Giovanelli, Jacqueline B. (EDT), Cole, Teresa (CON), and Rivera, Joline (CON)",
        "Description": "The Cooking Light Way to Cook celebrates the philosophy that all foods have a place in a healthful diet. The keys are moderation and balance, and this highly visual book shows you how to prepare those foods and enjoy them judiciously. It's filled with over 850 photos that show you how to prepare the more than 200 recipes that appear in these pages, as well as hundreds of cooking tips that give an insider's peekinto our way to cook great food. Look and learn your way through our healthy eating principles. One of these is utilizing the flavors of the world's cuisines to enhance recipes. These concentrated sauces and robust herbs and spices offer ways to add flavor with little or no fat. Another is embellishing convenience products by adding fresh herbs or a sprinkling of freshly grated cheese. You reap the benefits of time-saving ingredients but can still enjoy the spark of flavor that fresh ingredients bring to a dish. These are just some of the hundreds of tips and techniques that you can use to get started cooking healthfully right now. From making the best marinara sauce to scrambling the perfect egg-it's all here in one stunning collection. In the Cooking Light Way to Cook, learning to cook healthfully is as simple as turning the page.eek into our way to cook great food.",
        "Category": " Cooking , Methods , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "6.9",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Fishing Up North: Stories of Luck and Loss in Alaskan Waters",
        "Authors": "By Matsen, Bradford",
        "Description": "From the super-heated decade when fishing fleets turned king crab into fortunes, to the annual circus of Bristol Bay's monster salmon runs, to the bucolic life of the open-ocean trawler, the true stories in \"Fishing Up North\" carry the flavor of the modern fisherman's life and fortunes in the waters off Alaska. In \"Fishing Up North,\" you'll Find firsthand accounts of frightening weather, good fishing, terrible fishing, great days, and sweet living from the decks of crabbers, trawlers, longliners, trollers, and gillnetters.Commercial fishing's home ports -- Dutch Harbor, Kodiak, Naknek, Cordova, Petersburg, Sitka, and Seattle -- are classic fishing towns, where docks bars, and even quiet living merge in colorful portraits about life on the last frontier.",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Alaska Northwest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "American Heroes: Profiles of Men and Women Who Shaped Early America",
        "Authors": "By Morgan, Edmund S.",
        "Description": "The last two decades have witnessed an explosion of interest in the founding fathers so intense that a reader or television viewer of today might imagine that America was the creation of beings who were flawless in their wisdom and courage. As Pulitzer Prize-winning historian Edmund S. Morgan shows here, Americans have long been obsessed with their heroes. But, drawing on a lifetime of scholarship, he presents a different cast of characters—among them Indians, witches, heretics, and naysayers—men and women who went against the grain, in addition to the stock figures of our national hagiography.Morgan has mined the seventeenth century and has identified several new heroes, among them Giles Cory and Mary Easty, accused witches, who were put to death when Puritanism went wrong at Salem in 1692. Pressured to reprieve herself by admitting her guilt and naming friends and neighbors as confederates in witchcraft, Easty declared, “I dare not belie my own soul.” Her humble statement stands as the ultimate expression of the religious principles that led to the founding of New England, principles temporarily abandoned by the rulers of Massachusetts Bay who tried and sentenced her.While American Heroes celebrates the lives and principles of ordinary Americans, the book also considers the legacy of some of our most prominent colonial and Revolutionary leaders, among them William Penn, Benjamin Franklin, and George Washington. Franklin and Washington are best known for standing against the repressive and often brutal regime of Great Britain’s colonial policies, but here Morgan makes the case for their heroism in standing up to their own countrymen. When Americans were demanding precipitate action, Washington and Franklin got the nation off to a good start by knowing when to say no.Whether presenting the scandalous story of a Puritan husband whose on-and-off marriage to a beleaguered Puritan heiress illustrates the nexus between property and sex, or assessing the power of books to subvert the standing order and alter the course of history, American Heroes rises above hagiography in challenging the reader to conceive of American individuality and idealism in new terms. Morgan, who credits his mentor Perry Miller “with the best historical mind of his generation,” has shown throughout his own career an unrivaled originality and intellectual courage. American Heroes demonstrates Morgan’s fascination with our national identity and his abiding affection for the men and women whose character, honesty, and moral courage make plain that heroism in America can be found in unexpected places.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The Carbon Age: How Life's Core Element Has Become Civilization's Greatest Threat",
        "Authors": "By Roston, Eric",
        "Description": "The story of carbon—the building block of life that is, ironically, humanity's great threat .It could be said that all of us are a little alien—our bodies' carbon atoms first shot forth from supernovas billions of years ago and far, far away. Carbon has always been the ubiquitous architect and chemical scaffolding of life and civilization; indeed, all living things draw carbon from their environments to stay alive, and the great cycle by which carbon moves through organisms, ground, water, and atmosphere has long been a kind of global respiration system that helps keep Earth in balance. And yet, when we hear the word today, it is more often than not in a crisis context: carbon dioxide emissions have sped up the carbon cycle; chlorofluorocarbons are destroying the ozone layer and warming the planet; the volatile Middle East explodes atop its stores of volatile hydrocarbons; carbohydrates threaten obesity and diabetes.In The Carbon Age, Eric Roston evokes this essential element, its journey illuminating history from the Big Bang to modern civilization. Charting the science of carbon—how it was formed, how it came to Earth and built up—he chronicles the often surprising ways mankind has used it over centuries, and the growing catastrophe of the industrial era, leading us to now attempt to wrestle the Earth's geochemical cycle back from the brink. Blending the latest science with original reporting, Roston makes us aware, as never before, of the seminal impact carbon has, and has had, on our lives.",
        "Category": " Science , Life Sciences , Biochemistry",
        "Publisher": "Walker Books",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Bright Baby Touch and Feel: Numbers",
        "Authors": "By Priddy Books (COR)",
        "Description": "This first learning book is an ideal introduction to numbers for your baby or toddler.Bold colors and photographyEach spread features patches which are exciting to touch and feel.",
        "Category": " Juvenile Nonfiction , Concepts , Counting & Numbers",
        "Publisher": "Priddy Books US",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Olivia Helps with Christmas",
        "Authors": "By Falconer, Ian",
        "Description": "Everyone's favorite Caldecott honor-winning pig and #1 Santa enthusiast is helping to make the season brighter than ever.Christmas is coming, and Olivia is incredibly busy. She has to wait for Santa, make sure dad sets up the tree, wait for Santa, watch mom make the Christmas dinner, wait for Santa, oversee the care with which the stockings are hung and, of course, OPEN HER PRESENTS! Do you see how hard it is to be so helpful during the holidays? A lovingly-told and lavishly-illustrated Olivia Helps With Christmas is the perfect stuffing for any stocking, and a bright star atop the Olivia series.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Last Thousand Days of the British Empire: Churchill, Roosevelt, and the Birth of the Pax Americana",
        "Authors": "By Clarke, Peter",
        "Description": "A sweeping, brilliantly vivid history of the sudden end of the British Empire and the moment when America became a world superpower—published on the sixtieth anniversary of Britain's withdrawal from Palestine.\"I have not become the King's First Minister in order to preside over the liquidation of the British Empire.\" Winston Churchill's famous statement in November 1942, just as the tide of the Second World War was beginning to turn, pugnaciously affirmed his loyalty to the worldwide institution that he had served for most of his life. Britain fought and sacrificed on a global scale to defeat Hitler and his allies—and won. Yet less than five years after Churchill's defiant speech, the British Empire effectively ended with Indian independence in August 1947 and the end of the British Mandate in Palestine in May 1948. As the sun set on Britain's empire, the age of America as world superpower dawned.How did this rapid change of fortune come about? Peter Clarke's book is the first to analyze the abrupt transition from Rule Britannia to Pax Americana. His swift-paced narrative makes superb use of letters and diaries to provide vivid portraits of the figures around whom history pivoted: Churchill, Gandhi, Roosevelt, Stalin, Truman, and a host of lesser-known figures through whom Clarke brilliantly shows the human dimension of epochal events.Clarke traces the intimate and conflicted nature of the \"special relationship,\" showing how Roosevelt and his successors were determined that Britain must be sustained both during the war and after, but that the British Empire must not; and reveals how the tension between Allied war aims, suppressed while the fighting was going on, became rapidly apparent when it ended. The Last Thousand Days of the British Empire is a captivating work of popular history that shows how the events that followed the war reshaped the world as profoundly as the conflict itself.",
        "Category": " History , Europe , Great Britain , General",
        "Publisher": "Bloomsbury Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Simple Italian Snacks: More Recipes from America's Favorite Panini Bar (Simple Italian, 2)",
        "Authors": "By Denton, Jason and Kellinger, Kathryn",
        "Description": "Americans are embracing the small plate craze. They are serving bite-size mini meals—tapas, bar snacks, antipasti, skewered vegetables—whenever they entertain. Simple Italian Snacks shows how to plan a menu for any gathering in the informal yet chic way that Italians have mastered. Here are recipes appropriate for an afternoon by the pool, a fireside get-together with friends, an intimate dinner for two, or a party for a crowd. The dishes, which can be served as hors d'oeuvres or presented as a meal, are easy to prepare, and many can be made ahead of time.The authors of the wildly successful Simple Italian Sandwiches include all-new bruschetta, tramezzini, and panini as well as classic Italian snacks such as Baked Eggs in Tomato Sauce and Rice Balls. They show us how to make any party an event and even include sparkly cocktails. The recipes in Simple Italian Snacks are quick yet incredibly sophisticated and, as always, delicious.",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "DC for free",
        "Authors": "By Butler, Brian",
        "Description": "Lists hundreds of activities in each area of Washington, D.C. that are available for the public at no charge, with pertinent background information for each activity",
        "Category": "",
        "Publisher": "Distributed to the trade by National Book Network",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Crisp: Writing Business Proposals and Reports: Key Strategies for Success (Fifty-Minute Series)",
        "Authors": "By Brock, Susan L.",
        "Description": "Writing effective reports and proposals takes more than fundamental writing skills. This book teaches readers how to organize, research, develop, and edit complex documents as well as sharpen one's overall business writing skills. Writing effective reports and proposals takes more than fundamental writing skills. This book teaches readers how to organize, research, develop, and edit complex documents as well as sharpen one's overall business writing skills.",
        "Category": " Business & Economics , Business Writing",
        "Publisher": "Crisp Learning",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Red Danube",
        "Authors": "By Posey, Carl A.",
        "Description": "At the Center for Analytic Studies, American ocean chemist Dr. Schaefer Braun is surrounded by consummate manipulators and discovers that his own past is connected with elements of a global conspiracy",
        "Category": " Fiction , General",
        "Publisher": "Worldwide Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "PCPhoto Digital Zoom Camera Handbook (A Lark Photography Book)",
        "Authors": "By Sheppard, Rob",
        "Description": "From the number one digital photography magazine, comes the most comprehensive guide to the fastest selling cameras made today. Last season's PCPhoto Digital SLR Handbook gave camera owners a great manual with all the technical guidance they needed; now, photographers who own an advanced compact digital camera get their turn. Open up this richly illustrated volume and find in-depth instruction, with all relevant concepts, operations, and terms masterfully explained so amateur photographers can take full advantage of these amazingly capable units. In addition to a general overview of digital versus traditional photography, there's a thorough discussion of how to utilize the LCD monitor, built-in zoom lens, and every feature and function: how to edit in-camera, work the exposure modes, get the most from presets, and handle the memory card, accessories, and flash. And a full chapter covers picture taking in the field. Every page is inspirational and invaluable.",
        "Category": " Photography , Reference",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Cross Dressing",
        "Authors": "By Fitzhugh, Bill",
        "Description": "Big-shot ad exec Dan Steele feels entitled to the best life has to offer -- even if he has to live way beyond his means to acquire it. But there's hope on the horizon. Dan has just stolen what's sure to be an award-winning idea for a multimillion-dollar account. If he can keep the creditors at bay long enough, he'll get the keys to the executive restroom and all his problems will be solved.Unfortunately, that's when his brother, a Catholic priest, shows up at Dan's door in need of a loan to pay for some essential medical attention. Being both financially and morally challenged, Dan hands over his insurance card instead of his credit card. But it's too late. After running up a bill for $300,000, Father Michael goes the way of all flesh.Now Dan has a choice: go to prison for insurance fraud or take a vow of poverty and become a man of the cloth. Before he can say \"God bless,\" Dan finds himself pursued by a relentless insurance investigator, the psychopathic copywriter whose idea he stole, and a deadly killer from his brother's mysterious past. And, as if that wasn't enough, Dan finds himself falling in love with a gun-toting nun. Let us pray.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Monty Python's Tunisian Holiday: My Life with Brian",
        "Authors": "By Johnson, Kim \"Howard\", Palin, Michael (FRW), Cleese, John (FRW), Idle, Eric (FRW), and Jones, Terry (FRW)",
        "Description": "“One of the finest and most accurate records of the making of the film that I have ever read. I just wished I could remember what actually went on then.”--Terry Jones“If anyone can remember more about making the Life of Brian than me, it’s Kim ‘Howard’ Johnson. He came, he saw, he got into costume. While the rest of us were fighting to upstage each other, Howard had a notebook hidden in his toga.”--Michael Palin“Since I’ve forgotten everything, it will be great to read what was actually going on in Tunisia. Just as long as I’m the most quoted, the most vital to the shooting, and the most interesting. You don’t have to mention my stunning good looks if you don’t want to.”--Terry Gilliam“Of all the books that I am planning to read in my dotage, there is none I am more looking forward to than Monty Python’s Tunisian Holiday. . . . Not only does ‘Howard’ Johnson know more about Python than anyone outside of the IRS, he was in Tunisia for most of the filming of Life of Brian, and is the only person who captured every thoughtless remark, heated exchange, embarrassing detail, petty insult, and spiteful act of indifference.”--John Cleese“Kim ‘Howard’ Johnson was invented by Graham Chapman during an idle moment on the set of The Life of Brian. ‘Let’s invent a person,’ he said. ‘An American fan from the Midwest,’ chimed in Michael Palin, ‘who keeps a daily diary of Python filming. And then doesn’t publish it for years and years.’ How we laughed, and each day we’d make up stuff this ‘person’ would write about us.”--Eric Idle     In 1978, Kim “Howard” Johnson ran away to join the circus---Monty Python’s Flying Circus, that is. The Pythons converged on Tunisia to film their timeless classic, Life of Brian, and Howard found himself in the thick of it, doubling for nearly all the Pythons, playing more roles in the film than John Cleese, and managing to ruin only one shot. He became the unit journalist, substitute still photographer, Roman soldier, peasant, Biggus Dickus’s double, near-stalker, and, ultimately, friend and confidant of the comedy legends. He also kept a detailed journal of what he saw and heard, on set and off, throughout those six weeks.     The result is a unique eyewitness account that reveals the Pythons at work and at play in a way that nothing else written about them could do. Now, for the first time ever, the inside story of the making of the film is revealed through the fly-on-the-castle-wall perspective. Even the most diehard fans will get a fresh take on the comedy greats through some never-before-revealed nuggets of Python brilliance: what John Cleese offered to exchange for suntan lotion; Terry Jones directing in drag; Michael Palin’s secret to playing revolutionaries and peasants; Graham Chapman gets naked; Terry Gilliam gets filthy; Eric Idle haggles; the secret of the Thespo-Squat; Mrs. Pilate; talk of George Harrison; the cake-flinging that jeopardized the production; badminton, impromptu cricket, and erotic frescoes; and the first-ever presentation of “Always Look on the Bright Side of Life.”      Here, uncensored, are the legendary Pythons in their prime. It was a period of comedy history that will never be duplicated, and Monty Python’s Tunisian Holiday captures the wit, the genius, and the sheer silliness of the six men that comprised Python.",
        "Category": " Performing Arts , Comedy",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Making Spirits Bright",
        "Authors": "By Michaels, Fern, Noonan, Rosalind, Bass, Elizabeth, and Rossiter, Nan",
        "Description": "Secret wishes, sweet surprises, and gifts straight from the heart. Delight in this season's most joyous presents with these four sparkling tales. . .\"Making Spirits Bright\" by Fern MichaelsMelanie McLaughlin desperately wants to adopt two orphaned siblings and give them a real home for Christmas. A just-for-the-holiday marriage to Bryce Landry fits her plan perfectly. . .until unexpected sparks have Melanie dreaming of forever by his side. . .\"Runaway Christmas\" by Elizabeth BassA glass of wine, lounging in pajamas, and catching up on movies--that's Heidi Bogue's idea of a perfect Christmas. Until her thirteen-year-old niece makes a surprise visit--and a snowstorm turns Heidi's café into a community refuge. Now one handsome cop is giving Heidi plenty more reasons to celebrate. . .\"Home For Christmas\" by Rosalind NoonanJo Truman needs a replacement Santa for her gift shop's Christmas Eve party. She'll do whatever it takes to convince lonely soldier Sam Norwood that he's perfect for the part. . .and that the season for love is always. . .\"Christmas On Cape Cod\" by Nan RossiterMaddie Carlson would do anything for her best friend. And helping Asa Coleman babysit a rambunctious puppy Christmas Eve night is her one chance to help the troubled teacher put his past to rest. . .and give the sweetest gift of all.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2011"
        }
    },
    {
        "Title": "Earth to Matthew",
        "Authors": "By paula danziger",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Cloudburst",
        "Authors": "By Andrews, V. C.",
        "Description": "OUT OF A CLEAR BLUE SKY . . .Since being taken in by wealthy Mrs. Jordan March and living in her exquisite home like a daughter, Sasha Porter’s traumatic past—destitute on the streets, and the shattering accident that killed her mother—seems like a fading nightmare. Beautiful and sophisticated, as bold and daring as her “sister,” Kiera March, Sasha still keeps her mother’s wise words close to her heart: never fully trust anyone. Inside her privileged new world, it’s advice that will prove more precious than gold.. . . CAN ANYTHING STOP THE DOWNPOUR?Against the wishes of Jordan’s husband, Donald, Sasha attracts the attention of Duane Banks, a shy, handsome athlete, and maneuvers her way into his heart. But Duane’s hidden torment soon explodes in a horrific tragedy that pulls Sasha into a flood of guilt and despair. And when someone she thought she could trust targets her vulnerability, Sasha recalls her mother’s warnings—and a violent storm of dark deceptions and shocking family secrets is unleashed. Will she sink or swim?",
        "Category": " Fiction , Women",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Motivating The \"What's In It For Me?\" Workforce: Managing Across The Generational Divide",
        "Authors": "By Marston, Cam",
        "Description": "",
        "Category": "",
        "Publisher": "Cam Marston",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "A Guide to North Carolina's Wineries",
        "Authors": "By Mills, Joseph and Tarmey, Danielle",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "John F Blair Pub",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Living religion",
        "Authors": "By Fisher, Joseph L",
        "Description": "",
        "Category": "",
        "Publisher": "Clerestory Press",
        "Price Starting With ($)": "11.23",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Young Guns: A New Generation Of Conservative Leaders",
        "Authors": "By Cantor, Eric, Ryan, Paul, and McCarthy, Kevin",
        "Description": "America urgently needs a new direction. But who will provide it? The time has come to move the country forward with a clear agenda based on common sense for the common good. THERE IS A BETTER WAY. Make no mistake: Congressmen Eric Cantor, Paul Ryan, and Kevin McCarthy are proud Republicans. But they believe the party had lost sight of the ideals it believes in, like economic freedom, limited government, the sanctity of life, and putting families first. This isn’t your grandfather’s Republican party. These Young Guns of the House GOP—Cantor (the leader), Ryan (the thinker), and McCarthy (the strategist)—are ready to take their belief in the principles that have made America great and translate it into solutions that will make the future even better, solutions that will create private sector jobs, maximize individual freedom, and establish a better world for our children. This groundbreaking book is a call to action that sets forth a plan for growth, opportunity, and commitment that will propel this country to prosperity once again. Together, the Young Guns are changing the face of the Republican party and giving us a new road map back to the American dream.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Threshold Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Great Presidential Decisions: State Papers That Changed the Course of History from Washington to Reagan",
        "Authors": "By Morris, Richard Brandon and Morris, Jeffrey B.",
        "Description": "A collection of important documents, speeches, and proclamations of presidents from Washingto to Lyndon Johnson",
        "Category": " History , United States , General",
        "Publisher": "Richardson & Steirman & Black",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Stealing Heaven",
        "Authors": "By Scott, Elizabeth",
        "Description": "My name is Danielle. I'm eighteen. I've been stealing things for as long as I can remember.Dani has been trained as a thief by the best there is—her mother. They never stay in one place long enough for Dani to have real connections, real friends—a real life. But in the town of Heaven, everything changes. Suddenly, Dani must question where her loyalties lie: with the life she's always known—or the one she's always wanted.",
        "Category": " Young Adult Fiction , Family , Parents",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Solar Revolution: The Economic Transformation of the Global Energy Industry (The MIT Press)",
        "Authors": "By Bradford, Travis",
        "Description": "An innovative analysis that shows how the shift to solar energy—in particular, the use of photovoltaic cells—is both economically advantageous and inevitable, and will rival the information and communication technologies revolution in its transformative effects.In Solar Revolution, fund manager and former corporate buyout specialist Travis Bradford argues—on the basis of standard business and economic forecasting models—that over the next two decades solar energy will increasingly become the best and cheapest choice for most electricity and energy applications. Solar Revolution outlines the path by which the transition to solar technology and sustainable energy practices will occur.Developments in the photovoltaic (PV) industry over the last ten years have made direct electricity generation from PV cells a cost-effective and feasible energy solution, despite the common view that PV technology appeals only to a premium niche market. Bradford shows that PV electricity today has become the choice of hundreds of thousands of mainstream homeowners and businesses in many markets worldwide, including Japan, Germany, and the American Southwest. Solar energy will eventually be the cheapest source of energy in nearly all markets and locations because PV can bypass the aging and fragile electricity grid and deliver its power directly to the end user, fundamentally changing the underlying economics of energy. As the scale of PV production increases and costs continue to decline at historic rates, demand for PV electricity will outpace supply of systems for years to come. Ultimately, the shift from fossil fuels to solar energy will take place not because solar energy is better for the environment or energy security, or because of future government subsidies or as yet undeveloped technology. The solar revolution is already occurring through decisions made by self-interested energy users. The shift to solar energy is inevitable and will be as transformative as the last century's revolutions in information and communication technologies.",
        "Category": " Science , Environmental Science",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Creatures of the Seashore",
        "Authors": "By Kate Londesborough",
        "Description": "",
        "Category": "",
        "Publisher": "Brimax Books",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Reasons to Kill: Why Americans Choose War",
        "Authors": "By Rubenstein, Richard E.",
        "Description": "While acknowledging his belief that there can indeed be just wars, Rubenstein (conflict resolution and public affairs, George Mason U.) argues that just wars are nevertheless very rare and hence wonders how it is possible that the American public is so often convinced of the rightness of the various wars embarked upon by the United States over the years. He examines both the argument that Americans are \"innocent dupes\" fooled by American leaders willing to lie about, for example, the sinking of the Maine, the Tonkin Gulf incident, and Iraq's nonexistent weapons of mass destruction and the argument that the American frontier experience pre-conditions Americans to pursue their interests violently and devalue the lives of others, finding both to have some, but not sufficient, explanatory power. He proposes that the most common characteristic in successful efforts to convince Americans to go to war is the way that moral arguments are rooted in the US civil religion of national exceptionalism and the associated belief in the unique, even divine, mandate for the US to promote liberty, justice, democracy, and associated values around the world. Annotation ©2011 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Bloomsbury Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Heavy Metal Mater and Other Tall Tales (Disney/Pixar Cars)",
        "Authors": "By RH Disney (COR) and Berrios, Frank",
        "Description": "Mater is up to his old tricks again, with three new tall tales in one fantastic hardcover storybook for boys ages 3 to 7! Mater tells Lightning McQueen how he started a heavy metal band, became a hot-rod racer in Tokyo, and had a close encounter with a UFO! This follow-up to Mater's Tall Tales is a must-have for all fans of Disney•Pixar'sCars and Cars Toons.",
        "Category": " Juvenile Fiction , Transportation , Cars & Trucks",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Living with Grief: Pain Management at the End of Life: Bridging the Gap Between Knowledge & Practice",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hospice Foundation of America",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Chile & Easter Island (Country Travel Guide)",
        "Authors": "By McCarthy, Carolyn, Carillet, Jean-Bernard, Benchwick, Greg, Patience, Victoria, and Raub, Kevin",
        "Description": "Describes points of interest in each region of Chile, looks at the famous statues of Easter Island, and recommends hotels, restaurants, and tours.",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Kingdom Hearts II, Volume 2",
        "Authors": "By Shiro Amano",
        "Description": "",
        "Category": "",
        "Publisher": "TokyoPop",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Emily: Or, the Voluptuous Delights of a Once-Innocent Young Lady",
        "Authors": "By Jennings, James",
        "Description": "",
        "Category": "",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "New Century Handbook, Brief Edition, The",
        "Authors": "By Hult, Christine A. and Huckin, Thomas N.",
        "Description": "",
        "Category": "",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Managing Differences: How to Build Better Relationships at Work and Home",
        "Authors": "By Dana, Daniel",
        "Description": "",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "M T I Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Be a Woman",
        "Authors": "By Moran, Caitlin",
        "Description": "There's never been a better time to be a woman: we have the vote and the Pill, and we haven't been burnt as witches since 1727. However, a few nagging questions do remain... Why are we supposed to get Brazilians? Should you get Botox? And do men secretly hate us? This title answers these questions and more.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Ebury",
        "Price Starting With ($)": "11.55",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Eleventh Commandment",
        "Authors": "By Archer, Jeffrey",
        "Description": "",
        "Category": "",
        "Publisher": "HARPER COLLINS PUBLISHERS",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "THREE MINUTES A DAY.",
        "Authors": "By Catoir, Father John",
        "Description": "",
        "Category": "",
        "Publisher": "The Christophers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Icons of Fashion: The 20th Century (Prestel's Icons)",
        "Authors": "By Buxbaum, Gerda (EDT)",
        "Description": "Now available in an attractively priced flexi edition, this best-selling book is an opulent and absorbing overview of the fashion world throughout the twentieth century. From Coco Chanel to Christian Dior, Kenzo to Versace, grunge to haute couture, every period and major name in twentieth-century fashion is included in this comprehensive collection of fascinating photographs, drawings, and texts. Organized into sections according to style, it features double-page spreads highlighting every aspect of fashion: designers, models, critics, and fashion photographers. Gorgeous images by Peter Lindbergh, Nick Knight, Mario Testino, and others capture the attitudes and artistry of fashion as it evolved over the decades. As glamorous as its subject, this colourful survey will provide inspiration for anyone fascinated with the world of fashion.",
        "Category": " Photography , Subjects & Themes , Fashion",
        "Publisher": "Prestel",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Cloud Atlas: A Novel",
        "Authors": "By Callanan, Liam",
        "Description": "Set against the magnificent backdrop of Alaska in the waning days of World War II, The Cloud Atlas is an enthralling debut novel, a story of adventure and awakening—and of a young soldier who came to Alaska on an extraordinary, top-secret mission…and found a world that would haunt him forever.Drifting through the night, whisper-quiet, they were the most sublime manifestations of a desperate enemy: Japanese balloon bombs. Made of rice paper, at once ingenious and deadly, they sailed thousands of miles across the Pacific...and once they started landing, the U.S. scrambled teams to find and defuse them, and then keep them secret from an already anxious public. Eighteen-year-old Louis Belk was one of those men. Dispatched to the Alaskan frontier, young Sergeant Belk was better trained in bomb disposal than in keeping secrets. And the mysteries surrounding his mission only increased when he met his superior officer—a brutal veteran OSS spy hunter who knew all too well what the balloons could do—and Lily, a Yup’ik Eskimo woman who claimed she could see the future.Louis’s superior ushers him into a world of dark secrets; Lily introduces Louis to an equally disorienting world of spirits—and desire. But the world that finally tests them all is Alaska, whose vastness cloaks mysteries that only become more frightening as they unravel. Chasing after the ghostly floating weapons, Louis embarks upon an adventure that will lead him deep into the tundra. There, on the edge of the endless wilderness, he will make a discovery and a choice that will change the course of his life. At once a heart-quickening mystery and a unique love story, The Cloud Atlas is also a haunting, lyrical rendering of a little-known chapter in history. Brilliantly imagined, beautifully told, this is storytelling at its very best.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Dial Press Trade Paperback",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Just Enough Portuguese (Just Enough Phrasebook Series)",
        "Authors": "By Ellis, D. L.",
        "Description": "The perfect phrasebook when you want to know just enough to enjoy yourself abroadYour ideal companion for traveling--especially if you are a first-timer with little or no foreign language experience--Just Enough Portuguese packs all the punch of bigger references into a concise, user-friendly format. This handy, pocket-size guide covers everything from days, months, currencies, and clothing sizes to food, shelter, and medical assistance.",
        "Category": " Foreign Language Study , Portuguese",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Palacio Real de Madrid",
        "Authors": "By Jose Luis Sancho",
        "Description": "",
        "Category": "",
        "Publisher": "PATRIMONIO NACIONAL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2013"
        }
    },
    {
        "Title": "Cooking Basics: Recipes & Techniques (Williams Sonoma Kitchen Library)",
        "Authors": "By Williams, Chuck, Mallorca, Jacqueline, and Shorten, Chris (PHT)",
        "Description": "An authoritative guide to cooking fundamentals offers novice cooks valuable information about equipment, ingredients, food presentation, techniques, and favorite recipes for appetizers, soups, salads, desserts, main courses, pasta, vegetables, and more.",
        "Category": " Cooking , Methods , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Ways of Paradox",
        "Authors": "By W.V. Quin",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "The Face of the Fox",
        "Authors": "By Frederick O. Gearing",
        "Description": "",
        "Category": "",
        "Publisher": "Aldine Publishing Co.",
        "Price Starting With ($)": "6.73",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Mapping the Social Landscape: Readings in Sociology",
        "Authors": "By Ferguson, Susan J. (EDT) and Barrosse, Emily (EDT)",
        "Description": "Drawing from a wide selection of classic and contemporary works, the 60 selections in this best-selling reader represent a plurality of voices and views within sociology.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "African Cats: A Lion’s Pride",
        "Authors": "By Hapka, Catherine (ADP)",
        "Description": "This paperback 8x8 introduces readers to a lioness and her cub and their life on the African plains. Jam-packed with beautiful photographs, this storybook includes fun lion facts and is ideal for younger fans of the film!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Animal Snackers",
        "Authors": "By Lewin, Betsy",
        "Description": "The ostrich eyes with eager glint a stone-his after-dinner mint. It is a snack that he must swallow so indigestion does not follow.A Classic about animals' favorite treats-republished with all new illustrations We all know that animals never eat at tables, and they don't eat the same treats as we do, but where and what do animals eat? Well, tick birds eat on the backs of rhinos. And platypuses? Do you know what porcupines eat? Find out that and more in Betsy Lewin's whimsical account of the eating habits of some exotic creatures.",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "Henry Holt and Co. (BYR)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "State Shapes: Minnesota",
        "Authors": "By Peterson, Rick (ILT) and Bruun, Erik A.",
        "Description": "This fresh new series of illustrated, fact- and fun-filled books entertains while educating kids-and parents, too.  These colorful, fact-filled books are irresistible! Die-cut in the shape of the state, each one takes readers on a fascinating journey to visit all the intriguing places, meet famous and historic figures, learn about animals and wildlife and experience the culture that makes each state unique. Packed with fun facts, exciting history and fascinating folklore, State Shapes are illustrated with a warmth, humor and flare that will appeal to kids and parents alike. Learning is fun with State Shapes.",
        "Category": " Travel , United States , Midwest , West North Central (IA, KS, MN, MO, ND, NE, SD)",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "100+ Winning Answers to the Toughest Interview Questions (Barron's Business Success Series)",
        "Authors": "By Zemke, Deborah (ILT) and Hawley, Casey Fitts",
        "Description": "What do you tell a job interviewer when he asks about your background, and you know you have less experience than other job candidates? The author approaches this and other tough questions with solid advice. General tips that apply to all interview questions entail giving answers that ring true, answers that are direct and without hesitation, and answers that don't meander, but speak precisely to the questions the interviewer asks. Books in Barron's popular Business Success series are written for career-minded men and women intent on moving up the corporate ladder or going out on their own as entrepreneurs. These titles offer advice from experienced business managers and experts on how to prosper in the corporate world and succeed at all levels of business management.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Leap of Reason: Managing to Outcomes in an Era of Scarcity",
        "Authors": "By Mario Morino",
        "Description": "",
        "Category": "",
        "Publisher": "Venture Philanthropy Partners",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Delightful Brazilian Cooking: Authentic, Quick and Easy",
        "Authors": "By Ang, Eng Tie and Fabrizio, Martine Richards (ILT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Central American & South American",
        "Publisher": "Ambrosia Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Toby Tyler (Companion Library Series)",
        "Authors": "By Otis, James",
        "Description": "",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1970"
        }
    },
    {
        "Title": "when lovers are friends",
        "Authors": "By Shain, Merle",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The little Mexican donkey boy (Childen of All Lands Series)",
        "Authors": "By Brandeis, Madeline",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "23.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1931"
        }
    },
    {
        "Title": "The Astronomy Cafe: 365 Questions and Answers from \"Ask the Astronomer\" (\"Scientific American\" Library)",
        "Authors": "By Odenwald, Sten F.",
        "Description": "Based on the \"Ask the Astronomer\" section of the author's Web site, the book answers the most popular (not necessarily the most intelligent) questions asked. Organized around topics such as the sun, the origin of the universe, and telescopes and star gazing, questions include whether an asteroid will hit the earth in the near future, what the inside of a black hole might look like, and what existed in space before the Big Bang. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Science , Astronomy",
        "Publisher": "W H Freeman & Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Cool Cottages: 235 Delightful Retreats, 825 to 3,500 Square Feet",
        "Authors": "By Prideaux, Jan (EDT) and Home Planners, Inc. (COR)",
        "Description": "",
        "Category": " House & Home , House Plans",
        "Publisher": "Home Planners",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "ReGroup Participant's Guide: Training Groups to Be Groups",
        "Authors": "By Cloud, Henry, Townsend, John, and Donahue, Bill",
        "Description": "In this revolutionary new curriculum, Henry Cloud, Bill Donahue, and John Townsend establish a whole new training paradigm---one that equips leaders and groups simultaneously and gives them everything they need to start and sustain a life-changing group. All it requires is a small group and a DVD player. Four sixty-minute sessions train leaders and group members in the foundational values and practices of becoming a life-changing community. These sixty-minute sessions are the foundations of small groups that include teaching by the authors, creative segments, and activities and discussion time. * The group has the chance to review and learn new group life techniques during the year with Thirteen five-minute coaching segments on topics such as active listening, personal sharing, giving and receiving feedback, prayer, calling out the best in others, and more.Each session includes a mix of three elements:* Teaching by the authors* Creative segments (such as modeling dramas, person-on-the-street interviews, personal stories/testimonies, creative multimedia, etc.)* Small group activities and processing/discussion timeThe four sessions include:* Session 1 provides a foundational experience that helps group members get excited about the adventure and life-changing power of small group life. Exercises and guided discussions create an initial sense of connection, safety, and most of all, fun!* Session 2 focuses on introducing values, ground rules, and logistical issues. Relationships are deepened through the group's assessment and discussion of the values most important to them, while exercises facilitate group ownership of these issues. * Session 3 unpacks each of the five key values through in-depth teaching and practical examples. Group members learn that all are responsible for implementing the five values in the life of the group, and they practice applying two of the values during the session ('Be real' and 'accept one another').* Session 4 transitions the group to running on its own. Exercises help the group clarify what their focus will be, and what they want to do in their next meeting (the first meeting without the DVD curriculum). This session also provides an inspiring wrap-up for the course that casts vision for what the group can become if it lives out its values.The Life-Changing Power of Group Life DVD and Participants Guide are available separately.",
        "Category": " Religion , Christian Ministry , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Dodald Duck",
        "Authors": "By Barks",
        "Description": "",
        "Category": "",
        "Publisher": "1150606",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Portraits of Russian Personalities Between Reform and Revolution",
        "Authors": "By Richard Hare",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford Univ Press",
        "Price Starting With ($)": "9.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Complete 35Mm Sourcebook",
        "Authors": "By Busselle, Michael",
        "Description": "",
        "Category": " Photography , Techniques , Cinematography & Videography",
        "Publisher": "Amphoto Books",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Better Homes and Gardens Best Recipes Yearbook, 1995",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Collects a variety of recipes for appetizers, breads, chicken, soups, beef, pork, candies, cakes, and vegetables",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Everything Is Miscellaneous",
        "Authors": "By Weinberger, David",
        "Description": "\"Perfectly placed to tell us what's really new about [the] second-generation Web.\"—Los Angeles TimesBusiness visionary and bestselling author David Weinberger charts how as business, politics, science, and media move online, the rules of the physical world—in which everything has a place—are upended. In the digital world, everything has its places, with transformative effects:• Information is now a social asset and should be made public, for anyone to link, organize, and make more valuable.• There's no such thing as \"too much\" information. More information gives people the hooks to find what they need. • Messiness is a digital virtue, leading to new ideas, efficiency, and social knowledge. • Authorities are less important than buddies. Rather than relying on businesses or reviews for product information, customers trust people like themselves. With the shift to digital music standing as the model for the future in virtually every industry, Everything Is Miscellaneous shows how anyone can reap rewards from the rise of digital knowledge.",
        "Category": " Technology & Engineering , Social Aspects",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "ESV Gospel of John (Paperback, Classic Design)",
        "Authors": "By ESV Bibles by Crossway",
        "Description": "The Gospel of John has always been one of the most-read books of the Bible, and this special paperback edition makes it easy to share with others. Also includes gospel presentation and favorite verses.",
        "Category": " Bibles , English Standard Version , New Testament & Portions",
        "Publisher": "Crossway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "At the Ergonomic Keyboard - Poems, Stories, Essays",
        "Authors": "By Robert E. Barnett",
        "Description": "",
        "Category": "",
        "Publisher": "Robert E. Barnett",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "XML Complete",
        "Authors": "By Sybex Inc. (COR) and Coleman, Pat (EDT)",
        "Description": "XML Complete is a one-of-a-kind book--valuable both for its broad content and its low price. The book contains all the essentials on XML, including comprehensive information on XML-related standards like XHTML and XSLT.With XML Complete, you'll learn everything you need to know for Web development with XML--from creating elements, attributes, and entities to using XML with Servlets and JSP. The book contains the complete CML 1.0 (Second Edition) specification and details the new W3C schema specification recommendation. For a handy, up-to-date guide, Web developers don't need to look any farther!XML Complete introduces you to the work of some of Sybex's finest authors, so you'll know where to go to learn even more about XML.",
        "Category": " Computers , Programming Languages , HTML",
        "Publisher": "Sybex",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Celebrating the Midwestern Table: Real Food For Real Times",
        "Authors": "By Mandel, Abby",
        "Description": "To Americans all over the country, the heartland means comfort, tradition, and good home cooking. It is also the source of some of the best produce, cheeses, meats - and even caviar - in the United States. And it is this cornucopia that Abby Mandel celebrates in her new book of approximately two hundred recipes, calling on the best of American home cooking and the best of the country's bounty used in new and innovative ways.From beef brisket and caramelized onions to corn fritters, from oven \"fried\" chicken to lemon poppyseed noodles, the dishes in Celebrating the Midwestern Table are reminiscent of families around the table, good talk, and warm memories. But these are also recipes that pay due respect to modern taste and concerns for health, and that use less fat, less meat, and more wonderful vegetables and grains than our grandmothers' versions would have done.A longtime Chicago resident, Abby Mandel knows better than anyone what goodness the American Midwest has to offer; as a veteran food writer and cooking teacher, she knows how to translate that goodness into recipes designed to tempt home cooks across the country.",
        "Category": " Cooking , Regional & Ethnic , American , Middle Western States",
        "Publisher": "Broadway",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The New Glucose Revolution Low GI Guide to Losing Weight: The Only Authoritative Guide to Weight Loss Using the Glycemic Index",
        "Authors": "By Burani, Johanna, Foster-Powell, Kaye M., and Brand-Miller, Jennie",
        "Description": "When it comes to losing weight, not all foods are created equal. The glycemic index?an easy-to-understand ranking of foods, most notably carbohydrates, based on the rate at which the body metabolizes them?can help people choose the right foods to eat in their quest to lose weight and keep it off. Written by the world's leading authorities on the glycemic index, The New Glucose Revolution Low GI Guide to Losing Weight answers the questions most frequently asked by dieters about low-GI foods, recounts success stories about people who have lost weight by making the switch to a low-GI diet, includes a week's worth of low-GI meal plans, and much more.",
        "Category": " Health & Fitness , Diet & Nutrition , Weight Loss",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Progressive Years the Spirit & Achieveme",
        "Authors": "By Otis Pease",
        "Description": "",
        "Category": "",
        "Publisher": "George Braziller",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Behavior Modification: What it is and How to Do it",
        "Authors": "By Garry Martin, Joseph Pear",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Lateral Puzzles",
        "Authors": "By Bodycombe, David J.",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes_Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Welcome Fall (Little Scholastic)",
        "Authors": "By Davis, Nancy (ILT) and Ackerman, Jill",
        "Description": "This bright, tactile board book celebrates a first encounter with the most colorful season: fall!  Bold, simple illustrations and textures show what a child first sees, hears, touches, and feels.  And no matter how windy it may be outside, this child ends up safe and snug in Daddy's arms. The third in this series of four seasonal offerings.Introducing Little Scholastic, a developmental publishing program of interactive books created exclusively to give babies and toddlers a head start in learning.  Every book features:*  Interactive components  *  High color contrast *  Rhyming, repetitive, or predictable text *  Familiar subjects and surroundings  *  Simple concepts   *  Distinct leveling between the ages of 0-3",
        "Category": " Juvenile Nonfiction , Concepts , Senses & Sensation",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "No Longer a Slumdog: Bringing Hope to Children in Crisis",
        "Authors": "By K. P. Yohannan",
        "Description": "",
        "Category": "",
        "Publisher": "GFA Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Human performance engineering: A guide for system designers",
        "Authors": "By Bailey, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Don't Sweat the Small Stuff at Work: Simple Ways to Minimize Stress and Conflict While Bringing Out the Best in Yourself and Others",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Unknown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Old-House Dictionary: An Illustrated Guide to American Domestic Architecture (1600-1940)",
        "Authors": "By Phillips, Steven J",
        "Description": "Reprint of the American Source Books edition of 1989. Gives concise definitions illuminated by clear line drawings. A book useful to many readers. Includes an extensive annotated bibliography. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Preservation Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    }
]