[
    {
        "Title": "Best Kept Secrets of the South's Best Cooks: Family Secrets & Test Kitchen Tips Revealed Plus Over 350 Recipes",
        "Authors": "By Southern Living Magazine (EDT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "United States Air Force Combat Medals, Streamers, and Campaigns (Reference Series)",
        "Authors": "By Warnock, A. Timothy",
        "Description": "",
        "Category": "",
        "Publisher": "Supt. of Docs., U.S. G.P.O",
        "Price Starting With ($)": "12.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Joy for a Woman's Soul FCS",
        "Authors": "By Zondervan Publishing House",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Inspiro",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Williams-Sonoma Complete Grilling Cookbook",
        "Authors": "By Williams-Sonoma",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "7.52",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Light Cooking Pasta",
        "Authors": "By Intl, Publications",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "A Sensible Match",
        "Authors": "By Cartwright, Teryl",
        "Description": "",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Vintage Romance Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Absolutely Lucy #3: Look at Lucy!",
        "Authors": "By Merrell, David (ILT) and Cooper, Ilene",
        "Description": "Bobby is so proud of his puppy Lucy. She's a terrific friend, and a great dog. So when a local store has a pet contest, he happily enters Lucy in it. But it turns out the pet that wins the contest may be featured on TV—with its owner! Bobby is shy. He doesn't like attention. But can he face the spotlight . . . for Lucy?The third story of a boy and beagle's friendship is perfect for young dog lovers!",
        "Category": " Juvenile Fiction , Performing Arts , Television & Radio",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Contemporary Classics: 24 Elegant Knits with a Modern Twist",
        "Authors": "By Moss, Jean",
        "Description": "Sophistication and timeless style are the hallmarks of elegance, whether at a metropolitan cocktail hour or a comfortable get-together at a weekend getaway. That is the inspiration for this chic new collection of patterned garments that have the lines and understated elegance of town and country. Contemporary Classics offers 24 beautiful designs with chic styles ranging from a black turtleneck sweater, which can be paired with cropped pants for a classic, yet mod look, to an oversized sweater with a cowl-neck hood for the pulled-together, yet relaxed look. Authored by accomplished knitwear designer, Jean Moss, who has knitted for such fashion icons as Ralph Lauren, offers this unique collection of sophisticated fashion. Learn how to create from this fabulous selection of beautiful designs a glamorous lacy shawl; a short-sleeved, open-collar sweater; a sleeveless knee-length dress; a Chanel-inspired, collarless jacket with pocket embellishments; and a delicate, silvery cape for enchanting evenings out. Using a broad assortment of contemporary yarns, the signature classics are knit in sophisticated colors that complement any outfit whether formal or casual.",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "Home Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Edinburgh Castle: The Official Souvenir Guide",
        "Authors": "By Tabraham, C. j.",
        "Description": "",
        "Category": "",
        "Publisher": "TCRE DIVISION / SCOTTISH CONSERVATION BUREAU, HIST",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "How to Build a Classic Golf Swing",
        "Authors": "By Newell, Steve and Els, Ernie",
        "Description": "Ernie Els is one of the most established names in world golf. Since sensationally capturing the 1994 US Open at the age of 24, he has recorded a string of victories, and it&#39;s all been achieved with one of the most elegant and classic swings on tour. In this book, the two-time US Open champion offers advice to the average club golfer on the basic fundamentals of grip and posture, before teaching us how to build the classic swing for which he is so famous.A practical guide to developing a better, more effective swing to help you improve your performance from tee to greenEvery club in the bag receives the full treatment, from the driver to short ironsSpecial chapters on tackling long bunker shots; getting more distance out of your drives; and shaping the ball in the airFully illustrated with specially commissioned color photography",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Your Personality Tree",
        "Authors": "By Littauer, Florence",
        "Description": "Many honest Christians are playing roles and wearing masks they don't know how to remove. In this book, Florence Littauer shows how readers can understand their own personality trees and use that knowledge to build understanding and better family relationships.",
        "Category": " Psychology , Personality",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Fish and Shellfish [Paperback] Linda Doeser",
        "Authors": "By Linda Doeser",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Pets Who'd Rather Play Than Stay: All Star Animals",
        "Authors": "By Beth Bugler/Sports Illustrated Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Sports Illustrated Magazine",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Beyond the Da Vinci Code: From the Rose Line to the Bloodline",
        "Authors": "By Hemenway, Priya and Duchane, Sangeet",
        "Description": "The truth behind a work of fiction that incited a movement to disprove it.As controversial as it was popular, The Da Vinci Code sparked an intrigue that spanned religious, cultural, mathematical and literary domains.Was Jesus married? Did Leonardo da Vinci bury clues” to the truth of the bloodline in his art? Is there a secret organization that protects the whereabouts of the Holy Grail?Proving that a number of the novel’s most radical claims are historically sound, and exposing the spurious nature of others,Sangeet Duchane compares the early and modern Church, analyzes Dan Brown’s use of symbols, explores origins of the Grail myth, and ends with a tour through the significant locales of the novel as well as a reflection on the reasons it has touched so many and the meaning of modern myth.",
        "Category": " Religion , Christianity , History",
        "Publisher": "Sterling",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Civil War Day By Day",
        "Authors": "By Katcher, Phillip",
        "Description": "The hardcover reference titles in the Day by Day series examine the evolution of wars in a chronological timeline, from the first skirmish to the last battle and everything in between. These books are a historical companion to each major war in the nineteenth and twentieth century. The fate of soldiers, battalions, armies, can change in the blink of an eye—with this comprehensive book readers can follow the conflicting sides in their strategy, weaponry, and policies.The Civil War was the bloodiest conflict in U.S. history, claiming the lives of over 600,000  Americans between 1861 and 1865. The Civil War Day by Day is a chronological, month-by-month approach to the conflict, allowing the reader to see at a glance the key battles on land and at sea; bloody engagements such as the First Bull Run, Antietam, Nashville, Chancellorsville, Fredericksburg, Cold Harbor and Gettysburg. Illustrated throughout with hundreds of contemporary photographs and illustrations, this book also includes full-color maps of all the major battles and campaigns of the war. Each chapter contains boxes on the weapons that were used by both sides in the war, and the tactics that were employed on the battlefield.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Chartwell Books, Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Jesus for a New Generation: Putting the Gospel in the Language of Xers",
        "Authors": "By Ford, Kevin Graham, Denney, Jim, and Gallup, George (INT)",
        "Description": "",
        "Category": " Religion , Reference",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Bulfinch's Greek and Roman Mythology: The Age of Fable (Dover Thrift Editions)",
        "Authors": "By Bulfinch, Thomas",
        "Description": "First published in 1855, Bulfinch's Mythology has introduced generations of readers to the great myths of Greece and Rome, as well as time-honored legends of Norse mythology, medieval, and chivalric tales, Oriental fables, and more. Readers have long admired Bulfinch's versions for the skill with which he wove various versions of a tale into a coherent whole, the vigor of his storytelling, and his abundant cross-references to poetry and painting, demonstrating the relationship of literature and art. Now The Age of Fable, the first section of the Mythology, is available in this inexpensive, highly readable edition. Drawing on the works of Homer, Ovid, Virgil, and other classical authors, as well as an immense trove of stories about the Norse gods and heroes, The Age of Fable offers lively retellings of the myths of the Greek and Roman gods: Venus and Adonis, Jupiter and Juno, Daphne and Apollo, and many others.The myths and legends so vividly retold in this volume underlie much of the art, literature, and culture of Western civilization. As Bulfinch put it, \"Without a knowledge of mythology, much of the elegant literature of our own language cannot be understood and appreciated.\" With this inexpensive edition of The Age of Fable, readers can immerse themselves in these seminal myths, increasing their appreciation and understanding of Western culture, while enjoying the myths purely as the great stories they are.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Everything Angels Book (Everything Series)",
        "Authors": "By Abadie, Marie-Jeanne",
        "Description": "An inspirational introduction to the angelic hosts provides readers with the names and descriptions of all the major and minor angels, compelling stories of angelic intervention, prayers to angels, and much more. Original.",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Tale of Jemima Puddle-Duck (#9 of Potter's 23 Tales)",
        "Authors": "By Potter, Beatrix",
        "Description": "",
        "Category": "",
        "Publisher": "Frederick Warne & Co., Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1936"
        }
    },
    {
        "Title": "Southern Living 2003 Garden Annual",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Insects (DK Pockets)",
        "Authors": "By Mound, Laurence A. and Brooks, Stephen J.",
        "Description": "",
        "Category": " Juvenile Nonfiction , Animals , Insects, Spiders, etc.",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Travelling With Your Pet: The AAA Pet Book (Traveling With Your Pet)",
        "Authors": "By Psarakis, Cynthia (EDT)",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "AAA",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Blue Jean Teddy Snuggle Up in Cross Stitch (Leisure Arts #3763)",
        "Authors": "By Art Impressions, Leisure Arts",
        "Description": "",
        "Category": "",
        "Publisher": "Leisure Arts",
        "Price Starting With ($)": "8.61",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "New Color Schemes Made Easy (Better Homes and Gardens Home)",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "This revised edition offers all-new material showcasing the latest trends in color palettes for the home. Chapters are organized by color and feature inspirational photos of real-life decorated rooms that illustrate different ways to combine the dominant color with other hues to achieve a variety of effects. Each room photo is accompanied by a palette of color swatches showing the relative amounts of each color to use to re-create the scheme. A special bonus section at the back of the book features all the color-swatch palettes, which a reader can tear out and take to the store to match up to paint chips.",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Faerie Path #2: The Lost Queen: Book Two of The Faerie Path",
        "Authors": "By Jones, Frewin",
        "Description": "Tania is a princess of Faerie.   And now she must return to the Mortal World.   Once upon a time, Tania was an ordinary girl. But then she was swept into another world, where she was the long-lost princess of the elegant and magical court of Faerie, and only she could save the court from great peril.   Now Tania—and her true love, Edric—will go back to the Mortal Realm to seek Queen Titania, lost hundreds of years ago while searching for Tania.   Their return leads to struggles with Tania's much-loved mortal parents and friends as she and Edric try to conceal their secret. But much more serious dangers lurk: The sinister Lord Drake is not yet defeated, they are pursued by dark supernatural forces, and Tania's two worlds are about to collide in amazing and frightening ways she never could have anticipated.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Harcourt School Publishers Trophies: ELL Reader Grade 2 What Do You Play?",
        "Authors": "By Hsp (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HARCOURT SCHOOL PUBLISHERS",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Tricks with Dollar Bills",
        "Authors": "By Duy Nguyen",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling Publishing Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Operation Weatherkill (Expeditor #13) (Pyramid Adventure, V3874)",
        "Authors": "By Edwards, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Pyramid",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Scorpia Rising (Alex Rider)",
        "Authors": "By Horowitz, Anthony",
        "Description": "Scorpia has dogged Alex Rider for most of his life. They killed his parents, they did their best to con Alex into turning traitor, and they just keep coming back with more power. Now the world's most dangerous terrorist organization is playing with fire in the world's most combustible land: the Middle East. No one knows Scorpia like Alex. And no one knows how best to get to Alex like Scorpia. Until now. The chases have never been more intense, the fights more treacherous, or the risks so perilous to mankind. And this time, Alex won't get away.",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Philomel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Origami with Dollar Bills",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling Publishing Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Harcourt School Publishers Trophies: ELL Reader Grade 2 Water & Weather",
        "Authors": "By Hsp (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HARCOURT SCHOOL PUBLISHERS",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Hope for a Woman's Soul",
        "Authors": "By Zondervan Publishing, Omartian, Stormie",
        "Description": "Women&apos;s lives are complex and sometimes overwhelming. The world seems to be spinning faster and faster and there are always more tasks to do. But as the apostle Paul reminds us in Romans 5, 'suffering produces perseverance, perseverance character, and character hope. And hope does not disappoint us because God has poured out his love into our hearts by the Holy Spirit. Hope for a Woman&apos;s Soul, the newest in our line of gift books from the Women of Faith, pours that same love of God into women&apos;s hearts. Encouraging Scripture verses from the New International Version are combined with devotional thoughts from best selling authors such as Barbara Johnson, Patsy Clairmont, Sheila Walsh, Marilyn Meberg, Luci Swindoll, and Thelma Wells. This lovely book with full-color photography throughout. It is a great follow up to other Women of Faith gift books, Joy for a Woman&apos;s Soul and Grace for a Woman&apos;s Soul.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Inspirio",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Henry And Mudge And The Wild Wind: Ready-To-Read Level 2  (Paper)",
        "Authors": "By Rylant, Cynthia and Stevenson, Sucie (ILT)",
        "Description": "Henry and his dog Mudge weather a storm in this twelfth Ready-to-Read book of their adventures.Henry and his 180-pound dog Mudge are best friends forever. And when a storm comes, they face wind, thunder, and lightning!",
        "Category": " Juvenile Fiction , Animals , Pets",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Quest Begins (Seekers, Book 1)",
        "Authors": "By Hunter, Erin",
        "Description": "The first book in a thrilling animal fantasy series following the epic journey of three bears, from the #1 nationally bestselling author of Warriors.When three young bears from different species—black, polar, and grizzly—are separated from their families, fate brings them together on a path that will change their lives forever. Along the way, they will face great danger, terrible tragedies, new landscapes, and situations that require all their ingenuity to survive.For fans of Warriors, Survivors, and animal fantasy series like Wings of Fire and Foxcraft, Seekers is a sweeping and incredible journey through the beautiful, dangerous world of wild bears.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Harcourt School Publishers Trophies: Ell Reader Grade 2 a Happy Cat",
        "Authors": "By Hsp (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HARCOURT SCHOOL PUBLISHERS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Healing Through Spiritual Warfare",
        "Authors": "By Scarborough, Peggy",
        "Description": "Fight for WellnessGod wants you well. God's agenda is healing. This book shows you what God thinks about healing, as well as the early church. It also tells you of healings today. To receive healing, you will learn how to:    Use      the Word of God, the Name of Jesus, and the Blood of Jesus    Praise      Him from the depths of your being    Break      generational curses that cause suffering    Enjoy      daily communion with a healing Father    Select      the best foods for a whole, healthy body    Pray      personally and corporatelyIf you want to be healed, if you want to help others to be healed—the answers are at your fingertips.",
        "Category": " Religion , Christian Life , Spiritual Warfare",
        "Publisher": "Treasure House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Leadership: The Warrior's Art",
        "Authors": "By Kolenda, Christopher D. (EDT), McCaffrey, Barry R. (FRW), and Ulmer, Walter F., Jr. (INT)",
        "Description": "This bold, wide-ranging collection brings together some of the most noted military minds, past and present, to examine the crucial role of leadership in combat.",
        "Category": " History , Military , Strategy",
        "Publisher": "Army War College Foundation Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "A Day in the City, Ell Grade 2: Harcourt School Publishers Trophies",
        "Authors": "By Hsp (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HARCOURT SCHOOL PUBLISHERS",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Contrarian's Guide to Leadership",
        "Authors": "By Bennis, Warren G. (FRW) and Sample, Steven B.",
        "Description": "In this offbeat approach to leadership, college president Steven B. Sample-the man who turned the University of Southern California into one of the most respected and highly rated universities in the country-challenges many conventional teachings on the subject. Here, Sample outlines an iconoclastic style of leadership that flies in the face of current leadership thought, but a style that unquestionably works, nevertheless. Sample urges leaders and aspiring leaders to focus on some key counterintuitive truths. He offers his own down-to-earth, homespun, and often provocative advice on some complex and thoughtful issues. And he provides many practical, if controversial, tactics for successful leadership, suggesting, among other things, that leaders should sometimes compromise their principles, not read everything that comes across their desks, and always put off decisions.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "13.53",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Barron's AP Calculus (Barron's How to Prepare for AP Calculus Avanced Placement Examination)",
        "Authors": "By Bock, David and Hockett, Shirley O.",
        "Description": "Both Calculus AB and Calculus BC are covered in this comprehensive AP test preparation manual. Prospective test takers will find four practice exams in Calculus AB and four more in Calculus BC, with all questions answered and explained. The manual also provides a detailed 10-chapter review covering topics for both exams. Students who choose to purchase the optional book and CD-ROM combination will get two additional practice tests, one in Calculus AB, and the other in Calculus BC. The authors also offer an overview of the AP Calculus exams, which includes good advice to students on making best use of their graphing calculator.",
        "Category": " Mathematics , Calculus",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Art and Science of Fencing",
        "Authors": "By Evangelista, Nick",
        "Description": "Often thought of as an activity just for actors or an elite few, fencing is actually an ideal sport for people of all ages. Fencing develops dexterity, endurance, flexibility, grace, and overall fitness, while also allowing participants the opportunity to hone the mind's problem-solving abilities. It is easily learned and practiced by both young and old, men and women, boys and girls. It has even been molded to fit the needs of the blind and individuals using wheelchairs. This is truly a sport for everyone.   The Art and Science of Fencing covers everything from the history of the sport to the specifics of fencing technique, including the psychology of fencing, types of fencing weapons, biographies of great fencers, and information on selecting a fencing school and getting started in the sport. This book is a necessity for everyone who's ever seen an Errol Flynn movie and thought \"Hey, that could be me!\"",
        "Category": " Sports & Recreation , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Larryboy--the Good, the Bad, and the Eggly",
        "Authors": "By Moore, Michael (ILT) and Redeker, Kent",
        "Description": "LarryBoy and fellow superhero, Dark Crow, scramble to learn a lesson in sharing. But it doesn’t come over-easy when they discover Greta Von Gruesome and Awful Alvin are the terrible team of trouble that has struck Bumblyburg with their new invention—the Over-Easy-Egg ray! Everything turns into a hard-boiled mess as this deceptive duo zaps everything in sight. LarryBoy has to learn that sharing means working together as he and Dark Crow team up to share the responsibilities of fighting this crime. Will LarryBoy learn that sharing means working together? Will he learn it before he and Dark Crow become the world’s biggest superhero omelet? See what happens in this exciting Larryboy adventure!Big Idea Productions: Sunday morning values, Saturday morning fun!Through imaginative and innovative products, Zonderkidz is feeding young souls.",
        "Category": " Juvenile Fiction , Religious , General",
        "Publisher": "Zonderkidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Jonah and the Whale and Other Bible Stories (First Bible Stories)",
        "Authors": "By Jan Payne",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Pocket Protein Counter",
        "Authors": "By Natow, Annette B. and Heslin, Jo-Ann",
        "Description": "Two nationally recognized nutrition experts present a portable, easy-to-use guide that lists the protein, fat, carbohydrate, and calorie values for more than 1,800 brand-name and generic foods. Original.",
        "Category": " Health & Fitness , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Joseph: Little Children's Bible Books",
        "Authors": "By De Graaf, Anne and Montero, Jose Perez (ILT)",
        "Description": "Retells the story of Joseph, his colorful coat, and his adventures in Egypt, as a spider offers comments and asks questions for the reader to consider.",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Reading Comprehension Success (Skill Builders (Learningexpress))",
        "Authors": "By Chesla, Elizabeth L.",
        "Description": "Anyone preparing to take a job-related exam that tests for basic language, math, and/or critical thinking skills. High school or college students and adults who need basic skills improvement to perform better in the classroom or on the job.",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "LearningExpress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "MHQ: The Quarterly Journal of Military History: Summer 2005 Vol. 17; Issue 4",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "PriMedia, Inc",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "In the middle of the trees",
        "Authors": "By Karla Kuskin",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "18.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Basic Christian Beliefs: Family Nights Tool Chest (A Heritage Builders Book : Family Night Tool Chest Book 2)",
        "Authors": "By Nappa, Mike, Weidmann, Jim, and Nappa, Amy",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Chariot Victor Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "National Geographic Traveler China (National Geographic Traveler)",
        "Authors": "By Harper, Damian",
        "Description": "The National Geographic Traveler  Spain    In-depth site descriptions and background information  Insightful features on history, culture, and contemporary life  More than 280 vivid color photographs  31 detailed, full-color maps  Mapped walking, biking, and river tours  Specially commissioned artwork  Clear, easy-to-use design  Complete visitor information plus hotels, restaurants, shopping, entertainment, and festivals",
        "Category": " Travel , Asia , China",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Integrated Principles of Zoology 8th edition by Hickman, Cleveland P., etc. (1988) Hardcover",
        "Authors": "By Hickman, Cleveland P., etc.",
        "Description": "",
        "Category": "",
        "Publisher": "Times Mirror/Mosby College Pub",
        "Price Starting With ($)": "10.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Enforcer: The Story of \"Happy Jack\" Burbridge",
        "Authors": "By Burbridge, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "Acclaimed Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Chasing Fire",
        "Authors": "By Roberts, Nora",
        "Description": "The number-one New York Times-bestselling author delves into the world of elite firefighters who thrive on danger and adrenaline-men and women who wouldn't know how to live life if it wasn't on the edge.  There's little as thrilling as firefighting-at least to Rowan Tripp. The Missoula smoke jumpers are in Rowan's blood: her father is a legend. She's been fighting fires since her eighteenth birthday. At this point, returning to the wilds of Montana for the season feels like coming home-even with reminders of the partner she lost last season still lingering. Fortunately, this year's rookie crop is one of the strongest ever-and Gulliver Curry's one of the best. He's also a walking contradiction, a hotshot firefighter with a big vocabulary and a winter job at a kids' arcade. Everything is thrown off balance when a dark presence lashes out against Rowan, looking to blame someone for last year's tragedy. Rowan knows she can't complicate things with Gull-any distractions in the air or on the ground could mean the end-but if she doesn't find someone she can lean on, she may not make it through the summer. . . .",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "The Mozart Conspiracy: A Novel (Ben Hope)",
        "Authors": "By Mariani, Scott",
        "Description": "A centuries-old mystery. An “accidental” death. A conspiracy that may end in murder. Former British Special Air Service officer Ben Hope is running for his life. Enlisted by Leigh Llewellyn—the beautiful, world-famous opera star and Ben’s first love—to investigate her brother, Oliver’s, mysterious death, Ben finds himself caught up in a puzzle dating back to the 1700s. At the time of his death, Oliver was working on a new book about Mozart. Though the official report states that Oliver died in a tragic accident, the facts don’t add up. But as Ben and Leigh dig deeper, they find that Oliver’s research reveals that Mozart, a notable Freemason, may have been killed by a shadowy and powerful splinter group of the organization. The only proof lies in a missing letter, believed to have been written by Mozart himself. When Leigh and Ben receive a video documenting a ritual sacrifice performed by hooded men, they realize that the sect is still in existence today and will stop at nothing to keep its secrets. From the dreaming spires of Oxford and Venice’s labyrinthine canals to the majes­tic architecture of Vienna, Ben and Leigh must race across Europe to uncover the truth behind the Mozart conspiracy before they become its next victims. In the tradition of Robert Ludlum and Dan Brown, Scott Mariani’s The Mozart Conspiracy is an electrify­ing thriller and the start of an exciting new series.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Fabulous Fizz: Choosing Champagne and Sparkling Wine for Every Occasion",
        "Authors": "By Cassidy, Peter (PHT), Cassidy, Peter, and King, Alice",
        "Description": "Offers advice on how to choose a champagne based on its body and color, which wines to drink on special occasions, and includes recipes for making champagne cocktails.",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Pillsbury Appetizers: Small Bites Packed with Big Flavors from America's Most Trusted Kitchens",
        "Authors": "By Pillsbury Company",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Merry Christmas Ornaments",
        "Authors": "By Leisure Arts",
        "Description": "",
        "Category": "",
        "Publisher": "Leisusre Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Girl Who Disappeared Twice (Forensic Instincts, 1)",
        "Authors": "By Kane, Andrea",
        "Description": "She couldn&#39;t stop it.Not then.Not now.If she&#39;d only turned her head, she would have seen the car containing her daughter, struggling to get out. Struggling to escape her kidnapper.Despite all her years determining the fates of families, veteran family court judge Hope Willis couldn&#39;t save her own. Now she&#39;s frantically grasping at any hope for Krissy&#39;s rescue. Her husband dead&#150;set against it, she calls Casey Woods and her team of renegade investigators,Forensic Instincts.A behaviorist.A techno&#150;wizard.An intuitive.A former Navy SEAL. Unconventional operatives.All with unique talents and personal reasons for being part of Casey&#39;s group, they&#39;ll do whatever it takes.Able to accurately read people after the briefest of encounters, Casey leads her crew to Krissy&#39;s home. There, she picks up the signs of a nervous spouse, a guilty conscience, a nanny that hides on her cell. She watches as secrets beg to creep into the open.Forensic Instincts will dig through each tiny clue and eliminate the clutter. But time is running out, and even working around the clock, the authorities are bound by the legal system. Not so Casey&#39;s team. For they know that the difference between Krissy coming back alive and disappearing forever could be as small as a suspect&#39;s rapid breathing, or as deep as Hope&#39;s dark family history.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Speak Like a Pro: In Business and Public Speaking",
        "Authors": "By Bedrosian, Margaret McAuliffe",
        "Description": "Focuses on using public speaking as a marketing and promotional tool to convince the prospective client that yours is the one organization with whom they want to do business. Enables readers, especially those who have a fear of public speaking to become more comfortable, competent and confident in their communication skills. Provides methods of honing down a formal or technical presentation to an understandable level. Explains the process of preparation and delivery along with simple, successful strategies for creating results. Includes checklists and guidelines to help master the art of painless public speaking.",
        "Category": " Language Arts & Disciplines , Public Speaking",
        "Publisher": "Wiley",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "MacArthur: his rendezvous with history",
        "Authors": "By Whitney, Courtney",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Impact of Freudian Psychiatry",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Phoenix Press",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Broken Promises (Cedar River Daydreams #5)",
        "Authors": "By Baer, Judy",
        "Description": "Lexi Leighton's friend Peggy has become deeply involved with Chad, and when the fun ends and the trouble takes over, Lexi must try to help her deal with the consequences.",
        "Category": "",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Take Better Photographs",
        "Authors": "By Busselle, Michael",
        "Description": "Surveys the foundations of picture making, the art of composition, and the use of cameras and equipment in addition to offering suggestions for taking more imaginative and professional photographs",
        "Category": " Photography , General",
        "Publisher": "Better Books Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "Moment of Glory: The Year Underdogs Ruled Golf",
        "Authors": "By Feinstein, John",
        "Description": "In 2003, after winning six of the twelve majors from 2000 to 2002, Tiger Woods struggled with his swing, leaving him lagging behind the field at both the U.S. Open and the PGA Championship. With Woods out of the picture, the stage was set for a newcomer to claim the top position. Nobody expected that four virtual unknowns would become first-time champions. In his debut in a major, Ben Curtis became the only player since 1913 to prevail on his first time out. Mike Weir--considered good but not great--triumphed in the Masters, becoming the first Canadian to win a major. In the U.S. Open, Jim Furyk was victorious, and the PGA Championship was claimed by the unknown Shawn Micheel. Here, John Feinstein returns to that unlikely year to chronicle the struggles of these four players, giving readers an insider's look into how winning (and losing) major championships changes players' lives.--From publisher description.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Dictionary of Electronics and Nucleonics",
        "Authors": "By Hughes, L. E. C. Et Al",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "15.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "New Directions : Second Series",
        "Authors": "By Bower, Warren",
        "Description": "",
        "Category": "",
        "Publisher": "J.B. Lippincott",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1941"
        }
    },
    {
        "Title": "How Will the Easter Bunny Know?",
        "Authors": "By Weston, Martha (ILT) and Winters, Kay",
        "Description": "Mike is excited to visit his grandmother for Easter, until his friend Tony tells him that the Easter Bunny only visits houses where kids live, so Mike comes up with a plan to let the Bunny know where to find him. Simultaneous.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The Odyssey of Homer a Modern Translation",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row (Harper torchbooks)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1968"
        }
    },
    {
        "Title": "Words from a Fearless Heart: A Collection of Wit, Wisdom, and Whimsy",
        "Authors": "By Wilder, Laura Ingalls and Hines, Stephen W. (EDT)",
        "Description": "Laura Ingalls Wilder has long been admired for being a strong, yet sensitive, woman ahead of her time. She felt that in order to appreciate how far you have come, as a nation and as a people, you must first know where you began. Wilder believed that Americans needed only to be reminded of the things that made them great: not automobiles and airplanes, but self-reliance and character. And so it is to her rediscovered journalistic writings that Words from a Fearless Heart turns - to inform you of Laura's point of view about the things that really matter.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Fun with the Family in Connecticut (Fun with the Family Series)",
        "Authors": "By Boyle, Doe",
        "Description": "",
        "Category": " Travel , United States , Northeast , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "8.97",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Taste of Home's Down-Home Diabetic Cookbook",
        "Authors": "By Julie Schnittka",
        "Description": "",
        "Category": "",
        "Publisher": "Taste of Home Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Flowers in the Kitchen: A Bouquet of Tasty Recipes",
        "Authors": "By Belsinger, Susan",
        "Description": "Discusses the use of flowers in cooking and how to grow edible flowers, and shares recipes for dishes using flowers, from the blossoms on common garden herbs to daylilies, marigolds, roses, and yucca",
        "Category": " Cooking , Reference",
        "Publisher": "Interweave Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Israel at the Crossroads: Fifty Years and Counting",
        "Authors": "By Dolan, David",
        "Description": "",
        "Category": " History , Middle East , Israel & Palestine",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Far East Cafe: The Best of Casual Asian Cooking (Casual Cuisines of the World)",
        "Authors": "By Jue, Joyce",
        "Description": "Offers recipes for Asian snacks and appetizers, salads, soups, noodles, rice, main dishes, and desserts",
        "Category": " Cooking , Regional & Ethnic , Asian",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Power of Praying: Help for a Woman's Journey Through Life",
        "Authors": "By Omartian, Stormie",
        "Description": "A collection of more than 120 devotions, culled from the author's best-selling works, invites women to embrace a more meaningful prayer life and covers such topics as life priorities, family, realizing one's dreams, understanding God's will, and the gifts of faith.",
        "Category": " Religion , Devotional",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Spooky Stories (a haunting collection of ghostly tales and creepy rhymes)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Charon's Landing",
        "Authors": "By Du Brul, Jack B.",
        "Description": "Paid millions of dollars by a rogue Arab oil minister to sabotage the Alaska pipeline, Russian mastermind Ivan Kerikov accidentally crosses paths with geologist Philip Mercer, who begins to unravel a tangled web of ecological and economic terrorism. Reprint.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Travail and Triumph (The Russians, Book 3)",
        "Authors": "By Phillips, Michael R. and Pella, Judith",
        "Description": "The aristocratic Fedorcenko family of St. Petersburg and a humble peasant family from Katyk, the Burenins, both face an uncertain future when revolutionaries plot to overthrow the tsar",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Compleat Pentagon Capers",
        "Authors": "By Thomas, Walter R.",
        "Description": "",
        "Category": "",
        "Publisher": "G&W Publications",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Blending Temperaments",
        "Authors": "By Ward, Ruth McRoberts",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "PANCAKES AT FOUR",
        "Authors": "By Sherman, Farnk A.",
        "Description": "",
        "Category": "",
        "Publisher": "EXPOSITION PRESS",
        "Price Starting With ($)": "7.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Two Memoirs Of Renaissance Florence - Diaries Of Buonaccorso Pitti & Gregorio Dati",
        "Authors": "By Pitti, Buonaccorso, Dati, Gregorio, and Brucker, Gene, Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Harper Torchbks/Harper & Row",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "A Lady of Secret Devotion (Ladies of Liberty, Book 3)",
        "Authors": "By Peterson, Tracie",
        "Description": "When insurance investigator Mark Langford reveals to Cassandra Stover that he is investigating her employer's son, Sebastian Jameston, she agrees to pretend they are courting so that he can get close to the Jameston family.",
        "Category": " Fiction , Christian , Historical",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "No Legal Grounds",
        "Authors": "By Bell, James Scott",
        "Description": "How far will a man go to protect his family? Attorney Sam Trask will go farther than he ever dreamed, even in his worst nightmare. Because his worst nightmare is about to come true… At age forty-seven, attorney Sam Trask finally seems to have his life in order. The dark years of too much drinking and all-consuming ambition have given way to Christian faith. His marriage is strong again. Everything seems finally on the right track. Then a voice from the past comes back to say hello. Suddenly Sam faces a danger more real than he ever imagined—danger from someone who will not rest until Sam’s life comes crashing down around him. Desperate, Sam seeks protection from the law he’s served all his life. But when the threats are turned on his family, and the law seems powerless to protect them, Sam must consider a choice that strikes at the heart of his life and faith—whether to take the law into his own hands.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The Spear of Tyranny",
        "Authors": "By Hunt, Angela Elwell and Jeffrey, Grant R.",
        "Description": "The unforgettable sequel to By Dawn's Early Light. A tale of faith, love, terror- and hope.It seems like a dream come true.Especially to a world ravaged by war and exhausted by drought. Especially to a society grown fearful from widespread crime and mystified by mass disappearances and unprovoked animal attacks. And especially to a young Israeli couple devastated by their own, very personal loss and unable to reach out to each other in their private pain.After centuries of war and decades of crime, the prospect of international harmony is tantalizing the tiny nation of Israel. After millennia of waiting, the prospect of a rebuilt Temple on Jerusalem's holy mount seems a miraculous gift. And to Israeli Major Isaac Ben-David, disillusioned by loss and hungry for meaning, the opportunity to work for peace is all but irresistible.Isaac's opportunity lies with Adrian Romulus, the president of the European Union Council of Ministers. He's a charismatic, visionary world leader with a workable plan for solving the world's problems. Tall, handsome, and deeply spiritual, he is also personally interested in the nation of Israel. Everyone agrees he's a man who can bring peace to a troubled world.But why do thoughts of Romulus trouble Isaac's wife, Sarah, an Israeli security officer? How can Romulus know Isaac and Sarah's most private secrets? And why is he so obsessed with an ancient spearhead in an Austrian museum?Just who is Adrian Romulus, anyway? And what are his plans for Isaac Ben-David-and the world?",
        "Category": " Fiction , Religious",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Bird in the Hand (Sammy and Brian Mystery Ser)",
        "Authors": "By Munro, Ken",
        "Description": "",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Masthof Pr",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "First Atlas",
        "Authors": "By Robert Snedden",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Books",
        "Price Starting With ($)": "11.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The story of the White House (Cornerstones of freedom)",
        "Authors": "By Miller, Natalie",
        "Description": "",
        "Category": "",
        "Publisher": "Children's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Life After Debt: How to Repair Your Credit and Get Out of Debt Once and for All",
        "Authors": "By Hammond, Bob",
        "Description": "The author of How to Beat the Credit Bureaus discusses the causes of indebtedness and teaches people how to solve their credit problems and establish good credit. 25,000 first printing. Tour.",
        "Category": "",
        "Publisher": "Career Pr Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The New Bible Cure For Sleep Disorders: Ancient Truths, Natural Remedies, and the Latest Findings for Your Health Today (New Bible Cure (Siloam))",
        "Authors": "By Colbert, Don",
        "Description": "Sleep Disorders What would you give for a good night’s sleep?   Do you spend too many nights tossing and turning? Do you wake up in the morning still feeling tired? Uncover God’s natural plan to refresh, rejuvenate, and restore you. In this concise, easy-to-read book you’ll discover a wealth of practical suggestions to help you win the battle against sleep disorders. Dr. Colbert has taken the confusion away from sleep disorders and made it simple and easy to understand. This book contains information that your doctor never may have told you, including...      The dangerous effects of sleep deprivation     The link between poor diet and insomnia     The power of a good nap  You want to be healthy. God wants you to be healthy. Now, this highly anticipated revised and expanded edition from the Bible Cure series is available to help you get healthy body, mind, and spirit.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Siloam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Daily Show with Jon Stewart Presents America (The Audiobook): A Citizen's Guide to Democracy Inaction",
        "Authors": "By Stewart, Jon, Bee, Samantha (NRT), Colbert, Stephen (NRT), Corddry, Rob (NRT), and Helms, Ed (NRT)",
        "Description": "Jon Stewart, host of the Emmy and Peabody Award-winning \"The Daily Show\", and his coterie of patriots deliver a hilarious look at American government . . . Termed a \"political king-maker\" by Newsweek, and \"the Dan Rather of infotainment\" by Vanity Fair, Jon Stewart, along with the writers of \"The Daily Show\", combines his riotous wit and razor-sharp insight in this hilarious book.American-style democracy is the world's most beloved form of government, which explains why so many other nations are eager for us to impose it on them. But what is American democracy?In America (The Book), Jon Stewart and \"The Daily Show\" writing staff offer their insights into our unique system of government, dissecting its institutions, explaining its history and processes, and exploring the reasons why concepts like \"One man, one vote,\" \"Government by the people,\" and \"Every vote counts\" have become such popular urban myths.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "9.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Hazel Meyer's Freezer Cook Book",
        "Authors": "By Meyer, Hazel",
        "Description": "",
        "Category": "",
        "Publisher": "J. B. Lippincott",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "God Save the Fan: How Steroid Hypocrites, Soul-Sucking Suits, and a Worldwide Leader Not Named Bush Have Taken the Fun Out of Sports",
        "Authors": "By Leitch, Will and Cooke, Jim (ILT)",
        "Description": "Arch and unrepentant, Will Leitch, founding editor of Deadspin.com, is the mouthpiece for all the frustrated fans who just want their games back from big money, bloated egos, and blathering sportscasters. Always a fan first and a sportswriter second, Leitch considers the perfection of fantasy leagues and the meaninglessness of the steroids debate as he exposes Olympic fetishes, parses Shaq's rap attack on Kobe, shares a brew with John Rocker and his surprising girlfriend, and reveals what ESPN and the beer companies really think about you. If you or a fan you love is suffering from a sense of listless dissatisfaction brought on by the leagues and networks, God Save the Fan is your new manifesto.",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Proverbs to Live By, Truths That Live in Words with Woodcuts by Fritz Kredel",
        "Authors": "By Peterson, Gail, compiler",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Barbecue!: From the Reynolds Wrap Kitchens",
        "Authors": "By Reynolds Metals Co.",
        "Description": "More than four hundred full-color photographs illustrate numerous recipes and barbecuing techniques that cover main dishes, side dishes, and desserts--all prepared on the grill",
        "Category": " Cooking , General",
        "Publisher": "Random House, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "If That Breathes Fire, We're Toast",
        "Authors": "By Stewart, Jennifer J.",
        "Description": "When twelve-year-old Rick and his mother move from San Diego to Tucson, he is not too happy about the change until he makes friends with his neighbor Natalie and together they discover a testy fire-breathing, time-traveling dragon named Madam Yang who takes them on a journey of a lifetime. Reprint.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Basic Book of Photography (A Plume book)",
        "Authors": "By Grimm, Tom",
        "Description": "The Basic Book of Photography tells everything you need to know about cameras, lenses, flashes, filters, and other equipment. You'll also learn about lens openings (f/stops) and shutter speeds, depth of field for focus control, exposure metering systems, the elements of composition and how you can use them to create the most effective photographs, and much more. To help you make the best use of the latest methods and technologies in the photographic field, this thoroughly revised edition also covers computerized features on 35mm single-lens reflex (SLR) cameras, innovative Advanced Photo System (APS) cameras, and electronic imaging with digital cameras.",
        "Category": "",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "My Brother, My Sister, and I",
        "Authors": "By Watkins, Yoko Kawashima",
        "Description": "Living as refugees in Japan in 1947 while trying to locate their missing father, thirteen-year-old Yoko and her older brother and sister must endure a bad fire, injury, and false charges of arson, theft, and murder",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Jihad Incorporated: A Guide to Militant Islam in the Us",
        "Authors": "By Emerson, Steven",
        "Description": "What is the structure of al Qaeda and radical Islamic activity in the United States today? How has it evolved since 9/11? To what extent does domestic radical Islamism pose a threat to US national security at home and abroad? The Investigative Project on Terrorism, founded in 1995 by Steven Emerson, maintains the largest nongovernmental data and intelligence library in the world on militant Islam. The Project assists the White House, the FBI, the Justice Department, Department of Homeland Security, and other government departments with counterterrorism activities. Together with a staff of experts, Executive Director Steven Emerson has compiled this thorough factual overview of the Islamist terrorist threat to the United States. Unlike The 9/11 Commission Report, which was focused mainly on the retrospective analysis of al Qaeda activities leading up to the attack of September 11, 2001, Jihad Incorporated provides an in-depth examination of radical terrorist organizations and their financial support networks operating in the United States and abroad. Divided into three sections, the work first sets the stage for the current situation by reviewing the lessons learned from previous terrorist plots and attacks both within our borders and against American interests abroad. Emerson and colleagues profile key players in the terrorist network and describe their various criminal activities before and since 9/11. The second section analyzes organizations in the Middle East besides al Qaeda that have established ties in the United States: Hamas, Hizballah, the Palestinian Islamic Jihad, and radical groups in Pakistan. The third section analyzes the subtle, wide-ranging support system for terrorist activities that exists within our own borders: charities and foundations that secretly solicit for terror; the complex corporate web of companies, charities, and nonprofit corporations known as the SAAR Network; mosques that provide cover for terrorists; the use of the Internet for terrorist communication; and lobbying efforts by Muslim American organizations to influence the top echelons of the federal government. In a dangerous age, this is an important book for all Americans to read.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Prometheus",
        "Price Starting With ($)": "6.13",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The writer's handbook",
        "Authors": "By Lefcowitz, Allan B.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    }
]