[
    {
        "Title": "The Silent Language",
        "Authors": "By Hall, Edward T.",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Premier",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Sin Killer: The Berrybender Narrative, Book 1 (The Berrybender Narratives)",
        "Authors": "By McMurtry, Larry",
        "Description": "From Pulitzer Prize-winning author Larry McMurtry comes the first leg of an epic journey through the early American frontier, introducing a pioneer family the likes of which you will never forget.  It is 1830, and the Berrybender family -- rich, aristocratic, English, and hopelessly out of place -- is on its way up the Missouri River to see the untamed West as it begins to open up. With irascible determination -- and a great deal of outright chaos -- the party experiences both the awesome majesty and brutal savagery of the unexplored land, from buffalo stampedes and natural disasters to Indian raids and encounters with frontiersmen and trappers, explorers, pioneers, and one part-time preacher known as \"the Sin Killer.\" Packed with breathtaking adventure, charming romance, and a sense of humor stretching clear over the horizon, Sin Killer is a truly unique view of the West that could only come from the boundless skill and imagination of Larry McMurtry.",
        "Category": " Fiction , Literary",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Among the Anti-Americans",
        "Authors": "By Morgan, Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "HOLT, RINEHART AND WINSTON",
        "Price Starting With ($)": "36.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Sweet Dreams for Sally (Care Bears)",
        "Authors": "By Cooke, Tom (ILT) and Hubert, Amelia",
        "Description": "Sally's fear of the dark keeps her awake at night and makes her grouchy in the morning until Grumpy Bear and Bedtime Bear come to her rescue.",
        "Category": "",
        "Publisher": "Parker Brothers",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Defiance",
        "Authors": "By Tec, Nechama",
        "Description": "The prevailing image of European Jews during the Holocaust is one of helpless victims, but in fact many Jews struggled against the terrors of the Third Reich. In Defiance, Nechama Tec offers a riveting history of one such group, a forest community in western Belorussia that would number more than 1,200 Jews by 1944--the largest armed rescue operation of Jews by Jews in World War II.Tec reveals that this extraordinary community included both men and women, some with weapons, but mostly unarmed, ranging from infants to the elderly. She reconstructs for the first time the amazing details of how these partisans and their families--hungry, exposed to the harsh winter weather--managed not only to survive, but to offer protection to all Jewish fugitives who could find their way to them.  Arguing that this success would have been unthinkable without the vision of one man, Tec offers penetrating insight into the group's commander, Tuvia Bielski. Tec brings to light the untold story of Bielski's struggle as a partisan who lost his parents, wife, and two brothers to the Nazis, yet never wavered in his conviction that it was more important to save one Jew than to kill twenty Germans. She shows how, under Bielski's guidance, the partisans smuggled Jews out of heavily guarded ghettos, scouted the roads for fugitives, and led retaliatory raids against Belorussian peasants who collaborated with the Nazis.Herself a Holocaust survivor, Nechama Tec here draws on wide-ranging research and never before published interviews with surviving partisans--including Tuvia Bielski himself--to reconstruct here the poignant and unforgettable story of those who chose to fight.",
        "Category": " History , Military , World War II",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "All About Hedge Funds : The Easy Way to Get Started",
        "Authors": "By Jaeger, Robert A.",
        "Description": "Hedge funds have long been viewed as mysterious, high-risk investments, unsuitable for most investors. All About Hedge Funds debunks these myths and explains how any investor can take advantage of the high-potential returns of hedge funds while incorporating safeguards to limit their volatility and risk. This clear-headed, commonsense guide tells investors:What hedge funds are--and what they are notFour key hedge fund strategiesHow to incorporate hedge funds into an existing portfolioTypes of risk involved in hedge fund investing",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Who Belongs Here?: An American Story",
        "Authors": "By Knight, Margy Burns and O'Brien, Anne Sibley (ILT)",
        "Description": "In this probing, plain-spoken book, based on a true story, Margy Burns Knight and Anne Sibley O'Brien, author and illustrator of the acclaimed \"Talking Walls,\" invite young readers to explore the human implications of intolerance. Anecdotes relating the experiences of other refugees and their contributions to American culture play counterpoint to Nary's tale, all enlivened by O'Brien's full-color pastels. A compendium at the end of the book offers more detailed information about Pol, Pot, Ellis Island, and other topics in this text.Who Belongs Here? will lead to discussions aboutThe effects of war on children and familiesRefugees and relocation processes in the U.S.Cambodian cultureU.S. History and attitudes towards immigrationBullying and intoleranceConflict-resolution skills",
        "Category": " Juvenile Fiction , People & Places , General",
        "Publisher": "Tilbury House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Canterbury Tales (Bantam Classics)",
        "Authors": "By Chaucer, Geoffrey",
        "Description": "Lively, absorbing, often outrageously funny, Chaucer’s The Canterbury Tales is a work of genius, an undisputed classic that has held a special appeal for each generation of readers. The Tales gathers twenty-nine of literature’s most enduring (and endearing) characters in a vivid group portrait that captures the full spectrum of medieval society, from the exalted Knight to the humble Plowman. This new edition includes a comprehensive introduction that summarizes some of the most important historical events and movements that defined the world of Chaucer and his pilgrims; two additional tales (Reeve’s and Shipman’s); introductions for each tale designed to prepare the reader for a better understanding and enjoyment of the tale; newly written and conveniently placed explanatory notes; and a new, more easily understood system for learning to pronounce Chaucerian Middle English.",
        "Category": " Fiction , Classics",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Northwest Indian Designs (International Design Library)",
        "Authors": "By Caraway, Caren",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Stemmer House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "In the Realm of a Dying Emperor: Japan at Century's End",
        "Authors": "By Field, Norma",
        "Description": "When the Emperor Hirohito died in 1989, Japanese newspapers had to use a special, exalted word to refer to his death, and had to depict his life uncritically, as one beginning in turbulence but ending in magnificent accomplishment. To do otherwise would have exposed them to terrorism from the vigilant right wing. Yet this insightful book by a Japanese-American scholar who grew up in both cultures reveals the hidden fault lines in the realm of the dying emperor by telling the stories of three unlikely dissenters: a supermarket owner who burned the national flag; an aging widow who challenged the state's \"deification\" of fallen soldiers; and the mayor of Nagasaki, who risked his career and his life by suggesting that Hirohito bore some responsibility for World War II.",
        "Category": " History , Asia , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "God's Little Devotional Book for Men (God's Little Devotional Books)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Learning to Bow: Inside the Heart of Japan",
        "Authors": "By Feiler, Bruce S.",
        "Description": "Learning to Bow has been heralded as one of the most insightful books about the clash of American and Japanese cultures. Bruce Feiler recounts the year he spent teaching inside Japan's renowned school system: watching boys and girls learn gender roles, experiencing the impact of strict school rules, and understanding the roots of Japan's business success.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Let's Look! (Baby Einstein First Look and Find)",
        "Authors": "By Michael P. Fertig",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Great Eight: How to Be Happy Even When You Have Every Reason to Be Miserable",
        "Authors": "By Hamilton, Scott and Baker, Ken (CON)",
        "Description": "Olympic Gold Medal figure skater Scott Hamilton shares his eight secrets to finding happiness in the face of a life filled with challenges, difficulties, and career-canceling odds.With never-been-told, behind-the-scenes stories from the skating world, personal challenges including testicular cancer and a brain tumor, as well as divine miracles, Olympic Gold Medal figure skater Scott Hamilton shares the secrets to his lifelong journey to find the silver (and gold) lining in the clouds of life. His life principles, fashioned into eight secrets that begin with the rote of learning to skate the figure 8, are the keys. Scott says, \"Skating taught me how to be happy. I have always kept these eight as my own private, personal secrets that I practiced daily with repetition, focus, and discipline. Now I want to share them with the world.\"“For the past twenty seven years Scott Hamilton has been a mentor and good friend. I’ve seen first hand the struggles he has had to endure and how he has continued to persevere with a confident attitude. He lives his life as a champion. Everyone needs the positive message of this greatly inspiring book.”-- Kristi YamaguchiOlympic Gold Medalist“I know and love Scotty Hamilton. You will too after you read this book.” --William Shatner“Scott Hamilton is a champion in more ways than one. In addition to being one the world’s greatest ice skaters, he has mastered adversity and a multitude of challenges. The Great Eight is an inspiration to us all.”--Donald J. Trump“Scott's outlook on life continues to influence me in a very positive way, encouraging me to look at challenges in a larger context. Within the metaphors of his skating career, the wisdom in this book is not only very inspiring and easy to grasp, but surrounded by great story telling. I'm so glad he recorded it for the rest of us.”--Brad Paisley, Grammy Award-winning Artist“It’s like my bud Scott says…”you can’t just skate through life and expect to be happy!” So anyone choosing not to buy this book is choosingnot to be happy. Shame on you.” --Kevin NealonActor, Comedian, Saturday Night Live Alum\"A gold medal literary performance from a true Olympic star.\"Richard D. Lamm, Governor of Colorado“For twenty five years I have been a close friend and business advisor to Scott. He is an inspiration to all who know him. I cannot imagine anyone better suited to write on the topic of happiness than Scott Hamilton. Through a lifetime of facing incredible odds he has learned the secrets to maintaining a positive attitude and can-do spirit. Spend time in the pages of this book and you will walk away truly inspired.”Bob KainFormer CEO, IMGCurrent Vice Chairman, Cleveland Browns“After a myriad of setbacks, Scott speaks eloquently about survival in the face of adversity. This book deserves a ‘ten’ and a ‘Personal Best’ too! Bravo!”Dick Button, Two-time Olympic Gold Medalist, Emmy Award-winning skating analyst“In each successive chapter and challenge in his remarkable life—as Olympic champion, as cancer and brain-tumor survivor, as devoted husband and father and man of faith—Scott Hamilton has forged ahead with unquenchable spirit and uncommon joy, always emerging wiser than before. This warm and insightful book will allow its readers to experience the blessing I’ve been privileged to enjoy in person: a delightful, practical, bracingly-honest conversation with one of our national treasures.”Ken Durham, Ph.D., Senior Minister, The University Church of Christ at Pepperdine University",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Complete Book of Asian Cooking",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "New Burlington Books",
        "Price Starting With ($)": "7.67",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Color for Your Winter Yard and Garden",
        "Authors": "By Wilson, Helen Van Pelt",
        "Description": "",
        "Category": "",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "The Will of God",
        "Authors": "By Weatherhead, Leslie D.",
        "Description": "During the tumultuous era of World War II, the city of London shattered under unrelenting bombs dropped by Nazi Germany. Millions of buildings were destroyed or damaged, tens of thousands of civilians were killed, and survivors were left to ask: How can this destruction be part of God’s plan? What is God’s will in all of this?After City Temple in London was reduced to rubble, Rev. Leslie Weatherhead crafted five sermons on understanding the will of God to help his congregation endure religious doubt as their city—and church—crumbled around them. Weatherhead’s sermons were eventually published as The Will of God, a resource that has sold more than a million copies and has been a lifeline for grieving persons seeking to understand God’s purpose for their pain. This revised edition of the classic book includes background information and photos of the historical setting that inspired this book, and a new cover and layout to refresh a timeless message—both for new readers and returning fans.",
        "Category": " Religion , Christian Living , Spiritual Growth",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Race, Class, and Gender in the United States",
        "Authors": "By Rothenberg, Paula S.",
        "Description": "Race, Class, and Gender in the United States: An Integrated Study presents students with a compelling, clear study of issues of race, gender, and sexuality within the context of class. Rothenberg deftly and consistently helps students analyze each phenomena, as well as the relationships among them, thereby deepening their understanding of each issue surrounding race and ethnicity.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Worth Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Pagan Stone (Sign of Seven, Book 3)",
        "Authors": "By Roberts, Nora",
        "Description": "#1 New York Times bestselling author Nora Roberts’ electrifying trilogy comes to an end, as three men and three women join forces—and hearts—to battle the ultimate evil.Years ago, after their blood brother ritual, Gage, Fox, and Caleb each emerged from the woods with a piece of bloodstone. Now, it will become their weapon in the final fight against the demon they awakened. Winner take all… Shared nightmares, visions of blood and fire, and random violence begin to plague the longtime friends and the women bound to them by fate. None of them can ignore the fact that, this year, the demon has grown stronger—feeding off of the terror it creates. But now, the three pieces of the bloodstone have been fused back together. If only they could figure out how to use it. A gambling man like Gage has no trouble betting on his crew to find a way. And though he and Cybil share the gift of seeing the future, that’s all they share. But Gage knows that a woman like Cybil—with her brains and strength and devastating beauty—can only bring him luck. Good or bad has yet to be determined—and could mean the difference between absolute destruction or an end to Hawkins Hollow's nightmare...Don't miss the other books in the Sign of Seven TrilogyBlood BrothersThe Hollow",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Clearing the Air: Asthma and Indoor Air Exposures",
        "Authors": "By Institute of Medicine (U. S.) Committee on the Assessment of Asthma and (COR)",
        "Description": "",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "National Academies Press",
        "Price Starting With ($)": "6.52",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Battle at Teth (Star Wars: The Clone Wars)",
        "Authors": "By Mayer, Kirsten (ADP)",
        "Description": "The war between the Galactic Republic and the Separatist army rages on.  On the planet of Teth, one brave clone captain leads his troops into battle against an overwhelming droid army.  This is his story.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Harriet Beecher Stowe and the Beecher Preachers (Unforgettable Americans)",
        "Authors": "By Fritz, Jean",
        "Description": "Harriet Beecher Stowe grew up in a family in which her seven brothers were expected to be successful preachers and the four girls were never to speak in public. But slavery made Harriet so angry she couldn't keep quiet. Although she used a pen rather than her voice to convince people of the evils of slavery, she became more famous than any of her brothers. She firmly believed that words could make change, and by writing Uncle Tom's Cabin, Harriet Beecher Stowe hastened the Civil War and changed the course of America history. \"Readable and engrossing.\"  -- The Horn Bookn\"Fritz writes with verve and wit....Many kids will be stimulated to go on from here to find out more.\"  -- Booklist (boxed review)",
        "Category": " Young Adult Nonfiction , Biography & Autobiography , Cultural, Ethnic & Regional",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Professional Learning Communities at Work: Best Practices for Enhancing Student Achievement",
        "Authors": "By Dufour, Richard and Eaker, Robert E.",
        "Description": "The book that launched a school improvement movement offers research-based recommendations drawn from the best practices found in schools nationwide for continuously improving school performance. Coming from the perspectives of both a distinguished dean of education and one of America’s most widely acclaimed practitioners, this resource provides specific, practical how-to information about transforming schools into results-oriented PLCs.",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Solution Tree",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Asian (Favorite Brand Name)",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Understanding DNA and Gene Cloning: A Guide for the Curious",
        "Authors": "By Drlica, Karl",
        "Description": "Do You Realize How Much Impact DNA Technology has on Your Life Today? Registering your child's DNA with the police.bold new medical cures.the perfect tomato.gene cloning and DNA manipulation are no longer remote events that will have impact in your life - they are today's headlines! In this highly-acclaimed guide, Karl Drlica fully explains the basis of the ongoing genetic revolution. He guides you through the science and technology you need to understand the issues and make crucial decisions. Each step of the way he explains complex topics using easy-to-understand analogies. This basic information will help you: * Take advantage of the benefits emerging from the new genetics. * Protect yourself from the discrimination that may arise from release of genetic information. * Make informed political decisions about how much DNA technology will impact your life. \"With the Genetic Revolution happening in the court rooms and doctors offices, this book is required reading for jurors, those concerned with genetic disease, or just the curious!\"- Richard R. Sinden, Ph. D., Center for Genome Research, Texas A&M University \"Successful investing in biotechnology requires knowledge of the science which drives it. Karl Drlica explains it in layman's terms.\"- Edward F. Tills, Second Vice President, Financial Consultant, Smith Barney, Inc. \"The best text available to give the non-scientist or the scientist from a different field the necessary information to appreciate the implications of the latest genetic revolution.\"- Robert G. Fowler, Ph.D., San Jose University",
        "Category": " Science , Life Sciences , Cell Biology",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Helping the Child Who Doesn't Fit in",
        "Authors": "By Nowicki, Stephen and Duke, Marshall P.",
        "Description": "Graveyard skeletons shake, rattle, and roll in this spirited Day of the Dead celebration featuring bold and colorful cut-paper illustrations.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Peachtree",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Gray-Eyed Goddess (Tales from the Odyssey, Book 4)",
        "Authors": "By Osborne, Mary Pope and Howell, Troy (ILT)",
        "Description": "For nearly twenty years, Odysseus has fought terrifying giants and monsters, weathered the loss of his men, and angered gods and goddesses. Now he is trapped on the island of the alluring sea goddess, Calypso. Back in Ithaca, his wife, Penelope, and their son, Telemachus, are desperately warding off the suitors who want to marry Penelope in order to take control of Odysseus's island. Then a visit from a mysterious stranger gives Telemachus the courage to confront the suitors, and to head off in search of his long-lost father. Could the stranger be the gray-eyed warrior goddess, Athena?",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , Greek & Roman",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Last Hurrah",
        "Authors": "By O'Connor, Edwin",
        "Description": "The nephew of an old-style Irish-American politician becomes involved in his uncle's last campaign for public office",
        "Category": " Fiction , Political",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "Humanities through The Arts",
        "Authors": "By Jacobus, Lee A. and Martin, F. David",
        "Description": "The Humanities Through the Arts is intended for introductory-level, interdisciplinary courses offered across the curriculum in the humanities, philosophy, art, English, music, and education departments.  Arranged topically by art form - from painting, sculpture, photography, and architecture to literature, music, theater, film, and dance - this beautifully illustrated text helps students learn how to actively engage a work of art. The Fifth Edition is the most extensive revision in the history of this title, yet it retains the popular focus on the arts as an expression of cultural and personal values.",
        "Category": " Psychology , Applied Psychology",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Woman I Left Behind: a Novel",
        "Authors": "By Jensen, Kim",
        "Description": "The Woman I Left Behind is a poetically written novel about a turbulent love affair between a young American woman and a Palestinian refugee. When Irene, an intelligent, committed and discerning student meets Khalid, a Palestinian refugee now living in Southern California, she immediately knows that this man would cause her both immense pain and immense joy. Coming from two separate worlds that are at odds with each other, both Irene and Khalid have to overcome their cultural differences. Irene comes to realize that she has to break free from her parents' norms and values and lead a more meaningful life-a life not guided by superficialities but by a sense of commitment and purpose. After opening her eyes not only to the psychological wounds Khalid suffered during his experiences of war, deportation, and exile, but also to her own childhood wounds, Irene abandons her detached self, ultimately leading to a reconciliation with Khalid.  With its detailed depictions of modern Palestinian history, as well as its cast of colorful characters-from Palestinian feminists to American cyberpunks-Kim Jensen's novel reiterates the vital connections between politics, the imagination, and the most intimate aspects of our lives",
        "Category": " Fiction , General",
        "Publisher": "Curbstone Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Almost Archer Sisters: A Novel",
        "Authors": "By Gabriele, Lisa",
        "Description": "Georgia \"Peachy\" Archer always thought she was happy with her choices in life: quitting college, marrying young, raising two boys in the same small town where she grew up. But just as Peachy's life is beginning to settle into a careful routine, her sister's life begins to dangerously unravel.   Beth Archer chose a different life: fancy apartment in Manhattan, fancy friends, making lots of money. She's been on her own since she was a teenager, and she's still on her own, outgrowing dress styles and boyfriends faster than Peachy can inherit them. But on a visit home one weekend, Beth upends everything Peachy thought she knew about being happy.   In the tradition of Jennifer Weiner and Melissa Bank, The Almost Archer Sisters is a refreshingly honest portrait of sisterhood, motherhood, and female mayhem in its many states of grievance, grace, and forgiveness.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Jerusalem & the Holy Land (Dorling Kindersley Travel Guides)",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "Richly detailed color photographs and maps provide an appealing picture of the city of Jerusalem and its surrounding sites and countryside, particularly for armchair travelers.  Includes practical information on currency, safety, and other matters, as well as where to stay, shop, and eat. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Travel , Middle East , Israel",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Warriors (American Bicentennial Series, Vol. 6)",
        "Authors": "By Jakes, John",
        "Description": "",
        "Category": "",
        "Publisher": "Pyramid Books",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "Mind Performance Hacks: Tips & Tools for Overclocking Your Brain",
        "Authors": "By Hale-Evans, Ron",
        "Description": "You're smart. This book can make you smarter.Mind Performance Hacks provides real-life tips and tools for overclocking your brain and becoming a better thinker. In the increasingly frenetic pace of today's information economy, managing your life requires hacking your brain. With this book, you'll cut through the clutter and tune up your brain intentionally, safely, and productively.Grounded in current research and theory, but offering practical solutions you can apply immediately, Mind Performance Hacks is filled with life hacks that teach you to:Use mnemonic tricks to remember numbers, names, dates, and other flotsam you need to recallPut down your calculator and perform complex math in your head, with your fingers, or on the back of a napkinSpark your creativity with innovative brainstorming methodsUse effective systems to capture new ideas before they get awayCommunicate in creative new ways-even using artificial languagesMake better decisions by foreseeing problems and finding surprising solutionsImprove your mental fitness with cool tricks and gamesWhile the hugely successful Mind Hacks showed you how your brain works, Mind Performance Hacks shows you how to make it work better.",
        "Category": " Language Arts & Disciplines , Reading Skills",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Songsmith (Witch World Novels (Paperback Tor))",
        "Authors": "By Norton, Andre and Crispin, A. C.",
        "Description": "02 Eydrth is a Master Songsmith...who has no magic. She will do anything to save her father from the evil that has stolen his mind. But the paths to the magic of the Witch World are many--and to save the ones you love, the truest magic must come from the heart...Andre Norton has been called \"one of the most popular writers of our time\" (Publishers Weekly) and has for over twenty-five years enchanted readers with the most famous and popular of her works: the enthralling Witch World. With bestseller A.C. Crispin, Norton has woven an eternal love story, filled with magic and wonder. Songsmith is the novel that Witch World fans have been waiting for--a shining jewel in the Witch World cosmos. Eydrth is a Master Songsmith...who has no magic. She will do anything to save her father from the evil that has stolen his mind. But the paths to the magic of the Witch World are many--and to save the ones you love, the truest magic must come from the heart...Andre Norton has been called \"one of the most popular writers of our time\" (Publishers Weekly) and has for over twenty-five years enchanted readers with the most famous and popular of her works: the enthralling Witch World. With bestseller A.C. Crispin, Norton has woven an eternal love story, filled with magic and wonder. Songsmith is the novel that Witch World fans have been waiting for--a shining jewel in the Witch World cosmos.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Pecan Cookbook",
        "Authors": "By zehr, farrel",
        "Description": "",
        "Category": "",
        "Publisher": "Koinonia Publication",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "On Hitler's Mountain: Overcoming the Legacy of a Nazi Childhood",
        "Authors": "By Hunt, Irmgard A.",
        "Description": "Growing up in the beautiful mountains of Berchtesgaden -- just steps from Adolf Hitler's alpine retreat -- Irmgard Hunt had a seemingly happy, simple childhood. In her powerful, illuminating, and sometimes frightening memoir, Hunt recounts a youth lived under an evil but persuasive leader. As she grew older, the harsh reality of war -- and a few brave adults who opposed the Nazi regime -- aroused in her skepticism of National Socialist ideology and the Nazi propaganda she was taught to believe in.In May 1945, an eleven-year-old Hunt watched American troops occupy Hitler's mountain retreat, signaling the end of the Nazi dictatorship and World War II. As the Nazi crimes began to be accounted for, many Germans tried to deny the truth of what had occurred; Hunt, in contrast, was determined to know and face the facts of her country's criminal past.On Hitler's Mountain is more than a memoir -- it is a portrait of a nation that lost its moral compass. It is a provocative story of a family and a community in a period and location in history that, though it is fast becoming remote to us, has important resonance for our own time.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Shooters (Presidential Agent Novels)",
        "Authors": "By Griffin, W. E. B.",
        "Description": "A key DEA agent has been kidnapped by drugrunners. As much as the news angers Presidential Agent Castillo, he thinks there’s no way he could get permission to rescue the man. But Castillo’s wrong—the President himself orders Castillo to do anything it takes to bring back the agent...anything except get caught.",
        "Category": " Fiction , War & Military",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Forever... : A Novel of Good and Evil, Love and Hope (Forever Trilogy)",
        "Authors": "By Deveraux, Jude",
        "Description": "From A Knight in Shining Armor to The Mulberry Tree, Jude Deveraux's bestsellers sparkle with stunning originality, heartfelt wit, and adventurous passion. Now, this superb storyteller mixes the flavor of a classic fairy tale with a very modern love story -- set in a town locked in the shadows of an abiding evil -- in this imaginative new novel.  Forever...  Darci Monroe overcame a childhood of neglect with an ebullient spirit, a positive attitude...and extraordinary determination. Now the resourceful young woman, hired as Adam Montgomery's personal assistant, devotes more than just professional attention to this devastatingly handsome millionaire. But one thing bars Adam from accepting Darci's love: he is intent on discovering the secret of his parents' disappearance, for she possesses the otherworldly abilities needed to help him fight a terrifying mistress of the dark arts. What Darci ends up offering is a gift greater than Adam ever hoped for, for Darci loves with all her heart, and all her soul, forever...",
        "Category": " Fiction , Literary",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Whole Truth (A Shaw series)",
        "Authors": "By Baldacci, David",
        "Description": "A powerful defense contractor, a reluctant intelligence agent, and an ambitious journalist race to contain and control an international crisis that could destroy the world in this #1 New York Times bestselling thriller.\"Dick, I need a war.\"Nicolas Creel is a man on a mission. He heads up the world's largest defense contractor, The Ares Corporation. Dick Pender is the man Creel retains to \"perception manage\" his company to even more riches by manipulating international conflicts. But Creel may have an even grander plan in mind.Shaw, a man with no first name and a truly unique past, has a different agenda. Reluctantly doing the bidding of a secret multi-national intelligence agency, he travels the globe to keep it safe and at peace.Desperate to get back to the top of her profession, Katie James gets the break of a lifetime: the chance to interview the sole survivor of a massacre that has left every nation stunned.In David Baldacci's first international thriller, these characters face a catastrophic threat that could change the world as we know it.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Soldiers of '44",
        "Authors": "By MCGIVERN, William P.",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1979"
        }
    },
    {
        "Title": "Literacy Bags, 2264",
        "Authors": "By Cernek, Kim (EDT), Darcy, Tom (ILT), Howell, Kathy, and Webb, Alisa",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Creative Teaching Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "A Viking Voyage: In Which an Unlikely Crew of Adventurers Attempts an Epic Journey to the New World",
        "Authors": "By Carter, W. Hodding",
        "Description": "Chronicles the adventures of modern-day explorers who re-created Leif Erickson's journey from Greenland to the New World, and replicated everything from the cargo ship to Viking dress.",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Behind the Oval Office: Getting Reelected Against All Odds",
        "Authors": "By Morris, Dick",
        "Description": "This new edition of Behind the Oval Office contains an insightful an devastating new interpretation of President Clinton's character and career.  Also included are actual agendas Dick Morris used for his briefing sessions with the president.  The Justice Department subpoenaed them during its investigation of the president.  Kenneth Starr used them to build his case.  Now released to the public for the first time, these remarkable sources provide a rare inside look into White House meetings.  The agendas are a virtual diary of how Morris, armed with his polling data, helped Clinton outmaneuver his adversaries and overcome his mistakes-creating policy as a potent cocktail of ideals, opportunities, marketing strategies, and aspirations sold to the public in brilliant advertising campaigns.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Renaissance Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Long Train: 101 Cars On The Track",
        "Authors": "By Wilson-Max, Ken and Williams, Sam",
        "Description": "Youngsters can lift the flaps to find the many surprises that lurk within each of the train cars, in a delightful picture book filled with amusing text and vivid illustrations.",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "How to Grade for Learning: Linking Grades to Standards",
        "Authors": "By O'Connor, Ken",
        "Description": "Formerly a SkyLight publicationO'Connor updates his eight models to assist teachers in designing and conducting grading practices that help students feel more in control of their academic success.",
        "Category": " Education , Testing & Measurement",
        "Publisher": "Corwin",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "TailSpin (An FBI Thriller)",
        "Authors": "By Coulter, Catherine",
        "Description": "When a fellow agent's plane crashes deep in the Appalachian Mountains, married FBI agents Savich and Sherlock find the pilot and his passenger alive. But that's just the beginning of a case that plummets them into a whirlwind of vicious murder attempts, powerful suspects, political secrets, and escalating terror.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Guided Reading: Good First Teaching for All Children (F&P Professional Books and Multimedia)",
        "Authors": "By Pinnell, Gay Su and Fountas, Irene C.",
        "Description": "Among the many changes to sweep American literacy education has been a move toward whole class instruction. Nonetheless, children still bring to literacy a wide range of experiences and competencies. How, then, might teachers best support a literate community yet still meet the needs of individual readers? For Fountas and Pinnell, the answer lies in guided reading, which allows children to develop as individual readers within the context of a small group. Their new book is the richest, most comprehensive guided reading resource available today and the first systematic offering of instructional support for guided reading adherents.  Guided Reading was written for K-3 classroom teachers, reading resource teachers, teacher educators, preservice teachers, researchers, administrators, and staff developers. Based on the authors' nine years of research and development, it explains how to create a balanced literacy program based on guided reading and supported by read aloud, shared reading, interactive writing, and other approaches. While there is an entire chapter devoted solely to the process by which children become literate, every chapter clearly presents the theoretical underpinnings of the practices it suggests. Also included are guidelines for:  observation and assessment  dynamic grouping of readers  creating sets of leveled books  selecting and introducing books  teaching for strategies  classroom management.  Best of all, there are well over 2,500 leveled books in the Appendixes, along with many other reproducible resources that teachers will use for years to come.  \"Good first teaching is the foundation of education and the right of every child,\" assert the authors. With the publication of this book, educators themselves will find the foundation in reading skills instruction they so rightly deserve.",
        "Category": " Education , Elementary",
        "Publisher": "Heinemann",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Shadow of the Giant (Shadow Saga)",
        "Authors": "By Card, Orson Scott",
        "Description": "The Ender Saga continues with Shadow of the Giant, which parallels the events of Ender's Game from a different character’s point of view.Bean's past was a battle just to survive. He first appeared on the streets of Rotterdam, a tiny child with a mind leagues beyond anyone else. He knew he could not survive through strength; he used his tactical genius to gain acceptance into a children's gang, and then to help make that gang a template for success for all the others. He civilized them, and lived to grow older. Then he was discovered by the recruiters for the Battle School.For Earth was at war - a terrible war with an inscrutable alien enemy. A war that humanity was near to losing. But the long distances of interstellar space has given hope to the defenders of Earth - they had time to train military geniuses up from childhood, forging them into an irresistible force in the high-orbital facility called the Battle School. That story is told in two books, Orson Scott Card's beloved classic Ender's Game, and its parallel, Ender's Shadow. Now, in Shadow of the Giant, Bean's story continues.Bean was the smallest student at the Battle School, but he became Ender Wiggins' right hand, Since then he has grown to be a power on Earth. He served the Hegemon as strategist and general in the terrible wars that followed Ender's defeat of the alien empire attacking Earth. Now he and his wife Petra yearn for a safe place to build a family - something he has never known - but there is nowhere on Earth that does not harbor his enemies - old enemies from the days in Ender's Jeesh, new enemies from the wars on Earth. To find security, Bean and Petra must once again follow in Ender's footsteps. They must leave Earth behind, in the control of the Hegemon, and look to the stars.THE ENDER UNIVERSEEnder seriesEnder’s Game / Speaker for the Dead / Xenocide / Children of the Mind / Ender in Exile / Children of the FleetEnder’s Shadow seriesEnder’s Shadow / Shadow of the Hegemon / Shadow Puppets / Shadow of the Giant / Shadows in FlightThe First Formic War (with Aaron Johnston)Earth Unaware / Earth Afire / Earth AwakensThe Second Formic War (with Aaron Johnston)The Swarm / The HiveEnder novellasA War of Gifts / First Meetings",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Silent Honor: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "From #1 New York Times bestselling author Danielle Steel, a moving novel of families separated and lives shattered by prejudice during one of the most shameful episodes in American history.   A man ahead of his time, Japanese college professor Masao Takashimaya of Kyoto had a passion for modern ideas that was as strong as his wife’s belief in ancient traditions. His eighteen-year-old daughter, Hiroko, torn between her mother’s traditions and her father’s wishes, boarded the SS Nagoya Maru to come to California for an education and to make her father proud. It was August 1941.   From the ship, she went to the Palo Alto home of her uncle, Takeo, and his family. To Hiroko, California was a different world. Her cousins had become more American than Japanese. And much to Hiroko’s surprise, Peter Jenkins, her uncle’s assistant at Stanford, became an unexpected link between her old world and her new.   On December 7, Pearl Harbor is bombed by the Japanese. Within hours, war is declared and suddenly Hiroko has become an enemy in a foreign land.   On February 19, Executive Order 9066 is signed by President Roosevelt, giving the military the power to remove the Japanese from their communities at will. Takeo and his family are given ten days to sell their home, give up their jobs, and report to a relocation center, along with thousands of other Japanese and Japanese Americans, to face their destinies there. Families are divided, people are forced to abandon their homes, their businesses, their freedom, and their lives.   Danielle Steel portrays not only the human cost of that terrible time in history, but also the remarkable courage of a people whose honor and dignity transcended the chaos that surrounded them. Silent Honor reveals the stark truth about the betrayal of Americans by their own government . . . and the triumph of a woman caught between cultures and determined to survive.",
        "Category": " Fiction , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Perfect Bride (The DeWarenne Dynasty, 5)",
        "Authors": "By Joyce, Brenda",
        "Description": "A childhood trauma has left Lady Blanche Harringtonincapable of all emotion, least of all love. Now circumstancedemands she marry, and Blanche dreads choosing from herhorde of fawning suitors. For one very eligible gentlemanhas not stepped forward.&#133;A war hero and a recluse, Rex de Warenne has long admiredLady Blanche. Though fate and his own dark nature haverobbed him of any hope for the kind of future such a ladydeserves, Rex is determined to aid her&#151;and keep hisfeelings to himself. But when their growing friendship leadsto a night of shocking passion, Blanche's newfound memoriesthreaten their fragile love&#133;and Blanche's very life.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Kids Can Draw Pirates (Kids Can Draw Series)",
        "Authors": "By Legendre, Philippe",
        "Description": "",
        "Category": " Juvenile Nonfiction , Art , History",
        "Publisher": "Walter Foster Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Proof",
        "Authors": "By Francis, Dick",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "The History of Archaeology",
        "Authors": "By Kennedy, Maev",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Quadrillion Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Ink Exchange (Wicked Lovely, 2)",
        "Authors": "By Marr, Melissa",
        "Description": "The second installment in Melissa Marr’s #1 New York Times bestselling Wicked Lovely series brings readers back to the land of faerie and delivers another stunning, high-stakes romance.Unbeknownst to mortals, a power struggle is unfolding in a world of shadows and danger. After centuries of stability, the balance among the Faery Courts has altered, and Irial, ruler of the Dark Court, is battling to hold his rebellious and newly vulnerable fey together. If he fails, bloodshed and brutality will follow.Seventeen-year-old Leslie knows nothing of faeries or their intrigues. When she is attracted to an eerily beautiful tattoo of eyes and wings, all she knows is that she has to have it, convinced it is a tangible symbol of changes she desperately craves for her own life.The tattoo does bring changes—not the kind Leslie has dreamed of, but sinister, compelling changes that are more than symbolic. Those changes will bind Leslie and Irial together, drawing Leslie deeper and deeper into the faery world, unable to resist its allures, and helpless to withstand its perils. . .",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Now and in Time to Be: Ireland and the Irish",
        "Authors": "By Keneally, Thomas",
        "Description": "The author of Schindler's List and To Asmara returns to the land of his ancestors to present Ireland as it is today, describing the ironies of the Troubles, the grim reality of the struggles in the north, and more.",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Warrior's Embrace (Heartfire Romance)",
        "Authors": "By Brooks, Betty",
        "Description": "Accused of witchcraft and taken captive, Johanna McFarley escapes and stops long enough to nurse Hawkeye back to health, an act that bewitches the Comanche",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Two Rivers",
        "Authors": "By Greenwood, T.",
        "Description": "T. Greenwood's new novel is a powerful, haunting tale of enduring love, destructive secrets, and opportunities that arrive in disguise .  .  .    In Two Rivers, Vermont, Harper Montgomery is living a life overshadowed by grief and guilt. Since the death of his wife, Betsy, twelve years earlier, Harper has narrowed his world to working at the local railroad and raising his daughter, Shelly, the best way he knows how. Still wracked with sorrow over the loss of his life-long love and plagued by his role in a brutal, long-ago crime, he wants only to make amends for his past mistakes.    Then one fall day, a train derails in Two Rivers, and amid the wreckage Harper finds an unexpected chance at atonement. One of the survivors, a pregnant fifteen-year-old girl with mismatched eyes and skin the color of blackberries, needs a place to stay. Though filled with misgivings, Harper offers to take Maggie in. But it isn't long before he begins to suspect that Maggie's appearance in Two Rivers is not the simple case of happenstance it first appeared to be.      \"TWO RIVERS is a dark and lovely elegy, filled with heartbreak that turns itself into hope and forgiveness.  I felt so moved by this luminous novel.\" --Luanne Rice, New York Times  bestselling author     \"Two Rivers is a convergence of tales, a reminder that the past never washes away, and yet, in T. Greenwood's delicate handling of time gone and time to come, love and forgiveness wait on the other side of what life does to us and what we do to it. This novel is a sensitive and suspenseful portrayal of family and the ties that bind.\" --Lee Martin, author of The Bright Forever and River of Heaven\"The premise of TWO RIVERS is alluring: the very morning a deadly train derailment upsets the balance of a sleepy Vermont town, a mysterious girl show up on Harper Montgomery's doorstep, forcing him to dredge up a lifetime of memories--from his blissful, indelible childhood to his lonely, contemporary existence. Most of all, he must look long and hard at that terrible night twelve years ago, when everything he held dear was taken from him, and he, in turn, took back. T. Greenwood's novel is full of love, betrayal, lost hopes, and a burning question: is it ever too late to find redemption?\" - Miranda Beverly-Whittemore, author of The Effects of Light and the Janet Heidinger Kafka Prize-winning Set Me Free\"From the moment the train derails in the town of Two Rivers, I was hooked. Who is this mysterious young stranger named Maggie, and what is she running from? In Two Rivers, T. Greenwood weaves a haunting story in which the sins of the past threaten to destroy the fragile equilibrium of the present. Ripe with surprising twists and heart-breakingly real characters, Two Rivers  is a remarkable and complex look at race and forgiveness in small-town America.\"  --Michelle Richmond, New York Times  Bestselling Author of The Year of Fog  and No One You Know   \"Two Rivers  is a stark, haunting story of redemption and salvation.  T. Greenwood portrays a world of beauty and peace that, once disturbed, reverberates with searing pain and inescapable consequences; this is a story of a man who struggles with the deepest, darkest parts of his soul, and is able to fight his way to the surface to breathe again.  But also--maybe more so--it is the story of a man who learns the true meaning of family:  When I am with you, I am home.  A memorable, powerful work.\"    --Garth Stein, New York Times bestselling author of The Art of Racing in the Rain        Praise for T. Greenwood's Novels    Undressing The Moon      \"This beautiful story, eloquently told, demands attention. Highly recommended.\"  –Library Journal (starred review)      \"Greenwood has skillfully managed to create a novel with unforgettable characters, finely honed descriptions, and beautiful imagery.\"  –Book Street USA      \"A lyrical, delicately affecting tale.\"  –Publishers Weekly        Nearer Than The Sky       \"Greenwood is an assured guide through this strange territory; she has a lush, evocative style.\"  –The New York Times Book Review      \"Greenwood writes with grace and compassion about loyalty and betrayal, love and redemption in this totally absorbing novel about daughters and mothers.\"  –Ursula Hegi, author of Stones from the River      \"A complicated story of love and abuse told with a directness and intensity that packs a lightning charge.\" –Booklist        Breathing Water      \"A vivid, somberly engaging first book.\"  –Larry McMurtry, author of Lonesome Dove       \"A poignant, clear-eyed first novel.  .  .filled with careful poetic description.  .  .the story woven skillfully.\"  –The New York Times Book Review",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Table For Two",
        "Authors": "By Roberts, Nora",
        "Description": "Two delectable tales of romance from the best-selling author includes Summer Desserts, in which dessert chef Summer Lyndon, who is determined never to fall in love, finds herself tempted by her deliciously sexy boss Blake Cocharan, and Lessons Learned, in which publicist Juliet Trent is unexpectedly attracted to her new client, chef Carlo Franconi. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "The Story of Thought: The Essential Guide to the History of Western Philosophy",
        "Authors": "By Magee, Bryan",
        "Description": "",
        "Category": "",
        "Publisher": "The Quality Paperback Bookclub",
        "Price Starting With ($)": "16.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "On the Nature of the Universe",
        "Authors": "By Lucretius Carus, Titus",
        "Description": "A modern prose translation of Lucretius' work appealing to a disillusioned age to take comfort from the sanity of science. Bibliogs",
        "Category": " Philosophy , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1951"
        }
    },
    {
        "Title": "Anatomy Coloring Workbook, Second Edition",
        "Authors": "By Alcamo, Edward and Bergdahl, John (ILT)",
        "Description": "Anatomy Coloring  WorkbookThe human body is wondrously complex, with 700 muscles, 206 bones, and countless cells and tissues. Studying and remembering all of them can be overwhelming. The Anatomy Coloring Workbook gives you a clear and concise understanding of anatomy. The interactive approach to learning anatomy through coloring takes less time than memorizing from textbooks and flashcards. The coloring process thoroughly fixes anatomical concepts in your mind, and when you need to recall the material, you’ll be able to visualize the body structures.The diagrams and plates in the Anatomy Coloring Workbook have been created electronically, to give you a sharp, precise rendering of anatomical structures. We fully explain the concepts behind each coloring lesson to make the learning experience complete. We include an introductory section on anatomical terminology to get you started, coloring suggestions to assist you, and labels for easy identification and reference.This book is an invaluable resource for students of anatomy, physiology, biology, psychology, nursing, medical technology, health administration, fitness education, nutrition, art, and more. Medical practitioners, dentists and dental hygienists, physical and occupational therapists, educators, and professionals in scores of other fields will also find directed coloring a helpful means of review.The 125 plates in the book are organized into the following sections:Introduction to AnatomyThe Skeletal SystemThe Muscular SystemThe Nervous SystemThe Endocrine SystemThe Circulatory SystemThe Digestive SystemThe Respiratory SystemThe Urinary SystemThe Reproductive System",
        "Category": " Science , Life Sciences , Human Anatomy & Physiology",
        "Publisher": "Princeton Review",
        "Price Starting With ($)": "6.03",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Whitechapel Conspiracy",
        "Authors": "By Perry, Anne",
        "Description": "THE WHITECHAPEL CONSPIRACY is “a beauty, brilliantly presented, ingeniously developed and packed with political implications that reverberate on every level of British society.”–The New York Times Book ReviewIn 1892, the grisly murders of Whitechapel prostitutes by a killer dubbed Jack the Ripper remain a terrifying enigma. And in a packed Old Bailey courtroom, Superintendent Thomas Pitt’s testimony causes distinguished soldier John Adinett to be sentenced to hang for the inexplicable murder of a friend. Instead of being praised for his key testimony, Pitt is removed from his station command and transferred to Whitechapel, one of the East End’s most dangerous slums. There he must work undercover investigating alleged anarchist plots. Among his few allies are his clever wife, Charlotte, and intrepid Gracie, the maid who can travel unremarked in Whitechapel. But none of them anticipate the horrors to be revealed. . . .“ONE OF HER BEST MYSTERIES EVER . . . You can’t put this book down. . . . Each scene, each encounter takes on a many-layered resonance.”–The Providence Sunday Journal“A POWERHOUSE OF A HISTORY-MYSTERY . . . Reading Perry is a bit like reading Thackeray edited by Elmore Leonard.”–Booklist (starred review)",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Star Quality",
        "Authors": "By Foster, Lori, Monroe, Lucy, and Castell, Dianne",
        "Description": "When love goes wild, crazy, sensual, and oh-so-hot, blame it on the moon. . .New York Times bestselling author Lori Foster Once in a Blue Moon Thanks to a rare blue moon, Stan Tucker is suddenly privy to everyone's innermost thoughts--grocery lists, work woes, appointments. Hello, Dullsville! Until he encounters Jenna Rowan's so not primetime inner monologue. Seems the pretty, shy bookstore owner he's lusted after for ages is in mutual lust. . .ah-whoooo!. . . Lucy Monroe Moon Magnetism For generations, women in Ida Kendall's family have been extremely magnetic during a full moon--which explains why the sultry hotel manager has resisted the technological improvements her boss wants her to implement. Now, the sexy, dynamic Blake Hawthorne is coming to insist on the upgrades in person. . .in bed. . . Dianne Castell Moonstruck Ever since pretty divorcee Julia Simon unknowingly performed a Blue Moon ritual, her wishes seem to be coming true. So why not wish for wild, unbridled passionate sex with hunky P.I. Marc Adams? Now, with the blue moon due to end in three days, Julia can only wonder if it's just a spell or the start of a whole new life. . .",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Brava",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "A Pirate's Love",
        "Authors": "By Lindsey, Johanna",
        "Description": "A Pirate's Love Sailing westward toward the Caribbean sun, young Bettina Verlaine obediently sets out to fulfill the promise made by her father--but not by her heart -- a prearranged marriage destined not to be...once the notorious Captain Tristan's pirate ship appears on the horizon.Abducted by the bold and handsome brigand, the pale-haired beauty surrenders her innocence in the warm caress of the tropical winds -- detesting her virile captor for enslaving her. . .yet loving him for the passionate spell he casts over fragile, yearning heart.",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Hawk's Way Grooms: An Anthology",
        "Authors": "By Johnston, Joan",
        "Description": "The Virgin Groom ~ He was every kid's idol, every man's envy, every woman's fantasy. And then Mac Macready's fianc?dumped him, and his future was looking mighty uncertain. The most shocking thing of all was that the only woman who could save him was notorious Jewel Whitelaw.&#133;The Substitute Groom ~ He'd taught his best friend's girl how to kiss&#151;and had never forgotten the touch of Jennifer Wright's lips. And now that Huck couldn't marry Jenny, U.S. Air Force major Colt Whitelaw vowed to make the ultimate sacrifice. But first Colt needed to convince Jenny this was right&#151; so he drew her close once more.&#133;",
        "Category": " Fiction , Romance , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Highland Outlaw: A Novel (Campbell Trilogy)",
        "Authors": "By McCarty, Monica",
        "Description": "Handsome and dangerous, Patrick MacGregor is a wanted man, possessing the tough, tenacious spirit of his outlawed clan. He will stop at nothing to save his people from destruction, even if it means marrying Elizabeth Campbell, the daughter of his worst enemy. Yet the flaxen-haired beauty disarms him from the start. Her sweet, unspoiled softness touches the cold depths of his ravaged soul–and makes him want much more than revenge.Inside the shy and dutiful Lizzie is a passionate woman longing to emerge, a woman ready for love. So when the piercing emerald eyes and searing kiss of a stranger spark in her a desperate hunger, she surrenders to Patrick’s glorious seduction–unaware that his daring deception has just found its one and only chance for redemption: a love more powerful than hate.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "No Choice But Seduction: A Malory Novel (9) (Malory-Anderson Family)",
        "Authors": "By Lindsey, Johanna",
        "Description": "#1 New York Times bestselling author Johanna Lindsey's \"mastery of historical romance\" (Entertainment Weekly) takes center stage in her eagerly anticipated new novel of the aristocratic Malory family -- a passionate, witty, and high-spirited tale that provides startling new information about a prominent member of the family.   After her mother died, vivacious Katey Tyler fled her dull Connecticut town, hoping to meet her relatives in England and find adventure and romance on a grand tour of Europe. She had no idea that her life-changing travels would have both in spades -- as well as danger and intrigue -- when she catches the eye of ship owner Boyd Anderson and inadvertently stumbles upon a high-stakes kidnapping.   When Sir Anthony Malory's young daughter is abducted from London's Hyde Park, her kidnapper mistakenly sends the ransom note to the home of Sir Anthony's brother, James. With James and his wife, Georgina, in the Caribbean, the demands are received by their houseguest -- Georgina's youngest brother, Boyd Anderson. Searching for the girl with Anthony, the notoriously hot-headed American sea captain fully intends to make the foolhardy villain pay. But he hardly expects to find exquisite Katey Tyler, recently a passenger on his ship, at the center of the plot!   Little does Katey realize that in having caught the attention of Boyd Anderson -- and in meeting up with the Malorys -- she's about to experience more excitement than the typical young lady encounters on a grand tour, and her life will never be dull again. A multitude of surprises await Katey, from the startling truth about her mother's early life to the lengths a man will go to win the affections of a lady who has every reason to despise him -- but who can't resist the seductive, impassioned love he has to offer her.   With the delightful humor, lovable characters, and tempestuous passions that have placed Johanna Lindsey's eight previous Malory novels among the best-loved and most widely read romantic novels of our time, No Choice But Seduction sweeps readers away on an irresistible adventure that is as bold and charming as the heroine at its heart.",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "On the Halfpipe with Tony Hawk",
        "Authors": "By Christopher, Matt and Stout, Glenn",
        "Description": "An action-packed biography of the young skateboarder who has almost singlehandedly revolutionized the sport reveals how this sensation has become a positive role model for young skaters and helped change the way skateboarding is viewed by the general public. Original.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Sports & Recreation",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "National Geographic Field Guide To The Birds Of North America, 4th Edition",
        "Authors": "By National Geographic Society (U. S.)",
        "Description": "Now in its fourth edition, the National Geographic Field Guide to the Birds of North America is the ultimate birder?s field guide. Sturdy, portable, and easy-to-use, it features the most complete information available on every bird species known to North America. This revised edition features 250 completely updated range maps, new plumage and species classification information, specially commissioned full-color illustrations, and a superb new index that allows birders in the field to quickly identify a species. The National Geographic Field Guide to the Birds of North America, Fourth Edition will continue to be a bestseller among the fastest-growing sector in the U.S. travel market?the nearly 25 million people who travel each year specifically to observe wild birds.",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Angry Black White Boy: A Novel",
        "Authors": "By Mansbach, Adam",
        "Description": "From the acclaimed author of Shackling Water comes the first great race novel of the twenty-first century, an incendiary and ruthlessly funny satire about violence, pop culture, and American identity.Macon Detornay is a suburban white boy possessed and politicized by black culture, and filled with rage toward white America. After moving to New York City for college, Macon begins robbing white passengers in his taxicab, setting off a manhunt for the black man presumed to be committing the crimes. When his true identity is revealed, Macon finds himself to be a celebrity and makes use of the spotlight to hold forth on the evils and invisibility of whiteness. Soon he launches the Race Traitor Project, a stress-addled collective that attracts guilty liberals, wannabe gangstas, and bandwagon riders from all over the country to participate in a Day of Apology—a day set aside for white people to make amends for four hundred years of oppression. The Day of Apology pushes New York City over the edge into an epic riot, forcing Macon to confront the depth of his own commitment to the struggle.Peopled with all manner of race pimps and players, Angry Black White Boy is a stunning breakout book from a critically acclaimed young writer and should be required reading for anyone who wants to get under the skin of the complexities of identity in America.",
        "Category": " Fiction , Literary",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "501 TV-Free Activities for Kids",
        "Authors": "By Di Hodges",
        "Description": "",
        "Category": "",
        "Publisher": "Hinkler Books Pty, Limited",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Ultimate Guide to the Perfect Card",
        "Authors": "By Latourelle, Linda",
        "Description": "",
        "Category": "",
        "Publisher": "BLUEGRASS PUBLISHING",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Acid Row",
        "Authors": "By Walters, Minette",
        "Description": "Visiting a crime-riddled housing project, unaware that a known pedophile lives there, Sophie Morrison learns that a child has gone missing and that the project's vigilantes are out in force, trapping Sophie with a man who is intent on hurting her. Reprint.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Your Plan for a Balanced Life",
        "Authors": "By Rippe, James M.",
        "Description": "Your Plan for a Balanced Life provides real-world strategies that equip you to start making choices to achieve the balanced life most of us only dream of.Most people work too much, eat the wrong foods, sleep too little, and don't exercise. They are overweight, tired, and out of balance. Dr. Rippe understands the challenges of daily life and provides practical strategies inYour Plan for a Balanced Life that allow each person to start making simple, daily choices thatwill result in a life of healthy balance.The groundbreaking program introduced in this book is based on the FDA's MyPyramid Program and a new Wellness Pyramid developed by the Rippe Lifestyle Institute. Created by cardiologist and lifestyle medicine specialist James Rippe, MD, the Balanced Life Index is a scientifically proven test used to measure your success based on the three major components: Nutrition, Activity, and Wellness. It assesses where you are and shows where you can be.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Complete Guide to Walking for Health, Weight Loss and Fitness by Fenton, Mark (2007) Paperback",
        "Authors": "By Mark Fenton",
        "Description": "",
        "Category": "",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Hawk'S Way: The Substitute Groom (Silhouette Promo)",
        "Authors": "By Johnston, Joan",
        "Description": "Jennifer Wright's dreams of a perfect summer wedding are turned upside down when she finds herself suddenly marrying her fiance+a7's best friend, seductive Air Force Major Colt Whitelaw. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "365 Ways to Live Green: Your Everyday Guide to Saving the Environment",
        "Authors": "By Mcdilda, Diane Gow",
        "Description": "It's the choices we make every day that affect our world tomorrow365 Ways to Live Green offers an extended list of opportunities to live with more care for the environment by educating, inspiring and motivating people to look at the choices that are made everyday, and challenging them to change their habits. Broken down into 365 tips, with two concise points per page, readers can use this book to learn to make better everyday choices, from picking safer cleaning products to alternative holidays&#151;this is everyone's all-purpose guide to green living.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Master Cleanser: With Special Needs and Problems",
        "Authors": "By Burroughs, Stanley",
        "Description": "Provides a diet and health plan based on a lemonade drink designed to cleanse the body of unwanted toxins, thereby losing weight and making it harder to put the weight back on.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Bourroughs Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Citrus Lovers Cookbook",
        "Authors": "By Fischer, Bruce and Fischer, Lee (COM)",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Golden West Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "The Terrible Swift Sword",
        "Authors": "By Steuer, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Super Healing Foods",
        "Authors": "By Goulart, Frances Sheridan",
        "Description": "",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Leash Training (Simple Solutions Series)",
        "Authors": "By Thornton, Kim Campbell and Jones, Buck (ILT)",
        "Description": "Whether teaching a dog the basics, turning Fido from frumpy to fabulous, or traveling with man's best friend, Dog Fancy magazine's Simple Solutions series books are best bets for dog owners. Filled with helpful tips and fun illustrations, these handy guides serve as easy-to-use foundations for success.One of the most popular books in the series, Leash Training is perfect for dog owners who want a leash training book to get right to the point: what to do, when, and how, so they can get on to enjoying life with their leash-trained dog.Leash Training boils this most basic, but critical, dog training skill down to its basics, solves the most commonly-occurring challenges dog owners face when leash training, and gives dog owners hope that there's light at the end of the leash!",
        "Category": " Pets , Reference",
        "Publisher": "Lumina Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Crazy in Love",
        "Authors": "By Rice, Luanne",
        "Description": "In this acclaimed early novel New York Times bestselling author Luanne Rice takes readers on an intensely moving journey through the intimate terrain of a rapturous marriage in sudden jeopardy–and follows one woman’s courageous search to find her way when everything, even her heart, seems lost.…Georgie Symonds didn’t think anything could shake her perfect marriage. She and Nick were meant for each other, everyone said so, and their life on the Connecticut shore, among Georgie’s close-knit family, is picture-perfect. But lately Nick has been consumed with his job on Wall Street, and Georgie finds herself plagued with suspicions too awful to contemplate. To distract herself, she plunges into her work with the Swift Observatory, examining the stories of people whose lives have been changed by unexpected tragedy. But it’s when a handsome stranger arrives on her doorstep that Georgie learns firsthand that when your dreams are in danger of collapsing, it’s time to create new ones.…",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Right Next Door: An Anthology",
        "Authors": "By Macomber, Debbie",
        "Description": "The Courtship of Carol SommarsPeter Sommars is fifteen, and what he needs is a little more independence. Which is why he'd like his mom, Carol, to start dating. He even knows the perfect man&#151;Alex Preston, his best friend's dad. As it turns out, Alex is interested, but Carol's doing everything she can to sidestep his pursuit. Which only makes Alex&#151;and the boys&#151;more determined!Father's DayRobin Masterson's ten-year-old son, Jeff, figures he needs a dog more than anything in the world. And there just happens to be one right next door! But the friendly black Lab belongs to Cole Camden, the unfriendliest man in the neighborhood. Still, Jeff persists&#133;and soon his mom and Cole are looking at each other in a whole new way.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Morrigan's Cross (The Circle Trilogy, Book 1)",
        "Authors": "By Roberts, Nora",
        "Description": "The Circle Trilogy begins with an epic tale that breaks down the boundaries between reality and the otherworldly, while forging together the passions of the men and women caught in a battle for the fate of humanity…In the last days of high summer, with lightning striking blue in a black sky, the sorcerer stood on a high cliff overlooking the raging sea…        Belting out his grief into the storm, Hoyt Mac Cionaoith rails against the evil that has torn his twin brother from their family’s embrace. Her name is Lilith. Existing for over a thousand years, she has lured countless men to an immortal doom with her soul-stealing kiss. But now, this woman known as vampire will stop at nothing until she rules this world—and those beyond it…Hoyt is no match for the dark siren. But his powers come from the goddess Morrigan, and it is through her that he will get his chance at vengeance. At Morrigan’s charge, he must gather five others to form a ring of power strong enough to overcome Lilith. A circle of six: himself, the witch, the warrior, the scholar, the one of many forms, and the one he’s lost. And it is in this circle, hundreds of years in the future, where Hoyt will learn how strong his spirit—and his heart—have become…Don’t miss the other books in the Circle TrilogyDance of the GodsValley of Silence",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Manning Grooms: Bride On The LooseSame Time, Next Year",
        "Authors": "By Macomber, Debbie",
        "Description": "Jason Manning is content with his life as a bachelor, a slob and a sports fan. Then a precocious girl named Carrie Weston decides to play matchmaker, introducing him to her mother, Charlotte. To his relief, Charlotte is as averse to marriage as he is. But Jason's feelings start to change once he gets to know his Bride on the Loose.James Wilkens was almost a Manning groom&#151;because he almost married one of the Manning sisters. With that broken engagement behind him, he spends New Year's Eve in Las Vegas&#133;where he meets Summer Lawton. She's just suffered a painful betrayal, and James promises her that in a year, she'll be over it. To prove his point, he makes a date to meet her in Vegas Same Time, Next Year. Except it turns out to be more than a date&#151;it's a wedding!",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "More Than Friends",
        "Authors": "By Delinsky, Barbara",
        "Description": "“There’s no bigger name in women’s fiction than Barbara Delinsky.”—Rocky Mountain News (Denver) A beloved classic from Barbara Delinsky, More Than Friends is a powerful and unforgettable story of friendship, love, and forgiveness, emotionally vibrant and populated with truly memorable characters. “A first-rate storyteller” (Boston Globe) whose New York Times bestselling novels include Suddenly, A Woman Betrayed, and The Passions of Chelsea Kane, Delinsky proves once again how well she, “knows the human heart and its immense capacity to love and to believe” (Washington Observer-Reporter).",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Juice Fasting and Detoxification: Use the Healing Power of Fresh Juice to Feel Young and Look Great",
        "Authors": "By Meyerowitz, Steve",
        "Description": "",
        "Category": " Health & Fitness , Herbal Medications",
        "Publisher": "Book Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "This Duchess of Mine (Desperate Duchesses)",
        "Authors": "By James, Eloisa",
        "Description": "Eloisa James, New York Times bestselling romance author of When Beauty Tamed the Beast, puts a chilly, powerful duke in bed with an intelligent, beautiful woman…his wife. In name, anyway.No man can resist Jemma's sensuous allure . . . Except her own husband!Wedding bells celebrating the arranged marriage between the lovely Duchess of Beaumont and her staid, imperturbable duke had scarcely fallen silent when a shocking discovery sent Jemma running from the ducal mansion. For the next nine years she cavorted abroad, creating one delicious scandal after another (if one is to believe the rumors).Elijah, Duke of Beaumont, did believe those rumors.But the handsome duke needs an heir, so he summons his seductive wife home. Jemma laughs at Elijah's cool eyes and icy heart—but to her secret shock, she doesn't share his feelings. In fact, she wants the impossible: her husband's heart at her feet.But what manner of seduction will make a man fall desperately in love . . . with his own wife?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The MacKade Brothers: Rafe and Jared",
        "Authors": "By Roberts, Nora",
        "Description": "The Return of Rafe MacKadeTen years after disappearing from Antietam, Maryland, the bad boy has returned. Cleaned up and successful now&#151;and still dangerously good-looking&#151;Rafe MacKade sets the town on fire, and tongues wagging.Lovely newcomer Regan Jones is intrigued&#151;what kind of man could cause this sort of talk? She's just about to find out.&#133;The Pride of Jared MacKadeHe was a man who stood for something, and never turned his back on a fight. So when Jared MacKade's work as an attorney brought him up against Savannah Morningstar, her rude behavior and strong defenses weren't going to stop him.Savannah was the type of woman who defeated odds brutally stacked against her. And once he got to know her, Jared was determined to be the man to stand beside her in the fight.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "311 Pelican Court (Cedar Cove, Book 3)",
        "Authors": "By Macomber, Debbie",
        "Description": "A captivating novel visits the small town of Cedar Cove, Washington, where an unforgettable cast of characters, including Rosie and Jack Cox who must come to terms with their divorce, as well as their unusual custody arrangement, learn the true meaning of love, family, and community. Original.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Devil's Web (The Web Trilogy)",
        "Authors": "By Balogh, Mary",
        "Description": "Sensual. Seductive. Emotional. No one stirs the heart and imagination like Mary Balogh. In this classic novel, the New York Times bestselling author weaves a spellbinding tale of two people haunted by desire, unable to resist the love that has become their most passionate obsession.…When James Purnell walks into the London drawing room and sees Lady Madeline Raine, time stops. Once she had been his for the taking. Now she is an aloof, beautiful stranger, determined to keep the devilishly handsome nobleman from seducing her again. But after four years apart, desire reignites—swift, hot, irresistible—culminating in a night of reckless lovemaking. Suddenly Madeline is faced with an unbearable choice: marry with no hope of love or risk certain ruin. Her decision will have consequences she never imagined, as she makes a shocking discovery about the man she secretly loves. What she doesn’t know is how far James will go to right the wrongs of the past—and how much he’s willing to risk for the woman who already owns him…body, heart, and soul.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The Price of Indiscretion",
        "Authors": "By Maxwell, Cathy",
        "Description": "New York Times and USA Today bestselling author Cathy Maxwell delivers another passionate romance that is sure to delight her dedicated fans and increase her readership.When three impoverished young ladies brought up in America decide to fulfill their late mother's dream of successful marriages and seasons, they concentrate their resources on sending the prettiest to London to make a brilliant match. But whom does she see but the man who had broken her heart years before? Alexander Haddon is no longer the rough and tumble man she once fell for, but a wealthy gentleman whose passionate nature is only just hidden under a veneer of sophistication ...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "At Last Comes Love (Huxtable Quintet)",
        "Authors": "By Balogh, Mary",
        "Description": "Step into a world of scandal, intrigue, and enthralling passion as New York Times bestselling author Mary Balogh sweeps us into the lives of an extraordinary family: the Huxtables. Margaret, the eldest, embarks on the most risqué adventure of her life and agrees to marry the most notorious man in London.…Only desperation could bring Duncan Pennethorne, the infamous Earl of Sheringford, back home after the spectacular scandal that had shocked even the jaded ton. Forced to wed in fifteen days or be cut off without a penny, Duncan chooses the one woman in London in frantic need of a husband. A lie to an old flame forces Margaret Huxtable to accept the irresistible stranger’s offer. But once she discovers who he really is, it’s too late—she’s already betrothed to the wickedly sensual rakehell. Quickly she issues an ultimatum: If Duncan wants her, he must woo her. And as passion slowly ignites, two people marrying for all the wrong reasons are discovering the joys of seduction—and awaiting the exquisite pleasure of what comes after….",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "The Ideal Wife",
        "Authors": "By Balogh, Mary",
        "Description": "In this classic tale, New York Times bestselling author Mary Balogh introduces a hero like no other: Miles Ripley, London’s most irresistible bachelor, who’s about to lose his heart to the last person he ever expected to love—his wife. When Abigail Gardiner knocks at the door of Miles Ripley, Earl of Severn, the last thing she expects is a marriage proposal. Desperate, she’d come to this charismatic stranger’s home to plead for her future. Instead she shocks them both by saying yes. Her impulsive decision will have consequences neither she nor her new husband can foresee. For Miles has his own reasons for marrying her. And Abigail is harboring a secret of her own. As distrust gives way to desire . . . as, together, they give in to the pleasures of the marriage bed, a devastating scandal threatens their future. Now these two wary hearts will risk ruin and disgrace for a love that has changed them both forever—the kind all seek, but few ever find.",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Tempted All Night",
        "Authors": "By Carlyle, Liz",
        "Description": "Lady Phaedra Northampton is a proper English miss -- but burdened by a dark secret. She's buried her shame in running her wealthy brother Lord Nash's household while hiding behind a sharp wit and dull wardrobe...until a reckless village maid's disappearance pulls her into London's seedy underworld.   A former mercenary and jaded spy-for-hire, Tristan Talbot, Lord Avoncliffe, now does little, and manages to do it scandalously. Though Tristan's an out-and-out rogue, when his dying father begs him to delve into the secrets behind a notorious brothel -- a perfect task for his talents! -- Tristan can't refuse. Is the brothel a front for a notorious Russian spy ring? Tristan is on the hunt -- until his path collides with the oh-so-tempting Lady Phae.   Soon what should be a simple assignment becomes deliciously complicated...when deception and desire lead to an explosive passion -- and deadly foes!",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Field of Dishonor (Honor Harrington Series, Book 4)",
        "Authors": "By Weber, David",
        "Description": "After boldly defeating the People's Republic of Haven, the Royal Manticoran Navy stands victorious, but a new political crisis and an old enemy once vanquished bring a new challenge for Honor Harrington. Original.",
        "Category": "",
        "Publisher": "Baen",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Owlflight (Valdemar: Darian's Tale, Book 1)",
        "Authors": "By Lackey, Mercedes and Dixon, Larry",
        "Description": "Apprenticed to a venerable wizard when his hunter and trapper parents disappear into the forest never to be seen again, Darian is difficult and strong willed--much to the dismay of his kindly master. But a sudden twist of fate will change his life forever, when the ransacking of his village forces him to flee into the great mystical forest. It is here in the dark forest that he meets his destiny, as the terrifying and mysterious Hawkpeople lead him on the path to maturity. Now they must lead the assault on his besieged home in a desperate attempt to save his people from certain death!",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "DAW",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "POLAR FLEET (DOUBLE SPIRAL WAR, NO 2)",
        "Authors": "By Norwood, Warren",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    }
]