[
    {
        "Title": "Every Kid Counts: 31 Ways to Save Our Children",
        "Authors": "By Brodkin, Margaret, Coleman Advocates for Children & Youth, and Gordon, Gwen",
        "Description": "Includes tips and strategies on getting involved in the Children's Movement, discussing the hundreds of things that can be done to improve children's lives. Original. 20,000 first printing.",
        "Category": " Political Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Hormone Heresy : What Women Must Know About Their Hormones",
        "Authors": "By Sellman, Sherrill",
        "Description": "",
        "Category": "",
        "Publisher": "Get Well Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Acquired Tastes",
        "Authors": "By Mayle, Peter",
        "Description": "In Acquired Tastes, Peter Mayle, the erudite sojourner and New York Times bestselling author of A Year in Provence, sets off once more, traveling the world in search of the very best life has to offer. Whether telling us where to buy the world’s best caviar or how to order a pair of thirteen-hundred-dollar custom-made shoes, advising us on the high cost of keeping a mistress in style or the pros and cons of households servants, he covers everything the well-heeled—and those vicariously so inclined—need to know to enjoy the good life.   From gastronomy to matrimony, from the sartorial to the baronial, Acquired Tastes is Peter Mayle’s most delicious book yet—an irreverently spiced smorgasbord of rich dishes you’re sure to enjoy. Praise for Acquired Tastes   “Mr. Mayle is a writer who never fails to entertain. If he were told to go forth and write about doorknobs, he would return with a witty, perceptive essay.”—The New York Times Book Review   “One of the finest modern writers on matters that deal with taste.”—Craig Claiborne   “Much, much fun—and best read with a magnum of Dom Pérignon and a four-pound tin of Beluga caviar.”—Kirkus Reviews “Witty and stylish . . . These hilarious essays are vintage Mayle.”—James Villas, author of The French Country Kitchen  “This delightful celebration of the little (and not-so-little) extravagances that make life worth living scintillates with wit, brio and trenchant observations”—Publishers Weekly   “Intriguing.”—Chicago Sun-Times",
        "Category": " Travel , Europe , France",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Colorado: Magnificent Wilderness",
        "Authors": "By Ward, John",
        "Description": "",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Westcliffe Pub",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Cuban Communism",
        "Authors": "By Horowitz, Irving Louis (EDT)",
        "Description": "\"Cuban Communism remains, like its previous ten editions, an important contribution to the field of Cuban Studies. It includes many useful chronological facts, as well as a selection of Fidel Castro's speeches which are interesting and informative for any reader interested in the island.\" -- Maria Gropas, Department of Social Anthropology, University of Cambridge  This new 11th edition of a classic text, come to be known as \"the bible of Cuban Studies,\" emphasizes two key issues of the twenty-first century. First, transition concerns in a world without Castro, and second, the continuing embargo of Cuba by the United States in the aftermath of a major change in the presidency. Cuban Communism has been updated to take account of changes in the 44 years of Castro's rule since seizing power in 1959. In addition to articles and essays that represent new developments in Cuba, the work boasts a database upgrade that makes it more important to students, scholars, and researchers.  The volume has expanded the section on future prospects for civil society and democracy in a post-Castro environment; including \"Regime Change in Cuba\" by Eusebio Mujal-Leon and Joshua W. Busby; \"Transition Scenarios\" by Randolph H. Pherson, and \"A Policy Conundrum over Cuba\" by Edward Gonzalez. It also contains a chronology of events from 1959 through 2002. Finally, the new work contains a carefully constructed Who's Who of important players in Cuba and the regime during the Castro period up to the present.  Other articles new to the 11th edition of Cuban Communism are by Ernesto Betancourt, \"Cuba's Balance of Payment Gap\"; Carmelo Mesa-Lago, \"The Cuban Economy From 1999-2001\"; Taylor Boas, \"The Internet and U.S. Policy toward Cuba\"; Aldo M. Leiva, \"Environmental Technology Transfer and Foreign Investment\"; Moises Asis, \"Judaism in Cuba\"; Wolf Grabendorff, \"A View from the European Union.\" More than ever, it is a must volume for those interested in political systems and social structures.  Irving Louis Horowitz is Hannah Arendt Distinguished Professor Emeritus of Sociology and Political Science at Rutgers University. Among his works are Three Worlds of Development, Beyond Empire and Revolution, and his Bacardi Lectures on Cuba that was published as The Conscience of Worms and the Cowardice of Lions.  Jaime Suchlicki is Bacardi Professor of History at the Graduate School of International Studies at the University of Miami, and executive director of its Cuban-American and Cuban Center. He is author of From Columbus to Castro, University Students and Revolution in Cuba, and Mexico: From Montezuma to Nafta and Beyond.",
        "Category": " History , Latin America , General",
        "Publisher": "Transaction Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Heat Is On: Health, Humor & Hope for Women Facing Menopause",
        "Authors": "By Demetre, Danna",
        "Description": "",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Dear Exile : The True Story of Two Friends Separated (for a Year) by an Ocean",
        "Authors": "By Liftin, Hilary and Montgomery, Kate",
        "Description": "A funny and moving story told through the letters of two women nurturing a friendship as they are separated by distance, experience, and time.Close friends and former college roommates, Hilary Liftin and Kate Montgomery promised to write when Kate's Peace Corps assignment took her to Africa.  Over the course of a single year, they exchanged an offbeat and moving series of letters from rural Kenya to New York City and back again.Kate, an idealistic teacher, meets unexpected realities ranging from poisonous snakes and vengeful cows to more serious hazards: a lack of money for education; a student body in revolt.  Hilary, braving the singles scene in Manhattan, confronts her own realities, from unworthy suitors to job anxiety and first apartment woes.  Their correspondence tells--with humor, warmth, and vivid personal detail--the story of two young women navigating their twenties in very different ways, and of the very special friendships we are sometimes lucky enough to find.",
        "Category": " History , Africa , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Good Owners, Great Dogs",
        "Authors": "By Kilcommons, Brian and Wilson, Sarah",
        "Description": "One of the world's foremost experts on dog training and animal behavior offers a comprehensive, practical, and innovative guide to dog ownership, care, and training. Kilcommons teaches dog owners how to master the effective training skills that will result in obedient, well-behaved pets who can accompany their owners anywhere.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "God's Paintbrush",
        "Authors": "By Sasso, Sandy Eisenberg and Compton, Annette (ILT)",
        "Description": "Discusses God's place in the universe and how God touches our world",
        "Category": " Juvenile Nonfiction , Religion , General",
        "Publisher": "Jewish Lights Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Macbeth (The Pelican Shakespeare)",
        "Authors": "By Shakespeare, William and Orgel, Stephen",
        "Description": "\"I feel that I have spent half my career with one or another Pelican Shakespeare in my back pocket. Convenience, however, is the least important aspect of the new Pelican Shakespeare series. Here is an elegant and clear text for either the study or the rehearsal room, notes where you need them and the distinguished scholarship of the general editors, Stephen Orgel and A. R. Braunmuller who understand that these are plays for performance as well as great texts for contemplation.\" (Patrick Stewart)The distinguished Pelican Shakespeare series, which has sold more than four million copies, is now completely revised and repackaged.Each volume features:* Authoritative, reliable texts* High quality introductions and notes* New, more readable trade trim size* An essay on the theatrical world of Shakespeare and essays on Shakespeare's life and the selection of texts",
        "Category": " Drama , Shakespeare",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Friendship Gifts of Good Taste",
        "Authors": "By Young, Anne",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Divine Legacy",
        "Authors": "By Negley, Betty J.",
        "Description": "",
        "Category": "",
        "Publisher": "Treasure House",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Lasting Friendship Skills",
        "Authors": "By Carol and Kurt Bickel",
        "Description": "",
        "Category": "",
        "Publisher": "Concordia Publishing House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Little Oxford Dictionary of Quotations",
        "Authors": "By Ratcliffe, Susan (EDT)",
        "Description": "This new redesigned edition is the perfect gift for every occasion. Selected from the best quotations of past and present, the dictionary is packed with quotable quotes on every subject from Examinations to Weddings.For the high days and holidays, birthdays and celebrations, the Little Oxford Dictionary of Quotations proves that good things come in small packages. This opinionated little book has more than 4,000 witty quotations and a brand new design that makes this edition more fun to dip into than ever before. Whatever the special occasion, here you can find special words to express your ideas.",
        "Category": " Reference , Quotations",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "MGM: When the Lion Roars",
        "Authors": "By Hay, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Pub Overstock Unlimited Inc",
        "Price Starting With ($)": "8.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Southern but Lite",
        "Authors": "By Avis, Jen Bays",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Wimmer Book Dist",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Operating systems: A systematic view",
        "Authors": "By Davis, William S.",
        "Description": "",
        "Category": "",
        "Publisher": "Addison-Wesley Pub. Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The life and travels of John W. Bear, \"the Buckeye blacksmith\"",
        "Authors": "By Bear, John W",
        "Description": "",
        "Category": "",
        "Publisher": "D. Binswanger & co., printers",
        "Price Starting With ($)": "72.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1873"
        }
    },
    {
        "Title": "Grace: The Story of a Princess",
        "Authors": "By Hart-Davis, Phyllida",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Katharine of Aragon: Three Novels in One Volume (The Wives of Henry VIII)",
        "Authors": "By Jean Plaidy",
        "Description": "",
        "Category": "",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Bait and Switch: The (Futile) Pursuit of the American Dream",
        "Authors": "By Ehrenreich, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Metropolitan Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Other Side: How Soviets and Americans Perceive Each Other",
        "Authors": "By English, Robert and Halperin, Jonathan J.",
        "Description": "What do Soviets think of Americans? What do they learn from books, newspapers, and films about life in America? How do we, as Americans form opinions about life in the U.S.S.R? Through the selective use of both Soviet and American materials, The Other Side explores these and other provocative questions that are central to public understanding of how perceptions affect U.S.-Soviet relations.The Other Side also examines the many differences between Soviet and American media, such as the role of the press, and offers article-by-article comparisons of Soviet and American press coverage of the same events.Appropriate for citizen of all ages, and groups as well as individuals, The Other Side includes a Reader's Guide, suggested educational projects, an annotated bibliography, and guidance for discussion leaders.",
        "Category": " History , Europe , Eastern",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Faberge: Imperial Craftsman and His World Exhibition Album",
        "Authors": "By Robert Steven Bianchi",
        "Description": "",
        "Category": "",
        "Publisher": "Booth-Clibborn Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Practical intuition: Practical tools for harnessing the power of your instinct",
        "Authors": "By Martin, Angela",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Ideals Guide to American Civil War Places",
        "Authors": "By Shively, Julie",
        "Description": "",
        "Category": " Travel , Museums, Tours, Points of Interest",
        "Publisher": "Ideals Childrens Books",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Blood: Stories of Life and Death from the Civil War (Adrenaline Series)",
        "Authors": "By Kadzis, Peter (EDT)",
        "Description": "The Civil War — the bloodiest, most dramatic moment in this nation’s history — also produced some of the country’s greatest literature. Blood reflects the violent hatred, love, patriotism, and heroism this conflict generated through the vivid stories of the men and women who were there. This collection includes Ulysses S. Grant (via the rumored pen of Mark Twain) recounting the taking of Vicksburg; Theodore Lyman watching Grant come into his own on his first drive toward Richmond; George Templeton Strong describing the horror of the New York Draft Riots; and plantation owner Mary Chestnut’s report on the final days before the fall of Atlanta. Also included are firsthand accounts ranging from Pickett’s Charge to Sherman’s March, from Lee’s Virginia campaigns to the heroism of African American foot soldiers, as well as excerpts from some of the most notable fiction on the subject.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "Thunder's Mouth, Balliett & Fitzgerald",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Quilters: Women and Domestic Art",
        "Authors": "By Cooper, Patricia J. and Allen, Norma Bradley",
        "Description": "Captures the reminiscences, spirit, and strength of the elderly quilters of Texas and New Mexico, viewing the women's works as personal expressions of their identities, experiences, and communities",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "The maid of Orleans: And the great war of the English in France",
        "Authors": "By Adams, W. H. Davenport",
        "Description": "",
        "Category": "",
        "Publisher": "J.B. Lippincott",
        "Price Starting With ($)": "26.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1889"
        }
    },
    {
        "Title": "Discoveries and Opinions of Galileo",
        "Authors": "By Galileo, Drake, Stillman (TRN), Drake, Stillman (INT), and Drake, Stillman (CON)",
        "Description": "Directing his polemics against the pedantry of his time, Galileo, as his own popularizer, addressed his writings to contemporary laymen. His support of Copernican cosmology, against the Church's strong opposition, his development of a telescope, and his unorthodox opinions as a philosopher of science were the central concerns of his career and the subjects of four of his most important writings. Drake's introductory essay place them in their biographical and historical context.",
        "Category": " Science , Astronomy",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1957"
        }
    },
    {
        "Title": "Attention Deficit Disorder (Guides for Parents and Educators Series)",
        "Authors": "By McEwan, Elaine K.",
        "Description": "",
        "Category": " Health & Fitness , Physical Impairments",
        "Publisher": "Shaw Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Dough Crafts",
        "Authors": "By Kiskalt, Isolde",
        "Description": "Provides instructions for making dough, describes techniques for modeling it, and includes over two-hundred projects including holiday decorations, wreaths, baskets, plaques, and animals",
        "Category": " Crafts & Hobbies , Dough",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Mr. Smithson's Bones: A Mystery at the Smithsonian",
        "Authors": "By Conroy, Richard Timothy",
        "Description": "When ancient and modern bodies suddenly start appearing around the Smithsonian Institution, ex-Foreign Service officer Henry Scruggs, now working for the Institution's stodgy Foreign Affairs office, finds his quiet days completely disrupted.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Neuroanatomy: An Atlas of Structures, Sections, and Systems",
        "Authors": "By Haines, Duane E.",
        "Description": "",
        "Category": " Medical , Anatomy",
        "Publisher": "Urban & Schwarzenberg",
        "Price Starting With ($)": "6.15",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Phenomenon of Benji the Life Story of America's Most Huggable Hero-a Scrapbo",
        "Authors": "By Inn Frank",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Jim Henson's Muppets in New in Town: A Book About Shyness (Values to Grow On)",
        "Authors": "By Ellen Weiss, Ellen Weiss",
        "Description": "",
        "Category": "",
        "Publisher": "Muppet Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Mask of Treachery: The First Documented Dossier on Blunt, MI5, and Soviet Subversion",
        "Authors": "By Costello, John",
        "Description": "",
        "Category": "",
        "Publisher": "WILLIAM COLLINS SONS & CO., LTD",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Meet Kit: An American Girl 1934 (The American Girls Collection, Book 1)",
        "Authors": "By Tripp, Valerie and Rane, Walter (ILT)",
        "Description": "When her father's business closes because of the Great Depression forcing Kit to make changes in her life, the nine-year-old responds with resourcefulness. Simultaneous.",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "American Girl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Smuggler's Treasure (American Girl History Mysteries)",
        "Authors": "By Buckey, Sarah Masters",
        "Description": "Sent to live with relatives in New Orleans during the War of 1812, eleven-year-old Elisabet determines to find a smuggler's treasure to ransom her imprisoned father.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Hay Day Country Market Cookbook",
        "Authors": "By Rizk, Kim",
        "Description": "Since 1978, when the first of its country markets opened in Westport, Connecticut, Hay Day has been a celebrated purveyor of the finest farmstand produce, breads, pastries, cheeses, comestibles, provisions, and take-out fare. Twenty years later, after having helped shape America's culinary revolution, Hay Day presents 250 of the recipes that keep its customers coming back again and again. Reflecting its passion for quality, freshness, inventiveness, and character, The Hay Day Country Market Cookbook mirrors the way the country cooks and eats today. It's not about trends or gimmicks, but about ingredients and a love for sound, deep, palate-pleasing flavor. About the delicious simplicity of Veal Chops in Mustard Sauce, the tangy surprise of Lemon Chevre Chicken, the perfection of the perfect Maryland Crab Cake. It's about the sophisticated--Wilted Radicchio with Gorgonzola and Walnuts--and the down-to-earth--Chunky Tomato and Bacon Soup. And it's about the integrity of cooking in concert with the seasons--New Potatoes and Fiddlehead Ferns in spring, Grilled Duck with Citrus Cherry Relish in summer, Wild Rice and Cranberries in fall, Rosy Root Vegetable Chili for the dead of winter. Now even without a Hay Day in town, you can still get the best market-based, seasonal dishes around.",
        "Category": " Cooking , Regional & Ethnic , Greek",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Great American Cookbook",
        "Authors": "By Various Authors",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "8.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Personal Efficiency Program: How to Get Organized to Do More Work in Less Time",
        "Authors": "By Gleeson, Kerry",
        "Description": "The Personal Efficiency Program Learn the revolutionary new system that is changing the way people work in companies around the world. More than 200,000 office workers in North America, Europe, and Australia have significantly improved the quality of their work lives through PEP, a simple, effective, easy-to-learn system for getting organized at work and improving personal productivity. Now you can too with The Personal Efficiency Program. Featuring the same proven techniques Kerry Gleeson and his staff of trainers and consultants at the world-renowned Institute for Business Technology have taught to the managers and office workers at top corporations around the world, The Personal Efficiency Program shows you how to reduce job stress; double or even triple your productivity; work fewer hours; assert greater control over the when, where, and how of your workday; have more leisure time; and much more. \"Thanks to Kerry Gleeson, my office is once more a high-performance action center, as sleek as the cockpit of an F-16.\" ?Duncan Maxwell Anderson Success magazine A Special Selection of the Newbridge Book Clubs",
        "Category": " Business & Economics , Small Business",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Rational Manager: A Systematic Approach to Problem Solving and Decision-Making",
        "Authors": "By Kepner, Charles Higgins",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Book Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1965"
        }
    },
    {
        "Title": "Primer of Epidemiology",
        "Authors": "By Gary D. Friedman",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Companies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "The Modern Dance: Seven Statements of Belief",
        "Authors": "By Cohen, Selma Jeanne (EDT) and Hawkins, Erick (CON)",
        "Description": "Seven Statements of Belief: Jose Limon, Anna Sokolow, Erick Hawkins, Donald McKayle, Alwin Nikolais, Pauline Koner, Paul Taylor",
        "Category": " Performing Arts , Dance , General",
        "Publisher": "Wesleyan University Press",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "June",
            "Year": "1966"
        }
    },
    {
        "Title": "Bad Childhood---Good Life: How to Blossom and Thrive in Spite of an Unhappy Childhood",
        "Authors": "By Schlessinger, Laura",
        "Description": "In this important book, Dr. Laura Schlessinger shows men and women that they can have a Good Life no matter how Bad their Childhood.For each of us, there is a connection between our early family dynamics and experiences  and our current attitudes and decisions. Many of the people Dr. Laura has helped did not realize how their histories impacted their adult lives, or how their choices in people, repetitive situations, and decisions -- even their emotional reactions -- were connected to those early negative experiences, playing a major role in their current unhappiness.For these people and millions like them, too much time is dedicated to repeating the ugly dynamics of childhood in a vain attempt to repair or cope with deep hurt and longings. Too often they use their emotional pain to control others or excuse their own inappropriate and destructive behaviors. Some turn to therapy, only to find themselves trapped in their self-pitying victim mode, robbed of optimism, confidence, and growth.Dr. Laura will help you realize that no matter what circumstances you came from or currently live in, you are ultimately responsible for how you react to them. The acceptance of this basic truth is the source of your power to secure the Good Life you long for. In her signature straightforward style, with real-life examples, Dr. Laura shows you what you will gain by not being satisfied with an identity as a victim, or even as a survivor -- but striving to be a victor!In Bad Childhood -- Good Life, Dr. Laura will guide you to accept the truth of the assaults on your psyche and soul, understand your unique coping style and how it impacts your daily thoughts and actions, and help you embrace a life of more peace and happiness.Bad Childhood -- Good Life comes from a compassionate and personal place.  Dr. Laura also reveals some of her own experiences with a difficult childhood and what efforts it took to attain a Good Life.  She writes, \"My resilience has paid off, and I'm doing the best I can with what I've got.\" Now you can, too.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "JavaScript Application Cookbook: Programming JavaScript Applications",
        "Authors": "By Bradenbaugh, Jerry",
        "Description": "There is a serious information gap for Webmasters learning client-side JavaScript skills and trying to solve common Web-related problems. Knowing the syntax is one thing, being able to build a useful application is another. And while there are dozens of \"how- to\" JavaScript books available, few literally hand the Webmaster a set of ready-to-go, client-side JavaScript applications with thorough documentation that enable the reader to fully understand and extend those applications. By providing such a set of applications, JavaScript Application Cookbook allows Webmasters to immediately add extra functionality to their Web sites.This book targets readers with two different skill sets. The primary target is JavaScript-knowledgeable Webmasters and  designers who can immediately begin constructing their own  versions of the applications. The secondary target is those with little or no JavaScript experience. The included  applications are ready for immediate use and require little  customization.This book explores both the code and the techniques that are centered around core JavaScript functionality, a functionality  that will not become incompatible or obsolete. The source file  design of most applications and libraries will help modularize  reader Web sites and facilitate easier site management and coding  practices.Chapters are organized by application. Among the included  applications are:A client-side search engine that will show coders how to build their own search engine and get excellent results, all with a client-side toolA drag-and-drop greeting application that lets users custom build and send DHTML email greetingsA GUI image rollover tool that generates cross-browser image rollover code for all versions of JavaScriptA robust client-side shopping cart application that lets shoppers browse and shop, while the application keeps a tab of the shopper's selections and a running bill, including tax and shippingAn online test application that auto-administers, grades, and displays answers to online exams or surveysAn additional value to this book is an online resource www.serve.com that discusses the applications  and points to other resources. With its focus on providing practical real-world solutions for Webmasters, JavaScript  Application Cookbook is destined to become a staple for every JavaScript developer, regardless of experience.",
        "Category": " Computers , Programming Languages , JavaScript",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Super Life, Super Health",
        "Authors": "By Cawood, Frank W.",
        "Description": "",
        "Category": "",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Extreme Denial",
        "Authors": "By Morrell, David",
        "Description": "An American intelligence operative, Steve Decker suddenly moves to Santa Fe after a tragedy on his 40th birthday. There he finds peace of mind and a beautiful, sensual woman named Beth Dwyer. Steve will soon discover, however, that Beth harbors heinous secrets. Is she the love of his life--or his most deadly enemy?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Ryan White: My Own Story",
        "Authors": "By Cunningham, Ann Marie and White, Ryan",
        "Description": "Ryan White describes how he got AIDS, engaged in a legal battle to return to school, and became a celebrity and spokesman for issues concerning the deadly disease.",
        "Category": " Young Adult Nonfiction , Biography & Autobiography , General",
        "Publisher": "Dial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "No Man's Land: The Place of the Woman Writer in the Twentieth Century, Volume 1: The War of the Words",
        "Authors": "By Gubar, Susan and Gilbert, Sandra M.",
        "Description": "The first book in a landmark three-volume work that brings feminist theory to bear on modern literature in English. Focusing on both male and female writers, Gilbert and Gubar here survey social, literary, and linguistic conflicts between the sexes as revealed in texts by nineteenth- and twentieth-century writers from Tennyson to Woolf, from Hemingway to Plath.\"An exciting and ground-breaking work.\"—Carolyn Heilbrun, Columbia University\"Fast, funny, profound in its theoretical assertions, and deliciously irreverent in its asides. Male readers and critics will ignore it at their own peril.\"—Joyce Carol Oates\"Should be welcomed both by contemporary women readers and by anyone who has had the experience of modernism but wondered about its meanings.\"—Christine Froula, New York Times Book Review\"No Man’s Land will surely rewrite the history of modernism.\"—Maureen Corrigan, Village Voice\"No Man’s Land promises to be as crucial for our understanding of 20th-century literature as The Madwoman in the Attic has been for our understanding of 19th-century literature.\"—Clare Hanson, Times Higher Education Supplement",
        "Category": " Literary Criticism , European , English, Irish, Scottish, Welsh",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Arnold Palmer's Golf Journal: A Personal Handbook of Practice, Performance, and Progress",
        "Authors": "By Arnold Palmer Golf Academy (COR)",
        "Description": "A comprehensive, personalized workbook and journal for golfers at every level, this book presents Arnold Palmer as he shares the secrets of his internationally renowned Golf Academy.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Triumph Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Leadership Paradox: Balancing Logic and Artistry in Schools (Jossey Bass Education Series)",
        "Authors": "By Deal, Terrence E. and Peterson, Kent D.",
        "Description": "\"A distinctive, playful, and insightful look at the art and craft of leading a modern-day school.\"--Roland S. Barth, educator and author of Improving Schools from Within\"Reality-based cases and concepts worthy of reflection by all who are interested in improving school leadership.''--Linton Deck, director of education and nonprofit applications, Center for Creative Leadership\"Required reading for those who are or aspire to be principals and for those who prepare, train, or supervise them.\"--Laraine Roberts, director of research and development, California School Leadership AcademyRather than view leadership and management as opposing factions, this book shows how the two ideals can serve as complements in building powerful school culture. The authors share real-life stories and examples of school leaders who have learned to adopt a bifocal approach and integrate the contradictions of their work.",
        "Category": " Education , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Homeland",
        "Authors": "By Maharidge, Dale and Williamson, Michael (PHT)",
        "Description": "Homeland is Pulitzer Prize–winning author Maharidge’s biggest and most ambitious book yet, weaving together the disparate and contradictory strands of contemporary American society—common decency alongside race rage, the range of dissenting voices, and the roots of discontent that defy political affiliation. Here are American families who can no longer pay their medical bills, who’ve lost high-wage-earning jobs to NAFTA. And here are white supremacists who claim common ground with progressives. Maharidge’s approach is rigorously historical, creating a tapestry of today as it is lived in America, a self-portrait that is shockingly different from what we’re used to seeing and yet which rings of truth.Dale Maharidge is among the very few American journalists attempting to describe the full range of the American experience. Together with Michael Williamson, who’s produced several other important books about the other America, including their first book together, Journey to Nowhere: The Saga of the New Underclass, based on a three-year journey through homeless encampments from coast to coast, and The Last Great American Hobo. Journey to Nowhere inspired Bruce Springsteen to write two of the songs on his album The Ghost of Tom Joad, including \"Youngstown,\" based on a conversation between Maharidge and two former steelworkers, and \"New Timer.\" And Their Children After Them won the Pulitzer Prize in 1990. Maharidge has been a visiting professor of journalism at Columbia University and Stanford. Maharidge was a Nieman Fellow at Harvard University in 1998. He now lives in Northern California.Michael Williamson is a photographer for the Washington Post with numerous honors including the World Press Photo and Nikon World Understanding Through Photography awards.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Man from Atlantis",
        "Authors": "By Woodley, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1977"
        }
    },
    {
        "Title": "Vote power; how to work for the person you want elected",
        "Authors": "By Murphy, William T.",
        "Description": "",
        "Category": "",
        "Publisher": "Anchor Press",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "More Tales of the City (Tales of the City, Volume Two)",
        "Authors": "By Maupin, Armistead",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "13.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Fraud: Essays",
        "Authors": "By Rakoff, David",
        "Description": "From This American Life alum David Rakoff comes a hilarious collection that single-handedly raises self-deprecation to an art form. Whether impersonating Sigmund Freud in a department store window during the holidays, climbing an icy mountain in cheap loafers, or learning primitive survival skills in the wilds of New Jersey, Rakoff clearly demonstrates how he doesn’t belong–nor does he try to. In his debut collection of essays, Rakoff uses his razor-sharp wit and snarky humor to deliver a barrage of damaging blows that, more often than not, land squarely on his own jaw–hilariously satirizing the writer, not the subject. Joining the wry and the heartfelt, Fraud offers an object lesson in not taking life, or ourselves, too seriously.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Prospects of England: Two Thousand Years Seen Through Twelve English Towns",
        "Authors": "By Nicolson, Adam and Morter, Peter",
        "Description": "Describes architectural points of interest in twelve small English towns and covers both Roman city planning and early twentieth century industrial buildings",
        "Category": " History , United States , General",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Changing Soviet Navy, a Staff Paper",
        "Authors": "By Blechman, Barry M.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Brookings Inst Pr",
        "Price Starting With ($)": "7.11",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "The Ghost of Fossil Glen",
        "Authors": "By DeFelice, Cynthia C.",
        "Description": "Allie Nichols is being pursued by a ghost. Her friend Karen calls Allie a liar and doesn't want to hear \"stuff like that.\" But her old pal, Dub, listens eagerly as Allie tells him about the voice that guides her down a steep cliff side, the girl she imagines who begs, \"Help me,\" and a terrible nightmare in which that girl falls to her death. Who is that girl? Is she the ghost? And what does the ghost want from Allie? 01 Nutmeg Children's Book Award Masterlist, 00-01 Sunshine State Young Reader's Award Masterlist (Gr. 6-8), 00-01 Young Hoosier Book Award Masterlist (Grds 4-6),00-01 William Allen White Children's Book Award Masterlist, 00-01 Land of Enchantment Book Award Masterlist (Gr. 3-6), 00-01 Sequoyah Children's Book Award Masterlist, 00-01 Young Reader's Choice Award Program Masterlist, 00-01 South Carolina Book Award Masterlist(Grds 3-8), and The 2000 Texas Bluebonnet Award",
        "Category": " Juvenile Fiction , General",
        "Publisher": "HarperTrophy",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Elegant Solutions",
        "Authors": "By Edwards, Owen and Whyte, Douglas",
        "Description": "Celebrates everyday objects, from the Rolodex to the ice cream scoop, that exemplify innovative and elegant solutions to streamlining everyday life",
        "Category": "",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Dhea: Unlocking the Secrets to the Fountain of Youth",
        "Authors": "By Ley, Beth M. and Langer, Stephen",
        "Description": "DHEA, a hormone produced by the adrenal glands is the precursor to all steroid hormones in the body. Levels of this amazing pro-hormone are highest when we are in the prime of life, ages 18-25, after which production gradually begins to slow down.",
        "Category": "",
        "Publisher": "Bl Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Bien sur! Grammaire en contexte",
        "Authors": "By Weidmann-Koop, Marie-Christine and New, J. Elizabeth",
        "Description": "",
        "Category": " Foreign Language Study , French",
        "Publisher": "Pearson",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Fathers and Children: In Literature and Art",
        "Authors": "By Sullivan, Charles (EDT)",
        "Description": "In Fathers and Children, Charles Sullivan shows that there are many different ways to complete the following statement: \"Two of the most [fill in the blank] roles in life are being a child's father and being a father's child.\" Indeed, a variety of possible answers are suggested in this beautifully illustrated volume, an insightful, provocative collection of literature and art portraying fathers and fatherhood through the ages.Sullivan has thoughtfully selected over 100 poems, quotations, and passages of prose and paired them with paintings, drawings, photographs, and sculptures to illustrate the broad range of thoughts and feelings that may be experienced by fathers and their children, as they take part in one of the most basic, yet complex, human relationships.Elegantly presented, Fathers and Children is visually rich, humorous and pensive, poignant yet refreshingly unsentimental. The result is an abundant assortment of verbal and visual images that reveals the universal fascination with fathers and their relationships with children as a subject in literature and art.Biographical notes give the reader background information on the artists and writers represented in Fathers and Children.",
        "Category": "",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Art Nouveau Stained Glass Pattern Book (Dover Stained Glass Instruction)",
        "Authors": "By Sibbett, Ed",
        "Description": "Stained glass workers will welcome this book containing 104 authentic Art Nouveau patterns newly rendered by Ed Sibbett, Jr.In the typical Art Nouveau style are 104 designs in this book: florals with stem and leaf patterns; sensuous women with billowing hair, dresses, and exquisite headpieces; fish; butterflies; peacocks; Beardsley-like women in profile wearing masks; and many, many others. Some of these designs are intermediate to advanced and will be a challenge to skilled craftsmen, while others are simple enough for beginners in the field. They can be used whole or in part for windows, panels, lampshades, mirrors, frames, mobiles, or other craft projects.",
        "Category": " Crafts & Hobbies , Glass & Glassware",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Golden Book of Marrakesh",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Bonechi",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Hand-Stitched Boxes: Plastic Canvas, Cross Stich, Embroidery, Patchwork",
        "Authors": "By Evans, Meg",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "David & Charles Uk",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "File...Don't Pile: A proven filing system for personal and professional use",
        "Authors": "By Dorff, Pat",
        "Description": "If you have ever watched the stacks of papers, magazins, clippings, and projects pile up out of control, File...Don't Pile will provide fast, easy practical advice.  More than a collection of random hints, this handy guide presents systems of organization for every conceivable type of household paper.  Topics covered include:How to cut through the clutter--the 5 step solutionChoosing the right paper-control system for your needs10 questions to determine whether to save a piece of paperCategorizing, tab systems, coding systems, indexing, cross-referencingHow to plan for growth and expansionKeeping files current and useful--the 4 step maintenance planCreating and using a personal business filePlus comprehensive systems for organizing mail, greeting cards, a Rolodex, newspapers, and magazines, coupons, and much more, including sample file headings for a wide variety of useful subjects.  File..Don't Pile is the fast prescription for anyone drowning in household paper.",
        "Category": " Business & Economics , Management",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "Frederick Douglass",
        "Authors": "By McFeely, William S.",
        "Description": "“A detailed, finely written portrait of the imposing 19th-century leader.” —David Levering Lewis, New York Times Book ReviewBorn into but escaped from slavery, Frederick Douglass—orator, journalist, autobiographer; revolutionary on behalf of a just America—was a towering figure, at once consummately charismatic and flawed. His Narrative of the Life of Frederick Douglass (1845) galvanized the antislavery movement and is one of the truly seminal works of African-American literature. In this Lincoln Prize– winning biography, William S. McFeely captures the many sides of Douglass— his boyhood on the Chesapeake; his self-education; his rebellion and rising expectations; his marriage, affairs, and intense friendships; his bitter defeat and transcendent courage—and re-creates the high drama of a turbulent era.",
        "Category": " Biography & Autobiography , Editors, Journalists, Publishers",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Not Safe After Dark and Other Stories",
        "Authors": "By Robinson, Peter",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Crippen & Landru Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "You're Wearing That?: Understanding Mothers and Daughters in Conversation",
        "Authors": "By Tannen, Deborah",
        "Description": "Deborah Tannen's #1 New York Times bestseller You Just Don’t Understand revolutionized communication between women and men. Now, in her most provocative and engaging book to date, she takes on what is potentially the most fraught and passionate connection of women’s lives: the mother-daughter relationship.It was Tannen who first showed us that men and women speak different languages. Mothers and daughters speak the same language–but still often misunderstand each other, as they struggle to find the right balance between closeness and independence. Both mothers and daughters want to be seen for who they are, but tend to see the other as falling short of who she should be. Each overestimates the other’s power and underestimates her own. Why do daughters complain that their mothers always criticize, while mothers feel hurt that their daughters shut them out? Why do mothers and daughters critique each other on the Big Three–hair, clothes, and weight–while longing for approval and understanding? And why do they scrutinize each other for reflections of themselves?  Deborah Tannen answers these and many other questions as she explains why a remark that would be harmless coming from anyone else can cause an explosion when it comes from your mother or your daughter. She examines every aspect of this complex dynamic, from the dark side that can shadow a woman throughout her life, to the new technologies like e-mail and instant messaging that are transforming mother-daughter communication. Most important, she helps mothers and daughters understand each other, the key to improving their relationship.With groundbreaking insights, pitch-perfect dialogues, and deeply moving memories of her own mother, Tannen untangles the knots daughters and mothers can get tied up in. Readers will appreciate Tannen’s humor as they see themselves on every page and come away with real hope for breaking down barriers and opening new lines of communication. Eye-opening and heartfelt, You’re Wearing That? illuminates and enriches one of the most important relationships in our lives.“Tannen analyzes and decodes scores of conversations between moms and daughters. These exchanges are so real they can make you squirm as you relive the last fraught conversation you had with your own mother or daughter. But Tannen doesn't just point out the pitfalls of the mother-daughter relationship, she also provides guidance for changing the conversations (or the way that we feel about the conversations) before they degenerate into what Tannen calls a mutually aggravating spiral, a \"self-perpetuating cycle of escalating responses that become provocations.\" – The San Francisco Chronicle",
        "Category": " Family & Relationships , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Wholesome Home Book of Recipes & Household Formulas",
        "Authors": "By Tarr, Yvonne Young",
        "Description": "A guide for people who are tired of chemically altered and preserved supermarket items offers safe alternatives to processed foods and toxic household products and provides more than five hundred healthy recipes and formulas.",
        "Category": " Cooking , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Many-Splendored Fishes of Hawaii",
        "Authors": "By Goodson, Gar",
        "Description": "",
        "Category": " Nature , Animals , Fish",
        "Publisher": "Stanford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "Everything Bible Stories (Everything Series)",
        "Authors": "By Paydos, Michael",
        "Description": "",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Gradual Vegetarian: For Everyone Finally Ready to Make the Change",
        "Authors": "By Tracy, Lisa",
        "Description": "Stage one of this vegetarian lifestyle sampler allows poultry, fish, and eggs; stage two eliminates poultry, limits fish, and uses dairy foods, grains, nuts,and beans for protein; and stage three introduces macrobiotic meals and hygienism",
        "Category": " Cooking , Vegetarian",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "The Archer Method: An Expert's Guide to Winning at Poker (Melvin Powers Self-Improvement Library)",
        "Authors": "By Archer, John",
        "Description": "",
        "Category": " Games & Activities , Gambling , General",
        "Publisher": "Wilshire Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "The Settlers",
        "Authors": "By Levin, Meyer",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "April",
            "Year": "1972"
        }
    },
    {
        "Title": "Revolution and Romanticism",
        "Authors": "By Jones, Howard M.",
        "Description": "An in-depth study of the nature, emergence, and relationship of the two movements that developed concurrently in late-eighteenth-century America and again in early-nineteenth-century France. Bibliogs",
        "Category": "",
        "Publisher": "Harvard Univ Pr",
        "Price Starting With ($)": "5.26",
        "Publish Date": {
            "Month": "February",
            "Year": "1974"
        }
    },
    {
        "Title": "Keeping the Faith: Guidance for Christian Women Facing Abuse",
        "Authors": "By Fortune, Marie M",
        "Description": "Practical guide addresses issues of faith for battered women—an invaluable resource for victims of domestic violence and the crisis centers that counsel them.",
        "Category": " Religion , Counseling",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Ten Little Rabbits",
        "Authors": "By Grossman, Virginia and Long, Sylvia (ILT)",
        "Description": "Weaving, fishing, and storytelling are all part of this spirited book that celebrates Native American traditions as it teaches young children to count from one to ten. The book's whimsical illustrations, reminiscent of Beatrix Potter, glow with brilliant color and are filled with fascinating detail. Each number introduces a facet of traditional Native American culture, such as Pueblo corn dances or Navajo weaving, and the simple, rhyming text is enhanced by a brief afterword on Native American customs. Ideal for storytime or bedtime, this is a book sure to leave children counting rabbits instead of sheep.",
        "Category": " Juvenile Fiction , Animals , Rabbits",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Little Stories for Little Children: A Worship Resource",
        "Authors": "By Rhodes, Donna McKee",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "HERALD PRESS *",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Do's and Taboos Around the World",
        "Authors": "By Roger E. Axtell",
        "Description": "When does a nod mean ``no''? In what countries is a handshake an insult? Where is the gift of a clock or watch considered the ``kiss of death''? In a lively blend of tips, facts, and cautionary tales, this fascinating guide tells travellers how to dress, exchange gifts, deal with unusual food, pronounce names, and interpret body language in 96 countries. Revised and updated, the Second Edition of this informative and fun-to-read guide remains the standard reference to good etiquette around the world.",
        "Category": "",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Virginia White Water: A Canoeing Guide To The Rivers Of The Old Dominion",
        "Authors": "By Corbett, H. Roger",
        "Description": "",
        "Category": "",
        "Publisher": "Seneca Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Solitude: A Return to the Self",
        "Authors": "By Storr, Anthony",
        "Description": "",
        "Category": "",
        "Publisher": "The Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Princess",
        "Authors": "By Lacey, Robert",
        "Description": "A pictorial biography of, and tribute to, the United Kingdom's Princess Diana includes scenes from her childhood, photographs of dignitaries in her life, studies of the century's royal wedding, and recent portraits of the future queen",
        "Category": "",
        "Publisher": "Times Books",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Catechism of the Catholic Church",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "United States Catholic Conference",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "My Life as a Fake",
        "Authors": "By Carey, Peter",
        "Description": "Following the triumph of his Booker Prize–winning True History of the Kelly Gang, Peter Carey ventures into the Far East with a novel shot through with mysteries at once historical, literary, and personal.Sarah Wode-Douglass, the editor of a London poetry magazine, had grown up knowing the famous and infamous John Slater. And because he figured prominently in the disaster that was her parents’ marriage, when Slater proposes that she accompany him to Malaysia, Sarah embarks out of curiosity on a journey that becomes, instead, a lifelong obsession. Her discoveries spiral outward from Christopher Chubb, a destitute Australian she meets by chance in the steamy, fetid city of Kuala Lumpur. He is mad, Slater warns her, explaining the ruinous hoax Chubb had committed decades earlier. But lurking behind the man’s peculiarity and arrogance, Sarah senses, is artistic genius, in the form of a manuscript he teases her with and which she soon would do anything to acquire. The provenance of this work, she gradually learns, is marked by kidnapping, exile, and death—a relentless saga that reaches from Melbourne to Bali, Sumatra, and Java, and that more than once compels her back to Malaysia without ever disclosing all of its secrets, only the power of the imagination and the price it can exact from those who would wield it.Astonishing, mesmerizing, and ultimately shocking, My Life as a Fake is the most audacious novel yet in Peter Carey’s extraordinary career.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The New Sugar Busters",
        "Authors": "By Steward, H. Leighton, Bethea, Morrison, Andrews, Sam, and Balart, Luis",
        "Description": "When SUGAR BUSTERS! hit the shelves almost five years ago, it quickly became a diet and lifestyle phenomenon, soaring to the number one spot on the New York Times bestseller list and embraced by millions of people across the country. Those satisfied individuals on the SUGAR BUSTERS! plan discovered that by simply choosing the correct carbohydrates and lowering their sugar intake, they could shed the pounds they failed to lose with other diets. Now the weight-loss program that swept the nation has been completely revised and updated–incorporating all the newest nutritional findings, health statistics, and scientific studies, including the latest on glycemic levels. Based on sound dietary principles, SUGAR BUSTERS! remains a highly effective program that shows you how to reduce the sugar in your life (without feeling deprived) through easy-to-follow recipes and meal plans. In this new edition, you will discover• A discussion on prevention, still the best medicine• Amazing testimonials from men and women who are still losing weight and feeling fit the SUGAR BUSTERS! way• Frequently asked questions–direct from the SUGAR BUSTERS! Web site– along with helpful answers• A special section on childhood obesity–how to measure it and what to do about it• Hard facts on soft drinks• The latest on diabetes–and how SUGAR BUSTERS! can help prevent it• A Body Mass Index (BMI) chart and Calculation Formula to determine if you are obese or merely overweight• An expanded discussion of our ancestor’s diet, which was whole-grain, high-fiber, and low-glycemic–just like SUGAR BUSTERS!• Essential facts on women, weight loss, and nutrition• New tips, updated charts, new recipes, and practical exercise suggestions• Handy information on how SUGAR BUSTERS! compares with other diet plans, from Atkins to Ornish So arm yourself with the facts and get the figure you’ve always wanted. When it comes to optimal wellness on the SUGAR BUSTERS! program, it’s survival of the fittest–a way of life in which everybody wins!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Bon Appetit The Christmas Season",
        "Authors": "By Bon Appetit (EDT)",
        "Description": "A collection of outstanding seasonal recipes, culled from the past five years of Bon AppTtit, is accompanied by a host of entertaining suggestions, menu plans, do-ahead tips, decorating advice, and more, including an array of appetizers, soups, salads, main courses, side dishes, and desserts. 15,000 first printing.",
        "Category": " Cooking , Holiday",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Skipping Christmas",
        "Authors": "By Grisham, John",
        "Description": "Imagine a year without Christmas. No crowded malls, no corny office parties, no fruitcakes, no unwanted presents.  That’s just what Luther and Nora Krank have in mind when they decide that, just this once, they’ll skip the holiday altogether.  Theirs will be the only house on Hemlock Street without a rooftop Frosty; they won’t be hosting their annual Christmas Eve bash; they aren’t even going to have a tree.  They won’t need one, because come December 25 they’re setting sail on a Caribbean cruise.  But, as this weary couple is about to discover, skipping Christmas brings enormous consequences–and isn’t half as easy as they’d imagined. A classic tale for modern times, Skipping Christmas offers a hilarious look at the chaos and frenzy that have become part of our holiday tradition.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Grandma Knows Best, but No One Ever Listens!",
        "Authors": "By McBride, Mary",
        "Description": "",
        "Category": "",
        "Publisher": "Meadowbrook Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Light For My Path For Women",
        "Authors": "By Hahn, Jennifer (Compiled by)",
        "Description": "",
        "Category": "",
        "Publisher": "Humble Creek",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "A Fine Balance",
        "Authors": "By Mistry, Rohinton",
        "Description": "With a compassionate realism and narrative sweep that recall the work of Charles Dickens, this magnificent novel captures all the cruelty and corruption, dignity and heroism, of India. The time is 1975. The place is an unnamed city by the sea. The government has just declared a State of Emergency, in whose upheavals four strangers--a spirited widow, a young student uprooted from his idyllic hill station, and two tailors who have fled the caste violence of their native village--will be thrust together, forced to share one cramped apartment and an uncertain future. As the characters move from distrust to friendship and from friendship to love, A Fine Balance creates an enduring panorama of the human spirit in an inhuman state.",
        "Category": " Fiction , Sagas",
        "Publisher": "Vintage",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "A Reward for Josefina (American Girl Collection)",
        "Authors": "By Tripp, Valerie, Tibbles, Jean-Paul (ILT), and McAliley, Susan",
        "Description": "When the entire family goes into the hills to collect pin+a1o+a7n nuts, Josefina hopes to find the most in order to make Ti+a7a Dolores proud of her, but it takes the help of a squirrel for Josephina to get her reward.",
        "Category": " Juvenile Fiction , Historical , General",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Alpha Dogs: How Your Small Business can become a Leader of the Pack",
        "Authors": "By Fenn, Donna",
        "Description": "Take an ordinary business. A bike shop. An auction company. An ice cream parlor. A sock manufacturer. In thoroughly mundane businesses like these, an entrepreneur must outsmart the multitudes of competitors, leap to the head of the pack, and become a dominant Alpha Dog.Exactly how does an everyday company distinguish itself in the marketplace, generate much higher sales than its competitors, and earn the lasting loyalty of customers and employees? Is it cutting-edge products? Brilliant service? Ingenious branding?Donna Fenn, a twenty-year veteran of Inc. magazine, has discovered the people who have the answers. In a personal and probing style, she introduces you to eight Alpha Dogs. These men and women share their solutions and insights on how to rise to the top, despite multiple competitors, from Chinese manufacturers to Wal-Mart.Readers will meet:Chris Zane, an intense, ambitious father of three boys. His Branford, Connecticut, retail bike shop has flourished among Wal-Mart, Sports Authority, and independent bike stores. He's done it by seeking out new markets and perfecting the art of customer service.Deb Weidenhamer, a tough woman in a male-dominated industry who transformed a traditional auction company with cutting-edge technology. While her competitors were still fretting about eBay, she was using the online auction giant as a training ground for her own innovative Web site.Amy Simmons, a former premed student who fell in love with the ice cream business in Boston and then founded her own ice cream parlor in Austin, Texas. With twelve Amy's Ice Creams stores in Austin, Amy's is the Austin hometown favorite, despite her deep-pocketed rivals, Ben & Jerry's and Cold Stone Creamery.In accessible, conversational style, Donna Fenn tells each entrepreneur's personal story, shares their winning formulas, and offers nuts-and-bolts advice and practical tips. Alpha Dogs is a lively handbook for every current and aspiring entrepreneur.",
        "Category": " Business & Economics , New Business Enterprises",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Rover",
        "Authors": "By Behn, Aphra and Link, Frederick M. (EDT)",
        "Description": "\"I’m no tame sigher, but a rampant lion of the forest,\" says Willmore, the Rover, on shore after a long voyage. \"I have a world of love in store,\" he claims, searching through the streets for a woman to prove it. When he meets two young Spanish woman—\"I love mischief,\" says one—all the chemistry of comic satire lets loose.The Rover roamed the English stage for a century and has been rediscovered in our own time as a theatrical masterpiece of wit and daring. Aphra Behn (1640–1689) combined dramatic genius and training with personal experience that gave her rare insight into manners and roles. She spied on the Dutch for the English king and was once imprisoned for debt. Behn is one of the very few great English playwrights to be honored in life by popular scandal and in death by burial at Westminster Abbey. She was the first English woman to earn her living by writing.",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "University of Nebraska Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1967"
        }
    },
    {
        "Title": "A Man, a Can, a Grill: 50 No-Sweat Meals You Can Fire Up Fast: A Cookbook",
        "Authors": "By Joachim, David",
        "Description": "Take a man. Add a can. Now throw in a grill. Sounds like a recipe for disaster, right? But with the geniuses who brought you A Man, A Can, A Plan are calling the shots, any guy can turn his culinary carnage into a killer meal. - Photos of most ingredients, so shopping is a breeze - Instructions for charcoal and propane grills alike - Options for vegetarians - Other useful facts about the ingredients and grilling techniques Whether the menu calls for beer-basted chicken or shish kebabs, Joachim's approach to barbecuing will lure even the most inexperienced cook to slap on an apron.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Outwitting Squirrels: 101 Cunning Stratagems to Reduce Dramatically the Egregious Misappropriation of Seed from Your Birdfeeder by Squirrels",
        "Authors": "By Adler, Bill",
        "Description": "This book illustrates and explains a series of strategems to keep squirrels from eating and ruining yards and gardens when more traditional tactics fail.",
        "Category": " Nature , Animals , General",
        "Publisher": "Chicago Review Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Like Water for Chocolate: A Novel in Monthly Installments, with Recipes, Romances, and Home Remedies",
        "Authors": "By Esquivel, Laura and Christensen, Carol (TRN)",
        "Description": "Earthy, magical, and utterly charming, this tale of family life in turn-of-the-century Mexico became a best-selling phenomenon with its winning blend of poignant romance and bittersweet wit. The classic love story takes place on the De la Garza ranch, as the tyrannical owner, Mama Elena, chops onions at the kitchen table in her final days of pregnancy. While still in her mother's womb, her daughter to be weeps so violently she causes an early labor, and little Tita slips out amid the spices and fixings for noodle soup. This early encounter with food soon becomes a way of life, and Tita grows up to be a master chef. She shares special points of her favorite preparations with listeners throughout the story.",
        "Category": " Fiction , Literary",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "14.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "No Good Deeds: A Tess Monaghan Novel",
        "Authors": "By Lippman, Laura",
        "Description": "New York Times bestselling author Laura Lippman’s Tess Monaghan finds herself facing the most complicated case of her career…When Tess Monaghan begins her new gig as a consultant to the local newspaper, she’s handed the case of an unsolved homicide of a young federal prosecutor. But she never dreams the key to the sensational homicide will fall into her lap when her boyfriend, Crow, brings home a street kid—a juvenile con artist who unwittingly holds a crucial clue in the prosecutor’s murder.Tess agrees to protect the boy’s identity no matter what, especially when one of his friends is killed in what appears to be a case of mistaken identity. But as she soon discovers, her ethical decision to protect him has dire consequences. And with federal agents determined to learn the boy’s name at any cost, Tess finds out just how far even official authorities will go to get what they want.It isn’t long before Tess finds herself facing felony charges. To make matters worse, Crow has gone into hiding with his young protégé. So Tess can’t deliver the kid to investigators even if she wants to. Now her only recourse is to get to the heart of the sordid and deadly affair while they're all still free...and still breathing.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    }
]