[
    {
        "Title": "Bargain with the Devil",
        "Authors": "By Chase, F. J.",
        "Description": "Security consultant Peter Avakian's job is to keep people safe, and that's not always easy. Even his Special Forces training couldn't have prepared him for a routine business proposal that was anything but. By simply acknowledging the offer, Avakian becomes snarled in a complex plot to stage a political coup in central Africa. With no way out, he turns to the CIA—and is forced to become their mole inside the conspiracy.Pulled into a shadow world of nations battling over the world's oil supply, drug dealers financing revolutions, and gunrunners on sale to the highest bidder, it's all Avakian can do to stay alive. And that may depend less on his lethal skills than on two women: a CIA agent and a South African reporter after a story. Will they save him, or will they betray him?It's anyone's guess, especially his.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "The Mile High Club (Kinky Friedman Novels)",
        "Authors": "By Friedman, Kinky",
        "Description": "The Mile High Club is a novel of intrigue, irreverence, international terrorism, humor, suspense, and cross-dressing, in which the intrepid Kinky Friedman gets more than his leg pulled when he encounters a mysterious vamp on an airplane.  It all starts with a casual flirtation, two people on a flight from Dallas to New York. She is gorgeous and mysterious; he is a private detective. When the plane lands, the detective -- our hero Kinky Friedman -- finds that he's been left holding the bag, in this case literally holding a bright pink cosmetic bag. The mysterious woman, having asked the Kinkster to watch her luggage while she visits the dumpster, has taken a powder and somehow has vanished.  Confident that he'll find the mystery woman again, Kinky holds on to the bag. Sure enough she does turn up, but not before Kinky has excited the interest of an array of \"suits\" from the State Department, been party to a thwarted kidnap attempt by Arab terrorists, and found a dead Israeli agent parked on the toilet of his downtown Manhattan loft.  Employing the able-bodied assistance of his usual sidekicks, the Village Irregulars, Kinky eventually gets to the bottom of all the comings and goings and comings of the many visitors to his loft -- including two late-night visits by the mysterious, and suddenly affectionate, woman from the plane and one not-so-late visit by her angry brother. Before it's over, the bag is gone.  Despite the many comparisons made by the critics, citing his resemblance to one great writer after another, the truth is that no other writer combines intriguing mystery with bawdy one-liners quite like Kinky Friedman. Alternately raunchy, offbeat, and hilarious, The Mile High Club, complete with a surprise ending, is Kinky at his very considerable best.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Dead Hot Shot",
        "Authors": "By Victoria Houston",
        "Description": "",
        "Category": "",
        "Publisher": "Worldwide",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Armadillos & Old Lace",
        "Authors": "By Friedman, Kinky",
        "Description": "The Kinkster is back and in top supersleuth form.In Armadillos & Old Lace, the hip, witty, cosmically cryptic poet returns to once again ponder the imponderables and disentangle a mystery or two, and this time he's temporarily forsaking the mean streets of Manhattan for his old Texas stomping grounds.When Kinky Friedman decides it's time to take a break from big-city murder and mayhem, he transports himself and his cat to Texas to get back to his roots, to commune with his dad, to play with his pet armadillo, and to blow the city soot from his fevered brain.Kinky arrives at his family's combination ranch/summer camp for boys and girls to find urgent messages from Pat Knox, the local justice of the peace (who got that job by beating Kinky in what clearly had to have been a rigged election). It seems Her Honor is a tad concerned that little old ladies in the area are dropping dead at an alarming rate. Fearing something foul is afoot, she persuades Kinky to undertake some sleuthing.Undaunted by the thought of running up against the toughest lady sheriff in Texas and only a little perturbed by a mass of swarming bees, the Kinkster takes off in his talking car to put the pieces of the puzzle together. Several bunches of yellow roses and a faded photograph taken many years ago of ten pretty girls dressed in white and ready for the cotillion are just the clues Kinky needs to finally unravel a devious scheme of revenge for personal wrongs and social snobbery.A colorful Texas story of the cosmic variety, Armadillos & Old Lace is Kinky Friedman at his dead-level best, mixing his irresistible irreverence with a really great mystery.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Secret History of the Iraq War",
        "Authors": "By Bodansky, Yossef",
        "Description": "In the months leading up to March 2003, fresh from its swift and heady victory in Afghanistan, the Bush administration mobilized the United States armed forces to overthrow the government of Iraq. Eight months after the president declared an end to major combat operations, Saddam Hussein was captured in a farmhouse in Al-Dawr. And yet neither peace nor democracy has taken hold in Iraq; instead the country has plunged into terrorist insurgency and guerrilla warfare, with no end in sight.What went wrong?In The Secret History of the Iraq War, bestselling author Yossef Bodansky offers an astonishing new account of the war and its aftermath—a war that was doomed from the start, he argues, by the massive and systemic failures of the American intelligence community. Drawing back the curtain of politicized debate, Bodansky—a longtime expert and director of the Congressional Task Force on Terrorism and Unconventional Warfare—reveals that nearly every aspect of America's conflict with Iraq has been misunderstood, in both the court of public opinion and the White House itself. Among his revelations:The most authoritative account of Saddam Hussein's support for Islamic terrorist organizations—including extensive new reporting on his active cooperation with al-Qaeda in Iraq long after the fall of BaghdadExtensive new information on Iraq's major chemical and biological weapons programs—including North Korea's role in building still-undetected secret storage facilities and Iraq's transfer of banned materials to Syria, Iran, and Libya The first account of Saddam's plan for Iraq, Syria, and Iran to join Yasser Arafat's Palestinian forces to attack Israel, throw the region into turmoil, and upend the American campaignThe untold story of Russia's attempt to launch a coup against Saddam before the war—and how the CIA thwarted it by ensuring that Iraq was forewarnedDramatic details about Saddam's final days on the run, including the untold story of a near miss with U.S. troops and the stunning revelation that Saddam was already in custody at the time of his capture—and was probably betrayed by members of his own Tikriti clanThe definitive account of the anti-U.S. resistance and uprising in Iraq, as the American invasion ignited an Islamic jihad and Iran-inspired intifada, threatening to plunge the region into irreversible chaos fueled by hatred and revengeRevelations about the direct involvement of Osama bin Laden in the terrorism campaigns in Iraq, Saudi Arabia, and the rest of the Middle East—including the major role played by Iran and HizbAllah in al-Qaeda's operationsDrawing upon an extraordinary wealth of previously untapped intelligence and regional sources, The Secret History of the Iraq War presents the most detailed, fascinating, and convincing account of the most controversial war of our times—and offers a sobering indictment of an intelligence system that failed the White House, the American military, and the people of the Middle East.",
        "Category": " History , Middle East , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Patterns in Evolution: The New Molecular View (\"Scientific American\" Library)",
        "Authors": "By Lewin, Roger",
        "Description": "In Patterns in Evolution, noted science journalist Roger Lewin explores how genetic information is providing new insight into evolutionary events: scientists are now able to study evolutionary change at the molecular level and reconstruct evolutionary lineages based on changes in DNA. With this new ability, they are overthrowing established ideas about which organisms are closely related and solving puzzles that had previously seemed beyond their reach. Lewin looks at how these new techniques are being used to explore a wide range of issues, from those regarding the deepest past to those concerned with the most recent present - from characterizing the universal ancestor of all life to tracking the trail of infection of the AIDS virus. The techniques have proved especially useful to anthropologists in their attempts to unravel the origins, both ancient and modern, of the human species.Evolutionary biologists put the new genetic tools to especially creative use in their studies of ecology and animal behavior, which lead to fresh perspectives on why species diverge and new species emerge. Lewin shows how the tools are supplying answers to questions as diverse as why some turtles migrate thousands of miles to breed, why species have particular mating patterns, and how the interplay of geology and climate determine the evolution of new species.Finally, Lewin looks at how scientists are resurrecting the DNA from animals long dead, including 5000-year-old mummies and 95-million-year-old insects trapped in amber, to give concrete answers to questions about the past. He shows how wolf skins stored in museums are guiding conservation efforts, how human remains from thousands of years ago are shedding light on ancient mating patterns, and how long-buried fossils are tempting scientists to undertake the challenge of recovering dinosaur DNA. A skilled storyteller, Roger Lewin brings to vivid life the investigations that are revealing not just the history of life, but the mechanisms of its evolution.",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Problem Solving: Grade 5 (Flash Skills)",
        "Authors": "By Flash Kids",
        "Description": "Flash Skills are a line of mini-workbooks designed to focus on specific skills. Each book uses a unique theme and adorable art to help young learners master math and reading through practice and reinforcement. Fun full-color stickers motivate and reward.",
        "Category": " Juvenile Nonfiction , Language Arts , Vocabulary & Spelling",
        "Publisher": "Flash Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Teacher's Little Instruction Book",
        "Authors": "By Adams, Homer and Johnson, Sarah Adams",
        "Description": "",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Pioneers",
        "Authors": "By Gorsline, Marie and Gorsline, Douglas",
        "Description": "Describes the typical experiences of pioneers traveling the Oregon Trail, including Indian attacks, mountain blizzards, and dangerous river crossings",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "The Rebirth of Europe",
        "Authors": "By Pond, Elizabeth",
        "Description": "The rejuvenation of Europe as a totalitarian century ends and a global century begins is a remarkable story. This book brings together the three dynamics of Europe's position at this extraordinary moment: European monetary union, the deepening of intra-EU cooperation, and the widening of the EU and NATO to take in central European members. It looks at the broad political and policy implications of EMU and shows how the United States views this integration. Elizabeth Pond, a longtime observer of events in Europe and Russia, sees these developments as the beginning of a new postnational European system that is replacing the centuries-old nation-state system. She shows how belligerence and anarchy have faded away on the European continent as compulsory cold war cooperation becomes a habit and as French-German reconciliation becomes the pattern for reconciliation between other old enemies. She follows NATO's transformation into a reluctant peacemaker in Bosnia and the United States' decision to remain a European power. She describes the leap of faith needed to create European monetary union and charts the magnetic attraction of both NATO and the EU in shaping the democratic, economic, and social revolutions in central Europe. She warns about the strains that will face the transatlantic relationship when the euro is on a par with the dollar as a reserve currency. And she concludes by agreeing with former Polish foreign minister Wladyslaw Barteszewski that we are witnessing, after the original birth of European consciousness a millennium ago, the rebirth of Europe.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Snow White and the Seven Dwarfs (Disney Classic) (Little Golden Book)",
        "Authors": "By Williams, Don (ILT)",
        "Description": "Now new and old fans can relive the magic of Walt Disney's classic Snow White and the Seven Dwarfs as it is retold in a beautiful full-color Little Golden Book!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Shacking Up: The Smart Girl's Guide to Living in Sin Without Getting Burned",
        "Authors": "By Whitman, Stacy and Whitman, Wynne",
        "Description": "The must-have guide for any woman who’s ever thought about saying “yes” to the other big question: Will you move in with me? More and more couples are choosing to live together before tying the knot—for convenience, to save money and, most importantly, to see if they’re compatible. While living together can be an exciting way to take your relationship to the next level, it can also present a host of new questions and challenges. With its fresh, girlfriend-to-girlfriend manner, Shacking Up walks you through every step of the cohabitation process, from making the initial decision to breaking up or getting married.  Beginning with a readiness quiz to help you decide if you and your honey are prepared to take the plunge, authors Stacy and Wynne Whitman provide a wealth of hands-on advice from lawyers, psychologists and financial planners as well as entertaining, true-life stories from couples with shacking up experience. Topics include: breaking the news to your family; managing and merging your finances; protecting yourself legally; real-estate decisions; and day-to-day dilemmas such as chores, privacy, and keeping the spark alive. Whether you opt for wedding bells or decide he’s not the one for you, Shacking Up is a stylish, empowering handbook for staying smart, savvy, and true to yourself along the road to happily ever after.",
        "Category": " Self-help , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Women's Wit and Wisdom: A Book of Quotations (Dover Thrift Editions)",
        "Authors": "By Rattiner, Susan L. (EDT)",
        "Description": "\"Blessed is the man who, having nothing to say, abstains from giving us wordy evidence of the fact,\" said Mary Ann Evans, a.k.a. George Eliot. \"In nine cases out of ten, a woman had better show more affection than she feels,\" opined Jane Austen. \"When a girl marries, she exchanges the attentions of many men for the inattention of one,\" observed Helen Rowland. These are just a few of more than 400 memorable quotes in this volume, expressed over the past 2,500 years by female poets, novelists, historical figures, celebrities, entertainers, and others.Covering a broad range of topics — men, women, love and romance, marriage, family, human nature, aging, the quest for gender equality, work and occupations, joy and sorrow, nature, the environment, and more — the quotations are divided into subject categories and arranged chronologically by the author's date of birth. Where possible, sources and dates are cited for each quote.Browse through these pages and immerse yourself in snippets of worldly wisdom from the poignant (\"The loneliest woman in the world is a woman without a close woman friend\" — Toni Morrison) to the despairing (\"Old age is woman's hell\" — Ninon de Lenclos) to the politically astute (\"Do not tell secrets to those whose faith and silence you have not already tested\" — Queen Elizabeth I) to the humorous (\"Flops are a part of life's menu, and I've never been a girl to miss out on any of the courses\" — Rosalind Russell).You'll also find food for thought from Sappho, Madame de Stael, Harriet Tubman, Margaret Sanger, Eleanor Roosevelt, Helen Keller, Erma Bombeck, Oprah Winfrey, Gloria Steinem, and Hillary Rodham Clinton, among others. Brimming with timeless observations, humor, and wisdom, this practical and entertaining little volume will be indispensable to public speakers and a delight to general readers.",
        "Category": " Literary Collections , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Fast Cycle Time: How to Align Purpose, Strategy, and Structure for Speed",
        "Authors": "By Meyer, Christopher",
        "Description": "Today, tens of thousands of companies are struggling to become \"time-based\" competitors, inspired by such corporations as Motorola, General Electric, Citicorp, and a myriad of others who have cut production time in half?or more. But until now, the literature has focused on the theory and philosophy of fast cycle time, rather than the tools and techniques for implementing it. Here, for the first time, Christopher Meyer, an internationally recognized expert in cycle time reduction, presents a step-by-step blueprint for transforming traditional companies into fast cycle competitors.  Meyer argues that fast cycle time is achieved not by working faster, but by aligning the organization's purpose, strategy and structure. He demonstrates how the product development cycle must become a learning laboratory in which the four continuous elements \"Design, Fabricate, Assemble, and Test\" are analyzed with the intent to improve strategy in the next business cycle. Analyzing strategy and core processes enables management to detect and correct problems earlier, and leverage knowledge for improved innovation and increased value for customers.  Employing an ongoing case study, Core Products, Inc., throughout the text, Meyer shows how to redesign the organization for manufacturability and assembly, how to implement multifunctional teams that work, how to analyze and map critical cycle time interdependencies such as \"co-location,\" and how to measure the impact of cycle time on business performance. Meyer's practical approach provides a simple methodology for organizations to deliver products to customers rapidly, accurately, and reliably.  \"Chris Meyer interrelates many pieces that we have all read about in different places into a coherent guide to making it happen. Ironically, as Meyer shows, implementing fast cycle time means almost the opposite of what most American managers are inclined to do...Many years of practical experience have shown Meyer and his colleagues the wisdom of a paradox?that to speed up you often have to slow down.\"  ?From the Foreword by Peter M. Senge",
        "Category": " Business & Economics , Industrial Management",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Digestive Wellness",
        "Authors": "By Lipski, Elizabeth",
        "Description": "There is currently an epidemic of digestive illness in this country, an epidemic that can be traced to the foods we eat and the way we live. One-third to one-half of all adults suffer from some sort of digestive problem, and faulty digestion is directly responsible for a vast array of other ailments--everything from bad breath, ulcers, heartburn, and constipation to colitis, diverticulitis, and irritable bowel syndrome. Disorders that are caused indirectly by this problem include arthritis, chronic fatigue syndrome, fibromyalgia, and migraine headaches. In this well-researched, comprehensive book, noted nutritionist Elizabeth Lipski helps readers understand the complex interrelationships of the digestive process.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Keats",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Hope: The Story of Geraldine Owen Delaney, Alina Lodge and Recovery",
        "Authors": "By B., Dick and Martin, Joseph C. (FRW)",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Paradise Research Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Fragments of My Fleece",
        "Authors": "By Acheson, Dean",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Sanctuary: The Path to Consciousness",
        "Authors": "By Lewis, Stephen and Slawson, Evan",
        "Description": "More than half a century after Einstein first described the energetic unity of the world in his famous equation, E=mc2, we are finally beginning to understand the spiritual and mystical implications of his discovery. Sanctuary: The Path to Consciousness is about the miraculous possibilities that emerge when we see the universe as a matrix of frozen light, the spiritual manifestation of our intuitive consciousnesses.In this remarkable novel, you will find a new energetic model of the body, the spirit, and the nature of the physical world. It points the way to unlimited possibilities of absolute, eternal transformation, and you will find out that it is readily available now!After reading this book, you too can take advantage of the techniques of energetic Quantum-Consciousness Evaluation, and be able to identify and remove subtle-energy imbalances to attain and integrate physical, emotional, and spiritual harmony!",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Hay House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Emblems of Mind: The Inner Life of Music and Mathematics",
        "Authors": "By Rothstein, Edward",
        "Description": "The chief music critic of The New York Times explores the mysterious relationship between music and mathematics, detailing their common origins, their historical interconnections, and the similarities in their stated goals. 20,000 first printing.",
        "Category": " Music , Instruction & Study , Appreciation",
        "Publisher": "Crown",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Oxford Companion to Music",
        "Authors": "By Scholes, Percy Alfred",
        "Description": "Comprehensive reference book provides definitions of musical terms, biographies, and synopses of opera plots among its entries",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "8.25",
        "Publish Date": {
            "Month": "April",
            "Year": "1970"
        }
    },
    {
        "Title": "The Ultimate Audition Book: 222 Monologues 2 Minutes and Under (Monologue Audition Series)",
        "Authors": "By Beard, Jocelyn A. (EDT), Capecci, John (EDT), Walker, Laurie (EDT), Ziegler, Irene (EDT), and Aston, Irene Ziegler (EDT)",
        "Description": "Provides a collection of monologues taken from fiction, essays, and poetry.",
        "Category": " Performing Arts , Acting & Auditioning",
        "Publisher": "Smith & Kraus Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Excuses, Excuses!",
        "Authors": "By Rutledte, Leigh W.",
        "Description": "Rationalizations, alibis, and lies from Mark Twain, Zsa-Zsa Gabor, George Bush, and others, make up an entertaining manual for misleading congress, missing the rent, or getting out of any sticky situation",
        "Category": " Humor , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Competing on the Edge : Strategy as Structured Chaos",
        "Authors": "By Brown, Shona L. and Eisenhardt, Kathleen M.",
        "Description": "Unstable markets, fierce competition, and relentless change are the only certainties in today's chaotic business world. In their startling new book, authors Brown and Eisenhardt contend that to prosper in such volatile conditions, standard survival strategies must be tossed aside in favor of a revolutionary new paradigm&#151;competing on the edge. To compete on the edge is to relentlessly reinvent, and it's the only way to navigate the treacherous waters of tumultuous markets. Competing on the edge is an unpredictable, sometimes even inefficient strategy, yet a singularly effective one in an era driven by change. It requires charting a course along the edge of chaos, where a delicate compromise is struck between anarchy and order, to the edge of time, where current business is the primary focus, but actions are shaped by past legacies and future opportunities. By adroitly maneuvering through chaos and time, managers can avoid constantly reacting to nonstop change and instead set a rhythmic pace that others must follow, thereby shaping the competitive landscape&#151;and their own destiny. In the first book to translate leading edge concepts from complexity theory into management practice, each chapter focuses on a specific management dilemma and illustrates a solution. Linking where do you want to go? With how will you get there? Here's a bold and surprising strategy that works&#151;when the name of the game is change.",
        "Category": " Business & Economics , Advertising & Promotion",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Jesus, His Life and Teachings: As Told to Matthew, Mark, Luke, and John",
        "Authors": "By Girzone, Joseph F.",
        "Description": "Joseph Girzone, the author who so powerfully captured the spirit of Jesus in his Joshua novels and in his bestselling A Portrait of Jesus, now brings his work to culmination with a beautiful retelling of the life and work of Jesus based on the accounts in the Gospels of Matthew, Mark, Luke, and John.Girzone captures the greatest story ever told in language that will open the hearts of readers from all backgrounds. From the birth of the Messiah to the wedding at Cana, the Sermon on the Mount, the Passion, and the triumphant Resurrection, each episode and lesson from the life of Jesus is rendered with wisdom and freshness.Elegantly designed, this trade paperback original will find an enthusiastic audience with the millions of Girzone readers. -->",
        "Category": " Religion , Biblical Biography , New Testament",
        "Publisher": "Image",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Modern Literary Criticism: An Anthology",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "sed & awk (Nutshell Handbooks)",
        "Authors": "By O'Reilly, Tim and Dougherty, Dale",
        "Description": "For people who create and modify text files, sed and awk are power tools for editing. Most of the things that you can do with these programs can be done interactively with a text editor. However, using sed and awk can save many hours of repetitive work in achieving the same result.To master sed and awk you must thoroughly understand UNIX regular expressions, and understand the syntax of sed and awk commands.  This handbook treats regular expressions as a foundation for learning aboutsed and awk and contains a comprehensive treatment of sed and awk syntax.  It emphasizes the kinds of practical problems that sed and awk  can help users to solve, with many useful example scripts and programs.Contents include:A tutorial showing basic operations of sed and awkRegular expression syntax and examplesBasic and advanced sed commandsFeatures of awk (plus gawk and nawk)Common programming constructsAdvanced topicsUser-contributed scripts",
        "Category": " Computers , Programming Languages , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Unix C Shell Field Guide",
        "Authors": "By Anderson, Paul and Anderson, Gail",
        "Description": "",
        "Category": " Computers , Operating Systems , UNIX",
        "Publisher": "Prentice Hall Ptr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Java Head",
        "Authors": "By HERGESHEIMER, Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "77.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1919"
        }
    },
    {
        "Title": "New Art City",
        "Authors": "By Perl, Jed",
        "Description": "A fascinating, panoramic exploration of art and culture in mid-twentieth-century New York City from one of our most important and influential art critics. New Art City takes us from the solitude of the artist’s studio to the uproarious bars where artists gathered, from the ramshackle bohemian neighborhoods of downtown Manhattan to the Midtown streets where steel-and-glass skyscrapers were rising and art galleries were proliferating. We encounter a kaleidoscopic range of artists. There are legendary figures–Jackson Pollock, David Smith, Willem de Kooning, Joseph Cornell, Andy Warhol, and Donald Judd–as well as still undervalued ones, such as the galvanic teacher Hans Hofmann, the lyric expressionist Joan Mitchell, the adventuresome realist Fairfield Porter, and the eccentric thinker John Graham. We encounter, too, the writers, critics, patrons, and hangers-on who rounded out the artists’ world. Jed Perl helps us see what the artists were creating and understand how they confronted an exploding art audience. And he makes clear how the economic boom of the late 1950s and the increasingly enthusiastic response to Abstract Expressionism ushered in the rapacious art world of the 1960s and the theatricality of Pop Art. Artists drew strength from the dizzying onslaught of Manhattan, and produced a tidal wave of new forms. These included Hofmann’s brazen flourishes of color; Pollock’s quicksilver skeins of paint unfurling panoramic arabesques; and the crushed, jagged, turning-back-on-itself calligraphy of de Kooning’s gnomic alphabets. And there was much more: Burgoyne Diller’s levitating rectangles; Nell Blaine’s explosive renderings of quotidian scenes; Ellsworth Kelly’s extraordinary simplifications, suggesting sails or semaphores. A brilliant tapestry of social history, biographical portraiture, and criticism, New Art City illuminates a revolutionary, unprecedented time and place in American culture.",
        "Category": " Art , Criticism & Theory",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Colors (Bright Baby)",
        "Authors": "By Priddy, Roger (NA)",
        "Description": "Perfect for babies and toddlers, this charming board book features every color of the rainbow! With bright, easy-to-turn pages and two unique examples of each color, this book is an essential addition to any baby's library. The combination of colorful pictures and simple words will help to build your child's vocabulary.",
        "Category": " Juvenile Nonfiction , Concepts , Colors",
        "Publisher": "Priddy Books US",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Jerry Baker's Supermarket Super Remedies: 1,649 Shopping Cart Solutions to Ease Everything from an Aching Back and Arthritic Knees to a Grumpy Gut, ... & Much More! (Jerry Baker Good Health series)",
        "Authors": "By Hoffman, Matthew",
        "Description": "Discover the amazing healing powers of ordinary household products in this guide to treating common ailments without a trip to the doctor’s office or the pharmacy. Learn to beat a backache with beans, clobber high cholesterol with chocolate, halt hay fever with honey, and stop a sore throat with sage using this helpful book to conquer more than 370 common complaints with foods and products found in the home. Additional features such as \"Fabulous Food Fixes,\" \"Magic Mixes,\" and \"Soothing Sips\" present quick and easy teas, tonics, and lotions to alleviate everything from allergies and fatigue to arthritis and heartburn while \"Just What the Doctor Ordered\" covers doctor approved treatments on everything from heart disease to osteoporosis.",
        "Category": " Health & Fitness , Healing",
        "Publisher": "American Master Products, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Power of Identity (The Information Age: Economy, Society and Culture, Volume II)",
        "Authors": "By Castells, Manuel",
        "Description": "This is an account of the two great and conflicting trends now shaping the world: globalization and identity.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Wiley-Blackwell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Post-Traumatic Stress Disorder Sourcebook",
        "Authors": "By Schiraldi, Glenn R.",
        "Description": "For the millions who suffer from the effects of a traumatic experience, this book offers help and hope and provides the diverse elements needed for lasting recovery. Trauma can take many forms, from the most disturbing of circumstances such as witnessing a murder or violent crime to the subtle trauma of living with the effects of abuse or alcoholism. Deep emotional wounds often seem like they will never heal, but Schiraldi has helped and witnessed survivors recover, grow, and find happiness.By helping people recognize the coping mechanisms and by dealing directly with the effects of a traumatic experience, there is a great reason for hope. The Post-Traumatic Stress Disorder Sourcebook is a guide for both survivors and their loved ones, helping them to see that on the other side of their pain is recovery and growth.Explains the psychic defenses that can go into effect to protect a victim from further emotional harmProvides information on triggers and the debilitating effects of post-traumatic stress disorderAddresses how the healing process can begin and how fear diminishes through a variety of medic and nonmedicinal treatment methods",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Original Sin (Seven Deadly Sins)",
        "Authors": "By Brennan, Allison",
        "Description": "Haunted by chilling memories of demonic possession and murder, Moira O’Donnell has spent seven years hunting down her mother, Fiona, whose command of black magic has granted her unprecedented control of the underworld. Now Moira’s global search has led her to a small California town that’s about to become hell on earth. Tormented by his own terrifying past and driven by powers he can’t explain, ex-seminarian Rafe Cooper joins Moira’s dangerous quest. But Fiona is one devilish step ahead. Hungry for greater power, eternal youth, and stunning beauty, the sorceress is unleashing upon the mortal world the living incarnations of the Seven Deadly Sins.Together with a demonologist, a tough female sheriff, and a pair of star-crossed teenagers, Moira and Rafe are humanity’s last chance to snatch salvation from the howling jaws of damnation.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Economics of Development",
        "Authors": "By Gillis, Malcolm (EDT), Perkins, Dwight H., Roemer, Michael, and Snodgrass, Donald R.",
        "Description": "",
        "Category": " Business & Economics , Development , Economic Development",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Intervention",
        "Authors": "By Cook, Robin",
        "Description": "It's been more than thirty years since New York City medical examiner Jack Stapleton's college graduation, and almost as long since he's been in touch with former classmates Shawn Daughtry and James O'Rourke. Jack was once a highly regarded ophthalmologist, but his career took a dramatic turn after a tragic accident destroyed his family. And that, too, is very much in the past: Jack has remarried - to longtime colleague and fellow medical examiner Laurie Montgomery - and is the father of a young child, who has unfortunately been diagnosed with neuroblastoma, a childhood cancer.No matter what stresses he faces, Jack's renegade, activist personality can't rest. After performing a postmortem on a promising young college graduate who had recently been treated by a chiropractor, Jack begins researching alternative medicine as a way to avoid obsessing about his child's illness. Quickly, he is confronted by the question of what makes some people step outside the medical establishment to seek help from therapies based on dubious science, Eastern philosophies, or even faith healers.Jack's classmate Shawn Daughtry is now a renowned archaeologist and biblical scholar. Brash, impetuous, and completely career-driven, Shawn makes a spectacular find at a souk in Cairo: an ancient codex, whose contents may vault him to international fame. His discovery takes him on a secret journey to what is held to be Saint Peter's tomb beneath the basilica in Rome, where he hopes to unearth a two-thousand-year-old ossuary, the contents of which may have earthshaking ecclesiastical and medical implications.Shawn can't wait to flaunt his treasure before his old college buddy James O'Rourke - now James Cardinal O'Rourke, bishop of the Archdiocese of New York: the treasure may jeopardize the very nature of papal infallibility. Desperate to protect his church and his own political ambitions, James turns to his friend Jack to help safeguard an explosive secret, one with the power to change lives forever.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Longarm and the Yukon Queen (Longarm #277)",
        "Authors": "By Evans, Tabor",
        "Description": "After witness Harrison Dodge flees Washington before testifying, U.S. Deputy Marshal Long is sent to retrieve him, but unfortunately for Long, Dodge has fled to Alaska, a region only slightly smaller than the continental U.S.",
        "Category": " Fiction , Westerns",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Art of the Old West (From the Collection of the Gilcrease Institute) by Paul A. Rossi (1971-09-12)",
        "Authors": "By Paul A. Rossi, David C Hunt",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "9.08",
        "Publish Date": {
            "Month": "September",
            "Year": "1971"
        }
    },
    {
        "Title": "Christmas Around the World Cookbook",
        "Authors": "By Hooper, V.",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Ideals Publishing Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "New Garden Book (Better Homes and Gardens)",
        "Authors": "By Better Homes & Gardens",
        "Description": "All aspects of home landscaping and gardening are illustrated and described for the amateur gardener",
        "Category": " Gardening , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Better Than Peanut Butter & Jelly: Quick Vegetarian Meals Your Kids Will Love!",
        "Authors": "By Muldawer, Wendy and Mattare, Marty",
        "Description": "",
        "Category": " Cooking , Vegetarian",
        "Publisher": "McBooks Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "New Perspectives on Microsoft Windows XP Professional for Power Users (New Perspectives (Course Technology Paperback))",
        "Authors": "By Phillips, Harry L.",
        "Description": "",
        "Category": " Computers , Operating Systems , General",
        "Publisher": "Course Technology",
        "Price Starting With ($)": "42.51",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Leading Life-Changing Small Groups",
        "Authors": "By Donahue, Bill P. and Willow Creek Community Church (South Barrington, Ill.) (COR)",
        "Description": "",
        "Category": " Religion , Christian Church , Administration",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Don't Bet on It (Hannah Montana #10)",
        "Authors": "By Lloyd, Ann (ADP)",
        "Description": "Series Description:Miley Stewart looks like a regular girl-next-door, but when the lights go down, Miley is teen pop sensation Hannah Montana! Off stage, Miley wants her life to be as normal as possible, so only a few people know the truth about her dual identity. But keeping that secret is harder than Miley ever thought it would be. Hannah Montana #10: Don't Bet on ItWhen Miley needs a ride to the hottest fashion show of the year, her brother Jackson takes advantage by making Miley a bet she can't refuse. If Miley wins, Jackson will continue to drive her anywhere she wants to go. But if Miley loses, she must find her own transportation--from now on! Plus, when the paparazzi snap pictures of Hannah Montana and Jackson together, Jackson suddenly has an “in” with Hannah's celebrity circle.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Counterfeit Revival",
        "Authors": "By Hanegraaff, Hank",
        "Description": "Hank Hanegraaff documents the danger of looking for God in all the wrong places and goes behind the scenes into the wildly popular and bizarre world of contemporary revivalism. Hanegraaff masterfully exposes the stark contrast between these deeds of the flesh and a genuine work of the Spirit by contrasting modern \"revivals\" with the scriptural examples of God's movement among His people.",
        "Category": " Religion , Christianity , Pentecostal & Charismatic",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Annual Recipes 2005",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Publishing Group",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "CFA Program Curriculum - 2009 (Level 1, Volume 5)  Equity and Fixed Income",
        "Authors": "By CFA institute",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Custon Publishing",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "BRAIN WAVE",
        "Authors": "By Poul Anderson",
        "Description": "",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Derivatives and Alternative Investments: Level 1 2009 (CFA Program Curriculum-Volume 6)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Custom Publishing",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "3rd Blue Book of Dolls & Values: A Guide to Identification",
        "Authors": "By Foulke, Jan",
        "Description": "",
        "Category": "",
        "Publisher": "Hobby House Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Sex Has a Price Tag: Discussions About Sexuality, Spirituality and Self Respect",
        "Authors": "By Kirgiss, Crystal and Stenzel, Pam",
        "Description": "“If I only had known what could happen, I would have made a different choice!!!”A decade in a crisis pregnancy center, counseling both Christian and non-Christian teens…speaking to millions of students through the years…counseling and answering the letters of thousands of teens…Pam Stenzel has heard this statement over and over and over again. From kids like you.Sex Has a Price Tag rejoices that, indeed, sex is glorious. Sex is God-given. But sex outside of God’s boundary is behavior that has far-reaching consequences. Outside a monogamous marriage it has a price tag of incalculable costs.Here are real testimonies, encouragement, and advice about:abstinence vs consequencesBiblical definitions and examplesphysical diseases and emotional disasterexamination of urgestaboo subjects including masturbationadvice on where to go for helpavoiding sexual activity and awkward situationsdealing with friends, parents…and your self-respectSex Has a Price Tag is brutally frank but totally sympathetic, written to girls and guys. Here are searing personal testimonies, medical stats, and practical solutions; encouragement in the form of Biblical examples, support and networking options, innovative alternatives to dating situations, and creating journaling. There are sources and links for seeking help. Sex Has a Price Tag is life-affirming, and is a life-saver.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan/Youth Specialties",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Beyond Grits and Gravy: The South's All-Time Favorite Recipes (Best of the Best Cookbook Series)",
        "Authors": "By McKee, Gwen and Moseley, Barbara",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Quail Ridge Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Making Washington Work: Tales of Innovation in the Federal Government",
        "Authors": "By John F. Kennedy School of Government (COR), Donahue, John D. (EDT), and Council for Excellence in Government (COR)",
        "Description": "Everybody knows federal agencies are brain-dead leviathans. Everybody knows that the watchword of federal management is \"that's the way we've always done it.\" Everybody knows that any creativity within American government shows up only in the cities and states. Everybody's wrong.    In 1995 the Ford Foundation's annual \"Innovation in American Government\" award competition was opened up to federal candidates and a third of the winners since then have been federal institutions. This book profiles the 14 federal award winners from 1995 to 1998 and challenges the conventional wisdom about the federal bureaucracy's capacity to adapt. Examples include the Consumer Product Safety Commission, which figured out how to identify and act upon business and government's shared stake in keeping dangerous products out of consumers' hands; and the Wage and Hour inspectors in the Labor Department, who deployed market leverage to put pressure on the garment-industry scofflaws whose sweatshops had evaded conventional enforcement.    The stories show how pressure, promises, and professional pride can galvanize federal managers and front-line workers to overcome what are admittedly imposing impediments to change, and persevere with new ways to deliver on their missions. And they illustrate the unfashionable truth that innovation is within Washington's repertoire after all.    Copublished with the Council for Excellence in Government",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Real World Adobe Illustrator CS3",
        "Authors": "By Golding, Mordy",
        "Description": "Real World Adobe Illustra tor CS3 is the definitive reference to Adobe's industry-standard vector graphics software. With an easy, engaging style, author Mordy Golding takes readers through all of the features of the program, explaining not only how to use the multitude of features but also why and when to use them. This edition has been thoroughly updated for Illustrator CS3, including insightful techniques on using the new Live Color environment and its tools, a new Isolation mode for working on complex artwork, and new tools for drawing, erasing, modifying, and cropping graphic. New integration features with Flash CS3 are also covered in depth; for example, readers learn how symbols can be defined as movie clips for use in Flash. Now that Illustrator and Flash are both part of several bundled offerings of the Creative Suite, this coverage is a key part of the entire uninterrupted workflow from initial concept to final execution.Along with tips, sidebars, and expert commentary, there are also numerous illustrations and screen shots included to offer readers the most complete coverage on this extraordinary application. Designers from all fields--illustrators, animators, package designers, graphic designers, web designers, and more--will find Real World Adobe Illustrator CS3 their one-stop guide to creating powerful designs in Illustrator",
        "Category": " Computers , Desktop Applications , Desktop Publishing",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "InDesign CS3 for Macintosh and Windows",
        "Authors": "By Cohen, Sandee",
        "Description": "Visual QuickStart Guide—the quick and easy way to learn!     Users of Adobe InDesign will be impressed with the power, ease of use,  and integration found in the new InDesign CS3, Adobe's page-design  component of Creative Suite 3. Users will also find more robust  file-placing capabilities, new Find features, and great new text and  transparency effects, among other exciting features. Adobe InDesign CS3 for Macintosh and Windows: Visual QuickS tart Guid e  will highlight the important new features, as well as covering the ones  readers have relied on in previous versions of InDesign. Using the  task-based, visual approach that readers count on in the Visual QuickStart Gui de s,  this volume introduces readers to all aspects of InDesign CS3. Users  will learn how to create and automate documents, import and style text  and objects, manage long documents, export files for a wide variety of  purposes, and    Easy visual approach uses pictures to guide you through InDesign and show you what to do. Concise steps and explanations let you get up and running in no time. Page for page, the best content and value around.much more.",
        "Category": " Computers , Digital Media , Desktop Publishing",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Adobe Photoshop CS3 On Demand",
        "Authors": "By Johnson, Steve",
        "Description": "Adobe® Photoshop® CS3   FOR THOSE WHO WOULD RATHER BE SHOWN HOW THAN TOLD HOW       SEE HOW TO    • Browse, organize, and process files using Adobe Bridge and Version Cue • Use automatic layer alignment and blending to work with objects • Use live filters to view and modify the results of opening files • Use more precise color correction to enhance a photo • Easily convert images to black and white • Use image trickery to change or enhance an image • Create eye catching bevels and special effects • Transform plain text into a show-stopping image • Create Web animation sequences the easy way • Use tool presets to construct the right tool for the right job • Test content on different target devices using Adobe Device Central   On the Web This  book uses real world examples to give you a context in which to perform  a task. This book also includes workshops to help you put together  individual tasks into projects. The Photoshop example files that you  need for project tasks are available at www.perspection.com   Perspection  has written and produced books on a variety of computer software,  including Adobe Flash CS3 Professional, Adobe Photoshop CS3 and CS2,  Adobe Dreamweaver CS3, Microsoft Office 2007 and 2003, Microsoft  Windows Vista and XP, Microsoft Expression Web, and Apple Mac OS X  Panther. Perspection was founded in 1991, and is committed to providing  information and training to help people use software more effectively.  Perspection has written more than 80 computer books, and sold more than  5 million copies.   Includes ACE Courseware Objectives!   This  courseware meets the objectives for the Adobe Certified Expert (ACE)  Program. Upon completion of this courseware you may be prepared to take  an exam for ACE qualification. To learn more about becoming an Adobe  Certified Expert, visit www.adobe.com/support/certification/ace.html",
        "Category": " Computers , Desktop Applications , Desktop Publishing",
        "Publisher": "Que Publishing",
        "Price Starting With ($)": "4.97",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Perspectives on Personality (5th Edition)",
        "Authors": "By Carver, Charles S. and Scheier, Michael F.",
        "Description": "",
        "Category": " Psychology , Personality",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Urban Enclaves: Identity and Place in America (Contemporary Social Issues)",
        "Authors": "By Abrahamson, Mark",
        "Description": "02 This brief, readable supplement asks the question, \"How do communities which are as distinct as Boston's Beacon Hill and Chicago's South Side form in diverse urban areas and why?\"",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Worth Publishers",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Adolescence",
        "Authors": "By Santrock, John W.",
        "Description": "\"More students learn from John Santrock's Adolescence than from any other text in this field. The 14th edition combines proven pedagogy and the most current research to provide a market leading presentation of adolescence. This time tested text provides compelling contemporary research, including updates from eleven leading experts in the field. The text's accessible presentation, plentiful applications and engaging writing foster increased mastery of the content. The new edition includes substantially expanded material on diversity and culture, adolescents' and emerging adults' health and well-being, including numerous recommendations for improving the lives of adolescents, and expanded emphasis on the positive aspects of adolescent development\"--",
        "Category": " Psychology , Developmental , Adolescent",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "The Biggest Loser 30-Day Jump Start: Lose Weight, Get in Shape, and Start Living the Biggest Loser Lifestyle Today!",
        "Authors": "By Wheeler, Lisa, Biggest Loser Experts And Cast, Roberson, Melissa, and Forgerg, Cheryl",
        "Description": "Over the last six seasons of The Biggest Loser, you've watched as contestants shed pounds, got healthy, and dramatically changed their lives for the better. In fact, you may have been so inspired by the show's remarkable success stories that you've considered embarking on your own weight loss journey. If you're looking to get healthy now, there's good news: You don't have to spend time at the ranch to benefit from The Biggest Loser magic. THE BIGGEST LOSER: 30 DAY JUMP START by Cheryl Forberg, RD, Melissa Roberson, Lisa Wheeler, brings all of the secrets of the ranch right into your own home. The Biggest Loser experts—the same ones who advise the contestants—are here to walk you through a 30-day plan that will kick off your weight loss and help you build new, healthy habits. In this book you'll find easy-to-follow menus, recipes, exercise plans, and motivation for each day of the week. You'll also find helpful tips and advice from past Biggest Losers who have been in your shoes, including the nine contestants from Season 7 who left the ranch early to follow this very plan at home. So far, the Biggest Losers have lost more than a combined 10,000 pounds. But for each of them, the journey started with a commitment: to health, to weight loss, and to themselves. The first steps toward a healthier future are in this book—what are you waiting for? Make the commitment, take the leap—and begin your 30 day jump start today!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "First Family (King & Maxwell Series, 4)",
        "Authors": "By Baldacci, David",
        "Description": "In this #1 New York Times bestseller, a child is kidnapped at a presidential retreat and two former Secret Service agents must become private investigators in a desperate search that might destroy them both.A daring kidnapping turns a children's birthday party at Camp David, the presidential retreat, into a national security nightmare. Former Secret Service agents turned private investigators Sean King and Michelle Maxwell don't want to get involved. But years ago Sean saved the First Lady's husband, then a senator, from political disaster. Now the president's wife presses Sean and Michelle into a desperate search to rescue a kidnapped child. With Michelle still battling her own demons, the two are pushed to the limit, with forces aligned on all sides against them-and the line between friend and foe impossible to define...or defend.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Wed and Buried (Bed-and-Breakfast Mysteries)",
        "Authors": "By Daheim, Mary",
        "Description": "Unholy MatrimonyAsk not for whom the wedding bell tolls, it tolls for Judith McMonigle Flynn's son Mike--and the Hillside Manor b&b is packed to the rafters with relatives. However, Mama Judith's unrestrained joy is somewhat dampened when, during the rehearsal dinner downtown, she spies a tuxedo-clad gent tossing a bridal-gowned beauty off the roof of a nearby hotel. Always one to eagerly exclaim \"I do!\" when offered the opportunity to investigate nefarious deeds, Judith's determination to unveil a killer could put undo stress on her own marital bliss with policeman-hubby Joe. But she remains wedded to her mission--and she's not about to take a honeymoon from amateur sleuthing until she's gotten to the bottom of the homicidal hanky-panky surrounding a match made in hell.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "The I Have A Life Bride's Guide: Plan The Wedding You've Always Wanted--without Losing Your Mind",
        "Authors": "By Mattei, Andrea (EDT)",
        "Description": "So you want to plan an unforgettable wedding, but you don't want to get swallowed up in a whole lot of craziness? True enough, some women have the time and inclination to eat, sleep, and breathe every last detail of planning their weddings, but that's not you. You need a practical, true-to-life guide that boils your wedding planning details down to the nitty-gritty basics. If you're pressed for time - and patience - and want to avoid all the excess fluff and fuss, The \"I Have a Life\" Bride's Guide is the book for you.This no-nonsense guide shows you how to:De-stress and stay cool at all timesBalance your wedding plans with your hectic scheduleSteer clear of unnecessary expensesCut to the chase when deciding on where to have your ceremony and receptionAvoid time drains and pitfalls when choosing a caterer, a band, or a floristDon't bother snagging separate books on wedding budgets, wedding etiquette, and wedding photography - The \"I Have a Life\" Bride's Guide is the only book you need to save your sanity and enjoy your wedding day!",
        "Category": " Reference , Weddings",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Landscape Construction 1-2-3: Build the Framework for a Perfect Landscape with Fences, Walls, and More (Expert Advice from the Home Depot)",
        "Authors": "By Holms, John P. (EDT)",
        "Description": "Packed with practical techniques and technical know-how to help do-it-yourselfers succeed.Covers fences and gates, retaining walls, outdoor sheds, trellises and arbors, outdoor electricity, plumbing and drainage, and working with concrete.\"Wisdom of the Aisles\" on every page guarantees a beautifully landscaped yard.Guarantees great results with step-by-step instructions, timeframe for completion, plus skills and materials lists.Plenty of helpful tips and shortcuts that the pros use.",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Home Depot",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Fences, Gates and Trellises",
        "Authors": "By Barrett, James",
        "Description": "",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Creative Homeowner Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Organizational Behavior, 11th Edition (Text Only)",
        "Authors": "By Robbins, Stephen P.",
        "Description": "",
        "Category": " Business & Economics , Management",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.78",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Barbecue! Bible: Over 500 Recipes",
        "Authors": "By Raichlen, Steven",
        "Description": "Argentinean Veal and Chicken Kebabs. Balinese Prawn SatSs and Grilled Sweet Potatoes with Sesame Dipping Sauce. Mexico's Yucatan-Style Grilled Fish, Italy's famous Bistecca alla Fiorentina, Senegalese Grilled Chicken with Lemon Mustard Sauce, and the best Memphis Ribs, Texas-Style Barbecued Brisket, and North Carolina Pulled Pork ever. Plus grilled sides, grilled starters, grilled desserts, The Ten Secrets of Perfect Grilling, and master recipes for steak, chicken, fish, and vegetables. Written by Steven Raichlen, the multi-award-winning cookbook author whose boundless enthusiasm took him 150,000 miles across 5 continents to discover the world's best grilled food, The Barbeque Bible! (over 310,000 copies in print) is a 512-page celebration of sizzle, smoke, secret sauces, and everything we love about cooking over fire. Main Selection of the Book-of-the-Month Club's Good Cook Club. Winner of a 1998 IACP/Julia Child Cookbook Award.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Cheap. Fast. Good!",
        "Authors": "By Mills, Beverly, Ross, Alicia, and Guarnaccia, Steven",
        "Description": "Not a penny-pinching cookbook—a \"get smart!\" cookbook.No more staring helplessly at rising grocery bills or, too harried for time, shelling out twenty-five bucks for mediocre take-out. The work of two brilliant problem-solvers,Cheap. Fast. Good! cuts through both the budget dilemma and the time dilemma with 275 recipes for great, family-pleasing dishes, most of which take under 25 minutes to prepare and average out to cost less—and usuallyfar less—than $2 a serving.Home Ec simplifiedSaving money in the kitchen is as simple as one four-letter word: Cook. But cooking to save means cooking food you and your family are going to love—and cooking (and shopping) smart. In dozens of time-and-money-saving tips, techniques, strategies, and solutions, the authors show how to make the right choices again and again.They'll never know you're thriftyPan-Fried Pork Chops with Pepper MedleyStuffed Peppers with Kielbasa RiceZesty Chicken SautéBayou Stew Catfish with Pecan CrustCinco de Mayo SkilletQuickie CacciatorePerfect Spinach Pesto PizzaMoroccan Meatballs Over CouscousSalmon Pasta with Tomatoes and Dill...Even when it's time to s-t-r-e-t-c-hOnion Chopped Steak with Easy Gravy Oven-Baked BBQ Chicken ThighsFall Sausage and Cabbage SautéUltra-Easy Veggie QuesadillasPasta e FagioliMy Beef and Barley Soup Ziti Mexi-Cali",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "You Can Paint Still Lifes (North Light Studio Series)",
        "Authors": "By Crawshaw, Alwyn",
        "Description": "Teaches techniques for painting still lifes in a variety of media, including oil paint, watercolor, acrylic, and pastel",
        "Category": " Art , General",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Semi-Homemade Slow Cooker Recipes 2",
        "Authors": "By Lee, Sandra",
        "Description": "Wouldn't it be nice if dinner could be ready when you are? It can be with a slow cooker and one of the 120 delicious recipes from Semi-Homemade Slow Cooking 2. Keeping to her formula of simple and quick, Sandra Lee presents recipes that taste like you spent hours in the kitchen. From traditional slow cooker menus that cover hearty soups, stews and chilis, Sandra introduces One-Pot Meals, 5-Ingredient Dishes, Poultry, Meat, and Desserts that all can be slow cooked to perfection.",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Care Packages for the Home: Dozens of Ways to Regenerate Spirit Where You Live",
        "Authors": "By Glanz, Barbara A.",
        "Description": "Offers practical suggestions for improving family relations, including communication, home atmosphere, family activities, and positive attitudes",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Parenting adolescents",
        "Authors": "By Huggins, Kevin",
        "Description": "",
        "Category": "",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Oxymoronica: Paradoxical Wit and Wisdom from History's Greatest Wordsmiths",
        "Authors": "By Grothe, Mardy",
        "Description": "ox-y-mor-on-i-ca (OK-se-mor-ON-uh-ca) noun, plural: Any variety of tantalizing, self-contradictory statements or observations that on the surface appear false or illogical, but at a deeper level are true, often profoundly true. See also oxymoron, paradox.examples:\"Melancholy is the pleasure of being sad.\"Victor Hugo\"To lead the people, walk behind them.\" Lao-tzu\"You'd be surprised how much it coststo look this cheap.\"Dolly PartonYou won't find the word \"oxymoronica\" in any dictionary (at least not yet) because Dr. Mardy Grothe introduces it to readers in this delightful collection of 1,400 of the most provocative quotations of all time. From ancient thinkers like Confucius, Aristotle, and Saint Augustine to great writers like Shakespeare, Oscar Wilde, and G. B. Shaw to modern social observers like Woody Allen and Lily Tomlin, Oxymoronica celebrates the power and beauty of paradoxical thinking. All areas of human activity are explored, including love, sex and romance, politics, the arts, the literary life, and, of course, marriage and family life. The wise and witty observations in this book are as highly entertaining as they are intellectually nourishing and are sure to grab the attention of language lovers everywhere.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Home-Tested Slow Cooker Recipes",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Paula Deen's The Deen Family Cookbook",
        "Authors": "By Richardson, Alan (PHT), Deen, Paula H., and Clark, Melissa (CON)",
        "Description": "In Paula Deen's The Deen Family Cookbook, Paula and the Deens, Hiers, Groovers, and Orts share their recipes and memories.“Many of the bonds my family has were forged over the dinner table and through the sharing of recipes. Cooking is the way we express our love for one another....I feel so lucky and blessed by the strong support and wonderful memories—and the incredible recipes—that my family has brought me. They are the heart and soul of this book.” —from the Introduction Nothing is more important to Paula Deen than her family, and nothing makes that big family happier than sitting down to a meal together. Paula's beloved Aunt Peggy makes an Old-Fashioned Meat Loaf that's as good in sandwiches the next day as it is for dinner. Baby brother Bubba Hiers brings his Beer and Onion Biscuits to the table, and his daughter, Corrie, makes a simple but luscious Lemony, Buttery Baked Fish that's perfect for a weeknight dinner. (Her Carrot-Pecan Cupcakes with Cream Cheese Frosting are pretty tasty, too!) Son Jamie makes Huevos Rancheros, perfect for brunch, or try Bobby's Whole Wheat and Honey Pancakes. Husband Michael Groover knows his way around a grill: try his Company's Coming Grilled Steak and Veggie Supper for easy entertaining, and finish the evening with his Irish Coffee. Of course, there was no way The Lady herself was going to let her relatives have all the fun: Paula is, after all, Paula. She shares her recipe for the Ham and Chutney Biscuit Fingers she puts on the table at every family party as well as the Eggplant and Sausage Lasagna that went a long way toward getting the boys to eat their vegetables. And while there's plenty of butter, bacon, and mayonnaise in these pages, you'll find some of the lighter recipes that Paula enjoys, too: Seared Scallops with Pineapple-Cucumber Salsa is her first choice for a healthful but romantic supper with Michael, and Oven-Fried Chicken Breasts with Honey-Yogurt Drizzle lets Paula indulge in her favorite foods without guilt and with room for dessert. With more than 140 recipes and dozens of beautiful color photographs, there's something here for everyone. So invite over all those aunts, uncles, cousins, and friends, and treat them to some home cooking, Deen family style.",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Cooking Light Soups & Stews Cookbook",
        "Authors": "By McIntosh, Susan M. (COM)",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1897"
        }
    },
    {
        "Title": "Essential Bowling",
        "Authors": "By Benson, Michael",
        "Description": "An introduction to skills, techniques, strategies, rules and more.",
        "Category": " Sports & Recreation , Bowling",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Easy Dessert Cooking with 5 Ingredients",
        "Authors": "By Wilson, Lia",
        "Description": "",
        "Category": "",
        "Publisher": "Cookbook Resource, LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Ultimate Bicycle Book",
        "Authors": "By Grant, Richard, Ballantine, Richard, and Gatward, Philip (PHT)",
        "Description": "An illustrated guide to cycling offers detailed specifications and action photographs of various types of bicycles on the road, as well as information on bicycle maintenance, cycling accessories, training, sport cycling, and more.",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.91",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Recipes from Central Market",
        "Authors": "By Good, Phyllis Pellman, Stoltzfus, Louise, and Central Market (Lancaster, Pa.) (COR)",
        "Description": "There stands, just off the center square in downtown Lancaster, Pennsylvania, a monument to a food and gardening tradition-Central Market-both a building and an event. The standholders of this timeless farmers market have brought together their signature recipes in this bountiful collection. This new collection of recipes from the standholders of Lancaster, Pennsylvania's beloved Central Market is as lush and full of bounty as the farmers market itself. Set in the center of lively, historic Lancaster, the market offers richly varied produce, breads, and homemade dishes to its loyal shoppers. Here, now, are recipes from these same gardeners, farmers, cooks, and bakers. Ever ready to share their plenty, they have brought together their favorite recipes, using fresh ingredients and tried-and-true techniques. This collection mirrors the market-its traditional foods, rooted deeply in Pennsylvania Dutch soil, and its burgeoning multi-cultural flavor. (A Middle Eastern baker shares an aisle with an Amish vegetable-grower!) Recipes from Central Market has brisk salads and vegetarian main dishes. On neighboring pages are the comforts of favorite pies and jams and stews. All from the oldest, continually operating farmers market in the United States.",
        "Category": " Cooking , Regional & Ethnic , Jewish & Kosher",
        "Publisher": "Good Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The Hellion and the Highlander (Historical Highlands, 3)",
        "Authors": "By Sands, Lynsay",
        "Description": "“You can’t help but fall in love with Lynsay Sands!”—Christina Dodd Once again, New York Times and USA Today bestselling author Lynsay Sands displays another side of her extraordinary talent with The Hellion and the Highlander, a sensuous and wonderfully witty love story set in the breathtaking countryside of Scotland. The tremendously popular author of the Argeneau paranormal vampire romance series, Sands is equally adept at historical romance, as she demonstrates in her third Highland romp, perfect for fans of Julie Garwood, Jill Barnett, and Teresa Medieros—and a delightful companion to her own Devil of the Highlands and Taming the Highland Bride.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Freedom Rising: Washington in the Civil War",
        "Authors": "By Furgurson, Ernest B.",
        "Description": "Freedom Rising is a fresh, intensely human account of how the Civil War transformed the nation’s capital from the debating forum for a loose union of states into the seat of a forceful central government.     Before 1861, Washington was a dusty, muddy city of 60,000, joked about by urban sophisticates from New York and Boston. But at the onset of war, thousands of soldiers, job seekers, nurses, good-time girls, gamblers, newly freed slaves–all kinds of Americans–poured in. For days, Washington was cut off from the North, and no one was sure whether it would become the capital of the Union or the Confederacy.     Ernest Furgurson–author of the widely acclaimed Chancellorsville 1863, Ashes of Glory, and Not War but Murder–tells the story through the men and women who brought the city to rambunctious life. He re-creates historic figures such as William Seward, who fancied himself Abraham Lincoln’s prime minister; poet Walt Whitman, who nursed the wounded; and detective Allan Pinkerton, who tracked down Southern sympathizers; and he introduces intriguing others, such as Mayor James Berret, arrested for disloyalty; architect Thomas Walter, striving to finish the Capitol dome in the middle of war; and accused Confederate spy Antonia Ford, romancing her captor, Union Major Joseph Willard, operator of the capital’s premier hotel.  Here is Mary Lincoln, mourning the death of her son Willie, seeking solace from fakers who conducted séances in the White House. And here is the president–in all his compassion, determination, and complexity–inspiring the nation, wrangling with generals, pardoning deserters, and barely escaping death on the ramparts of Fort Stevens as Jubal Early’s Southern army invades the outskirts of Washington and fights the Union Army within five miles of the White House. For four years, the city was awash in drama and sometimes comedy, until the assassination of Lincoln by John Wilkes Booth became the tragedy of the century.     By the time the grand two-day victory parade of 150,000 troops surged along Pennsylvania Avenue, the men and women who had arrived in such great numbers at the start of the war had made Washington a capital to be reckoned with throughout the world. Freedom Rising is an  invaluable aid to understanding the making of America.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Knopf",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Double Sin, And Other Stories",
        "Authors": "By AGATHA CHRISTIE",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Publ",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Mysterious Affair at Styles",
        "Authors": "By AGATHA CHRISTIE",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "9.52",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Orphans",
        "Authors": "By Andrews, V. C.",
        "Description": "FOUR GIRLS CAUGHT IN THE SHADOWS OF THE PAST... FOUR EXTRAORDINARY NEW YORK TIMES BESTSELLING NOVELS -- TOGETHER FOR THE FIRST TIME.  V.C. ANDREWS®  Orphans  BUTTERFLY...She was a lonely orphan until a wealthy couple gave her a home -- and a chance to be a world-class ballerina. But her newfound happiness was as fragile as a spider's web.  CRYSTAL...Bright and gifted with a flair for science, she found loving new parents, and a boyfriend in her new school. But a shocking tragedy could shatter her perfect world.  BROOKE...Whisked away from the orphanage into a glamorous life, she was surrounded by every privilege a girl could want. But all she really wanted was to be loved -- just as she is.  RAVEN...She put her painful past behind her when she was taken in by her aunt and uncle. But the torment she was about to endure was far worse than anything she had experienced before.",
        "Category": " Fiction , Psychological",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Mummies of Urumchi",
        "Authors": "By Barber, Elizabeth Wayland",
        "Description": "A fascinating exploration of the mysterious, perfectly preserved Caucasian mummies of western China. In the museums of år?mchi, the windswept regional capital of the Uyghur Autonomous Region in Western China-what we know as Chinese Turkestan-a collection of ancient mummies lay at the center of an enormous mystery. Some of år?mchi's mummies date back as far as 4,000 years-contemporary to the famous Egyptian mummies, but even more beautifully preserved, especially their clothing. Surprisingly, these prehistoric people are not Oriental but Caucasian-tall and large-nosed and blond with round eyes (probably blue). Where did they come from? What were these blonds doing in the foothills of the Himalayas? Few gifts are put into the graves of the dead, making it difficult for archaeologists to pinpoint any cultural connections from clues offered by their pottery and tools. But their clothing-woolens that rarely survive more than a few centuries-has been preserved as brightly hued as the day each was made. Elizabeth Wayland Barber describes these remarkable mummies, their clothing, and the world to which they so mysteriously belonged, piecing together their history and peculiar Western connections both from what she saw in år?mchi and from the testimony of those who explored along the Silk Road centuries earlier. The result is an entertaining and informative unveiling of an ancient and exotic world.",
        "Category": " Social Science , Archaeology",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Essentials of Digital Photography",
        "Authors": "By Sparkman, Russell, Kasai, Akira, and Hurley, Elizabeth (TRN)",
        "Description": "A manual and tutorial for traditional photographers stepping into the digital age with Adobe Photoshop. Includes information on calibrating computer monitors, scanning images, color correcting images, setting up a system, inputting and outputting images correctly, restoring old and damaged photographs, creating montages, and other tricks of the trade. Highly illustrated, mostly in color. The CD-ROM contains darkroom utilities, demonstration software, and tutorial files and images. Translated, presumably from a Japanese edition, but no further information is provided. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Photography , Techniques , Equipment",
        "Publisher": "New Riders Pub",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Best of Gourmet, 1998, Featuring the Flavors of India",
        "Authors": "By Gourmet",
        "Description": "The Best of Gourmet, Featuring the Flavors of India offers 26 menus - intimate meals for two, sophisticated cocktail parties, carefree alfresco outings, seasonal harvest dinners, and traditional holiday gatherings. Over 130 photographs set the mood and guide you to picture-perfect dishes.Over 400 of the best recipes that appeared in Gourmet's food columns throughout 1997 are organized here: There are hundreds of quick recipes that can be made in 45 minutes or less; leaner-lighter recipes that help you keep an eye on your waistline; thematic recipes for some of your favorite kinds of foods, like pastas, gumbos, pancakes, and burgers; even a few favorite recipes from Gourmet readers.This year's Cuisines of the World section takes you to India, a colorful land of enticing flavors. Three brand-new menus highlight regional specialties from the North and South and showcase vegetarian dishes from around the country. Full-color photography of the land, her people, and the menus are both intriguing and instructive.Gifts from Your Kitchen, an Addendum filled with 24 more new recipes, follows. Jerk-spiced peanuts, soft pizza pretzels, plum basil vinegar, and chocolate-covered butter toffee are just a sampling of what's in store. You'll find fanciful packaging ideas, helpful cooking hints, and storing instructions throughout.",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Norm Abram's New House/America's Favorite Carpenter and His Wife, Laura, Build Their Dream Home",
        "Authors": "By Abram, Norm, Murphy, John (ILT), and Howard, Richard (PHT)",
        "Description": "Norm Abram's New House is the story of how Norm and Laura built their family home from the ground up. In it, Norm details the process of construction at every stage, from preparing the site to choosing the fixtures to creating a special habitat for their pet parrots. We watch as the house is designed, the foundation is excavated, the cement is poured, the frame is raised, the roof is shingled, and the interior work nears completion. Throughout, Norm explains his building decisions, describes the work he did himself, and shares both personal insights and marvelous anecdotes about his family and the skilled tradesmen who worked alongside him. There are moments of joy, disappointment, delay, and magic. Moving-in day is truly a triumph - the fulfillment of a dream.Illustrated with photographs and drawings, and written in the author's down-to-earth voice, Norm Abram's New House is a unique combination of great storytelling and home-building wisdom - a book for anyone who's ever fantasized about building the perfect home.",
        "Category": " Technology & Engineering , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Last Days of Innocence: America at War, 1917-1918",
        "Authors": "By Harries, Meirion and Harries, Susie",
        "Description": "The Great War was the gateway through which our grandparents passed from the relative innocence of the nineteenth century into our own troubled, uncertain era. Many of the giants of American history fought this war: Wilson, Hoover, Franklin Roosevelt, Truman, Marshall, Patton, MacArthur, and, feeding on fear of the growing communist menace, J. Edgar Hoover. It was a seminal period in the history of the United States and the world. But the American side of the story has remained largely untold, America's contribution to the war maligned or ignored, both at home and in Europe.Nineteen ninety-seven marks the eightieth anniversary of America's entry into the war. This book combines American, British, and French archival material to present a fresh and modern evaluation of America's performance - and the scars the experience of war left behind.",
        "Category": " History , Modern , 20th Century",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Fat-fighting foods",
        "Authors": "By Alleman, Gayle Povis",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Eating in the Raw: A Beginner's Guide to Getting Slimmer, Feeling Healthier, and Looking Younger the Raw-Food Way",
        "Authors": "By Roth, David, Alt, Carol, and Gonzalez, Nicholas J. (FRW)",
        "Description": "Ten years ago, Carol Alt was feeling bad. Really bad. She had chronic headaches, sinusitis, and stomach ailments; she was tired and listless. And then Carol started eating raw—and changed her life.Eating in the Raw begins with her story and then presents practical, how-to information on everything you need to know about the exciting movement that’s been embraced by Demi Moore, Pierce Brosnan, Sting, Edward Norton, and legions of other health-minded people. You’ll learn:•What exactly raw food is—and isn’t—and how to integrate it into your diet•How to avoid the all-or-nothing pitfall: you can eat some cooked foods, you can eat some foods partially cooked, and you don’t have to deprive yourself•Why raw food is not just for vegetarians or vegans—Carol eats meat, and so can you•The differences between cooked and raw vitamins, minerals, and enzymes, and what they mean for you•An ease-in approach to eating raw, and how to eat raw in restaurantsIn addition, Carol answers frequently asked questions and offers forty simple recipes for every meal, from light dishes such as Gazpacho and Lentil Salad to entrees including Tuna Tartare and Spaghetti al Pesto and even desserts like Pumpkin Pie and Apple Tart with Crème Anglaise—rounding out a thorough, accessible, and eminently compelling case why in the raw is the best way to eat.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Patrick Lose's Whimsical Sweatshirts",
        "Authors": "By Lose, Patrick",
        "Description": "",
        "Category": " Crafts & Hobbies , Fashion",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Good Fats and Oils (Natural Health Guide) (Alive Natural Health Guides)",
        "Authors": "By Erasmus, Udo",
        "Description": "Good fats are not only healthful they actually help to control fat metabolism in the body. In other words, good fats can help keep you from getting fat! Better yet the knowledge of which fats are good and which aren't can help you achieve and maintain health. Author, publisher and health-lecturer Siegfried Gursche provides easy-to-understand, specific, need-to-know information about fats and oils. Outlined are safe ways to use this information along with tasty, healthful recipes and suggestions. Full color.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Alive Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Grandma's Classic Recipes",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The All New Complete Cooking Light Cookboook: The Ultimate Guide from America's #1 Food Magazine (Cookbook)",
        "Authors": "By Cain, Anne C. (EDT)",
        "Description": "This is the biggest, most complete cookbook in Cooking Light history! Every appetizer, side, entrée and dessert is guaranteed to be the most temptingly delicious, decadent food you’ve ever tasted…yet they’re all light and healthy. If you have only one light cookbook in your collection, this is the one you need to help you cook and eat smart. You'll find:* Over 1,000 Top-Rated, Kitchen-Tested Recipes These are the recipes our staff returns to over and over—the ones we (and our readers) consider the “essential” light recipes.* Over 500 Color Photographs Mouthwatering photos will inspire you to make the recipe, and technique photos will guide you through the process.* Classic Makeovers—We show you how to lighten favorite recipes without losing flavor, and before and after numbers reveal the difference.* Test Kitchen Tips—From mastering perfectly-risen fluffy biscuits to grilling a flawless, juicy steak every time—these and many more secrets to cooking success come straight from our kitchens to yours.* Step-by-Step Techniques—Whether you’re an experienced cook or a novice, our how-to instructions and color photos take the guesswork out of preparing light-as-air layer cakes, making creamy béchamel sauce, and more.  In addition to over 1,000 fabulous recipes, you’ll also get: * 5 Keys to Healthy Cooking* Nutrient analysis for every recipe* 50 menus, including our Top 10 Quick & Easy menus and menu-planning secrets * Prep and cook times for every recipe * Quick & Easy, Make Ahead, and Freezable recipes identified in Index * Entertaining Guide and tips for table settings * The ultimate Pantry Checklist * Wine tips * Glossary and substitution lists",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "7.61",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Throw Out Fifty Things: Clear the Clutter, Find Your Life",
        "Authors": "By Blanke, Gail",
        "Description": "\"A perfect guide to getting the non-essentials out of the way, so that simple joys can make their way into our lives.\" - Marianne Williamson, author of A Return to Love\"If you want to grow, you gotta let go,\" is the mantra that bestselling author, columnist, and life coach Gail Blanke lives by. That means eliminating all the clutter - physical and emotional - that holds you back, weighs you down, or just makes you feel bad about yourself.In THROW OUT FIFTY THINGS she takes us through each room of the house - from the attic to the garage - and even to the far reaches of our minds.  Through poignant and humorous stories, she inspires us to get rid of the \"life plaque\" we've allowed to build-up there.    That junk drawer (you know that drawer) in the kitchen? Empty it!   Those old regrets? Throw 'em out!   That make-up from your \"old\" look? Toss it!   That relationship that depresses you? Dump it!  Once you've hit fifty (you'll be surprised how easy it is to get there) and once you've thrown out that too-tight belt and too-small view of yourself, you'll be ready to step out into the clearing and into the next, and greatest, segment of your life.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Grand Central Life & Style",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Scientific American: How Things Work Today",
        "Authors": "By Wright, Michael (EDT) and Patel, Mukul N. (EDT)",
        "Description": "An authoritative collection of articles and essays from Scientific American's \"Working Knowledge\" column explains the inner workings of such technological wonders as subways, electron microscopes, Velcro, spy satellites, and the artificial heart, all divided into categories including the home, the office, transportation, communication, and more. 25,000 first printing.",
        "Category": " Science , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Raw Gourmet",
        "Authors": "By Shannon, Nomi",
        "Description": "",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Books Alive",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Staying Safe: The Complete Guide to Protecting Yourself, Your Family, and Your Business",
        "Authors": "By Aviv, Juval",
        "Description": "In Staying Safe, Juval Aviv, a counterterrorism expert and international security consultant, outlines the essential tools for becoming personally responsible for the security and safety of yourself and your loved ones. You will learn how to safeguard your home and office, protect your identity, and travel without fear. Most important, you'll find that Aviv's recommendations and warnings are practical and easy to follow.Juval Aviv neither overstates nor minimizes today's threats, whether they are from criminals or terrorists; instead he sets out to inform and provide real advice for minimizing risks.Staying Safe is clear, comprehensive, and full of instructive and vital tips that cover:Flying with confidenceTraveling to a foreign countryIdentifying a potential terrorist threatBasic safety precautionsSurvival and escape strategiesSecuring your businessKeeping your identity confidentialMaking transactions on the InternetAnd much more",
        "Category": " Reference , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    }
]