[
    {
        "Title": "Lean and Luscious and Meatless, Volume 3",
        "Authors": "By Hinman, Bobbie, Snyder, Millie, and Crist, Vonnie (ILT)",
        "Description": "Provides over 350 recipes for meatless dishes, including zucchini relish, falafel, eggless \"egg\" salad, lentil-nut loaf, tofu-spinach lasagne, and pineapple upside-down sweet potatoes",
        "Category": " Cooking , Reference",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Curious Eat Themselves",
        "Authors": "By Straley, John",
        "Description": "\"No on really hires me to find the truth,\" says Cecil Younger \"They hire me to imagine their innocence.\" Like his hero, author John Straley works as an investigator for the public defender in Alaska. His previous Cecil Younger mystery was a club selection and a bestseller in the Northwestern United States.In this, his second Alaskan mystery, a woman hires him to investigate a sexual assault that she insists took place at an isolated mining site where she worked as a cook. It might have remained a straightforward case of assault if she had not also been probing the environmental safeguards of the gold-mining operation and if, subsequently, she had not been found dead in the estuarial waters of Ketchikan township, Alaska.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Soho Pr Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "BREAKING THE NEWS: How the Media Undermine American Democracy",
        "Authors": "By Fallows, James",
        "Description": "Polls show that Americans from every political, racial, and economic group in the country are mad at the media, but members of the press claim this simply proves that they are doing their job: reporting the news without fear or favor. As James Fallows demonstrates in this razor-sharp indictment, not only is the press not doing \"the job,\" it is actually getting in the way of Americans doing their jobs as citizens.Fallows details the ways in which the current style of news coverage engenders a sense of futility in the American public with regard to its ability to influence our society. Drawing on his own richly varied experience as a reporter and on scores of interviews with members of the print and broadcast media, he reveals how the reigning destructive practices evolved, and whose interests they serve.Outside the urban centers of media power, Fallows finds a new public-spirited approach to news coverage that is gathering passionate adherents while meeting fierce resistance from the media old guard. Breaking the News will ignite the increasingly heated debate over the role of the American media.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Learn Faster & Remember More: The Developing Brain, the Maturing Years and the Experienced Mind",
        "Authors": "By Bragdon, Allen D. and Gamon, David",
        "Description": "",
        "Category": " Self-help , Personal Growth , Memory Improvement",
        "Publisher": "Brainwaves Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Master of Disguise: My Secret Life in the CIA",
        "Authors": "By McConnell, Malcolm and Mendez, Antonio J.",
        "Description": "From the author of Argo comes an unforgettable behind-the-scenes story of espionage in action. In the first ever memoir by a top-level operative to be authorized by the CIA, Antonio J. Mendez reveals the cunning tricks and insights that helped save hundreds from deadly situations.Adept at creating new identities for anyone, anywhere, Mendez was involved in operations all over the world, from “Wild West” adventures in East Asia to Cold War intrigue in Moscow. In 1980, he orchestrated the escape of six Americans from a hostage situation in revolutionary Tehran, Iran. This extraordinary operation inspired the movie Argo, directed by and starring Ben Affleck.The Master of Disguise gives us a privileged look at what really happens at the highest levels of international espionage: in the field, undercover, and behind closed doors.",
        "Category": " Political Science , Intelligence & Espionage",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Foster Mary",
        "Authors": "By Strang, Celia",
        "Description": "Part of the shifting migrant farm-worker community, Foster Mary courageously struggles to raise her three children and to realize her dreams of a better life for all of them",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Carson-Dellosa Pub Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "The Dragon Chronicles",
        "Authors": "By Saunders, Malcolm",
        "Description": "This recently discovered journal will prove irresistible to any devotee of historical fantasy. It’s a carefully executed reproduction of the illustrated diary kept by the Great Wizard, Septimus Agorius, detailing his incredible attempts to hunt down and slay four malevolent dragons in accordance with the wishes of his dying king. Beautifully drawn, with amazing illustrations executed by some of the world’s leading fantasy illustrators, The Dragon Chronicles features a unique laminate cover with distressed artwork and gold foil lettering, adding to this journal’s unique, evocative appeal.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Top Heavy: The Increasing Inequality of Wealth in America and What Can Be Done About It",
        "Authors": "By Wolff, Edward N.",
        "Description": "Hailed in the Boston Review as \"the leading contemporary study of the distribution of wealth in the United States and the recent explosion in wealth inequality,\" Top Heavy provides the clearest picture available of the growing gap between rich and poor in America, and a compelling proposal to help correct it.",
        "Category": "",
        "Publisher": "New Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Glucose Revolution Pocket Guide to Losing Weight",
        "Authors": "By Wolever, Thomas M. S., Colagiuri, Stephen, and Foster-Powell, Kaye",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Complete Aspects of Love",
        "Authors": "By Ganzl, Kurt",
        "Description": "Offers a glimpse of all the facets of production of the hit musical of romance and intrigue in the south of France, and includes the libretto",
        "Category": " Music , General",
        "Publisher": "Studio",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Walk Yourself Well: Eliminate Back, Neck, Shoulder, Knee, Hip, and Other Structural Pain Forever - Without Surgury or Drugs",
        "Authors": "By Rodman, Randy and Brourman, Sherry",
        "Description": "A registered physical therapist to the stars and a columnist for Glamour magazine shows readers how to eliminate and prevent skeletal and muscular pain through corrective walking techniques and basic exercises in a fully illustrated instructional guide.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Record of the Paper: How the New York Times Misreports US Foreign Policy",
        "Authors": "By Falk, Richard A. and Friel, Howard",
        "Description": "When the New York Times finally apologized for its coverage of Iraq’s weapons of mass destruction in 2004, it was too late. The newspaper had already supported the invasion. The Bush administration was not only violating international law, it was lying to the public, using major media like the Times to spread its message.In this meticulously researched study—the first part of a two-volume work—Howard Friel and Richard Falk demonstrate how the newspaper of record in the United States has consistently, over the last 50 years, misreported the facts related to the wars waged by the United States. From Vietnam in the 1960s to Nicaragua in the 1980s and Iraq today, the authors accuse the New York Times of serial distortions. They claim that such coverage now threatens not only world legal order but constitutional democracy in the United States.Falk and Friel show, for example, that, despite numerous US threats to invade Iraq, and despite the fact that an invasion of one country by another implicates fundamental aspects of the UN Charter and international law, the New York Times editorial page never mentioned the words “UN Charter” or “international law” in any of its 70 editorials on Iraq from September 11, 2001, to March 20, 2003. The authors also show that the editorial page supported the Bush administration’s WMD claims against Iraq, and that its magazine, op-ed and news pages performed just as poorly.In conclusion the authors suggest an alternative editorial policy of “strict scrutiny” that incorporates the UN Charter and the US Constitution in the Times coverage of the use and threat of force by the United States and the protection of civil and human rights at home and abroad.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Verso",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Love Is the Killer App: How to Win Business and Influence Friends",
        "Authors": "By Sanders, Tim",
        "Description": "Argues that the key to business success is to use one's knowledge, network, and compassion to support colleagues and encourage their growth, offering tips on using books to learn as much as possible, developing a meaningful network of contacts, and becoming a more loving, compassionate, and fulfilled individual. 75,000 first printing.",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Probability: An Introduction",
        "Authors": "By Goldberg, Samuel",
        "Description": "Excellent basic text covers set theory, probability theory for finite sample spaces, binomial theorem, probability distributions, means, standard deviations, probability function of binomial distribution, and other key concepts and methods essential to a thorough understanding of probability. Designed for use by math or statistics departments offering a first course in probability. 360 illustrative problems with answers for half. Only high school algebra needed. Chapter bibliographies.",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Writing Arguments: A Rhetoric With Readings",
        "Authors": "By Ramage, John D. and Bean, John C.",
        "Description": "",
        "Category": " Language Arts & Disciplines , Rhetoric",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "On the Hill : A History of the American Congress from 1789 to the Present",
        "Authors": "By Alvin M. Josephy",
        "Description": "",
        "Category": "",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "6.07",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Memoirs of a Geisha: A Novel",
        "Authors": "By Golden, Arthur",
        "Description": "A literary sensation and runaway bestseller, this brilliant debut novel tells with  seamless authenticity and exquisite lyricism the true confessions of one of Japan's  most celebrated geisha.Nominated as one of America’s best-loved novels by PBS’s The Great American Read Speaking to us with the wisdom of age and in a voice at  once haunting and startlingly immediate, Nitta Sayuri tells the story of her life  as a geisha.  It begins  in a poor fishing village in 1929, when, as a nine-year-old   girl with unusual blue-gray eyes, she is taken from her home and sold into slavery  to a renowned geisha house.  We witness her  transformation as she learns the rigorous  arts of the geisha: dance and music; wearing kimono, elaborate makeup, and hair;  pouring sake to reveal just a touch of inner wrist; competing with a jealous rival  for men's solicitude and the money that goes with it.   In Memoirs of a Geisha,  we enter a world where appearances are paramount; where a girl's virginity is auctioned  to the highest bidder; where women are trained to beguile the most powerful men;  and where love is scorned as illusion.  It is a  unique and triumphant work of fiction—at  once romantic, erotic, suspenseful—and completely unforgettable.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Quotable Feline",
        "Authors": "By Dratfield, Jim (EDT) and Coughlin, Paul (EDT)",
        "Description": "For fans of felines and connoisseurs of photography: exquisite portraits of cats young and old, serene and manic, affectionate and aloof. Each is accompanied by an apt quotation drawn from a variety of the most articulate celebrators of the cat, from T. S. Eliot to Colette, Leonardo da Vinci to Jim Davis (of \"Garfield\" fame).A cat alone by the telephone (\"Dogs come when they're called. Cats take a message and get back to you\"), a cat eyeing a goldfish, a cat returning the love of a person, an intrepid explorer kitten - image after image of cats dignified, playful, mischievous, and loving.This book of endearing (and enduring) portraits displays the special grace and intuition that Jim Dratfield and Paul Coughlin bring to the photography of animals. Through the alternately witty and elegant compositions and the other-worldly beauty lent by the sepia prints, these photographs eloquently express the independent and mysterious essence of Cat.",
        "Category": " Technology & Engineering , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Oxford Book of Royal Anecdotes",
        "Authors": "By Longford, Elizabeth Harman Pakenham, Countess of (EDT)",
        "Description": "Here is a sparkling collection of Crown jewels--from amusing tales that humanize their subjects to dramatic stories of martyrdoms, palace intrigues, and bloody battles.  Elizabeth Longford, intimate of the royal family and biographer of Victoria and Elizabeth II, has assembled the best anecdotes ever written and reported abut the kings and queens of England, across the full range of Britain's history from the first century A.D. to the present day.     Scholars and versifiers, lawgivers and saints crowd the pages alongside soldiers, scallywags, and imbeciles, and never have these distant figures been brought more vividly to life than in this splendid anthology.  We read of Alfred's burnt cakes, Cnut and the wolves, Henry VIII and his six wives, George III resigning himself to American independence, Edward VII's gambling habits, and much more.  There are samplings of royal wit (as when James I said of John Donne's poetry:  Dr Donne's verses are like the peace of God; they pass all understanding.\"), of royal modesty (as in Elizabeth II's explanation of why she wore no crown at the musician Robert Mayer's 100th birthday party:  \"I thought it was Sir Robert's night, not mine.\"), and of royal certitude (as in Victoria's comment during a dark moment of the Boer War: \"Please understand that there is no one depressed this house; we are not interested in the possibilities of defeat; they do not exist.\")     The Countess of Longford's helpful commentary clarifies the complexities of royal genealogy and adds a sharp and often humorous perspective to bygone events. Her sources range from the earliest medieval chroniclers to biographers and historians of today, from dispassionate descriptions to intimate and revealing accounts from the letters and journals of the monarchs themselves.  The result is truly a historical feast fit for a king.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Applied Software Measurement: Assuring Productivity and Quality (Software Engineering Series)",
        "Authors": "By Jones, Capers",
        "Description": "Focuses on ways to measure software quality and offers a battery of scientific tools for improving the scheduling, costs, and quality of software projects. Examines the use of function points for large-scale statistical analyses, featuring detailed information on the major variations in functional metrics, such as DeMarco \"bang\" metrics, feature points, and the British Mark II function point method. No bibliography. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , General",
        "Publisher": "Mcgraw-Hill (Tx)",
        "Price Starting With ($)": "6.8",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Services Trade in the Western Hemisphere: Liberalization, Integration, and Reform",
        "Authors": "By Stephenson, Sherry (EDT)",
        "Description": "The services sector?including financial services, telecommunications, transportation, tourism, and professional services?has become critical to the continued economic dynamism in the Americas. And the quality and competitiveness of this sector are essential to economic growth and development. On average, services?increasingly traded in more numerous and far-reaching ways than goods?account for nearly two-thirds of the gross domestic product of the Western Hemisphere. The importance of the sector, however, is disproportionately large in Central America and the Caribbean, where it often is the major source of employment and of foreign exchange.This timely volume is the first to review and analyze trade agreements covering the services sector in the Western Hemisphere and their relationship to the General Agreement on Trade in Services (GATS), in force since 1995 as an integral part of the World Trade Organization (WTO). Negotiations on liberalizing services trade are continuing at the multilateral, the regional or hemispheric, and the subregional levels. It is imperative to understand what is being discussed and implemented at these different levels and to articulate the linkages and relationships among the various agreements and the disciplines and obligations they contain. Services Trade in the Western Hemisphere informs the reader about these issues and more. Part 1 deals with the main issues relevant to the liberalization of services trade at the multilateral and regional levels, including improvements to the GATS architecture, the scope of regulatory reform, the relationship between the treatment of services and investment, WTO requirements that must be fulfilled by parties to an economic integration agreement, and disagreements brought to the multilateral dispute settlement process. Part 2 examines the scope, content, and liberalizing approach of subregional agreements in the Western Hemisphere, such as the North American Free Trade Agreement and those promulgated by the Andean Community, as well as several bilateral free trade agreements covering services, in particular those signed by Mexico, Chile, and Central America. Part 3 evaluates the extent of liberalization of services trade achieved to date at the multilateral and subregional levels and discusses options for improvements in the context of the ongoing Free Trade Area of the Americas negotiations.",
        "Category": " Business & Economics , International , General",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Mind-Body Interactions and Disease and Psychoneuroimmunological Aspects of Health and Disease",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Health Dateline Press. 1998.",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Art: A History Of Painting, Sculpture, Architecture: Volume II, Renaissance, Baroque, Modern World",
        "Authors": "By Frederick Hartt",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Schroeder's game",
        "Authors": "By Maling, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Master and Commander (Book 1)",
        "Authors": "By O'Brian, Patrick",
        "Description": "This, the first in the splendid series of Jack Aubrey novels, establishes the friendship between Captain Aubrey, R.N., and Stephen Maturin, ship's surgeon and intelligence agent, against a thrilling backdrop of the Napoleonic wars. Details of a life aboard a man-of-war in Nelson's navy are faultlessly rendered: the conversational idiom of the officers in the ward room and the men on the lower deck, the food, the floggings, the mysteries of the wind and the rigging, and the roar of broadsides as the great ships close in battle.",
        "Category": " Fiction , Historical , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Easeful Death",
        "Authors": "By McInerny, Ralph M.",
        "Description": "A poet and teacher, Howard Webster, feigns death and moves to Italy where he reads a magazine article lauding his work and returns home to enjoy the \"posthumous\" fame",
        "Category": " Fiction , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "No soft options: The politico-military realities of NATO",
        "Authors": "By Hill-Norton, Peter Hill-Norton",
        "Description": "",
        "Category": "",
        "Publisher": "McGill-Queen's University Press",
        "Price Starting With ($)": "10.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Bone Vault: A Novel",
        "Authors": "By Fairstein, Linda A.",
        "Description": "The New York Times bestselling author and renowned former Manhattan prosecutor follows her Nero Award-winning The Deadhouse with a mesmerizing new Alexandra Cooper novel set at the crossroads of big money, high culture, and murder...  The Bone Vault begins in the Metropolitan Museum of Art's glorious Temple of Dendur, where wealthy donors have gathered to celebrate a controversial new exhibit.  An uneasy mix of scholarship, showbiz, and aggressive marketing, \"A Modern Bestiary\" will be a joint venture of the Met and the American Museum of Natural History. With its IMAX time trips and Rembrandt refrigerator magnets, the \"Bestiary\" has raised fierce opposition from some of New York's museum elite.  Assistant DA Alexandra Cooper, off duty for the evening, observes the developing tensions with bemused interest until Met director Pierre Thibodaux pulls her aside. He needs her advice. There's an urgent problem out at a loading dock on a New Jersey pier.  A Twelfth Dynasty mummified princess, enclosed for eternity in a huge stone sarcophagus, is about to take a long voyage to Cairo as part of a routine museum exchange. But Cleopatra is missing, and in her place is the not-so-mummified body of a woman many centuries younger than her royal predecessor.  Who is this woman with the small physique, the dark hair, and the shiny barrette? What is her connection, if any, to the rarefied world of priceless art and objects? And how and when did she become entombed in the sarcophagus?  Teaming with cops Mike Chapman and Mercer Wallace, Alex must explore behind the scenes at the elegant but severe Metropolitan, travel uptown to the remote setting of the Cloisters and its medieval trove of funerary art, and on to the massive array of beasts and bones at the Museum of Natural History. Somewhere deep within the bowels of one of these great cultural centers, a killer may wait.  Atmospheric, chilling, and rich with the kind of procedural authenticity that only Linda Fairstein can provide, The Bone Vault is a page-turning tour de force from one of crime writing's brightest stars.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Successor States to the USSR",
        "Authors": "By Blaney, John W. (EDT)",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Cq Pr",
        "Price Starting With ($)": "15.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "American Folk Masters: The National Heritage Fellows",
        "Authors": "By Siporin, Steve",
        "Description": "American Folk Masters celebrates the lives and work of nearly 150 National Heritage Fellows, named since 1982 as exemplary practitioners of traditional folk arts. Sometimes likened to Japan's Living National Treasures, the Fellows are selected each year by the Folk Arts Program of the National Endowment for the Arts for their achievements in a wide variety of visual and performing folk arts.The National Heritage Fellows come from Maine and Hawaii, from Alaska and Puerto Rico, and from most states in between. A random roll call of even a few of their names - Duff Severe, Periklis Halkias, Canray Fontenot, Alice New Holy Blue Legs - reflects America's rich ethnic diversity. And the same diversity characterizes the arts the Fellows practice, which range from blues music, pottery, tap dancing, and lace making to Lakota quillwork, Sicilian marionette theater, African-American story-telling, and Hawaiian quiltmaking.Published on the tenth anniversary of the National Heritage Fellowships, this volume was inspired by an exhibition organized by the Museum of International Folk Art in Santa Fe. Its fifty full-page color photographs show the compelling, beautifully crafted objects made by the visual artists among the Fellows, while its black-and-white portraits and personal quotations capture the fascinating backgrounds and personalities of these people.Steve Siporin, folklorist and Associate Professor at Utah State University, has written a lively yet thoughtful essay that considers the Fellows as inheritors, innovators, and conservers of tradition. There are contributions by Bess Lomax Hawes, Director of the Folk Arts Program of the National Endowment for the Arts (1977-92), and Barre Toelken, Professor of Folklore at Utah State University. A comprehensive illustrated Directory of all the Fellows from the last ten years includes an invaluable bibliography, discography, and filmography.The first full-length study of a groundbreaking program, American Folk Masters has much to offer anyone who values our national heritage. Whether descendants of the original Native peoples or members of the newest immigrant group, we can all learn from these consummate artists who are keeping our folk traditions alive today.",
        "Category": "",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "CATLORE",
        "Authors": "By Morris, Desmond",
        "Description": "Desmond Morris considers the cat in myth and history, and answers questions he received from cat owners after the publication of the internationally best-sellingCatwatching.",
        "Category": " Technology & Engineering , General",
        "Publisher": "Crown Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The Resume Catalog: 200 Damn Good Examples",
        "Authors": "By Parker, Yana",
        "Description": "With over 180,000 copies in print, this is the resume resource for job seekers by Yana Parker, widely known and loved author of the best selling DAMN GOOD RESUME GUIDE (over 500,000 copies in print). Sample resumes-ready to be adapted and/or used for inspiration-cover all levels of experience and an extraordinarily wide range of careers, from the specific (biofeedback specialist, gas chromatography) to the general (fast-food cashier, masseur). Thoroughly indexed and cross-referenced, this is an easily used, dependable resource for anyone who needs to get that resume to the top of the pile and get the job of their dreams.",
        "Category": " Business & Economics , Careers , Resumes",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The United States of Ambition: Politicians, Power, and the Pursuit of Office",
        "Authors": "By Ehrenhalt, Alan",
        "Description": "A look at the conduct of those individuals who choose to run for office in America discusses why America's politicians are continually disappointing. Reprint.",
        "Category": "",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Post-Capitalist Society",
        "Authors": "By Drucker, Peter Ferdinand",
        "Description": "Business guru Peter Drucker provides an incisive analysis of the major world transformation taking place, from the Age of Capitalism to the Knowledge Society, and examines the radical affects it will have on society, politics, and business now and in the coming years. This searching and incisive analysis of the major world transformation now taking place shows how it will affect society,economics, business, and politics and explains how we are movingfrom a society based on capital, land, and labor to a society whoseprimary source is knowIedge and whose key structure is theorganization.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "God and the New Physics",
        "Authors": "By Davies Paul",
        "Description": "How did the universe begin and how will it end? What is matter? What is mind, and can it survive death? What are time and space, and how do they relate to ideas about God? Is the order of the universe the result of accident or design?  The most profound and age-old questions of existence -- for centuries the focus of religion and philosophy -- may soon be answered through the extraordinary advances of a field of science known as the new physics. In this illuminating work, Paul Davies, author of the acclaimed Other Worlds and The Edge of Infinity, writes that the discoveries of 20th-century physics -- relativity and the quantum theory -- are now pointing the way to a new appreciation of man and his place in the universe. They could, in fact, bring within our grasp a unified description of all creation. Demanding a radical reformulation of the most fundamental aspects of reality and a way of thinking that is in closer accord with mysticism than materialism, the new physics, says Davies, offers a surer path to God than religion.  Described by The Washington Post as \"impressive,\" God and the New Physics is a fascinating look at the impact of science on what were formerly religious issues. Elegantly written, a book for both scholars and lay readers of science, it is, according to the Christian Science Monitor, a \"provocative...rewarding intellectual romp.\"",
        "Category": " Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Lick the Sugar Habit: Sugar Addiction Upsets Your Whole Body Chemistry",
        "Authors": "By Appleton, Nancy, Ph.D.",
        "Description": "Are you a sugarholic? As Americans, we consume on average 150 pounds of sugar a year, and that’s as bad for you as it sounds. Sugar upsets body chemistry and devastates the endocrine and immune systems, leading to a host of diseases and conditions including hypoglycemia, diabetes, osteoporosis, arthritis, cancer, heart disease, headaches, allergies, asthma, obesity, periodontal disease, tooth decay, and more. A sugarholic since childhood, Dr. Nancy Appleton cured herself of chronic illnesses by changing her diet. In Lick the Sugar Habit, she explains how it worked for her, and how it can help you too through a variety of simple techniques, and mouth-watering, healthful recipes. Are you a sugarholic? Answer the questionnaire to find outTest yourself for food allergies caused by sugarEnd sugar-related calcium loss, heartburn, and indigestion—without drugs!Follow one of three detailed food plans to east yourself into a low-sugar lifeThrough a variety of simple techniques, learn how to banish sugar cravingsSavor healthy, hearty dishes like Hot Asparagus Soup, Persian Lamb and Bean Stew, and Savory Pepper Pilaf. Choose from an entire chapter of easy-to-prepare recipes",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The road to Khartoum: A life of General Charles Gordon",
        "Authors": "By Chenevix Trench, Charles Pocklington",
        "Description": "",
        "Category": "",
        "Publisher": "Norton",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Gates of Damascus",
        "Authors": "By Garrett, Sam (TRN) and Joris, Lieve",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Women: From the Greeks to the French Revolution",
        "Authors": "By Bell, Susan Groag",
        "Description": "",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Stanford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "The Dalai Lamas of Tibet",
        "Authors": "By Thubten Samphel-Tendar",
        "Description": "",
        "Category": "",
        "Publisher": "Roli Books Pvt Ltd",
        "Price Starting With ($)": "5.01",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "A New View from the Castle",
        "Authors": "By Smithsonian Institution (COR), Park, Edwards, and Carlhian, Jean Paul",
        "Description": "Describes the development of the new museum buildings for the Smithsonian in Washington, D.C. and explains how the buildings were designed to harmonize with its Victorian neighbors",
        "Category": " Architecture , General",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Hard Questions For Adult Children and Their Aging Parents",
        "Authors": "By Piver, Susan",
        "Description": "New York Times bestselling author Susan Piver brings her wisdom and insight to the millions of readers who must confront the process of caring for elderly parents. Witnessing the declining health of a parent, and the inevitable thoughts of mortality that accompany the process, can take a heavy emotional and physical toll?particularly if parents and children find it awkward to communicate their fears and needs to one another. To remove the boundaries and enhance these necessary dialogues, Susan Piver applies her thought-provoking question-and-answer format to The Hard Questions for Adult Children and Their Aging Parents. With 100 questions on topics ranging from the practical to the emotional, Susan makes it possible to have candid, comforting conversations that will have lasting benefits. The book is divided into categories, including questions for siblings only and for parents only, followed by specific questions regarding finances, health care, legalities and paperwork, housing, relationships, personal history, and spirituality?all designed to facilitate this delicate process and give all members of the family time for contemplation.",
        "Category": " Self-help , General",
        "Publisher": "Gotham",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Cultural Connections: Museums and Libraries of the Delaware Valley",
        "Authors": "By Vogel, Morris J.",
        "Description": "",
        "Category": " Art , American , General",
        "Publisher": "Temple University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Children's Literature in the Reading Program",
        "Authors": "By Cullinan, Bernice E. (EDT)",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Intl Literacy Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Baker Street Puzzles",
        "Authors": "By Bullimore, Tom",
        "Description": "Join Sherlock Holmes and Doctor Watson in solving problems, dilemmas, and mysteries they encounter while trying to apprehend the infamous Professor Moriarty and other fiendish felons. Plots are uncovered, murderers revealed, liars unmasked, and goods recovered through the completion of delightfully illustrated logic puzzles, codes, anagrams, number puzzles, and whodunits.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Subway Series Reader: Mets - Yankees 2000",
        "Authors": "By Hamill, Pete (EDT)",
        "Description": "A Tale of One City  It was the best of times, it was the best of times; it was a season of pinstripes, it was a season of amazin'; it was the autumn of Sinatra, it was the autumn of Baha Men; it was a time of the 7 train, it was a time of the 4 and the D. In short, the period was so like other glorious times that it inspired chanting in the streets, division in the taverns, and a giddy nostalgia in the hearts of all who watched and cheered.  The 2000 World Series pitted the New York Yankees and their winning tradition against the New York Mets and their history of miracles. These two outstanding teams breathed new life into the words that characterized the city's halcyon hardball past: subway series. Older generations followed the action with one eye on the games of today while the other viewed black-and-white film of the past: Derek Jeter strokes a home run, and Hank Bauer rounds the bases; Al Leiter rocks back, and Johnny Podres delivers the pitch. New generations experienced thrills they'll tell their own grandchildren one day: \"Yes, I saw Mariano Rivera pitch....\" \"I was sitting right there when Todd Zeile's drive hit the top of the wall....\"  To celebrate the return of New York to the center of the baseball universe, Pete Hamill, legendary columnist, editor, and author of Snow in August and A Drinking Life: A Memoir, has assembled an all-star team of writers to create the ultimate thinking fan's keepsake of the subway series. The Subway Series Reader spans the generations of baseball in New York, from Lawrence Ritter's recollection of attending his first World Series game in the subway series of 1936 to Peter Knobler's reflection on bringing his son to the Series in 2000. With contributors running the gamut from Frank McCourt to Yogi Berra, The Subway Series Reader contains all of the best of what made the millennium World Series one for the ages. When it comes to World Series teams and the city that loves them, The Subway Series Reader -- thoughtful, nostalgic, graceful, charming, exciting, and up-to-the-minute -- is the one book to have when you're having more than one.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Taking Heat: The President, the Press, and My Years in the White House",
        "Authors": "By Fleischer, Ari",
        "Description": "The early years of the twenty-first century were a tumultuous time in America. The country faced a hotly contested presidential election, the largest terrorist attack in the nation's history, and the early stages of war. Through it all, President George W. Bush surrounded himself with a handful of close advisers. During this time the man beside the President was Ari Fleischer, his press secretary and one of his most trusted confidants. In this role, Fleisher was present for every decision and became an eyewitness to history.In this riveting account, Fleischer goes behind the scenes as he recalls his experiences in the West Wing. Through the ups and downs of this time, he took the heat, fielded the questions, and brought the President's message into living rooms around the world.In Taking Heat, Fleischer, for the first time, gives his perspective on:The 2000 election, from the recounts to the transition to powerSeptember 11, 2001, its aftermath, and the anthrax scareThe pressure-filled buildup to the war in Iraq and the President's thoughts as the war beganLife in the White House, from learning to adjust to the pace of the West Wing and his early briefings to his relationship with the pressThe White House press corps, who they are, and how they report the newsThe factors that led to his decision to leave Washington behind.This is the story of the men and women of the White House press corps and the cornerstones of democracy: freedom of speech and the freedom of the press. Fleischer presents an in-depth, insider's view on the Washington political arena from a perspective few have seen.Fleischer writes of his belief that the press has a bias in Washington. It's not a question of partisanship or press-driven ideology. Instead, it's a focus on conflict, particularly if it's a conflict they can attach to the President. It's the nature of the White House press corps, regardless of who's in power. The members of the White House press corps are masters at being devil's advocate, able to take with passion the opposite side of whatever issue the President supports. Fleischer's job was to calmly field their questions, no matter how pointed.Taking Heat is an introspective exploration of the top political events in the first half of the Bush administration, as well as the candid observations of a professional who stood in the bright lights of the world stage.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The American Presidency, 1945-2000: Illusions of Grandeur",
        "Authors": "By Bennett, G. H.",
        "Description": "This volume explores the radical changes in the historical role of the president since 1945, with an opening chapter looking at the evolving nature of the office from the 18th to the 20th century. The central argument is that after 1945, as the issue of national security became the dominant theme of American politics, the power of the presidency increased enormously. The outbreak of the Cold War and the passing of the National Security Act in 1947, setting up the CIA, gave the president unparalleled powers. Presidents could now exercise power in the name of, but not always with the consent of, the American people. The paranoia of successive presidents is another theme of the book, from Truman's and Kennedy's fear of Communism, through to Johnson's and Nixon's fears of political intrigues and rivals. Watergate and its impact on presidential power through Ford and Carter is fully explored, as is the reassertion of strong presidential leadership through a dynamic foreign policy under Reagan and Bush. The crisis of the presidency, with the American people groping backwards to the notion of a caretaker president who does nothing wrong, rather than an activist president, forms the final section. As chief executive of the only remaining superpower, the US president occupies a unique political space. Giving equal weight to domestic and foreign concerns, Harry Bennett offers an account of this key area of contemporary political history.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "The History Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Wreaths 'Round the Year",
        "Authors": "By Cusick, Dawn and Pulleyn, Rob",
        "Description": "",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "The Rainy Day Book: Pick Me Up! Book (Pick Me Up! Books)",
        "Authors": "By Mark Gilroy Communications",
        "Description": "The message of The Rainy Day Book is that when it rains, you can still walk-and even dance-through life with a smile on your face . . .God hasn't promised a trouble-free life without storms and challenges. But He has promised to provide the grace and strength to live life with a smile on your face and a bounce in your steps.The fun, whimsical, heartfelt, and sometimes poignant collection of writings fromThe Rainy Day Book will lift spirits and brighten the heart of anyone who is feeling blue-or just needs an extra helping of happiness to face their day.The Rainy Day Book is filled with heartwarming stories from people who have experienced life's challenges with faith and optimism; fun and creative ideas on lifting yourself out of the doldrums; inspirational poems, quotes, and verses; and a few powerful glimpses into God's Word to discover the spiritual resources available to let your heart dance even when it rains.Whether a person's day is gray and overcast with just a few sprinkles in the air or it is pouring cats and dogs in their life right now, this book is a great reminder that storms pass-but God's love is forever!",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "My Dog Tulip",
        "Authors": "By Ackerley, J. R",
        "Description": "Presents a sentimental and sometimes amusing portrait of a man's life with his favorite dog, an Alsatian named Tulip",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Poseidon Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Banished Knowledge, The",
        "Authors": "By Miller, Alice and Vennewitz, Leila (TRN)",
        "Description": "In direct opposition to the Freudian drive theory, the author of the best-sellingThe Drama Of The Gifted Child believes that children, at birth, are inherently good, and she traces all forms of criminal deeds to past mistreatments.",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Beyond the Classroom",
        "Authors": "By Steinberg, Laurence, Brown, B. Bradford, and Dornbusch, Sanford M.",
        "Description": "Based on a comprehensive national study of high-school students, Beyond the Classroom explains that it is parents and peers, not teachers, who have the greatest influence over a student's classroom performance. The reason so many students do badly in school is not that their schools are deficient but that their parents either don't care about their children's performance or don't show their children in positive ways that they do. Children who know that their parents value eduction perform much better in school than other children.The other great influence on school performance, according to the study reported in this book, is the peer group. Children are strongly influenced by their friends' attitudes toward school. As a group, children whose friends believe that hard work earns rewards and who value good grades do well in school. Unfortunately, according to the study, fewer than one-fifth of all students say that their friends believe it is important to get good grades. For the most part, adolescent peer culture demeans school success and scorns those students who try to do well in school. The peer culture is so powerful that it can even undermine the positive contributions of parents.The study on which this book is based also found striking and consistent ethnic differences in student performance, differences that cut across socioeconomic groups. African-American and Latino students lag behind their peers while Asian-American students - even in the very same school - perform at the highest levels. Beyond the Classroom explains why this is and offers answers that will help all students, regardless of ethnic background, to do better in school.Beyond the Classroom identifies the real nature of the education crisis in America. It explains why some students succeed brilliantly while others founder and draws valuable lessons about the nature of successful parental and peer group support.",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Living in the Labyrinth",
        "Authors": "By McGowin, Diana Friel",
        "Description": "Diana Friel McGowin was only forty-five years old when she began to struggle with the memory lapses and disorientation that signal the onset of Alzheimer's disease. In this powerful and moving book - the first intimate account written by an A.D. sufferer - McGowin not only chronicles her battle against devastating illness but captures forever the thoughts that for her have become all too fleeting.The haunting feeling that there is less of you today than there was yesterday. The unceasing pressure to \"pass\" as healthy - and the terrifying struggle to accept the fact that you are not. These are the bittersweet emotions and terrible anxieties that all Alzheimer's sufferers share - but rarely voice. With unflinching honesty, Diana McGowin reveals what it is like to forget your children's names, to have a lifetime of professional achievement wiped from your memory...to inhabit a healthy body with an ebbing mind. And with heart-wrenching clarity, she describes how dementia transforms the family, turning unprepared spouses and children into ill-equipped and sometimes unwilling caregivers.But her message is ultimately one of hope. With extraordinary eloquence and compassion, McGowin reaches out to offer her \"fellow travelers\" the simple comforts they need most: a sense of direction rather than destination - and the hope of healing whether or not there is a cure.",
        "Category": " Psychology , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Last Fairy",
        "Authors": "By Hancock, F. E.",
        "Description": "Witch Hazel schemes to destroy Devonia, the last living fairy. Hidden in the text and illustrations are clues leading to treasures buried in the United States and Great Britain.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Fantasy Pubns Ltd",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Mary Farrell's Beyond the Basics: How to Invest Your Money, Now That You Know a Thing or Two",
        "Authors": "By Farrell, Mary",
        "Description": "If you have ever worried -- and who hasn't? -- whether the investment decisions you are making are the right ones, then Mary Farrell's Beyond the Basics can help you cut through the clutter of conflicting advice and reach a new level of successful investing.  Mary Farrell is famous for her investment advice, not only in her work as an investment strategist and managing director of PaineWebber, but also as one of the panelists and occasional substitute host of Wall $treet Week With Louis Rukeyser. Building on the knowledge you already have, she offers new ways of thinking about your money and tells you which investment strategies can make mega-differences in your investment results. Her book covers everything from mutual funds and fixed-income investments to important retirement -- and estate -- planning vehicles such as bypass trusts. She details the crucial process of organizing goals, developing a framework for sophisticated asset allocation, and then selecting and monitoring investments -- always deepening your level of knowledge.  Mary Farrell recognizes that few investors can anticipate short-term movements in the stock market successfully and make money by constantly buying and selling shares. Instead of wasting all your waking hours monitoring scores of economic variables and dozens of financial markets, you will learn a safer, simpler way to profit through thematic investing over the long term. Farrell reveals the major trends that will radically reshape the American economy and offer opportunities for investors who are prepared and who know where to look.  Investment risk is an area that is difficult to measure accurately, even by professionals, but one of the unique features of this book is the risk/reward ratio it provides for virtually every major type of investment. Packed with practical strategies, proven techniques, and fresh insights, Mary Farrell's Beyond the Basics can become the key to your investment success.",
        "Category": " Business & Economics , Finance , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Culture Shock! Italy: A Guide to Customs and Etiquette (Culture Shock! A Survival Guide to Customs & Etiquette)",
        "Authors": "By Flower, Raymond and Falassi, Alessandro",
        "Description": "Whether you travel for business, pleasure, or a combination of the two, the ever-popular \"Culture Shock!\" series belongs in your backpack or briefcase. Get the nuts-and-bolts information you need to survive and thrive wherever you go. \"Culture Shock!\" country guides are easy-to-read, accurate, and entertaining crash courses in local customs and etiquette. \"Culture Shock!\" practical guides offer the inside information you need whether you're a student, a parent, a globetrotter, or a working traveler. \"Culture Shock!\" at your Door guides equip you for daily life in some of the world's most cosmopolitan cities. And \"Culture Shock!\" Success Secrets guides offer relevant, practical information with the real-life insights and cultural know-how that can make the difference between business success and failure.Each \"Culture Shock!\" title is written by someone who's lived and worked in the country, and each book is packed with practical, accurate, and enjoyable information to help you find your way and feel at home.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Graphic Arts Center Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Goddess in the Gospels: Reclaiming the Sacred Feminine",
        "Authors": "By Starbird, Margaret",
        "Description": "In an era that has reclaimed many aspects of the feminine, Margaret Starbird’s The Woman with the Alabaster Jar stands out as a courageous exploration of the scorned feminine in the Western religious tradition. But espousing the marriage between Jesus and Mary Magdalene created a personal crisis for this Catholic scholar. In The Goddess in the Gospels the author tells how she was guided in her ever-deepening study of the New Testament and the gematria--number coding of the Greek alphabet--by an incredible series of synchronicities that mirror the inner and outer worlds and which reveal the Sacred Marriage of male and female--the hieros gamous--leading to her own personal redemption.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Bear & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Best American Magazine Writing 2005",
        "Authors": "By Lemann, Nicholas",
        "Description": "The Best American Magazine Writing 2010 proves that print journalism is as vital as ever, offering information, amusement, connection, and perspective to those who love to lose themselves in a good read. This year's selections, chosen from National Magazine Awards finalists and winners, include David Grann's article from the New Yorker on the execution of a possibly innocent man; Sheri Fink's report from the New York Times Magazine on the alleged euthanization of patients during Hurricane Katrina; and Fareed Zakaria's compelling take from Newsweek on Iran's weakening regime.The Best American Magazine Writing 2010 also includes absorbing profiles, arresting interviews, personal essays, and entrancing fiction. Esquire's Mike Sager recounts a promising quarterback's shocking descent into drugs; Vanity Fair's Bryan Burrough shares the confessions of the year's other major Ponzi schemer, and, from McSweeney's Quarterly, Wells Tower weaves a transporting tale of elemental desire. GQ's Tom Carson offers his critique of America's current vampire craze; Mitch Albom rediscovers Detroit's indomitable spirit in Sports Illustrated; and Garrison Keillor sings an ode to the homegrown joys of state fairs in National Geographic. Additional contributors include Atul Gawande, Megan McArdle, and many others commenting on a range of issues, from health care and the national debt to war movies and the controversy over circumcision. Altogether the writing collected here proves the rich pleasures waiting in the best magazines.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Declining Fortunes: The Withering Of The American Dream",
        "Authors": "By Newman, Katherine S.",
        "Description": "American society has reneged on its promise to the baby-boom generation. Young people for the first time find themselves unable to duplicate, let alone surpass, their own parents' standard of living. Although the media are filled with images of high-living yuppies, the realities for this generation of adults are far bleaker: home ownership rates are falling precipitously, pink slips cascade from corporate headquarters, and costs of raising a family rise threateningly.How are Americans coming to grips with declining fortunes? Based on years of probing research and candid interviews with postwar suburban parents and their baby-boom children, this book provides an unblinking look at the damage that economic decline has done to the people of America - damage reflected in taxpayer revolts, anger at the urban underclass, and fury at the nation's political elites.With insight and sensitivity, Katherine S. Newman explores all the disturbing implications of a trend that shows every indication of being a long-range phenomenon. She discusses the pressures on young mothers to stay at home - pressures that they can scarcely afford to indulge - and the frustration (often mixed with disdain) of elderly parents unable to see why their children can't \"make it\" as they did, \"pulling themselves up by the bootstraps.\" She examines the growing xenophobia toward affluent Asian newcomers. And she points out the rift between counterculture baby boomers who came of age in the 1960s and those who grew up in the \"me decade\" of the 1970s, revealing that the baby-boom generation is a generation divided against itself.Here is a book that sheds new light on the driving issue of our day: downward mobility and the politics of resentment.",
        "Category": " Social Science , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Unfinished Journey: America Since World War II",
        "Authors": "By Chafe, William Henry",
        "Description": "In this gripping, brilliantly written narrative, prize-winning historian William Chafe offers a vibrant chronicle of America's roller-coaster journey through the past forty-five years. Now revised and expanded to assess the impact of the Reagan years,The Unfinished Journey offers substantial new material on Reagan's first legislative victories, the rise of Mikhail Gorbachev and improved relations with the Soviet Union, and the Iran-Contra affair. Chafe examines the Reagan credo in detail, explores the conditions in American society that helped Reagan gain the presidency and stay in power for eight years, and surveys the effects of conservative policies on the economic, social, and cultural fabric of America. In addition, Chafe looks briefly at the first years of the Bush administration, and adds an epilogue analyzing America's prospects in the 1990s. Compelling and controversial,The Unfinished Journey captures the pulse of the nation, and brings its recent history to life.",
        "Category": " History , United States , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Poverty and Discrimination (Studies in Social Economics)",
        "Authors": "By Thurow, Lester C.",
        "Description": "Examines the causes of poverty, paying special attention to the interaction between poverty and racial discrimination",
        "Category": "",
        "Publisher": "Brookings Inst Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1969"
        }
    },
    {
        "Title": "A New Song (Mitford)",
        "Authors": "By Karon, Jan",
        "Description": "The fifth novel in the inspirational Mitford series, by the bestselling author of At Home in Mitford and Somewhere Safe with Somebody Good. In A New Song, Mitford’s longtime Episcopal priest, Father Tim, retires. However, new challenges and adventures await when he agrees to serve as interim minister of a small church on Whitecap Island. He and his wife, Cynthia, soon find that Whitecap has its own unforgettable characters: a church organist with a mysterious past, a lovelorn bachelor placing personal ads, a mother battling paralyzing depression. They also find that Mitford is never far away when circumstances back home keep their phone ringing off the hook. In this fifth novel of the beloved series, fans old and new will discover that a trip to Mitford and Whitecap is twice as good for the soul.",
        "Category": " Fiction , Religious",
        "Publisher": "Penguin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Treating tobacco use and dependence (Clinical practice guideline)",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "U.S. Dept. of Health and Human Services, Public Health Service",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Lesbian and Gay Youth",
        "Authors": "By Ryan, Caitlin, Futterman, Donna, and Ryan, Caitin",
        "Description": "This is the first hands-on guide for providing health and mental health care to lesbian and gay youth and young adults. Although it focuses on adolescents, the information is relevant for any age group. In addition to specific guidelines for care and for approaching such sensitive topics as sexual behavior, substance abuse, and suicide, the book includes a comprehensive review of the literature and the most up-to-date information for providers, researchers, educators, and general readers alike. This book also includes the first guidelines (clinical care protocols) on primary care, mental health care, HIV medical and psychosocial care for lesbian and gay youth, and HIV counseling and testing for adolescents. There is extensive discussion of the social and health effects of stigmatized identity in the context of adolescent development.",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Never Alone: A Personal Way to God",
        "Authors": "By Girzone, Joseph F.",
        "Description": "Joseph Girzone is that singular phenomenon, an author who answers the unasked questions that lie hidden in so many hearts. The wisdom of his spirituality, which is at once both simple and profound, transcends the many factions of religion and speaks to millions, regardless of background, in a language all can understand.Never Alone is his most intimate book to date. In it, he unveils his personal way to God - a way of such wisdom, sympathy, and generosity that anyone can follow it and find satisfaction, happiness, and serenity. As Father Joe guides the reader, he brings us before a God who is neither silent nor condemning, but a patient God who heals gently and thoroughly, a realistic God who knows quite well how we function. We may be shocked or ashamed by what we see in ourselves, but God understands. In Never Alone, Joe Girzone unfolds the spirituality of love and forgiveness, and directs his readers toward peace.",
        "Category": " Religion , Inspirational",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Funding Your Future: The Only Guide to Mutual Funds You'll Ever Need",
        "Authors": "By Clements, Jonathan",
        "Description": "Everyone's worried. Traditionally safe investments in savings, money-market accounts, CDs, and bonds just aren't paying off. Millions of Americans are flocking to mutual funds. Now, award-winning journalist Jonathan Clements clears a path through the financial minefields. In clear, easy-to-understand, jargon-free language, he shows even the most uninformed investor how to use his unique, carefully designed, and balanced approach to mutual funds--and take advantage of the wealth-building power of the stock market.",
        "Category": " Business & Economics , Finance , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Le Petit Nord or Annals of a Labrador Harbour",
        "Authors": "By Grenfell, Anne and Spalding, Katie",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "10.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1920"
        }
    },
    {
        "Title": "Grantville Gazette II (Ring of Fire)",
        "Authors": "By Flint, Eric (EDT)",
        "Description": "The new United States in central Germany launches a one-plane Doolittle Raid on Paris, France. The target: their arch-enemy, Cardinal Richelieu. Meanwhile, an ambassador from the Mughal Empire of northern India is being held captive in Austria by the Habsburg dynasty. Mike Stearns decides to send a mercenary company to rescue him, led by two seventeenth-century mercenary officers: an Englishman and a Irishman, who seem to spend as much time fighting each other as they do the enemy. Mike Spehar's \"Collateral Damage\" and Chris Weber's \"The Company Men\" are just two of the stories contained in this second volume of the Grantville Gazette. In other stories:*A prominent Italian musician decides to travel to Grantville to investigate the music of the future. * An American archer and a Finnish cavalryman become friends in the middle of a battlefield. * A Lutheran pastor begins a theological challenge to the establishment based on his interpretation of the Ring of Fire. * American and German detectives become partners to investigate a murder. * And, in a complete novel by new alternate history star Danita Ewing, An Invisible War, the new United States founds a medical school in Jena despite resistance from up-timers and down-timers alike.The second volume of Grantville Gazette also contains factual articles which explain some of the technical background for the 1632 series, including articles on practical geology, telecommunications, and seventeenth-century swordsmanship.",
        "Category": " Fiction , Science Fiction , Space Opera",
        "Publisher": "Baen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Watergate and the White House (Vol 2)",
        "Authors": "By Evan Drossman~Edward W. Knappman~Mary Elizabeth Cl",
        "Description": "",
        "Category": "",
        "Publisher": "Facts on File Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1974"
        }
    },
    {
        "Title": "The Ship Avenged (Hardcover) (Brainship)",
        "Authors": "By Stirling, S. M.",
        "Description": "Hoping to settle old scores with the Kolnari who destroyed her home and with an unscrupulous uncle, Joat is challenged to overcome a \"breakout\" disease that destroys its victim's minds and is threatening the entire universe.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "The Challenge of Third World Development (2nd Edition)",
        "Authors": "By Handelman, Howard",
        "Description": "",
        "Category": " Political Science , Political Economy",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "A Tree Full of Angels: Seeing the Holy in the Ordinary",
        "Authors": "By Wiederkehr, Macrina",
        "Description": "The Benedictine tradition and practice of divine reading made accessible for everyone.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "New Creation: America's Contemporary Spiritual Voices",
        "Authors": "By Gottlieb, Roger S.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Crossroad",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Chantry Guild",
        "Authors": "By Dickson, Gordon R.",
        "Description": "Amanda Morgan, a Dorsai warrior, warns Hal Mayne that Bleys Ahrens is strengthening his control of the Younger Worlds and asks Hal to help the Chantry Guild in opposing Ahrens",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Taste of Japan (Simple & Easy)",
        "Authors": "By Shufunotomo Co., Ltd (EDT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Japanese",
        "Publisher": "Kodansha Amer Inc",
        "Price Starting With ($)": "7.45",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Soft Furnishings: Ideas & Fabrics by Designers Guild",
        "Authors": "By Donald, Elsie Burch (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Pan Books Ltd",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Beyond burnout: How to enjoy your job again when you've just about had enough",
        "Authors": "By Welch, I. David",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Washington For Women",
        "Authors": "By Duncan, Jacci",
        "Description": "The first ever comprehensive guide to all the programs, groups and services in the nation's capital just for women.",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Madison Books",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Three Nights in the Heart of the Earth: A Novel",
        "Authors": "By Laidlaw, Brett",
        "Description": "During the course of three days and nights of fierce midwestern winter, Ulysses Turner Fraser, poet, father, and charismatic teacher, reconsiders the tragedy of his life, in a story narrated by his younger son, Bryce",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "100 Most Honorable Chinese Recipes",
        "Authors": "By Charlotte Adams and Yu Wen Mei",
        "Description": "",
        "Category": "",
        "Publisher": "Avenel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "A Short Guide to a Happy Life",
        "Authors": "By Quindlen, Anna",
        "Description": "From the New York Times bestselling author of Alternate Side, Anna Quindlen’s classic reflection on a meaningful life makes a perfect gift for any occasion.“Life is made of moments, small pieces of silver amidst long stretches of tedium.  It would be wonderful if they came to us unsummoned, but particularly in lives as  busy as the ones most of us lead now, that won’t happen. We have to teach ourselves  now to live, really live . . . to love the journey, not the destination.” In this treasure  of a book, Anna Quindlen, the bestselling novelist and columnist, reflects on what  it takes to “get a life”—to live deeply every day and from your own unique self,  rather than merely to exist through your days. “Knowledge of our own mortality is  the greatest gift God ever gives us,” Quindlen writes, “because unless you know the  clock is ticking, it is so easy to waste our days, our lives.” Her mother died when  Quindlen was nineteen: “It was the dividing line between seeing the world in black  and white, and in Technicolor. The lights came on for the darkest possible reason. . . . I  learned something enduring, in a very short period of time, about life. And that  was that it was glorious, and that you had no business taking it for granted.” But  how to live from that perspective, to fully engage in our days? In A Short Guide  to a Happy Life, Quindlen guides us with an understanding that comes from knowing  how to see the view, the richness in living.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Kingdoms Of Gold, Kingdoms Of Jade: The Americas Before Columbus",
        "Authors": "By Fagan, Brian M.",
        "Description": "A close-up look at pre-Columbian America provides a chronological history of ancient American civilizations, detailing the artistic, scientific, and cultural accomplishments of the Inca, Aztec, Maya, Olmec, Chavin, Zapotec, and other ancient peoples.",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Angels Within Us: A Spiritual Guide to the Twenty-Two Angels That Govern Our Lives",
        "Authors": "By Price, John Randolph",
        "Description": "THE ANGELS WITHIN US shows how to pinpoint your own trouble spots, discover which angel waits beyond reach, and ask it for guidance. In a step-by-step process that includes meditations, practical exercises, and examples of angelic conversations experienced by the author and others, you will meet the Angel of Unconditional Love and Freedom, catalyst of all angels. You will then learn about the twenty-one other angels whose energies are attuned to such realms as: Illusion and Reality; Creative Wisdom; Abundance; Power and Authority, and more. THE ANGELS WITHIN US guides you to that exalted and natural existence where you can be as cosmically whole, vibrant, strong, and free as you were created to be.",
        "Category": " Body, Mind & Spirit , Parapsychology , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Ask Your Angels: A Practical Guide to Working with the Messengers of Heaven to Empower and Enrich Your Life",
        "Authors": "By Daniel, Alma, Wyllie, Timothy, Ramer, Andrew, and Posnakoff, A.",
        "Description": "Angels have been with us in every time and culture, and in many religious traditions. Ask Your Angels vividly chronicles how they are currently reaching out to every one of us in a totally new way, bridging our physical reality with their pure spiritual energy. From historical writings and widespread contemporary experience that includes their own workshops, the authors show us how we can draw on the power of angels to reconnect with our lost inner selves and to achieve our goals, whether they be better relationships, healing an illness, or recovery from addictionTo align with the angelic energy field, you will use five simple steps, as well as exercises, meditations, and visualizations, to learn how to talk with your angels—in your mind, in letters, in dreams, on a computer—and ask their guidance in matters from the inspired to the mundane.From Gabriel, Michael, Raphael, and Uriel to the angels of birth and death, from the Earth Angel to the guardian or companion angel who is your personal teacher, comforter, and intimate friend, this guide will introduce you to humor, wisdom, and companionship that come from contact with angels, for they are a doorway to the Divine within us.",
        "Category": " Body, Mind & Spirit , Supernatural (incl. Ghosts)",
        "Publisher": "Wellspring/Ballantine",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Footfalls in Memory",
        "Authors": "By Waite, Terry",
        "Description": "In 1987, Terry Waite was in Beirut working for the release of the hostages when he was taken prisoner and put in solitary confinement. For the first year, he was given nothing to read. During those days he passed the endless hours by writing his autobiography in his head, and by remembering the books, stories, and poems he had read before his captivity. Eventually his guards relented, and he was given books. The first book he received was Beyond Euphrates by Freya Stark, followed by an English translation of the Koran, and later such classics as A Tree Grows in Brooklyn, The First Circle, and The Brothers Karamazov. However, the guards' limited knowledge of English resulted in Terry receiving books on child care, breastfeeding, and even one detailing escapes from prison camps in World War II. Desperate for words, Terry read them all cover to cover.Here he has collected excerpts from his favorite books read during confinement, the ones he remembered from his past, and the ones he wished he had been given. This is a journey through one man's mind; his depression, loneliness, and later, the emergence of his faith and spirit despite extremely trying circumstances. Interspersed between selections are Terry's own reflections on these books and his reasons for including them.",
        "Category": " Religion , Christianity , Episcopalian",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Sparrows Point: Making Steel--The Rise and Ruin of American Industrial Might",
        "Authors": "By Reutter, Mark",
        "Description": "Profiles the Sparrow's Point steel plant--its history and founders, the big-time magnates who ran it, the workers, and its operations--and details the social, political, and economic situations that have contributed to the demise of U.S. industrial power",
        "Category": " Business & Economics , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Shrink Your Female Fat Zones: Lose Pounds and Inches--Fast!--From Your Belly, Hips, Thighs, and More",
        "Authors": "By Austin, Denise",
        "Description": "In as little as 10 minutes a day, you can ... Shrink Your Female Fat Zones! What's a female fat zone? Maybe it's that part of your body that popped out after you had a baby or dropped after you turned 40. It's that area you may try to hide in baggy shirts or pants, the spot where things bind or rub or just stick out the wrong way.If you have a fat zone, fitness and weight-loss expert Denise Austin has designed a program just for you. In just 6 weeks, you'll get the slimmer thighs, trimmer hips, and flatter belly that you've dreamed of. You'll lose up to 2 pounds a week, and wherever you used to pinch your share of inches, you'll be smaller, firmer, and more defined.Denise designed these targeted programs by zeroing in on the most effective diet and exercise tricks to shrink her own trouble spots. Now she's sharing her tips with you!As you learn Denise's secrets, you will:* Remodel your body and rev up your metabolism in as little as 10 minutes a day* Zip through fun, fast workouts that trim and tone trouble areas* Savor 6 weeks of mouthwatering menu plans, developed by a top nutritionist* Try dozens of Denise's favorite family recipes and quick cooking hints, with shopping lists that make prep time a snap* Track your progress in a motivating, specialized journal* Check out before and after photos of women who've seen amazing, rapid resultsSay goodbye to your female fat zones-- forever!",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Eminent Victorians: Florence Nightingale, General Gordon, Cardinal Manning, Dr. Arnold",
        "Authors": "By Strachey, Lytton",
        "Description": "Few books have had such an impact on their own generation as did Eminent Victorians, which exposed the hypocrisy of the Victorian era by deflating the legends surrounding four of its most notable figures. In the process, Strachey revitalized the art of biography.",
        "Category": " History , Europe , Great Britain , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1969"
        }
    },
    {
        "Title": "Chief of staff: Twenty-five years of managing the presidency",
        "Authors": "By Samuel Kernell~Samuel L. Popkin",
        "Description": "",
        "Category": "",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "American Handbook of Psychiatry, Volume Two",
        "Authors": "By Arieti, Silvano, Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "31.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Chemistry, 5th edition (Partial Solutions Guide)",
        "Authors": "By Zumdahl, Steven S.",
        "Description": "Authors Steven and Susan Zumdahl offer all the elements instructors need for their general chemistry course. They bring a conceptual approach to chemistry and integrate problem-solving skills throughout, helping students transition from theory to practice. A strong emphasis on models, real-world applications, and visual learning prevails throughout the text.The Seventh Edition seamlessly integrates the strengths of the Zumdahl approach through a comprehensive and interwoven print and technology program. Enhanced Sample Exercises, online homework problems, and Classroom Response System content help instructors assess conceptual understanding and problem-solving skills, while new animations and images support visual learning. In addition, Houghton Mifflin offers implementation services through our TeamUP program to help instructors and students get the most out of the text and its supplements.New! Reality Checks at the end of selected Sample Exercises prompt students to ensure that their answers are reasonable.New! The expanded art program includes new electrostatic potential maps in Chapter 8, \"Bonding\" that illustrate bond and molecular polarity.New! The redesigned For Review section now includes bulleted key concepts for the chapter, as well as review questions of which approximately 50% are new.New! Integrative Problems in the end-of-chapter material assess students' cumulative understanding of multiple concepts and skills presented in previous chapters. End-of-chapter questions also include collaborative Active Learning Question (formerly In-Class Discussion Questions), Exercises organized by topic, Additional Exercises not keyed by topic, integrative Challenge Problems, and comprehensive Marathon Problems.New! Algorithmically-generated Test Questions as well as Conceptual Questions are available in HM Testing, all coded by level of difficulty to allow instructors to more easily choose appropriate test items.New! Animations with assignable exercises appear on the Online Study Center and Student CD.New! HM ClassPresent v.3 includes new animations and videos as well as enhanced search functionality.Eduspace Online Learning Tool features two kinds of problems: ChemWork interactive online homework and end-of-chapter algorithmic questions with links to corresponding textbook pages and media for student reference at point of learning.",
        "Category": " Science , Chemistry , General",
        "Publisher": "Brooks Cole",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Coyote Cafe: Foods from the Great Southwest, Recipes from Coyote Cafe",
        "Authors": "By Miller, Mark",
        "Description": "Now in paperback!When Mark Miller opened the doors of Santa Fe'¬?s Coyote Cafe in 1987, the face of American cuisine changed forever. Blending centuries-old culinary traditions with modern techniques, Miller pioneered the emerging Southwestern cuisine, earning accolades and thrilling diners at the Coyote with his robust, inspired cooking. Originally published in 1989, COYOTE CAFE was Miller'¬?s first cookbook, and it has since sold over 200,000 copies, making it one of the best-selling full-color cookbooks ever. Nearly 15 years later, with Southwestern influences entrenched in kitchens across the country, we'¬?re excited to make this landmark book available to a new generation of cooks in a paperback edition. Featuring over 150 recipes, COYOTE CAFE presents the bold, sumptuous creations that have become Southwestern classics. Mexican, Hispanic, and Native American influences inflect such imaginative dishes as Wild Morel Tamales, Lobster Enchiladas, and Yucatan Lamb. When you try the vibrant cuisine of COYOTE CAFE, you'¬?re experiencing one of America'¬?s most dynamic regional cuisines.?Ä¢ Over 200,000 copies sold in hardcover.?Ä¢ Includes an extensive section on choosing and preparing over 35 fresh and dried varieties of chiles, as well as an in-depth glossary of ingredients.From the Trade Paperback edition.",
        "Category": " Cooking , Regional & Ethnic , American , Southwestern States",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "The Legal and E-Commerce Environment Today: Business in the Ethical, Regulatory, and International Setting",
        "Authors": "By Miller, Roger LeRoy and Cross, Frank B.",
        "Description": "Miller (Institute for University Studies, Arlington, Texas) and Cross (Center for Legal and Regulatory Studies, U. of Texas, Austin) have written their business law textbook with the electronic world in mind, with chapters on the foundations of law, ethics and responsibility, the American court system, copyright and intellectual property, international business and regulation, private environment, contracts, torts, e-contracts, bankruptcy, the public environment, constitutional authority to regulate business, and numerous appendices on pertinent legal acts that concern business and electronic transactions. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Business Law",
        "Publisher": "South-Western College/West",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Whole House Remodeling Guide",
        "Authors": "By Duncan, S. Blackwell.",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Our Last Best Shot",
        "Authors": "By Stepp, Laura",
        "Description": "",
        "Category": "",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Memoirs Sixty Years on the Firing Line",
        "Authors": "By KROCK, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Funk & Wagnalls",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Saint Augustine's pigeon: The selected stories of Evan S. Connell",
        "Authors": "By Connell, Evan S",
        "Description": "",
        "Category": "",
        "Publisher": "North Point Press",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Paradigm Shift: The New Promise of Information Technology",
        "Authors": "By Tapscott, Don and Caston, Art",
        "Description": "Everywhere organizations are attempting to \"reinvent\" themselves. The old, unresponsive bureaucracy simply doesn't work in today's volatile, open, global business environment. However, the computing systems in today's organization seem unable to deliver the goods for corporate rebirth. They are limited in function, and expensive, and seem to take forever to change.Here's a book that explains how a new era of technology can enable the transition to the new enterprise and business success. It shows managers and professionals with little or no technical background how to take action NOW to achieve short-term benefits of this technology and position their organizations for long-term transformation.Based on a series of multimillion dollar investigations of more than 4,500 businesses and government organizations, Paradigm Shift examines and synthesizes the recent experiences of leading edge companies in making the transition to the second era.The book reveals the promise of the new technology in creating the open, networked, \"client/server\" enterprise - altering virtually every facet of today's business operations, including the impact of work-group computing and business process reengineering in building a network of high performance business teams; enterprise computing in achieving the integrated competitive organization; and interenterprise computing in extending the react of companies to their customers, suppliers, business partners, and even competitors.You'll learn how major shifts in the nature of information technology are enabling previously unimagined breakthroughs in its use and useability: the shift from proprietary to open systems; the shift from host-based to network-based systems; and the shift from software craft to software manufacturing.Most important you will learn critical insights into how to make the transition to the second era enterprise.Drawing on the recent experiences of such diverse companies as Toys 'R' Us, Sears Roebuck, Four Seasons Hotels, Otis Elevator, and Federal Express, this cutting-edge book provides all the information you'll need to succeed in today's new high-tech, high-stakes business environment!",
        "Category": " Business & Economics , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Effective problem solving",
        "Authors": "By Levine, Marvin",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    }
]