[
    {
        "Title": "Poland Under Black Light",
        "Authors": "By Anderman, Janusz",
        "Description": "Short stories portray the efforts of ordinary Polish citizens to cope with life in a totalitarian state",
        "Category": " Fiction , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Bloom County Babylon: Five Years of Basic Naughtiness",
        "Authors": "By Breathed, Berke",
        "Description": "An anthology of cartoons from the syndicated comic strip, \"Bloom County\" encompasses highlights from the five-year span of the strip",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "The Ends of the Earth: A Journey at the Dawn of the Twenty-first Century",
        "Authors": "By Kaplan, Robert D.",
        "Description": "In The Ends of the Earth, Robert D. Kaplan travels from the devastated countries of West Africa and the fundamentalist enclaves of Egypt and Iran to the culturally explosive lands of Central Asia, India, Pakistan, and Southeast Asia with hardly more than a notebook and a backpack.Kaplan's intention was to investigate firsthand the effect of population explosion and environmental degradation in these countries and to see how the various cultures he encountered responded to them. But as he traveled, talking to gun smugglers and government ministers, warlords and shantytown dwellers, he discovered that the real problem, in places as far afield as Sierra Leone and western China, was the reemergence of longstanding cultural rivalries and the dissolution of national boundaries as regions redefine themselves along ethnic and historic lines.Kaplan's ground-level experiences allow him to avoid grandiose generalizations about the clash of civilizations and to replace them with intimate portraits of the men and women he encounters: Rafighdoost, Khomeini's fiercely loyal chauffeur; Ali Abdel Razag, keeper of the Aswan High Dam; and Ayshe Tanrikulu, a squatter on Golden Mountain, a shantytown on the outskirts of Ankara, who hopes that her sons will one day be doctors or engineers. It is in the squalor of daily existence and in people's fears, frustrations, and dreams that Kaplan looks for the key to a country's future.The Ends of the Earth offers an intimate portrait of the devastated parts of the world, whose cultural disasters - like those in Bosnia, Chechnya, and Rwanda today - will dominate our attention and remake the world of tomorrow.",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "God's Grace from Ground Zero: Seeking God's Heart for the Future of Our World",
        "Authors": "By Cymbala, Jim and Sorenson, Stephen",
        "Description": "Out of the horror of September 11 emerges a startling message of hope. Pastor Jim Cymbala believes that in the face of unspeakable tragedy, God is reaching out to the heart of a grieving city, to the people of a wounded nation, and to a world that fears what the future may hold. God’s Grace from Ground Zero assures us that God hates the senseless evil that destroyed thousands of lives, and that this is a time when he is pouring out his mercy in a special way. The harvest is ripe, hearts that were closed are open to the gospel, and today, not tomorrow, is when we have the opportunity and responsibility to express Jesus through our words and through our deeds. Now is the time to love our families, our friends, and those around us. Now is the time to trust God and live for him like never before. And now, in the midst of our grief, our fear, and our lack of answers for things that make no sense, is the time to worship God with all our hearts.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Wit of Women",
        "Authors": "By Lore Cowan",
        "Description": "",
        "Category": "",
        "Publisher": "Aurora Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Ulster debate;: Report of a study group of the Institute for the Study of Conflict",
        "Authors": "By Institute for the Study of Conflict",
        "Description": "",
        "Category": "",
        "Publisher": "Bodley Head",
        "Price Starting With ($)": "10.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "RAIN OR SHINE: FAM AF",
        "Authors": "By McFadden, Cyra",
        "Description": "Chronicles the author's early life as the daughter of a rodeo announcer and a trick rider, whose tumultuous, free-spirited relationship is set against the gritty backdrop of the Western rodeo circuit, despite marriage and divorce",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Dream Palace of the Arabs: A Generation's Odyssey",
        "Authors": "By Ajami, Fouad",
        "Description": "From Fouad Ajami, an acclaimed author and chronicler of Arab politics, comes a compelling account of how a generation of Arab intellectuals tried to introduce cultural renewals in their homelands through the forces of modernity and secularism.  Ultimately, they came to face disappointment, exile, and, on occasion, death.  Brilliantly weaving together the strands of a tumultuous century in Arab political thought, history, and poetry, Ajami takes us from the ruins of Beirut's once glittering metropolis to the land of Egypt, where struggle rages between a modernist impulse and an Islamist insurgency, from Nasser's pan-Arab nationalist ambitions to the emergence of an uneasy Pax Americana in Arab lands, from the triumphalism of the Gulf War to the continuing anguished debate over the Israeli-Palestinian peace accords.For anyone who seeks to understand the Middle East, here is an insider's unflinching analysis of the collision between intellectual life and political realities in the Arab world today.",
        "Category": " Social Science , Ethnic Studies , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Hasidism",
        "Authors": "By Aryeh (compiler) and Posner, Raphael (edito",
        "Description": "",
        "Category": "",
        "Publisher": "Leon Amiel Publisher",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "A Shunpiker's Guide to the Northeast: Washington to Boston Without Turnpikes or Interstates",
        "Authors": "By Exton, Peter",
        "Description": "",
        "Category": " Travel , United States , Northeast , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "Epm Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Religions of Africa: Traditions in Transformation (Religious Traditions of the World)",
        "Authors": "By Lawson, E. Thomas",
        "Description": "",
        "Category": " Religion , Ethnic & Tribal",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Royal Family Yearbook",
        "Authors": "By Hall, Trevor",
        "Description": "",
        "Category": "",
        "Publisher": "Talman Co*out Of Business",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Philip Mironov and the Russian Civil War",
        "Authors": "By Starikov, Sergei",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "19.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Columbus Menu: Italian Cuisine After the First Voyage of Christopher Columbus, 1492-1992",
        "Authors": "By Milioni, Stefano",
        "Description": "",
        "Category": "",
        "Publisher": "Italian Trade Commission",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Arab Middle East and Muslim Africa",
        "Authors": "By KEREKES, Tibor. ed.",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "10.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Campbell's Creative Cooking With Soup: Over 19,000 Delicious Mix and Match Recipes",
        "Authors": "By Campbell Soup Company",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Prevention's Stop Dieting and Lose Weight Cookbook: Featuring the Seven-Step-Get-Slim Plan That Really Works",
        "Authors": "By Prevention Magazine Health Books (COR) and Plutt, Mary Jo (EDT)",
        "Description": "With good taste and a slimmer profile in mind, this beautiful cookbook gives readers the tools they need to reshape their eating habits--and their bodies. No calorie counting. No skipping meals. These recipes follow a revolutionary new concept called fat budgeting which create recipes that satisfy a robust appetite and still help the consumer drop pounds",
        "Category": " Cooking , Reference",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Sportswriter",
        "Authors": "By Ford, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Random House/Vintage Contemporaries",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Mais oui! (French Edition)",
        "Authors": "By Chantal P. Thompson, Elaine M. Phillips",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Cooking for One Is Fun",
        "Authors": "By Creel, Henry Lewis",
        "Description": "A full complement of single-serving recipes for high-style dishes of every sort, covering the menu's full range of courses and the gourmet's range of tastes",
        "Category": " Cooking , General",
        "Publisher": "Times Books",
        "Price Starting With ($)": "7.26",
        "Publish Date": {
            "Month": "November",
            "Year": "1976"
        }
    },
    {
        "Title": "Psychotherapy With Lesbian Clients: Theory Into Practice",
        "Authors": "By Falco, Kristine L.",
        "Description": "Divided into two parts the context of therapy, and the content of therapy this volume first provides a foundation for understanding the unique aspects of working with lesbian clients, and then goes on to address a broad range of treatment issues. The closing chapter presents specific guidelines on what the therapist needs to know to be adequately prepared to deliver clinical services to lesbian clients. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Psychology , Human Sexuality",
        "Publisher": "Routledge",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Rhodes and the Dodecanese (Travelers' guide)",
        "Authors": "By Currie, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Bobbs-Merrill",
        "Price Starting With ($)": "12.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Fear of Flying",
        "Authors": "By Erica Jong",
        "Description": "",
        "Category": "",
        "Publisher": "Signet Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Silent Grief: Miscarriage-Child Loss: Finding Your Way Through the Darkness",
        "Authors": "By Hinton, Clara",
        "Description": "But now that he is Dead, Why should I fast? Can I bring him back again? I will go to him but he will not return to me(2 Samuel 12:23)Almost 200,000 couples in America each year suffer through the tragedy of miscarriage. And that statistic only tells us about first trimester miscarriages. The emotional pain of longer-term miscarriages, and the untold numbers of mothers and fathers who keep silent about their hurt, make this form of child loss especially cruel.But in Silent Grief, author Clara Hinton brings a clear message of hope through the cold mourning. Writing of her own grief, and interviewing scores of women and men, she offers not pat answers, but instead show us this: You are not alone.Additionally, the author touches the tears of other forms of child loss: stillbirth, missing children, and adult children who succumb to accident or illness.The moving, honest responses to these interviews tells the reader that through the tears and rage and awful silence, God still loves us and knows our children intimately. King David knew this. He knew that one day he would reunited with his child.",
        "Category": " Self-help , Death, Grief, Bereavement",
        "Publisher": "New Leaf Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Verbal Abuse: Survivors Speak Out on Relationship and Recovery",
        "Authors": "By Evans, Patricia",
        "Description": "If your partner: seems irritated or angry at you several times a week, denies being angry when he clearly is, does not work with you to resolve important issues, rarely or never seems to share thoughts or plans with you, or tells you that he has no idea what you’re talking about when you try to discuss important problems…you need this book. Verbal Abuse: Survivors Speak Out outlines solutions to abusive relationships, tells victims where to find shelters and support groups, and analyzes why many therapists misdiagnose problems in violent relationships.",
        "Category": " Family & Relationships , Abuse , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "E.M. Forster: A Life",
        "Authors": "By Furbank, Philip Nicholas",
        "Description": "This authorized biography traces the growth of the novelist--his education and travels, his literary success, his sexual and social emancipation as an admitted homosexual, and his emergence as an active public figure",
        "Category": " Literary Criticism , European , English, Irish, Scottish, Welsh",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Entertaining in the White House",
        "Authors": "By Smith, Marie D.",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Acropolis Americana",
        "Price Starting With ($)": "30.83",
        "Publish Date": {
            "Month": "June",
            "Year": "1967"
        }
    },
    {
        "Title": "Behind the Embassy Door: Canada, Clinton & Quebec",
        "Authors": "By Blanchard, James J.",
        "Description": "",
        "Category": "",
        "Publisher": "Sleeping Bear Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Southwestern Indian Tribes",
        "Authors": "By Bahti, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "KC",
        "Price Starting With ($)": "7.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Mr. Food-Fun Kitchen Tips (And Recipes, Too!)",
        "Authors": "By Ginsburg, Art",
        "Description": "Emphasizing no-nonsense, fun food preparation for families, a collection of tips for saving money, space, and time provides accompanying recipes for each piece of advice. 100,000 first printing.",
        "Category": " Cooking , General",
        "Publisher": "Morrow Cookbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Actor's Blood",
        "Authors": "By Hecht, Ben",
        "Description": "",
        "Category": "",
        "Publisher": "Covici, Friede",
        "Price Starting With ($)": "29.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1936"
        }
    },
    {
        "Title": "Realm of the Iroquois (American Indians)",
        "Authors": "By Time-Life Books",
        "Description": "Provides a history of the Five Nations from the early 16th century through the mid-1800s, and discusses the relationship between these Indians and the French, Dutch, and English",
        "Category": " History , Civilization",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "A Travel Guide to Heaven",
        "Authors": "By DeStefano, Anthony",
        "Description": "A recent Newsweek poll reports that 76 percent of Americans believe in heaven. Yet even avid believers have difficulty conjuring up more than vague images of halos, harps, and wispy angels in flowing robes. Anthony DeStefano knew there had to be a more complete, meaningful, and comforting vision of what heaven is like, and A TRAVEL GUIDE TO HEAVEN is the entertaining and enlightening result.Using the Bible as his guide, the author notes that heaven is not only a spiritual place, but also a physical place, a fabulous “luxury resort” more sumptuous than any on Earth. The residents are real, their bodies transformed into their most perfect selves—physically, emotionally, and spiritually. By making a spiritual subject immensely physical, the book provides a picture of amazing places to visit, things to do, luxuries for pampering—not to mention deep, abiding joy.Combining the clarity and logic of C. S. Lewis with a terrific sense of fun and adventure, DeStefano creates a brilliant, reassuring portrait of heaven, a place that has intrigued and puzzled humankind throughout history.  With its clear view of the afterlife, A TRAVEL GUIDE TO HEAVEN might best be compared to James Van Praagh's Talking to Heaven or Betty J. Eadie's Embraced by the Light in its tremendous message of comfort and reassurance.",
        "Category": " Religion , Spirituality",
        "Publisher": "Doubleday Religion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Portable MBA in Finance and Accounting",
        "Authors": "By Livingstone, John Leslie (EDT)",
        "Description": "A survey of what leading business schools teach their students about finance and accounting includes input from such schools as Harvard, George Washington University, and Georgia Institute of Technology",
        "Category": " Business & Economics , Corporate Finance , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Savannah in 88 Pictures",
        "Authors": "By Hoff, Lisa D.",
        "Description": "",
        "Category": " Travel , Pictorials",
        "Publisher": "Cities in Color",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Politics, Reform and Expansion 1890-1900",
        "Authors": "By Faulkner, Harold U",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row Publishers",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Cuisine for All Seasons: A Menu Cookbook",
        "Authors": "By Hecht, Helen",
        "Description": "Provides a variety of menus designed for a variety of occasions throughout the year, with dishes that feature fresh ingredients in season simply and imaginatively prepared",
        "Category": " House & Home , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Japanese Cooking: Pure and Simple",
        "Authors": "By Scott, David",
        "Description": "",
        "Category": "",
        "Publisher": "Exeter Books;",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Gallaudet Survival Guide to Signing",
        "Authors": "By Lane, Leonard G. and Skrobisz, Jan (ILT)",
        "Description": "This pocket guide lists five hundred of the most frequently used signs, providing clear line drawings and descriptions of each, plus suggestions for successful signing, a chart of the American Manual Alphabet, and a section on numbers",
        "Category": " Education , Special Education , Communicative Disorders",
        "Publisher": "Gallaudet University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Possession",
        "Authors": "By Byatt, A. S.",
        "Description": "National Bestseller  Winner of England’s Booker Prize and the literary sensation of the year, Possession is an exhilarating novel of wit and romance, at once an intellectual mystery and triumphant love story. It is the tale of a pair of young scholars researching the lives of two Victorian poets. As they uncover their letters, journals, and poems, and track their movements from London to Yorkshire—from spiritualist séances to the fairy-haunted far west of Brittany—what emerges is an extraordinary counterpoint of passions and ideas. An exhilarating novel of wit and romance, an intellectual mystery, and a triumphant love story. This tale of a pair of young scholars researching the lives of two Victorian poets became a huge bookseller favorite, and then on to national bestellerdom.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "19.48",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Stein and Day Book of World Autographs",
        "Authors": "By Rawlins, Ray",
        "Description": "",
        "Category": "",
        "Publisher": "Stein & Day Pub",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "1978"
        }
    },
    {
        "Title": "Lincoln: A Novel",
        "Authors": "By VIDAL, GORE and Box, Edgar (CON)",
        "Description": "Lincoln is the cornerstone of Gore Vidal's fictional American chronicle, which includes Burr, 1876, Washington, D.C., Empire, and Hollywood. It opens early on a frozen winter morning in 1861, when President-elect Abraham Lincoln slips into Washington, flanked by two bodyguards. The future president is in disguise, for there is talk of a plot to murder him. During the next four years there will be numerous plots to murder this man who has sworn to unite a disintegrating nation. Isolated in a ramshackle White House in the center of a proslavery city, Lincoln presides over a fragmenting government as Lee's armies beat at the gates. In this profoundly moving novel, a work of epic proportions and intense human sympathy, Lincoln is observed by his loved ones and his rivals. The cast of characters is almost Dickensian: politicians, generals, White House aides, newspapermen, Northern and Southern conspirators, amiably evil bankers, and a wife slowly going mad. Vidal's portrait of the president is at once intimate and monumental, stark and complex, drawn with the wit, grace, and authority of one of the great historical novelists.   With a new Introduction by the author.",
        "Category": " Fiction , Historical",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Volkswagen (Cars Series)",
        "Authors": "By Wagner, Max",
        "Description": "",
        "Category": " Transportation , Automotive , Pictorial",
        "Publisher": "New Line Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Message in the Hollow Oak (Nancy Drew, Book 12)",
        "Authors": "By Keene, Carolyn",
        "Description": "A group of professional detectives challenge Nancy to tackle a mystery that they have failed to solve: find an invaluable message hidden by a missionary centuries ago in a hollow oak tree in Illinois. While searching the woods for the ancient tree, Nancy and her friends live with a group of young archaeologists who are excavating prehistoric Indian burial mounds on a nearby farm. A shadowy enemy stalks Nancy and harasses everyone at the dig. The young investigator pursues her dangerous adversary to an outlaws’ cave, and is threatened when she discovers an unusual treasure. How Nancy, with few clues to go on, solves this complex mystery will thrill all readers.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1935"
        }
    },
    {
        "Title": "North American Free Trade: Assessing the Impact",
        "Authors": "By Bosworth, Barry P., Lawrence, Robert Z. (EDT), and Lustig, Nora",
        "Description": "The proposed North American Free Trade Agreement (NAFTA) represents a historic change in relations among Canada, Mexico, and the United States. The effect of the agreement on the three economies has generated controversy and some degree of alarm within each country.In this book, noted trade and development experts review the available literature on the effects of NAFTA on the three member countries and the world trading system. They evaluate how NAFTA will affect areas such as economic growth, employment, income distribution, industry, and agriculture in Canada, Mexico, and the United States; and consider the significance the trade agreement holds for the rest of the world.Drusill K. Brown begins the discussion by providing an overview and comparison of the general results from recent studies. Raúl Hinojosa-Ojeda and Sherman Robinson explore in greater detail the potential effects of NAFTA on wages and employment in Mexico and the United States. Sidney Wintrab reviews industry-specific effects of NAFTA, in particular, the environment, the social agenda, and human rights and democracy. Finally, Carlos Alberto Primo Braga considers the implications of NAFTA on the rest of the world.Following each of these chapters, international scholars assess the alternatives and provide recommendations for future research.",
        "Category": " Business & Economics , International , General",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Me Nobody Knows: A Guide for Teen Survivors",
        "Authors": "By Bean, Barbara and Bennett, Shari",
        "Description": "The first book for sexually abused teens to turn toWhen teenagers are victims of sexual abuse, the 'normal' problems of adolescence are exacerbated. The authors validate the conflicting emotions aroused by sexual abuse and offer these adolescents simple, concrete advice about reporting the abuse and how to seek counseling.This unique book is for teenagers in therapy that have been victims of sexual abuse, as well as for their therapists. Through written, visual, and relaxation exercises, the book shows survivors how to begin to cope.",
        "Category": " Medical , Psychiatry , Child & Adolescent",
        "Publisher": "Jossey-Bass Inc Pub",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Merriam Webster's Collegiate Encyclopedia",
        "Authors": "By Steven, Mark A. (EDT)",
        "Description": "This conveniently-sized encyclopedia is a portable and inexpensive desktop reference to put alongside your dictionary. The volume includes 25,000 entries, 1,300 photographs and illustrations, 350 maps and diagrams, and thankfully includes pronunciations of some words and names. Developed with  Encyclopaedia Britannica , the reference features clear and concise entries of about 100-300 words. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Reference , Encyclopedias",
        "Publisher": "Merriam-Webster",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Last Half-Century: Societal Change and Politics in America",
        "Authors": "By Janowitz, Morris",
        "Description": "The Last Half-Century represents the culmination of a lifetime of scholarship by Morris Janowitz. In this comprehensive and systematic analysis of the major trends in American society during the past fifty years, he probes the weakening of popular party affiliations and the increased inability of elected representatives to rule. Centering his work on the crucial concept of social control, Janowitz orders and assesses a vast amount of empirical research to clarify the failure of basic social institutions to resolve our chronic conflicts.For Janowitz, social control denotes a society's capacity to regulate itself within a moral framework that transcends simple self-interest. He poses urgent questions: Why has social control been so drastically weakened in our advanced industrial society? And what strategies can we use to strengthen it again?The expanation rests in part on the changes in social structure which make it more and more complicated for citizens to calculate their political self-interest. At the same time, complex economic and defense problems also strain an already overburdened legislative system, making effective, responsive political rule increasingly difficult.Janowitz concludes by assessing the response of the social sciences to the pressing problem of social control and asserts that new forms of citizen participation in the government must be found.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.02",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Mirette on the High Wire",
        "Authors": "By McCully, Emily Arnold",
        "Description": "One day, a mysterious stranger arrives at a boardinghouse of the widow Gateau—a sad-faced stranger, who keeps to himself. When the widow’s daughter, Mirette, discovers him crossing the courtyard on air, she begs him to teach her how he does it.   But Mirette doesn’t know that the stranger was once the Great Bellini—master wire-walker. Or that Bellini has been stopped by a terrible fear. And it is she who must teach him courage once again.   Emily Arnold McCully’s sweeping watercolor paintings carry the reader over the rooftops of nineteenth-century Paris and into an elegant, beautiful world of acrobats, jugglers, mimes, actors, and one gallant, resourceful little girl.",
        "Category": " Juvenile Fiction , Sports & Recreation , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Astronomy Hoyle",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Friends of Art and Preservation in Embassies Tenth Anniversary",
        "Authors": "By Ross, Mairi & Barger, Jennifer & Cohen, Jean Lawler. (Text)",
        "Description": "",
        "Category": "",
        "Publisher": "FRIENDS OF ART AND PRESERVATION IN EMBASSIES,.",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Famous American admirals (A Norback book)",
        "Authors": "By Reynolds, Clark G.",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Anton Edelmann Creative Cuisine: Chef's Secrets from the Savoy",
        "Authors": "By Deighton, Len",
        "Description": "",
        "Category": " Cooking , Methods , General",
        "Publisher": "TRAFALGAR SQUARE +",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The White T",
        "Authors": "By Harris, Alice",
        "Description": "A fabulous tribute to the one piece of clothing worn by people of every age, gender, and shape, the white T captures the zeitgeist of our times. With striking photographs and sophisticated text, the white T traces the colorful history of the classic garment worn by billions all over the world. From the first Hanes version sold in the 1930s for twenty-four cents to its transformation into the ultimate in cool (not to mention sexy) when worn by James Dean, Elvis Presley, and Marlon Brando, the white T has become part of our culture.The significance of the white T goes beyond fashion, to encompass the political, sexual, and social trends of the past decades. Whether tie dyed, stamped with a slogan or icon, torn, slashed, or designed, these shirts make a statement, and everyone from presidents to rock stars, bikers to bankers, babies to baby boomers, has at least one white T. Celebrating this universally worn piece of clothing, the white T is a chronicle of cultural history, and like its quirky and expressive subject, in itself a work of art.",
        "Category": " Social Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.77",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Sustaining Knock Your Socks Off Service (Knock Your Socks Off Series)",
        "Authors": "By Zemke, Ron and Connellan, Thomas K.",
        "Description": "Provides advice to companies which have implemented the principles of quality customer-oriented service about techniques for maintaining and improving their original high level of service",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "Amacom Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Anthracis-6",
        "Authors": "By Tom Croft",
        "Description": "",
        "Category": "",
        "Publisher": "Palmer & Stewart Publishing",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Bartlett's Familiar Quotations",
        "Authors": "By John Bartlett",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "8.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Euripides V: Electra, The Phoenician Women, The Bacchae (The Complete Greek Tragedies) (Vol 5)",
        "Authors": "By Euripides, Grene, David, and Lattimore, Richmond",
        "Description": "In nine paperback volumes, the Grene and Lattimore editions offer the most comprehensive selection of the Greek tragedies available in English. Over the years these authoritative, critically acclaimed editions have been the preferred choice of over three million readers for personal libraries and individual study as well as for classroom use.",
        "Category": " Drama , Ancient & Classical",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Baby Train and Other Lusty Urban Legends",
        "Authors": "By Brunvand, Jan Harold",
        "Description": "Jan Harold Brunvand—''Mr. Urban Legend\" [Smithsonian]—tracks the most fabulous tales making today's cocktail-party circuit and shows why those stories that sound too good to be true probably are too good to be true.The eponymous episode—\"The Baby Train\"—sheds light on certain predawn activities that have linked unusually high birth rates to the whim of train schedule makers. Other stories offer a revealing peek behind the story of \"The Exploding Bra,\" expose the embarrassing source of \"The Hairdresser's Error,\" resurrect a \"Failed Suicide\" Buster Keaton would have died for, and show why adults are better off not bringing their comic book fantasies out of the closet. From \"Superhero Hijinx\" to \"The Shocking Videotape\" to \"The Accidental Cannibal,\" The Baby Train uncovers the mysteries behind some of the bawdiest, goriest, funniest, most pyrotechnic urban legends yet.",
        "Category": " Social Science , Folklore & Mythology",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Windows",
        "Authors": "By Clery, Val",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Origins: Our Place in Hubble's Universe",
        "Authors": "By Gribbin, John R. and Goodwin, Simon",
        "Description": "Full-page color photographs from the Hubble Space Telescope and large terrestrial telescopes chronicle the prevailing theory of the origin and development of the universe by illustrating progressively closer, and so newer, celestial features. Also includes a long introduction, substantial captions on facing pages, and a glossary without pronunciation. A sequel to Goodwin's  Hubble's Universe . Picture credits stand in for a bibliography. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Science , Astronomy",
        "Publisher": "Abrams Press",
        "Price Starting With ($)": "6.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Monty Hall Problem & Other Puzzles (Mastermind Collection)",
        "Authors": "By Moscovich, Ivan",
        "Description": "Puzzlers will feel fit to be tied—Dog Tied: If Fido is tied to a 10-foot-long rope, and his bone is 15 feet away, how is it possible that he can reach and enjoy his bone without breaking or stretching the rope? (And yes—the rope IS tied to something.) There’s fun in finding the answer to this and other cool number-based problems. Dust off your mathematics and get solving. The intriguing enigmas include questions on interstellar communications, ancient geometry (Pythagoras and Plato), and even traffic patterns in Gridlock City. Or, play the Grasshopper Jumping Game. It’s all fascinating.",
        "Category": " Games , Puzzles",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "I Love You, Ronnie: The Letters of Ronald Reagan to Nancy Reagan",
        "Authors": "By Reagan, Ronald and Reagan, Nancy",
        "Description": "Starting in 1950, shortly after they met, and up through the 1990s, Ronald Reagan wrote letters to his wife, Nancy. In this book, those letters are woven into a portrait of a long and loving marriage, as Nancy Reagan shares not only the letters but also her reflections on them, and on the life that she and Ronald Reagan shared, from courtship, young marriage, and the White House years on through to her life today.This book offers insight into one of America's most famous couples and into the love story they lived. Through letters and reflections, the characters, personalities, and lives of an American president and his first lady are revealed. Over half a century, we see how Ronald Reagan wrote from the heart to the person he was closest to. Nancy Reagan comments on the letters, and writes with love and insight about her husband and the many phases of their life together. She describes how they met and fell in love and how their love grew over a long, eventful, and happy marriage, and she recalls the central role that letters, as well as cards and telegrams, played in their lives. The private life of this couple comes alive in this American story.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Best Is Yet To Come",
        "Authors": "By Asmus, Dr. Barry",
        "Description": "",
        "Category": "",
        "Publisher": "AmeriPress",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Dorsey Dictionary of American Government and Politics",
        "Authors": "By Shafritz, Jay M.",
        "Description": "",
        "Category": "",
        "Publisher": "Dorsey Press",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Eating on the Run",
        "Authors": "By Tribole, Evelyn",
        "Description": "",
        "Category": "",
        "Publisher": "Leisure Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Discovering Homeopathy: Your Introduction to the Science and Art of Homeopathic Medicine Second Revised Edition",
        "Authors": "By Ullman, Dana",
        "Description": "Dana Ullman, one of the leading advocates of homeopathic medicine, has produced a comprehensive, lucid introduction to this branch of complementary medicine, covering the history and the philosophy of homeopathy as well as scientific evidence supporting its effectiveness for a variety of conditions. A detailed discussion of the effectiveness and the limits of homeopathy in the treatment of infectious disease, allergies, chronic diseases, psychological conditions and dentistry, as well as its applications in pregnancy and labor, women's health, pediatrics and sports medicine follows.",
        "Category": " Health & Fitness , Homeopathy",
        "Publisher": "North Atlantic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "How Networks Work",
        "Authors": "By Freed, Les, Derfler, Frank J., and Troller, Michael",
        "Description": "An illustrated guide to understanding and using PC-based computer networks provides a complete history of network technology and presents an overview of Local Area Networks. Original.",
        "Category": " Computers , General",
        "Publisher": "Ziff-Davis Press",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Seafood Cookbook",
        "Authors": "By Hansen, Patricia",
        "Description": "",
        "Category": "",
        "Publisher": "Castle Books",
        "Price Starting With ($)": "6.52",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Naked Came the Manatee",
        "Authors": "By Hiaasen, Carl, Leonard, Elmore, Barry, Dave, Standiford, Les, Buchanan, Edna, Due, Tananarive, Dufresne, John, Levine, Paul, Hall, James W., Hendricks, Vicki, Hiaasen, Carl (EDT), Antoni, Brian, Hospital, Carolina, and Mayerson, Evelyn",
        "Description": "In South Florida, everyone wants to get a head. But not just any head. A very famous human head--severed and snugged away in a cryonic container. A head that could spark a revolution and change the course of history.Everybody wants a piece of the noggin: rotund gangster Big Joey G., a 102-year-old environmentalist, hard-boiled Miami reporter Britt Montero, lawyer Jake Lassiter,  and a would-be dictator in exile--with ex-president Jimmy Carter and a lovable manatee named Booger thrown in for good measure.With bodies piling up it's anybody's guess what will happen from one chapter to the next, as an all-star line-up of Florida's finest writers take turns at taking this outrageously original novel to the limit--and beyond.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "One, by One, by One: Facing the Holocaust",
        "Authors": "By Miller, Judith",
        "Description": "Six million Jews died in Europe, and the Holocaust lives on in the minds of those individuals who survived the worst genocide the world has ever known.One, by One, by One is a masterwork—a stark and haunting exploration of how people rationalize history, how rationalization gives birth to lies, how the victims are blamed, and history's horrors are forgotten.",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Sea power and its meaning, (The Watts sea power library)",
        "Authors": "By Clark, Joseph James",
        "Description": "",
        "Category": "",
        "Publisher": "F. Watts",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Lee and Jackson: Confederate chieftains",
        "Authors": "By Casdorph, Paul D.",
        "Description": "Robert E. Lee and Thomas \"Stonewall\" Jackson comprised one of the greatest collaborations in American military history. This, the first biography to examine them both, probes the private lives and public careers of these consummate soldiers to find out just what the secret behind their extraordinary success was.They were men of starkly different personalities, but their contrasting characters superbly complemented one another, so that together they fought the Union machine to a standstill. Robert E. Lee, the son of an aristocratic southern family, attended West Point and married a great-granddaughter of Martha Washington. By the Civil War he was already one of the country's greatest generals, a hero of the Mexican War who, ironically, had been offered field command of the Union Army. \"Stonewall\" Jackson, a devout Calvinist, was a rigid man whose troops more often felt admiration than affection toward him. He met Lee at West Point when he was a cadet and Lee an engineering officer; Jackson was also a veteran of the Mexican War and was to become Lee's strong right arm. They joined forces in the spring of 1862 in the Seven Days battles at Richmond and went on to dazzling victories at Second Manassas, Fredericksburg, and Chancellorsville. Their combined military genius almost won the war, but Jackson's tragic death - mortally wounded by the fire of his own men - spelled the beginning of the end of the Confederacy.Paul Casdorph's extensively researched and sweeping biography brings the legend of these two Southern heroes to life. With sparkling accounts of the Civil War campaigns and an insightful look at the role the Mexican War had in shaping the military thinking of these two men, Lee and Jackson sheds new light and understanding on these remarkable generals and the reasons for their unparalleled success on the battlefield.",
        "Category": "",
        "Publisher": "Paragon House",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Knopf Guide: Paris (Knopf Guides)",
        "Authors": "By Lefebvre, Clotilde (EDT) and Wanger, Shelley (EDT)",
        "Description": "Describes the history and culture of Paris, shares the impressions of past visitors, and recommends hotels and restaurants",
        "Category": " Travel , Europe , France",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Maybe the Moon: A Novel",
        "Authors": "By Maupin, Armistead",
        "Description": "Maybe the Moon, Armistead Maupin&#39;s first novel since ending his bestselling Tales of the City series, is the audaciously original chronicle of Cadence Roth -- Hollywood actress, singer, iconoclast and former Guiness Book record holder as the world&#39;s shortest woman.  All of 31 inches tall, Cady is a true survivor in a town where -- as she says -- \"you can die of encouragement.\" Her early starring role as a lovable elf in an immensely popular American film proved a major disappointment, since moviegoers never saw the face behind the stifling rubber suit she was required to wear. Now, after a decade of hollow promises from the Industry, she is reduced to performing at birthday parties and bat mitzvahs as she waits for the miracle that will finally make her a star.  In a series of mordantly funny journal entries, Maupin tracks his spunky heroine across the saffron-hazed wasteland of Los Angeles -- from her all-too-infrequent meetings with agents and studio moguls to her regular harrowing encounters with small children, large dogs and human ignorance. Then one day a lanky piano player saunters into Cady&#39;s life, unleashing heady new emotions, and she finds herself going for broke, shooting the moon with a scheme so harebrained and daring that it just might succeed. Her accomplice in the venture is her best friend, Jeff, a gay waiter who sees Cady&#39;s struggle for visibility as a natural extension of his own war against the Hollywood Closet.  As clear-eyed as it is charming, Maybe the Moon is a modern parable about the mythology of the movies and the toll it exacts from it participants on both sides of the screen. It is a work that speaks to the resilience of the human spirit from a perspective rarely found in literature.",
        "Category": " Fiction , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "This Is Our Seder",
        "Authors": "By Roraback, Robin (ILT) and Hildebrandt, Ziporah",
        "Description": "A simple description of the food and activities at a Seder, the ritual meal of Passover, including an explanation of their historical and symbolic significance",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Other, Religious",
        "Publisher": "Holiday House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Travels",
        "Authors": "By Crichton, Michael",
        "Description": "Often I feel I go to some distant region of the world to be reminded of who I really am.When Michael Crichton -- a Harvard-trained physician, bestselling novelist, and successful movie director -- began to feel isolated in his own life, he decided to widen his horizons. He tracked wild animals in the jungles of Rwanda. He climbed Kilimanjaro and Mayan pyramids. He trekked across a landslide in Pakistan. He swam amid sharks in Tahiti.Fueled by a powerful curiosity and the need to see, feel, and hear firsthand and close-up, Michael Crichton has experienced adventures as compelling as those he created in his books and films. These adventures -- both physical and spiritual -- are recorded here in Travels, Crichton's most astonishing and personal work.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "News Gathering",
        "Authors": "By Metzler, Ken",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "A Year By The Sea: Thoughts of an Unfinished Woman",
        "Authors": "By Anderson, Joan",
        "Description": "The basis for the major motion picture of the same name. An entrancing memoir of how one woman's journey of self-discovery gave her the courage to persevere in re-creating her life. Life is a work in progress, as ever-changing as a sandy shoreline along the beach. During the years Joan Anderson was a loving wife and supportive mother, she had slowly and unconsciously replaced her own dreams with the needs of her family. With her sons grown, however, she realized that the family no longer centered on the home she provided, and her relationship with her husband had become stagnant. Like many women in her situation, Joan realized that she had neglected to nurture herself and, worse, to envision fulfilling goals for her future. As her husband received a wonderful job opportunity out-of-state, it seemed that the best part of her own life was finished. Shocking both of them, she refused to follow him to his new job and decided to retreat to a family cottage on Cape Cod. At first casting about for direction, Joan soon began to take pleasure in her surroundings and call on resources she didn't realize she had. Over the course of a year, she gradually discovered that her life as an \"unfinished woman\" was full of possibilities. Out of that magical, difficult, transformative year came A Year by the Sea, a record of her experiences and a treasury of wisdom for readers.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Gospel According to Paul: The Creative Genius Who Brought Jesus to the World",
        "Authors": "By Griffith-Jones, Robin",
        "Description": "In this compelling portrait of Paul the man, his message, and his world, Robin Griffith-Jones reveals the apostle as a brilliantly entrepreneurial witness to the transforming presence of Jesus himself. This groundbreaking book unlocks Paul′s letters, revealing their purpose and power as never before.",
        "Category": " Religion , Biblical Studies , New Testament , Paul's Letters",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.33",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Acheson Country: A Memoir",
        "Authors": "By Acheson, David C.",
        "Description": "The architect of U.S. foreign policy after World War II goes behind the scenes for a warm, intimate view of his home, family, and such friends as President Truman and Justice Felix Frankfurter.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Anthropology and Contemporary Human Problems",
        "Authors": "By Bodley, John H.",
        "Description": "",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Mayfield Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "How to Survive Your Freshman Year: By Hundreds of College Sophmores, Juniors, and Seniors Who Did (Hundreds of Heads Survival Guides)",
        "Authors": "By Kaufmann, Yadin (EDT) and Bernstein, Mark W. (EDT)",
        "Description": "",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Hundreds of Heads Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Royal House of Windsor",
        "Authors": "By Elizabeth Longford",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Simplify Your Work Life: Ways to Change the Way You Work so You Have More Time to Live",
        "Authors": "By ST. James Elaine",
        "Description": "With more than two million copies of the Simplify series books in print--now there are two million and one reasons to simplify, simplify, simplify. Elaine St. James' Simplify series has taught the world how to start doing less and enjoying it more. Now Elaine teaches us to balance one of life's most difficult areas: the work world. Filled with tremendously helpful advice, and easy yet profoundly smart suggestions, her new book shows us big and small ways to scale down and simplify life on the job, such as:  Breaking the habit of bringing work home from the office Estimating the time it will take to complete a project, then double the estimate Cutting back on the amount of time you spend working Learning how to make the right decisions quickly Written in the same upbeat, relaxed, and matter-of-fact tone that won millions of readers to the simplicity movement, Simplify Your Work Life is certain to attract even more followers. Elaine's syndicated weekly column Simplify Your Life is carried in 50 newspapers nationwide and is read by more than 2 million fans each week.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Psychoanalysis for Teachers and Parents",
        "Authors": "By Anna and Low, Barbara Freud",
        "Description": "",
        "Category": "",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "June Roth's Fast and Fancy Cookbook",
        "Authors": "By June Spiewak Roth",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Publications",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Enjoying Where You Are on the Way to Where You Are Going: Learning How to Live a Joyful Spirit-Led Life",
        "Authors": "By Meyer, Joyce",
        "Description": "Learn How to Live a Joyful Spirit-Led Life! Are you enjoying every day of your life? Or do you tell yourself and others that you will find happiness once you have reached a specific goal or position in life? Jesus came so that we might have and enjoy life (John 10:10). Joy is a fruit of the Spirit. If you have not been enjoying your life to the fullest, it is time to begin! In this book, Joyce Meyer combines biblical principles with personal experiences for a powerful teaching on how to enjoy every day on your journey through life. By applying the principles outlined in this book, you will learn: * How to make the decision to enjoy life * How to rid yourself of regret and dread * How to experience the simplicity of life * How to find joy during times of waiting * How to finish your course with joy * Plus much more! Enjoying life is not based on enjoyable circumstances. It is an attitude of your heart. So learn how to enjoy where you are on the way to where you are going today!",
        "Category": " Religion , Christian Living , General",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "10 Sure Signs a Movie Character is Doomed: And Other Surprising Movie Lists",
        "Authors": "By Roeper, Richard",
        "Description": "Film critic Richard Roeper has seen thousands and thousands of films -- and not all of them were pretty. But as a result he's stored up enough movie knowledge to write this hilarious collection of movie lists. Some of the irreverent, offbeat, and inventive lists in this book are:* 5 Things That Happen When a Wrongly Accused Fugitive Walks into a Bar, a Restaurant, or a Convenience Store* Age Difference Between Michael Douglas and His Leading Ladies* 11 Movies that Employed James Brown's \"(I Got You) I Feel Good\" to Indicate that a Character Feels Good!* 5 Reasons Why George Bailey Isn't Such a Wonderful Guy in It's a Wonderful Life* 7 Films in Which Ben Affleck Cries Like a Big Fat Baby* The Gross-Out Hall of Fame* 13 Great Perks of Being a Movie CharacterAnd so many more . . .",
        "Category": " Performing Arts , Film & Video , Guides & Reviews",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "101 Corporate Haiku",
        "Authors": "By Warriner, William",
        "Description": "From Asia we've learned the Art of War, the Tao of Leadership, kaizen, and even how Confucius would ask for a raise. But we haven't learned the most important secret of corporate life: how to keep our sense of humor.Traditional Japanese haiku combine natural images, metaphors, and a flash of insight, all in three short lines. With 101 Corporate Haiku, longtime business consultant and Asia-watcher William Warriner brings this time-honored tradition to the office. His slightly subversive verses have been circulating among managers for months, popping up on bulletin boards and fax machines from coast to coast. Here they are collected for the first time, bringing a healthy dose of sunlight into the corporate world.",
        "Category": " Business & Economics , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Lost Nation",
        "Authors": "By Lent, Jeffrey",
        "Description": "Lost Nation opens with a man known only as Blood guiding an oxcart of rum toward the wild country high in New Hampshire, an ungoverned territory called the Indian Stream - a land where the luckless or outlawed have made a fresh start. Blood is a man of contradictions, of learning and wisdom, but also a man with a secret past that has scorched his soul. He sets forth to establish himself as a trader, hauling with him Sally, a sixteen-year-old girl won from the madam of a brothel over a game of cards. Their arrival in the Indian Stream triggers an escalating series of clashes that serve to sever the master-servant bond between them and offers both a second chance at life. But as the conflicts within the community spill over and attract the attention of outside authorities, Blood becomes a target for those seeking easy blame for the troubles. As plots unravel and violence escalates, two young men of uncertain identity appear, and Blood is forced to confront dread apparitions of his past while Sally is offered a final escape.",
        "Category": " Fiction , Historical",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Music of the Spheres",
        "Authors": "By Redfern, Elizabeth",
        "Description": "In the London of 1795, intrigue and death walk the dark streets. England is at war with its neighbor and nemesis, France, and espionage is rampant. It is the job of Jonathan Absey at the Home Office to catch these spies, but his mind is elsewhere, his dreams haunted by the still unsolved murder of his fifteen-year-old daughter in these same streets. Desperately pursuing both investigations, he stumbles across a strange society of astronomers called the Company of Titius who are on a furious search of their own: to discover a long-lost star in the wide black sky. Soon, as he digs into their arcane world, their quest begins to merge with his own, and Absey finds himself discovering more than he had ever imagined - not only about spies and murderers but also about celestial numbers and the making of codes; about passions as unnatural as they are obsessive; and about the bonds of family...and the lengths we will go to preserve them.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Villa",
        "Authors": "By Roberts, Nora",
        "Description": "The top PR executive for the family winery, Sophia Giambelli finds her life turned upside down by the merger with the MacMillan family's winery, her powerful attraction to professional rival Tyler MacMillan, and acts of sabotage that threaten the family business and members of the family itself. 750,000 first printing.",
        "Category": " Fiction , Romance , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Noble house: A Novel of Contemporary Hong Kong",
        "Authors": "By Clavell, James",
        "Description": "",
        "Category": "",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "7.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Bump and Run",
        "Authors": "By Lupica, Mike",
        "Description": "After inheriting half of the New York Hawks, Las Vegas player Jack Molloy is thrust head-first into the wild world of professional football, contending with steroids, corruption, sportswriters, tough coaches, and gambling. 60,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Wolf Files: Adventures in Weird News (Humor)",
        "Authors": "By Wolf, Buck",
        "Description": "Does Michael Jackson dig bagels? Has the Stanley Cup been used as adog-food bowl? Is Monica Lewinsky related to Princess Diana? Aremosquitoes more likely to bite you if you're blonde? The answer to allthese questions is yes - and Buck Wolf of ABCNEWS.com can explain why. For the past five years, journalist Buck Wolf has been taking readers ona singular journey along the outer fringes of pop culture. In The WolfFiles, you'll meet Dracula's last surviving relative, Americans who havemummified their loved ones, and parents who have sold their children'snames to the highest bidder. Buck had the distinction of being the reporter who sat with MichaelJackson on his first visit to a synagogue. He's debated Bozo in a heatedargument over the history of clowning. And he's taken the NHL's StanleyCup on a personal tour of Manhattan. Buck has also given Jennifer Lopez, Britney Spears and Sarah JessicaParker a dressing down, with biting comic commentary as a member of Usmagazine's Fashion Police. You'll laugh your way through this popculture experience - the best of The Wolf Files.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Family Circle Quick and Easy Recipes: More Than 300 Tasty, Easy-to-Make Recipes Plus 75 Photos",
        "Authors": "By Family Circle Books",
        "Description": "Provides recipes for soups, salads, pasta dishes, main dishes, vegetables, and desserts.",
        "Category": " Cooking , General",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "A Child'S First Bible (New Edition) (Baby's First)",
        "Authors": "By Grand, Dee Ann",
        "Description": "Explains why people go to church to worship God, and describes some of the activities that are part of religious services.",
        "Category": " Juvenile Fiction , Religious , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Trends Perfect Bed & Bathroom",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Sunset Books Inc",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Mastering Windows Nt Workstation 4",
        "Authors": "By Minasi, Mark and Phillips, Todd",
        "Description": "",
        "Category": " Computers , Operating Systems , General",
        "Publisher": "Sybex Inc",
        "Price Starting With ($)": "21.25",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    }
]