[
    {
        "Title": "High School Musical (Tokyopop Cine-Manga)",
        "Authors": "By Disney",
        "Description": "A shy, studious student and the captain of the basketball team secretly audition for the school musical leads.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "TokyoPop",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Practical English-Japanese Dictionary",
        "Authors": "By Brannen, Noah S.",
        "Description": "",
        "Category": " Foreign Language Study , Japanese",
        "Publisher": "Weatherhill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Lottery Rose",
        "Authors": "By Hunt, Irene",
        "Description": "The Newbery Award-winning author of Across Five Aprils and Up a Road Slowly presents the story of a young boy from a troubled family who learns what it means to love…Abused by his mother and her boyfriend, Georgie Burgess learns to hide his hurt. He withdraws into a safe and secret world of beautiful gardens filled with roses—just like those in the library book he treasures.When Georgie wins a small rosebush in a grocery store lottery he gives it all the love and caring he’s never had. Georgie’s life begins to open up for him when the courts send him to a home for boys where he will be safe. Slowly, and not without pain, Georgie learns to give—and to receive—love...",
        "Category": " Fiction , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Secrets of Dripping Fang, Book One (Value-Priced Edition): The Onts",
        "Authors": "By Greenburg, Dan and Fischer, Scott M. (ILT)",
        "Description": "Nobody wants to adopt the Shluffmuffin twins. Wally's feet stink something awful, and Cheyenne is allergic to everything. Then why are the Mandible sisters so eager to take them home? And what sort of old maids would choose to live in a place called Dripping Fang Forest, where zombies wander the woods singing \"Itsy Bitsy Spider\" and ten-foot-long glowing slugs want to suck the feet right off your ankles?Would it seem ungrateful of Wally to point out the Mandible sisters' extra arms? Or to question their all-chocolate, all-the-time menu? Or, um, to venture into the cellar, where the twins have been told to NEVER, EVER, EVER go?Yeah, perhaps that last bit was a mistake. Now there's nothing left for the Shluffmuffins to do but run--run for their lives!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Red Justice (Justice League (TM))",
        "Authors": "By Teitelbaum, Michael",
        "Description": "After successfully deactivating a dangerous nuclear reactor, the members of the Justice League cause a new problem that has them battling genetically engineered beings from a forgotten cryogenics laboratory in Russia.",
        "Category": " Juvenile Fiction , Comics & Graphic Novels , General",
        "Publisher": "Bantam Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Scarlet and Black: A Chronicle of the Nineteenth Century (Penguin Classics)",
        "Authors": "By Stendhal",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1953"
        }
    },
    {
        "Title": "Maxed Out: Hard Times, Easy Credit and the Era of Predatory Lenders",
        "Authors": "By Scurlock, James D.",
        "Description": "Foreclosures are hitting record highs; Americans are declaring bankruptcy at rates ten times that during the great Depression; more college students drop out because of debts than due to poor grades; reports of debtor suicides proliferate in the media. In other words, it's a great time to be in the banking business.Maxed Out takes us on a road trip that is sometimes hysterical and often horrifying: from Las Vegas to the Bible Belt, from the backwoods to inner cities, where the world's largest financial giants troll for their next victims. Welcome to a country populated by debt pirates, corporate predators, human credit card billboards, debt evangelists, megamillion-dollar spec homes, and, of course, trillions of dollars of easy credit.Combining startling facts with even more startling examinations of individuals, institutions, the government, and modern religion, James Scurlock separates the myths (there is \"good debt\" and \"bad debt\") from the harsh reality (corporations partner with colleges to target today's youth; credit reports are riddled with errors that will never be fixed; and death, for many of those in trouble, is the only way out).At a time when the financial industry posts ever-higher profits even as its clients drown in the flood of easy credit, Scurlock exposes very real, potentially disastrous systems and policies that are consuming millions of Americans. Maxed Out takes readers on a wickedly smart and entertaining tour of what one interviewee calls \"the last taboo.\"",
        "Category": " Business & Economics , Banks & Banking",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Famous Investigators (Real Life Stories)",
        "Authors": "By Deming, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Strike Force: A Novel",
        "Authors": "By Brown, Dale",
        "Description": "The Battle For Control Of Iran . . . Begins In SpaceWhen a disgraced former Iranian military chief of staff engineers an insurgency that threatens to destroy the theocratic regime in Iran, a new era appears to be dawning in the Middle East. But one must be wary of old enemies . . .On the run from the Pasdaran, the theocrat's terror army, and unable to count on support from his friends in the regular army, Iranian rebel leader General Hesarak al-Kan Buzhazi desperately turns to his old nemesis, U.S. Air Force Lieutenant-General Patrick McLanahan, for help. Unwilling to commit American forces in an Iranian civil war, and with time running out, the U.S. president authorizes McLanahan to utilize a new, top-secret fleet of globe-crossing spaceplanes, the XR-A9 Black Stallions, led by test pilot and astronaut Captain Hunter Noble. Within hours, McLanahan's Air Battle Force turns the tide, possibly changing the course of history in the Middle East for generations.The advent of almost instantaneous global reach, along with the reactivation of America's first military space station, Silver Tower, has rekindled fears of a space arms race, and the growing insurgency in Iran is threatening to erupt into a worldwide jihad. But McLanahan finds himself embroiled in even more bitter battles at the White House, between those who support his space-based military initiative and those who are working secretly to undermine it. When McLanahan is forced to concentrate on his political and personal battles back at home, it's left to Hunter Noble and his team of young American space engineers to keep the fires of freedom in the Middle East from exploding completely out of control. Filled with the latest cutting-edge weaponry, geopolitical intrigue, high-flying suspense, and a colorful cast of characters, Strike Force is New York Times bestselling master Dale Brown at his best.",
        "Category": " Fiction , War & Military",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "What Would Jesus Eat? The Ultimate Program For Eating Well, Feeling Great, And Living Longer",
        "Authors": "By Colbert, Don",
        "Description": "The Christian market is flooded with diet and exercise programs, each claiming to be \"God's way\" to healthy living. While some of them are based on biblical principles, and some have even proven effective for weight loss, there is not one program leading the pack daring to answer the question What Would Jesus Do? Or better yet,What Would Jesus Eat?This comprehensive eating plan examines Scripture and reveals what we know Jesus ate and what we can confidently infer He ate. Using current medical research,What Would Jesus Eat? demonstrates why the diet Jesus followed is ideal for twenty-first century living as well. Readers will:Understand why foods forbidden in the Old Testament dietary laws are unhealthy for us.Learn how to follow Jesus' eating model with foods that are available todayRealize the health benefits of the food Jesus ate and the health risks of the food He avoided.The second half of the book equips the reader with tools to effectively follow the plan -- recipes, nutritional information, and practical advice.For those desiring to safely lose weight and for those seeking a healthier, Bible-based eating program, the only question to ask is,What Would Jesus Eat?",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Chase (An Isaac Bell Adventure)",
        "Authors": "By Cussler, Clive",
        "Description": "For decades, Clive Cussler has been delighting readers with novels filled with suspense, action, and sheer audacity. Now he does it again, in one of the wildest, most entertaining historical thrillers in years.  April 1950: The rusting hulk of a steam locomotive rises from the deep waters of a Montana lake. Inside is all that remains of three men who died forty-four years before. But it is not the engine or its grisly contents that interest the people watching nearby. It is what is about to come next . . .  1906: For two years, the western states of America have been suffering an extraordinary crime spree: a string of bank robberies by a single man who cold- bloodedly murders any and all witnesses and then vanishes without a trace. Fed up by the depredations of the \"Butcher Bandit,\" the U.S. government brings in the best man they can find-a tall, lean, no-nonsense detective named Isaac Bell, who has caught thieves and killers coast to coast.  But Bell has never had a challenge like this one. From Arizona to Colorado to the streets of San Francisco during its calamitous earthquake and fire, he pursues what is quickly becoming clear to him is the sharpest criminal mind he has ever encountered, and the woman who seems to hold the key to the bandit's identity. Using science, deduction, and intuition, Bell repeatedly draws near only to grasp at thin air, but at least he knows his pursuit is having an effect. Because his quarry is getting angry now, and has turned the chase back on him. The hunter has become the hunted. And soon it will take all of Isaac Bell's skills not merely to prevail . . . but to survive.  Filled with intricate plotting, dazzling signature set pieces, and not one but two extraordinary villains, this is the work of a master writing at the height of his powers.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Bad Fads",
        "Authors": "By Long, Mark A.",
        "Description": "What do you say to a hilarious tour of the coolest trends and baddest fads of the century? An A-to-Z ride on the pop culture waves that have made us what we are, Bad Fads takes you from the flapper styles of the 20s to the genius-defying Rubik's cube, from thigh-spilling hotpants to the rise (and fall) of the toga party, from the Ouija board to Pac-Man mania. In this retro-ramble, Mark Long goes behind the trends, revealing their obscure beginnings, their often unlikely paths to popularity, and their inevitable - and humiliating! - tumbles into the dusty warehouse of history. A must-have for any observer of the crazy games we all play, Bad Fads illustrates the very heart of our bizarre and ever-changing culture.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "ECW Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Devil May Cry (Dark-Hunter, Book 11)",
        "Authors": "By Kenyon, Sherrilyn",
        "Description": "Sin, an ancient Sumerian god, was one of the most powerful among his pantheon until the night Artemis stole his godhood by trickery and left him one step from death. Trust of any kind died in him that night, as well. For millennia, this ex-god turned Dark-Hunter has dreamed only of regaining his powers and seeking revenge on Artemis. If only life were that simple.Unfortunately, he has bigger fish - or in Sin's case, demons - to fry. The lethal gallu that were buried by his pantheon are now stirring, and they are hungry for human flesh. Their goal is to destroy mankind and anyone else who gets in their way. Sin is the only one who can stop them - that is, if a certain woman doesn't kill him first. Unfortunately, Sin discovers that he must now rely on her or witness an annihilation of biblical proportions.Enemies have always made strange bedfellows, but never more so than when the fate of the world hangs in the balance. Now a man who knows only betrayal must trust the one person most likely to hand him to the demons. Artemis may have stolen his godhood, but this one has stolen his heart. The only question is: Will she keep it or feed it to the ones who want him dead?",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "St Martins Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "The Homework Machine",
        "Authors": "By Gutman, Dan",
        "Description": "Doing homework becomes a thing of the past!   Meet the D Squad, a foursome of fifth graders at the Grand Canyon School made up of a geek, a class clown, a teacher's pet, and a slacker. They are bound together by one very big secret: the homework machine. Because the machine, code-named Belch, is doing their homework for them, they start spending a lot of time together, attracting a lot of attention. And attention is exactly what you don't want when you are keeping a secret.   Before long, things start to get out of control, and Belch becomes much more powerful than they ever imagined. Now the kids are in a race against their own creation, and the loser could end up in jail...or worse!",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Berry Big Storm (Strawberry Shortcake)",
        "Authors": "By Querol, Marga (ILT), Bryant, Megan E., and Santanach, Celestino (ILT)",
        "Description": "Uh-oh!- A huge spring rainstorm hits Strawberryland, and Huckleberry Pie's fort is flooded! There's a big mess to clean up, but Strawberry Shortcake and her friends know that even the hardest jobs are easier to tackle when everyone works together. Since all the kids help out, Huckleberry's fort gets fixed up in no time-and ends up even better than before!  Illustrated by Marga Querol and Tino Santanach.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Rebecca of Sunnybrook Farm (Troll Illustrated Classics)",
        "Authors": "By Wiggin, Kate Douglas Smith, Elwell, Peter (ILT), and Hinkle, Don",
        "Description": "Talkative, ten-year-old Rebecca goes to live with her spinster aunts, one harsh and demanding, the other soft and sentimental, with whom she spends seven difficult but rewarding years growing up.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Among the Free (Shadow Children)",
        "Authors": "By Haddix, Margaret Peterson",
        "Description": "ENOUGH GAMES.   Luke Garner is a third-born in a restrictive society that allows only two children per family. Risking his life, he came out of hiding to fight against the Population Police laws. Now, in the final volume of Margaret Peterson Haddix's suspenseful Shadow Children series, Luke inadvertently sets off a rebellion that results in the overthrow of the government. The people are finally free. But who is in charge now? And will this new freedom be everything they had hoped?",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Sisters of the Raven",
        "Authors": "By Hambly, Barbara",
        "Description": "The Yellow City is in crisis. The wells are running dry, and the Sun Mages have been unable to call the rains. Frustrated Mages across the land can no longer work the magic that once ran their empire. Now the magic lies solely in the hands of a few women--the first ever to have developed magical powers.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Aspect",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The Dream Life of Sukhanov",
        "Authors": "By Grushin, Olga",
        "Description": "Olga Grushin&#146;s astonishing literary debut has won her comparisons with everyone from Gogol to Nabokov. A virtuoso study in betrayal and its consequences, it explores&#151;really, colonizes&#151;the consciousness of Anatoly Sukhanov, who many years before abandoned the precarious existence of an underground artist for the perks of a Soviet apparatchik. But, at the age of 56, his perfect life is suddenly disintegrating. Buried dreams return to haunt him. New political alignments threaten to undo him. Vaulting effortlessly from the real to the surreal and from privilege to paranoia, The Dream Life of Sukhanov is a darkly funny, demonically entertaining novel.",
        "Category": " Fiction , Political",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Dinosaur Eggs (Penguin Young Readers, Level 3)",
        "Authors": "By Dussling, Jennifer and Johnson, Pamela (ILT)",
        "Description": "Several dinosaur hunters went on an expedition in South America hoping to find fossils of birds from the time of the dinosaurs. What they found instead were hundreds of fossils of dinosaur eggs, some with un-hatched baby dinosaurs inside. This was something that had never been found before! Here is a fascinating look at dinosaur egg fossils and dinosaurs in general, written in accessible language so kids can read it all by themselves.",
        "Category": " Juvenile Nonfiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Cat Who Had 60 Whiskers",
        "Authors": "By Braun, Lilian Jackson",
        "Description": "Times are changing in Pickax, and it all makes for some newsworthy notes for the \"Qwill Pen.\" A new senior center is in the works, and a frisky production of Cats is set to delight Moose County residents, human and feline alike. Polly Duncan is off to Paris, momentarily leaving Qwill without a companion for his apple-barn concerts, and The Librarians Who Lunch are getting ready to put on a show of their spectacular Art Hats to help unite Pickax with their Lockmaster County neighbors.Not to mention the conversion of the late Nathan Ledfield's mansion into a charitable museum. Mr. Ledfield's treasures are being sold off to benefit needy children, and the town is abuzz with excitement - that is, until a mysterious death from a bee sting leaves everyone but Cool Koko in a state of confusion.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Sweet Potato Queens' Field Guide to Men: Every Man I Love Is Either Married, Gay, or Dead",
        "Authors": "By Browne, Jill Conner",
        "Description": "If the Nobel committee offered awards in Gender Relations, the Sweet Potato Queens would have the prize all locked up. These fine ladies have devoted an absolutely inordinate amount of time to the pursuit of love, marriage, and great sex, and they’re just bursting to share their stories. Now their royal ringleader, bestselling author Jill Conner Browne, brings you The Sweet Potato Queens’ Field Guide to Men, a hilarious (and highly instructive) handbook about the men we love to hate, and the ones we love to love, with special revelations about:Why he didn’t callThe sweetest revenge everThe downright crazy things we will do for romancePlus, memorable tales of Queenly dating adventures, the shameless lowdown on looking as young as you feel, and more royal recipes that are guaranteed to bring him home each and every night.",
        "Category": " Humor , Topic , Men, Women & Relationships",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "East Is East (Contemporary American Fiction)",
        "Authors": "By Boyle, T. Coraghessan",
        "Description": "Young Japanese seaman Hiro Tanaka, inspired by dreams of the City of Brotherly Love and trained in the ways of the samurai, jumps ship off the coast of Georgia and swims into a net of rabid rednecks, genteel ladies, descendants of slaves, and the denizens of an artists' colony. In the hands of T. Coraghessan Boyle, praised by Digby Diehl in Playboy as \"one of the most exciting young fiction writers in America,\" the result is a sexy, hilarious tragicomedy of thwarted expectations and mistaken identity, love, jealousy, and betrayal.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Home For Christmas: Heart Full of Love/Ride the Clouds/Don't Look Back/To Keep Me Warm (Heartsong Novella Collection)",
        "Authors": "By Coble, Colleen (EDT)",
        "Description": "",
        "Category": " Fiction , Religious",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Counterplay",
        "Authors": "By Tanenbaum, Robert K.",
        "Description": "When betrayal results in the cold-blooded murder of a busload of schoolchildren to accomplish the escape from custody of vicious sociopath Andrew Kane, New York District Attorney Butch Karp finds himself embroiled in a raging quest for vengeance that could cost him, his family, and thousands of others their lives. With an intensive manhunt ongoing for the fugitive Kane, Karp and long-time colleague Ray Guma open a cold case and pursue murder charges against wealthy Manhattan power broker/banker Emil Stavros, whose socialise wife disappeared nearly fifteen years earlier.Meanwhile, Karp's wife, Marlene Ciampi, has let her fascination with her husband's lesser-known family comprised of Russian gangsters pull her into a dangerous world of Islamic terrorists, Chechen rebels, and Russian agents engaged in nefarious events straight out of today's real-world headlines.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Death on the Dragon's Tongue (Penny Spring and Sir Toby Glendower Mysteries)",
        "Authors": "By Arnold, Margot",
        "Description": "The French government plans to locate a nuclear reactor on the site of a prehistoric burial monument on the Brittany Coast. Plans are interrupted when an official is murdered--in circumstances that bear unmistakable signs of witchcraft.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Thumbsucker: A Novel",
        "Authors": "By Kirn, Walter",
        "Description": "This eighties-centric, Ritalin-fueled, pitch-perfect comic novel by a writer to watch brings energy and originality to the classic Midwestern coming-of-age story.Meet Justin Cobb, \"the King Kong of oral obsessives\" (as his dentist dubs him) and the most appealingly bright and screwed-up fictional adolescent since Holden Caulfield donned his hunter's cap. For years, no remedy--not orthodontia, not the escalating threats of his father, Mike, a washed-out linebacker turned sporting goods entrepreneur, not the noxious cayenne pepper-based Suk-No-Mor--can cure Justin's thumbsucking habit.Then a course of hypnosis seemingly does the trick, but true to the conservation of neurotic energy, the problem doesn't so much disappear as relocate. Sex, substance abuse, speech team, fly-fishing, honest work, even Mormonism--Justin throws himself into each pursuit with a hyperactive energy that even his daily Ritalin dose does little to blunt.Each time, however, he discovers that there is no escaping the unruly imperatives of his self and the confines of his deeply eccentric family. The only \"cure\" for the adolescent condition is time and distance.Always funny, sometimes hilariously so, occasionally poignant, and even disturbing, deeply wise on the vexed subject of fathers and sons, Walter Kirn's Thumbsucker is an utterly fresh and all-American take on the painful process of growing up.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Girl's Guide to Witchcraft (Red Dress Ink)",
        "Authors": "By Klasky, Mindy L.",
        "Description": "Which is more unlikely?Meeting a single, straight, reasonably attractive, willing-to-commit man?Or discovering a secret cache of magic books?For good girl Jane Madison, neither has a shot in hell of coming true—until the day she finds a hidden room&#133;.Now she's done a bit of experimenting and found a spell that makes her irresistible to men—even those who have previously ignored her. And another that turns a cat into her witch's familiar (a snarky, critical, self-absorbed man—pretty much a typical male). Though her impulsive acts of magic have brought a warder (sexy, grouchy, elusive and determined to stop her from using magic) down on her, Jane's not willing to let go of this fantastic new life.Though she wonders about having things that aren't \"real,\" she's having too much fun to stop. After all, no one ever said being a witch was easy&#133;.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Becoming Me: Caitlin: Book 1 (Diary of a Teenage Girl)",
        "Authors": "By Carlson, Melody",
        "Description": "In the fictional Diary of a Teenage Girl, sixteen-year-old Caitlin O'Conner reveals the inner workings of a girl caught between childhood and womanhood ... an empty life without Christ and a meaningful one with Him. Through Caitlin's candid journal entries we see her grapple with such universal teen issues as peer pressure, loyalty, conflict with parents, the longing for a boyfriend, and her own spirituality. Follow Caitlin O'Conner, a girl much like yourself, as she makes her way from New Year's to the first day of summer -- surviving a challenging home life, changing friends, school pressures, an identity crisis, and the uncertainties of \"true love.\"  You'll cry with Caitlin as she experiences heartache, and cheer for her as she encounters a new reality in her life: God. See how rejection by one group can -- incredibly -- sometimes lead you to discover who you really are...",
        "Category": " Young Adult Fiction , Religious , Christian , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Motherless Brooklyn",
        "Authors": "By Lethem, Jonathan",
        "Description": "Winner of the National Book Critics Circle Award.A compelling and complusively readable riff on the classic detective novel from America's most inventive novelist. Brooklyn's very own self-appointed Human Freakshow, Lionel Essrog is an orphan whose Tourettic impulses drive him to bark, count, and rip apart our language in startling and original ways. Together with three veterans of the St. Vincent's Home for Boys, he works for small-time mobster Frank Minna's limo service cum detective agency. Life without Frank Minna, the charismatic King of Brooklyn, would be unimaginable, so who cares if the tasks he sets them are, well, not exactly legal. But when Frank is fatally stabbed, one of Lionel's colleagues lands in jail, the other two vie for his position, and the victim's widow skips town. Lionel's world is suddenly topsy-turvy, and this outcast who has trouble even conversing attempts to untangle the threads of the case while trying to keep the words straight in his head. Motherless Brooklyn is a brilliantly original, captivating homage to the classic detective novel by one of the most acclaimed writers of his generation.A New York Times Notable Book.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Borgia Bride: A Novel",
        "Authors": "By Kalogridis, Jeanne",
        "Description": "Vivacious Sancha of Aragon arrives in Rome newly wed to a member of the notorious Borgia dynasty. Surrounded by the city's opulence and political corruption, she befriends her glamorous and deceitful sister-in-law, Lucrezia, whose jealousy is as legendary as her beauty. Some say Lucrezia has poisoned her rivals, particularly those to whom her handsome brother, Cesare, has given his heart. So when Sancha falls under Cesare's irresistible spell, she must hide her secret or lose her life. Caught in the Borgias' sinister web, she summons her courage and uses her cunning to outwit them at their own game. Vividly interweaving historical detail with fiction, The Borgia Bride is a richly compelling tale of conspiracy, sexual intrigue, loyalty, and drama.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Double Agents (Men at War)",
        "Authors": "By Griffin, W. E. B. and Butterworth, William E.",
        "Description": "W. E. B. Griffin's iconoclastic OSS heroes face a historic challenge in the brand-new volume of the New York Times-bestselling series.  Critics and fans alike welcomed the return of the Men at War series with The Saboteurs. Now Canidy, Fulmar, and colleagues in the Office of Strategic Services face an even greater task-to convince Hitler and the Axis powers that the invasion of the European continent will take place anywhere but on the beaches of Nazi-occupied France. \"Wild Bill\" Donovan's men have several tactics in mind, but some of the people they must use are not the most reliable-are, in fact, most likely spying for both sides-so the deceptions require layer upon layer of intrigue, and all it will take is one slip to send the whole thing tumbling down like a house of cards. Are the OSS agents up to it? They certainly think so. And then the body is found floating off the coast of Spain. . . .  Filled to the brim with action and character, The Double Agents is irresistible storytelling from a military master.",
        "Category": " Fiction , War & Military",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Goldwhiskers (3) (Spy Mice)",
        "Authors": "By Frederick, Heather Vogel and Comport, Sally Wern (ILT)",
        "Description": "Winter break is off to an exciting start with Oz and D. B. jetting off to London for Oz¹s mom¹s opera premiere. And Glory Goldenleaf, private eye, comes along for a pleasure trip.  But this jolly holiday winds up being anything but when Goldwhiskers, the richest rat in the entire world, is discovered enslaving the orphan mice of Great Britain to do his thievery.  And when the Crown Jewels are stolen, Oz, D. B., and Glory are in store for a James-Bond-meets-Scotland-Yard kind of mission the likes of which the spy world has never seen!",
        "Category": " Juvenile Fiction , People & Places , Europe",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Dead Cat Bounce: A Home Repair is Homicide Mystery",
        "Authors": "By Graves, Sarah",
        "Description": "dead cat bounce n. Stock market jargon for a small, temporary rise in a stock's trading price after a sharp drop.Since she bought her rambling old fixer-upper of a house, Jacobia Tiptree has gotten used to finding things broken. But her latest problem isn't so easily repaired. Along with the rotting floor joists and sagging support beams, there's the little matter of the dead man in Jake's storeroom, an ice pick firmly planted in his cranium.Not much happens in her tiny Maine town, but that's about to change. Jake's unknown guest turns out to be a world-famous corporate raider, local boy turned billionaire Threnody McIlwaine. When Jake's best friend, quiet and dependable Ellie White, readily confesses to the murder, cops and journalists swarm into snowbound Eastport.Jake smells a cover-up, and begins poking into past history between McIlwaine and Ellie's family. But someone doesn't like nosy neighbors...and Jake's rustic refuge may become her final resting place.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Big Bad Wolf Tells All: A Novel",
        "Authors": "By Kauffman, Donna",
        "Description": "Why Is It That I’m Not Willing to Settle for a Sheep Like the Rest of My Friends?Sheep sex aside, what’s wrong with a man who puts family first, who maintains a steady job, has college funds set up for his kids and builds that nest egg for his retirement? Member of the herd, never straying. Solid, dependable Sheep Guy. Why can’t I love Sheep Guy?For me, it’s all those wolves. They distract me from the sheep. Wolf Guy. Always on the prowl. Totally alpha. Not interested in being domesticated. So what is it about these men that makes my heart speed up in a way no sheep ever has or ever will?Tanzy Harrington is the Bay Area’s most-read romance columnist and self-proclaimed love-’em-and-leave-’em artist—and she’s not quite ready to tie herself down to one man. That is, until Riley Parrish lands on the scene. When Tanzy agrees to house-sit for her eccentric great-aunt, she finds herself sharing close quarters with Riley. At first he seems a bit too much like the “sheep” Tanzy derides in her column—too polite, the classic boring good provider. But when she catches a glimpse of the “wolf” lurking in his eyes, the ultimate alpha female is about to take a fall.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Tail of Emily Windsnap",
        "Authors": "By Kessler, Liz and Gibb, Sarah (ILT)",
        "Description": "\"Liz Kessler makes a splash with this tightly written, highly imaginative debut.\" — FAMILYFUNFor as long as she can remember, twelve-year-old Emily Windsnap has lived on a boat. And, oddly enough, for just as long, her mother has seemed anxious to keep her away from the water. But when Mom finally agrees to let her take swimming lessons, Emily makes a startling discovery - about her own identity, the mysterious father she's never met, and the thrilling possibilities and perils shimmering deep below the water's surface. With a sure sense of suspense and richly imaginative details, first-time author Liz Kessler lures us into a glorious undersea world where mermaids study shipwrecks at school and Neptune rules with an iron trident - an enchanting fantasy about family secrets, loyal friendship, and the convention-defying power of love.",
        "Category": " Juvenile Fiction , Mermaids",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Solace of Leaving Early",
        "Authors": "By Kimmel, Haven",
        "Description": "Using small-town life as a springboard to explore the loftiest of ideas, Haven Kimmel’s irresistibly smart and generous first novel is at once a romance and a haunting meditation on grief and faith. Langston Braverman returns to Haddington, Indiana (pop. 3,062) after walking out on an academic career that has equipped her for little but lording it over other people. Amos Townsend is trying to minister to a congregation that would prefer simple affirmations to his esoteric brand of theology.What draws these difficult—if not impossible—people together are two wounded little girls who call themselves Immaculata and Epiphany. They are the daughters of Langston’s childhood friend and the witnesses to her murder. And their need for love is so urgent that neither Langston nor Amos can resist it, though they do their best to resist each other. Deftly walking the tightrope between tragedy and comedy, The Solace of Leaving Early is a joyous story about finding one’s better self through accepting the shortcomings of others.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The China Bride (The Bride Trilogy)",
        "Authors": "By Putney, Mary Jo",
        "Description": "Award-winning author Mary Jo Putney captivated the hearts of readers everywhere with her breathtaking hardcover debut, The Wild Child. Now, in her spectacular new novel The China Bride, she has created another brilliantly moving love story, and a very special heroine--a rare beauty torn between two cultures who valiantly struggles to discover the woman she is destined to be.Born to a Scottish father and now living in China, Troth Montgomery grew up speaking several languages and thinking of faraway England as home. Enduring life as a concubine, she never imagined that one day she would leave the Orient, arriving in bitter winter at the estate of a stranger--the brother of the man who had briefly been her husband. Kyle Renbourne, Viscount of Maxwell, had taken Troth as his bride shortly before his apparent execution in a Chinese prison. Now, as his widow, she is entitled to the home she always dreamed of but remains haunted by the memory of a dashing husband and the brief, forbidden love they shared.Then Kyle seemingly returns from the dead. Though he has survived, his mind and body are badly wounded. He needs time to heal and retreats from the exotic wife he barely knows. Bitterly aware that she will never be a fitting English wife, Troth defiantly embraces her foreign traditions, hoping that the ancient arts of her ancestors will restore Kyle's spirit and her own battered heart. Together they embark on a miraculous journey of hope and faith as Kyle becomes enchanted with the intimate tranquillity he shares with his bewitching Troth. But before he can win back his China bride, Kyle must first face a deadly menace that has followed them halfway across the world. . . .Written with exquisite elegance and gentle passion, The China Bride is a stirring tale of everlasting love and the power of forgiveness, by a master storyteller.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "New Mercies: A Novel",
        "Authors": "By Dallas, Sandra",
        "Description": "Natchez, Mississippi, in 1933 is a place suspended in time. The silver and china is still dented and cracked from Yankee invaders. And the houses have names...and memories. Nora Bondurant is running away--from her husband's death, from his secrets, and from the ghosts that dog her every step. When she receives a telegram informing her that she has an inheritance, Nora suddenly has somewhere to run to: a house named Avoca in Natchez, Mississippi. Now, she's learning that the lure of Natchez runs deep, and that, along with Avoca, she's inherited a mystery. Nora's aunt Amalia Bondurant was killed in a murder/suicide, and the locals are saying nothing more--except in hushed, honeyed tones. As Nora becomes more and more enmeshed in the community and in her family's history, she learns surprising things about the life and death of her aunt: kinship isn't always what it seems, loyalty can be as fierce as blood relations, and every day we are given new mercies to heal the pain of loss and love.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Bombshell",
        "Authors": "By Curnyn, Lynda",
        "Description": "With her best friend getting married, her job in danger, and her latest romance headed for disaster, gorgeous thirty-four-year-old marketing maven Grace Noonan, longing for a child, decides to take matters into her own hands by being artificially inseminated, until unexpected love catches her off guard. Original. 75,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Plain Talk About Genesis",
        "Authors": "By Reed, John K.",
        "Description": "",
        "Category": "",
        "Publisher": "Deo Volente Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Planet Cat: A Cat-alog",
        "Authors": "By Moore, Arden, Choron, Sandra, and Choron, Harry",
        "Description": "The cat’s out of the bag -- a delightful book on all things feline that no cat lover can afford to missFollowing in the paw prints of Planet Dog, here is the cat’s meow: a lively, entertaining, one-of-a-kind assemblage of more than 400 lists on all things cat. It’s all here, from the origins of the species to care and training to breeds and behavior to famous cats in history, art, and literature. The book even includes a list of celebrity cat people. Illustrated with more than 150 photographs and line drawings, this irresistible package is sure to delight cat lovers everywhere.How to say cat in 46 languagesHemingway’s catsCats who changed historyWhy cats paintTricks you can teach your catGreat gifts for the pampered catCat food recipesAn IQ test for your catHuman habits that drive cats crazyAnd more!",
        "Category": " Pets , Cats , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Coming Out",
        "Authors": "By Steel, Danielle",
        "Description": "Olympia Crawford Rubinstein has a busy legal career, a solid marriage, and a way  of managing her thriving family with grace, humor, and boundless energy. With twin  daughters finishing high school, a son at Dartmouth, and a kindergartner from her  second marriage, there seems to be no challenge to which Olympia cannot rise. Until  one sunny day in May, when she opens an invitation for her daughters to attend the  most exclusive coming-out ball in New York–and chaos erupts all around her.  One  twin’s excitement is balanced by the other’s outrage; her previous husband’s profound  snobbism is in sharp contrast to her current husband’s flat refusal to attend.  For  Olympia’s husband, Harry, whose parents survived the Holocaust, the idea of a blue-blood  debutante ball is abhorrent. Her daughter Veronica, a natural-born rebel, agrees– while Veronica’s identical twin, Virginia, is already shopping for the perfect dress.  Then there’s Olympia’s ex, an insufferable snob, who sees the ball as the perfect  opportunity for a family feud. And amid all the hubbub, Olympia’s college-age son,  Charlie, is facing a turning point in his life–and may need his mother more than  ever.  But despite it all, Olympia is determined to steer her family through the  event until, just days before the cotillion, things begin to unravel with alarming  speed.  From a son’s crisis to a daughter’s heartbreak, from a case of the chicken  pox to a political debate raging in her household, Olympia is on the verge of surrender.  And that is when, in a series of startling choices and changes of heart, family,  friends, and even a blue-haired teenager all find a way to turn a night of calamity  into an evening of magic.  As old wounds are healed, barriers are shattered and new  traditions are born, and a debutante ball becomes a catalyst for change, revelation,  acceptance, and love.  In a novel that is by turns profound, poignant, moving, and  warmly funny, Danielle Steel tells the story of an extraordinary family–finding new  ways of letting go, stepping up, and coming out...in the ways that matter most.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Happiest Baby on the Block",
        "Authors": "By Karp, Harvey",
        "Description": "Perfect for expecting parents who want to provide a soothing home for the newest member of their family,The Happiest Baby on the Block, the national bestseller by respected pediatrician and child development expert Dr. Harvey Karp, is a revolutionary method for calming a crying infant and promoting healthy sleep from day one.In perhaps the most important parenting book of the decade, Dr. Harvey Karp reveals an extraordinary treasure sought by parents for centuries—an automatic “off-switch” for their baby’s crying.No wonder pediatricians across the country are praising him and thousands of Los Angeles parents, from working moms to superstars like Madonna and Pierce Brosnan, have turned to him to learn the secrets for making babies happy.Never again will parents have to stand by helpless and frazzled while their poor baby cries and cries. Dr. Karp has found there IS a remedy for colic. “I share with parents techniques known only to the most gifted baby soothers throughout history …and I explain exactly how they work.”In a innovative and thought-provoking reevaluation of early infancy, Dr. Karp blends modern science and ancient wisdom to prove that newborns are not fully ready for the world when they are born. Through his research and experience, he has developed four basic principles that are crucial for understanding babies as well as improving their sleep and soothing their senses:The Missing Fourth Trimester: as odd as it may sound, one of the main reasons babies cry is because they are born three months too soon.The Calming Reflex: the automatic reset switch to stop crying of any baby in the first few months of life.The 5 “S’s”: the simple steps (swaddling, side/stomach position, shushing, swinging and sucking) that trigger the calming reflex. For centuries, parents have tried these methods only to fail because, as with a knee reflex, the calming reflex only works when it is triggered in precisely the right way. Unlike other books that merely list these techniques Dr. Karp teaches parents exactly how to do them, to guide cranky infants to calm and easy babies to serenity in minutes…and help them sleep longer too.The Cuddle Cure: the perfect mix the 5 “S’s” that can soothe even the most colicky of infants.In the book, Dr. Karp also explains:What is colic?Why do most babies get much more upset in the evening?How can a parent calm a baby—in mere minutes?Can babies be spoiled?When should a parent of a crying baby call the doctor?How can a parent get their baby to sleep a few hours longer?Even the most loving moms and dads sometimes feel pushed to the breaking point by their infant’s persistent cries. Coming to the rescue, however, Dr. Karp places in the hands of parents, grandparents, and all childcare givers the tools they need to be able to calm their babies almost as easily as…turning off a light.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Angels in the Gloom: A Novel (World War One Novels)",
        "Authors": "By Perry, Anne",
        "Description": "With this latest entry in a bestselling series that evokes all the passion and heroism of history’s most heartbreaking conflict–the war that was meant to end all wars–Anne Perry adds new luster to her worldwide reputation.Angels in the Gloom is an intense saga of love, hate, obsession, and murder that features an honorable English family–brothers Joseph and Matthew Reavley and their sisters, Judith and Hannah.In March 1916, Joseph, a chaplain at the front, and Judith, an ambulance driver, are fighting not only the Germans but the bitter cold and the appalling casualties at Ypres. Scarcely less at risk, Matthew, an officer in England’s Secret Intelligence Service, fights the war covertly from London. Only Hannah, living with her children in the family home in tranquil Cambridgeshire, seems safe.Appearances, however, are deceiving. By the time Joseph returns home to Cambridgeshire, rumors of spies and traitors are rampant. And when the savagely brutalized body of a weapons scientist is discovered in a village byway, the fear that haunts the battlefields settles over the town–along with the shadow of the obsessed ideologue who murdered the Reavleys’ parents on the eve of the war. Once again, this icy, anonymous powerbroker, the Peacemaker, is plotting to kill.Perry’s kaleidoscopic new novel illuminates an entire world, from the hell of the trenches to the London nightclub where a beautiful Irish spy plies her trade; from the sequestered laboratory where a weapon that can end the war is being perfected to the matchless glory of the English countryside in spring. Steeped in history and radiant with truth, Angels in the Gloom is a masterpiece that warms the heart even as it chills the blood.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Golden Country",
        "Authors": "By Gilmore, Jennifer",
        "Description": "**DEBUT FICTION** Golden Country vividly brings to life the intertwining stories of three immigrants seeking their fortunes: the handsome and ambitious Seymour, a salesman turned gangster turned Broadway producer; the gentle and pragmatic Joseph, a door-to-door salesman who is driven to invent a cleanser effective enough to wipe away the shame of his brother’s mob connections; and the irresistible Frances Gold, who grows up in Brooklyn, stars in Seymour’s first show, and marries the man who invents television. Their three families, though inextricably connected for years, are brought together for the first time by the engagement of Seymour’s son and Joseph’s daughter. David and Miriam’s marriage must endure the inheritance of not only their parents’ wealth but also the burdens of their pasts. Spanning the first half of the twentieth century, Golden Country captures the exuberance of the American dream while exposing its underbelly—disillusionment, greed, and the disaffection bred by success.",
        "Category": " Fiction , Historical",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Torment of Others: A Novel (Dr. Tony Hill and Carol Jordan Mysteries)",
        "Authors": "By McDermid, Val",
        "Description": "Dr. Tony Hill and Detective Chief Inspector Carol Jordan return in the award-winning series that is the basis for the hit show on BBC America.In a small grim room, the body of a woman is discovered, panic and pain etched in her face. The scene matches in every detail a series of murders two years ago-murders that ended when irrefutable forensic evidence secured the conviction of a deeply disturbed young man named Derek Tyler.But there's no way Tyler could have killed the latest victim.   He's been locked up in a mental institution since his trial, barely speaking a word.  So is there a copycat?All his years of experience tell top criminal psychologist Dr. Tony Hill that there isn't-but that would make the murders literally impossible.  While Hill tries to crack Tyler, DCI Carol Jordan and her team must mount a desperate undercover operation to trap the murderer-a decision that will have terrible consequences.  As the tension mounts, a mixture of psychological insight and dogged detective work leads inexorably to a terrifying climax where Tony faces one of the most perverse killers he has ever encountered.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Trouble",
        "Authors": "By Kellerman, Jesse",
        "Description": "Jesse Kellerman's debut thriller wowed the critics. His latest sets the bar even higher.  Young, idealistic, and overworked, Jonah is living the lonely life of a medical student in New York City when he accidentally stumbles across a murder in progress: a woman, being stabbed to death in the middle of the sidewalk. Without thinking, he rushes in to protect her-inadvertently killing her attacker in the process.  Thrust into the media spotlight, crushed by guilt, Jonah quickly learns that heroism isn't all it's cracked up to be. He receives a shower of unwanted attention-and hostility-from his superiors. The district attorney wants to \"interview\" him. The family of the dead man wants revenge.  Everything is further upended when the woman whose life he saved shows up at his apartment. What begins as a thank-you drink turns into a wildly passionate love affair. As their relationship deepens, however, Jonah realizes that she isn't quite the woman she appears to be. His nightmare has only begun, and the price of kindness will turn out to be higher than he could have imagined.  Expertly crafted and chillingly suspenseful, Trouble is a heart-stopper: proof positive that Jesse Kellerman has joined the \"first ranks of mystery and suspense writers\" (Forbes).",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "God's Gift to Women: A Novel",
        "Authors": "By Baisden, Michael",
        "Description": "A smooth talker. An even better listener. And handsome as heaven on earth. He is God's Gift to Women.  Julian Payne gets into bed with millions of women every night. As an after-hours radio talk-show host, Julian captivates his female audience with his deep voice and sensitive spirit. Women can't get enough: They call in, begging for his advice about love, lust, commitment, and betrayal. Julian provides his listeners with the blunt male perspective, and he always has the right thing to say. But when it comes to his own romantic life, or lack thereof, he's at a loss for words.  A widower and father to ten-year-old Samantha, Julian wants nothing more than to settle down again with the right woman. Just when he thinks he's found her in Dr. Terri Ross -- smart, stunning, and with her own counseling practice -- Julian is confronted by a ghost from the past: Olivia Brown, a woman with whom he had a one-night stand. Suddenly Julian finds himself in a situation with a woman who's determined to win him over...or make his life a living hell.  Michael Baisden's hottest offering yet, God's Gift to Women is a compelling tale about the consequences of sex with a stranger.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Iced (Regan Reilly Mysteries, No. 3)",
        "Authors": "By Clark, Carol Higgins",
        "Description": "The frontier spirit is alive and well in the old silver-mining town-turned-trendy resort of Aspen, Colorado, despite an influx of the rich and famous - and Regan Reilly. Regan has arrived with her mystery-writing mom and suave, funeral director father to spend the Christmas holidays on the slopes and visiting friends. Secretly, she wouldn't mind meeting a single man or two. She never expects to be rubbing shoulders, and maybe risking her neck, with varmints, desperadoes, or art thieves.Million-dollar paintings have been disappearing from elegant condos and chic chalets all over town. Suspicion immediately falls on a congenial ex-con caretaker named Eben Bean, who seems to have absconded with the loot. Worse, Regan not only knew and liked Eben, but also had helped him get his caretaking job. Now she may be the only person in town who believes he is innocent.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "The Bond: Three Young Men Learn to Forgive and Reconnect with Their Fathers",
        "Authors": "By Jenkins, George, Davis, Sampson, and Hunt, Rameck",
        "Description": "The Three Doctors-Drs. Sampson Davis, George Jenkins, and Rameck Hunt-discovered early in their friendship that they shared one disturbing trait: As children, they had to navigate life in inner-city Newark without a father's support and guidance. While each young man dealt with the turmoil caused by an absent father, with no male role model to turn to for advice, each veered dangerously close to a life of delinquency, drugs, and crime. But despite great odds, the three overcame the statistics. In high school, they formed the Pact, a promise to one another that they would become doctors, and it kept them dedicated to one another and to their dream, and helped to put them on the road to successful careers as physicians.  In The Bond, the Three Doctors plumb their own tough childhoods to explore the national epidemic of fatherlessness. But rather than cling to any bitterness or pain they may have felt as children about their fathers' inability to be in their lives, as adults Davis, Jenkins, and Hunt sought out their fathers and worked to reconnect with them. In the doctors' own words-and their fathers'-they describe the crucial lessons they learned, identifing ways to stem the tide of fatherlessness that's sweeping through communities across the country. Honest, brave, and poignant, The Bond is a book for every family, every father, and every man.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "His Little Black Book",
        "Authors": "By Devine, Thea",
        "Description": "This meeting of the Mistress Club is now in session....   At a swanky café in midtown Manhattan, three twentysomething gals convene to discuss how to achieve their ultimate fantasy: becoming lusciously sexy, irresistibly seductive mistresses to supremely wealthy older men. Founders of their very own Mistress Club -- Brooke, a confident brunette; Delia, a feisty blond sexpot; and MJ, an ambitious, red-haired siren -- have sworn off unsatisfying one-night stands, vowing to take control of their sex lives. And thanks to Brooke, they have a set of guidelines for becoming elegant mistresses of sin:    Get first, then give   Don't waste your time on anything that won't get you something in return   Always dress to kill -- stilettos are a must!   Be discreet, aloof, mysterious, elusive   Don't get invested in him -- let him invest in you   And most of all, do NOT fall in love.   Despite the rules, each woman falls for a sexy man who gets what he wants -- when he wants it -- without giving anything in return. That is, until Brooke finds her way into the coveted pages of a high-powered businessman's little black book -- opening the door for her and her friends to a hedonistic world of pleasure and passion that may be more than they bargained for....",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Meaning and Medicine",
        "Authors": "By Dossey, Larry",
        "Description": "Here is a revolutionary new look at medicine and the mind-body connection to healing by a frank and unconventional physician-writer -- a book that taps the power of hope and healing that lies within each of us.Dr. Larry Dossey dared to break with traditional scientific, medical thought in his previous books, Space, Time & Medicine and Recovering The Soul.  Now he continues his investigation into the connection between mind, meaning, and illness through fascinating clinical stories from his many years of practice, he shows in true, almost often dramatic accounts how though and emotion do influence the body -- and can make the difference between life and death.  Writing with wonderful clarity and weaving together the ideas of physicists, philosophers, physicians, and researchers, Dr. Dossey illustrates the extraordinary ability of the mind and the body to perform miracles.Filled with case histories, clinical findings, and deeply inspiring personal stories, Meaning & Medicine is a thought-provoking and life-changing book.  It gives us both hope and power in the quest toward understanding the impact of attitudes, thoughts, and emotions on our health -- and our lives.",
        "Category": " Health & Fitness , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Gone (Alex Delaware Novels)",
        "Authors": "By Kellerman, Jonathan",
        "Description": "No one conducts a more chilling, suspenseful, thoroughly engrossing tour through the winding corridors of criminal behavior and the secret chambers of psychopathology than Jonathan Kellerman, the bestselling “master of the psychological thriller” (People). Now the incomparable team of psychologist Alex Delaware and homicide cop Milo Sturgis embark on their most dangerous excursion yet, into the dark places where risk runs high and blood runs cold.It’s a story tailor-made for the nightly news: Dylan Meserve and Michaela Brand, young lovers and fellow acting students, vanish on the way home from a rehearsal. Three days later, the two of them are found in the remote mountains of Malibu -battered and terrified after a harrowing ordeal at the hands of a sadistic abductor. The details of the nightmarish event are shocking and brutal: The couple was carjacked at gunpoint by a masked assailant and subjected to a horrific regimen of confinement, starvation and assault.  But before long, doubts arise about the couple’s story, and as forensic details unfold, the abduction is exposed as a hoax. Charged as criminals themselves, the aspiring actors claim emotional problems, and the court orders psychological evaluation for both. Michaela is examined by Alex Delaware, who finds that her claims of depression and stress ring true enough. But they don’t explain her lies, and Alex is certain that there are hidden layers in this sordid psychodrama that even he hasn’t been able to penetrate.Nevertheless, the case is closed–only to be violently reopened when Michaela is savagely murdered. When the police look for Dylan, they find that he’s gone. Is he the killer or a victim himself? Casting their dragnet into the murkiest corners of L.A., Delaware and Sturgis unearth more questions than answers–including a host of eerily identical killings. What really happened to the couple who cried wolf? And what bizarre and brutal epidemic is infecting the city with terror, madness, and sudden, twisted death?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Send in the Idiots: Stories from the Other Side of Autism",
        "Authors": "By Nazeer, Kamran",
        "Description": "A remarkable, elegantly written portrait of four autistic men and women, and what their struggles and triumphs reveal about this baffling condition, and about us all. In 1982, when he was four years old, Kamran Nazeer was enrolled in a small school in New York City alongside a dozen other children diagnosed with autism. Calling themselves the Idiots, these kids received care that was at the cutting edge of developmental psychology. Twenty-three years later, the school no longer exists.Send in the Idiots is the always candid, often surprising, and ultimately moving investigation into what happened to those children. Now a policy adviser in England, Kamran decides to visit four of his old classmates to find out the kind of lives that they are living now, how much they've been able to overcome—and what remains missing. A speechwriter unable to make eye contact; a messenger who gets upset if anyone touches his bicycle; a depressive suicide victim; and a computer engineer who communicates difficult emotions through the use of hand puppets: these four classmates reveal an astonishing, thought-provoking spectrum of behavior. Bringing to life the texture of autistic lives and the pressures and limitations that the condition presents, Kamran also relates the ways in which those can be eased over time, and with the right treatment. Using his own experiences to examine such topics as the difficulties of language, conversation as performance, and the politics of civility, Send in the Idiots is also a rare and provocative exploration of the way that people—all people—learn to think and feel. Written with unmatched insight and striking personal testimony, Kamran Nazeer's account is a stunning, invaluable, and utterly unique contribution to the literature of what makes us human.",
        "Category": " Psychology , Psychopathology , Autism Spectrum Disorders",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "You Bring the Confetti, God Brings the Joy",
        "Authors": "By Swindoll, Luci",
        "Description": "We can trudge through life or celebrate it. To celebrate it results in joy. Lucy Swindoll's book is a wisdom-filled enthusiastic trek through the meaning of joy and how to appreciate every moment.",
        "Category": " Religion , Inspirational",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Life's Greatest Lessons: 20 Things That Matter",
        "Authors": "By Urban, Hal",
        "Description": "With more than a quarter million copies sold, award-winning teacher Hal Urban outlines twenty lessons that answer timeless questions about how to make the most of your life.Life’s Greatest Lessons is a wise, wonderful book. In it, Hal Urban, a parent and an award-winning teacher, presents twenty principles that are as deeply rooted in common sense as they are in compassion. The topics, gathered from a lifetime of teaching both children and adults, span a wide range of readily understood concepts, including attitudes about money, understanding the real meaning of “success,” and the importance of having fun. The book will help you find the best—in the world, in others, and in yourself. Classic in its simplicity and enduring in its appeal, Life’s Greatest Lessons helps us all rediscover that the desire to live a good life is timeless.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Camino: A Journey of the Spirit",
        "Authors": "By MacLaine, Shirley",
        "Description": "It has been nearly three decades since Shirley MacLaine commenced her brave and public commitment to chronicling her personal quest for spiritual understanding. In testament to the endurance and vitality of her message, each of her eight legendary bestsellers -- from Don't Fall Off the Mountain to My Lucky Stars -- continues today to attract, dazzle, and transform countless new readers. Now Shirley is back -- with her most breathtakingly powerful and unique book yet.  This is the story of a journey. It is the eagerly anticipated and altogether startling culmination of Shirley MacLaine's extraordinary -- and ultimately rewarding -- road through life. The riveting odyssey began with a pair of anonymous handwritten letters imploring Shirley to make a difficult pilgrimage along the Santiago de Compostela Camino in Spain. Throughout history, countless illustrious pilgrims from all over Europe have taken up the trail. It is an ancient -- and allegedly enchanted -- pilgrimage. People from St. Francis of Assisi and Charlemagne to Ferdinand and Isabella to Dante and Chaucer have taken the journey, which comprises a nearly 500-mile trek across highways, mountains and valleys, cities and towns, and fields. Now it would be Shirley's turn.  For Shirley, the Camino was both an intense spiritual and physical challenge. A woman in her sixth decade completing such a grueling trip on foot in thirty days at twenty miles per day was nothing short of remarkable. But even more astounding was the route she took spiritually: back thousands of years, through past lives to the very origin of the universe. Immensely gifted with intelligence, curiosity, warmth, and a profound openness to people and places outside her own experience, Shirley MacLaine is truly an American treasure. And once again, she brings her inimitable qualities of mind and heart to her writing. Balancing and negotiating the revelations inspired by the mysterious energy of the Camino, she endured her exhausting journey to Compostela until it gradually gave way to a far more universal voyage: that of the soul. Through a range of astonishing and liberating visions and revelations, Shirley saw into the meaning of the cosmos, including the secrets of the ancient civilizations of Atlantis and Lemuria, insights into human genesis, the essence of gender and sexuality, and the true path to higher love.  With rich insight, humility, and her trademark grace, Shirley MacLaine gently leads us on a sacred adventure toward an inexpressibly transcendent climax. The Camino promises readers the journey of a thousand lifetimes.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Life Out of Bounds: Bioinvasion in a Borderless World (Worldwatch Environmental Alert)",
        "Authors": "By Bright, Chris",
        "Description": "Bioinvasion - the spread of alien, \"exotic\" organisms - is gnawing away at ecosystems all over the world, largely unnoticed and unopposed. The continuing increase in travel and trade around the globe is fostering the spread of more and more invaders of almost every conceivable description, from highly flammable weeds to human pathogens and forest diseases.Chris Bright tracks the extent and explains the dangers of bioinvasion - an environmental threat that may now be surpassed only by habitat loss in its potential to irreparably damage our planet. Bright explores the counterintuitive mechanisms of invasion, in which the addition of a non-native species to an area tends to reduce that area's biodiversity. He shows that bioinvasions are not only destroying ecosystems, but also endangering public health, disrupting the cultures of traditional forest and fishing peoples, and costing our economies billions of dollars a year.The current rates of invasion, Bright argues, are no more sustainable over the long term than are current rates of deforestation or greenhouse gas emissions. Yet according to Bright, we already have the knowledge and tools necessary to resist or roll back bioinvasions. He outlines a counter-invasion strategy that stretches from international legal reform to on-the-ground control techniques. And, recognizing that the principal challenge may not be so much technical as cultural, he calls for a higher degree of ecological literacy - an appreciation of the value of native plants and animals, and an ability to \"read\" landscapes well enough to see the invaders within them.",
        "Category": " Science , Environmental Science",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Down-to-Earth Guide To Global Warming",
        "Authors": "By David, Laurie and Gordon, Cambria",
        "Description": "From the producer of AN INCONVENIENT TRUTH comes a powerful, kid-friendly, and engaging book that will get kids get interested in the environment!Irreverent and entertaining, DOWN TO EARTH is filled with fact about global warming and its disastrous consequences, loads of photos and illustrations, as well as suggestions for how kids can help combat global warming in their homes, schools, and communities. Engagingly designed, DOWN TO EARTH will educate and empower, leaving readers with the knowledge they need to understand this problem and a sense of hope to inspire them into action.",
        "Category": " Juvenile Nonfiction , Science & Nature , Environmental Conservation & Protection",
        "Publisher": "Orchard Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Ladies' Room Reader: The Ultimate Women's Trivia Book",
        "Authors": "By Alicia Alvrez",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Tracker",
        "Authors": "By Paulsen, Gary",
        "Description": "For John Borne's family, hunting has nothing to do with sport or manliness. It's a matter of survival. Every fall John and his grandfather go off into the woods to shoot the deer that puts meat on the table over the long Minnesota winter.   But this year John's grandfather is dying, and John must hunt alone. John tracks a doe for two days, but as he closes in on his prey, he realizes he cannot shoot her. For John, the hunt is no longer about killing, but about life.",
        "Category": " Juvenile Fiction , Family , Multigenerational",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Inner & Outer Peace Through Meditation",
        "Authors": "By Singh, Rajinder",
        "Description": "This outstanding meditation handbook is by one of the world's great spiritual teachers. His deep wisdom and sympathetic advice, together with the simple exercise techniques he has created, have brought spiritual benefits to thousands. Now he can help guide you on the path to divine love and fulfillment.Whether you are already meditating or a complete beginner, young or old, Rajinder Singh's easy-to-read manual will help you achieve personal transformation. As a result, you can contribute to outer peace and the raising of global consciousness.",
        "Category": " Self-help , Meditations",
        "Publisher": "Element Books Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Assassination Vacation",
        "Authors": "By Vowell, Sarah",
        "Description": "New York Times bestselling author of The Wordy Shipmates and contributor to NPR’s \"This American Life\" Sarah Vowell embarks on a road trip to sites of political violence, from Washington DC to Alaska, to better understand our nation’s ever-evolving political system and history.Sarah Vowell exposes the glorious conundrums of American history and culture with wit, probity, and an irreverent sense of humor. With Assassination Vacation, she takes us on a road trip like no other -- a journey to the pit stops of American political murder and through the myriad ways they have been used for fun and profit, for political and cultural advantage.  From Buffalo to Alaska, Washington to the Dry Tortugas, Vowell visits locations immortalized and influenced by the spilling of politically important blood, reporting as she goes with her trademark blend of wisecracking humor, remarkable honesty, and thought-provoking criticism. We learn about the jinx that was Robert Todd Lincoln (present at the assassinations of Presidents Lincoln, Garfield, and McKinley) and witness the politicking that went into the making of the Lincoln Memorial. The resulting narrative is much more than an entertaining and informative travelogue -- it is the disturbing and fascinating story of how American death has been manipulated by popular culture, including literature, architecture, sculpture, and -- the author's favorite -- historical tourism. Though the themes of loss and violence are explored and we make detours to see how the Republican Party became the Republican Party, there are all kinds of lighter diversions along the way into the lives of the three presidents and their assassins, including mummies, show tunes, mean-spirited totem poles, and a nineteenth-century biblical sex cult.",
        "Category": " Travel , United States , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Fortress of Owls",
        "Authors": "By Cherryh, C. J.",
        "Description": "\"I dream of Owl. That means wizardry is near.\"  There is a vast difference between wizardry and sorcery, a difference embodied in the conflict between the shadowy immortals Mauryl and Hasufin.  Tristen is a weapon in the at ancient war. A summoning and a shaping, brought to life by the wizard Mauryl, Tristen has yet to see his first winter, though he has the shape and the memory of a young man.  And the sword is a weapon as well. Its keen blade, marked  Illusion on one side and  Truth on the other, helped the young king Cefwyn secure the throne of Ylesuin and gained Tristen the stewardship of Amefel, a country that has paid dearly for its resistance to the barbarism of wizard war.  Tristen&#39;s rule in Amefel is blessed with two extraordinary friends: one a stalwart and simple warrior, the other with more than a drop of aetheling royal blood. But the scarlet banners of war are unfolding again, and far more than a kingdom is at stake.  Cefwyn&#39;s dream of a united Ylesuin and a love match with Nivévrise is threatened by ambitious lords and narrow religionist to whom all magic is evil. The \"sparrows\" of Elwynor are gathering on the border, pitiful refugees from the gathering storm.  And Tristen must take up the sword and the Sihhé magic he has forsworn. For he is destiny&#39;s own, created a combatant in a far older and more fearsome conflict than any ever imagined by mere mortal man.  Following her acclaimed Fortreess in the Eye of Time and Fortress of Eagles, C. J. Cherryh&#39;s newest high fantasy triumph continued the soaring tale of the  primordial struggle between darkness and light.  Fortress of Owls is a worthy and essential addition to this awesome fantasy epic, set  in a world as rich with wonder, as plagued by violence, and for those with eyes to see, far more real than our own.   The Blade, Illusion, Flashed in the Dim Light...  Naked, sword in hand, Tristen faced the window into the shadowed night and saw all the town of Henas&#39;amef flared up in Lines. There were al the wards, all the magic of craftsmen and householders warding their own doors and walls; the common magic of parents and homekeepers and the pure trust of children...all these things Unfolded to him in that unworldly glow, block by block, house by  house, outward toward the great defensive wall of Henas&#39;amef itself, a bright blue Line often retraced and constantly tended. Something had challenged them  But they held. For now, they held...",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Long After Midnight",
        "Authors": "By Johansen, Iris",
        "Description": "At twenty-nine, Kate Denby believes she's finally carved out a safe and secure life for herself and her nine-year-old son. But the gifted scientist couldn't be more wrong...Deep in a genetic research facility, Kate is very close to achieving a major medical breakthrough. But there is someone who will stop at nothing to make sure she never finishes her work. Someone not interested in holding out hope, but in buying and selling death.Now Kate is waking up to a nightmare world where a dangerously unpredictable killer is stalking her...where the people closest to her are considered expendable...and where the research to which she has devoted her life is the same research that could get her killed.Her only hope is to put her trust in a stranger, a man whose intentions are nearly impossible to fathom, a survivor who is used to putting his neck on the line.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "The Dirt on Sex: A Dateable Book (Dirt, The)",
        "Authors": "By Morgan, Hayley and Lookadoo, Justin",
        "Description": "",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Bancroft Strategy",
        "Authors": "By Ludlum, Robert",
        "Description": "In the tradition of such Ludlum classics as The Chancellor Manuscript and The Icarus Agenda, The Bancroft Strategy is a compelling novel of intrigue, where two figures find themselves facing a shadowy organization working to twist global politics to their own unsavory ends. When Todd Belknap - a legendary field agent for Consular Operations with a reputation as something of a cowboy - is cut loose from the agency after an operation goes wrong, his best friend and fellow agent is abducted in Lebanon by a militia group with a vicious reputation. When the government refuses to either rescue him or negotiate for his release, Belknap decides to take matters into his own hands.Meanwhile, hedge fund analyst Andrea Bancroft gets a surprising call - she is to receive an unexpected bequest of six million dollars from a cousin she never met. With one condition -- she must agree to sit on the board of the Bancroft family foundation, a charitable organization that is run by the family patriarch, Paul Newton. Having never been involved with, or even met, the family - her mother was briefly married to an Bancroft and cut off all contact many years ago - Andrea is intrigued. But the foundation, which is dedicated to doing strategic good deeds, appears less and less benign the more deeply involved she gets. What exactly is their involvement with the \"Genesis\" - a mysterious group working to destabilize the geopolitical balance at the risk of millions of lives? As events escalate, Todd Belknap and Andrea Bancroft come together and must form an uneasy alliance if they are to uncover the truth behind \"Genesis\" -- before it is too late.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "St Martins Press",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The 6th Target",
        "Authors": "By Patterson, James and Paetro, Maxine",
        "Description": "A horrifying burst of gunfire on a crowded ferry leaves several people dead - and one woman fighting for her life. That victim is a member of the Women's Murder Club, four friends who join forces on their toughest cases when traditional methods get them nowhere. Inspector Lindsay Boxer pursues one tantalizing lead after another in her attempt to bring in the man who tried to kill her friend. But nothing makes sense in the most twisted, frightening case the Women's Murder Club has ever faced.While Assistant District Attorney Yuki Castellano prepares to prosecute the toughest trial of her life, the city is in the grip of a chilling crime spree. Children of well-to-do families are being abducted, together with their nannies. But the kidnappings are followed by devastating silence - no message from the kidnappers, no demand for ransom. Parents everywhere fear the worst. Working frantically with her new partner, Lindsay Boxer struggles to find the connection that will help them make sense of these horrific crimes.An entire city is in the grip of fear, and Lindsay Boxer is at the top of her form in this sixth novel about the Women's Murder Club.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Firefighters: Their Lives in Their Own Words",
        "Authors": "By Smith, Dennis",
        "Description": "An unforgettable journey through the daily lives of the brave men and women who have made saving lives their profession.Dennis Smith, author of Report from Engine Co. 82, traveled across the country talking to dozens of America’s firefighters to put together this powerful collection of their own descriptions of their most dramatic and intense experiences on the job. Their stories, compiled here, are timeless testimonies to the human capacity for heroism and nobility.Focusing on the most courageous firefighters, from those who have been decorated for heroism to those who have been seriously injured,Firefighters presents the extraordinarily rich and rugged voices of men and women who fight urban building fires, who battle sweeping forest fires, who perform emergency rescues, and who face extreme danger and risk as part of their everyday lives. Sometimes brave, sometimes funny, sometimes bittersweet or filled with anger, these voices combine to makeFirefighters both a riveting adventure drama and a moving chronicle of American heroism at its finest.From the Trade Paperback edition.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "A Midwinter's Tale",
        "Authors": "By Greeley, Andrew M.",
        "Description": "In high school, Charles \"Chucky\" Cronin O'Malley is a short, wiry youth with flaming red hair and a gift for the blarney. Too small for the important positions on the football team, he is the ball holder on kickoffs and an honorary \"fourth string\" quarterback. He becomes a legend when a comedy of errors and lucky mistakes helps him lead his team to the city championship.All Chucky wants out of life is to go to Notre Dame, become an accountant, and have a nice, orderly life, but the Deity seems to have other plans for him. Again and again his courage and compassion get him into impossible scrapes - with black marketeers, border patrols, his commanding officer, and the U.S. Army. Only his trademark combination of quick wit and blind luck (and maybe a little Heavenly intervention) sees him safely out of harm's way.",
        "Category": " Fiction , General",
        "Publisher": "Forge",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Venetian Betrayal: A Novel",
        "Authors": "By Berry, Steve",
        "Description": "In 323 B.C.E, having conquered Persia, Alexander the Great set his sights on Arabia, then suddenly succumbed to a strange fever. Locating his final resting place–unknown to this day–remains a tantalizing goal for both archaeologists and treasure hunters. Now the quest for this coveted prize is about to heat up. And Cotton Malone–former U.S. Justice Department agent turned rare-book dealer–will be drawn into an intense geopolitical chess game. After narrowly escaping incineration in a devastating fire that consumes a Danish museum, Cotton learns from his friend, the beguiling adventurer Cassiopeia Vitt, that the blaze was neither an accident nor an isolated incident. As part of campaign of arson intended to mask a far more diabolical design, buildings across Europe are being devoured by infernos of unnatural strength.And from the ashes of the U.S.S.R., a new nation has arisen: Former Soviet republics have consolidated into the Central Asian Federation. At its helm is Supreme Minister Irina Zovastina, a cunning despot with a talent for politics, a taste for blood sport, and the single-minded desire to surpass Alexander the Great as history’s ultimate conqueror. Backed by a secret cabal of powerbrokers, the Federation has amassed a harrowing arsenal of biological weapons. Equipped with the hellish power to decimate other nations at will, only one thing keeps Zovastina from setting in motion her death march of domination: a miraculous healing serum, kept secret by an ancient puzzle and buried with the mummified remains of Alexander the Great–in a tomb lost to the ages for more than 1,500 years.Together, Cotton and Cassiopeia must outrun and outthink the forces allied against them. Their perilous quest will take them to the shores of Denmark, deep into the venerated monuments of Venice, and finally high inside the desolate Pamir mountains of Central Asia to unravel a riddle whose solution could destroy or save millions of people–depending on who finds the lost tomb first.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Saint (Books of History Chronicles: Paradise)",
        "Authors": "By Dekker, Ted",
        "Description": "\"We call you Saint.\"The name ignited a light in Carl's mind. Saint. He'd been covertly recruited for Black Ops and given his life to the most brutal kind of training any man or woman could endure. He was here because he belonged here. To the X Group.An assassin. The most effective killer in the world. And yet . . . Carl Strople struggles to retain fleeting memories that betray an even more ominous reality. He's been told part of the truth—but what's the rest?Invasive techniques have stripped him of his identity and made him someone new—for this he is grateful. But there are some things they can't take from him. The love of a woman, unbroken loyalties to his past, the need for survival.From the deep woods of Hungary to the streets of New York, Saint takes you on a journey of betrayal in a world of government cover-ups, political intrigue, and one man's search for the truth. In the end, that truth will be his undoing.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Westbow Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "ZagatSurvey 2005 Washington, DC/Baltimore Restaurants (Zagatsurvey)",
        "Authors": "By Andrews, Betsy (EDT), Katz, Marty (EDT), and Boikess, Olga (EDT)",
        "Description": "",
        "Category": " Travel , Food, Lodging & Transportation , Restaurants",
        "Publisher": "Zagat Survey",
        "Price Starting With ($)": "6.64",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Lily and the Lion: Royal France, Great Britain (Imperial Visions Series: The Rise and Fall of Empires)",
        "Authors": "By Mansel, Philip",
        "Description": "",
        "Category": "",
        "Publisher": "HBJ Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Bones in the Attic: A Novel of Suspense",
        "Authors": "By Barnard, Robert",
        "Description": "Matt Harper, a television and radio personality and a former professional soccer player, has just bought Elderholm, an old stone house in Leeds in the north of England. It's ideal for him, his partner Aileen, and her three children. Even the attic space seems just right -- the perfect place for a game room or a children's retreat.   But as Matt and his decorator tour the property, they find something that will put the attic off-limits for a long time to come: a tiny child's skeleton that has clearly been there for years. What happened to the child, and how did its skeleton get into the attic?  Detective Sergeant Charlie Peace and his forensic team think the child's remains have been in the attic for thirty years. Thirty years? Matt remembers that time. It was 1969 and he was seven years old. He was in the neighborhood, spending the summer with an aunt. That was the summer that Elderholm's owner left her house empty when she went to visit a daughter in Australia.  What happened that summer? What memories lie deep in Matt's consciousness? Where are the other children from that summer who now, of course, are adults? Who killed the little child and why was he or she never reported missing? And who has now written to Matt, assuring him that he had no part in what occurred, that he had gone home to London before it happened?  As Matt struggles to recover his memory of that strange summer, both he and Charlie Peace ponder what it means to love and lose a child and how one thoughtless decision can change a life forever.  Richly evocative and deeply poignant, The Bones in the Attic is crime writing at its best from one of the great contemporary masters of mystery.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Campbell's Quick & Easy Recipes",
        "Authors": "By Teberg, Patricia (EDT)",
        "Description": "A collection of 125 tried-and-true recipes for dishes made from Campbell's soups features recipes for appetizers, hearty stews, main dishes, vegetables, and more and includes 225 photographs of the finished product.",
        "Category": " Cooking , Methods , Microwave",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Taking Charge of ADHD: The Complete, Authoritative Guide for Parents (Revised Edition)",
        "Authors": "By Barkley, Russell A.",
        "Description": "A treasured parent resource since its publication, Taking Charge of ADHD provides authoritative information on ADHD and its treatment. From internationally renowned ADHD expert Russell A. Barkley, the book empowers parents by arming them with the knowledge, expert guidance, and confidence they need. Included are:*A step-by-step plan for behavior management that has helped thousands of children.*Current information on medications, including coverage of Strattera and extended-release stimulants.*Strategies that help children succeed at school and in social situations.*Advances in research on the causes of ADHD.*Practical advice on managing stress and keeping peace in the family.*Descriptions of books, organizations, and Internet resources that families can trust.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Solve Your Child's Sleep Problems: New, Revised, and Expanded Edition",
        "Authors": "By Ferber, Richard",
        "Description": "The completely revised and updated edition of the all-time bestselling book on children’s sleep problems, with important new insights and solutions from Dr. Richard Ferber, the nation’s leading authority on children’s sleep problems.Does your child have difficulty falling asleep? Wake in the middle of the night? Suffer sleep terrors, sleepwalking, or nighttime fears? Have difficulty waking for school or staying awake in class? Snore, wet the bed, or head bang? In the first major revision of his bestselling, groundbreaking classic since it was published, Dr. Richard Ferber, the nation’s foremost authority on children’s sleep problems, delivers safe, sound ideas for helping your child fall and stay asleep at night and perform well during the day. Incorporating new research, Dr. Ferber provides important basic information that all parents should know regarding the nature of sleep and the development of normal sleep and body rhythms throughout childhood. He discusses the causes of most sleep problems from birth to adolescence and recommends an array of proven solutions for each so that parents can choose the strategy that works best for them. Topics covered in detail include: Bedtime difficulties and nighttime wakings, effective strategies for naps, sleep schedule abnormalities, a balanced look at co-sleeping, new insights into the nature of sleep terrors and sleepwalking, problems in setting limits, and sleep apnea, narcolepsy, bed-wetting, and head banging. Solve Your Child’s Sleep Problems offers priceless advice and concrete help for a whole new generation of anxious, frustrated, and overtired parents.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Gods of Newport",
        "Authors": "By Jakes, John",
        "Description": "Determined to secure entry into the elite social circles of late nineteenth-century Rhode Island, former robber baron Sam Driver enlists the help of a pair of social gadflies but finds his efforts complicated by his daughter's dangerous romance with an impoverished young Irishman. 150,000 first printing.",
        "Category": " Fiction , Historical",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Kentucky Heat",
        "Authors": "By Michaels, Fern",
        "Description": "Determined to make her racing stables the best in Kentucky, Nealy Coleman Diamond finds her life forever changed by the arrival of her ex-husband's law partner, Hatch Littletree, who helps her reconcile with her estranged children and opens her heart to the possibilities of newfound love and passion, but an unexpected tragedy threatens to destroy everything Nealy holds dear. 125,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Danse Macabre",
        "Authors": "By Hamilton, Laurell K.",
        "Description": "These days, Anita Blake is less interested in vampire politics than in an ancient, ordinary dread she shares with women down the ages: she may be pregnant. And, if she is, whether the father is a vampire, a werewolf, or someone else entirely, she knows perfectly well that being a Federal Marshal known for raising the dead, and being a vampire executioner, is no way to bring up a baby.--From publisher description.Anita Blake is worried that her careers as a Federal Marshal who raises the dead and as a vampire executioner may be jeopardized when she realizes that she may be pregnant--and the father could be a vampire, a werewolf, or someone else entirely.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Berkley Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "In the Cards: Love",
        "Authors": "By Fredericks, Mariah and Watkins, Liselotte (ILT)",
        "Description": "What if, for once, the losers won out against the über-cools? GeekGirl gets GreekGod? It'd turn the school upside down.   But that's what Zoe's World, a website that Eberly's eighth-grade girls check out daily, is suggesting. Only Anna, Eve, and Syd know that the cards -- the mysterious tarot deck elderly Mrs. Rosemont left Anna (along with a psycho cat, Mouli) are responsible. Or may be responsible . . . if you believe in that sort of thing.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "DK Biography: Pele: A Photographic Story of a Life",
        "Authors": "By Buckley, James, Jr.",
        "Description": "Full-color photographs of people, places, and artifacts; definitions of key words; and sidebars on related subjects add dimension and relevance to stories of famous lives, creating a unique reading experience about people youngsters should know.",
        "Category": " Juvenile Nonfiction , People & Places , Caribbean & Latin America",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Dombey and Son (Wordsworth Classics)",
        "Authors": "By Dickens, Charles",
        "Description": "A rich and pompous merchant is plagued by loneliness and misfortune.",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Taming Him: Ellora's Cave Presents",
        "Authors": "By Pillow, Michelle M., Dean, Kimberly, and Devon, Summer",
        "Description": "In this steamy anthology, three strong, sexy women use their feminine wiles and powerful seduction to claim the men who can satisfy their every desire. . . .   KIMBERLY DEAN Fever   Miserable at work with a raging fever, Delia Jenkins is sent home by her handsome, masterful boss. She tries to sleep it off, but hours later she is gently awakened by the arousing caress of her powerful knight in shining armor. Delia is still burning up -- with desire for his passionate, stimulating touch to make her feel better...in more ways than one.   SUMMER DEVON Perfection   After volunteering for a lab experiment gone awry, Bryan Hartigan is irresistible to women. Thanks to a \"come and take me\" chemical that emanates from his pores, every woman wants his body -- and a group of thugs want the million-dollar essence it exudes. While on the run from relentless stalkers, Bryan meets Allie, a sweet, sensual waitress whose luscious curves he can't resist -- and who may be the antidote to his alluring curse.   MICHELLE M. PILLOW Taming Him   Driving alone one night, Maggie Stewart sees an alien spaceship and can't believe her eyes. When a gorgeous, hard-bodied stud named Vladei emerges and kidnaps Maggie, intoxicating her with his euphoric aura and chiseled features, she is utterly confused and tempted at the same time. Once she's aboard the ship, Vladei treats her like a queen, showering her with enticing pleasures and unrequited passion -- until she will do anything to be his.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Fragile Innocence: A Father's Memoir of His Daughter's Courageous Journey",
        "Authors": "By Reston, James, Jr.",
        "Description": "Fragile Innocence is the story of a child devastated by pure chance. This moving narrative of a father’s journey to understand and accept the profound changes in his daughter’s life is at once memoir, biography, mystery, and drama, all centered around one remarkable young woman who cannot talk or read or understand language, but who has touched almost everyone she has ever met.At eighteen months Hillary Reston, a happy, healthy toddler, was struck by a remarkably high fever. On the advice of her doctor, her parents, James Reston, Jr., and Denise Leary, administered Tylenol and anxiously waited for the fever to subside. Five days later it did, but the damage was done. Over the course of the next five months their bubbly, highly verbal child was radically and irrevocably changed. Worse yet, no doctor could explain what evil and still unidentified force had stolen Hillary’s ability to speak or understand language, hurtled her into a seemingly endless cycle of seizures, destroyed her kidneys, and taken her to the very brink of death.For her parents, discovering what had happened to their child and how to assure the quality of her life became an obsession. This quest for answers would take them from the nation’s hospitals to the office of a pioneering geneticist in Texas and the vaulted halls of the National Institutes of Health.This very intimate story also personalizes some of the most daunting ethical issues of medicine that society faces today, including stem cell research, animal organ transplantation, diagnosis with the Human Genome Map, and reproductive and therapeutic cloning. Hillary gives these immensely complicated issues a human face, and they are pondered by Reston as a reporter, a thinker, and a father. In Fragile Innocence author James Reston, Jr., invites us inside his family, candidly sharing the joys and sorrows of raising Hillary.“This is a book about the first twenty-one years of a child named Hillary. It tells of her battle to live and our family’s struggle to help her survive as best we could, after an evil and still unidentified force robbed her of her language at the age of two, hurtled her into a seemingly endless cycle of brain storms, destroyed her kidneys, and took her to the very brink of death. That is the first half of the story, when life itself was at stake.” —From the Preface",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Lifecraft: The Art of Meaning in the Everyday",
        "Authors": "By Church, F. Forrester",
        "Description": "In LIFECRAFT, Forrest Church challenges much of the modern search for meaning--indeed, the entire thrust of modern theology.  LIFECRAFT reminds us that if we look at our lives as a whole (a spiritual goal many of us after never questioned), \"when things go wrong, the entire screen turns dark.\"  Instead, the author says, imagine yourself as \"a consortium of personae,\" rather than as a fixed identity--because otherwise, Church says, we will inevitably think either too much or too little of ourselves.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Beacon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Three Weeks with My Brother",
        "Authors": "By Sparks, Nicholas and Sparks, Micah",
        "Description": "As moving as his bestselling works of fiction, Nicholas Sparks's unique memoir, written with his brother, chronicles the life-affirming journey of two brothers bound by memories, both humorous and tragicIn January 2003, Nicholas Sparks and his brother, Micah, set off on a three-week trip around the globe. It was to mark a milestone in their lives, for at thirty-seven and thirty-eight respectively, they were now the only surviving members of their family. Against the backdrop of the wonders of the world and often overtaken by their feelings, daredevil Micah and the more serious, introspective Nicholas recalled their rambunctious childhood adventures and the tragedies that tested their faith. And in the process, they discovered startling truths about loss, love, and hope.Narrated with irrepressible humor and rare candor, and including personal photos, THREE WEEKS WITH MY BROTHER reminds us to embrace life with all its uncertainties...and most of all, to cherish the joyful times, both small and momentous, and the wonderful people who make them possible.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Stern Men",
        "Authors": "By Gilbert, Elizabeth",
        "Description": "On two remote islands off the coast of Maine, the local lobstermen have fought savagely for generations over the fishing rights to the ocean waters between them. Young Ruth Thomas is born into this feud, the daughter of one of the greediest lobstermen in Maine. Eighteen years old, as smart as a whip, and irredeemably unromantic, Ruth returns home from boarding school determined to throw her education overboard and join the \"stern men.\"  As the feud escalates, she helps work the lobster boats, brushes up on her profanity, and eventually falls for Owney Wishnell, a handsome young lobsterman. \"Funny, clever and wise\" (Seattle Times), STERN MEN captures a feisty American spirit through this unforgettable heroine who is destined for greatness despite herself.",
        "Category": " Fiction , Literary",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Uses of Enchantment: A Novel (Vintage Contemporaries)",
        "Authors": "By Julavits, Heidi",
        "Description": "One Autumn day in 1985, sixteen-year-old Mary Veal vanishes from her Massachusetts prep school. A few weeks later she reappears unharmed and with little memory of what happened to her--or at least little that she is willing to share.  Was Mary abducted, or did she fake her disappearance? This question haunts Mary's family, her psychologist, even Mary herself. Weaving together three narratives, The Uses of Enchantment conjures a spell in which the hallucinatory power of a young woman’s sexuality, and her desire to wield it, has devastating consequences for all involved.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Wolves Eat Dogs (5) (The Arkady Renko Novels)",
        "Authors": "By Smith, Martin Cruz",
        "Description": "A Moscow detective is sent to Chernobyl for a frightening case in the most spectacular entry yet in Martin Cruz Smith’s Arkady Renko series.In his groundbreaking Gorky Park, Martin Cruz Smith created an iconic detective of contemporary fiction. Quietly subversive, brilliantly analytical, and haunted by melancholy, Arkady Renko survived, barely, the journey from the Soviet Union to the New Russia, only to find his transformed nation just as obsessed with corruption and brutality as was the old Communist dictatorship. In Wolves Eat Dogs, Renko returns for his most enigmatic and baffling case yet: the death of one of Russia’s new billionaires, which leads him to Chernobyl and the Zone of Exclusion—closed to the world since 1986’s nuclear disaster. It is still aglow with radioactivity, now inhabited only by the militia, shady scavengers, a few reckless scientists, and some elderly peasants who refuse to relocate. Renko’s journey to this ghostly netherworld, the crimes he uncovers there, and the secrets they reveal about the New Russia make for an unforgettable adventure.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Best American Mystery Stories 2001 (The Best American Series)",
        "Authors": "By Penzler, Otto (EDT) and Block, Lawrence (EDT)",
        "Description": "Best-selling author Lawrence Block is one of the mystery genre’s most prolific authors, with more than fifty books to his name, including Hit List, published in 2000. Block’s selections for The Best American Mystery Stories 2001 include stories by such luminaries as Joyce Carol Oates, T. Jefferson Parker, Russell Banks, and Peter Robinson.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Shutterbabe: Adventures in Love and War",
        "Authors": "By Kogan, Deborah Copaken",
        "Description": "Fresh out of college and passionate about photography, Deborah Copaken Kogan moved to Paris in 1988 and began knocking on photo agency doors, begging to be given a photojournalism assignment. Within weeks she was on the back of a truck in Afghanistan, the only woman—and the only journalist—in a convoy of mujahideen, the rebel “freedom fighters” at the time. She had traveled there with a handsome but dangerously unpredictable Frenchman, and the interwoven stories of their relationship and the assignment set the pace for Shutterbabe’s six chapters, each covering a different corner of the globe, each linked to a man in Kogan’s life at the time.From Zimbabwe to Romania, from Russia to Haiti, Kogan takes her readers on a heartbreaking yet surprisingly hilarious journey through a mine-strewn decade, seamlessly blending her personal battles—sexism, battery, life-threatening danger—with the historical ones—wars, revolution, unfathomable suffering—it was her job to record.",
        "Category": " Biography & Autobiography , Artists, Architects, Photographers",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Astrid and Veronika",
        "Authors": "By Olsson, Linda",
        "Description": "With extraordinary emotional power, Linda Olsson&#146;s stunningly well-crafted debut novel recounts the unusual and unexpected friendship that develops between two women. Veronika, a young writer from New Zealand, rents a house in a small Swedish village as she tries to come to terms with a recent tragedy while also finishing a novel. Her arrival is silently observed by Astrid, an older, reclusive neighbor who slowly becomes a presence in Veronika&#146;s life, offering comfort in the form of companionship and lovingly prepared home-cooked meals. Set against a haunting Swedish landscape, Astrid & Veronika is a lyrical and meditative novel of love and loss, and a story that will remain with readers long after the characters&#146; secrets are revealed.",
        "Category": " Fiction , Women",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The New Kings of Nonfiction",
        "Authors": "By Glass, Ira (EDT)",
        "Description": "A collection of stories-some well known, some more obscure- capturing some of the best storytelling of this golden age of nonfiction.  An anthology of the best new masters of nonfiction storytelling, personally chosen and introduced by Ira Glass, the producer and host of the award-winning public radio program This American Life.  These pieces-on teenage white collar criminals, buying a cow, Saddam Hussein, drunken British soccer culture, and how we know everyone in our Rolodex-are meant to mesmerize and inspire.",
        "Category": " Social Science , Essays",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Casanova in Bolzano",
        "Authors": "By Marai, Sandor and Szirtes, George (TRN)",
        "Description": "Another rediscovered masterpiece from the Hungarian novelist whose Embers became an international bestseller—a sensuous, suspenseful, aphoristic novel about the world’s most notorious seducer and the encounter that changes him forever. In 1756 Giacomo Casanova escapes from a Venetian prison and resurfaces in the Italian village of Bolzano. Here he receives an unwelcome visitor: the aging but still fearsome Duke of Parma, who years before had defeated Casanova in a duel over a ravishing girl named Francesca and spared his life on condition that he never see her again. Now the duke has taken Francesca as his wife—and intercepted a love letter from her to his old rival. Rather than kill Casanova on the spot, he makes him a startling offer, one that is logical, perverse, and irresistible. Turning an historical episode into a dazzling fictional exploration of the clasp of desire and death, Casanova in Bolzano is further proof that Sándor Márai is one of the most distinctive voices of the twentieth century.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Confessions (Private, Book 4)",
        "Authors": "By Brian, Kate",
        "Description": "Sometimes the truth hurts....    Reed Brennan came to superposh Easton Academy to make a brand-new life for herself. At first it seemed as though her dream had come true-she was living in the ultraexclusive Billings Hall, hanging out with the all-powerful Billings Girls, and dating the very hot Thomas Pearson. But Thomas turned out to be different from what she thought...and then he turned up dead. And if that wasn't twisted enough, Reed's new boyfriend, Josh Hollis, was arrested for Thomas's murder.   Now everyone is back to worrying about the regular stuff, like how to sneak to the boys' dorms at night, whether two-ply cashmere is warm enough for fall, and whether to fly to London or Barcelona for Thanksgiving break.   Everyone except for Reed.   Reed is convinced that Josh is innocent, which means the killer is still out there. Now it's up to Reed to uncover the truth. But the deeper she digs, the more secrets she unearths and the closer she gets to the confession that will change everything...if she's alive to hear it.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Insiders' Guide to Virginia's Chesapeake Bay (7th ed)",
        "Authors": "By Hartman, Sally Kirby and Ingersoll, Ridgely",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Insiders Guides",
        "Price Starting With ($)": "11.18",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Washington, D.C. for Families (Washinton D.C. For Families)",
        "Authors": "By Lain, Larry and Lain, Barb (ILT)",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Interlink Pub Group Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    }
]