[
    {
        "Title": "Abiyoyo",
        "Authors": "By Hays, Michael (ILT) and Seeger, Pete",
        "Description": "Outcasts become heroes in this picture book adaptation of a South African lullaby and folk story.No one wants to hear the little boy play his ukelele anymore...Clink, clunk, clonk. And no one wants to watch his father make things disappear...Zoop! Zoop! Until the day the fearsome giant Abiyoyo suddenly appears in town, and all the townspeople run for their lives and the lives of their children! Nothing can stop the terrible giant Abiyoyo, nothing, that is, except the enchanting sound of the ukelele and the mysterious power of the magic wand.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Alfred Stieglitz",
        "Authors": "By Eva Weber",
        "Description": "More than seventy classic black-and-white photographs showcase the talent of one of the world's greatest photographers, tracing the evolution of his career and including photographs of his wife, Georgia O'Keeffe.",
        "Category": "",
        "Publisher": "Crescent Books",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Coordinating the Internet",
        "Authors": "By Kahin, Brian (EDT) and Keller, James (EDT)",
        "Description": "For years, the world saw the Internet as a creature of theU.S. Department of Defense. Now some claim that the Internet is aself-governing organism controlled by no one and needing nooversight. Although the National Science Foundation and othergovernment agencies continue to support and oversee criticaladministrative and coordinating functions, the Internet is remarkablydecentralized and uninstitutionalized. As it grows in scope,bandwidth, and functionality, the Internet will require greatercoordination, but it is not yet clear what kind of coordinatingmechanisms will evolve. The essays in this volume clarify these issues and suggest possiblemodels for governing the Internet. The topics addressed range fromsettlements and statistics collection to the sprawling problem ofdomain names, which affects the commercial interests of millions ofcompanies around the world. One recurrent theme is the inseparabilityof technical and policy issues in any discussion involving theInternet.ContributorsGuy Almes, Ashley Andeen, Joseph P. Bailey, Steven M. Bellovin, ScottBradner, Richard Cawley, Che-Hoo Cheng, Bilal Chinoy, K Claffy, MariaFarnon, William Foster, Alexander Gigante, Sharon Eisner Gillett, MarkGould, Eric Hoffman, Scott Huddle, Joseph Y. Hui, David R. Johnson, Mitchell Kapor, John Lesley King, Lee W. McKnight, Don Mitchell, Tracie Monk, Milton Mueller, Carl Oppedahl, David G.Post, YakovRekhter, Paul Resnick, A. M. Rutkowski, Timothy J. Salo, PhilipL. Sbarbaro, Robert Shaw. A publication of the Harvard Information Infrastructure Project",
        "Category": " Computers , Networking , General",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Ten Speed Babysitter",
        "Authors": "By Herzig, Alison Cragin and Mali, Jane Lawrence",
        "Description": "In a coastal town in Connecticut, a fourteen-year-old babysitter's job is filled with suprises when his employer jets off to the Caribbean for the weekend and leaves him in charge of a toddler.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Creative Window Treatments:  Forty-Five Styles Shown Step-by-Step",
        "Authors": "By .",
        "Description": "",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Sheltering Sky",
        "Authors": "By Bowles, Paul",
        "Description": "The story of three American travelers adrift in the cities and deserts of North Africa after World War II examines the way Americans apprehend an alien culture and the way their incomprehension destroys them.",
        "Category": " Fiction , Psychological",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Surviving the Money Jungle - Student Workbook: A Junior High Study in Handling Money",
        "Authors": "By Burkett, Larry",
        "Description": "",
        "Category": "",
        "Publisher": "Focus on the Family Pub",
        "Price Starting With ($)": "26.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Nantucket: Seasons on the Island",
        "Authors": "By Hazlegrove, Cary",
        "Description": "A tiny haven 30 miles off the coast of Massachusetts, Nantucket is one of America's few remaining island treasures. From its cheerful, red cranberry bogs in the fall and the quiet desolation of winter to its profusion of daffodils in the spring and warm, sunny beaches in summer, Nantucket lends itself perfectly to the camera's lens. In this evocative volume, longtime resident and renowned photographer Cary Hazlegrove has captured the essence of Nantucket with a selection of her most memorable images of the island -- a breathtaking aerial view of a beach, a charming detail of cobblestones, the striking composition of a lighthouse, a heartbreaking sweep of the moors. Accompanied by poignant, often humorous quotes from Nantucket locals and a thoughtful introduction by Pulitzer Prize-winning writer and part-time resident David Halberstam, this book provides a constant source of dreams and inspirations.",
        "Category": " Travel , United States , Northeast , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Rising Sun",
        "Authors": "By Crichton, Michael",
        "Description": "During the grand opening celebration of the new American headquarters of an immense Japanese conglomerate, the dead body of a beautiful woman is found. The investigation begins, and immediately becomes a headlong chase through a twisting maze of industrial intrigue and a violent business battle that takes no prisoners. From the Paperback edition.",
        "Category": " Fiction , Thrillers , Technological",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "An Infinity of Little Hours: Five Young Men and Their Trial of Faith in the Western World's Most Austere Monastic Order",
        "Authors": "By Maguire, Nancy Klein",
        "Description": "In 1960, five young men arrived at the imposing gates of   Parkminster, the largest center of the most rigorous and   ascetic monastic order in the Western world: the   Carthusians. This is the story of their five-year journey   into a society virtually unchanged in its behavior and   lifestyle since its foundation in 1084.   An Infinity of Little Hours is a uniquely intimate portrait   of the customs and practices of a monastic order   almost entirely unknown until now. It is also a drama of   the men's struggle as they avoid the 1960s?the decade of   hedonism, music, fashion, and amorality?and enter an   entirely different era and a spiritual world of their own   making. After five years each must face a choice: to make   \"solemn profession\" and never leave Parkminster; or to   turn his back on his life's ambition to find God in solitude.   A remarkable investigative work, the book combines   first-hand testimony with unique source material to   describe the Carthusian life. And in the final chapter,   which recounts a reunion forty years after the events   described elsewhere in the book, Nancy Klein Maguire   reveals which of the five succeeded in their quest, and   which did not.",
        "Category": " Religion , Christian Rituals & Practice , General",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Teen Idol (Teen's Top 10 (Awards))",
        "Authors": "By Cabot, Meg",
        "Description": "",
        "Category": "",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Arthritis Helpbook: A Tested Self-Management Program for Coping with Arthritis and Fibromyalgia",
        "Authors": "By Lorig, Kate, Fries, James F., and Gecht, Maureen R.",
        "Description": "Offering a practical program to help people with arthritis and fibromyalgia manage their conditions, The Arthritis Helpbook provides techniques proven to reduce pain and increase dexterity, helping sufferers to regain control of their lives. Along with complete information on all over-the-counter and prescription arthritis medicines, The Arthritis Helpbook shows readers how to exercise for both flexibility and aerobic fitness and how to build a calcium-rich diet, thus maintaining their all-around health.Completely revised and updated with new illustrations and photographs, The Arthritis Helpbook, the basis of the Arthritis Foundation’s popular self-management courses, remains the best guide for all people coping with joint pain.",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Orson Welles: The Stories of His Life",
        "Authors": "By Conrad, Peter",
        "Description": "A fresh, provocative look at one of the most enigmatic figures in the history of film by \"one of our most acute cultural critics\" (Paul Fussell)Orson Welles was a metamorphic man, a magical shape-changer who made up myths about himself and permitted others to add to their store. On different occasions, he likened himself to Christ--mankind's redeemer--and to Lucifer--the rebel angel who brought about the fall.  His persona compounded the roles he played--kings, despots, generals, captains of industry, autocratic film directors--and the more or less fictitious exploits with which he regaled other people or which they attributed to him. Hailed in childhood as a genius, he remained mystified by his own promise, unable to understand or control an intellect that he came to think of as a curse; and he ended his days shilling wine and performing magic tricks on talk shows. At times, he saw the collapse of his early ambitions as a tragedy; in other moods, he viewed his life as a humbling comedy, and settled down--like another favorite character, Shakespeare's Falstaff --to eat, drink and be irresponsibly merry.Rather than producing another conventional biography of Welles, Peter Conrad has set out to investigate the stories Welles told about his life--the myths and secret histories hidden in films both made and unmade, in the books Welles wrote and those he read. The result takes us deep into Welles' imagination, showing how he created, then ultimately destroyed himself.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Faber & Faber",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Sword of San Jacinto: A Life of Sam Houston",
        "Authors": "By De Bruhl, Marshall",
        "Description": "Sam Houston was one of the most remarkable figures in American history. He was a native of Virginia who as a soldier, statesman, and adventurer made his mark on the frontier in Tennessee and the Arkansas Territory and then went on to dominate the early history of Texas.Now, drawing on newly accessible archival material, in particular the more than five thousand letters and documents in the Andrew Jackson Houston Collection of the Texas State Archives, historian Marshall De Bruhl vividly re-creates the career of this larger-than-life hero. In a narrative brimming with fascinating details, De Bruhl captures Houston in all his complexity.A frontiersman who lived among the Cherokee Indians for many years - he was the adopted son of Chief Ooleteka and a full citizen of the Cherokee Nation - Houston became a passionate defender of Indian rights.As a soldier, Sam Houston served under Andrew Jackson in the War of 1812 - and ensured Texas independence in 1836 with his astonishing victory over Santa Anna and the Mexican army at San Jacinto.As a politician, Houston was a Tennessee congressman at age thirty and then governor at age thirty-six. He then went on to be the first elected president of the Republic of Texas and one of the first senators from the new state. Because of his ardent defense of the Union and his refusal to swear allegiance to the Confederacy, he was deposed as governor of Texas in 1861.Houston's personal life was as tumultuous as his political and military careers. He married three times, always to much younger women. The first marriage, to an eighteen-year-old, ended mysteriously when she left him only eleven weeks later, whereupon he resigned the governorship of Tennessee and fled to the west and exile among his old Cherokee friends. It was there he married Tiana, the beautiful niece of Chief Ooleteka. Years later, at age forty-six, he married a woman of twenty, who bore eight children during their devoted and happy marriageAlthough Houston died ignored and vilified by those whose independence he had ensured, the eclipse of his reputation was brief. His fellow Texans soon acknowledged his central place in their history, and he is revered today as the father of Texas and its greatest hero.Sword of San Jacinto is a magnificent bicentennial-birthday tribute to a great Texan and a great American.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Infamous Scribblers: The Founding Fathers and the Rowdy Beginnings of American Journalism",
        "Authors": "By Burns, Eric",
        "Description": "Infamous Scribblers is a perceptive and witty exploration of   the most volatile period in the history of the American   press. News correspondent and renonwned media historian   Eric Burns tells of Ben Franklin, Alexander Hamilton   and Sam Adams?the leading journalists among the   Founding Fathers; of George Washington and John Adams,   the leading disdainers of journalists; and Thomas   Jefferson, the leading manipulator of journalists. These   men and the writers who abused and praised them in print   (there was, at the time, no job description of \"journalist\")   included the incendiary James Franklin, Ben's brother and   one of the first muckrakers; the high minded Thomas   Paine; the hatchet man James Callender, and a rebellious   crowd of propagandists, pamphleteers, and publishers. It   was Washington who gave this book its title. He once wrote   of his dismay at being \"buffited in the public prints by a set   of infamous scribblers.\"   The journalism of the era was often partisan, fabricated,   overheated, scandalous, sensationalistic and sometimes   stirring, brilliant, and indispensable. Despite its   flaws?even because of some of them?the participants   hashed out publicly the issues that would lead America to   declare its independence and, after the war, to determine   what sort of nation it would be.",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Flour Pot Cookie Book: Creating Edible Works of Art",
        "Authors": "By Greenberg, Margie and Greenberg, Abbey",
        "Description": "Why wait for the holidays to bake and decorate cookies? Let Margie and Abbey Greenberg show you how to make beautiful and easy cookies that are perfect for gifts year-round--plus, they taste great! The Flour Pot Cookie Book is a fun and fanciful exploration into the world of cookie decoration, featuring designs for all occasions, or for no occasion at all. People will think these cookies are almost too pretty to eat! With more than 40 decoration ideas, grouped by theme, this book is a sure-hit with home bakers.",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "Running Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "An Illustrated History of Seaplanes and Flying Boats",
        "Authors": "By Allward, Maurice",
        "Description": "",
        "Category": "",
        "Publisher": "Marboro Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Chocolate for a Woman's Soul: 77 Stories to Feed Your Spirit and Warm Your Heart",
        "Authors": "By Allenbaugh, Kay (EDT)",
        "Description": "Treat yourself to 77 true stories that celebrate life and capture the essence of what it means to be a woman. Like chocolate, these stories soothe, satisfy, and delight -- better yet, they're good for you! Written by and for women, here are heartfelt insights on commitment, compassion, work, marriage, friendship, motherhood, love, courage, spirituality, passion, and dozens of other topics. Contributors share their most personal experiences -- funny, poignant, powerful, and uplifting -- as they inspire you to jump-start your own life, discover your talents and vocations, overcome old fears, find love, and let your dreams take flight. Like a box of chocolates, this book can be enjoyed in one sitting, or you can pick out treats at random and savor them one at a time. Whether you want a good laugh or need a good cry, the perfect \"chocolate story\" is right here, waiting for you!",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "How to Turn an Interview Into a Job",
        "Authors": "By Allen, Jeffrey G.",
        "Description": "Here is the inescapable truth about getting a job: the interview is almost all that matters. As for everything else -- research, resumes, letters, phone calls -- it's all here as backup for that crucial meeting.  People who interview successfully are the people who are promoted faster, have increased self-esteem, and move faster and higher on the corporate track than anyone else. Focusing on time-tested techniques that can move job applicants from a position of weakness and uncertainty to one of confidence and power, America's leading placement attorney, Jeffrey Allen, presents sound, step-by-step advice on the A to Z of successful interviewing.  Here is the inescapable truth about getting a job: the interview is almost all that matters. As for everything else -- research, resumes, letters, phone calls -- it's all here as backup for that crucial meeting.  People who interview successfully are the people who are promoted faster, have increased self-esteem, and move faster and higher on the corporate track than anyone else. Focusing on time-tested techniques that can move job applicants from a position of weakness and uncertainty to one of confidence and power, America's leading placement attorney, Jeffrey Allen, presents sound, step-by-step advice on the A to Z of successful interviewing.",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster Inc./New York",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Do What You Are: Discover the Perfect Career for You Through the Secrets of Personality Type",
        "Authors": "By Tieger, Paul D. and Barron-Tieger, Barbara",
        "Description": "Helping readers discover the secret to career happiness and success, a unique career guide helps readers identify their personality \"type\" and use this information to find the right job. Original. 35,000 first printing. $25,000 ad/promo. Tour.",
        "Category": "",
        "Publisher": "Little Brown & Co (P)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "The Mouse and the Motorcycle",
        "Authors": "By Cleary, Beverly and Darling, Louis (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Transportation , General",
        "Publisher": "Houghton Mifflin School",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Glass Books of the Dream Eaters",
        "Authors": "By Dahlquist, Gordon",
        "Description": "With translation rights sold in twenty-five countries, Gordon Dahlquist’s spectacular and extraordinary debut novel was one of the most-talked-about acquisitions of 2005. Now this monumental Victorian thriller is destined to be the publishing sensation of 2006.It began with a simple note: a letter of rejection from Miss Temple’s fiancé, written on crisp Ministry paper and delivered on her maid’s silver tray. But for Miss Temple, Roger Bascombe’s cruel rejection will ignite a harrowing quest for answers, plunging her into a mystery as dizzying as a hall of mirrors—and a remote estate where danger abounds and all inhibitions are stripped bare.…Thus begins Gordon Dahlquist’s debut novel of Victorian suspense—at once a dazzling feast for the senses and a beguiling, erotic literary adventure.Nothing could have prepared Miss Temple for where her pursuit of Roger Bascombe would take her—or for the shocking things she would find behind the closed doors of forbidding Harschmort Manor: men and women in provocative disguise, acts of licentiousness and violence, heroism and awakening. But she will also find two allies: Cardinal Chang, a brutal assassin with the heart of a poet, and a royal doctor named Svenson, at once fumbling and heroic—both of whom, like her, lost someone at Harschmort Manor. As the unlikely trio search for answers—hurtling them from elegant brothels to gaslit alleyways to shocking moments of self-discovery-- they are confronted by puzzles within puzzles. And the closer they get to the truth, the more their lives are in danger. For the conspiracy they face—an astonishing alchemy of science, perverted religion, and lust for power—is so terrifying as to be beyond belief.In a novel that shatters conventions and seethes with danger and eroticism, Gordon Dahlquist has made a spectacular literary debut. And in Miss Temple he has created an unforgettable guide through a disturbing, seductive, and all-too-real world. By turns brutal and tender, shocking and deliciously romantic, The Glass Books of The Dream Eaters is a novel for the ages, a bold and brilliant work of the imagination",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Sticky Fingers",
        "Authors": "By Burnham, Niki and Corral, Rodrigo",
        "Description": "Busting my a &#143; &#143; makes me feel good.  Bulletproof, that's how Jenna Kassarian sees herself. It's all about control: As long as she works hard, nothing can hurt her. So Jenna constantly pushes -- for perfect grades, the ideal boyfriend, the best, best friend.  The only problem is, she doesn't know if she can stop. If she relaxes even for a second, she's afraid she'll lose control completely.  Then Jenna decides it's now or never. She goes to a party and has one drink. But one drink is all it takes for her perfect facade to shatter. Suddenly she realizes straight A's can't protect you in the real world.",
        "Category": " Young Adult Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "First Lensman (Classic Lensman, Bk. 2)",
        "Authors": "By Edward E. Smith",
        "Description": "",
        "Category": "",
        "Publisher": "Ripping Publishing",
        "Price Starting With ($)": "6.65",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Builders of the dawn: Community lifestyles in a changing world",
        "Authors": "By McLaughlin, Corinne",
        "Description": "Looks at modern alternative communities, describes their approaches to community problems and conflicts, and considers the history and future of these communities",
        "Category": "",
        "Publisher": "Stillpoint Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Meditation: The Light from Within : Edgar Cayce's Approach to Life's Challenges",
        "Authors": "By Glover, Harry",
        "Description": "",
        "Category": " Religion , Meditations",
        "Publisher": "Are Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Birds & Bees: A Sexual Study",
        "Authors": "By Stermer, Dugald",
        "Description": "Birds & Bees: A Sexual Study is an intriguing, provocative and exquisitely-illustrated work exploring the fascinating world of procreation and sexual behavior. It is an intimate and revealing portrait of the animal kingdom engaged in life's most essential activity.Internationally-acclaimed illustrator Dugald Stermer presents this extraordinary visual essay on the rituals of courtship and seduction and, of course, the sex act itself. The book focuses on three stages of mating: Foreplay - the rituals of display, dispute and seduction; Mating - from engagement to exchange; and Procreation - waiting, watching, and protecting.Stermer's beautifully expressive watercolors and accompanying text offer a remarkable perspective on this world of dance, harems, group sex and cannibalism. It is a world where abstinence or chastity is never an option, except between humans.",
        "Category": " Science , General",
        "Publisher": "Collins Pub San Francisco",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Sleeping on the Wing: An Anthology of Modern Poetry with Essays on Reading and Writing",
        "Authors": "By Koch, Kenneth and Farrell, Kate",
        "Description": "This book is specifically for high school students, though it is useful to college students and anyone interested in the art and craft of poetry. Koch and Farrell, experienced teachers as well as poets, write about poetry in such a way that students will find it accessible and interesting. The book includes selections of poetry by twenty-three poets, among them Dickinson, Hopkins, Pound, Williams and Eliot, as well as Ginsberg, O'Hara, Baraka and Ashbery. There is also the translated work of such modern European poets such as Lorca, Rilke, Rimbaud, Apollinaire and Mayakowsky.",
        "Category": " Poetry , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Image (ANGEL)",
        "Authors": "By Odom, Mel",
        "Description": "Even if it takes an eternity, he will make amends....Picture PerfectCordelia has a vision of a young child being attacked by a squid-like demon at the same time that Gunn is rescuing a young artist whose studio has been attacked by vampires. When Cordelia goes to investigate the mansion of her vision, she finds herself surrounded by baby products, portraits...and chased by a many-tentacled monster. When Angel arrives on the scene, he's shocked to discover that he recognizes some of the subjects of the portraits. Distant memories of a night spent with storytellers Mary and Percy Shelley recall an artist Darla, his longtime paramour and partner in crime, once favored. But can that artist still be alive today? An ancient evil is using a painting to keep its body alive and intact, and in the meantime is preying on a child. In the process of saving the child, Cordelia, Angel, Gunn, and Wesley are going to learn -- the hard way -- that looks aren't everything.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Hanging Baskets, Window Boxes, And Other Container Gardens: A Guide To Creative Small-Scale Gardening",
        "Authors": "By Joyce, David",
        "Description": "Discusses the principles and techniques of container gardening, and provides advice on choosing, planting, and cultivating different types of containers",
        "Category": " Gardening , Container",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Garlic (The Basic Flavorings Series)",
        "Authors": "By Merrell, James (PHT) and Gordon-Smith, Clare",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "I'd Rather Be Dancing",
        "Authors": "By Ryan, Mary E.",
        "Description": "Leaving her old boyfriend behind in Brooklyn when she moves to Manhattan and enrolls in a summer progam at a prestigious dance academy, sixteen-year-old Katie finds painful romance and difficult career choices",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "All About Land Hermit Crabs",
        "Authors": "By Roberts, Mervin F.",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "De Grazia a Biographical Sketch",
        "Authors": "By De Grazia",
        "Description": "",
        "Category": "",
        "Publisher": "Gallery in The Sun",
        "Price Starting With ($)": "10.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Liberty Under Attack: Reclaiming Our Freedoms in an Age of Terror",
        "Authors": "By Leone, Richard C. (EDT) and Anrig, Greg, Jr. (EDT)",
        "Description": "In 2003, when PublicAffairs and The Century Foundation published an essay collection called The War on Our Freedoms, there was the possibility and the  hope that the risks to our liberties would be temporary?a brief era of reaction to already terrible events arising in the wake of 9/11. Today, we understand that the changes set in motion five years ago have broadened as the struggle against terrorism continues.In this sequel, experts and activists including Alan Brinkley and Joseph Lelyveld, legal scholars Kathleen Sullivan and Stephen Schulhofer, and former government officials John Podesta and Bill Bradley report on the diverse actions, taken in the name of security, that will serve to undermine American liberties, and explain why the consequences of these actions are ultimately counterproductive in preventing future terrorism.Today, we clearly see a disturbing pattern of undermining the judiciary, intimidating the press, and invading personal privacy. At the same time, government  actions have fueled hostility to America in the world at large and in Islamic communities in particular. The terrorists threaten our liberty, but they are not the only ones.",
        "Category": " Political Science , Political Freedom & Security , Civil Rights",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Little People Big Book About Animals",
        "Authors": "By Time-Life Books (EDT) and Ren",
        "Description": "A collection of traditional, original, and non-fiction stories, questions and answers, poems, songs, games, and activities associated with animals.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Little People Big Book about the Animal Kingdom",
        "Authors": "By",
        "Description": "A collection of original stories, folktales, informational articles, poetry, activities, and games about animals.",
        "Category": "",
        "Publisher": "Time-Life for Children",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The South Beach Diet: The Delicious, Doctor-Designed, Foolproof Plan for Fast and Healthy Weight Loss",
        "Authors": "By Agatston, Arthur, M.D.",
        "Description": "For years, cardiologist Arthur Agatston, M.D., urged his patients to lose weight for the sake of their hearts, but every diet was too hard to follow or its restrictions were too harsh. Some were downright dangerous. Nobody seemed to be able to stick with low-fat regiments for any length of time. And a diet is useless if you can't stick with it.So Dr. Agatston developed his own. The South Beach Diet isn't complicated and doesn't require that you go hungry. You'll enjoy normal size helpings of meat, poultry, and fish. You'll also eat eggs, cheese, nuts, and vegetables. Snacks are required. You'll learn to avoid the bad carbs, like white flour, white sugar, and baked potatoes. Best of all, as you lose weight, you'll lose that stubborn belly fat first!Dr. Agatston's diet has produced consistently dramatic results (8 to 13 pounds lost in the first 2 weeks!) and has become a media sensation in South Florida. Now you, too, can join the ranks of the fit and fabulous with The South Beach Diet.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Microsoft SQL Server 7.0 Administrator's Pocket Consultant",
        "Authors": "By Stanek, William R.",
        "Description": "Ideal at the desk or as a portable reference for the office, this book provides database administrators with hands-on reference needed to solve problems with a concise, direct approach, and delivers quick reference support for infrequently used steps and hands-on tasks.",
        "Category": " Computers , Networking , Local Area Networks (LANs)",
        "Publisher": "Microsoft Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Cinders & Smoke: A Mile by Mile Guide for the Durango & Silverton Narrow Gauge Railroad",
        "Authors": "By Osterwald, Doris B.",
        "Description": "",
        "Category": "",
        "Publisher": "Western Guideways",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Under a Wing",
        "Authors": "By Lindbergh, Reeve",
        "Description": "",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Poolbeg Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Jesus/Now",
        "Authors": "By Brandt, Leslie F.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Concordia Pub House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "Diversity of creatures",
        "Authors": "By Kipling, Rudyard",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1917"
        }
    },
    {
        "Title": "American Red Cross Community First Aid and Safety",
        "Authors": "By American National Red Cross",
        "Description": "",
        "Category": "",
        "Publisher": "Amer Red Cross",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "American Cancer Society's Guide to Complementary and Alternative Cancer Methods",
        "Authors": "By Rosenthal, David S., M.D. (FRW)",
        "Description": "Helps patients and families evaluate claims for cancer cures or treatments found on the Internet and in the popular press. Entries on specific methods offer review and evaluation of each method, its history, evidence for its claims, and possible complications or dangers. Entries are organized in sections on mind, body, and spirit methods; manual healing and physical touch methods; herb, vitamin, and mineral methods; diet and nutrition; and pharmacological and biological treatment methods. Overview chapters discuss safety and regulatory issues and insurance coverage, and give guidelines for using complementary and alternative methods. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Health & Fitness , Diseases , Cancer",
        "Publisher": "Amer Cancer Society",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Few: The American \"\"Knights of the Air\"\" Who Risked Everything to Fight in the Battle of Britain",
        "Authors": "By Kershaw, Alex",
        "Description": "By the summer of 1940 World War II had been under way for nearly a year. Hitler was triumphant and planning an invasion of England. But the United States was still a neutral country and, as Winston Churchill later observed, \"the British people held the fort alone.\" A few Americans, however, did not remain neutral. They joined Britain's Royal Air Force to fight Hitler's air aces and help save Britain in its darkest hour. The Few is the never-before-told story of these thrill-seeking Americans who defied their country's neutrality laws to fly side-by-side with England's finest pilots. They flew the lethal and elegant Spitfire, and became \"knights of the air.\" With minimal training and plenty of guts they dueled the skilled pilots of Germany's Luftwaffe in the blue skies over England. They shot down several of Germany's fearsome aces, and were feted as national heroes in Britain. By October 1940, they had helped England win the greatest air battle in the history of aviation. At war's end, just one of the \"Few\" would be alive. The others died flying, wearing the RAF's dark blue uniform-each with a shoulder patch depicting an American eagle. As Winston Churchill said, \"Never in the field of human conflict was so much owed by so many to so few.\"",
        "Category": " History , Military , Aviation",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Beginning Java Objects: From Concepts to Code",
        "Authors": "By Barker, Jacquie",
        "Description": "",
        "Category": " Computers , Programming , Object Oriented",
        "Publisher": "Wrox Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Inner Cleansing: How to Free Youself from Joint-Muscle-Artery-Circulation Sludge",
        "Authors": "By Wade, Carlson",
        "Description": "",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Deliberate Speed: The Origins of a Cultural Style in the American 1950s",
        "Authors": "By Lhamon, W. T., Jr.",
        "Description": "",
        "Category": " History , United States , 20th Century",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Goliath:The Life of Robert Schuller",
        "Authors": "By Penner, James",
        "Description": "Recounts the life of the popular evangelist, describes how he built the Crystal Cathedral, and discusses his encounters with his fears, an experience he describes as \"facing Goliath\"",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "New Hope Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "A Serious Way of Wondering: The Ethics of Jesus Imagined",
        "Authors": "By Price, Reynolds",
        "Description": "When renowned novelist and poet Reynolds Price, one of Christianity's most eloquent outlaws, was invited to deliver the annual Peabody Lecture at Harvard University Memorial Church in 2001, he chose to explore a subject that has produced fierce debate -- even wars and crusades -- and is still intensely relevant today: the ethics of Jesus. In two succeeding lectures at the National Cathedral and at Auburn Seminary, he continued the theme, exploring not only the apparently contradictory ethics that Jesus articulates in the Gospels but also constructing scenes that present Jesus with urgent dilemmas he never confronts there. In A Serious Way of Wondering, Price greatly expands those lectures and imagines Jesus in moments of confrontation with three problems of burning moral concern -- suicide, homosexuality, and the plight of women in male-dominated cultures and faiths.It was while teaching a university course on the Gospels of Mark and John that Price first explored the ancient idea of expanding upon the Gospel narratives with further encounters between Jesus and troubled persons. Price has previously documented his studies in Three Gospels, a book in which he not only translated Mark and John from the Greek -- and discussed them extensively -- but also provided a third gospel of his own making. Price based the third gospel closely on the earliest sources but imagined his way into some of their baffling omissions. He continued those explorations when he wrote provocative new scenes for the cover story on Jesus in one of Time magazine's millennium issues.Now, in this new book, Price offers a devoted and profoundly thought-provoking look at a subject that underlies vast areas of world civilization and has occupied the minds of many great thinkers. A sweeping view of the inescapable implications of Jesus' merciful life and all-embracing thought, and of the benefits of enlarging our notions of humane community, A Serious Way of Wondering is a significant contribution to Price's penetrating works of religious inquiry.",
        "Category": " Religion , Biblical Commentary , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Emma's Gift (The Wortham Family Series #2)",
        "Authors": "By Kelly, Leisha",
        "Description": "In Leisha Kelly's well-received novel, Julia's Hope, Samuel and Julia Wortham and their two children charmed readers as they found shelter in the home-and heart-of a grandmotherly woman named Emma Graham.  Now, in Emma's Gift, the Wortham family is struck down by the deaths of two close friends, including their neighbor Wilametta Hammond, just days before Christmas 1931. Wila is the mother of ten children and the glue that holds the family together. In his grief, her husband, George, ignores the children and has no will to live. Sam and Julia step in to help, but how can they manage ten extra children when they barely have enough for themselves? Can George overcome his grief and become the father his children need? And if Emma's nephew takes ownership of her land, will the Worthams be allowed to stay?  Masterfully told from the perspective of both Samuel and Julia, Emma's Gift is an unforgettable story of God's faithfulness and peace and of the seasons of life that shape each of us.",
        "Category": " Fiction , Historical",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Miss Daisy Celebrates Tennessee",
        "Authors": "By Crutchfield, James A., King, Daisy, and Sparkman, Winette",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Hillsboro Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Letters to My Daughter: A Father Writes About Torah and the Jewish Woman",
        "Authors": "By Orenstein, Walter",
        "Description": "Through a series of letters from a father to his college-age daughter, Dr. Walter Orenstein traces the role and the history of women in the Torah and shows, through text and commentary, that in traditional Jewish society the status of women is equal to that of men, though their function is often quite different. Letters to My Daughter: A Father Writes about Torah and the Jewish Woman introduces the reader to the Oral Law, to the exciting realm of Halakhah, and to some of the essential principles of Jewish philosophy.Although this work is addressed to a college student, it is meant for all women and men regardless of their backgrounds. Those who have a limited background in Jewish studies and seek an understanding of the principles of Jewish belief and the way that these principles impact upon her or his life will find this book a useful beginning to the world of Jewish scholarship.Those students whose Jewish education has taken them far beyond the rudiments of Torah knowledge but who are concerned with the status of women in Orthodox Judaism and lack the training to probe the sources on their own will find this book enlightening.This book also addresses itself to the Jewish man or woman who was raised in the secular world but who now searches for truth, meaning, and purpose in the Torah, hoping that its words will provide spiritual guidance, personal insight, and divine wisdom.",
        "Category": " Religion , Judaism , Sacred Writings",
        "Publisher": "Jason Aronson, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Quiet Places With Mary",
        "Authors": "By Powers, Isaias",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Twenty Third Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Warrior Marks: Female Genital Mutilation and the Sexual Blinding of Women",
        "Authors": "By Walker, Alice",
        "Description": "In her best-selling 1992 novel, Possessing the Secret of Joy, Alice Walker opened a painful door: she brought the issue of female genital mutilation, a practice that affects one hundred million of the world's women, to the attention of the reading public. For many readers, this first encounter with a subject previously unfamiliar to them was shocking and unforgettable.Alice Walker decided early in the process of writing her novel that she had not yet done enough to help stop this age-old practice. She resolved to make a documentary film that would further educate people about the harmful, sometimes deadly process of removing the clitoris - and often the remaining outer genitalia - as a means of maintaining tradition and ensuring a woman's \"cleanliness\" and fidelity. To make the film, Alice Walker teamed up with Indian-British filmmaker Pratibha Parmar, whose credits include several widely acclaimed documentaries focusing on issues of race, gender, and sexuality. This book chronicles their odyssey together.Warrior Marks describes a unique filmmaking journey, from Alice Walker's first letter to Pratibha Parmar proposing the idea of the film to the many journal entries and observations each of them made along the way. From California to England to Senegal, The Gambia, and Burkina Faso, Warrior Marks follows Walker and Parmar as they interview people who are concerned with and affected by the practice of female genital mutilation. The text includes transcripts of their interviews, three new poems by Alice Walker, and over fifty photographs offering a vivid and poignant portrayal of the people and places they visited.For its insights into the collaborative creative process, as well as its perceptions about the politics of filmmaking and the politics of feminism, Warrior Marks is an extraordinary volume. It is also the adventure of two remarkable women who together fulfilled a dream.",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Harcourt, Brace & Co.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Academic Job Search Handbook",
        "Authors": "By Heiberger, Mary Morris and Vick, Julia Miller",
        "Description": "The Academic Job Search Handbook provides an eminently practical and comprehensive overview of the process involved in searching for and obtaining an academic position. Based upon the authors' experience advising thousands of graduate students, the book is written in a style that is clear, straightforward, and \"user-friendly.\"The handbook begins with an examination of academic careers and institutional structures. It then takes the reader step-by-step through the application process, from developing relationships with advisors years before going on the market to making the most of a new position. Specific steps discussed include positioning oneself in the market; learning about job listings; preparing vitas, cover letters, and abstracts; establishing references; participating in conferences; and negotiating offers.Readers will find the search timetable, as well as the sample vitas and cover letters, particularly useful. Mary Morris Heiberger and Julia Miller Vick have also included an appendix of scholarly and professional associations, reinforcing their consistent emphasis on learning the conventions of one's own discipline.The Academic Job Search Handbook is a valuable contribution to the entire scholarly community. It will be an indispensable tool for candidates for academic positions, as well as for those who advise then, including graduate chairs, graduate advisors, and placement counselors.",
        "Category": "",
        "Publisher": "University of Pennsylvania Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Midnight in the Garden of Good and Evil: A Savannah Story",
        "Authors": "By Berendt, John",
        "Description": "Shots rang out in Savannah's grandest mansion in the misty,early morning hours of May 2, 1981.  Was it murder or self-defense?  For nearly a decade, the shooting and its aftermath reverberated throughout this hauntingly beautiful city of moss-hung oaks and shaded squares.  John Berendt's sharply observed, suspenseful, and witty narrative reads like a thoroughly engrossing novel, and yet it is a work of nonfiction.  Berendt skillfully interweaves a hugely entertaining first-person account of life in this isolated remnant of the Old South with the unpredictable twists and turns of a landmark murder case.It is a spellbinding story peopled by a gallery of remarkable characters: the well-bred society ladies of the Married Woman's Card Club; the turbulent young redneck gigolo; the hapless recluse who owns a bottle of poison so powerful it could kill every man, woman, and child in Savannah; the aging and profane Southern belle who is the \"soul of pampered self-absorption\"; the uproariously funny black drag queen; the acerbic and arrogant antiques dealer; the sweet-talking, piano-playing con artist; young blacks dancing the minuet at the black debutante ball; and Minerva, the voodoo priestess who works her magic in the graveyard at midnight.  These and other Savannahians act as a Greek chorus, with Berendt revealing the alliances, hostilities, and intrigues that thrive in a town where everyone knows everyone else.  Midnight in the Garden of Good and Evil is a sublime and seductive reading experience.  Brilliantly conceived and masterfully written, this enormously engaging portrait of a most beguiling Southern city has become a modern classic.",
        "Category": " True Crime , Murder , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Ortho's All About Shrubs and Hedges (Ortho's All About Gardening)",
        "Authors": "By O'Sullivan, Penelope and Ho'Sullivan, Penelope",
        "Description": "Shows homeowners how to effectively use shrubs for landscaping.Explains how to create showy effects that add beauty in all four seasons.Techniques for developing a new landscape that looks established right away.Tells how to create living walls, property boundaries, privacy screens, and ground covers.Ideas for creating a wide variety of formal effects that are especially easy to maintain.Pruning instructions for more than 125 recommended species.",
        "Category": " Gardening , Shrubs",
        "Publisher": "Ortho",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "My Friend Rabbit: A Picture Book (CALDECOTT MEDAL BOOK)",
        "Authors": "By Rohmann, Eric",
        "Description": "Rabbit saves the day in a most ingeneous way.When Mouse lets his best friend, Rabbit, play with his brand-new airplane, trouble isn't far behind. From Caldecott Honor award winner Eric Rohmann comes a brand-new picture book about friends and toys and trouble, illustrated in robust, expressive prints.My Friend Rabbit is the winner of the 2003 Caldecott Medal.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Roaring Brook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "You Are a Miracle: Waiting to Happen",
        "Authors": "By Houts, Ken",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Clueless Groom's Guide : More Than Any Man Should Ever Know About Getting Married",
        "Authors": "By Van Dijk, Peter",
        "Description": "This is not your father's wedding...From choosing china patterns and invitation designs to color schemes and reception halls, today's grooms are expected to play a much more active role in wedding planning than when their dads walked down the aisle.The Clueless Groom's Guide offers the 3 million men who get married each year lighthearted commiseration, guidance, and a distinctly male take on the entire process of planning a traditional wedding. Filled with humorous but useful advice and information on wedding issues, this essential guide covers:Buying the ring that'll make her say yes Dealing with the future in-laws in a way that will preserve the groom's sanity Planning the budget without draining anyone's account Negotiating a guest list with the bride, her family, and his family Navigating the all-important bachelor party And much more ! This charmingly illustrated book will not only help guys understand what they're in for--but give them a sorely needed chuckle along the way.",
        "Category": " Reference , Weddings",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Eric Carle's Opposites (The World of Eric Carle)",
        "Authors": "By Carle, Eric",
        "Description": "What?s the opposite of ordinary? Eric Carle?s Opposites! Unfold the full-page flaps to explore opposites with the art of Eric Carle. Short and tall, big and little, over and under!",
        "Category": " Juvenile Nonfiction , Concepts , Opposites",
        "Publisher": "World of Eric Carle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Art of Time (English and French Edition)",
        "Authors": "By Servan-Schreiber, Jean-Louis",
        "Description": "Discusses the nature of time, explains how to organize one's time, and suggests a technique to identify our priorities",
        "Category": " Psychology , General",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Digital Photographer's Handbook",
        "Authors": "By Ang, Tom",
        "Description": "Suitable for all level of techniques, this is the ultimate photographic handbook for the 21st century! This handbook encourages traditional photographers to experiment with new technology while inspiring experienced users to reach new heights. Readers learn how to get the most out of this new technology that's transforming the world of photography. From improving casual snapshots to learning the secrets of lighting, composition, and digital image manipulation, this book provides a practical, yet in-depth approach on producing better photographs. The Digital Photographer's Handbook includes comprehensive information on the most up-to-date equipment, software, and accessories.",
        "Category": " Photography , Techniques , Equipment",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "7.32",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Developing Cross-Cultural Competence: A Guide for Working With Children and Their Families",
        "Authors": "By Lynch, Eleanor W. (EDT) and Hanson, Marci J. (EDT)",
        "Description": "As the U.S. population grows more and more diverse, how can professionals who work with young children and families deliver the best services while honoring different customs, beliefs, and values? The answers are in the fourth edition of this bestselling textbook, fully revised to reflect nearly a decade of population changes and best practices in culturally competent service delivery.The gold-standard text on cross-cultural competence, this book has been widely adopted by college faculty and trusted as a reference by in-service practitioners for almost 20 years. For this timely NEW edition, the highly regarded authors have carefully updated and expanded every chapter while retaining the basic approach and structure that made the previous editions so popular. Professionals willGet a primer on cultural competence. Readers will examine how their own cultural values and beliefs shape their professional practice, how the worldviews of diverse families may affect their perceptions of programs and services, and how providers can communicate more effectively with families from different cultural backgrounds.Deepen their understanding of cultural groups. Learn from in-depth chapters with nuanced, multifaceted explorations of nine different cultural backgrounds: Anglo-European, American Indian, African American, Latino, Asian, Filipino, Native Hawaiian and Samoan, Middle Eastern, and South Asian. Readers will get up-to-date insights on history, demographics, traditions, values, and family structure, and they'll examine the diverse ways each culture approaches child rearing, medical care, education, and disability.Discover better ways to serve families. Readers will get concrete recommendations for providing more effective, sensitive, and culturally competent services to children and families. They'll find practical guidance for every step in the service delivery process, from initiating contact with families to implementing and evaluating services. Vivid case stories and photos bring the principles of cultural competence to life, and the helpful appendixes give professionals quick access to cultural courtesies and customs, key vocabulary words, significant cultural events and holidays, and more. Plus an expanded list of resources points readers to books, films, theater, and other media that will enhance their understanding of other cultures.New to this edition is a revised chapter on African American roots; thoroughly updated and expanded chapters; expanded coverage of disabilities; more on spiritual and religious diversity; and strategies for helping families make decisions about language use (English-only vs. preservation of native language). Equally valuable as a textbook and a reference for practicing professionals, this comprehensive book will prepare early interventionists and other professionals to work effectively with families whose customs, beliefs, and values may differ from their own.",
        "Category": " Social Science , Human Services",
        "Publisher": "Paul H Brookes Pub Co",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Devil's Right Hand (Dante Valentine, Book 3)",
        "Authors": "By Saintcrow, Lilith",
        "Description": "Dante Valentine, Necromancer and bounty hunter, just wants to be left alone. But the Devil has other ideas. The Prince wants Dante. And he wants her now. And Dante and her lover, Japhrimel, have no choice but to answer the Prince's summons. And to fulfill a seemingly simple task: become the Devil's Right Hand, hunt down four demons that have escaped from Hell, and earn His gratitude. It's a shame that nothing is ever easy when it comes to the Devil. Because of course, he doesn't tell Dante the whole truth: there is a rebellion brewing in Hell. And there is a good chance that Lucifer is about to be pushed off the throne. But Dante is getting really tired of being pushed around. And this time, she might be angry enough to take on the Devil himself...  Dante Valentine NovelsWorking for the DevilDead Man RisingDevil's Right HandSaint City SinnersTo Hell and BackDante Valentine (omnibus)For more from Lilith Saintcrow, check out: Gallow and RaggedTrailer Park FaeBannon and ClareThe Iron Wyrm AffairThe Red Plague AffairThe Ripper AffairThe Damnation Affair (e-only)Jill Kismet NovelsNight ShiftHunter's PrayerRedemption AlleyFlesh CircusHeaven's SpiteAngel TownJill Kismet (omnibus)A Romance of Arquitaine NovelsThe Hedgewitch QueenThe Bandit KingBlood Call (coming August 2015)",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Orbit",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Sharing Wisdom: The Practical Art of Giving and Receiving Mentoring",
        "Authors": "By Wicks, Robert J.",
        "Description": "As caring adults we give and receive informal mentoring every day. Sharing Wisdom offers us the opportunity to make the most of these natural encounters. This book offers forty brief lessons to make the process of offering and receiving mentoring clearer. The information is designed to be practical and readily usable and it is intended to help you nurture your natural talents as well as to better appreciate the guidance offered by others. The book ends with answers to common questions on mentoring, a summary list of the mentoring guidelines and a brief annotated bibliography.",
        "Category": " Social Science , Social Work",
        "Publisher": "Crossroad",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Women's Bodies, Women's Wisdom: Creating Physical and Emotional Health and Healing",
        "Authors": "By Northrup, Christiane and Northup, Christiane, M.D.",
        "Description": "A groundbreaking book on women's physical and emotional well-being, Women's Bodies, Women's Wisdom has become a classic, with more than 270,000 copies in print in the four years since its initial publication.  Now it has been completely revised, offering the most up-to-date information available on women's health issues.Christiane Northrup's vision of mind-body wellness has received an extraordinary response from women all over the world.  Women's Bodies, Women's Wisdom powerfully demonstrates that when women change the basic conditions of their lives that lead to health problems, they heal faster, more completely, and with far fewer medical interventions.Now Dr.  Northrup brings us vital new information about the best techniques of Western medicine and the best alternative therapies, showing how to incorporate both into a complementary whole.  She guides readers through the entire range of women's health problems, and offers strikingly new, positive perspectives on normal processes, such as menstruation, pregnancy, and menopause.  This edition includes:• An all-new nutrition chapter emphasizing individual dietary needs and body chemistry• New information on improving fertility after age 35—and how to cut the risk of C-section by 50 percent• A completely updated program for menopause, including how to decide whether natural hormone replacement is right for you• Holistic ways to prepare and heal faster if surgery is necessary• Plus dozens of new natural treatments and a wealth of hard-to-find health care resourcesFilled with dramatic case histories from the famed Women to Women health care center, Women's Bodies, Women's Wisdom is contemporary medicine at its best, combining new technologies with natural remedies and the miraculous healing powers within the body itself.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Toad Rage (The Toad Books)",
        "Authors": "By Gleitzman, Morris",
        "Description": "Limpy’s family reckons humans don’t hate cane toads, but Limpy knows otherwise. He’s spotted the signs: the cross looks, the unkind comments, the way they squash cane toads with their cars. Limpy is desperate to save his species from ending up as pancakes. Somehow he must make humans see how fabulous cane toads really are. Risking everything, he sets off on a wart-tinglingly dangerous and daring journey to . . . the Olympics?This is the epic story of a slightly squashed young cane toad’s quest for the truth.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Disappearance of Edwin Drood (A Thomas Dunne Book)",
        "Authors": "By Rowland, Peter",
        "Description": "Hired by Cloisterham choirmaster Jasper John to ascertain the fate of his nephew, Edwin Drood, Sherlock Holmes and his trusty Dr. Watson set out to solve the mystery that Dickens began in his unfinished The Mystery of Edwin Drood.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "I'd Rather Die Than Give a Speech",
        "Authors": "By Klepper, Michael M. and Gunther, Robert E.",
        "Description": "Knees weaken, voices quiver, and sweat glands go into overdrive at the mere thought of having to speak in public. Now, finally, I'd Rather Die than Give a Speech! presents a method that is sure to make public speaking easier and more enjoyable.This step-by-step game plan will help anyone transform speechmaking from a teeth-chattering ordeal to a rewarding experience that can benefit their career and company. With practical tools and strategies for both speech preparers and presenters alike, this handbook offers new ways to grab and hold an audience's attention, including all about ear appeal, which can turn lackluster speeches into knockouts; covers the entire process of speechmaking - from preparation to performance to Q&A - in a lively, easy-to-read style; includes chapter checklists and pitfalls to be avoided; and contains examples and anecdotes that are easy to relate to and fun to read.I'd Rather Die than Give a Speech shows you how to craft and deliver a speech that grabs the audience's attention and holds it through the barrage of questions that often follow presentations.",
        "Category": " Business & Economics , General",
        "Publisher": "Irwin Professional Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "CliffsNotes Managing Your Money (Cliffsnotes Literature Guides)",
        "Authors": "By Bailey, Mercedes",
        "Description": "Having trouble figuring out where your money goes? Need help with credit, investing, and other financial services? This guide provides everything you need to get yourself into financial health. Clear instructions and plans make an ordinarily dry and complicated subject easy to understand. Begin to realize your financial goals, today.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Nepal: The Mountain Kingdom",
        "Authors": "By Moran, Kerry",
        "Description": "",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Ntc Pub Group",
        "Price Starting With ($)": "8.5",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Principles for a Catholic Morality: Revised Edition",
        "Authors": "By O'Connell, Timothy E.",
        "Description": "Completely revised and updated, this classic introduction to moral theology in the Roman Catholic tradition speak clearly to anyone interested in understanding what it means to live the Christian life. Beginning with a concise definition of the roles of revelation and interpretation in the formation of moral theology, O'Connell explores the concept of a moral person, the shape and dynamics of a moral world, and the implications not only for the individual Christian but for the community as a whole.",
        "Category": " Religion , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The End of Man",
        "Authors": "By Whitehead, John W.",
        "Description": "",
        "Category": "",
        "Publisher": "Crossway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Reading the Book",
        "Authors": "By Visotzky, Burton L.",
        "Description": "",
        "Category": " Religion , Biblical Criticism & Interpretation , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Power of Self-Esteem: An Inspiring Look At Our Most Important Psychological Resource",
        "Authors": "By Branden, Nathaniel",
        "Description": "Though most us come from dysfunctional families, this world-famous psychologist stresses that it is still possible to develop positive self-esteem.Self-esteem plays a powerful role in the key choices and decisions that shape our lives. But how can we tell whether the power of self-esteem is working for us?Read this concise book to discover:  The more than 20 characteristics taht indicate postive self-regard  The 12 obstacles to the growth of self-esteem  The 6 self-empowerment principles  How your positive self-esteem makes a powerful difference in our changing worldIf you wish to know what self-esteem depends on, how to nurture it in our children, support it in our schools, encourage it in organizations, strengthen it in psychotherapy or develop it in yourself, you need this book.  Its clear message of hope is sure to be appreicated by everyone working on themselves or helping others.",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The word in worship: Preaching in a liturgical context (Abingdon preacher's library)",
        "Authors": "By Skudlarek, William",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Airborne",
        "Authors": "By Charles Macdonald",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books Inc.",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "May",
            "Year": "1970"
        }
    },
    {
        "Title": "The Guitar: The Definitive Reference",
        "Authors": "By Terence Ashley",
        "Description": "",
        "Category": "",
        "Publisher": "SevenOaks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Hitler (Ballantine's illustrated history of the violent century: War leader)",
        "Authors": "By Wykes, Alan",
        "Description": "The irrational, irresponsible, and intemperate behavior of the infamous Nazi leader is attributed to his early contraction of venereal disease",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Grrl Genius Guide to Life: A 12 Step Program on How to Become a Grrl Genius, According to Me!",
        "Authors": "By Michon, Cathryn",
        "Description": "Do you have what it takes to be a Grrl Genius? Of course you do! You are a smart, funny, beautiful Grrl Genius -- just because you say you are. In The Grrl Genius Guide to Life, stand-up comic and Grrl Genius Club founder Cathryn Michon explains why she is a genius and demonstrates how you can become one, too, by following her easy twelve-step program.The first step in the program is the most important: Admit that you are a Grrl Genius. Acknowledge that you are beautiful, intelligent, and talented and that you are the only person in the world who can decide just how great you are. In subsequent steps, you will learn to embrace the domestic arts, love your Grrl Genius good looks, celebrate your sexuality, appreciate your Grrl Genius mother, and pass the Grrl Genius message on to others!Filled with little-known facts about such unacknowledged Grrl Geniuses as Mozart's younger sister Nannerl and Einstein's wife Mileva, as well as hilarious, embarrassing stories from Michon's own life, The Grrl Genius Guide to Life is a must-read for Grrl Geniuses and Enlightened Males everywhere. Michon shares her most humiliating memories -- singing show tunes at her aunt's funeral, crying uncontrollably in an airplane bathroom and holding up the flight -- as well as her moments of triumph, like attending the birth of her niece (a future Grrl Genius) and getting liposuction that not a single human being noticed. This is an uproarious roller-coaster ride through the life of a self-declared Genius -- in which Michon writes about everything from doughnuts to divorce, from physics to push-up bras -- and a comic inspirational guide for those aspiring to Grrl Geniushood.Cathryn Michon is a genius -- just because she says she is. Read her book, and you will become one, too. As with any twelve-step program, becoming a Grrl Genius takes work. All your life you have been telling yourself that your butt is too big, your ideas are too small, and your love for creme-filled doughnuts is inherently evil. With the help of The Grrl Genius Guide to Life, you will learn to recognize your own brilliance, shamelessly proclaim it to the rest of the world, and eat all the Krispy Kreme doughnuts you want. In case you need inspiration, Michon has included numerous Grrl Genius slogans and Little Pink Post-it Notes; in case you get hungry, she has included her recipe for the best chocolate chip cookies in the world. So go on -- take the first step. Read the book that is guaranteed to change your life forever (or at the very least to make you laugh yourself silly) -- and declare your Genius to yourself and the world!",
        "Category": " Humor , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Angels A to Z",
        "Authors": "By Lewis, James R.",
        "Description": "",
        "Category": "",
        "Publisher": "Visible Ink Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Norton Book of Modern War",
        "Authors": "By Fussell, Paul (EDT)",
        "Description": "In dozens of selections that range from classic fiction and poetry to journalistic dispatches and simple letters home, this anthology presents the voices of this century's major conflicts: the First World War, the Spanish Civil War, the Second World War, and the wars in Asia (Korea and Vietnam). Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Literary Collections , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Butterworth Takes a Vacation: But Decides to Give It Back : A Comedy Novel",
        "Authors": "By Butterworth, Bill",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Recovery from Co-Dependency: Its Never to Late to Reclaim Your Childhood",
        "Authors": "By Weiss, Laurie and Weiss, Jonathan",
        "Description": "",
        "Category": " Self-help , Codependency",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Liszt",
        "Authors": "By Sitwell, Sacheverell",
        "Description": "Enters into Liszt's personality and personal life as well as examining his major works and contributions to piano technique, musical form, and traditional modes of performing",
        "Category": " Music , General",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "June",
            "Year": "1967"
        }
    },
    {
        "Title": "REAL WAR (Richard Nixon Library Editions)",
        "Authors": "By Nixon, Richard Milhous",
        "Description": "Analyzes East-West relations, and argues that America must assume the role of global leader in order to insure peace",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "National Geographic Traveler: Ireland",
        "Authors": "By Somerville, Christopher",
        "Description": "",
        "Category": " Travel , Europe , Ireland",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Hollywood's Healthiest Diets",
        "Authors": "By Laska, Mark and Perrone, Tony",
        "Description": "\"Dr. Perrone helped me get in the best shape of my life--from the inside out.\"-- Denzel WashingtonWant to fit into your jeans by Friday?Exercise isn't the answer. . .Hollywood's Healthiest Diets is! Choose the diet that's right for you.Lose body fat and inches every day. Train your metabolism to work like it's on fire. Feel energized from the moment you wake up. Increase you mental clarity. Strengthen your immune system. Handle stress with ease. Achieve hormonal balance. Defy aging. Eat for your unique body chemistry.Take Hollywood's Healthiest Diets and determine which strategy will work best for you!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Collins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Healthy Homestyle Cooking : 200 of Your Favorite Family Recipes-With a Fraction of the Fat",
        "Authors": "By Tribole, Evelyn",
        "Description": "A leading nutritionist's collection of two hundred delicious, fat-free recipes that convert traditional dishes, including lasagna and brownies, into healthy meals, offers a \"Make-Over Primer\" that gives the basics in reducing unhealthy parts of a dish. Prevention Main.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Rice",
        "Authors": "By Hayes, Joanne Lamb and Leblang, Bonnie Tandy",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Rice & Grains",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Patrick O'Brian : A Life Revealed",
        "Authors": "By King, Dean",
        "Description": "The untold life story of a novelist whose greatest fictional creation was his own identity.In a 1998 article in New York magazine, Dean King offered readers a small sampling of the secret history of Patrick O'Brian, the creator of the bestselling series of Aubrey-Maturin novels. O'Brian has always guarded the secrets of his personal history with a zealousness that has bordered on the obsessive. And for years his fanatical readers have speculated on the true story and spun myths about his past based on the lives of his characters.Dean King at last unveils the story of Richard Patrick Russ, a writer and intellectual who emerged from the Second World War as Patrick O'Brian, a persona created in his own imagination and later refined by decades of rumor and speculation. What motivated this radical change of identity? Was it connected to O'Brian's service during the war, or the messy divorce from his first wife? Or was it the inexplicable act of an eccentric genius?King has crisscrossed Europe to speak to long-lost relatives, friends, and colleagues of his famously reclusive subject and has fashioned this wealth of information into a dramatic narrative that will appeal to an audience far wider than O'Brian's already dedicated fans.",
        "Category": " Literary Criticism , European , English, Irish, Scottish, Welsh",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Baby Matters, Revised 2nd Edition: What Your Doctor May Not Tell You About Caring for Your Baby",
        "Authors": "By Palmer, Linda Folden",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Baby Reference",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The World That Perished",
        "Authors": "By Whitcomb, John C.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Baker Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "History of Scotland, The Penguin (Pelican)",
        "Authors": "By Mackie, J. D.",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Succeeding against the Odds",
        "Authors": "By Smith, Sally L.",
        "Description": "The founder of the Lab School of Washington provides parents and teachers with proven techniques for working with learning-disabled and dyslexic teenagers and adults, and presents the success stories of celebrities who have triumphed despite their condition",
        "Category": " Family & Relationships , Learning Disabilities",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Taking Control of Arthritis",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Thorndike Pr (Largeprint)",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "A Man for All Season (A Vintage Book)",
        "Authors": "By Bolt, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    }
]