[
    {
        "Title": "Roxanna Slade",
        "Authors": "By Price, Reynolds",
        "Description": "From one of America's most esteemed men of letters comes a new and vivid recounting of life in the American South. Not since Reynolds Price's award-winning, bestselling novel Kate Vaiden has he told a woman's story in her own voice. Roxanna Slade is this woman.  Roxanna begins her story on her twentieth birthday -- a day that introduces her to the harsh realities of adulthood and changes the course of her life forever. From this day on, Roxanna is quick to share with the reader the intimate details of ninety years of life in North Carolina. While she rarely leaves the small town of her youth, Roxanna's vision of the world is shaped by intense passions and loyalties and the certain tragedies of a life long lived.  Roxanna Slade is a sweet-and-keen-tongued tale-teller. And her beguiling tale is one that boldly reflects the high and low moments in the development of the modern South and the nation as well as the inner strength of a woman possessed of a piercingly clear vision, forthright hungers and immense vitality.",
        "Category": " Fiction , Literary",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "War in the Outposts (World War II Series)",
        "Authors": "By Rigge, Simon",
        "Description": "Documents the efforts of U.S. and British forces at far-flung support bases to survive life in jungles, deserts, and frozen wastes, as well as fight the enemy",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1980"
        }
    },
    {
        "Title": "The Second Front (World War II)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "Handbook of Psychotherapy for Anorexia Nervosa and Bulimia",
        "Authors": "By Garner, David M. and Garfinkel, Paul (EDT)",
        "Description": "",
        "Category": " Psychology , Psychopathology , Eating Disorders",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Sailor historian: The best of Samuel Eliot Morison",
        "Authors": "By Samuel Eliot Morison",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Little Book of Calm",
        "Authors": "By Wilson, Paul",
        "Description": "Feeling stressed? Need some help to regain balance in your life? The Little Book of Calm is full of advice to follow and thoughts to inspire. Open it at any page and you will find a path to inner peace.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Little Big Book of Pregnancy (Little Big Books (Welcome))",
        "Authors": "By Tabori, Lena (EDT) and Fried, Katrina (EDT)",
        "Description": "A prequel to our best-selling Little Big Book for Moms! The 12th title in the Little Big Book series, The Little Big Book of Pregnancy is destined to become a classic literary companion for any expectant mom. Filled with the best fiction, poetry, and essays on the subject of birth and pregnancy, this heartwarming anthology is also peppered with fascinating customs and rituals from around the world, time-honored home remedies, delightful old wives' tales, nutritious recipes, and wonderful crafts and activities. The turn of each page brings something interesting and entertaining to read, to do, or to learn. Illustrated throughout with the same period art and ephemera that has become the signature of this series, the imagery is both charming and elegant. A visual and editorial feast, The Little Big Book of Pregnancy is simply the perfect gift for any mom to-be. Featuring: 8 literary excerpts and short stories, including The Good Earth by Pearl S. Buck, Delusions of Granma by Carrie Fisher, and The Diary of Adam and Eve by Mark Twain. 12 essays by such notable writers as Naomi Wolf, Louise Erdrich, and Hope Edelman. 12 poems by, among others, Sylvia Plath, Walt Whitman, Erica Jong, and Joyce Carol Oates. Home remedies for seven typical pregnancy complaints, including stretch marks, morning sickness, body aches, and heartburn. More than 50 traditions from around the world covering birth, naming, labor, and pregnancy. More than 50 traditions from around the world covering birth, naming, labor, and pregnancy. More than 50 old wives tales, including how to tell if it's a boy or a girl, what to do for a smooth delivery, and how to know if you're having twins! 16 recipes for nourishing treats such as Energizing Drinks, Super Sandwiches, Delicious Snacks, and Satisfying Salads. 16 activities, such as writing letters to your unborn child, painting a cloud ceiling in the nursery, and relaxing with daily meditations. 6 categories of \"Fun Facts,\" including popular baby names from around the world, a month-by-onth guide to your baby's fetal development, and statustics about babies, birth, and pregnancy. More than a dozen quotes concerning birth, pregnancy and becoming a parent, by celebrities, writers, and notable personalities such as William Blake, Alistair Cooke, Colette, Robin Williams, and Erma Bombeck.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Welcome Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Same Sweet Girls",
        "Authors": "By King, Cassandra",
        "Description": "The new novel by the celebrated author of The Sunday Wife chronicles the lives of a tight-knit group of lifelong friends. None of the Same Sweet Girls are really girls anymore, and none of them have actually ever been that sweet. But this spirited group of Southern women, who have been holding biannual reunions ever since they were together in college, are nothing short of compelling. There's Julia Stovall, the First Lady of Alabama, who, despite her public veneer, is a down-to-earth gal who only wants to know who her husband is sneaking out with late at night. There's Lanier Sanders, whose husband won custody of their children after he found out about her fling with a colleague. Then there's Astor Deveaux, a former Broadway showgirl who simply can't keep her flirtations in check. And Corinne Cooper, whose incredible story comes to light as the novel unfolds.",
        "Category": " Fiction , Women",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Great Divide (Marcus Glenwood Series #1)",
        "Authors": "By Bunn, T. Davis",
        "Description": "The Great Divide captures all the intrigue and drama of a great legal thriller.When attorney Marcus Glenwood resigns from a prestigious corporate law firm to retreat to a small town in North Carolina and rebuild his life after a devastating personal tragedy, he suddenly finds himself in the biggest and most emotionally difficult case of his career.Fragile and spiritually wounded, Glenwood is introduced to Alma and Austin Hall, whose daughter Gloria has disappeared in China while investigating the slave-like practices of New Horizons, the world's largest manufacturer of sports shoes and athletic gear. Persuaded by Alma's pleading, and their obvious distress, Marcus accepts the case.No one, including Marcus himself, can believe how quickly his investigation untangles a web of deceit that stretches from Washington , D.C., to Europe and Asia and back to his own North Carolina backyard. With the power to obstruct, manipulate, intimidate, injure, and eliminate, the giant multinational sports company New Horizons has never lost a case. But they underestimate Marcus Glenwood.Step by cautious step Glenwood moves forward to uncover the horrifying truth about New Horizons, Gloria Hall, and ultimately himself.",
        "Category": " Fiction , Legal",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Company",
        "Authors": "By Ehrlichman, John",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "Isaac Asimov's Book of Facts",
        "Authors": "By Asimov, Isaac",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "El Greco of Toledo",
        "Authors": "By Greco",
        "Description": "",
        "Category": "",
        "Publisher": "NEW YORK GRAPHIC SOCIETY",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Virginians",
        "Authors": "By Edelhart, Michael",
        "Description": "",
        "Category": " History , United States , State & Local , South (AL, AR, FL, GA, KY, LA, MS, NC, SC, TN, VA, WV)",
        "Publisher": "Doubleday & Company Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Field of Thirteen",
        "Authors": "By Francis, Dick",
        "Description": "The three-time Edgar Award winner delivers a suspense-driven, finely crafted collection of thirteen short stories, many of them new and not published heretofore, including the story of a middle-aged racehorse owner who unwisely falls in love with her jockey. 250,000 first printing.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "These Happy Golden Years (Little House, 8)",
        "Authors": "By Wilder, Laura Ingalls and Williams, Garth (ILT)",
        "Description": "The eighth book in Laura Ingalls Wilder’s treasured Little House series. This edition features the classic black-and-white artwork from Garth Williams.Laura is teaching school, and it's terrifying! Most of the students are taller than she is, and she must sleep away from home for the first time. Laura is miserable, but the money is needed to keep Mary in a college for the blind.And every Friday—no matter what the weather—Almanzo Wilder arrives to take Laura home to her family for the weekend. Laura and Almanzo are courting, and even though she's not yet sixteen, she knows that this is a time for new beginnings.The nine books in the timeless Little House series tell the story of Laura’s real childhood as an American pioneer, and are cherished by readers of all generations. They offer a unique glimpse into life on the American frontier, and tell the heartwarming, unforgettable story of a loving family.",
        "Category": " Young Adult Fiction , Historical , United States , 19th Century",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Drawing of the Three (Dark Tower)",
        "Authors": "By King, Stephen and Hale, Phil (ILT)",
        "Description": "A chilling tale of Roland--the world's last, living gunslinger--follows the renegade gunman as he is thrust into the drug-and-crime-ridden world of the twentieth century and a dark uncertainty",
        "Category": " Fiction , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "The Complete Book of Dog Care: How to Raise a Happy and Healthy Dog. Barron's.",
        "Authors": "By Klever, Ulrich and Wegler, Monica (PHT)",
        "Description": "Offers information on selecting a dog, training, feeding, health care, grooming, and handling emergencies along with illustrated profiles of more than fifty popular dogs and definitions of important dog terms",
        "Category": " Pets , Dogs , General",
        "Publisher": "Barron's Educational Series, inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Emperor of America",
        "Authors": "By Condon, Richard",
        "Description": "After a nuclear accident--or so-called accident--devastates Washington D.C., Caesare Appleton becomes Emperor of the nation",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Diabetes A to Z: What You Need to Know About Diabetes : Simply Put",
        "Authors": "By Ingle, Karen Lombardi",
        "Description": "Covers issues related to blood glucose, dental care, eating disorders, exercise, eye diseases, foot care, high blood pressure, insulin shots, smoking, stress, and more",
        "Category": " Health & Fitness , Diseases , Diabetes",
        "Publisher": "Amer Diabetes Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "What Women Want",
        "Authors": "By Ireland, Patricia",
        "Description": "In What Women Want, Patricia Ireland traces her journey to self-awareness and self-realization - from being a teenage bride, a waitress, and a flight attendant for Pan American Airlines to becoming a successful corporate lawyer, a participant in the movement for women's rights, and now one of its key leaders.Writing with wry wit, clear-eyed wisdom, and her invincible warrior spirit, Patricia Ireland explores how her own journey mirrors the changes so many women have made as they have remade the world over the past decades. She frankly discusses her mistakes as well as her unshaken convictions, the setbacks of the movement as well as the triumphs, and the reasons for her high hopes for the future in the face of conservative backlash.",
        "Category": " Social Science , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Honorary Consul.",
        "Authors": "By Greene, Graham",
        "Description": "Although Paraguayan revolutionaries make the mistake of kidnapping the British Consul instead of the American Ambassador, they continue to threaten violence",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1973"
        }
    },
    {
        "Title": "Breastfeeding and the Working Mother",
        "Authors": "By Mason, Diane and Ingersoll, Diane",
        "Description": "Explains the health benefits of breastfeeding, describes solutions to common problems working mothers face, and discusses weaning, legal rights, and advice to fathers",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Mercy",
        "Authors": "By Heron, Echo",
        "Description": "The author of Intensive Care presents a fictional account of daily life in the hospital, featuring nurse Catalina Richardson, a dedicated, compassionate care-giver, who wrestles herself back from the brink of burn-out. 60,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Delirium of the Brave",
        "Authors": "By Harris, William C.",
        "Description": "Savannah, 1864.  Confederate Captain Patrick Driscoll and his dear friend and manservant Shadrack \"Shad\" Bryan leave their tearful families to help fight for the Southern cause.  They are to set up fort at Raccoon Island off Georgia's coast in a last-ditch effort to save their beloved city from Union attack.  But only days into their assignment, the two men die in each other's arms in a Yankee bombardment.  Though the men are gone, their legacy will live on-as will the legend of the priceless Driscoll family treasure the two men have buried on Raccoon Island.Four generations after the Civil War, many Confederate families still remain in Savannah, struggling through the twentieth-century in a South rife with hardball politics, personal vendettas and the hangover of war.John-Morgan Hartman, son of a newspaper man and great-great grandson of Captain Patrick Driscoll, goes to serve his country in Vietnam, unaware of the physical and psychological wounds that will befall him...Tony O'Boyle is an ambitious young politician who will stop at nothing and spare no one to get ahead-but his family's dark past will come back to haunt him...Lloyd Bryan, descended from slaves, is determined to succeed where his ancestors didn't.  But his celebrity as a professional football player immerses him in a world of temptation that ultimately turns him toward religion...Charlotte Drayton, a successful television reporter, has always used her beauty to get her way-but the one man she can't have is the only one she wants...After many years, four friends will meet on the very island where the two confederate soldiers died in each other's arms.  To find where they buried Driscoll's treasure-and to uncover the dangerous secrets of a prominent Savannah family.A gripping novel of history, intrigue, war, and love, Delirium of the Brave follows four generations of families contemplating the pain of the past and the promise of the future.   Get swept away by this glorious saga rich with the sights, sounds, flavors, and people of the South's most stunning locale.",
        "Category": " Fiction , Historical",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Design of Real-Time Computer Systems",
        "Authors": "By Martin, James",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The Golden Eye",
        "Authors": "By Young, Mahonri Sharp, Guatti, Albano, and Sapieha, Nicolas",
        "Description": "Looks at private art collections and museums created by Vanderbilt, Morgan, du Pont, Jefferson, Hearst and Getty",
        "Category": " Art , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Suffer the Children: A Pediatrician's Reflections on Abuse",
        "Authors": "By Murdock, Rosamond L.",
        "Description": "",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Health Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Sellout: The Inside Story of President Clinton's Impeachment",
        "Authors": "By Schippers, David P. and Henry, Alan P.",
        "Description": "Schippers, the former Chief Investigative Counsel of the House Judiciary Committee and a loyal Democrat, went against his party, the press, and public opinion to build a case against President Clinton and bring him to justice. He shows how the entire impeachment process was rigged, and gives insider information on why Democrats and Republicans conspired to conceal evidence of criminal offenses, how Clinton tried to keep his women quiet, and how Republicans cooperated with Janet Reno's Justice Department to keep secret the report on possibly impeachable Clinton-Gore fundraising offenses.  Schippers has been a practicing trial attorney for some 40 years. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Regnery Publishing, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "And Now for Something Completely Trivial: The Monty Python Trivia and Quiz Book",
        "Authors": "By Johnson, Kim",
        "Description": "A compendium of facts, trivia, and quizzes provides background information on some of the Monty Python troupe's most famous skits, sketches, movies, characters, and more",
        "Category": " Games , Puzzles",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "F-Plus Diet",
        "Authors": "By Eyton, Audrey",
        "Description": "This personalized version of the proven F-Plan diet makes dieting easier for working women, businessmen, children, and snackers with complete preplanned menus and recipes that make use of canned, packaged, and frozen foods and includes make-ahead meals",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Outlet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Emma, Lady Hamilton",
        "Authors": "By Fraser, Flora",
        "Description": "This detailed biography examines the extraordinary woman who became famous as the lover of Lord Nelson, from her ordinary beginnings in England to her last years in and out of debtor's prison",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "XEROX AMERICAN SAMURAI",
        "Authors": "By Hillkirk, John and Jacobson, Gary",
        "Description": "Exclusive interviews with key Xerox managers enhance an account of the rise, decline, and resurgence of Xerox and its success in regaining a sizable share of a Japanese-dominated market",
        "Category": " Business & Economics , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Angelmass",
        "Authors": "By Zahn, Timothy",
        "Description": "Scientists on the planet Seraph within the \"lost\" independent human colonies of the Empyrean have encountered \"angels\" mysteriously emitted by a black hole. These angels hold the ability to render people within close proximity reasonable, calm, and virtually incapable of lying. The Empyrean has harnessed their power, distributing them to all members of their government, in an attempt to promulgate peace among their people.But the leaders of the Earth-based Empire, the Pax, view the angels as an extreme danger to mankind. Amid rumors that the angels are the linchpin of an alien plot to subvert humanity, the Pax dispatch an innocent academic, Jereko Kostas, on a reconnaissance mission to uncover the truth about the angels. Jereko, along with Chandris, a young woman who has spent her life as a petty thief and a grifter, signs on with an \"angel-hunting\" ship to investigate. When they uncover disturbing facts about the angels and their source, Angelmass, tension between the Empyrean and the Pax builds, and their discoveries set the stage for a major confrontation between the Pax and the stubbornly independent inhabitants of the Empyrean.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Zeitgeist (Bantam Spectra Book)",
        "Authors": "By Sterling, Bruce",
        "Description": "It's 1999 in Cyprus, an ancient island bejeweled with blue-helmeted UN peacekeepers and littered with rusting land mines, corroding barbed wire, and illegal sewage dumps. Here, in the Turkish half of the island, the ever-enterprising Leggy Starlitz has alighted, pausing on his mission to storm the Third World with the \"G-7\" girls, the cheapest, phoniest all-girl band ever to wear Wonderbras and spandex. And his market is staring him in the face: millions of teenagers trapped in a world of mullahs and mosques, all ready to blow their pocket change on G-7's massive merchandising campaign - and to wildly anticipate music the group will never release.Leggy's brilliant plan means doing business with some of the world's most dangerous people. His business partner is the rich and connected Mehmet Ozbey, a man with many identities and a Turkish girlfriend whose beauty and singing voice could blow G-7 right out of the water. His security chief is Pulat Romanevich Khoklov, who learned to fly MiG combat jets in Afghanistan and now pilots Milosevic's personal airplane. Among these thieves, schemers, and killers, Leggy must act quickly and decisively. Bombs are dropping in Yugoslavia. Y2K is just around the corner. And the only rule to live by is that the whole scheme stops before the year 2000.But Leggy gets a surprise when the daughter he's never met arrives on his doorstep. A major fan of G-7, she is looking for a father - and her search forces Leggy to examine his life before making a madcap journey in search of a father of his own. It's a detour that puts his G-7 Zeitgeist in some real jeopardy. For in Istanbul, Leggy's former partners are getting restless, and the G-7 girls are beginning to die.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Songs from the stars",
        "Authors": "By Spinrad, Norman",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Black Trillium",
        "Authors": "By May, Julian and Bradley, Marion Zimmer",
        "Description": "Three infant princesses receive the mystically protective Black Trillium at birth and learn to use their strengths and conquer their weaknesses to withstand the dangers that face them",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "In the problem pit",
        "Authors": "By Pohl, Frederik",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "The Excitement Is Building: How Habitat for Humanity Is Putting Roofs over Heads and Hope in Hearts",
        "Authors": "By Fuller, Millard and Fuller, Linda",
        "Description": "",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "The Mummy or Ramses the Damned: A Novel",
        "Authors": "By Rice, Anne",
        "Description": "He was Ramses the Damned in ancient Egypt, but awoke in opulent Edwardian London as Dr. Ramsey, expert in Egyptology. He mixes with the aristocrats and samples their voluptuous lifestyle, but it is for his beloved, Cleopatra, that he longs, and will do anything to be with....",
        "Category": " Fiction , Historical",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Java Programming For Dummies",
        "Authors": "By Koosis, Donald J. and Koosis, David S.",
        "Description": "Shows how to create a range of Java programs, produce Web pages that respond to the user, create games that can be played across the Internet, and more",
        "Category": " Computers , Programming Languages , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Heartsounds: The Story of a Love and Loss",
        "Authors": "By Lear, Martha Weinman",
        "Description": "A moving account of a medical drama and a medical failure records the observations of surgeon Harold Lear, who, stricken by a series of coronaries, endured open-heart surgery and mysterious postsurgical complications before dying",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.33",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "Soviet Sonrise",
        "Authors": "By Otis, Rose Marie Niesen",
        "Description": "",
        "Category": "",
        "Publisher": "Review and Herald Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Choices, Changes",
        "Authors": "By Tada, Joni Eareckson",
        "Description": "Joni, a quadriplegic, talks about her starring role in the movie based on her life, her ministry to the handicapped and her recent marriage",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Practical Problem Solver: Substitutes, Shortcuts, and Ingenious Solutions for Making Life Easier",
        "Authors": "By Not Applicable (Na )",
        "Description": "Includes a problem solver's dictionary, lists common items with uncommon uses, suggests how to recycle and reuse more, and provides formulas and recipes for foods, cleaners, and more",
        "Category": "",
        "Publisher": "Readers Digest Association",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Growing wise in family life",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "Multnomah Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "War Games: The Secret World of the Creators, Players, and Policy Makers Rehearsing World War III Today",
        "Authors": "By Allen, Thomas B.",
        "Description": "Using documents obtained under the Freedom of Information Act, this book questions the validity of war games and reveals the Pentagon's search for a computer program that will automatically cross the nuclear threshold--when human players would not",
        "Category": " History , Medieval",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Iron Bravo",
        "Authors": "By Stroud, Carsten",
        "Description": "Here is the reality of military life as Crane sees it: the constant wariness, bred in Vietnam, that Crane wears like a second skin; the grueling training in the Mojave Desert, where he watches raw young recruits learn state-of-the-art warfare. Then comes the call to the Gulf and the weeks of tedious waiting in the cold, barren Saudi desert (\"Wall-to-Wall Fuck All\" they name it), weeks that culminate at last in the exhilarating, terrifying dash across the sands into the teeth of battle, moments that change the men forever, especially those who witness the unspeakable spectacle of two thousand Iraqi soldiers buried alive by U.S. earthmovers.Here, too, is the story of First Sergeant Dee Crane, member of a vanishing breed, caught between the uncompromising traditions of Fort Riley's legendary history, from Custer to Patton, and the changing needs of a society that too often derides and discards the soldiers who protect it. And here is the face of modern war itself - its mask of high-tech marvels disguising the bedrock reality of grunts who must take and hold ground as they always have: with blood and bravery.Through it all Stroud weaves the distinguished fighting history of the Big Red One, christened in the fiery crucible of the First World War, tempered by its massive defeat at the Kasserine Pass in the Second World War, battered in the grinding carnage of Vietnam, and resurrected with the strategies of Air Land Battle that proved so devastatingly effective in Desert Storm.",
        "Category": " History , Military , United States",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Top Gun Fighters and America's Jet Power",
        "Authors": "By Hall, George (PHT)",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Above and Beyond: A History of the Medal of Honor from the Civil War to Vietnam",
        "Authors": "By Boston Publishing Company",
        "Description": "Hundreds of photographs and drawings highlight this account of a broad cross section of the heroic exploits performed by the 3,400 men and one woman who have earned the Congressional Medal of Honor",
        "Category": " Political Science , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Southwestern Indian Ceremonials",
        "Authors": "By Banti, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "Kc Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "THE MAP CATALOG",
        "Authors": "By Makower, Joel",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Magic at Work",
        "Authors": "By Pearson, Carol S. and Seivert, Sharon",
        "Description": "Now more than ever, companies and individuals are facing nearly impossible odds - challenges so tough that nothing less than all-out magic is needed. Based on extensive research into the creative practices of great magicians from lore and history, like Merlin, Perseval, and others from King Arthur's Court, Pearson and Seivert analyze the stages of the great magicians' educations. From this research they show how one can begin to realize one's highest powers of creativity and effectiveness.The stages of learning that every aspiring magician must undergo: hearing the call to magic - discovering the need for it in one's life; initiating - or how to think freshly about a problem; testing oneself and one's strength in the face of mighty challenges; drawing a success out of failure; and sharing one's powers as ancient magicians did in the practice known as \"casting circle.\"This is a handbook on how to work magic in your life. From rituals to actual magical practices adapted for use in the workplace, Magic at Work instructs and inspires.",
        "Category": " Psychology , General",
        "Publisher": "Doubleday Business",
        "Price Starting With ($)": "8.0",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Expect Miracles: Charter Schools and the Politics of Hope and Despair",
        "Authors": "By Cookson, Peter W. and Berger, Kristina",
        "Description": "Charter schools are the most significant educational experiment in the last two decades. In Expect Miracles, Peter W. Cookson, Jr. and Kristina Berger focus on the current trend toward deregulation in public education. The issue of deregulation is of critical importance because the spirit of entrepreneurship that is behind deregulation is seldom examined from a sociological perspective. This book places the debate concerning the future of public education in a meaningful framework that allows the reader to ask new questions and seek genuine solutions. Using the latest research as the basis for discussion, this book provides a fresh look at the growing and politically volatile charter school movement. The authors present the most balanced analysis to date of the movement that is changing the landscape of American education.",
        "Category": " Education , General",
        "Publisher": "Westview Press",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Flying Solo: Single Women in Midlife",
        "Authors": "By Anderson, Carol M., Stewart, Susan, and Dimidjian, Sona",
        "Description": "Unmarried at 40 - could there be anything worse? Our culture dictates that this woman is on her way down, a shrew or a lonely old maid, unattractive to men, a failure at catching or holding the golden ring of marriage. Yet, when psychologists Carol Anderson and Susan Stewart interviewed single women throughout the country - never married, divorced, with or without children - they discovered something different. Having confronted the old myths, these women are making choices, enjoying their own power, thriving on solitude and friendships. Their stories offer blueprints for living, as well as inspiration, for other women \"flying solo.\"Most of these women did not intend to be on their own at midlife. They had accepted the \"marriage and motherhood mandate\" as their destiny - until Prince Charming failed to appear or the sacrifices of marriage turned out to be too great. While giving up the dream has not been easy, at midlife they have not only reached some resolution but are also busily creating purpose in their own lives. The authors share these women's stories and their practical advice on managing the mechanics of being single, transforming loneliness, redefining the importance of work, developing friendship and support networks, living with and without intimacy and sex with men, and choosing to have and raise children. In the process they define not just a new American lifestyle but a new American Dream.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Mr. Wizard's Supermarket Science",
        "Authors": "By Herbert, Don",
        "Description": "Mr. Wizard (a.k.a. Don Herbert) presents more than 100 super-simple, simply sensational science experiments and tricks using everyday items available in the supermarket. Kids learn how to turn water into wine, use their finger to boil water, plunge a straw through a raw potato, slice the inside of a banana without slicing the outside, and much, much more!",
        "Category": " Juvenile Fiction , Science & Technology",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Silent Cities, Sacred Stones:  Archaeological Discovery in Israel",
        "Authors": "By Jerry M. Landay",
        "Description": "",
        "Category": "",
        "Publisher": "McCall Publishing Company",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The story of Jesus,",
        "Authors": "By Smith, Lloyd Edwin",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman Pub. Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1941"
        }
    },
    {
        "Title": "Country Style Sewing for the Home",
        "Authors": "By Chilton Book Company",
        "Description": "Includes step-by-step instructions and sewing techniques for creating decorative cushions, bed linens, curtains, curtain covers, and bolsters",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Chilton Book Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Dead Center: Clinton-Gore Leadership and the Perils of Moderation",
        "Authors": "By Burns, James MacGregor, Sorenson, Georgia Jones, Gerber, Robin, and Webster, Scott W.",
        "Description": "\"The urgent question of our time is whether we can make change our friend and not our enemy....To renew America, we must be bold...must revitalize our democracy....Together with our friends and allies, we will work to shape change, lest it engulf us.\" With those inaugural words, William Jefferson Clinton began his first term as President of the United States. Now, a Pulitzer Prize-winning historian and a former White House aide provide the first penetrating, thoughtful evaluation of President Clinton's leadership.  Before he was voted into office, Bill Clinton told the authors in an interview that he wanted to be a transforming leader, a president who would fashion real and lasting change in peoples' lives, in the tradition of Franklin Delano Roosevelt. But how has this president, who has sought to lead from the center with his vice president, Al Gore, and the First Lady, Hillary Rodham Clinton, measured up against his own stated goals and the aspirations and performances of other presidents since World War II? From the health care debacle and the 1994 midterm elections that swept the Republicans to a majority in both houses of Congress to the effect of scandal and impeachment on his ability to govern, Dead Center examines the leadership style of Bill Clinton and offers a forceful challenge to the strategy of centrism.  There is no more respected presidential historian than James MacGregor Burns, author of several acclaimed books on leadership and the Pulitzer Prize-winning study of Franklin D. Roosevelt. Georgia J. Sorenson adds her own insights as a political scientist and presidential scholar. Their combined efforts have resulted in an incisive, informative, authoritative work and an absorbing read.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Childhood Education in the Church",
        "Authors": "By Clark, Robert E Ed",
        "Description": "",
        "Category": "",
        "Publisher": "Moody Press",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Wisdom of the Bones: In Search of Human Origins",
        "Authors": "By Shipman, Pat and Walker, Alan",
        "Description": "A remarkable discovery was made a decade ago on a dig in northern Kenya. When all the bone and skull fragments were painstakingly pieced together, they revealed the nearly complete skeleton of a teenage male (nicknamed Nariokotome boy, after a nearby sand river). Faced with the best-ever specimen of Homo erectus - a species long identified as the proverbial missing link between apes and humans - paleoanthropologist Alan Walker embarked on a long-term investigation of that species's nature. In this book, telling the story of that inquiry, he introduces us to his ever surprising, deeply engrossing world.Walker examines even the tiniest of bones and the subtlest of clues in his analysis. He first recounts the story of the more-than-century-long search for the \"missing link,\" a bizarre and compelling saga made up of brilliant science and speculative nonsense. Then he builds, step-by-step, on some of his predecessors' assumptions, and he challenges others, using state-of-the-art techniques to reveal the truth.In Walker's hands the bones reveal an amazing amount of information about the Nariokotome boy's anatomy and the way he lived. We watch as Walker deduces from the evidence that community and cooperation were already very important at this stage of human evolution; that the boy was modern in climatic adaptation and locomotion yet archaic in growth pattern; and that the boy could not speak. In Walker's final assessment this last insight becomes the most important one.",
        "Category": " Science , Paleontology",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Diamonds Are Forever: Artists and Writers on Baseball",
        "Authors": "By Smithsonian Institution",
        "Description": "This handsome reissue of a beloved baseball classic, sporting a new cover, collects the work of Americas finest writers and artists as they celebrate the passion and excitement of our national pastime. Published in cooperation with the Smithsonian Institution, Diamonds Are Forever collects paintings, drawings, photographs, and literary excerpts, illuminating every aspect of the game-the plays, the parks, the players, the fans. Work from John Updike, Andy Warhol, Stephen King, Edna Ferber, Neil Simon, Jacob Lawrence, Roger Angell, and dozens more make this volume an artistic tribute to the quintessentially American game.",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Paras",
        "Authors": "By Hilton, Frank",
        "Description": "",
        "Category": "",
        "Publisher": "BBC",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Firearms",
        "Authors": "By AVERY, DEREK",
        "Description": "",
        "Category": "",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Twelve Golden Threads: Lessons for Successful Living from Grandma's Quilt",
        "Authors": "By Webb, Aliske",
        "Description": "From her nursing home, a grandmother teaches her two granddaughters how to quilt under the compassionate and watchful eye of their narrating mother.Jennifer has just graduated from college with a business degree and intends to be a millionaire by the age of thirty. Her younger, shyer sister, Susan, is studying to be a teacher. When Susan asks, \"Grama, could you teach me to make a quilt?\" she starts these four women on a journey - a passing of values and wisdom from one generation to the next.For Jennifer and Susan, Grama's simple lessons in the art of quilting becomes a profound metaphor for stitching together the fabric of their lives. As these young women learn twelve crucial lessons in quilt making, they discover how to create their own destiny by combining quality work, perseverance, and the right amount of vibrant color.As in life, in the ninth month comes fruition: Jennifer's and Susan's quilts are completed, but so is Grama's journey. One thing remains to be finished: the unique quilt Grama has been making as a surprise present for their mother. When they discover all the gifts - both material and spiritual - that Grama left behind, they find her ultimate legacy, the Golden Needle: Do everything with love.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Dirty Work: A Stone Barrington Novel",
        "Authors": "By Woods, Stuart",
        "Description": "Back in New York City after the London adventures of The Short Forever, cop-turned-lawyer Stone Barrington is approached by a colleague at the firm of Woodman & Weld who needs help with a celebrity divorce case. Heiress Elena Marks needs proof of her layabout husband's infidelity before she can begin divorce proceedings. When the undercover work Stone sets up turns dirty-and catastrophic-leaving the errant husband dead and the mystery woman gone without a trace, Stone must clear his own good name and find a killer hiding among the glitterati of New York's high society.  Carpenter-the beautiful British intelligence agent first encountered in The Short Forever-arrives in New York to begin an investigation of her own; Stone suspects that her case is strangely connected to the dead husband. And he and Dino, his former NYPD partner, are set to face the most bizarre and challenging assignment of their very colorful careers.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.62",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Liliane: Resurrection of the Daughter",
        "Authors": "By Shange, Ntozake",
        "Description": "In Liliane: Resurrection of the Daughter, Ntozake Shange brings the strands of memories, dreams, and expectations of a young black woman's life into ours. Through the voices of her childhood friends, Roxie, Lollie, and Bernadette, we encounter the last moments of legal segregation in Mississippi and the beginnings of class war within the black community of Queens. The voices of her lovers, Victor-Jesus, Zoom, Thayer, and Sawyer, reveal Liliane in the more closeted dynamics of romance, both colored and not so colored.But it is in her own works as an artist that Liliane reveals most of what she knows about herself to her world and our own. Yet what Liliane does not know of herself, that which is buried, the underneath, the riches of the unconscious, become present during the years and hours of Liliane's classic analysis.By brilliantly interweaving the voices of Liliane and her analyst with monologues from the friends and lovers who have formed the geography of her experience, the actualities and eccentricities of Liliane's past come to use through her, and what were pieces of a young girl's life become the landscape of her future.",
        "Category": " Fiction , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "A Widow for One Year: A Novel",
        "Authors": "By Irving, John",
        "Description": "Twenty years after The World According to Garp, the author chronicles the life of a complex, abrasive woman born in the shadow of her siblings' deaths and her parents' adultery, who only finds love after motherhood and widowhood. 300,000 first printing.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Rick Steves' Scandinavia 1998",
        "Authors": "By Steves, Rick",
        "Description": "Suggests lodging, food, and sightseeing highlights along with travel tips and cultural information",
        "Category": " Travel , Reference",
        "Publisher": "John Muir Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Both Ends of the Night",
        "Authors": "By Muller, Marcia",
        "Description": "A full-fledged pilot for several years, Sharon McCone is due for the biannual flight review required by the FAA. Her former flight instructor, Matty Wildress, invites her to fly up to the small Sonoma County town of Los Alegres for the evaluation. The test isn't due for several months, however, and McCone suspects Matty has more than safe flying on her mind.She's right. Matty's live-in lover John Seabrook, has been gone for a week, abandoning his small son, Zach. In a desperate letter John entrusts the boy to Matty's care, urging them to go into hiding immediately. But Matty is a professional and determined to perform in the last aerobatic air show of the year. Despite the extra security, something goes horribly wrong.Suddenly, an ordinary missing person case becomes a personal vendetta. Together with her lover, Hy Ripinsky, McCone bypasses the authorities to hunt down the man responsible for Matty's death.Her search will take her across the country as she uncovers the startling details of John Seabrook's past. From San Francisco to Florida to Arkansas to northern Minnesota, she'll unravel an insidious web of corruption between a major corporation and high government, where power and profit are supreme...and murder is a tool of the trade. And somewhere in the midst of it all, she'll confront a killer with a heart as cold and dark as the northern night.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Flower Drying Handbook: Includes Complete Microwave Drying Instructions",
        "Authors": "By Morris, Dolly Lutz, Ensley, Alice, and Allen, Crystal Coates (ILT)",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Menopause Naturally",
        "Authors": "By Dean, Carolyn",
        "Description": "Symptom-free menopause without estrogen replacement therapy.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Going Off the Beaten Path: An Untraditional Travel Guide to the U. S.",
        "Authors": "By Davis, Mary Dymond",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Noble Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Finding Caruso",
        "Authors": "By Barnes, Kim",
        "Description": "Seven years separate Buddy from his big brother, Lee, but the boys have always been close, comforting and protecting each other as their father-defeated by poor land and hostile weather-sank deeper into alcohol and rage. When a drink-fueled accident takes not only his life but that of the mother who tried so hard to shield her sons, the boys sell off what little remains of their daddy's tenant farm and leave Oklahoma. It is 1957, and work is still to be had in the logging camps of northern Idaho. But just outside Snake Junction, they stop at a roadhouse; and there, Lee's country-and-western talents get him a job. The two settle in, Lee to his music-and women and drink-and seventeen-year-old Buddy to roaming the landscape, at loose ends until a woman nearly twice his age turns up. Irene Sullivan is a smoky beauty, and Lee makes a play for her. But it is Buddy she wants.  By turns darkly violent and heartbreakingly tender, Finding Caruso is a work of extraordinary emotional power from an astonishingly original writer.",
        "Category": " Fiction , Literary",
        "Publisher": "Marian Wood Books/Putnam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Nationals Past Times: The History and New Beginning of Baseball in Washington, D.C.",
        "Authors": "By Roberts, James C.",
        "Description": "With a new chapter in the history of baseball currently being written in Washington, DC, every fan ought to know about history of baseball in the nation’s capital. This book examines the unique relationship between presidents and baseball, the long and intense rivalry of the congressional baseball, and the Washington Senators.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Triumph Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "New Forces at Work: Industry Views Critical Technologies",
        "Authors": "By Rand Corporation (COR), Larson, Eric V., Popper, Steven W., Wagner, Caroline S., United States Office of Science and Technology Policy (COR), and Critical Technologies Institute (Rand Corporation) (COR)",
        "Description": "Reports on issues of technological advance and research priorities from an industry perspective. Interviews with leaders from 39 firms offer a revealing look at the state of five major technology sectors that US industry cited as essential: software, microelectronics and telecommunications technologies, manufacturing technologies, materials, and sensor and imaging technologies.  Respondents also consider education, the connection between technology and public welfare, and partnerships between government, industry, and universities. No index. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Technology & Engineering , Industrial Technology",
        "Publisher": "Rand Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Givers Gain: The BNI Story",
        "Authors": "By Ivan R. Misner, Ph.D., Jeff Morris",
        "Description": "",
        "Category": "",
        "Publisher": "Paradigm Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Psychological Disturbance in Adolescence (Personality Processes Series)",
        "Authors": "By Irving B. Weiner",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Inside Game (World of Baseball)",
        "Authors": "By Mead, William B.",
        "Description": "",
        "Category": "",
        "Publisher": "Redefinition, Inc.",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Best American Political Writing 2005",
        "Authors": "By Flippin, Royce (EDT)",
        "Description": "The Best American Political Writing 2005 is an annual compendium that culls from the nation's most influential news sources to provide the most incisive, controversial, and entertaining writing about the notable names and events of 2004 and the first half of 2005. From the 2004 presidential election to the reconstruction of Iraq; from Social Security reform to the future of the Supreme Court; from the war on terrorism and who is next to repairing American ties with Europe; editor Royce Flippin provides a diverse collection of insights, opinions, and analysis on the political events that shaped the past year.      With selections from leading publications, including the New York Times, the Washington Post, the New Yorker,the Nation, Foreign Affairs, Time, Harper's, Vanity Fair, and the Atlantic, as well as think tanks such as the American Enterprise Institute and the Brookings Institution. In addition, writings from the nation's top political commentators, including Ron Suskind, Peter Beinart, James Fallows, Joshua Green, Naomi Klein, Michael Wolff, Christopher Hitchens, and Philip Gourevitch, among many others, are also featured.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Thunder's Mouth Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Searching For A God To Love The One You Always Wanted Is Really There",
        "Authors": "By Blake, Chris",
        "Description": "Searching for a God to Love reaches out to those seeking a new understanding of God--apart from preconception, institutionalized religion, or pre-packaged agenda.  Throughout the book, Chris Blake divides the mystery surrounding who God is and reveals the powerful, infinite, and loving relationship God seeks to have with mere mortals.  With chapter titles such as \"Beyond Mother Nature\" and \"The World's Greatest Lover,\" Searching for a God to Love offers a fresh perspective for those seeking a God in whom they can believe.",
        "Category": " Religion , Spirituality",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Outrageous Joy",
        "Authors": "By Clairmont, Patsy, Walsh, Sheila, Johnson, Barbara, Clairmont, Patsy (EDT), Mullins, Traci (EDT), Swindoll, Luci, Meberg, Marilyn, and Wells, Thelma",
        "Description": "Women of Faith equals joy! Triumphant joy, exuberant joy . . . outrageous joy! And no wonder. Because as this sparkling, love-and-laugher-filled book reveals, we serve an outrageously joyful God. Dipping their pens in infectious good humor, authors and Women of Faith conference speakers Patsy Clairmont, Barbara Johnson, Marilyn Meberg, Luci Swindoll, Sheila Walsh, and Thelma Wells offer irresistible reasons for rejoicing in every circumstance of life. Using the metaphor of a circus, they encourage us to revel in the three rings of God's love. They join us in skipping across the high wire of his grace, falling back on his safety net of peace, celebrating his hope, and laughing aloud in the freedom that lets us live our lives with abandon. Outrageous Joy introduces one attraction after another--but there's never any competition among the acts! Because each chapter has its own important truth to reveal about joyous Christian living, as seen in: -The Ballyhoo at Bethlehem - Step Right Up! - Juggling, Spinning, and Smiling All the While - Flying Through the Air with the Greatest of Ease - Swallowing Swords - The Biggest Big Top . . . and other wise, merry-hearted reflections. Filled with whimsical illustrations and Barbara Johnson's 'sideshow' nuggets of wisdom and humor, Outrageous Joy will help women of all ages embrace God's outrageous plan for their lives.",
        "Category": " Religion , Christian Life , Devotional",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "You'Ve Got to Be Believed to Be Heard",
        "Authors": "By Decker, Bert",
        "Description": "A communications expert integrates anecdotes, case studies, and practical exercises to introduce a powerful new approach to speaking that emphasizes linking with the First Brain, the heart of human emotion, to promote effective communication.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "A Killer Angels Companion",
        "Authors": "By Hartwig, D. Scott",
        "Description": "",
        "Category": " History , Military , United States",
        "Publisher": "Thomas Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Einstein Almanac",
        "Authors": "By Calaprice, Alice",
        "Description": "Albert Einstein was an exceptional human being. Perhaps nothing reflects the breadth and scope of his brilliance, his interests, and his influence better than his publications -- more than six hundred scientific papers, books, essays, reviews, and opinion pieces. Einstein began publishing in March 1901 with a scientific work that appeared in the German journal Annalen der Physik when he was twenty-two; the last publication was an editorial in the journal Common Cause which appeared a few months before his death in 1955. In the fifty-four-year interval, his published work ranged widely over relativity theory and quantum physics, nationalism, Judaism, war, peace, and education. Indeed, Einstein's literary output was so abundant that even many of his most informed admirers are not familiar with all of it.The Einstein Almanac takes a look at Einstein's year-by-year output, explaining his three-hundred most important publications and setting them into the context of his life, science, and world history. Concentrating primarily on Einstein's scientific and humanitarian writings, Alice Calaprice summarizes most of the papers and describes meaningful events surrounding their publication, including Einstein's personal life, his travels, the work of other scientists, social and cultural developments at the time, and national and international events. Enjoyable and informative, The Einstein Almanac provides a unique perspective on Einstein's genius -- and his humanity.",
        "Category": " Science , Physics",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Michael Sivy's Rules of Investing: How to Pick Stocks Like a Pro",
        "Authors": "By Sivy, Michael",
        "Description": "The past ten years have been good to investors. The combination of safe bluechip stocks and more volatile growth stocks has doubled the money of well-positioned investors in five years or less. Yet some experts say that the stock boom is nearly over, that the fabulous profits of the 1980s were a fluke caused by a one-time decline in inflation and interest rates. Michael Sivy couldn't disagree more: He sees another stock market boom ahead and tells you how small investors can do as well as the pros in the coming decade. In clear, simple language, Money magazine's chief investment strategist reveals how an expanding world economy creates exceptional conditions - and extraordinary opportunities. Which fields will prosper? Which will fail? Which new products and services are likely to turn the economy upside down? With his analysis of the facts and his street-smart rules of investing, Michael Sivy will show you how to use the trends to your advantage and select the best stocks for you.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "When Everything's Said And Done",
        "Authors": "By Snoe, Eboni",
        "Description": "When the three Robinson sisters fall for the same man, which results in betrayal and tragedy, they, with the help of an elderly African healer, embark on a life-changing journey from America to Zambia where they finally find what they are searching for--identity, strength, fulfillment, and unity. 20,000 first printing.",
        "Category": " Fiction , Sagas",
        "Publisher": "Harlequin Kimani Sepia",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Real McKay: My Wide World of Sports",
        "Authors": "By McKay, Jim",
        "Description": "The veteran sportscaster known as the anchorman of ABC-TV's Wide World of Sports and eleven Olympics recounts with warmth and humor the greatest sporting events of his career and his own achievements. 75,000 first printing. Tour.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.16",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Ventriloquist's Tale, The",
        "Authors": "By Melville, Pauline",
        "Description": "Pauline Melville conjures up vivid pictures both of savanna and forest and of city life in South America where love is often trumped by disaster.  Unforgettable characters illuminate theme and plot: Sonny, the strange, beautiful and isolate son of Beatrice and Danny, the brother and sister who have a passionate affair at the time of the solar eclipse in 1919; Father Napier, the sandy-haired evangelist whom the Indians perceive as a giant grasshopper; Chofy McKinnon the modern Indian, torn between savanna life and urban future.  This is a novel that embraces nearly a century, large in scope but intimate as a whisper, where laughter is never far from the scene of tragedy; a parable of miscegenation and racial elusiveness, of nature defying culture, magic confronting rationalism and of the eternally rebellious nature of love.",
        "Category": " Fiction , Literary",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Tenth Justice",
        "Authors": "By Meltzer, Brad",
        "Description": "Fresh from Yale Law, Ben Addison is a new clerk for one of the Supreme Court's most respected justices. Along with his co-clerk, Lisa, Ben represents the best of the fledgling legal community: sharp, perfectionistic, and painstakingly conscientious - but just as green. So when he inadvertently reveals the confidential outcome of an upcoming Court decision, and one of the parties to the case makes millions, Ben starts to sweat. Big time.Ben confides in Lisa and turns to his D.C. housemates for help. They offer their coveted insiders' access - Nathan works at the State Department, Eric reports for a Washington daily, and Ober is an assistant to a leading senator - to help outsnake the blackmailer who holds Ben's once-golden future hostage. But it's not long before these inseparable pals discover how dangerous their misuse of power can be, even when accompanied by the very best of intentions. And when a suspicious leak develops from within their own circle, Ben and his friends find themselves pitted against each other in a battle of shifting alliances and fierce deceptions that strikes to the weaknesses in their friendships, threatens to ruin their careers - and ultimately may cost them their lives.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Granta 47: Losers",
        "Authors": "By Buford, Bill (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Granta Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Good Earth (Cliffs Notes)",
        "Authors": "By Huntley, Stephen Veo",
        "Description": "The original CliffsNotes study guides offer a look into key elements and ideas within classic works of literature.CliffsNotes on The Good Earth explores author Pearl S. Buck’s insight into the lives of the Chinese people, particularly the peasant population.Following the story of a Chinese farmer who represents the universal cultivator – one who knows that his riches and security come from the good earth itself, this study guide provides summaries and critical commentaries for each chapter within the novel.  Other features that help you figure out this important work includePersonal background on the authorIntroduction to and synopsis of the bookIn-depth character analyses for the two principal figures, Wang Lung and wife O-LanCritical essays on the Chinese practices of foot binding and concubinageReview section that features interactive questions and suggested essay topicsClassic literature or modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1974"
        }
    },
    {
        "Title": "Rich in Love",
        "Authors": "By Humphreys, Josephine",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Viking Penguin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Illustrated Cat: A Poster Book",
        "Authors": "By Suares, Jean-Claude",
        "Description": "A brief survey of attitudes toward the cat since ancient times introduces nearly on hundred reproductions of paintings, etchings, and drawings depicting artists' impressions of the feline in all of its moods",
        "Category": "",
        "Publisher": "Harmony Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1976"
        }
    },
    {
        "Title": "James A. Michener's Writer's Handbook: Explorations in Writing and Publishing",
        "Authors": "By Michener, James A.",
        "Description": "Pulitzer Prize–winning author James A. Michener has written about everything from the pristine islands of the South Pacific and the endless wilds of Africa to Spanish bullfighters, American revolutionaries, and pirates of the Caribbean. Now Michener turns to his favorite and most personal subject: the written word. Reproducing pages from his own handwritten rough drafts and working manuscripts, Michener walks the reader through a step-by-step guide to the entire process of writing, editing, revising, and publishing. Addressing challenges specific to both fiction and nonfiction, all the while providing thoughtful and useful solutions, James A. Michener’s Writer’s Handbook is an invaluable resource for book lovers, editors, and, of course, writers—aspiring and accomplished alike.   Praise for James A. Michener   “A master storyteller . . . Michener, by any standards, is a phenomenon.”—The Wall Street Journal   “Sentence for sentence, writing’s fastest attention grabber.”—The New York Times   “Michener has become an institution in America, ranking somewhere between Disneyland and the Library of Congress. You learn a lot from him.”—Chicago Tribune   “While he fascinates and engrosses, Michener also educates.”—Los Angeles Times",
        "Category": " Reference , Writing Skills",
        "Publisher": "Dial Press Trade Paperback",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2015"
        }
    },
    {
        "Title": "Death: The Final Stage of Growth",
        "Authors": "By Kubler-Ross, Elisabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Discover Inner Peace: A Guide to Spiritual Well-Being",
        "Authors": "By George, Mike",
        "Description": "A beautifully illustrated passageway to personal fulfillment, spiritual growth, and a true sense of self-worth, Discover Inner Peace is the latest volume in our popular series of unique guides to holistic well-being. Drawing on insights and techniques from Buddhism, Taoism, and Western meditation traditions, Discover Inner Peace is full of wisdom and instruction for finding the perfect mind-body-spirit balance. It offers more than 25 specially devised exercises for controlling emotions, maintaining positive thinking, and attaining mental clarity. This book also demonstrates how to plan and follow a spiritual calendarfrom awakening the senses in the spring to reaching maturity in the winter. Full of practical advice for improving self-esteem, overcoming adversity, and opening up to the beauty, harmony, and value of the self and the world around, Discover Inner Peace guides the reader along a new path to a fuller life.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Anger Kills: Seventeen Strategies for Controlling the Hostility That Can Harm Your Health",
        "Authors": "By Williams, Redford and Williams, Virginia",
        "Description": "In Anger Kills, Dr. Redford Williams reveals ground-breaking research that confirms that hostility not only is a serious barrier to happiness, but can lead to heart disease and other life-threatening illnesses. Dr. Williams and his wife, Virginia, team up to present the latest  research in the field and offer seventeen practical strategies that can help readers translate scientific theory into meaningful action. Begin by taking the Hostility Questionnaire, which will help you assess the degree to which hostility, cynicism, and aggression rule your life. Then start a Hostility Log and follow the Hostility Roadmap to keep track of those incidents or people that really push your buttons. With these insights, you can then move on to sample any or all of the seventeen different strategies to reduce the wrath that sabotages your health and can drain your life of joy and pleasure. In writing Anger Kills, the authors draw not only on the latest research, but on their own experiences as a couple for more than twenty-nine years and on the experiences of couples who have used the Williamses' methods successfully in various workshops the authors have led. The result is a combination of solid science with empathic explorations of the nature of human relationships and caring. This is science with a heart.",
        "Category": " Self-help , General",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Hypericum (St. John's Wort) and Depression",
        "Authors": "By McWilliams, Peter, Bloomfield, Harold H., and Nordfors, Mikael",
        "Description": "Discusses the effectiveness of the herb hypericum, or St. John's wort, in treating depression",
        "Category": " Self-help , Mood Disorders , Depression",
        "Publisher": "Mary Book / Prelude Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Court Years: 1939 to 1975",
        "Authors": "By Douglas, William Orville",
        "Description": "The second volume of the late Justice's autobiography recounts his long, controversial, and historymaking tenure on the Supreme Court and describes the cases--and the issues and debates behind them-which concerned him most",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    }
]