[
    {
        "Title": "Rattled",
        "Authors": "By Galant, Debra",
        "Description": "Heather Peters is a blond dynamo and the most acquisitive and materialistic woman you may ever meet. Along with her husband, Kevin, and eight-year-old son, Connor, she moves to Galapagos Estates, a new housing development situated just where the New Jersey suburbs meet the countryside. All Heather wants is a nice house. Well, a nice house and a nice piece of land. And, of course, a basement gym, a master bath with radiant heat, Jacuzzi, and his-and-her toilets. She could make do without a media room if she had to. After all, the pioneers didn't have plasma TV, and they survived.The action begins when Heather and Harlan, a local egg farmer who works as a sometimes handyman, are setting up her patio for a tea party. Harlan's lived in town all of his life, and while he is contemptuous of the new McMansions and their inhabitants, he's found he can make money from them. When a timber rattlesnake comes out of the grass, Heather shrieks at him to kill it. Harlan knows that these snakes are endangered, but she is kicking up such a fuss (screaming bloody murder while standing on top of her new garden furniture) that he goes ahead and does it.What neither realizes is that these snakes are being tracked by a local animal rights group and that it's a crime to kill them in the state of New Jersey. They also don't know that Galapagos Estates was illegally built on a rattlesnake habitat by a shady developer who fudged the environmental report. The dead snake is traced to Heather, who is hauled out of back-to-school night and into a jail cell. When an ambitious local reporter tells her story, Heather basks in the resulting media circus. but things get ugly when the animal rights group \"liberates\" fifteen hundred lab rats at Heather's house and the residents of Galapagos Estates band together to force the Peterses to move. But don't count her out yet - Heather doesn't get mad, she gets even.",
        "Category": " Fiction , Political",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Eat, Drink and Be Happy",
        "Authors": "By FC&A",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A Medical Pub.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Bluebird Book: The Complete Guide to Attracting Bluebirds (Stokes Backyard Nature Books)",
        "Authors": "By Stokes, Donald and Stokes, Lillian",
        "Description": "Copiously illustrated with maps, line drawings, and full-color photographs, this large format paperback book contains the essential information that backyard nature enthusiasts want and need -- to attract bluebirds to their yards.",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Mayo Clinic Guide to a Healthy Pregnancy",
        "Authors": "By Johnson, Robert V. (EDT) and Harms, Roger W., M.D. (EDT)",
        "Description": "This new Mayo Clinic book on pregnancy provides you with practical information and reassurance on pregnancy and childbirth. Compiled by Mayo Clinic experts in obstetrics, it offers a clear, thorough and reliable reference for this exciting and sometimes unpredictable journey. This comprehensivebook includes:A month-by-month look at mom and babyIn-depth \"Decision Guides\" to help you make informed decisions on topics such as how to select a health care provider, prenatal testing options, pain relief for childbirth, and many othersAn easy-to-use reference guide that covers topics such as morning sickness, heartburn, back pain, headaches and yeast infections, among othersInformation on pregnancy health concerns, including preterm labor, gestational diabetes and preeclampsia, along with an overview on being pregnant when you have pre-existing health conditions such as asthma, diabetes or hyperthyroidism",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Ready-To-Use Multicultural Activities for Primary Children",
        "Authors": "By Grevious, Saundrah Clark and Oesmann, Carrie (ILT)",
        "Description": "",
        "Category": " Education , Multicultural Education",
        "Publisher": "Center for Applied Research in",
        "Price Starting With ($)": "5.15",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Storms (Reading Rainbow Books)",
        "Authors": "By Simon, Seymour",
        "Description": "Join award-winning science writer Seymour Simon in this picture book introduction to storms!Sixteen million storms occur every year, all around the world. Some drop more than 125 million gallons of water in just twenty minutes. Others give off more electrical energy than a city uses in a week. With clear, simple text and stunning full-color photographs, readers will learn all about the fascinating phenomenon that is a storm in this informative picture book!Perfect for young scientists’ school reports, this book supports the Common Core State Standards.\"A succinct, informative essay illuminated by magnificent photographs. The stunning visual portrayal of storms, accompanied by impressive factual data and clear explanations in crisp prose, is truly compelling.\" —Horn Book.Check out these other Seymour Simon books about Weather:EarthquakesGlobal WarmingHurricanesLightningTornadoesWeatherWildfires",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Weather",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Bicentennial City: Walking Tours of Historic Philadelphia",
        "Authors": "By MARION, John Francis",
        "Description": "",
        "Category": "",
        "Publisher": "The Pyne Press",
        "Price Starting With ($)": "8.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The System",
        "Authors": "By Kriege, Jack",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Bodacious: An AOL Insider Cracks the Code to Outrageous Success for Women",
        "Authors": "By Foley, Mary E. and Finney, Martha I.",
        "Description": "Foley, who rose to the top from a customer service job on AOL, gives women advice and strategies for succeeding in today's economy. In telling the behind-the-scenes story of  AOL's start-up days and amazing growth and of her own evolution from an entry-level employee into a successful businesswoman, she points out how the qualities that made AOL such a huge success are the same ones she needed to fulfill her own potential. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Hope Is Not a Strategy: The 6 Keys to Winning the Complex Sale: The 6 Keys to Winning the Complex Sale",
        "Authors": "By Page, Rick",
        "Description": "\"No longer is being 'a good closer' the basis of sustainable success. Instead intakes the kind of strategic thinking Rick Page outlines inHope Is Not a Strategy.\"--Geoffrey Moore, author of Crossing the Chasm and Inside the TornadoMaster of the complex sale, Rick Page is the author of the bestselling book, Hope Is Not a Strategy, and one of the most sought-after sales consultants and trainers in the world.He has taught his breakthrough selling strategies to thousands of people in 150 companies across 50 countries--an amazing platform that has helped his message spread like wildfire. This paperback edition of Page's runaway sales bestseller schools readers in Page's simple, six-step process for making the sale--no matter how complex the deal or how many people are involved in the buying decision.Integrating the winning selling strategies used by the world's top salespeople, Page shows readers how to:Identify and sell to a prospect's business \"pain\" Qualify a prospect Build competitive preference Define a prospect's decision-making process",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Official Guide the Alhambra nd Generalife",
        "Authors": "By Lopez, Jesus Bermudez",
        "Description": "",
        "Category": "",
        "Publisher": "Editorial Comares",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Hawaii Kauai/Oahu/Maui/Molokai/Hawaii/Lanai",
        "Authors": "By Wenkam, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Chicago, IL Rand McNally & Co",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Volunteers in Action",
        "Authors": "By O'Connell, Brian",
        "Description": "",
        "Category": " Social Science , Volunteer Work",
        "Publisher": "Foundation Center",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Leaving Home",
        "Authors": "By Buchwald, Art",
        "Description": "A popular humorist recounts his troubled youth in the foster care system, his adult struggles with depression, and the ascent to fame that gave him a new perspective on life. By the author of Growing Up. Reprint. Tour.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Ditchdigger's Daughters: A Black Family's Astonishing Success Story",
        "Authors": "By Coudert, Jo and Thornton, Yvonne S., M.D.",
        "Description": "Incorporating her father's common sense and folk wisdom, a biography by a New Jersey doctor tells how her parents, who held down multiple jobs and transmitted strong values to their six daughters, inspired them to reach success. Reprint. Tour.",
        "Category": " Biography & Autobiography , Cultural Heritage",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Me and My World: Kindergarten (Parents Magazine)",
        "Authors": "By",
        "Description": "",
        "Category": " Juvenile Nonfiction , Concepts , General",
        "Publisher": "Learning Horizons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Sort of Rich: A Novel",
        "Authors": "By Wilcox, James",
        "Description": "Forty-year-old Gretchen Dambar leaves Manhattan with her new husband to settle in Tula Springs, Louisiana, where the comic mishaps of trying to adjust to his eclectic household take a tragic turn",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Washington: See it Again for the First Time - Looking Up",
        "Authors": "By LaVor, Marty.",
        "Description": "",
        "Category": " Photography , Subjects & Themes , Architectural & Industrial",
        "Publisher": "The LaVor Group",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Letter to a Great Grandson: A Message of Love, Advice, and Hopes for the Future",
        "Authors": "By Downs, Hugh",
        "Description": "\"When you are a great-grandfather, you will experience something so much more powerful and meaningful than being a father or a grandfather that you will look at the march of generations with new eyes.\" -- from Letter to a Great Grandson   In this heartwarming book -- written for his great-grandson but perfect for readers of all ages -- a beloved commentator and trusted public figure shares his thoughts on topics ranging from relationships to science to life in general.  When his great-grandson Alexander was born in 2002, Hugh Downs suddenly gained a rare perspective on the world from seeing American culture evolve through five generations (his parents', his own, his children's, his grandchildren's, and now his great-grandson's). Once Downs realized the extraordinary amount of love he felt for his brand-new descendant and the profound connection he sensed between them, he decided to write a letter to be read at the different stages of Alexander's life.  Letter to a Great Grandson is thoughtful and touching, funny and wise. With his trademark insight, Downs discusses the joys, possibilities, and challenges of infancy, young adulthood, middle age, old age, and everything in between. Divided into eleven chronological decades of life, it describes the common problems, achievements, and expectations of each stage. Throughout, Downs offers his characteristically erudite thoughts on myriad subjects, as well as delightful anecdotes from his own life.  A celebration of the remarkable bond between grandparents and their grandchildren (and great-grandparents and their great-grandchildren), this special book emphasizes the importance of maintaining that most precious possession -- family connections. It will resonate personally with each reading and in each new phase of life, and is a wonderful gift to be treasured for generations.",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "These Rare Lands",
        "Authors": "By strand, mark, Jorstad, Stan, and Jorstad, Stan (PHT)",
        "Description": "A tribute to America's National Parks--including the Grand Canyon, Yellowstone, and the Everglades--is seen through the lens of one of the country's greatest landscape photographers, as well as a former Poet Laureate of the United States.",
        "Category": " Nature , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "7.1",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Age of Sultan Suleyman the Magnificent",
        "Authors": "By Atil, Esin",
        "Description": "",
        "Category": "",
        "Publisher": "H. Abrams",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "YouthSearch Start Up!: Start Up! Preparing to Lead Your Small Group",
        "Authors": "By Hackett, Don",
        "Description": "YouthSearch provides a Biblically based and needs-oriented study for older youth and young adults.  The series builds on the benefits of small-group learning. Each chapter offers at least one Bible study, at least one worship opportunity, and clear directions for discussion and activities. Start Up! offers solid background for starting, leading, and strengthening small-group ministry.  Through the actual experience of being a small group, this resource provides leadership development training, valuable insight, and practical ideas that coordinate directly with the other YouthSearch resources.",
        "Category": " Religion , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "8.91",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "King's Pleasure",
        "Authors": "By Zeitlin, Ida",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Brothers Publishers",
        "Price Starting With ($)": "19.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1929"
        }
    },
    {
        "Title": "The MacGregors: Daniel & Ian: For Now, ForeverIn From The Cold",
        "Authors": "By Roberts, Nora",
        "Description": "For Now, ForeverAnna&#151;Daniel's wife of forty years&#151;relivesher remarkable courtship, when meddlesomematchmaking patriarch and self-made millionaireDaniel MacGregor faced his biggest challenge: toconvince the love of his life to marry him! Here atlast is the story of how Daniel wooed and won thefiercely independent Anna Whitfield and launched hisformidable dynasty.In From the ColdIn this story about an eighteenth-century MacGregor,we learn that battling the British couldn't prepareMinuteman Ian MacGregor for the fight he's goton his hands to win the heart of Irish spitfireAllanna Flynn.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Landmarks Of A People: A Guide To Jewish Sites In Europe",
        "Authors": "By POSTAL, Bernard & Samuel H. Abramson",
        "Description": "",
        "Category": "",
        "Publisher": "Hill and Wang",
        "Price Starting With ($)": "8.57",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Free Stuff & Bargains for SENIORS: How to save on groceries, utilities, prescriptions, taxes, hobbies and More!",
        "Authors": "By fc-a-publishing",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "An Unwilling Guest: Number Two (Classic Series)",
        "Authors": "By Hill, Grace Livingston",
        "Description": "Evelyn Rutherford, bored by life with her aunt in a quiet Ohio town, finds herself attracted to Maurice Grey, who has found peace of mind through his faith in God",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "Eat well stay well",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "Eat Well, Stay Well shows you how to cook delicious meals that are loaded with nutrients that keep you healthy and help fight disease.You'll find more than 500 good and good-for-you recipes such as: Fettuccine with Salmon (salmon is high in heart-protecting omega-3 fatty acids); Onion and Potato Pancakes (onions may help lower blood pressure; potatoes provide potassium and vitamin C); and Apple-Pear Crisp (low in calories and high in soluble fibers, a scrumptious way to lower cholesterol).Packed with information that helps you make smart decisions about meal planning, this one-of-a-kind cookbook is filled with recipes that are nutritionally rich and delicious.Other special features include Healthy Highlights - short-and-sweet explanations of nutrients in each featured food; Quick Fixings - bonus recipes, for cooks who are short on time; Foods-That-Fight-Illness chart; Nutrition A-Z: glossary of terms; and more than 450 beautiful, full-color photographs.",
        "Category": " Medical , Nutrition",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Goodnight Bush: A Parody",
        "Authors": "By Origen, Erich and Golan, Gan",
        "Description": "A brilliant parody of the children's classic Goodnight Moon, built around the coming end of the worst presidency ever.Goodnight Bush: An Unauthorized Parody is a hilarious and poignant visual requiem for the Bush administration. In it we see a childlike George W. Bush tucked safely away in the confines of his own room with all of the toys he's willfully destroyed, abused, or defaced. Complete with a quiet Dick Cheney whispering \"hush,\" this bedtime story lets us finally say goodnight to the disaster that was the last eight years.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Optical Illusion Magic Visual Tricks & Amusements",
        "Authors": "By Dispezio, Michael A.",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling Publishing Co., Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Calligraphy for the Beginner",
        "Authors": "By Gourdie, Tom",
        "Description": "Demonstrates the techniques and common styles of calligraphy, providing an historical background and aesthetic critique of Gothic, Italian, uncial, and other decorative hands",
        "Category": " Young Adult Nonfiction , Art , Techniques",
        "Publisher": "Parkwest Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Eyewitness: Baseball",
        "Authors": "By Buckley, James and Kelley, James",
        "Description": "The most trusted nonfiction series on the market, Eyewitness Books provide an in-depth, comprehensive look at their subjects with a unique integration of words and pictures. With information on everything from bats and balls to great players and World Series games, this completely revised edition of Eyewitness: Baseball includes all-new spreads on the minor leagues, college baseball, and more.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "As For Me And My House Crafting Your Marriage To Last",
        "Authors": "By Wangerin, Walter",
        "Description": "Most books on marriage offer ten easy steps and twenty-five proven principles for achieving marital bliss. But Walter Wangerin side-steps such easy answers and offers us instead an intimate portrait of his own courtship and thirty-two year marriage-and a pastoral view of married life that inspires readers to view their own marriages with new honesty and hope. Wangerin's six tasks of marriage encourages couples to better understand and happily live out the vows they made, giving them tools to nurture and maintain a strong marital relationship. In his endorsement, Philip Yancey accurately describes this book as \"an enduring classic and a book of wisdom, beauty, compassion, and piercing honesty.\"",
        "Category": " Family & Relationships , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Armed Madhouse: From Baghdad to New Orleans-Sordid Secrets and Strange Tales of a White House Gone Wild",
        "Authors": "By Palast, Greg",
        "Description": "The \"top undercover journalist in America and the funniest\" (Randi Rhodes, Air America), hangs out the dirty underpants of the \"armed and dangerous clowns that rule us.\" Feared from corporate suites to Osama's cave, Palast's old-style gumshoe detective work to dig out the info on the War on Terror, greed-dripping schemes to seize little nations with lots of oil, the hidden program to steal the 2008 election, and the media biases that keep it unreported are the meat and bones of this BBC television reporter's new book, is illustrated with dozens of documents marked \"secret\" and \"confidential\" that have walked out of file cabinets and fallen into Palast's hands.--From publisher description.",
        "Category": " Political Science , Political Process , Political Advocacy",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Fatburner: Get Slim Using the Glycemic Index Theory of Food Combining (Powerfood)",
        "Authors": "By Grillparzer, Marion and Kittler, Martina",
        "Description": "",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Silverback Books Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Existentialism and Human Emotion (A Philosophical Library Book)",
        "Authors": "By Sartre, Jean-Paul",
        "Description": "",
        "Category": " Philosophy , Movements , Existentialism",
        "Publisher": "Citadel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "How to Thrive as a Teacher Leader",
        "Authors": "By Gabriel, John G.",
        "Description": "Drawing on his experience as a high school department chair, Gabriel suggests practical strategies for positively influencing school culture, building and maintaining a successful teaching team, strengthening communications skills, equipping other potential teacher leaders, and improving student achievement. The appendix provides sample letters, memos, surveys, meeting agendas, and worksheets. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "ASCD",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "How to write school reports (Handy homework helper)",
        "Authors": "By Moore, Helen H.",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Flying Saucers Serious Business, Overwhelming New Evidence That They Are Real",
        "Authors": "By Edwards, Frank",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "The Secret Life of Bees: Tie In Edition",
        "Authors": "By Kidd, Sue Monk",
        "Description": "Sue Monk Kidd’s The Secret Life of Bees, a heartwarming coming of age tale set in 1960s South Carolina, a multi-million copy New York Times bestseller, now an award-winning film starring Dakota Fanning, Queen Latifah, Jennifer Hudson and Alicia KeysFans of  Kathryn Stockett’s The Help and Beth Hoffman’s Saving CeeCee Honeycutt will love Sue Monk Kidd’s Southern coming of age tale. The Secret Life of Bees was a New York Times bestseller for more than 125 weeks, a Good Morning America “Read This” Book Club pick and was made into an award-winning film starring Dakota Fanning, Queen Latifah, Jennifer Hudson and Alicia Keys. Set in South Carolina in 1964, The Secret Life of Bees tells the story of Lily Owens, whose life has been shaped around the blurred memory of the afternoon her mother was killed.When Lily's fierce-hearted black \"stand-in mother,\" Rosaleen, insults three of the town's most vicious racists, Lily decides they should both escape to Tiburon, South Carolina—a town that holds the secret to her mother's past. There they are taken in by an eccentric trio of black beekeeping sisters who introduce Lily to a mesmerizing world of bees, honey, and the Black Madonna who presides over their household. This is a remarkable story about divine female power and the transforming power of love—a story that women will share and pass on to their daughters for years to come.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "If Not Now, When?",
        "Authors": "By Levi, Primo",
        "Description": "Recounts the adventures of a band of Jews--former Soviet soldiers and concentration camp survivors--who battle the retreating German army in the closing days of World War II",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "True Notebooks",
        "Authors": "By Mark Salzman.",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A Knopf Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Animals in Translation: Using the Mysteries of Autism to Decode Animal Behavior (A Harvest Book)",
        "Authors": "By Grandin, Temple and Johnson, Catherine",
        "Description": "I don't know if people will ever be able to talk to animals the way Doctor Doolittle could, or whether animals will be able to talk back. Maybe science will have something to say about that. But I do know people can learn to \"talk\" to animals, and to hear what animals have to say, better than they do now. --From Animals in TranslationWhy would a cow lick a tractor? Why are collies getting dumber? Why do dolphins sometimes kill for fun? How can a parrot learn to spell? How did wolves teach man to evolve? Temple Grandin draws upon a long, distinguished career as an animal scientist and her own experiences with autism to deliver an extraordinary message about how animals act, think, and feel. She has a perspective like that of no other expert in the field, which allows her to offer unparalleled observations and groundbreaking ideas. People with autism can often think the way animals think, putting them in the perfect position to translate \"animal talk.\" Grandin is a faithful guide into their world, exploring animal pain, fear, aggression, love, friendship, communication, learning, and, yes, even animal genius. The sweep of Animals in Translation is immense and will forever change the way we think about animals. *includes a Behavior and Training Troubleshooting Guide Among its provocative ideas, the book: argues that language is not a requirement for consciousness--and that animals do have consciousness applies the autism theory of \"hyper-specificity\" to animals, showing that animals and autistic people are so sensitive to detail that they \"can't see the forest for the trees\"--a talent as well as a \"deficit\" explores the \"interpreter\" in the normal human brain that filters out detail, leaving people blind to much of the reality that surrounds them--a reality animals and autistic people see, sometimes all too clearlyexplains how animals have \"superhuman\" skills: animals have animal geniuscompares animals to autistic savants, declaring that animals may in fact be autistic savants, with special forms of genius that normal people do not possess and sometimes cannot even see examines how humans and animals use their emotions to think, to decide, and even to predict the future reveals the remarkable abilities of handicapped people and animals maintains that the single worst thing you can do to an animal is to make it feel afraid",
        "Category": " Nature , Animals , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "How to Get Red Wine Out of a White Carpet: And Over 2,000 Other Household Hints",
        "Authors": "By Bruun, Erik",
        "Description": "This must-have reference and sourcebook covers every household problem, featuring new and time-tested solutions, strategies and secrets for each room of the house-and the garden, too.  This handy guide, organized into categories including Indoor Hints, Outdoor Hints, Safety and Environment and Daily Living, features room-by-room cleaning ideas; repairs, refinishing and tools; gardening basics, lawn care and automobiles; home safety, pest control and energy-saving tricks; holiday hints, organizing methods and so much more.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Gift and Mystery",
        "Authors": "By John Paul II, Pope",
        "Description": "In a personal spiritual testimony, Pope John Paul II decribes his journey to the priesthood, discussing his childhood, education, the years of Nazi occupation that led him to dedicate his life to God, and his ministry within the Catholic Church. 1,000,000 first printing.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Image",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "In Search of Noah's Ark",
        "Authors": "By Balsiger, Dave",
        "Description": "",
        "Category": "",
        "Publisher": "Sun Classic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Extreme Danger (Hardy Boys: Undercover Brothers, No. 1)",
        "Authors": "By Dixon, Franklin W.",
        "Description": "ATAC BRIEFING FOR AGENTS FRANK AND JOE HARDY  MISSION: To find the mastermind behind a possible attack at the Big Air Games.  LOCATION: Philadelphia, PA.  POTENTIAL VICTIMS: Top extreme athletes in the country. Thousands of spectators.  SUSPECTS: There may be a group of extremists working together. There may be just one.",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "A Little Princess (Apple Classics)",
        "Authors": "By Burnett, Frances Hodgson",
        "Description": "Sara Crewe, a pupil at Miss Minchin's London School, is left in poverty when her father dies, but is later rescued by a mysterious benefactor",
        "Category": " Fiction , Classics",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "142.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Mystery of the Flying Express (Hardy Boys, Book 20)",
        "Authors": "By Dixon, Franklin W.",
        "Description": "A sleek new hydrofoil is scheduled to start ferrying passengers between Bayport and Cape Cutlass. But business enemies of the hydrofoil owner have stirred up a hornets’ nest of violent opposition among small boat owners. Fearing sabotage, he begs Frank and Joe Hardy to guard the Flying Express on her maiden trip. Startling developments plunge the teenage detectives into a dangerous chase by sea, air, and land in pursuit of a gang of hardened criminals who operate by the signs of the Zodiac. Tension mounts when the Flying Express vanishes – and so does Sam Radley, Mr. Hardy’s skilled operative. Peril stalks Frank and Joe’s every moves as they hunt down the terrifying gangleader Zodiac Zig and his vicious henchmen.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1941"
        }
    },
    {
        "Title": "Free Fall (Sisterhood, Book 7)",
        "Authors": "By Michaels, Fern",
        "Description": "Yoko Akia's mother, a teenager whom a rich American tricked into joining a twisted prostitution ring, died young after giving birth to a baby girl, and Yoko now seeks the help of her friends in punishing her father and avenging her mother.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Exhibitionist",
        "Authors": "By Sutton, Henry",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Love Like That (Red Dress Ink Novels)",
        "Authors": "By Hill, Amanda",
        "Description": "Determined to shed her bad-girl ways, Dalton Moss gets engaged to Roman, a charming man who offers her a way out of L.A. but has a hard time letting go of her addictive lover Jeremy. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "A Cup of Chicken Soup for the Soul: Stories to Open the Heart and Rekindle the Spirit",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Spilchuk, Barry (COM)",
        "Description": "Sometimes you only have time for a cup of soup. With that in mind, Jack Canfield, Mark Victor Hansen and Barry Spilchuk give you this collection of brand-new stories in a single-serving volume. Now you can enjoy fresh Chicken Soup for the Soul whenever you have a few spare moments.A Cup of Chicken Soup for the Soul is the perfect gift for readers who love the original Chicken Soup for the Soul. It's great for businesspeople on the run, young people in need of inspiration, individuals with limited reading time, or anyone looking for a quick pick-me-up.Enjoy A Cup of Chicken Soup for the Soul and share its goodness with your loved ones.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Health Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Discipline with Dignity for Challenging Youth",
        "Authors": "By Mendler, Allen N.",
        "Description": "",
        "Category": "",
        "Publisher": "Solution Tree",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "L.A. Times",
        "Authors": "By Woods, Stuart",
        "Description": "Stuart Woods, bestselling author of Palindrome, New York Dead, and Santa Fe Rules, has written a mesmerizing new thriller about Hollywood and the mob.Vinnie Callabrese toils in the mean world of a Mafia hood, violently enforcing his loan-shark boss's debt collections, but he lives in the world of the movies, one where he can tie a bow tie like Cary Grant and speak with the voice of Tyrone Power.Vinnie is smart, too, and he finds a way to turn his dream world into reality. Arriving on the West Coast with a new identity and some ill-gotten gains, Vinnie discovers that his sociopathic nature is just the ticket for handling the intrigues of tinseltown. He employs his old techniques of deceit, coercion, sexual conquest - even murder - to carve out a place at the top of the film industry.But Vinnie's old neighborhood friends have excellent memories and a long reach, and soon his fast-track career is facing derailment - or even worse, a new driver at the controls.Stuart Woods delivers a stunning story of greed, triumph, and deception, propelling L.A. Times at breakneck speed from its first page to its harrowing climax.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Festive Picnics: Recipes, Crafts and Decorations for Outdoor Occasions",
        "Authors": "By Barry, Jennifer and Oudkerk-Pool, Joyce (PHT)",
        "Description": "Garnished by an Aspen grove, seasoned with the aroma of salt water, or washed down with a fresh mountain breeze—a meal tastes even better when enjoyed in the great outdoors. Picnics can be formal affairs with fine china or impromptu spreads with bread, cheese, and wine; either way, they make occasions such as the Fourth of July, Mother's Day, or an anniversary all the more memorable. Packed with more than 40 recipes for salads, barbecues, desserts, drinks, and more, FESTIVE PICNICS is brimming with both picnic standbys as well as special-event fare. Traditional picnic eats such as Old-Fashioned Coleslaw and Black and White Chocolate Brownies will have your guests basking in life's simple pleasures. And the more gourmet recipes like Cold Avocado and Cucumber Soup, Hummus and Pickled Onion Sandwich Wraps, and Banana Cake with Blueberry Sauce will have your guests debating which is most outstanding—the food or the surroundings.Yet as appealing as the recipes are, it may be the craft ideas that make you set a date. FESTIVE PICNICS includes craft and decorating ideas perfect for an outing with friends or a beach day with the kids. Picnic Sand Pails, Picnic Party Fans, and Rice Paper Candle Holders are just a few of the crafts that will add ambience to your beautiful spread. Also included are a handy picnic packing list plus menu suggestions for holidays and themes such as Father's Day, a beach party, a bike/hike outing, and more. A guide to gourmet picnic eats plus craft ideas for making outdoor meals festive and fun.Features 8 recipes for picnic barbecues and 6 thirst-quenching recipes for cool picnic drinks.",
        "Category": " Cooking , Methods , Outdoor",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Real Simple: Cleaning",
        "Authors": "By Buck, Monica (PHT), Brathwaite, Philippa (CON), and Squires, Kathleen",
        "Description": "Breaking down the dirtiest home-cleaning jobs into manageable tasks, a room-by-room handbook presents step-by-step techniques and strategies for cleaning and maintaining a healthy home, and includes tips on tools and products to keep on hand, troubleshooting hints for stubborn stains and dirt, speed-cleaning recipes, and specialized advice on furnishings, fabrics, walls, and flooring. 100,000 first printing.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Whitetail Deer (The Complete Hunter)",
        "Authors": "By Clancy, Gary and Nelson, Larry R.",
        "Description": "",
        "Category": " Sports & Recreation , Hunting",
        "Publisher": "creative publishing international, inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Bradleys and the Mysterious Letter",
        "Authors": "By Bernard Palmer",
        "Description": "",
        "Category": "",
        "Publisher": "Back to the Bible Broadcast",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Where My Heart Belongs",
        "Authors": "By Peterson, Tracie",
        "Description": "Twelve years after demanding her share of the family's money and disappearing without a trace, spoiled Amy Halbert shows up at the family farm in Kansas to visit her dying father, who begs his older daughter, Kathy, to welcome Amy back into the family, but as Kathy struggles with the old feelings of betrayal and bitterness, she and sister sort through their parents belongings and a past full of pain. Simultaneous. 55,000 first printing.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Mr. Food's Quick and Easy Side Dishes",
        "Authors": "By Ginsburg, Art",
        "Description": "A wide-ranging collection of side dishes offers ideal suggestions for complementing several main courses and events, including Sweet Potato French Fries, Spaghetti Rice, and Tropical Cole Slaw. 100,000 first printing.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Cassidy (Big Sky Dreams, Book 1)",
        "Authors": "By Wick, Lori",
        "Description": "With few people aware of her past, Cassidy Norton, a fine seamstress living in Token Creek, Montana, leads a rich life filled with friends and church family, but after her friend Meg has a baby, something Cassidy wants for herself, she must find someone to love and must gather the strength to reveal the details of her life. Original.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Sidney Reilly: The True Story of the World's Greatest Spy",
        "Authors": "By Kettle, Michael",
        "Description": "Profiles the legendary secret agent, whose career encompassed several continents and numerous nations, born to a wealthy Polish Jewish family, married three times, and carried on scores of affairs, and whose plots included a plan to overthrow Lenin and himself assume command of Russia",
        "Category": " Political Science , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "The Essential Wine Book: An Indispensable Guide to the Wines of the World",
        "Authors": "By Clarke, Oz",
        "Description": "Oz Clarke's perennial bestseller The Essential Wine Book is one of the most original and diverting wine volumes ever published. Now this conversational encyclopedia of wine, which provides complete coverage of all wine regions of the world, has been revised, updated, and expanded to reflect the latest changes in the fast-developing world of wine.  Clarke's extraordinary wine-tasting talents and eloquence combine in this beautifully illustrated book to produce a resource for every wine lover, whether a newcomer or a longtime aficionado. With his trademark combination of hard facts and breezy practical advice, Clarke outlines what makes each wine work -- what it tastes like, why it's different from its neighbors, and most important, whether or not it is worth seeking out.  Each chapter covers a different wine-producing region of the world and includes:  * A lively introduction to the region, with useful maps and a full description of grape varieties cultivated and wine styles produced  * Evocative descriptions of the taste of the region's wines, explanations of how to read the local wine labels, evaluations of recent vintages, and recommendations for enjoying these wines with food  * Vintage ratings and tasting notes, along with useful summaries of the value-for-money and availability of specific wine styles",
        "Category": " Cooking , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Life's Little Instruction Book (Life's Little Instruction Book , Vol 3)",
        "Authors": "By Brown, H. Jackson",
        "Description": "Culled from contributions sent to the author by thousands of fans of the first two collections, the third installment offers encouragement and wisdom toward a happy, rewarding life. Original. 600,000 first printing. IP.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "An Affair Before Christmas (Desperate Duchesses, Bk 2)",
        "Authors": "By James, Eloisa",
        "Description": "Magic under the mistletoe . . .One spectacular Christmas, Lady Perdita Selby, known to her friends and family as Poppy, met the man she thought she would love forever. The devilishly attractive Duke of Fletcher was the perfect match for the innocent, breathtakingly beautiful young Englishwoman, and theirs was the most romantic wedding she had ever seen. Four years later, Poppy and the duke have become the toast of the ton . . . but behind closed doors the spark of their love affair has burned out.Unwilling to lose the woman he still lusts after, the duke is determined to win back his beguiling bride's delectable affections . . . and surpass the heady days of first love with a truly sinful seduction.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Preparing for Marriage",
        "Authors": "By Boehi, David, Nelson, Brent, Schulte, Jeff, and Shadrach, Lloyd",
        "Description": "Preparing for Marriage, along with the accompanying Leader’s Guide, were developed to help engaged couples prepare for the important task of building a Christian marriage. This resource provides engaged couples opportunities to develop good communication skills and deal with issues of personal expectations, family histories, role responsibilities, communication, finances and the traits of a biblical marriage. It encourages the development of a mentoring relationship with an older married couple. Each session includes informative Bible study, discussion questions and special projects to be completed by the couple to reinforce the topic of the session. The study can be used by counselors, groups or individual couples. Has 6 sessions",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Rich Men, Single Women",
        "Authors": "By Beck, Pamela and Massman, Patti",
        "Description": "Three ambitious women forego their dead-end careers to move to Los Angeles and hunt for wealthy husbands",
        "Category": " Fiction , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Jerusalem Betrayed: Ancient Prophecy and Modern Conspiracy Collide in the Holy City",
        "Authors": "By Evans, Mike",
        "Description": "From one of America's leading experts on Israel and the Middle East, this riveting book is the true story of what is happening in the cabinet rooms and war rooms across the world-Jerusalem's final betrayal brokered in the name of the Middle East.",
        "Category": " Religion , History",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Inventing Better Schools: An Action Plan for Educational Reform (Jossey Bass Education Series)",
        "Authors": "By Schlechty, Phillip C.",
        "Description": "Schlechty shows both educators and parents how to envision reform and design quality educational systems. He explains how the visioning process must be rooted in real shared beliefs, how mission statements must unpack visions into concrete goals that are connected to action, and how the results of reform can be usefully assessed. Drawing on the author's vast experience in the day-to-day work of implementing school reform, Inventing Better Schools offers new approaches for setting standards and ensuring accountability--and includes samples of actual mission statements and strategic plans of successful school districts.",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Laura: The Life of Laura Ingalls Wilder",
        "Authors": "By Zochert, Donald",
        "Description": "Courage, Adventure, Steadfast LoveFrom a little house set deep in the Big Woods of Wisconsin, across Indian territory and into the Dakotas, Laura's family moved westward right along the frontier.Their true-life saga, beloved by countless millions of TV viewers and readers of the bestselling Little House books, is one of spirit and devotion in the face of bitter-cold winters, wilderness trails, and heartbreaking personal tragedy.Here, for the first time, and drawing on her own unpublished memoirs is the endlessly fascinating full account of Laura's life -- from her earliest years through her enduring marriage to Almanzo Wilder, the \"farmer boy\" of her stories.",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1977"
        }
    },
    {
        "Title": "Candide, Zadig, and Selected Stories",
        "Authors": "By Voltaire (TRN)",
        "Description": "The story of Candide, a naive youth who is conscripted, shipwrecked, robbed, and tortured by the Inquisition without losing his will to live, is accompanied by fifteen other short stories by the French master of social commentary, including \"Zadig,\" \"Memnon,\" and \"The World as It Is.\" Reissue.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1961"
        }
    },
    {
        "Title": "War Brides",
        "Authors": "By Battle, Lois",
        "Description": "Three young Australian women--each in search of a personal vision of the American dream--follow their Yankee husbands home after World War II",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Militant Islam Reaches America",
        "Authors": "By Pipes, Daniel",
        "Description": "One of the most far-reaching examinations of militant Islam written to date. Long before September 11, Daniel Pipes publicly warned Americans that militant Islam had gone to war against America. Drawing on his thirty years of intensive research on Islam, he shows the vital distinction between the faith of Islam and the ideology of militant Islam. Among his findings: militant Islam has much in common with fascism and communism; about one in every eight Muslims worldwide supports militant Islam; 70,000 Al-Qaeda accomplices remain at large in over fifty countries; Michael Jackson and Madonna are, in the eyes of militant Islam, \"cultural terrorists\" who should be brought to trial; militant Islamic groups have raised $1.3 million for the defense of indicted murder suspect Jamil Al-Amin (formerly H. Rap Brown). Militant Islam Reaches America is one of the important and readable books about the grave issues that now confront America.",
        "Category": " Religion , Islam , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The Declaration of Independence and The Constitution of the United States (Bantam Classic)",
        "Authors": "By United States Declaration of Independence (COR), Maier, Pauline, and United States Constitution (COR)",
        "Description": "Together in one book, the two most important documents in United States history form the enduring legacy of America’s Founding Fathers including Thomas Jefferson, James Madison, and Alexander Hamilton.The Declaration of Independence was the promise of a representative government; the Constitution was the fulfillment of that promise.On July 4, 1776, the Second Continental Congress issued a unanimous declaration: the thirteen North American colonies would be the thirteen United States of America, free and independent of Great Britain. Drafted by Thomas Jefferson, the Declaration set forth the terms of a new form of government with the following words: \"We hold these Truths to be self-evident, that all men are created equal, that they are endowed with certain unalienable Rights, that among these are Life, Liberty, and the Pursuit of Happiness.\"Framed in 1787 and in effect since March 1789, the Constitution of the United States of America fulfilled the promise of the Declaration by establishing a republican form of government with separate executive, legislative, and judicial branches. The first ten amendments, known as the Bill of Rights, became part of the Constitution on December 15, 1791. Among the rights guaranteed by these amendments are freedom of speech, freedom of the press, freedom of religion, and the right to trial by jury. Written so that it could be adapted to endure for years to come, the Constitution has been amended only seventeen times since 1791 and has lasted longer than any other written form of government.",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "To the Summit",
        "Authors": "By Murphy, Claire Rudolf",
        "Description": "Seventeen-year-old Sarah hopes that accompanying her father on an expedition to climb Mount McKinley will help to bridge the gap that has widened between them since her parents' divorce",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Bodies",
        "Authors": "By Barnard, Robert",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Mossflower (Prequel to Redwall)",
        "Authors": "By Jacques, Brian",
        "Description": "New York Times bestselling author Brian Jacques gives us another tale of Redwall, filled with “The Knights of the Round Table with paws” (The Sunday Times) along with their friends and enemies.The thrilling prequel to \"Redwall\". When the clever and greedy wildcat Tsarmina becomes Queen of a Thousand Eyes and ruler of all Mossflower Woods, she is determined to govern the peaceful woodlanders with an iron paw, bringing every otter and hedgehog, every mouse and squirrel, whimpering to their knees.”  But the brave mouse Martin and quick-talking mousethief Gonff meet in the depths of Kotir Castle’s dungeon. With the aid of all the woodlanders, the two escape and resolve to end Tsarmina’s tyrannical rule. Joined by Kinny the mole, Martin and Gonff set off on a dangerous quest for Salamandastron, mountain of dragons, where they are convinced that their only hope, Boar the Fighter, still lives…",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Icerigger",
        "Authors": "By Foster, Alan Dean",
        "Description": "",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "From the Depths (Star Trek, Book 66)",
        "Authors": "By Milan, Victor",
        "Description": "From The Depths  Okeanos, a water world settled centuries ago by a group of Federation separatists, is now rocked by the power struggle between the natives and the ex-Federation colony. When the U.S.S. Enterprise? is sent beyond the Federation's boundaries to the planet to act as mediators, they are surprised to find a group of Klingons already serving as the natives' advisors.  The volatile situation rapidly deteriorates when one of Okeanos's great floating cities is completely destroyed, and Captain Kirk is arrested for sabotage. now at the center of a deadly civil war, Mr. Spock and the crew must race to free their captain as they face the deadly secret hidden beneath Okeano's murky depths.",
        "Category": " Fiction , Science Fiction , Space Opera",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Heart of Darkness and The Secret Sharer (Bantam Classics)",
        "Authors": "By Conrad, Joseph",
        "Description": "Heart Of Darkness. The story of the civilized, enlightened Mr. Kurtz who embarks on a harrowing \"night journey\" into the savage heart of Africa, only to find his dark and evil soul. The Secret Sharer. The saga of a young, inexperienced skipper forced to decide the fate of a fugitive sailor who killed a man in self-defense. As he faces his first moral test the skipper discovers a terrifying truth -- and comes face to face with the secret itself. Heart Of Darkness and The Secret Sharer draw on actual events and people that Conrad met or heard about during his many far-flung travels. In portraying men whose incredible journeys on land and at sea are also symbolic voyages into their own mysterious depths, these two masterful works give credence to Conrad's acclaim as a major psychological writer.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1982"
        }
    },
    {
        "Title": "Napoleon's Pyramids (Ethan Gage Adventures)",
        "Authors": "By Dietrich, William",
        "Description": "“A frothy, swashbuckling tale of high adventure….Escapist fiction at its ultimate.”—Seattle Times“It has a plot as satisfying as an Indiana Jones film and offers enough historical knowledge to render the reader a fascinating raconteur on the topics of ancient Egypt and Napoleon Bonaparte.”—USA Today A Pulitzer Prize-winning journalist, author William Dietrich introduces readers to the globe-trotting American adventurer Ethan Gage in Napoleon’s Pyramids—an ingenious, swashbuckling yarn whose action-packed pages nearly turn themselves. The first book in Dietrich’s fabulously fun New York Times bestselling series, Napoleon’s Pyramids follows the irrepressible Gage—a brother in spirit to George MacDonald Fraser’s Flashman—as he travels with Napoleon’s expedition across the burning Egyptian desert in an attempt to solve a 6,000 year old riddle with the help of a mysterious medallion. Here is superior adventure fiction in the spirit of Jack London, Robert Lewis Stevenson, and H. Rider Haggard, and fans of their acclaimed successors—James Rollins, David Liss, Steve Berry, Kate Mosse—will certainly want to get to know Ethan Gage.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Slightly Scandalous",
        "Authors": "By Balogh, Mary",
        "Description": "Meet the Bedwyns…six brothers and sisters—men and women of passion and privilege, daring and sensuality.Enter their dazzling world of high society and breathtaking seduction…where each will seek love, fight temptation, and court scandal…and where Freyja Bedwyn, the wild-hearted daughter, meets her match in a man as passionate, reckless, and scandalous as she.Growing up with four unruly brothers has made Freyja Bedwyn far bolder than most society ladies. From feisty manner to long, tumbling hair, Lady Freyja is pure fire, a woman who seeks both adventure and freedom. Adventure soon finds her on a visit to Bath, when a handsome stranger bursts into Freyja's room and entreats her to hide him. His name is Joshua Moore, Marquess of Hallmere, a man with a hell-raising reputation of his own who is quickly intrigued by the independent beauty. So intrigued, in fact, that he makes her a surprising request: to pose as his fiancée and help thwart his family's matchmaking schemes. For two people determined to be free, it's the perfect plan…until passion blindsides them both. For as Joshua sets out to achieve his complete seduction of Freyja, a woman who has sworn off love is in danger of losing the one thing she never expected to give again: her heart…",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Karl Marx (Modern masters)",
        "Authors": "By McLellan, David",
        "Description": "An introduction to the life and controversial, internationally influential writings and theories of Marx, assessing his achievements, impact, and reputation",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "19.97",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "The Identity of Man",
        "Authors": "By Bronowski, J.",
        "Description": "",
        "Category": "",
        "Publisher": "The Natural History Press Garden City NY",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "How to Handle Your Emotions: Anger, Depression, Fear, Grief, Rejection, Self-Worth (Counseling Through the Bible Series)",
        "Authors": "By Hunt, June",
        "Description": "The first of an exciting new series of topical counseling resources offering God's truth for today's problems!Every person struggles with the common emotions related to...angerdepressionfearrejectionself-worthHow can we prevent negative emotions from getting the best of us? Longtime biblical counselor June Hunt looks to the Bible for the answers, offering compassionate guidance that encourages the heart and offers hope for even the most difficult situations.Each of the above topics is explored in four parts, examining the definitions, the characteristics, the causes, and the solutions that enable us to handle our emotions in ways that honor God and bless the people around us. At every step of the way, valuable insights are gleaned from Scripture.Written with a strong emphasis on practical applications that make a lasting difference, this guide is perfect for use by individuals, friends, small groups, and ministry workers.",
        "Category": " Religion , Counseling",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Benediction",
        "Authors": "By Salvatore, Diane",
        "Description": "",
        "Category": "",
        "Publisher": "Naiad Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Ariel Sharon: A Life",
        "Authors": "By Hefez, Nir, Bloom, Gadi, and Ginsberg, Mitchell (TRN)",
        "Description": "The first definitive biography of one of the world's most important and controversial political figures interweaves the tumultuous life and career of the Israeli leader with the historical evolution of Israel, exploring his military career, rise to political power, dramatic personal life, controversial stands on current issues, and more. 50,000 first printing.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Real Ghosts, Restless Spirits, and Haunted Places",
        "Authors": "By Steiger, Brad",
        "Description": "In addition to rounding up the usual suspects, including the Bell Witch, Borley Rectory, the monster of Glarris Castle, and Gef, the mongoose/poltergeist on the Isle of Man, this book includes much that is new for the dedicated ghost aficionado.",
        "Category": " Body, Mind & Spirit , Occultism",
        "Publisher": "Visible Ink Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Cold Paradise (A Stone Barrington Novel)",
        "Authors": "By Woods, Stuart",
        "Description": "Stone Barrington gets reacquainted with a long-buried case and an ex-lover in this electrifying thriller in the #1 New York Times bestselling series.Luxuriating in Palm Beach's winter warmth, Stone is stunned to recognize someone he thought was dead. Former client Allison Manning is alive and well—and suddenly very rich. Now she needs Stone's help in squaring a charge of insurance fraud that's been hanging over her head for years—and in getting rid of a recently acquired stalker. Suspects abound, including an elusive writer, an enigmatic businessman, and Allison's devious former husband. Only Stone can thwart the sly and greedy plan to steal the millions of dollars at stake—and the crafty killer behind it...",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Great Railway Bazaar : By Train Through Asia",
        "Authors": "By Theroux, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1976"
        }
    },
    {
        "Title": "Clinical Epidemiology: The Essentials",
        "Authors": "By Fletcher, Robert H., Fletcher, Suzanne W., Ph.D., and Wagner, Edward H., M.D.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Williams & Wilkins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Luncheon of the Boating Party",
        "Authors": "By Vreeland, Susan",
        "Description": "From the bestelling author of GIRL IN HYACINTH BLUE, \"A vivid exploration of one of the most beloved Renoir paintings in the world, done with a flourish worthy of Renoir himself\" (USA Today)  With her richly textured novels, Susan Vreeland has offered pioneering portraits of artists' lives. As she did in Girl in Hyacinth Blue, Vreeland focuses on a single painting, Auguste Renoir's instantly recognizable masterpiece, which depicts a gathering of Renoir's real friends enjoying a summer Sunday on a café terrace along the Seine. Narrated by Renoir and seven of the models, the novel illuminates the gusto, hedonism, and art of the era. With a gorgeous palette of vibrant, captivating characters, Vreeland paints their lives, loves, losses, and triumphs so vividly that \"the painting literally comes alive\" (The Boston Globe).",
        "Category": " Fiction , Historical , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Moon and Sixpence",
        "Authors": "By W Somerset Maugham",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1977"
        }
    },
    {
        "Title": "A Wanted Man (A Stone Creek Novel, 2)",
        "Authors": "By Miller, Linda Lael",
        "Description": "The past tends to catch up with folks in Stone Creek, Arizona. So schoolmarm Lark Morgan and Marshal Rowdy Rhodes are determined to hide their secrets?and deny their instant attraction. That should be easy, since each suspects the other of living a lie.?But Rowdy and Lark share one truth: both face real dangers. Like the gang of train robbers heading their way, men Ranger Sam O'Ballivan expects Rowdy to nab. And as past and current troubles collide, Rowdy and Lark must surrender their pride to the greatest power of all?undying love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Country Wives (A Barleybridge Novel)",
        "Authors": "By Shaw, Rebecca",
        "Description": "Welcome back to Barleybridge, the picture-postcard English village where everybody knows their neighbors . . .Kate Howard is still working as the receptionist at the Barleybridge Veterinary Hospital, but now she is determined to attend veterinary college. Things are running smoothly, both at work and in Kate’s life, especially now that Scott Spencer, the handsome Australian vet who stole Kate’s heart, has left town. But Scott’s replacement, Daniel Brown, is quickly making enemies of the staff and clients alike with his abrupt style and unreasonable demands. When Dan causes the loss of an important client, the wives connected to the practice determine that something must be done to stop him.For her part, Kate secretly appreciates Dan’s no-nonsense approach, despite everyone else’s ongoing annoyance. When Kate is faced with a devastating tragedy, Dan reveals a sad secret of his own and helps her through her crisis. But what will the rest of the town think of their newfound friendship?Delightfully warm, engaging, and filled with the simple joys of small-town English life, Country Wives will inspire readers to return to Barleybridge again and again.",
        "Category": " Fiction , General",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Body Bags: A Body of Evidence Thriller #1",
        "Authors": "By Golden, Christopher",
        "Description": "\"The first day at college, my professor dropped dead. The second day, I assisted at his autopsy. Let's hope I don't have to go through four years of this....\"  When Jenna Blake starts her freshman year at Somerset University, she's not only living on her own for the first time, she's moving closer to the father she never really knew. It's an exciting time, filled with new faces and new challenges, not to mention parties and guys and...corpses?  Jenna feels torn about her future. She'd like to be a doctor like her mother, but she can't stand the sight of blood. Her father, a criminology professor, thinks he has the answer and sends her to interview for a job with the medical examiner -- an interview that takes place in the middle of an autopsy.  When a congressional aide goes violently insane and then drops dead, the pathology team at Somerset Medical Center discovers that his brain was ravaged with disease -- and loaded with insect larvae. As Jenna starts her new job, she is drawn into a web of terrifying disease, dangerous politics, and intriguing mystery. And when one of her professors ends up dead, she starts making connections even the police haven't seen...connections which will bring her face to face with a pair of killers: one medical, and one all too human.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Last World War",
        "Authors": "By Ward, Dayton",
        "Description": "It started small, with an unprepared band of Marine reservists encountering deadly extraterrestrial visitors in the backwoods of Missouri. But this fatal First Contact rapidly escalates into a global crisis as mankind discovers that two warring species of aliens have invaded our world through a network of hidden interdimensional portals. The apocalyptic conflict between the hastily labeled \"Blues\" and \"Grays\" has already devastated their home planet. Now Earth has become the final battleground in a cataclysmic war whose origins are barely understood.  Forced into a hasty alliance with the alien Blues, humanity has no choice but to brave the awesome Gray onslaught in every corner of the Earth. From the mean streets of Atlanta to the mountains of Afghanistan, from Washington, D.C., to the alien's war-torn homeworld, all of humanity must unite to survive.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Plagiarist: A Novel",
        "Authors": "By Cheever, Benjamin",
        "Description": "The son of an aging alcoholic writer leaves his dead-end job as a journalist at a suburban newspaper to work for a magazine with a worldwide readership, and the career move transforms his life in ways he could never have imagined.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "25.62",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Where Truth Lies",
        "Authors": "By Heggan, Christiane",
        "Description": "Museum curator Grace McKenzie is shocked when she receives word that her ex-fiancé, Steven Hatfield, has been murdered. In his will, Steven has left her his art gallery in New Hope, Pennsylvania. Anticipating that she would turn down the bequest, he asked that she spend a week at the gallery before making her final decision. Motivated by a sense of duty to a man she once loved, Grace agrees to go to New Hope for one week.She isn't the only person drawn to the small town. FBI agent Matt Baxter has returned to his hometown for one reason only—to clear his father of a bogus murder charge. While he and Grace seek answers, they discover that beneath the surface of this charming, peaceful town lies an old secret a few of its citizens would rather keep buried. And when their search takes an unexpected turn, they have only hours to find out where the truth lies—or be buried with it.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    }
]