[
    {
        "Title": "The Glory of Venice: Art in the Eighteenth Century",
        "Authors": "By National Gallery of Art (U. S.) (COR), Royal Academy of Arts (Great Britain) (COR), Martineau, Jane (EDT), and Robison, Andrew (EDT)",
        "Description": "Venice, home of Tiepolo, Canaletto, Piranesi, Piazzetta, and Guardi, was the most artistic city of eighteenth-century Italy. This beautiful book examines the whole range of the arts in Venice during this period, including paintings, pastels and gouaches, drawings and watercolours, prints and illustrated books and sculpture.The book begins with an introduction by Andrew Robison, and a general introduction to Venetian art by Michael Levey. Essays by other eminent authorities then discuss the international taste for Venetian art and major aspects of the art of the period. The essays are followed by a catalogue that discusses and reproduces many of the finest works of the time along with biographies and critical discussions of the artists. The selection of works emphasises the beauty, quality, distinctiveness, variety, balance, and unity of Venetian art. It includes altarpieces by Tiepolo, Piazzetta, and others that demonstrate the importance of profoundly serious and grand religious art; it presents the finest examples of history painting and allegory, views and landscapes, architectural fantasies, decorative paintings, and portraits; and it offers a large selection of particularly fine graphic art, for many of the greatest painters - Marco Ricci, Piazzetta, Canaletto, and Tiepolo - also devoted themselves to printmaking, book illustration, and designs for stage sets and the decorative arts, and often found greater freedom for their fantasy in such works.",
        "Category": " Art , History , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "10.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Islam, Fundamentalism, and the Betrayal of Tradition: Essays by Western Muslim Scholars (Perennial Philosophy)",
        "Authors": "By Lumbard, Joseph E. B. (EDT) and Nasr, Seyyed Hossein (FRW)",
        "Description": "This book offers an analysis byWestern Muslim scholars of the key reasons behind the dangerous breaksown in understanding  between Islam and the West.",
        "Category": " Religion , Islam , General",
        "Publisher": "World Wisdom",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Menopause Self Help Book",
        "Authors": "By Lark, Susan M.",
        "Description": "Describes how to minimize the effects of menopause, and offers advice on diet, vitamins, stress reduction, exercise, acupressure, yoga, and estrogen replacement therapy",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Those Who Save Us",
        "Authors": "By Blum, Jenna",
        "Description": "For fifty years, Anna Schlemmer has refused to talk about her life in Germany during World War II. Her daughter, Trudy, was only three when she and her mother were liberated by an American soldier and went to live with him in Minnesota. Trudy's sole evidence of the past is an old photograph: a family portrait showing Anna, Trudy, and a Nazi officer, the Obersturmfuhrer of Buchenwald. Driven by the guilt of her heritage, Trudy, now a professor of German history, begins investigating the past and finally unearths the dramatic and heartbreaking truth of her mother's life. Combining a passionate, doomed love story, a vivid evocation of life during the war, and a poignant mother/daughter drama, Those Who Save Us is a profound exploration of what we endure to survive and the legacy of shame.",
        "Category": " Fiction , Literary",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Private Scores",
        "Authors": "By Wallach, Anne Tolstoi",
        "Description": "Disturbing changes in her seven-year-old daughter Livvie's behavior sends newly divorced casting director Cornelia Fuller to psychiatrist Dave Nilssen, from whom she receives wise advice and loving support and who uncovers Livvie's heartbreaking secret",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "6.34",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Still Life",
        "Authors": "By Byatt, A. S.",
        "Description": "Stephanie Potter gives up a promising academic career to marry Daniel Orton, while her sister, Frederica, enters Cambridge, and her brother, Marcus, begins recovering from a nervous breakdown",
        "Category": "",
        "Publisher": "Macmillan Publishing Company, Incorporated",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Guests of the Ayatollah: The Iran Hostage Crisis: The First Battle in America's War with Militant Islam",
        "Authors": "By Bowden, Mark",
        "Description": "From the best-selling author of Black Hawk Down comes a riveting, definitive chronicle of the Iran hostage crisis, America’s first battle with militant Islam. On November 4, 1979, a group of radical Islamist students, inspired by the revolutionary Iranian leader Ayatollah Khomeini, stormed the U.S. embassy in Tehran. They took fifty-two Americans hostage, and kept nearly all of them hostage for 444 days. In Guests of the Ayatollah, Mark Bowden tells this sweeping story through the eyes of the hostages, the soldiers in a new special forces unit sent to free them, their radical, naïve captors, and the diplomats working to end the crisis. Bowden takes us inside the hostages’ cells and inside the Oval Office for meetings with President Carter and his exhausted team. We travel to international capitals where shadowy figures held clandestine negotiations, and to the deserts of Iran, where a courageous, desperate attempt to rescue the hostages exploded into tragic failure. Bowden dedicated five years to this research, including numerous trips to Iran and countless interviews with those involved on both sides. Guests of the Ayatollah is a detailed, brilliantly re-created, and suspenseful account of a crisis that gripped and ultimately changed the world.",
        "Category": " History , Middle East , General",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "True Beauty: Positive Attitudes and Practical Tips from the World's Leading Plus-Size Model",
        "Authors": "By Emme, Paisner, Daniel, and Paisner, Emme",
        "Description": "Plus-size supermodel Emme shares her story of triumph over a negative body image and offers tips for developing a positive self-image and surpassing stereotypes through dressing, shopping, dating, travel, exercise, and much more. Reprint.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "100 years of baseball",
        "Authors": "By David Nemec, Saul Wisnia",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "9.3",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Results-Based Leadership",
        "Authors": "By Ulrich, David, Smallwood, Norman, and Zenger, Jack",
        "Description": "A landmark book, Results-Based Leadership challenges the conventional wisdom surrounding leadership. Authors Ulrich, Zenger, and Smallwood--world-renowned experts in human resources and training--argue that it is not enough to gauge leaders by personal traits such as character, style, and values. Rather, effective leaders know how to connect these leadership attributes with results. Results-Based Leadership shows executives how to deliver results in four specific areas: results for employees, for the organization, for its customers, and for its investors. The authors provide action-oriented guidelines that readers can follow to develop and hone their own results-based leadership skills. By shifting our focus to the connection between the attributes and the results of leadership, this perceptive new guide fundamentally improves our understanding of effective leadership. Results-Based Leadership brings a refreshing clarity and directness to the leadership discussion, providing a hands-on program to help executives succeed with their leadership challenges.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The \"Putting on the Brakes\" Activity Book for Young People With ADHD",
        "Authors": "By Quinn, Patricia O., Stern, Judith M., and Russell, Neil (ILT)",
        "Description": "Provides people with attention deficit hyperactivity disorder with suggestions, puzzles, and activities to help them understand and gain control over their condition and improve their study habits.",
        "Category": " Juvenile Nonfiction , Study Aids , General",
        "Publisher": "Magination Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Break No Bones: A Novel (Temperance Brennan Novels)",
        "Authors": "By Reichs, Kathy",
        "Description": "Following the tremendous success of Cross Bones, Kathy Reichs explores another high-profile topic in Break No Bones -- a case that lands forensic anthropologist Temperance Brennan in the middle of a gruesome international scheme.   Summoned to South Carolina to fill in for a negligent colleague, Tempe is stuck teaching a lackluster archaeology field school in the ruins of a Native American burial ground on the Charleston shore. But when Tempe stumbles upon a fresh skeleton among the ancient bones, her old friend Emma Rousseau, the local coroner, persuades her to stay on and help with the investigation. When Emma reveals a disturbing secret, it becomes more important than ever for Tempe to help her friend close the case.   The body count begins to climb. An unidentified man is found hanging from a tree deep in the woods. Another corpse shows up in a barrel. There are mysterious nicks on bones in several bodies, and signs of strangulation. Tempe follows the trail to a free street clinic with a belligerent staff, a suspicious doctor, and a donor who is a charismatic televangelist. Clues abound in the most unlikely places as Tempe uses her unique knowledge and skills to build her case, even as the local sheriff remains dubious and her own life is threatened.   Tempe's love life is also complicated. Ryan, her current flame, has come down to visit her from Montreal, and Pete, her former husband, is investigating the disappearance of a local woman -- and he and Tempe are staying in the same borrowed beach house. Ryan and Pete compete for her attentions, and Tempe finds herself more distracted by her feelings for both men than she expected.   Break No Bones is a smart, taut thriller featuring the kind of high-stakes crime that makes the headlines every week. Reichs, the inspiration for the hit FOX TV show Bones, is writing at the top of her form, and Tempe has never been more compelling.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Total Health for Women: Prevent & Cure the 100 Health Problems That Worry Women Most",
        "Authors": "By Michaud, Ellen and Torg, Elisabeth",
        "Description": "A health guidebook offers sound tips and advice from more than two hundred doctors, as well as the stories of real women and how they overcame their own personal battles with allergies, cancer, alcoholism, and other ailments. Reprint.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Atlas of Medieval Man",
        "Authors": "By COLIN PLATT",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Civil War Songbook (Dover Song Collections)",
        "Authors": "By Crawford, Richard (EDT)",
        "Description": "Thirty-seven songs: The Battle Cry of Freedom, When Johnny Comes Marching Home, Battle Hymn of the Republic, 34 more.",
        "Category": " Music , Printed Music , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "How To Draw More Manga",
        "Authors": "By Coope, Katy",
        "Description": "Teen author and illustrator Katy Coope turned her love of Japanese comic art into a super-cool, step-by-step process for kids. Easy-to-follow with an oversized format and accessible text and pictures, this how-to-draw book will find an audience with fans of anime, manga, and all budding comic-book artists. Includes chapters on how to draw Faces, Expressions, and Bodies for people as well as animals-with special tips on adding and using color.",
        "Category": " Juvenile Nonfiction , Art , Drawing",
        "Publisher": "Tangerine Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Inheritors of Earth",
        "Authors": "By Gordon Eklund, Poul Anderson",
        "Description": "",
        "Category": "",
        "Publisher": "Chilton Book Co",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Battlefield: Decisive Conflicts in History",
        "Authors": "By Marix Evans, Martin (EDT)",
        "Description": "Salamis, Agincourt, Lepanto, Trafalgar, Gettysburg, Iswandlana, the Somme, Stalingrad--Battlefield: Decisive Conflicts in History tells the stories of the most dramatic, memorable, and important conflicts in world history. It begins with the battle of Megiddo in ancient Egypt in 1476 BC and takes the reader through to the Second Gulf War, covering almost 300 battles from around the world-- including the Middle East, Asia, Africa, as well as from Europe and the Americas.   This important book is edited by Richard Holmes, who has written over 20 books, including The Oxford Companion to Military History.  The battles are grouped within chapters that tell the wider story of a particular era or region, for instance the ancient world, nineteenth-century Europe, World War I, or the Americas. Each chapter includes an introduction by Richard Holmes that sets out the historical, tactical, and technological context, and looks at current debates. In addition, individual battles are placed clearly within the wars and campaigns of which they formed a part, making it possible for the reader to follow the details of the battle, and at the same time to understand its military and historical implications.  Detailed maps portray the course of famous battles and campaigns, and a range of illustrations--many from contemporary sources--bring the narrative to life. An extensive index gives the reader quick access to historical figures, locations, battle formations, and much more. Battlefield summarizes the best of contemporary scholarship on battles and war in an accessible, engaging narrative, and it will be of interest to anyone interested in military history.",
        "Category": " History , Military , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Tough Decisions: A Casebook in Medical Ethics",
        "Authors": "By Freeman, John M., M.D. and McDonnell, Kevin",
        "Description": "Tough Decisions presents many of the complex medical-ethical issues likely to confront practitioners in critical situations.  Through fictional but true-to-life cases, vividly described in clinical terms, the authors force the reader to choose among different courses of action and to confront a range of possible consequences.  A two-year-old has been diagnosed with a malignant brain tumor.  Who should be allowed to make decisions about the child's surgery and subsequent therapy, and on what basis? A family history of Huntington's disease emerges when a fiancee seeks genetic counseling. Who should be informed? An elderly patient suffers a cardiac arrest.  Should \"do-not-resuscitate\" orders always be followed?  How should legal liability affect medical decisions?      Other ethical issues considered include surgical complications, patient autonomy, rights of the retarded, informed consent, euthanasia, and the fair allocation of finite resources.  Each case presented conveys the drama and pressure of weighing alternatives, and the realistic consequences of the choices made.  The authors show that ethical decision-making is not limited to \"matters of life and death\", and that it is not the decision but the ethical process by which it is made that gives the decision moral integrity.      With realistic detail, Tough Decisions brings to life and makes the student share in the many complexities of ethical decision-making when the health and lives of patients are at stake.",
        "Category": " Health & Fitness , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Franklin D. Roosevelt: A Rendezvous With Destiny",
        "Authors": "By Freidel, Frank",
        "Description": "Freidel (history emeritus, Harvard U., U. of Washington), whose  four- volume biography of the young FDR concluded with the  launching of the New Deal, now offers a one-volume complete  biography. Although he details Roosevelt's life before his  presidency, the focus is on the Depression and wartime periods.  This will probably become the standard one-volume biography. Annotation(c) 2003 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Little Brown",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Letitia Baldrige's Complete Guide to the New Manners for the '90s",
        "Authors": "By Baldrige, Letitia",
        "Description": "These are changing times, and here is the new encyclopedia of manners to guide us confidently and correctly through the maze of lifestyles, customs, and ways of relating to others that hallmark this decade. Much of the information in this book is new, because many of the situations it discusses have not existed as social norms before.  Letitia Baldrige is uniquely qualified to offer this timely advice. Universally recognized as the country's leading authority on manners and social relationships, she has been hailed on the cover of Time magazine as \"America's leading arbiter of manners\" and is regularly celebrated for the same expertise in the media.  Ms. Baldrige's book provides authoritative answers to questions about manners no one has had to ask before. Among them, the protocol involved in all the new family relationships -- stepfamilies, adult children returning home, and elderly parents moving in; child visitation problems and other complications of divorce; the new codes concerning sex and dating and women taking the initiative romantically; and men and women traveling together on business. She provides unique counsel on rearing children to say \"no\" to drugs, alcohol, and other destructive temptations and to have the exemplary manners that lead to success.  The book is also a complete updated guide to everything you need to know to handle the traditional rites and passages of life in line with current thinking (much of which is different from that of the past). This includes detailed information on weddings, funerals, and religious ceremonies; entertaining any number of people -- from one to one thousand; today's table manners, table setting, and table service; etiquette at work; proper forms of address for these times; and everything you need to know to converse easily in person or on the telephone, to write appropriate letters and notes for every occasion, and much more.  These are real manners for real people in today's complex world. Letitia Baldrige calls them \"manners from the heart,\" and if you have such manners, the world will be with you.",
        "Category": " Social Science , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The Medical & Health Sciences Word Book",
        "Authors": "By Houghton Mifflin Company (COR) and Roe-Hafer, Ann",
        "Description": "",
        "Category": " Reference , Word Lists",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "The Literary Companion to Sex",
        "Authors": "By Pitt-Kethley, Fiona (EDT)",
        "Description": "A tantalizing read, The Literary Companion to Sex leads you on a tour through the sexual pages of some of the most distinguished books ever written. The author has selected excerpts from a diverse group of books--from the Bible, Rabelais, and Defoe--reflecting the sexual atmospheres of their eras.From the Trade Paperback edition.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Dreams of the Raven (Star Trek)",
        "Authors": "By Carter, Carmen",
        "Description": "Captain Kirk and the crew of the Enterprise struggle against an unknown deadly enemy after a mysterious attack cripples the starship and leaves Dr. McCoy without a memory",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "The Day Lincoln Was Shot",
        "Authors": "By Bishop, James Alonzo",
        "Description": "Gripping, minute-by-minute account of the day President Lincoln was struck down by an assassin's bullet in Ford's Theatre.  Parallels of the activities of the President with those of his assassin in an unforgettable, suspense- filled chronicle.  320 pages.",
        "Category": " History , United States , General",
        "Publisher": "Greenwich House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "2012: The War for Souls",
        "Authors": "By Strieber, Whitley",
        "Description": "December 21, 2012, may be one of the most watched dates in history. Every 26,000 years, Earth lines up with the exact center of our galaxy. At 11:11 on December 21, 2012, this event happens again, and the ancient Maya calculated that it would mark the end, not only of this age, but of human consciousness as we know it. But what will actually happen? The end of the world? A new age for mankind? Nothing? The last time this happened, Cro-Magnon man suddenly began creating great art in the caves of southern France, which to this day remains one of the most inexplicable changes in human history.  Now Whitley Strieber explores 2012 in a towering work of fiction that will astound readers with its truly new insights and a riveting roller-coaster ride of a story. A mysterious alien presence unexpectedly bursts out of sacred sites all over the world and begins to rip human souls from their bodies, plunging the world into chaos it has never before known.  Courage meets cowardice, loyalty meets betrayal as an entire world struggles to survive this incredible end-all war. Heroes emerge, villains reveal themselves, and in the end something completely new and unexpected happens that at once lifts the fictional characters into a new life, and sounds a haunting real-world warning for the future.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "A Death in Belmont",
        "Authors": "By Junger, Sebastian",
        "Description": "In 1963, with the city of Boston already terrified by a series of savage crimes known as the Boston Stranglings, a murder occurred in the quiet suburb of Belmont, just a few blocks from the house of Sebastian Junger's family - a murder that seemed to fit exactly the pattern of the Strangler. Roy Smith, a black man who had cleaned the victim's house that day, was arrested, tried, and convicted, but the terror of the Strangler continued.Two years later, Albert DeSalvo, a handyman who had been working at the Jungers' home on the day of the Belmont murder, and who had often spent time there alone with Sebastian and his mother, confessed in lurid detail to being the Boston Strangler.This is the point of entry to Junger's book: a narrowly averted tragedy for Junger's family opens out into an electrifying exploration of race and justice in America. By turns exciting and subtle, the narrative chronicles three lives that collide - and are ultimately destroyed - in the vortex of one of the first and most controversial serial murder cases in America.",
        "Category": " True Crime , Murder , Serial Killers",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Fortune's Favorites",
        "Authors": "By McCullough, Colleen",
        "Description": "The third volume of a saga set in ancient Rome focuses on the political fortunes of Julius Caesar, a soldier destined for greatness; Sulla the dictator; and the ambitious Pompey, as well as Spartacus's slave revolt. 200,000 first printing. $200,000 ad/promo.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "John Paul II",
        "Authors": "By Edwards, Patrick",
        "Description": "A thoughtful and authoritative biography about Pope John Paul II follows his life from his youth in Poland to his rise as Pope, considers his role as the first non-Italian Pope in more than 450 years, and includes eighty carefully chosen photographs.",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Star Trek IV: The Voyage Home",
        "Authors": "By Vonda N. McIntyre",
        "Description": "",
        "Category": "",
        "Publisher": "Star Trek",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "How To Strengthen Your Memory",
        "Authors": "By Fidlow, Michael",
        "Description": "Explains how the human memory works, and gives advice on improving one's memory for speeches, numbers, names, spellings, vocabulary, and information from one's reading",
        "Category": " Psychology , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Our Iceberg Is Melting",
        "Authors": "By Kotter, John, Rathgeber, Holger, and Mueller, Peter (ILT)",
        "Description": "Most of the denizens of the Antarctic penguin colony sneer at Fred, the quiet but observant scout who detects worrying signs that their home, an iceberg, is melting.  Fred must cleverly convince and enlist key players, such as Louis, the head penguin; Alice, the number two bird; the intractable NoNo the weather expert; and a passle of school-age penguins if he is to save the colony.Their delightfully told journey illuminates in an unforgettable way how to manage the necessary change that surrounds us all. Simple explanatory material following the fable enhances the lasting value of these lessons.Our Iceberg Is Melting is at once charming, accessible and profound; a treat for virtually any reader.",
        "Category": " Business & Economics , Management",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Ideas That Conquered The World",
        "Authors": "By Mandelbaum, Michael",
        "Description": "At the dawn of the twenty-first century, three ideas dominate the world: peace as the preferred basis for relations between and among different countries, democracy as the optimal way to organize political life, and free markets as the indispensable vehicle for the creation of wealth. While not practiced everywhere, these ideas have--for the first time in history--no serious rivals. And although the terrorist attacks of September 11, 2001, were terrible and traumatic, they did not \"change everything,\" as so many commentators have asserted. Instead, these events served to illuminate even more brightly the world that emerged from the end of the Cold War.  In The Ideas That Conquered the World, Michael Mandelbaum describes the uneven spread (over the past two centuries) of peace, democracy, and free markets from the wealthy and powerful countries of the world's core, where they originated, to the weaker and poorer countries of its periphery. And he assesses the prospects for these ideas in the years to come, giving particular attention to the United States, which bears the greatest responsibility for protecting and promoting them, and to Russia, China, and the Middle East, in which they are not well established and where their fate will affect the rest of the world.  Drawing on history, politics, and economics, this incisive book provides a clear and original guide to the main trends of the twenty-first century, from globalization to terrorism, through the perspective of one of our era's most provocative thinkers.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Cellular and Molecular Immunology, 2nd Edition",
        "Authors": "By Abbas, Abul K., Lichtman, Andrew H., and Pober, Jordan S.",
        "Description": "",
        "Category": "",
        "Publisher": "W. B. Saunders",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Jephte's Daughter",
        "Authors": "By Ragen, Naomi",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Complete Calligrapher: A Comprehensive Guide from Basic Techniques to Inspirati",
        "Authors": "By Emma Callery",
        "Description": "",
        "Category": "",
        "Publisher": "Quantum Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Two Men from Eden",
        "Authors": "By Morris Cerullo",
        "Description": "",
        "Category": "",
        "Publisher": "Morris Cerullo World Evangelism Headquarters",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Friendship 911 Helping Friends Who Struggle With Life's Toughest Issues",
        "Authors": "By McDowell, Josh, Hostetler, Bob, and Bellis, Dave",
        "Description": "This is an eight-session youth group meeting experience designed to equip young people to respond to the toughest crises their peers may face. Addressing each issue covered in the Friendship 911 Collection, students learn how to help their friends with \"Tender Loving Care\" and in the process become a powerful witness of God's love and care. Students also complete daily activities between group sessions, 35 activities in all. An optional video supplement augments each youth group session with powerful visuals and dramatic illustrations of youth struggling with each of the eight crises. Shaded sections in the Friendship 911 Leader's Guide indicate when and how to use this optional video supplement.",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "New Complete Do-It-Yourself Manual",
        "Authors": "By Reader's Digest Association (COR)",
        "Description": "A quick reference guide to do-it-yourself home improvement projects teaches readers how to cope with emergencies and includes information on financing home improvements, working with contractors, obtaining permits, and more",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Who Killed Palomino Molero? (English and Spanish Edition)",
        "Authors": "By Vargas Llosa, Mario",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Collier Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Timescale",
        "Authors": "By Calder, Nigel",
        "Description": "Explains our concept of time and methods of dating events, uses maps and timelines to show what has happened from the creation of the universe to the launch of the space shuttle, and provides an index to key events",
        "Category": " Science , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "How Proust Can Change Your Life",
        "Authors": "By Botton, Alain De",
        "Description": "Alain de Botton combines two unlikely genres--literary biography and self-help manual--in the hilarious and unexpectedly practical How Proust Can Change Your Life.Who would have thought that Marcel Proust, one of the most important writers of our century, could provide us with such a rich source of insight into how best to live life? Proust understood that the essence and value of life was the sum of its everyday parts. As relevant today as they were at the turn of the century, Proust's life and work are transformed here into a no-nonsense guide to, among other things, enjoying your vacation, reviving a relationship, achieving original and unclichéd articulation, being a good host, recognizing love, and understanding why you should never sleep with someone on a first date. It took de Botton to find the inspirational in Proust's essays, letters and fiction and, perhaps even more surprising, to draw out a vivid and clarifying portrait of the master from between the lines of his work.Here is Proust as we have never seen or read him before: witty, intelligent, pragmatic. He might well change your life.",
        "Category": " Philosophy , Essays",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Presidential Game: The Origins of American Presidential Politics",
        "Authors": "By McCormick, Richard Patrick",
        "Description": "",
        "Category": " Political Science , American Government , Executive Branch",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "Peter Cottontail Is on His Way (Little Golden Book)",
        "Authors": "By Karl, Linda (ILT), Nowell, Christopher (ILT), and Posner, Andrea",
        "Description": "Tells the story of Peter Cottontail's quest to become the Chief Easter Bunny and the antics of his opponent and evil rival, Irontail, to win the job.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "How to Survive Your Freshman Year: By Hundreds of College Sophomores, Juniors, and Seniors Who Did (Hundreds of Heads Survival Guides)",
        "Authors": "By Kaufmann, Yadin (EDT) and Bernstein, Mark W. (EDT)",
        "Description": "Containing more than 1,000 pieces of advice gleaned from interviews with students at more than 100 colleges, this handy guide helps see to it that one of life's more challenging rites of passage is a positive one. The revised and expanded second edition covers age-old dilemmas, including what to take, where to live, how to get a good roommate, how to choose classes, when and where to study, how to fill leisure time, the dating and party scene, choosing a major, vacation and road trips, and much more. This revised edition includes useful checklists, facts, and resources to help students from orientation to summer vacation.",
        "Category": " Education , Student Life & Student Affairs",
        "Publisher": "Hundreds of Heads Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Leisure Arts Presents the Spirit of Christmas",
        "Authors": "By Leisure Arts",
        "Description": "",
        "Category": "",
        "Publisher": "Leisure Arts, Incorporated",
        "Price Starting With ($)": "5.83",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "This Day in Sports",
        "Authors": "By Smith, Ron",
        "Description": "",
        "Category": "",
        "Publisher": "CARLTON",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Fixing Elections: The Failure of America's Winner Take All Politics",
        "Authors": "By Hill, Steven",
        "Description": "Fixing Elections shows our whole 18th-century Winner Take All political system, including the way we elect our legislatures. Steven Hill argues our geographic-based, Winner Take All political system is at the root of many of our worst political problems, including poor minority and majority representation, low voter turnout, expensive mudslinging campaigns, congressional gridlock, regional balkanization, and the growing divide between city-dwellers and middle-America.",
        "Category": " Political Science , Political Ideologies , Democracy",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Life in Sports: A Pictorial History of Sports from the Incomparable Archives of America's Greatest Picture Magazine",
        "Authors": "By",
        "Description": "A collection of over 350 photographs from Life magazine, recording the greatest moments in sports over the last forty years including scenes from the Olympics, boxing confrontations, and the worlds of baseball and football",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Opera in Italy Today: A Guide",
        "Authors": "By Rossi, Nick",
        "Description": "Opera in Italy Today offers a panorama of Italy's dynamic operatic scene. Descriptive text and evocative illustrations recreate not only Italy's historic major houses - including La Scala, the San Carlo, and La Fenice - but also her most important regional theaters. Ten of Italy's most famous opera festivals, including the Puccini, the Bellini, the Donizetti, and the Rossini, are discussed in detail as well, and more than twenty others are listed with address, season, and ticket information. A brief history of each opera house and venue, along with cartelloni of recent seasons, lets the opera lover know who has conducted and performed there in the past. For the armchair fan, discographies and bibliographies are provided. The book also includes a chapter on the La Scala Theatrical Museum, a chapter on children's opera, and a concluding chapter, \"Opportunities for Young Singers,\" rich in information on Italian workshops, programs, and contests for aspiring young vocalists. Finally, lucky visitors to Italy will find the glossary of Italian words and phrases most useful during their travels.",
        "Category": " Music , Genres & Styles , Opera",
        "Publisher": "Amadeus Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Stations of the Cross With Pope John Paul II",
        "Authors": "By Champlin, Joseph M.",
        "Description": "",
        "Category": " Religion , Reference",
        "Publisher": "Liguori",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Shoes: A Celebration of Pumps, Sandals, Slippers & More",
        "Authors": "By O'Keeffe, Linda",
        "Description": "The Marabou Mule. The Chanel toe. Jackie O's pump. Marilyn's stiletto. And lotus shoes and fetish shoes, shoes made for coronations and inaugurations, Cinderella's slipper, shoes of tulle, brocade, rhinestone, python, fish scales, and feathers, and much, much, more, including the two-foot-high wooden chopines of the 16th century and their resurgence as the platform shoes of the 1960s and 1970s.Shoes, now with over 357,000 copies in print, is an obsessive, over-the-top extravaganza-chunky, full-color, and irresistible, it contains page after page of seductive photographs and information about women's shoes.Created for the woman who's a passionate shoe lover-and what woman isn't?--Shoes features over 1,000 glorious photographs, most of them taken for the book. Includes Footnotes (fascinating facts about shoes); Foot Soldiers (profiles of master shoemakers from David Little to Andrea Pfister); and The Shoe that Left an Imprint, focusing on one shoe that changed history-remember Courrage's futuristic go-go boot? Shoes is, as they say, to die for.",
        "Category": " Design , Fashion & Accessories",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Shame of the Nation: The Restoration of Apartheid Schooling in America",
        "Authors": "By Kozol, Jonathan",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Storytelling: Imagination and Faith",
        "Authors": "By Bausch, William J.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Twenty Third Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Acquired tastes : a beginner's guide to serious pleasures",
        "Authors": "By Mayle, Peter",
        "Description": "The author of A Year in Provence  samples the best that life can offer, from handmade shoes and limousine etiquette, to the art of keeping a mistress in style and the world's best caviar, in a whimsical look at the lifestyles of the rich.",
        "Category": " Travel , Europe , France",
        "Publisher": "Bantam Dell Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "A Nation Challenged: A Visual History of 9/11 and Its Aftermath",
        "Authors": "By Lee, Nancy (EDT), Levitas, Mitchel (EDT), Schlein, Lonnie (EDT), and Barry, Dan (EDT)",
        "Description": "A powerful and eye-filling photographic chronicle of the award-winningNew York Times's coverage of 9/11 and its aftermath worldwide, including the war in AfghanistanIn an unprecedented effort, The New York Times opens its picture archive of September 11th and the aftermath at home and abroad. The result is groundbreaking photojournalism punctuated with authoratative prose. Culled from both published and previously unpublished material, A Nation Challenged highlights the best work of the paper's award-winning staffers-the work that has made the Times the paper of record for these events.With a foreword, afterword, and original background essays by writers such as Pulitzer Prize winner John Burns, N. R. Kleinfeld, Dan Barry, and Celestine Bohlen, readers will follow the stunning events of September 11th on the national and international stage. Special charts and graphics supply another level of clarity and understanding, while the brilliant photographs provide counterpoint and perspective to carefully chosen text.With 250 full-color photographs, A Nation Challenged is the definitive volume for all who desire a comprehensive visual chronicle of this pivotal time in America's history.",
        "Category": " Photography , Photojournalism",
        "Publisher": "The New York Times/Callaway",
        "Price Starting With ($)": "8.14",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Organizing from the Inside Out, Second Edition: The Foolproof System For Organizing Your Home, Your Office and Your Life",
        "Authors": "By Morgenstern, Julie",
        "Description": "The New York Times bestselling guide to putting things in order. Put America's #1 organizer to work for you. Getting organized is a skill that anyone can learn, and there's no better teacher than America's organizing queen, Julie Morgenstern, as hundreds of thousands of readers have learned. Drawing on her years of experience as a professional organizer, Morgenstern outlines a simple organizing plan that starts with understanding your individual goals, natural habits, and psychological needs, so that you can work with your priorities and personality rather than against them. The basic steps-Analyze, Strategize, Attack-can be applied to any space or situation. In this thoroughly revised edition, Morgenstern has incorporated new information in response to feedback from her clients and audiences. These changes include - new chapters on organizing photographs, handbags, briefcases, and travel bags - an expanded program for organizing your kitchen - a new guide to getting started- a guide to taming time and technology - a fully updated resource guideSo whether it's a refrigerator cluttered with leftover mystery meals, a generation's worth of family photographs, or the challenge of living or working with a disorganized person, Julie Morgenstern will show you how to handle it all.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Heartland Cooking: Soups & Salads",
        "Authors": "By Giedt, Frances Towner",
        "Description": "Soups & Salads, the third volume in the Heartland Cooking series, is a collection of favorite recipes showcasing the seasonal variety and delicious foods that make Heartland cooking so popular. Here are more than 80 irresistible recipes for both soups and salads - dishes full of flavor yet easy to prepare.With soup and salad recipes for lunch, and dinner, and some even for dessert, this cookbook offers dishes that fit a busy lifestyle, celebrate a holiday, and satisfy the whole family.This cookbook also offers recipes for salads, the natural companions for soups. You'll find a selection of side-dish and main-dish salads that are sure to please, whether you like poultry, seafood, meat or vegetable salads.",
        "Category": " Cooking , Courses & Dishes , Salads",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Bible Health Secrets: Practical answers to help you",
        "Authors": "By Cherry, Reginald, M.D.",
        "Description": "Timeless, Proven, Successful Health Secrets...From God, The Great PhysicianUncover the God-given health secrets to cure diseases that are available to you through nature. Whether you have questions about vitamins or you are battling heart disease, diabetes, fad diets, vision problems, prostate problems or menopause, Dr. Cherry removes some of the guesswork as he answers frequently asked questions that point you toward better health.\"Don't ask God to heal you just to get rid of the painful symptoms.\"God has made it so simple for you to be whole and healthy! He went so far as to send you love letters with explicit directions for living a long and productive life. Are you reading them and making the right choices every day.God wants you to be healthy! Learn how to use the ultimate health secret wisely and effectively, and don't be surprised when you experience strength, vigor and power. You can protect yourself from the most common ailments in the world with only a few lifestyle changes. When you accept your responsibility in the natural realm and leave the rest to god, your life will be radically changed!",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Siloam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Male Body: An Owner's Manual: The Ultimate Head-to-Toe Guide to Staying Healthy and Fit for Life",
        "Authors": "By Men's Health Books (COR), Men's Health Books (EDT), Garfinkel, Perry, and Caine, K. Winston",
        "Description": "Never miss a day again!Physically strong. Mentally tough. Sexually powerful. Disease resistant. Energized. Reliable. This is how a man defines good health. And the knowledge to achieve it all is in your hands right now.The Male Body: An Owner's Manual is the first book ever to offer all the tools and methods a man needs to live longer, stronger, healthier and wiser. The writers and editors of Men's Health Books consulted with more than 350 top experts to put together the most comprehensive guide possible for taking control of a man's health and well-being. Inside you'll find:* A complete weight-training guide for fitness and health* Proven methods for beating stress, fatigue and mental burnout* Exercises, foods and lifestyle techniques for keeping every single body part healthy and injury-free* Frank advice on improving your sexual performance* The medical tests every man must have done, and when* Simple ways to drastically reduce your chances of cancer or heart disease* Surprising tricks to improve your hearing, sight, smell, sleep, even your fingertip sensitivity* The right way to shake a hand, trim a beard, clip a nail, even pick clothes for your particular body typeWritten in the style and tone of America's most popular men's magazine, and illustrated with more than 200 photos and drawings, The Male Body: An Owner's Manual is an essential resource for any man who values his health and life.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Collectible Automobile",
        "Authors": "By Poole, Chris (EDT)",
        "Description": "Discusses the styling and engineering details of antique Chevrolet, Mercury, Chrysler, Avanti, BMW, and Buick cars and offers advice on collecting cars",
        "Category": " Science , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Sugar Busters! Quick & Easy Cookbook",
        "Authors": "By Steward, H. Leighton, Bethea, Morrison, Andrews, Sam, and Balart, Luis",
        "Description": "Which other diet allows you to drink a glass of red wine in the evening? The SUGAR BUSTERS! lifestyle is revolutionizing the way America eats, offering a safe, scientifically sound program for improving health and losing weight.Now the #1 New York Times bestselling team who forever changed the face of dieting has created the SUGAR BUSTERS! Quick & Easy Cookbook, a delicious new collection of more than 150 simple-to-make recipes and menu ideas. With this wonderful cookbook, the SUGAR BUSTERS! eating program can easily become part of your daily routine. Forget counting calories, weighing your food, and trying to figure out those confusing charts and graphs. The SUGAR BUSTERS! Quick & Easy Cookbook makes preparing tasty, low-sugar or sugar-free fare a snap.Inside you'll discover• Appetizers and Hors d’oeuvres• Soups and Salads• Main courses• Vegetables• Sauces and Dressings• Desserts• Comprehensive pantry sectionWhether you're hosting an elaborate holiday bash or a spur-of-the-moment intimate evening for two, or you just need a quick dinner for you and your family, the SUGAR BUSTERS! Quick & Easy Cookbook will help you create the perfect meal.",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Monetary Theory",
        "Authors": "By R. W. Clower, Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Book of Gifts From the Pantry",
        "Authors": "By Grimsdale, Annette",
        "Description": "Shares recipes for dressings, sauces, relishes, mustards, pickles, jellies, nut mixes, pates, conserves, marmalades, toffees, fudge, muffins, cookies, and cakes suitable for gifts",
        "Category": " Cooking , Reference",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Stained Glass Craft",
        "Authors": "By Divine, J. A.",
        "Description": "",
        "Category": "",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "A Ready Defense The Best Of Josh Mcdowell",
        "Authors": "By McDowell, Josh and Wilson, Bill",
        "Description": "Be prepared \"in season and out\" with this handy reference book of faith.  Timely and biblically based, Josh McDowell's work offers defenses in 60 of the most-challenged areas of faith.  All in one easy-to-reference volume, this book will strengthen your commitment and help you stand firm against challenges to the truth.",
        "Category": " Religion , Christian Theology , Apologetics",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "How to Read Literature Like a Professor: A Lively and Entertaining Guide to Reading Between the Lines",
        "Authors": "By Foster, Thomas C.",
        "Description": "What does it mean when a fictional hero takes a journey?. Shares a meal? Gets drenched in a sudden rain shower? Often, there is much more going on in a novel or poem than is readily visible on the surface—a symbol, maybe, that remains elusive, or an unexpected twist on a character—and there's that sneaking suspicion that the deeper meaning of a literary text keeps escaping you.In this practical and amusing guide to literature, Thomas C. Foster shows how easy and gratifying it is to unlock those hidden truths, and to discover a world where a road leads to a quest; a shared meal may signify a communion; and rain, whether cleansing or destructive, is never just rain. Ranging from major themes to literary models, narrative devices, and form, How to Read Literature Like a Professor is the perfect companion for making your reading experience more enriching, satisfying, and fun.",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Power Of A Positive Woman",
        "Authors": "By Ladd, Karol",
        "Description": "",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Howard Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Birdwatcher’s Book of Lists: Lists for Recreation and Recordkeeping (Eastern Region)",
        "Authors": "By Short, Lester",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "The Ultimate Southern Living Christmas Book: Over 400 Ways to Celebrate the Season - Southern Living Style",
        "Authors": "By Brennan, Rebecca (EDT) and Lowery, Allison Long (EDT)",
        "Description": "Presents a multitude of ideas for decorating, cooking, and gift-giving and wrapping for the Christmas season according to southern traditions.",
        "Category": " House & Home , Decorating",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Making an Exit: A Mother-Daughter Drama with Alzheimer's, Machine Tools, and Laughter",
        "Authors": "By Fuchs, Elinor",
        "Description": "Crackling with energy, the unexpected love story of a career-driven mother, a once-resentful daughter, and a ten-year battle with Alzheimer'sAt a time when such things were rare, Elinor Fuchs's mother, Lil, escaped a miserable marriage, took back her maiden name, left young Elinor to be raised by grandparents, and launched a career that led her from the midwest to Washington, D.C.  Rejoining her as an adolescent, Elinor watched as Lil traveled the world selling automotive parts and military gear, gave fabulous parties, and \"in any given room, took up all the air there was.\" With her stunning looks and drive for success, Lil was a figure to admire, not a mother to love.  Elinor determined to despise her mother's values and, once in college, to keep her distance. Making an Exit is the moving account of what happened afterward, during the final years of Lil's life. Following her mother's diagnosis with Alzheimer's, Fuchs finds herself the caretaker.  As the disease progresses, she becomes her mother's mother, dressing her, bathing her, feeding her-all with growing compassion. Lil changes, too: filled with new warmth, the word \"love\" now regularly crosses her lips. And through the fantastic poetry in the disintegration of Lil's language, mother and daughter make a surprising new start.With wit, wisdom, and theatrical flair, Making an Exit tells an uncommon story of a parent's decline-less a conventional narrative of aging and loss than one of discovery, devotion, and spiritual growth. \"The last ten years,\" writes Fuchs, \"they were our best.\"                         Elinor Fuchs, a professor at the Yale School of Drama, is the author of an award-winning play and major works of criticism, including The Death of Character. A nationally recognized theater critic, Fuchs wrote for The Village Voice for more than ten years, and has also contributed to The New York Times, Vogue, and American Theatre. Fuchs lives in Brooklyn.                      From a renowned critic, playwright, and professor of drama comes this energetic and wholly captivating account of living with Alzheimer's—for ten years.At a time when such things were rare, Elinor Fuchs's mother, Lil, escaped a miserable marriage, took back her maiden name, left young Elinor to be raised by grandparents, and launched a career that led her from the Midwest to Washington, D.C. Rejoining her as an adolescent, Elinor watched as Lil traveled the world selling automotive parts and military gear, gave fabulous parties, and \"in any given room, took up all the air there was.\" With her stunning looks and drive for success, Lil was a figure to admire, not a mother to love. Elinor determined to despise her mother's values and, once in college, to keep her distance. Making an Exit is the moving and insightful account of what happened afterward, during the final years of Lil's life. Following her mother's diagnosis with Alzheimer's, Fuchs finds herself the caretaker. As the disease progresses, she becomes her mother's mother, dressing her, bathing her, feeding her—all with growing compassion. Lil changes, too: filled with new warmth, the word \"love\" now regularly crosses her lips. And through the fantastic poetry in the disintegration of Lil's language, mother and daughter make a surprising new start.With wit, wisdom, and theatrical flair, Making an Exit tells an uncommon story of a parent's decline—less a conventional narrative of aging and loss than one of discovery, devotion, and spiritual growth. \"The last ten years,\" writes Fuchs, \"they were our best.\"                                             \"Making an Exit overflows with life—its sorrows and surprises, its follies and joys.\"—Anne Basting, Director of the Center on Age and Community, University of Wisconsin, Milwaukee\"A rare and wonderful rollercoaster of a book, tender and touching, hilarious and high-spirited—a moving portrait of a daughter and mother that is fiercely intelligent, ineffably sad, and, finally, transcendent.\"—Kathleen Woodward, author of Aging and its Discontents                                                                   \"Tremendous . . . A book filled with unexpected glimmers of hope, wisdom, and joy . . . [The author] possesses a delightfully wicked sense of humor and a sharp eye for the quirky detail. Fuchs [employs] a deft and efficient prose style, one akin to Augusten Burroughs, David Sedaris, and Anne Lamott. She's also relentlessly unafraid to mine the laughter out of her and her mother's dire situation . . . Making an Exit is a celebration of the life and death of an unforgettable woman, and it is indeed a festive occasion, one generous enough to hold a touching story of a daughter's love and one wise enough to mix a few jokes within the requisite plan.\"—Greg Changnon, The Atlanta Journal-Constitution\"How these women touched me! Driven and real, Making an Exit hurtles toward its truths with uncommon feeling and honesty.\"—Gish Jen, author of The Love Wife\"Unflinchingly honest, open-hearted, and funny, this is a work of passionate intelligence and deep humanity.\"—Joyce Antler, author of The Journey Home\"It is refreshing to see the final stages of one woman's life and eventual death treated with such humanity, compassion, and dignity . . . Those horrible phrases that many adult children whose parents succumb to Alzheimer's, senility, or disablement eventually have to deal with—'assisted living' and 'nursing home'—are stripped of much of their mystery in Fuchs' book, and are shown for their absurdity, stark reality, banality, and also moments of joy.\"—Michael Standaert, Los Angeles Times\"Fuchs' mother is larger than life in both her salad days and her days of word salad. And Making an Exit overflows with life—its sorrows and surprises, its follies and joys.\"—Anne Basting, Director of the Center on Age and Community, University of Wisconsin, Milwaukee\"A rare and wonderful rollercoaster of a book, tender and touching, hilarious and high-spirited—a moving portrait of a daughter and mother that is fiercely intelligent, ineffably sad, and, finally, transcendent.\"—Kathleen Woodward, author of Aging and its Discontents\"[A] wry account of a once-alienated daughter who becomes ever more entwined with her mother as the older woman makes a memorable decline . . . There's little room for pity or censure as the reader is carried along by a great story. Lillian, an adamantly independent woman all her life, finally needs to be taken care of. She's mostly lost her mind, and although she'll never really know it, she needs her daughter. Fuchs combines her account of the weirdness of caring for a physically competent, mentally absent woman with episodes from their shared past. Her brisk prose effectively captures Lillian's energy, the oddities of communication that Alzheimer's imposes, the endless grind of arranging and placating caregivers, and her own emotional landscape when she finds herself trapped in a state of emergency that lasts a decade. It didn't come cheap, but Fuchs has achieved a beautiful balance of humor and tragedy—all wrung from the same mess of real life.\"—Kirkus Reviews\"A paradoxical line is finely drawn [in this book] between tragedy and comedy; Fuchs depicts her mother's gradual deterioration with humor, sensitivity, and grief that becomes more profound as Lillian weakens. This literate book with its classical underpinnings is an easy, delightful read, and highly recommended for public libraries and consumer collections in hospital and medica",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Metropolitan Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Steps to Christ",
        "Authors": "By White, Ellen Gould Harmon",
        "Description": "",
        "Category": "",
        "Publisher": "Christian Record Services",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The 5 Love Needs of Men and Women",
        "Authors": "By Rosberg, Gary and Rosberg, Barbara",
        "Description": "Husbands and wives cannot meet each other's needs until they know what they are. Surprising research gives great insight as Gary talks to women, and Barbara talks to men, about the top five love needs of men and women. Readers will discover how truly unique men and women are. The Rosbergs' honesty, vulnerability, and practical suggestions inspire couples to new levels of sacrificial, Christlike love.FEATURESSpouses will understand each other better Learn practical ways to meet your spouse's needs Survey results of 700 married couples",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Janice VanCleave's Biology For Every Kid: 101 Easy Experiments That Really Work",
        "Authors": "By VanCleave, Janice Pratt",
        "Description": "What's the effect of osmosis on a raisin?  How is water transported through plant stems?  What's the best way to grow penicillin?  How are butterflies different from moths?  Now you can discover answers to these and other fascinatingquestions about biologythe study of living organisms. In Biologyfor Every Kid, you'll learn how to talk with fireflies, watchbacteria wage war in a glass of milk, discover how to tell thetemperature by counting cricket chirps, and find out how an appleand an onion can taste the same.  Each of the 101 experiments is broken down into its purpose, a listof materials, step-by-step instructions, expected results, and aneasy to understand explanation. Every activity has been pretestedand can be performed safely and inexpensively in the classroom orat home.",
        "Category": " Young Adult Nonfiction , Science & Nature , Biology",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Janice VanCleave's Earth Science for Every Kid: 101 Easy Experiments that Really Work",
        "Authors": "By VanCleave, Janice Pratt",
        "Description": "How are mountains formed?  What makes the air we breathe?  What causes the ocean waves?  Now you can learn the answers to these and other questions aboutthe earth, sea, and air through 101 fun, safe, low-cost experimentsand activities that can be performed at home or in the classroom.In Earth Science for Every Kid, you'll use a tennis ball and amarble to demonstrate a solar eclipse. You'll make a peanut butterand jelly sandwich to understand sedimentary rock formation. And,with the assistance of a Slinky(r) and a helper, you'll learn aboutthe motion of water waves.  Each of the 101 experiments is broken down into its purpose, a listof materials, step-by-step instructions, expected results, and aneasy to understand explanation. Every activity has been pretestedand can be performed safely and inexpensively in the classroom orat home.  Also available in this series from Janice VanCleave: * ASTRONOMY FOR EVERY KID * BIOLOGY FOR EVERY KID * CHEMISTRY FOR EVERY KID * DINOSAURS FOR EVERY KID * GEOGRAPHY FOR EVERY KID * GEOMETRY FOR EVERY KID * THE HUMAN BODY FOR EVERY KID * MATH FOR EVERY KID * PHYSICS FOR EVERY KID",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Kicking Your Stress Habits: A Do-It-Yourself Guide to Coping with Stress",
        "Authors": "By Tubesing, Donald A.",
        "Description": "Identifies the causes and symptoms of stress, and describes ways to get rid of bad habits and improve one's outlook, physical condition, and interpersonal relationships",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Whole Person Associates",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Wild Night",
        "Authors": "By Peters, Natasha",
        "Description": "To prove herself as a foreign correspondent, former beauty queen Emma Louise Vaughan journeys to Cambodia in 1950 and finds herself torn between two very different men in the days just before the fall of the French regime",
        "Category": " Fiction , Romance , Regency",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Why Don't Penguins' Feet Freeze?: And 114 Other Questions",
        "Authors": "By New Scientist",
        "Description": "&#149; What time is it at the North Pole?   &#149; What's the chemical formula for a human being?   &#149; Why do boomerangs come back?   &#149; Why do flying fish fly?   &#149; Do the living really outnumber the dead?   &#149; Why does lightning fork?   &#149; Why does the end of a whip crack?   Everyone has at one time or another thought up odd questions like these, questions that are strange, intriguing, maybe even impossible to answer. Making your morning omelet, perhaps you've wondered why most eggs are egg shaped. Or maybe, the last time you walked on the beach, you felt compelled to ask why the sea is salty. Watching Polly sit on her perch, have you ever marveled at how she stays there -- even when she's asleep? Well, the readers of New Scientist's wildly popular, long-running column \"The Last Word\" thought of these questions, too, and weren't afraid to ask them.   Why Don't Penguins' Feet Freeze? is a brilliant collection of questions and answers for everyone who enjoyed the international, runaway bestseller Does Anything Eat Wasps? Guaranteed to amaze, inform, and delight with topics such as the human body, plants and animals, weird weather, and our wacky world, it'll stump you, enlighten you, entertain and amuse you.",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Talk to the Hand: The Utter Bloody Rudeness of the World Today, or Six Good Reasons to Stay Home and Bolt the Door",
        "Authors": "By Truss, Lynne",
        "Description": "\"Talk to the hand, ’cause the face ain’t listening,\" the saying goes.When did the world stop wanting to hear? When did society become so thoughtless? It’s a topic that has been simmering for years, and Lynne Truss says it’s now reached the boiling point. Taking on the boorish behavior that for some has become a point of pride,Talk to the Hand is a rallying cry for courtesy. Like Eats, Shoots & Leaves,Talk to the Hand is not a stuffy guidebook, and is sure to inspire spirited conversation.Why hasn’t your nephew ever thanked you for your carefully selected gift? What makes your contractor think it’s fine to snub you in the midst of a major renovation? Why do crowds spawn selfishness? What accounts for the appalling treatment you receive in stores (if you’re lucky enough to get a clerk’s attention at all)? Most important, what will it take to roll back a culture that applauds those who are disrespectful? In a recent U.S. survey, 79 percent of adults said that lack of courtesy was a serious problem. For anyone who’s fed up with the brutality inflicted by modern manners (or lack thereof),Talk to the Hand is a colorful call to arms—from the wittiest defender of the civilized world.",
        "Category": " Reference , Etiquette",
        "Publisher": "Gotham Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Basics of Business Writing (Worksmart Series)",
        "Authors": "By Stuckey, Marty",
        "Description": "Discusses common problems in business writing, outlines methods for drafting and revising a document, and includes checklists and vocabulary hints",
        "Category": " Literary Criticism , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The 21 Indispensable Qualities of a Leader: Becoming the Person Others Will Want to Follow",
        "Authors": "By Maxwell, John C.",
        "Description": "In the tradition of his CBA bestseller The 21 Irrefutable laws of Leadership and his sell-out seminars, author John C. Maxwell now provides a concise, accessible leadership book that helps readers become more effective leaders from the inside out. Daily readings highlight twenty-one essential leadership qualities and include \"Reflecting On It\" and \"Bringing It Home\" sections which help readers integrate and apply each day's material.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Salsa Lovers Cookbook: More Than 180 Sensational Salsa Recipes for Appetizers, Salads, Main Dishes and Desserts",
        "Authors": "By Bollin, S. K.",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Spanish",
        "Publisher": "Golden West Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Into the Long Dark Night (The Journals of Corrie Belle Hollister #6)",
        "Authors": "By Phillips, Michael R.",
        "Description": "Reporter Corrie Hollister experiences the battle of Gettysburg on her way to Washington, where she meets President Lincoln and stays at Mrs. Surratt's boardinghouse, while trying to understand her role as a single woman and how it fits into God's plans for her",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Promise Me Tomorrow (Rocky Mountain Memories #4)",
        "Authors": "By Wick, Lori",
        "Description": "Rusty Taggart accepts a job as a companion for the son of a wealthy widower, Chase McCandles, but when she realizes how little time Chase spends with his son, she needs to convince him that his son desperately needs him",
        "Category": " Fiction , Religious",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Complete Book of Garlands, Circles & Decorative Wreaths: Creating Beautiful Seasonal Displays from Flowers and Natural Materials",
        "Authors": "By Moore, Terence and Barnett, Fiona",
        "Description": "How to make beautifully individual floral garlands, circles, wreaths, candle rings and swags.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Lorenz Books",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Case for Easter: Journalist Investigates the Evidence for the Resurrection",
        "Authors": "By Strobel, Lee",
        "Description": "",
        "Category": " Religion , History",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Achieving Excellence in Fund Raising (JOSSEY BASS NONPROFIT & PUBLIC MANAGEMENT SERIES)",
        "Authors": "By Rosso, Henry A.",
        "Description": "A comprehensive guide for those in or entering the profession of fund raising for nonprofit organizations. Defines the profession as a strategic management discipline, and outlines each step in the fund raising cycle from assessing human and societal needs to encouraging renewals. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Business & Economics , Nonprofit Organizations & Charities , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Workforce Crisis: How to Beat the Coming Shortage of Skills And Talent",
        "Authors": "By Dychtwald, Ken, Erickson, Tamara J., and Morison, Robert",
        "Description": "Unprecedented shifts in the age distribution and diversity of the global labor pool are underway. Within the decade, as the massive boomer generation begins to retire and fewer skilled workers are available to replace them, companies in industrialized markets will face a labor shortage and brain drain of dramatic proportions.Ken Dychtwald, Tamara Erickson, and Robert Morison argue that companies ignore these shifts at great peril. Survival will depend on redefining retirement and transforming management and human resource practices to attract, accommodate, and retain workers of all ages and backgrounds. Based on decades of groundbreaking research and study, the authors present innovative and actionable management techniques for leveraging the knowledge of mature workers, reengaging disillusioned midcareer workers, and attracting and retaining talented younger workers.This timely book will help organizations sustain their competitive edge in tomorrow’s inevitably tighter labor markets.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Country Living Handmade Wreaths: Decorating Throughout the Year",
        "Authors": "By Stewart, Arlene Hamilton",
        "Description": "Dress up a door, accent a room, and, of course, turn every season more festive: 30 elegantly photographed projects for seasonal wreaths throughout the year show exactly how wonderful these decorations can be. Brightened with colorful berries or pomegranates, lush with ivy, and fragrant with the scent of evergreen, each one pleases the senses. Easy-to-follow instructions make the entire process effortless.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Hearst",
        "Price Starting With ($)": "5.45",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Didn't My Skin Used to Fit?",
        "Authors": "By Bolton, Martha",
        "Description": "The Christian humorist offers readers over forty a funny, insightful peek at middle age--covering everything from \"Roughage by Candlelight\" to \"When Your Blood's Too Tired to Bleed.\" Original.",
        "Category": " Religion , Inspirational",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Splash! (Green Light Readers Level 2)",
        "Authors": "By Dewey, Ariane and Aruego, Jose",
        "Description": "Tumble headlong into the clumsy world of Sam and Nelly. Trouble may follow these two, but they sure know how to have fun.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Sandpiper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Creme de Colorado Cookbook (Celebrating Twenty Five Years of Culinary Artistry)",
        "Authors": "By Junior League of Denver",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "The Junior League of Denver, Inc.",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "There was Once a Time",
        "Authors": "By Rasmussen, Anne-Marie",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Old Christmas",
        "Authors": "By Irving, Washington",
        "Description": "",
        "Category": "",
        "Publisher": "Judd and Detweiler Inc",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1934"
        }
    },
    {
        "Title": "The World Trade Center Remembered",
        "Authors": "By Goldberger, Paul, Bullaty, Sonja, Lomeo, Angelo (PHT), Bullaty, Sonja (PHT), and Lomeo, Angelo",
        "Description": "Rising dramatically above all other skyscrapers at the tip of Manhattan, the World Trade Center symbolized New York. From any direction the Towers were lodestars, Manhattan's local mountains. Nearly a decade after the dark events of 9/11, New Yorkers continue to come to terms with the tragedy, and to reminisce about the views of the Towers they once had from their homes and offices. Visitors, too, are remembering how the WTC looked as they approached Manhattan by car, plane, or from the water.  As we mourn for the terrible loss of life, we also want to remember.The 72 images of the World Trade Center presented in this book depict a New York we once knew, one we are now working to rebuild. For more than two decades, practically since the Twin Towers were erected, Sonja Bullaty and Angelo Lomeo have been photographing these awesome buildings. The pictures featured here portray the WTC from all directions, starting with views from the east at dawn, and ending with evening views from the west. There are captivating panoramas from Brooklyn, Lower Manhattan, New Jersey, and uptown, taken in all seasons, as well as a section showing the grand Plaza at the center of the buildings. Together, they create an unforgettable portrait of the Twin Towers.Introducing this extraordinary collection of photographs, Paul Goldberger's text evokes the Towers and the city they came to symbolize. He recalls how they evolved in the public mind, targets of criticism to beloved American icons. He explains their architectural significance and explores their visceral meaning to New Yorkers. In contrast to books depicting the disaster and the days following it, this photographic memoir will be welcomed by all of us&#151; New Yorkers and visitors alike &#151; who yearn to remember the way the city was.A portion of the book's proceeds are donated to the Twin Towers Scholarship Program care of Scholarship America.",
        "Category": " Photography , Subjects & Themes , Regional",
        "Publisher": "Abbeville Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Complete Book of Abs",
        "Authors": "By Brungardt, Kurt and Stumpf, Doug (EDT)",
        "Description": "The first guide ever to cover every single possible exercise for shaping and strengthening abdominal muscles--from traditional situps to weights and machines to gymnastics, yoga, and dance--this book also includes specialized programs for back-pain sufferers. 300 photos.",
        "Category": "",
        "Publisher": "Villard",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "1,000 Unforgettable Senior Moments: Of Which We Could Remember Only 246",
        "Authors": "By Friedman, Tom",
        "Description": "No, you’re not losing your mind. And you’re definitely not alone. There’s Jimmy Carter, forgetting the nuclear launch codes in a suit at the dry cleaners. Rod Stewart fumbling for the name of the intense first love who inspired “Maggie Mae.” G. K. Chesterton writing a long letter to hismother announcing the good news about his engagement—while his mother is in the room with him. Marilyn Monroe blowing the same line through 52 takes during the filming of Some Like It Hot.Celebrating history’s greatest mental lapses, is a perfect impulse book in the fine gift format of Famous Last Words. Not just outlandishly funny, it’s also a book of great comfort—after all, having a senior moment puts you in the company of Einstein, Lincoln, Beethoven, Newton, Toscanini, and a whole assortment of presidents, poets, philosophers, popes, and Nobel Prize–winners.  Talk about gaffes. Here are best men forgetting to show up at the wedding. Judges staggered by the incompetence of their previous decisions. Senators frozen in front of TV cameras. Olympic officials gazing absently while bewildered runners continue through the finish line. Bono losing the only copy of his lyrics to a new album. Forget to pick up your copy today!",
        "Category": " Humor , Topic , Adult",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Clowning in Rome: Reflections on Solitude, Celibacy, Prayer, and Contemplation",
        "Authors": "By Nouwen, Henri J. M.",
        "Description": "A classic work by one of this century's most beloved spiritual writers now reissued.The inspirational writings of Henri Nouwen have touched millions of readers all over the world, and since his death in September 1996, widespread recognition of their enduring value has continued to grow. Now, after being unavailable for several years, Nouwen's Clowning in Rome is available again as an Image trade paperback. In this classic account of the time he spent in Rome, Nouwen offers reflections and spiritual insight characteristic of his best works. During the months in Rome, it wasn't the red cardinals or the Red Brigade who had the most impact on Nouwen, but the little things that took place between the great scenes. In some ways, Nouwen discovered, the real and true story was told by the clowns he often saw in the city streets. In his own words, from the Introduction to Clowning in Rome: \"The clowns are not the center of events. They appear between the great acts, fumble and fall and make us smile again after the tensions created by the heroes we came to admire. The clowns don't have it together--they are awkward, out of balance and left-handed, but--they are on our side. The clowns remind us with a tear and a smile that we are sharing the same human weakness. The longer I was in Rome, the more I enjoyed the clowns, those peripheral people who by their humble, saintly lives evoke a smile and awaken hope, even in a city terrorized by kidnapping and street violence.\"",
        "Category": " Religion , General",
        "Publisher": "Galilee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Strong and Simple Messages for Children's Ministry",
        "Authors": "By Reazin, Ruth",
        "Description": "",
        "Category": " Religion , Christian Education , General",
        "Publisher": "Group Pub Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "When Christ Comes",
        "Authors": "By Lucado, Max",
        "Description": "Would you like to discuss the end of time?And feel better because of it?Life with no end? Space with no bounds? And what about Armageddon, The Lake of Fire, The Mark of the Beast?Am I supposed to feel good about all this?If these words could be yours, you aren't alone. There is much about the end of history we don't understand. But while thoughts on the final day will stir our questions, they needn't stir our fears. Regarding that day, Jesus urged, \"Don't let your hearts be troubled. Trust in God, and trust in me\" (John 14:1).Max Lucado believes the day Christ comes will be the \"beginning of the very best.\" Our primary task is to be prepared and peaceful while we wait.If you have some questions about the end of time ...If you have concerns about what will happen to you ...If you like to look to the end of times as a source of comfort and not chaos ...You are holding the right book.",
        "Category": " Religion , Christianity , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    }
]