[
    {
        "Title": "Fish on Friday: Feasting, Fasting, and Discovery of the New World",
        "Authors": "By Fagan, Brian M.",
        "Description": "What gave Christopher Columbus the confidence in 1492 to set out across the Atlantic Ocean? What persuaded the king and queen of Spain to commission the voyage? It would be convenient to believe that Columbus and his men were uniquely courageous. A more reasonable explanation, however, is that Columbus was heir to a body of knowledge about seas and ships acquired at great cost over many centuries. Fish on Friday tells a new story of the discovery of America. In Brian Fagan's view, that discovery is the product of the long sweep of history: the spread of Christianity and the radical cultural changes it brought to Europe, the interaction of economic necessity with a changing climate, and generations of unknown fishermen who explored the North Atlantic in the centuries before Columbus. The Church's tradition of not eating meats on holy days created a vast market for fish that could not be fully satisfied by fish farms, better boats, or new preservation techniques. Then, when climate change in the thirteenth and fourteenth centuries diminished fish stocks off Norway and Iceland, fishermen were forced to range ever farther to the west-eventually discovering incredibly rich shoals within sight of the Nova Scotia coast. In Ireland in 1490, Columbus could well have heard about this unknown land. The rest is history.",
        "Category": " History , Europe , Renaissance",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "OUTPERFORMING WALL STREET",
        "Authors": "By Seiver, Daniel Alan",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Murder on Embassy Row (Capital Crime Mysteries)",
        "Authors": "By Truman, Margaret",
        "Description": "Ambassador Geoffrey James might be a British citizen, but when he dies on the night of a gala party, it's up to Captain Sal Morizio of Washington's Metropolitan Police Department to investitgate. Despite orders to desist, Morizio and his lady love, fellow officer Connie Lake, know too much. And what they learn on an international search for missing clues tells them a lot about corruption in high places--and the effects of caviar on otherwise rational people....",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Steer Clear of Haunted Hill (Ghostwriter)",
        "Authors": "By Velasquez, Eric (ILT) and Weiner, Eric.",
        "Description": "Lenni's father, Max, takes the children to his favorite campground, but the group is shocked to learn that the campground has turned into a ghost town. Original.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Saks and Violins: A Bed-and-Breakfast Mystery (Bed-and-Breakfast Mysteries)",
        "Authors": "By Daheim, Mary",
        "Description": "Indomitable heroine Judith McMonigle Flynn tries to extend a helping hand to a pesky new neighbor - and ends up with a corpse underfoot while she and cousin Renie cope with ... Saks & Violins.Hard times and sour notes have hit the cousins in both the B&B and the graphic design business. To make matters worse, Renie's up to her latest eyebrow wax in debt, due to overzealous spending on clothes on their recent trip to San Francisco. And in the house that Herself - Judith's nemesis and hubby Joe's ex-wife - has rented out, there dwells a symphony violinist whose practice of outdoor practicing au naturel is driving the neighbors out of the cozy cul-de-sac and into soundproof rooms. In fact, they swear they'd like to kill the nude, rude Rudi.No such luck. The only buffer zone from the in-the-buff violinist is the Rankerses' hedge. Instead of Rudi taking a final bow with his damnable bow, it's his larger-than-life mentor, Dolph Kluger, who meets death, not by getting entangled in the lethal laurel, but from ingesting ruthless rhubarb.To add to the musical mess, Rudi's valuable violin bow goes missing, Renie's useless credit cards are stolen, a headless horseman rides through somebody's past, and several suspects seem to be on the brink of bonkersville. Judith has to be extra careful with these lyrical loonies or somebody will be playing her funeral march before the killer bows out.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Will You Sign Here, John Hancock",
        "Authors": "By Jean Fritz",
        "Description": "",
        "Category": "",
        "Publisher": "Coward Mc Cann",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Mysteries of Sherlock Holmes (A Stepping Stone Book)",
        "Authors": "By Doyle, Arthur Conan, Sir, Conaway, Judith (ADP), and Miller, Lyle (ILT)",
        "Description": "What is the secret of a goose that swallowed a priceless blue gem? How is a woman killed when she is alone in a locked room? Why does a mysterious club only include people with red hair? These puzzles are all solved by the greatest detective the world has ever known in Mysteries of Sherlock Holmes. Adapted from three of Sir Arthur Conan Doyle's classic tales of suspense ( The Adventure of the Blue Carbuncle, The Adventure of the Speckled Band, and The Red Headed League) these thrilling mysteries are made accessible to young readers in this fabulous easy to read edition.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "The House of the Seven Gables (Dover Thrift Editions: Classic Novels)",
        "Authors": "By Hawthorne, Nathaniel",
        "Description": "A gloomy New England mansion provides the setting for this classic exploration of ancestral guilt and its expiation through the love and goodwill of succeeding generations.Nathaniel Hawthorne drew inspiration for this story of an immorally obtained property from the role his forebears played in the 17th-century Salem witch trials. Built over an unquiet grave, the House of the Seven Gables carries a dying man's curse that blights the lives of its residents for over two centuries. Now Judge Jaffrey Pyncheon, an iron-hearted hypocrite and intellectual heir to the mansion's unscrupulous founder, is attempting to railroad a pair of his elderly relatives out of the house. Only two young people stand in his way — a visiting country cousin and an enigmatic boarder skilled in mesmerism.Hawthorne envisioned this family drama of evil, revenge, and resolution as a microcosm of Salem's own history as in idealistic society corrupted by greed and pride. His enduring view of the darkness at the heart of the national soul has made The House of the Seven Gables a landmark of American literature.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Foundation and Earth",
        "Authors": "By Asimov, Isaac",
        "Description": "The fifth novel in Asimov's popular Foundation series opens with second thoughts. Councilman Golan Trevize is wondering if he was right to choose a collective mind as the best possible future for humanity over the anarchy of contentious individuals, nations and planets. To test his conclusion, he decides he must know the past and goes in search of legendary Earth, all references to which have been erased from galactic libraries. The societies encountered along the way become arguing points in a book-long colloquy about man's fate, conducted by Trevize and traveling companion Bliss, who is part of the first world/mind, Gaia.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Integral Trees",
        "Authors": "By Niven, Larry",
        "Description": "A culture of evolved humans inhabits a doughnut-shaped gas tube that rotates around a neutron star",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey / Ballantine",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Ringworld Engineers",
        "Authors": "By Niven, Larry",
        "Description": "A return voyage to the astonishing world of Larry Niven’s Ringworld, with even more remarkable adventures and surprises, and a solution to that tantalizing question left from the earlier book: how was Ringworld built and by whom?It’s been twenty years since the quixotic and worldsweary Louis Wu discovered the Ringworld. Now he and Speaker-To-Animals are going back, captives of the Hindmost, a deposed puppeteer leader.With Louis’ help, the Hindmost intends to regain his status by bringing back such extraordinary treasures from the Ringworld that his fellow puppeteers will have to be impressed.But when they arrive, Louis discovers that the Ringworld is no longer stable . . . and will destroy itself within months. To survive he must locate the control center of the legendary engineers who built the planet.His quest becomes a wild and gripping venture, blended with the mysteries and spectacular technologies that only Larry Niven can conjure!Praise for Ringworld Engineers“For new readers, there’s fascinating adventure in plenitude. For old fans of Niven’s Known Space series, or of the original volume, there are all the fine, characteristic touches that delight us Niven fans, and which support his reputation for uncommon wittiness and fast narrative pace.”—Chicago Sun-Times“The Ringworld Engineers has all the imaginativeness, convincing detail, and narrative vivacity that have come to be associated with the works of Larry Niven. Furthermore, it answers a lot of questions that have been tantalizing his readers for a long time. Most highly recommended!”—Paul Anderson“When I finished The Ringworld Engineers, I cleared my calendar for a week, sat down, and reread every word of the Known Space cycle from scratch, then reread The Ringworld Engineers. It was worth the effort, and left me staggered by the breadth and scope of Larry’s vision. . . . If you count yourself as a true friend of Larry Niven, race right out and get this one.”—Analog Science Fiction Magazine“Another fine masterpiece from the master of science fiction . . . The coming conquest of space has always been a central myth of science fiction, and Larry Niven’s future worlds have made the most of it. The Ringworld itself is a dazzling notion, carrying the future evolution of technology about as far as possible.”—Jack Williamson“Adventurous exploration of a mind-boggling landscape.”—Publishers Weekly",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "Beyond Baby Talk: From Sounds to Sentences, A Parent's Complete Guide to Language Development",
        "Authors": "By Apel, Kenn, Masterson, Julie J., Ph.D., and American Speech-Language-Hearing Association (COR)",
        "Description": "From \"Goo\" to Gab — Guiding Your Child to Effective CommunicationThe first five years of a child's life are the most critical for speech and language development, and, as a parent, you are your child's primary language role model. So what are the best ways to help your child develop the all-important skill of communication? Fun, easy, and engaging, this book shows you how! Inside, you'll discover all of the essential steps and checkpoints from birth through age five, tips to help your child progress on schedule, and easy methods to: · Evaluate and monitor your child's language development · Understand and deal with environmental impacts such as television and cultural styles · Recognize the signs of language development problems · And much, much more!",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "For Families Only: Answering the Tough Questions Parents Ask",
        "Authors": "By Petersen, J. Allan",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Gifted Hands: The Ben Carson Story",
        "Authors": "By Murphey, Cecil and Carson, Ben",
        "Description": "In 1987, Dr. Benjamin Carson gained worldwide recognition for his part in the first successful separation of Siamese twins joined at the back of the head. The extremely complex and delicate operation, five months in the planning and twenty-two hours in the execution, involved a surgical plan that Carson helped initiate. Carson pioneered again in a rare procedure known as hemispherectomy, giving children without hope a second chance at life through a daring operation in which he literally removed one half of their brain. But such breakthroughs aren’t unusual for Ben Carson. He’s been beating the odds since he was a child. Raised in inner-city Detroit by a mother with a third grade education, Ben lacked motivation. He had terrible grades. And a pathological temper threatened to put him in jail. But Sonya Carson convinced her son that he could make something of his life, even though everything around him said otherwise. Trust in God, a relentless belief in his own capabilities, and sheer determination catapulted Ben from failing grades to the top of his class — and beyond to a Yale scholarship . . . the University of Michigan Medical School . . . and finally, at age 33, the directorship of pediatric neurosurgery at Johns Hopkins Hospital in Baltimore, Maryland. Today, Dr. Ben Carson holds twenty honorary doctorates and is the possessor of a long string of honors and awards, including the Horatio Alger Award, induction into the \"Great Blacks in Wax\" Museum in Baltimore, Maryland, and an invitation as Keynote Speaker at the 1997 President’s National Prayer Breakfast. Gifted Hands is the riveting story of one man’s secret for success, tested against daunting odds and driven by an incredible mindset that dares to take risks. This inspiring autobiography takes you into the operating room to witness surgeries that made headlines around the world — and into the private mind of a compassionate, God-fearing physician who lives to help others. Through it all shines a humility, quick wit, and down-to-earth style that make this book one you won’t easily forget.",
        "Category": " Biography & Autobiography , Cultural, Ethnic & Regional , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Public Speaker's Handbook of Humor",
        "Authors": "By Eisenberg, L. M.",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "The Feminine Force: Release the Power Within You to Create the Life You Deserve",
        "Authors": "By Mosbacher, Georgette",
        "Description": "She's radiant, she's self-confident, and as far as her own life is concerned, Georgette is definitely the one in charge.In 1990, her phone calls got returned faster than anyone else's on a very select list in Washington, DC.Georgette doesn't even own a blue business suit: she prefers bright colors, feminine shapes, and red fingernails. A CEO who gets a kick out of making coffee for everyone at the conference table; she calls that reverse power.She's a fatherless working-class girl from the Indiana steel belt who worked her way up from ironing at the local country club to become a successful entrepreneur. Women all over the country write to her. And her husband is a very understated Texas oil magnate and ex-Cabinet Secretary who cherishes her and her career.So how did she do it? She credits her Feminine Force. With this collection of practical principles, distilled from her own varied life experience and from the thousands of women - of all ages, backgrounds, and points of view - she's met as the CEO of La Prairie Cosmetics and of her new company, Exclusives by Georgette Mosbacher, she shows not only how she did it, but how you can do it, too.Join Georgette as she tells you what she learned as a child taking care of her three younger siblings while her mother, grandmother, and great-grandmother worked. Hear what she learned about love and self-esteem through two failed marriages (\"Just because you made a mistake doesn't mean you are a mistake\"), and how she persevered to meet and marry a good man.Want to be accepted by the \"old boys\" network - without sacrificing your femininity? Want to be financially independent and loved? Want to reinvent yourself, and learn how to turn the negatives in your life into positives? Just ask Georgette.To guide and inspire you to create the life you deserve, Georgette has created 72 Feminine Force Principles that you can use to empower your own life, including I achieve success by not accepting failure; when I look my personal best, I am powerful; I will not love a man who does not cherish me; entrusting my financial security to anyone else is an unacceptable risk; and regardless of the difficulties of my life, I will never become a victim.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Celebration of Miracles",
        "Authors": "By Berndt, Jodie",
        "Description": "",
        "Category": " Antiques & Collectibles , Books",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Low-Carb Comfort Food Cookbook",
        "Authors": "By Eades, Michael R., Eades, Mary Dan, and Solom, Ursula",
        "Description": "The revolutionary cookbook that satisfies all your comfort food cravings-from the New York Times bestselling authors of Protein PowerWhen you think about low-carb diets, do you picture complicated meal plans and bland foods that leave you with cravings? Do the words comfort food make you long for scrumptious delights like pancakes, ice cream, chocolate chip cookies, or fettucine alfredo-foods you thought you could never have on a low-carb diet?If your answers to the above were yes and yes, you're in for a huge surprise! You can have these foods and many more, thanks to The Low-Carb Comfort Food Cookbook. Drs. Michael and Mary Dan Eades and chef Ursula Solom give you unique, easy cooking tips and more than 300 yummy low-carb recipes for foods that help you keep your weight down and fulfill your cravings. In no time at all, you'll be on an easy-to-follow low-carb plan that will allow you to stay thin and healthy-and feel great!Southern fried chicken with pan gravy * Elegant biscuits Melt-in-your-mouth pancakes * Deluxe low-carb macaroni and cheese * Beef and mushroom crepes * Spicy corn chips Soft crust pizza * Low-carb beef stroganoff * Raisin rolls Breaded sole * Fettucine alfredo * Low-carb lasagna * Super banana bread * Low-carb tacos * Bean and cheese burritos * Best garlic bread * Eggplant parmigiana * Rich low-carb pound cake * Scrumptious low-carb cheesecake * Apple brown betty * Cheddar cheese waffles * Chocolate ice cream * Key lime pie * Sublime truffles",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Confessions of an Organized Homemaker: The Secrets of Uncluttering Your Home and Taking Control of Your Life",
        "Authors": "By Schofield, Deniece",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Betterway Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "College Girls: Bluestockings, Sex Kittens, and Co-eds, Then and Now",
        "Authors": "By Peril, Lynn",
        "Description": "A geek who wears glasses? Or a sex kitten in a teddy? This is the dual vision of the college girl, the unique American archetype born when the age-old conflict over educating women was finally laid to rest. College was a place where women found self-esteem, and yet images in popular culture reflected a lingering distrust of the educated woman. Thus such lofty cultural expressions as Sex Kittens Go to College (1960) and a raft of naughty pictorials in men’s magazines.As in Pink Think, Lynn Peril combines women’s history and popular culture—peppered with delightful examples of femoribilia from the turn of the twentieth century through the 1970s—in an intelligent and witty study of the college girl, the first woman to take that socially controversial step toward educational equity.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Merck Manual of Medical Information (Merck Manual Home Health Handbook (Quality))",
        "Authors": "By Beers, Mark H. (EDT), Berkow, Robert (EDT), and Merck & Co. (COR)",
        "Description": "FOR ONE HUNDRED YEARS, DOCTORS HAVE BEEN COMING TO US FOR ADVICE. NOW YOU CAN, TOO.  One of the most widely used sources of medical information in the world, The Merck Manual had previously been written for doctors and health-care professionaIs -- not the general public. Now The Merck Manual -- Home Edition contains virtually all of the information in the physician's version, but in easy-to-understand, everyday language, with a reader-friendly format. Written by two hundred internationally respected medical experts, this bestselling reference presents in-depth information for almost all medical problems, including:   Heart disease  Digestive disorders  Cancer  Nutrition problems  AIDS  Hormonal problems  Infections  Men's, women's, and children's health issues  Mental health disorders  Accidents and injuries  Care for the dying   and much more, as well as a detailed discussion of prescription and over-the-counter medications, an appendix of resources for help and information, and a detailed index.  Generously illustrated, comprehensive, and current, The Merck Manual -- Home Edition is published as a not-for-profit service by Merck -- a world leader in breakthrough medical discoveries with a long commitment to making the world a healthier",
        "Category": " Medical , Reference",
        "Publisher": "POCKET",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Things We Wish We Had Said: Reflections of a Father and His Grown Son",
        "Authors": "By Campolo, Tony",
        "Description": "",
        "Category": " Religion , Christian Ministry , Discipleship",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Non Campus Mentis",
        "Authors": "By Henriksson, Anders and Hendriksson, Anders",
        "Description": "Mangled Moments of Western Civilization from Term Papers & Blue Book Exams Did You Know:Cesar was assassinated on the Yikes of March when he is reported to have said, \"Me too, Brutus!\"Stalin, Roosevelt, Churchill, and Truman were known as the \"Big Three\"Rasputin was a pheasant by birthJudyism had one big God named YahooWestward expansion ended at Custard's Last StandMarie Curie won the Noel Prize for inventing the radiatorThe Civil Rights movement turned the corner with Martin Luther Junior's famous \"If I Had a Hammer\" speech",
        "Category": " Humor , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Wisdom of Confucius",
        "Authors": "By Confucius and Wilson, Epiphanius",
        "Description": "",
        "Category": " Religion , Confucianism",
        "Publisher": "Testament",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Vital Balance: The Life Process in Mental Health",
        "Authors": "By Menninger, Karl, Mayman, Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1967"
        }
    },
    {
        "Title": "Making Sense of Fibromyalgia",
        "Authors": "By Wallace, Daniel J. and Wallace, Janice Brock",
        "Description": "This year, six million Americans--most of them women--will go to their doctors, complaining of an illness they have no name for. The majority will be turned away or treated for depression; the few who persist will go to an average of four doctors before they receive the correct diagnosis: fibromyalgia.      In Making Sense of Fibromyalgia, noted medical writer Janice Wallace and Dr. Daniel Wallace, a leading expert on this disorder, provide a comprehensive guide--for both patients and professionals--to this little known and poorly understood syndrome. The authors offer detailed information in a clear and accessible style, taking readers through the steps of diagnosis, all the established forms of treatment, and alternative therapies that have yet to be proven effective. Fibromyalgia, they explain, is a pain amplification, brought on by abnormal interactions between hormones, the immune system, neurotransmitters, and the autonomic nervous system. Sometimes the syndrome occurs spontaneously; in most cases, the authors write, it is associated with trauma, stress, such conditions as lupus and hypothyroidism, and over forty microbes, from hepatitis to Epstein Barr to Lyme disease. They draw on actual cases to illustrate their points  and to break through the isolation that patients often feel when doctors misdiagnose or simply ignore their symptoms.      When Dr. Wallace wrote The Lupus Book, he brought hope and relief into the lives of countless Americans, in a book that sold through many printings. In Making Sense of Fibromyalgia, the authors address a desperate need for information and reassurance, in a groundbreaking book.",
        "Category": " Medical , Rheumatology",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Sea Creatures",
        "Authors": "By Jen Green",
        "Description": "",
        "Category": "",
        "Publisher": "Dempsey Parr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Eeyore Has a Birthday",
        "Authors": "By Milne, A. A.",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Case Studies in Medical Ethics",
        "Authors": "By Veatch, Robert M.",
        "Description": "",
        "Category": " Medical , Essays",
        "Publisher": "Harvard Univ Pr",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "Three Presents for Baby Jesus - Arch Books",
        "Authors": "By Bader, Joanne and Hillam, Corbin (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Concordia Publishing House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Clara Barton: Founder of the American Red Cross (Childhood of Famous Americans)",
        "Authors": "By Stevenson, Augusta and Giacoia, Frank (ILT)",
        "Description": "A biography focusing on the youth of the nurse who organized the American Red Cross in Washington, D.C., in 1881",
        "Category": " Juvenile Fiction , Health & Daily Living , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "When Dog was little (A First little golden book)",
        "Authors": "By Hammond, Lucille",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "12.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Britons: Forging the Nation 1707-1837",
        "Authors": "By Colley, Linda",
        "Description": "In this splendidly wide-ranging and compelling book, Linda Colley recounts how a new British nation was invented in the wake of the Act of Union between England and Wales and Scotland in 1707. She describes how a succession of major wars with Catholic France - culminating in the epic conflict with Napoleon - served as both a threat and a tonic, forcing the diverse peoples of this deeply Protestant culture into closer union and reminding them of what they had in common. She shows how the world-wide empire, which was the prize of so much successful warfare, gave men and women from different ethnic and social backgrounds a powerful incentive to be British. In the process, she not only demonstrates how an overarching British identity came to be superimposed on to much older regional and national identities, but she also illumines why it is that these same older identities - be it Scottishness or Welshness or Englishness or regionalism of one kind or another - have re-emerged and become far more important in the late twentieth century.An integral part of Colley's story are the aspirations, ambitions and antics of individual Britons. She supplies masterly vignettes of well-known heroes and politicians like Horatio Nelson and William Pitt the Younger, of bourgeois patriots like Thomas Coram and John Wilkes, and of artists and writers who helped forge our image of Britishness - William Hogarth, Benjamin West, David Wilkie, J.M.W. Turner, Charlotte Bronte and Walter Scott. She draws on paintings, plays, cartoons, diaries, almanacs, sermons and songs to bring vividly to life an array of men and women who have previously been left out of the historical record, from the British army officers who staged a medieval tournament in Philadelphia to defy the American 'rebels', to the women who raised money for a nude statue of the duke of Wellington, to the hundreds of thousands of working men who volunteered to fight the French in 1803. Throughout, she analyses patriotism rather than assumes its existence, and shows it to have been a remarkably diverse and often rational phenomenon.Finely written and lavishly illustrated, this highly original and timely book is a major contribution to our understanding of Britain's past and to the contemporary debate about the shape and identity of Britain in the future.",
        "Category": " Social Science , Ethnic Studies , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Winnie-The-Pooh and Some Bees",
        "Authors": "By A. A. Milne",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Library of Freedom: Inaugural Addresses of the Presidents",
        "Authors": "By Hunt, John Gabriel (EDT)",
        "Description": "Providing a survey of American history, a collection of the inaugural addresses of every United States president is accompanied by a brief introduction to each speech which places each president and address in a historical context.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Best American Essays 2005 (The Best American Series)",
        "Authors": "By Atwan, Robert (EDT) and Orlean, Susan (EDT)",
        "Description": "The Best American series has been the premier annual showcase for the country's finest short fiction and nonfiction since 1915. Each volume's series editor selects notable works from hundreds of periodicals. A special guest editor, a leading writer in the field, then chooses the very best twenty or so pieces to publish. This unique system has made the Best American series the most respected--and most popular--of its kind.The Best American Essays 2005 includesRoger Angell • Andrea Barrett • Jonathan Franzen • Ian Frazier • Edward Hoagland • Ted Kooser • Jonathan Lethem • Danielle Ofri • Oliver Sacks • Cathleen Schine • David Sedaris • Robert Stone • David Foster Wallace • and othersSusan Orlean, guest editor, is the author of My Kind of Place, The Orchid Thief, The Bullfighter Checks Her Makeup, and Saturday Night. A staff writer for The New Yorker since 1982, she has also written for Outside, Esquire, Rolling Stone, and Vogue.",
        "Category": " Literary Collections , American , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Spot at Play",
        "Authors": "By Hill, Eric",
        "Description": "Spot, the little puppy, plays hard all day--on the jungle gym and on the trampoline--until he gets tired and is ready for a nap",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Putnam Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Storming Heaven",
        "Authors": "By Brown, Dale",
        "Description": "America is under siege.Henri Cazaux, one of the world's most feared and deadly terrorists, is conducting a campaign of vindication and revenge against the United States. Cazaux, who was abused by American soldiers during an incarceration when he was a teenager in Europe, has waited years for this opportunity. Now, when the United States seems at its most vulnerable, he decides to strike. His method is ingenious in its simplicity: using large commercial aircraft purchased from an airline graveyard wholesaler, Cazaux will deploy bombs out of a modified rear-entry stair on unsuspecting critical targets.Cazaux's first attack is on a small northern California airport, even as he is fleeing federal authorities who are hot on his trail. But in a stunning turn in the chase, Cazaux heads directly for San Francisco International Airport, where he unleashes an entire cargo of high-impact explosives. The destruction of life and property is enormous, and the panic that ensues reaches all the way to the White House. As the nation watches helplessly in horror, Cazaux launches a second attack, this one against a major overnight shipping company facility in Memphis; the country's express package-delivery systems are all but crippled.With airports held hostage to Cazaux's pathological whims, and the President's back against the wall, there is only one man who can end the chaos. He is Rear Admiral Ian Hardcastle, known to readers of the author's previous bestselling novel Hammerheads. And Hardcastle, along with Lieutenant Colonel Al \"Rattler\" Vincenti, is ordered to reestablish security in the skies before there is further political fallout in the White House and the nation. Hardcastle's response to the emergency must be drastic, and it is . . . until Cazaux hits the Dallas/Fort Worth airport, then aims his sights on the biggest target of all - the nation's capital.The deadly game of cat-and-mouse pitting Hardcastle and Vincenti against Cazaux escalates as Storming Heaven hurtles toward a breathtaking climax over the skies of Washington, D.C. There, through midair dogfights and a skirmish involving Air Force One, readers are nailed to their seats by Brown's sheer storytelling genius.Storming Heaven is Dale Brown's most brilliant novel yet of military suspense, filled with all the excitement his readers have come to expect. It is a virtuoso performance by the undisputed master of the genre.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "The Alphabet from A to Z (A Little Golden Book)",
        "Authors": "By Gale, Leah",
        "Description": "",
        "Category": "",
        "Publisher": "western golden book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Magnifying Glass",
        "Authors": "By Kathryn Persch",
        "Description": "",
        "Category": "",
        "Publisher": "Waterford",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Frederick",
        "Authors": "By Lionni, Leo",
        "Description": "While the other field mice work to gather grain and nuts for winter, Frederick sits on a sunny rock by himself. “I gather sun rays for the cold dark winter days,” he tells them. Another day he gathers “colors,” and then “words.” And when the food runs out, it is Frederick, the dreamer and poet, whose endless store of supplies warms the hearts of his fellow mice, and feeds their spirits during the darkest winter days. Frederick’s story will warm readers as well in this Caldecott Honor winning fable.",
        "Category": " Juvenile Fiction , Animals , Mice, Hamsters, Guinea Pigs, etc.",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1973"
        }
    },
    {
        "Title": "Michael Moore Is a Big Fat Stupid White Man",
        "Authors": "By Hardy, David T. and Clarke, Jason",
        "Description": "Watching Michael Moore in action—passing off manipulating facts in Bowling for Columbine, spinning statistics in Stupid White Men and Dude, Where's My Country?, shamelessly grandstanding at the Academy Awards, and epitomizing the hypocrisy he's made a king's fortune railing against—has spurred authors David T. Hardy and Jason Clarke to take action into their own hands. In Michael Moore Is a Big Fat Stupid White Man, Hardy and Clarke dish it back hard to the fervent prophet of the far left, turning a careful eye on Moore's use of camera tricks and publicity ploys to present his own version of the truth.Postwar documentarians gave us the documentary, Rob Reiner gave us the mockumentary, and Moore initiated a third genre, the crockumentary.How, they ask, does Moore pull off a proletarian, \"man-of-the-people\" image so at odds with his lifestyle as a fabulously wealthy Manhattanite? And how large of an impact do his incendiary, ill-founded polemics have on the growing community that follows him with near-religious devotion? Loaded with well-researched, solidly reasoned arguments, and laced with irreverent wit, Michael Moore Is a Big Fat Stupid White Man fires back at one of the left's biggest targets—politically and literally.",
        "Category": " Political Science , Essays",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Peas and Thank You! (Big Idea Books / VeggieTales)",
        "Authors": "By Nawrocki, Michael, Hardin, Greg (ILT), and Vann, Robert (ILT)",
        "Description": "Help your child learn “zee” importance of good manners!In the village of West Manor, you can stay, if you please, in a well-mannered townpopulated by Peas. All the natives are friendly—they go out of their way. When you stop to say, “Thank you!” – “Why, you’re welcome!” they’ll say.In the village of South Boorish, on the North side of town, lives a rude population—the rudest around. They’re, so very ill-mannered, such impolite Beans. If you stop to say, “Thank you,” they won’t know what you mean!As these delightfully fun Peas and Beans head out to collect sunflower seeds, children discover that everyone wins when you learn to be polite and take turns.Sunday morning values, Saturday morning fun. Now that’s the Big Idea!Through imaginative and innovative products, Zonderkidz is feeding young souls.",
        "Category": " Juvenile Fiction , Social Themes , Manners & Etiquette",
        "Publisher": "Zonderkidz",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Bugs Bunny Rides Again (A Golden tell-a-tale book)",
        "Authors": "By Jean Lewis",
        "Description": "Bugs Bunny's friends try to get even with him for not helping them clean out the garage, but that naughty rabbit always comes out OK.",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Apples and Pumpkins",
        "Authors": "By Anne Rockwell",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Angels: God's Messengers and Our Helpers/no. 281/00  (Saint Joseph Picture Books)",
        "Authors": "By Lovasik, Lawrence G.",
        "Description": "",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "Catholic Book Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Jump Rope Rhymes (Booktivity)",
        "Authors": "By Rader, Laura (ILT) and Keller, Ellen (COM)",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Birdhousing",
        "Authors": "By Wolfman, Peri and Gold, Charles",
        "Description": "More than 130 photographs showcase the art of birdhouses, presenting birdhouses from Connecticut to California and including recipes for bird foods and a resource section that lists sources for birdhouses. 25,000 first printing.",
        "Category": " Science , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Those Were the Days",
        "Authors": "By Mary Carey",
        "Description": "Mickey and his nephews run into all sorts of problems when they are left in charge of the historical Founders Village.",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "The Carolina Way: Leadership Lessons from a Life in Coaching",
        "Authors": "By Smith, Dean, Kilgo, John, and Bell, Gerald D",
        "Description": "The most successful coach in college basketball history shares his complete coaching philosophy and demonstrates how to apply it to the leadership and team-building challenges in one's professional and personal life, emphasizing the three key principles of Play Hard, Play Smart, and Play Together.",
        "Category": " Sports & Recreation , General",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Arturo Baton, Paperback Level 3: Houghton Mifflin Soar to Success",
        "Authors": "By Read (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Among the Hidden (Shadow Children #1)",
        "Authors": "By Haddix, Margaret Peterson",
        "Description": "In a future where the Population Police enforce the law limiting a family to only two children, Luke, an illegal third child, has lived all his twelve years in isolation and fear on his family's farm in this start to the Shadow Children series from Margaret Peterson Haddix.Luke has never been to school. He's never had a birthday party, or gone to a friend's house for an overnight. In fact, Luke has never had a friend. Luke is one of the shadow children, a third child forbidden by the Population Police. He's lived his entire life in hiding, and now, with a new housing development replacing the woods next to his family's farm, he is no longer even allowed to go outside. Then, one day Luke sees a girl's face in the window of a house where he knows two other children already live. Finally, he's met a shadow child like himself. Jen is willing to risk everything to come out of the shadows -- does Luke dare to become involved in her dangerous plan? Can he afford not to?",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Simon & Schuster Australia",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Physicians' Desk Reference 2007 (Physicians' Desk Reference (PDR))",
        "Authors": "By PDR Staff (COR)",
        "Description": "Identifies thousands of prescription drugs, and provides information on ingredients, purpose, usage, precautions, side effects, and dosages",
        "Category": " Medical , Reference",
        "Publisher": "Physicians Desk Reference Inc",
        "Price Starting With ($)": "12.4",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Fundamentals of Building Construction: Materials and Methods",
        "Authors": "By Allen, Edward and Iano, Joseph (CON)",
        "Description": "An introduction to the art of building, it has been revised and updated to reflect changes in the industry. Describes the materials used since ancient times—wood, stone, brick and the techniques by which they are made into buildings today—before proceeding to structural steel, reinforced and prestressed concrete, float glass, extruded aluminum, advanced gypsum products, synthetic rubber compounds and plastics. Deals with whole systems of building including foundations, framing, roofing, interiors, electrical and mechanical systems. Each chapter contains a summary, list of key terms and concepts, review questions and references. Illustrated with over 300 line drawings and 700 photographs.",
        "Category": " Technology & Engineering , Construction , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "8.88",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "A Bug's Life (Disney Pixar)",
        "Authors": "By Kleven, Dean (ILT), Korman, Justine, Phillipson, Andrew (ILT), and Hobson, Mike (ILT)",
        "Description": "Flik must retrieve the ants' food from the river and save it and himself from the hungry grasshoppers who are threatening to squish every ant in the colony",
        "Category": " Juvenile Nonfiction , Animals , Insects, Spiders, etc.",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Last Two Million Years",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "8.14",
        "Publish Date": {
            "Month": "March",
            "Year": "1975"
        }
    },
    {
        "Title": "Christmas Cats",
        "Authors": "By Wilhelm, Hans (ILT) and Marzollo, Jean",
        "Description": "A seasonal tale presents a lively, rhyming romp that features creative Christmas cats hanging the mistletoe, lighting the window, and singing carols in the snow, in an easy-to-read poem that is especially suited to young cat lovers.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Walt Disney's Detective Mickey Mouse (A Little Golden Book)",
        "Authors": "By [Little Golden Book]",
        "Description": "A famous actress hires Mickey Mouse to find her missing poodle.",
        "Category": "",
        "Publisher": "Golden books; Western Publishing Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Berenstain Bears' New Baby",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This classic Berenstain Bears story is a perfect way to help a child get ready for a new sibling! Come for a visit in Bear Country with this timeless classic from Stan and Jan Berenstain. Join Papa, Mama, and Brother as they welcome Sister into the family and adjust to life with a new baby.",
        "Category": " Juvenile Fiction , Family , New Baby",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1974"
        }
    },
    {
        "Title": "The Salamander Room (Dragonfly Books)",
        "Authors": "By Mazer, Anne and Johnson, Steve (ILT)",
        "Description": "A boy finds a salamander in the woods and imagines the many things he can do to turn his room into a perfect salamander home. Together, Anne Mazer and Steve Johnson have created a woodland paradise that any salamander would love to share with a child.",
        "Category": " Juvenile Fiction , Animals , Reptiles & Amphibians",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Exploring Weather (Eyes On Adventure)",
        "Authors": "By Kathy Wilmore",
        "Description": "",
        "Category": "",
        "Publisher": "Innisbrook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Electric Gadgets and Gizmos: Battery-Powered Buildable Gadgets that Go! (Kids Can Do It)",
        "Authors": "By Bartholomew, Alan and Bartholomew, Lynn (ILT)",
        "Description": "Explains how to make battery-powered cars, fans, remote control boats, and communication buzzers from cardboard tubes, plastic bottles, tin foil, wires, and batteries",
        "Category": " Juvenile Nonfiction , Technology , Electricity & Electronics",
        "Publisher": "Kids Can Pr",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Our Amazing Ocean (Question & Answer Books)",
        "Authors": "By Adler, David A. and Veno, Joseph (ILT)",
        "Description": "Questions and answers provide basic information about the ocean, including wave formation, currents, depth, salinity, marine biology, and its utilization for humankind.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Strategery: How George W. Bush Is Defeating Terrorists, Outwitting Democrats, and Confounding the Mainstream Media",
        "Authors": "By Sammon, Bill",
        "Description": "Strategery is a term borrowed from a Saturday Night Live skit and self-deprecatingly adopted by the White House for their meetings. White House Correspondent Bill Sammon is borrowing it yet again in his latest account of this unlikely-yet historic-president. It is written with verve and piercing insight by Sammon, who has been granted unprecedented access to President Bush, Vice President Cheney and their most senior advisers. No other journalist has interviewed the president more times than Sammon.\"A most revealing book that captures firsthand Bush’s &#145;strategy’ of honesty, decency and doing what he says he’s going to.\" -- Rush Limbaugh\"Bill Sammon has some of the best sources within the Bush campaign&#133;.This book contains a treasure trove of insight.\" -- James Carville\"The most interesting and readable account to date of the 2004 campaign and the momentous events that have followed it.\" -- Brit Hume",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Johnny Tremain, Book Cover May Vary",
        "Authors": "By Forbes, Esther",
        "Description": "Johnny Tremain, a young apprentice silversmith, is caught up in the danger and excitement of 1775 Boston, just before the Revolutionary War. But even more gripping than living through the drama of Revolutionary Boston is the important discovery Johnny makes in his own life.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "The Olympics and Other Ancient Games-Coloring Book",
        "Authors": "By Knill, E.",
        "Description": "",
        "Category": " Juvenile Nonfiction , History , Ancient",
        "Publisher": "Bellerophon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Old Yeller (HarperClassics)",
        "Authors": "By Gipson, Fred",
        "Description": "A timeless American classic and one of the most beloved children’s books ever written, Old Yeller is a Newbery Honor Book that explores the poignant and unforgettable bond between a boy and the stray dog who becomes his loyal friend. When his father sets out on a cattle drive toward Kansas for the summer, fourteen-year-old Travis Coates is left to take care of his family and their farm. Living in Texas Hill Country during the 1860s, Travis comes to face new, unanticipated, and often perilous responsibilities in the frontier wilderness.A particular nuisance is a stray yellow dog that shows up one day and steals food from the family. But the big canine who Travis calls “Old Yeller” proves his worth by defending the family from danger. And Travis ultimately finds help and comfort in the courage and unwavering love of the dog who comes to be his very best friend. Fred Gipson’s novel is an eloquently simple story that is both exciting and deeply moving. It stands alongside works like The Adventures of Huckleberry Finn, Where The Red Fern Grows, and Shiloh as a beloved and enduring classic of literature. Originally published in 1956 to instant acclaim, Old Yeller later inspired a hit film from Walt Disney. Just as Old Yeller inevitably makes his way into the Coates family’s hearts, this book will find its own special place in readers’ hearts.",
        "Category": " Juvenile Fiction , Westerns",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Story of the Civil War Coloring Book (Dover History Coloring Book)",
        "Authors": "By Copeland, Peter",
        "Description": "All the drama of the American Civil War comes vividly to life in these ready-to-color scenes of key moments in that epic conflict. Here are panoramic views of land and sea battles, revealing vignettes that dramatize social and political issues of the period, and detailed close-ups of uniforms, equipment, and locale.Forty authentically rendered illustrations (including five double-page spreads) depict a slave auction in 1860, black leaders Harriet Tubman and Frederick Douglass, the battle for the federal arsenal at Harpers Ferry, the bombardment of Fort Sumter, a naval battle between the first American iron-clad ships — the Monitor and the Merrimac — the signing of the Emancipation Proclamation, the Battle of Gettysburg, Lee's surrender to Grant at Appomattox, the assassination of Lincoln at Ford's Theater, and much more.",
        "Category": " Juvenile Nonfiction , History , United States , Civil War Period (1850-1877)",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Helen Keller: From Tragedy to Triumph (The Childhood of Famous Americans Series)",
        "Authors": "By Wilkie, Katharine E and Doremus, Robert",
        "Description": "Focuses on the childhood of Helen Keller, who overcame her handicaps with the help of her teacher",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Fitzgerald's The Great Gatsby (Cliffs Notes)",
        "Authors": "By Northman, Phillip (EDT)",
        "Description": "",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliff Notes, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1964"
        }
    },
    {
        "Title": "As I Lay Dying (Cliffs Notes)",
        "Authors": "By Roberts, James Lamar",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background.CliffsNotes on As I Lay Dying takes you into the lives of not one, but several narrators in this novel about the value of life. The central problem of the novel involves the reasons for Addie’s request to be buried and why her family defies fire and water to fulfill it.This study guide will guide you through the plot of the novel and through the process of analyzing each character’s problems and motivations. Other features that help you study includeInformation on the life and background of William FaulknerA character list to help clarify relationships among the many narratorsAnalysis and commentary on each section of the bookCritical essaysIn-depth character analysesReview questions and suggested essay topicsClassic literature or modern modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "CliffsNotes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1964"
        }
    },
    {
        "Title": "Dickens' Oliver Twist (Cliffs Notes)",
        "Authors": "By Kaste, Harry (EDT)",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in the series also feature glossaries and visual elements that complement the classic, familiar format.In CliffsNotes on Oliver Twist, you’ll meet a dear, grateful, gentle orphan who, “instead of possessing too little feeling, possessed rather too much.” The CliffsNotes commentaries, summaries, and character analysis will show you why this sweet, sad, and moving story is considered to be one of Dickens&#39; greatest works (and one of his more politically-charged ones). You’ll also find Life and background of the author, Charles DickensA short introduction to the novelA list of charactersEssays about symbolism, style, setting, and moreA review section that tests your knowledgeClassic literature or modern-day treasure—you&#39;ll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1965"
        }
    },
    {
        "Title": "The Invisible Man (Cliffs Notes)",
        "Authors": "By Martin, James I. (EDT)",
        "Description": "This novel about a young black man in Harlem reveals the process of self-discovery and emphasizes individuality. Through a difficult passage into manhood, Ellison writes of the alienation of humans in everyday life, yet he remains whole and optimistic.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1969"
        }
    },
    {
        "Title": "Bronte's Jane Eyre (Cliffs Notes)",
        "Authors": "By Jacobson, Karin",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.Question Victorian — and present-day — society as you study Charlotte Bronte's popular novel with CliffsNotes on Jane Eyre. What is women's position in society? What is the relationship of dreams and fantasy to reality? What is the basis of an effective marriage? Bronte tackles all these questions and more through the story of her heroine Jane Eyre.CliffsNotes provides detailed plot summaries, critical commentaries, and a helpful character map to help you uncover all the insight this novel has to offer. Make your study of this timeless novel a success with CliffsNotes on Jane Eyre. Other features that help you study includeCharacter analyses of major playersCritical essaysA review section that tests your knowledgeBackground on the author, including career highlightsClassic literature or modern modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Tuck Everlasting",
        "Authors": "By Babbitt, Natalie",
        "Description": "Now a feature film from Walt Disney Pictures!Critically acclaimed when it was first published, Tuck Everlasting has become a much-loved modern-day classic. Now, in fall 2002, Walt Disney Pictures is releasing Tuck Everlasting as a feature film. The film will star Alexis Bledel as Winnie Foster, Sissy Spacek as Mae Tuck, William Hurt as Pa Tuck, Jonathan Jackson as Jesse Tuck, Scott Bairstow as Miles Tuck, and Ben Kingsley as the Man in the Yellow Suit.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Sunburst",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Butterfly Kisses: Tender Thoughts Shared Between Fathers and Daughters",
        "Authors": "By Carlisle, Bob",
        "Description": "This gift book contains the story of \"Butterfly Kisses\" plus the lyrics of the song with pictures of fathers and daughters in various stages of growth and life-from childhood and adolescence to the teen years, graduation from high school, and marriage. The entire book is filled with emotion and beauty, with full-color photography and design.",
        "Category": " Religion , Inspirational",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Twelve Steps for Overeaters: An Interpretation of the Twelve Steps of Overeaters Anonymous",
        "Authors": "By L., Elisabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Hazelden",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Without a Trace (Nancy Drew: All New Girl Detective #1)",
        "Authors": "By Keene, Carolyn",
        "Description": "Hi, I'm Nancy Drew, and I've got a case to crack. Actually make that two cases. First a gorgeous Fabergé egg has been stolen. Who would have the heart to snatch such a precious family heirloom from someone new to town? Some housewarming that is!  And if this isn't enough to keep me busy, someone's running through gardens and stomping on all the zucchinis. Needless to say, it's a big mess -- in more ways than one. Especially for Mr. Safer, who is suspected of squishing the squash. I'm pretty sure Mr. Safer's innocent. But who's the real vegetable vandal?",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Santa Cruise: A Holiday Mystery at Sea",
        "Authors": "By Clark, Mary Higgins and Clark, Carol Higgins",
        "Description": "Alvirah Meehan, the lottery winner turned amateur sleuth; her husband, Willy; recently hitched private detective Regan Reilly and her groom, Jack, head of the NYPD Major Case Squad; and Regan's parents, Nora and Luke, are guests on the Royal Mermaid's maiden voyage, the Santa Cruise. The cruise is Commodore Randolph Weed's gift to a select group of people who in the last year \"made the world a better place.\" What he really wants is good publicity that will generate future bookings for his struggling new venture. He also plans to scatter his beloved mother's ashes at sea during this four-day odyssey in the Caribbean. What he doesn't know is that his ne'er-do-well nephew, Eric, has smuggled two escaping criminals on board.Alvirah won the cruise at a charity auction and persuaded the Reillys to accompany her and Willy. Other passengers include members of the Oklahoma Readers and Writers group, who volunteer their time teaching people to read. The group is planning a mystery seminar dedicated to a Ghost of Honor, the late Left Hook Louie, a champion prizefighter turned bestselling author. There are also ten men on board who had donated their time playing Santa Claus during the holiday season as well as assorted other charitable folk, all planning on a restful post-Christmas vacation.The hoped-for tranquility soon vanishes. A terrified mystery fan swears she has spotted the Ghost of Honor in the ship's chapel. Two Santa suits disappear from a locked supply room. A storm develops, and in the infirmary an attempt is made on the life of a seemingly feeble passenger. Back in Miami, a TV reporter is turning the cruise into a public-relations nightmare, thanks to her spies on the ship.As the Royal Mermaid sails through troubled waters, Alvirah, Regan, and Jack are uncovering the clues that lead them to dangerous criminals who were not on the original guest list.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "All I Really Need To Know I Learned From Watching Star Trek",
        "Authors": "By Marinaccio, Dave",
        "Description": "A philosophical study of Star Trek presents a series of life-enhancing lessons based on the examples of Captain Kirk and the crew of the Enterprise, from lessons in management to issues of responsibility and understanding. 50,000 first printing. $50,000 ad/promo.",
        "Category": " Humor , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "A Song for Jeffrey (American Girl)",
        "Authors": "By Foland, Constance M.",
        "Description": "Dodie develops a new outlook on her grim life when she meets Jeffrey, a boy with muscular dystrophy and a passion for art, in a novel which explores the meaning of true friendship and the ways a serious illness can test it. A first novel. Simultaneous.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "A Treasury of Stories for Six Year Olds",
        "Authors": "By Blishen, Edward, Blishen, Nancy, and Knowles, Tixxie (ILT)",
        "Description": "Each treasury is illustrated with black-and-white line drawings and is perfectly targeted to its young audience, offering a mix of classic and contemporary tales from such notable authors as Joel Chandler Harris, Alison Uttley, and James Reeves.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "A Race Against Time (Nancy Drew: All New Girl Detective #2)",
        "Authors": "By Keene, Carolyn",
        "Description": "If I'm in the game, I play to win. So as captain of my team in the River Heights Biking for Bucks charity road race, my goals are to bring my team over the finish line first -- and to catch a thief along the way!  See, all of the money we raised before the race has been stolen -- and I know I can find it. With two days, practically no clues, and a bike race to win, I've got my work cut out for me. But with Bess, George, and Ned on my team, what could stand between us and the gold?",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Crazy Lady! (Trophy Newbery)",
        "Authors": "By Conly, Jane Leslie",
        "Description": "Increasingly alienated from his widowed father, Vernon joins his friends in ridiculing the neighborhood outcasts'Maxine, an alcoholic prone to outrageous behavior, and Ronald, her retarded son. But when a social service agency tries to put Ronald into a special home, Vernon fights against the move.1994 Newbery Honor BookNotable Children's Books of 1994 (ALA)1994 Best Books for Young Adults (ALA)1994 Young Adult Editors' Choices (BL)1994 Books for the Teen Age (NY Public Library)Young Adult Choices for 1995 (IRA)",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Roses for Mama (Women of the West)",
        "Authors": "By Oke, Janette",
        "Description": "The Petersons moved west in hopes of improving Mrs. Peterson's health, but when it is clear she has only months to live, Angela, fourteen, knows that the other children will become her responsibility",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "American Dynasty",
        "Authors": "By Phillips, Kevin P.",
        "Description": "Despite their years in the political limelight, the Bushes are the family nobody really knows - so contends Kevin Phillips, onetime Republican strategist and one of the country's premier political and economic commentators. The cozy imagery of Maine summer cottages, a gray-haired national grandmother, and cowboy boots has emphasized comforting family values. It has also distracted us from the fact that the Bush family has used all its resources to create a political dynasty that has gained the White House to further its family and ideological agenda, which would have horrified America's founding fathers. They, after all, led a revolution against a succession of royal Georges.In this book, Phillips reveals how four generations of Bushes, beginning with the original alliance between George Herbert Walker and Samuel P. Bush, have ascended the ladder of national power since World War I, solidifying their place in the American establishment - at Yale, on Wall Street, in the Senate, the CIA, the vice presidency, and the White House. The Bush family has never produced a doctor, judge, teacher, scholar, or lawyer of note. As far back as World War I, the family's single-minded focus has been on three major areas: intelligence, energy, and national security. It is no coincidence that these three categories of Bush family operations were also three of the key enterprises of the American twentieth century.Phillips demonstrates how the Bush family has perfectly exemplified many of the growing trends in American political life - policy favoritism to the top 1 percent, paper entrepreneurialism, and crony capitalism a la Enron (the Bushes' dealings with Enron go back to 1986). Far more than any previous political family, it represents an interlock between the hitherto temporary presidency and permanent government. As such, the family has threaded its way through political and armaments scandals and, since the 1980s, faint hints of acts that might in another climate have led to presidential impeachment.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Kodak Pocket Guide to Nature Photography",
        "Authors": "By",
        "Description": "",
        "Category": " Photography , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Life's Little Destruction Book: Everyday Rescue for Beauty, Fashion, Relationships, and Life",
        "Authors": "By Dane, Charles Sherwood",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Baseball Bafflers : Quizzes, Trivia, and Other Ballpark Challenges",
        "Authors": "By Makov, Fastball (EDT)",
        "Description": "It's the ultimate collection for armchair umpires and baseball fanatics: Fun and perplexing facts, trivia, games, quotes and zany moments from our nation's favorite pastime. The only thing a true baseball fan enjoys as much as cheering on his or her team is swapping stats, facts, trivia and golden moments from the Great American Sport. This thoroughly enjoyable compilation of all-things-baseball includes such fan-talizing topics as Little-known Rules, Trick Plays, Quotes of the Game and Funny Moments. And, perhaps most fun of all, readers can play coach, making such tough calls as these:  - Can a runner ever steal first base?  - What happens when a catcher fields a ball with his mask?  - Can a game continue with eight players on the field?  With information and anecdotes, this big little book is sure to hit a homerun with fans of every stripe.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Beginning Bridge Complete",
        "Authors": "By Penick, Michael",
        "Description": "From teaching the rank of the suits to a sensible glossary of terms, here is a bridge book for beginners that is complete yet streamlined, solid but thoroughly understandable.Suitable for self teaching or for classroom use.",
        "Category": " Games , Card Games , Bridge",
        "Publisher": "Baron Barclay Bridge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Wolves of Willoughby Chase (Wolves Chronicles Series)",
        "Authors": "By Aiken, Joan and Marriott, Pat (ILT)",
        "Description": "Wicked wolves and a grim governess threaten Bonnie and her cousin Sylvia when Bonnie's parents leave Willoughby Chase for a sea voyage. Left in the care of the cruel Miss Slighcarp, the girls can hardly believe what is happening to their once happy home. The servants are dismissed, the furniture is sold, and Bonnie and Sylvia are sent to a prison-like orphan school. It seems as if the endless hours of drudgery will never cease.With the help of Simon the gooseboy and his flock, they escape. But how will they ever get Willoughby Chase free from the clutches of the evil Miss Slighcarp?This edition of the beloved classic features an introduction by Aiken's daughter, Lizza, providing insight into the struggles Aiken—much like her heroines—had to endure before finally finishing this classic story a decade after she started writing it.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Write Right!: A Desktop Digest of Punctuation, Grammar, and Style",
        "Authors": "By Venolia, Jan",
        "Description": "",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Godly Man's Picture (Puritan Paperbacks)",
        "Authors": "By Watson, Thomas",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Banner of Truth",
        "Price Starting With ($)": "6.43",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The Berenstain Bears and the Messy Room",
        "Authors": "By Berenstain, Stan, Berenstain, Jan",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Country Brides",
        "Authors": "By Macomber, Debbie",
        "Description": "City girl Rorie Campbell falls in love with rancher Clay Franklin, after her car breaks down on a country road, and Kate Logan is devastated when her former fiancT, Clay, marries another woman, prompting her to propose to her long-time friend, Luke Rivers, in interconnected novels about two young women--each engaged to the wrong man. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Brain Building Games with Words and Numbers",
        "Authors": "By Bragdon, Allen D. and Gamon, David",
        "Description": "",
        "Category": " Self-help , Personal Growth , Memory Improvement",
        "Publisher": "Brainwaves Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "CAPTAIN CORELLI'S MANDOLIN",
        "Authors": "By De Bernieres, Louis",
        "Description": "Extravagant, inventive, emotionally sweeping, Captain Corelli's Mandolin is the story of a timeless place that one day wakes up to find itself in the jaws of history. The place is the Greek island of Cephallonia, where gods once dabbled in the affairs of men and the local saint periodically rises from his sarcophagus to cure the mad. Then the tide of World War II rolls onto the island's shores in the form of the conquering Italian army.Caught in the occupation are Pelagia, a willful, beautiful young woman, and the two suitors vying for her love: Mandras, a gentle fisherman turned ruthless guerilla, and the charming, mandolin-playing Captain Corelli, a reluctant officer of the Italian garrison on the island. Rich with loyalties and betrayals, and set against a landscape where the factual blends seamlessly with the fantastic, Captain Corelli's Mandolin is a passionate novel as rich in ideas as it is genuinely moving.",
        "Category": " Fiction , General",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Cause of Death (Kay Scarpetta, No. 7)",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "The mysterious death of Ted Eddings, an investigative reporter, and the murder of a morgue assistant driving her car lead medical examiner Kay Scarpetta, her niece, and police captain Pete Marino on the trail of a deadly supremacist group. Reprint.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "African Violets and Flowering Houseplants (The Ortho library)",
        "Authors": "By Powell, Charles C.",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "All about trees",
        "Authors": "By Ortho Books",
        "Description": "Describes hundreds of trees and their care requirements, looks at how trees grow, and recommends types of trees for specific landscaping purposes",
        "Category": "",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    }
]