[
    {
        "Title": "Songs in Ordinary Time (Oprah's Book Club)",
        "Authors": "By Morris, Mary McGarry",
        "Description": "It's the summer of 1960 in Atkinson, Vermont. Maria Fermoyle is a strong but vulnerable divorced woman whose loneliness and ambition for her children make her easy prey for dangerous con man Omar Duvall. Marie's children are Alice, seventeen—involved with a young priest; Norm, sixteen—hotheaded and idealistic; and Benny, twelve—isolated and misunderstood, and so desperate for his mother's happiness that he hides the deadly truth he knows about Duvall. We also meet Sam Fermoyle, the children's alcoholic father; Sam's brother-in-law, who makes anonymous \"love\" calls from the bathroom of his failing appliance store; and the Klubock family, who—in contrast to the Fermoyles—live an orderly life in the house next door.Songs in Ordinary Time is a masterful epic of the everyday, illuminating the kaleidoscope of lives that tell the compelling story of this unforgettably family.",
        "Category": " Fiction , Sagas",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Understanding Wall Street",
        "Authors": "By Little, Jeffrey B. and Rhodes, Lucien",
        "Description": "Explains how the stock market works, offers advice on reading the financial pages, and discusses stocks, bonds, precious metals, technical analysis, and stock options",
        "Category": "",
        "Publisher": "Liberty Hall Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Carbohydrate Addict's Carbohydrate Counter",
        "Authors": "By Heller, Richard F.",
        "Description": "",
        "Category": " Health & Fitness , Diets",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Earl Mindell's Anti-Aging Bible",
        "Authors": "By Mindell, Earl",
        "Description": "Earl Mindell's Anti-Aging Bible shows you how to use the latest information to help you live a longer and healthier life, improve memory, build bones and muscles, smooth wrinkles, and avoid the ills of age from arthritis to osteoporosis to cancer.",
        "Category": " Self-help , Aging",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Best Catherine Marshall",
        "Authors": "By Lesourd, Leonard E. (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "USA & Canada (USA and Canada (Fodors Travel Pubns))",
        "Authors": "By Jarolim, Edie (EDT)",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Chiropractic First: The Fastest Growing Healthcare Choice Before Drugs or Surgery",
        "Authors": "By Rondberg, Terry A.",
        "Description": "",
        "Category": " Medical , Chiropractic",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Love 101: To Love Oneself is the Beginning of a Lifelong Romance (The Life 101 Series)",
        "Authors": "By McWilliams, Peter",
        "Description": "",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Prelude Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "100 Simple Secrets of Happy Families: What Scientists Have Learned and How You Can Use It (100 Simple Secrets, 4)",
        "Authors": "By Niven, David",
        "Description": "The Simple Science of a Happy FamilyFrom raising children to getting along with in-laws, what do people with close and loving families do differently than those with strained or unfulfilling relationships? Sociologists, therapists, and psychiatrists have spent entire careers investigating the ins and outs of family dynamics, yet their findings are inaccessible to ordinary people, hidden in obscure journals to be shared with other experts. Now, David Niven, the international bestselling author of The 100 Simple Secret series has collected the most current and significant data from more than a thousand of the best scientific studies on families and then spelled out the findings in plain English.The advice is based not on one person's unique experiences or opinions, but offers for the first time the research of noted scientists studying average American families. These findings have been boiled down to one hundred essential ways to find and maintain love, joy, and satisfaction in all family relationships. Each statistic is accompanied by a true story about a real family showing the results in action.Don't Forget the Past: Parents who share stories of family history with their children create higher levels of concern for family members and increase the likelihood of their children's happiness.No Price Tag: Once basic necessities are met, the increasing economic status of one's family has zero effect on the likelihood of feeling satisfied with life.Let Every Opinion Be Heard: Senior citizens having trouble living in their own homes are 84 percent more likely to be satisfied with their housing situation if they feel as if their concerns are an important part of selecting a new home or facility.The Greatest Gift: Life satisfaction is 72 percent more likely among those who feel content with their family life.",
        "Category": " Self-help , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Second Thoughts: One Hundred Upbeat Messages for Beat-Up Americans",
        "Authors": "By Crim, Mort",
        "Description": "Second Thoughts is a collection of 100 essays reflecting celebrated broadcaster Mort Crim's conclusions about life after 35 years of covering world events. His daily radio series, from which he has gathered these writings, cuts through the gloomy clouds created by media fascination with the bad, the bizarre and the ugly. Second Thoughts is about solutions, triumphs and faith. Its messages are crisp, cogent daily reminders that hope is not only reasonable, but the only rational basis upon which to build a life - or a society. Readers will find security and inspiration within these pages and realize that each one of us makes a difference in the world.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Who's Afraid of Opera?",
        "Authors": "By Walsh, Michael",
        "Description": "For anyone who has been intimidated, overwhelmed, or just plain confused by what they think opera is, Who's Afraid of Opera? offers a lively, readable, and frankly biased guide to what author Michael Walsh describes as \"the greatest art form yet invented by humankind.\"From opera's origins in Renaissance Italy to the Who's Tommy and Stephen Sondheim's Into the Woods, Walsh explores what opera is - and what it's not; which is more important - the words or the music?; why does it take Tristan so long to die?; a (Not Quite) Totally Arbitrary Basic Repertoire; and what makes a great singer.So curtain up! It's time to settle into your seat, close up your program, and watch the house lights go down. And get ready for the musical ride of your lives.",
        "Category": " Music , Genres & Styles , Opera",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "How Could You Do That?!: The Abdication of Character, Courage, and Conscience",
        "Authors": "By Schlessinger, Laura",
        "Description": "How Could You Do That?! illustrates Dr. Laura Schlessinger's philosophy of personal responsibility through her usually provocative but always stimulating moral dialogues with callers about everyday ethical dilemmas.In her lively pull-no-punches style, Dr. Laura takes on the moral dilemmas of our time: from the mindless pursuit of pleasure and immediate gratification to taking the easy way out when those actions produce ugly or uncomfortable life-altering consequences. She demonstrates in no uncertain terms that personal values are never someone else's reponsibility but your own, and why choosing not to honor them actually compounds unhappiness. Finally she explains that by disciplining self-indulgence and rising above temptation we can discover the infinite pleasures, the true happiness, of the moral high ground.Dr. Laura delivers not only a compelling argument for an ethical approach to life but also an invaluable inspiration to rebuilding character, conscience, and courage. Here is a work that can make a genuine difference in the quality of your own life and the lives of those we love.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Wide Awake at 3:00 A.M. by Choice or by Chance?",
        "Authors": "By Coleman, Richard M.",
        "Description": "Describes the effects of the biological clocks found in each human being, discusses shift work, jet lag, dreams, and insomnia, and looks at the purpose and stages of sleep",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "The Sixth Lamentation",
        "Authors": "By Brodrick, William",
        "Description": "Larkwood Priory, Suffolk, 1995: Following his afternoon confessions, Father Anselm is stopped by an old man. What, he is asked, should a man do when the world has turned against him? Anselm’s response—claim sanctuary—is to have greater resonance than he could ever have imagined, for the man returns demanding the protection of the Church. He is Eduard Schwermann, a suspected Nazi war criminal.Meanwhile, with her life running out, Agnes Aubret unburdens a secret to her granddaughter Lucy. Fifty years earlier Agnes lived in occupied Paris and risked her life to smuggle Jewish children to safety until her group was exposed by an SS officer: Eduard Schwermann.As Father Anselm struggles to discover the truth about Schwermann’s history and Lucy delves ever deeper into her grandmother’s past, their investigations dovetail to reveal a remarkable story, in which two seemingly unconnected lives shockingly converge. William Brodrick is a master of crisp historical re-creation, precision plotting, and morally complex characterization.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Easy Guide to Bridge (Cadogan Bridge)",
        "Authors": "By Hiron, Alan and Hiron, Maureen",
        "Description": "Introduces the game of bridge, and discusses tricks, trumps, bids, scoring, and strategy",
        "Category": " Games , Card Games , Bridge",
        "Publisher": "Cadogan Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Cabal and Other Stories",
        "Authors": "By Gilchrist, Ellen",
        "Description": "A new collection of short fiction by the critically acclaimed author of Victory Over Japan introduces five witty, fun, and passionate new stories, as well as the title novella about a Mississippi psychiatrist who goes mad and begins to reveal his patients' deepest secrets, mishaps, and misdeeds to anyone who will listen. Reprint. 15,000 first printing.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Today and Tomorrow's Woman: Menopause : Before and After (Girls of 16 to Women of 99)",
        "Authors": "By Millonig, Virginia Layng",
        "Description": "",
        "Category": " Medical , Gynecology & Obstetrics",
        "Publisher": "Health Leadership Assoc Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Full House: Reassessing the Earth's Population Carrying Capacity (Worldwatch Environmental Alert)",
        "Authors": "By Brown, Lester R. and Kane, Hal",
        "Description": "",
        "Category": " Science , Environmental Science",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Diplomatic Dance: The New Embassy Life in America",
        "Authors": "By Scott, Gail",
        "Description": "Journalist and television personality Scott describes the life of foreign diplomats in Washington, based on interviews with ambassadors, their families, and their staffs. She explains why everyone wants to be in the capital of the world. She also includes a glossary that does not indicate pronunciation, addresses of embassies, and a guide to etiquette. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , Americas (North, Central, South, West Indies)",
        "Publisher": "Fulcrum Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Star-Spangled Manners: In Which Miss Manners Defends American Etiquette (For a Change)",
        "Authors": "By Martin, Judith",
        "Description": "In this \"wryly perceptive, historically informed\" (BookPage) new book, America's leading expert on civility reminds her Gentle Readers that when the Founding Fathers created a revolution in the name of individual liberty and equality, they also took a stand against hierarchical European etiquette in favor of simplicity over ceremony, and personal dignity over obsequiousness to our rulers.Hailed by George Will as \"The National Bureau of Standards,\" Judith Martin, who has \"made etiquette writing an exercise in wit\" (Book), recounts here how Americans fashioned this etiquette of egalitarian respect—a fascinating story that spans from the misunderstood origins of our table manners to the much overlooked legacy of African slaves to etiquette.",
        "Category": " Reference , Etiquette",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Final Act: The Roads to Waterloo",
        "Authors": "By Dallas, Gregor",
        "Description": "The inside front and backcover illustration of European power players prancing about parallels the intricate dance of nations played at the 1814-15 Congress of Vienna. With its stellar cast of all the rulers who mattered at the time except the exiled Napoleon Bonaparte, writer Gregor Dallas narrates the melodramatic history of this pivotal diplomatic event ostensibly to restore \"the natural order\"of Europe while each leader jockeyed for power, disputed territories, and attacked emerging liberalism.  Key players included Tsar Alexander, Tallyrand, Wellington, and Mellernich with a supporting cast of mistresses, spies, other rogues, and Beethoven. Napoleon, of course, was to challenge them anew at Waterloo.  Quaint b&w illustrations. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " History , Modern , 19th Century",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "24/7: Living it Up and Doubling Down in the New Las Vegas",
        "Authors": "By Martinez, Andres",
        "Description": "A journalist describes his month-long odyssey through the glittering, high-roller world of Las Vegas, providing a close-up look at diverse facets of the neon Babylon and its colorful inhabitants, including conventioneers, professional gamblers, and many others. 25,000 first printing.",
        "Category": " Games , Gambling , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Winter Solstice",
        "Authors": "By Rosamunde Pilcher",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Wild Life of Pets (Rubes(r) Cartoon Pet)",
        "Authors": "By Rubin, Leigh",
        "Description": "",
        "Category": " Pets , General",
        "Publisher": "CompanionHouse Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Footprints in the Mind",
        "Authors": "By Javan",
        "Description": "",
        "Category": "",
        "Publisher": "Javan Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "One More Time",
        "Authors": "By Krentz, Jayne Ann, Rimmer, Christine, and Graham, Lynne",
        "Description": "One More Time by Jayne Ann Krentz\\Christine Rimmer\\Lynne Graham released on Sep 23, 2003 is available now for purchase.",
        "Category": " Fiction , General",
        "Publisher": "Harlequin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Dried Flower Crafts: Capturing The Best Of Your Garden To Decorate Your Home",
        "Authors": "By Cusick, Dawn",
        "Description": "\"...attractive projects for dried flowers, together with easy-to-create designs...outlines in delicately colored illustrations show step-by-step techniques and procedures. A color photograph accompanies each completed wreath, centerpiece, topiary, garland, and gift item....Many easy designs...along with more interesting and complex--although not very difficult--swags and container arrangements.\"--Booklist.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Tour de France Companion: A Nuts, Bolts & Spokes Guide to the Greatest Race in the World",
        "Authors": "By Roll, Bob and Koeppel, Dan (FRW)",
        "Description": "We all know about Lance Armstrong, who this summer made history by being the first rider ever to win a sixth Tour de France. But what about the peloton and the role it plays in supporting the leader? What about the difference between a stage win and a time trial? What about the Tour's curiously chivalric code of behavior? What about the caravan?With the popularity of Armstrong and the Tour outstripping our knowledge of bicycle racing, here is The Tour de France Companion, a fully illustrated primer that explains the strategies, ground rules, history, personalities, techniques, and technology behind one of the world's most spectacular and brutal sporting events. It's all clear: How teams work together. How their bikes are different from our bikes. What it takes to be a racer--the rare combination of slow- and fast-twitch muscles, a huge cardiovascular system, and an extraordinary toughness that allows you to endure more pain than your rivals. The jerseys: yellow, green, polka-dot, white, and the \"combativity prize\" to the rider who tries the hardest (look for a red race number). The complicated timing structure, including why it's so difficult to finish a tour--every rider must finish within ten percent or so of the fastest guy every single day, or head for home. Even what happens when the leader needs to make a rest stop--no, the other contenders don't zoom off into the sunset. Includes a glossary, stats, historic timeline, 2004 tour map, and more.",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Real Magnolias: Stories of Southern Women Finding Hope, Love, and Laughter",
        "Authors": "By Freeman, Becky",
        "Description": "For Ingest Only - Data needs to be cleaned up for all products being loaded",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Index of Leading Cultural Indicators: Facts and Figures on the State of American Society",
        "Authors": "By Bennett, William J.",
        "Description": "William J. Bennett's \"report card\" on America is a comprehensive statistical portrait of our moral, social, and cultural condition. For years Americans have turned to the Commerce Department's Index of Leading Economic Indicators to spot trends in our economy. Now The Index of Leading Cultural Indicators provides an accessible guide to sweeping - and alarming - trends in American society.The Index of Leading Cultural Indicators vividly demonstrates that since 1960 - while population, wealth, and welfare benefits climbed - America's values have deteriorated. Drawing on data from the Census Bureau, the FBI, and other government sources, Bennett provides eye-opening statistical and numerical breakdowns, charts and graphs, and a brief analysis of the data. Here are some of the startling findings: since 1960 violent crime has increased by 560 percent; the number of unmarried pregnant teenagers has nearly doubled; teen suicide has increased by more than 200 percent and the number of divorces has increased nearly 200 percent, while the marriage rate is at an all-time low.Parents, educators, and everyone across the political spectrum will find The Index of Leading Cultural Indicators an invaluable sourcebook as well as a dramatic call to arms.",
        "Category": " Social Science , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Did Mohawks Wear Mohawks? and Other Wonders, Plunders, and Blunders",
        "Authors": "By Watson, Mark and Tindall, Bruce",
        "Description": "The origin of the Mohawk Haircut, the occupation of a Slubber Doffer, the reason for the Great Wall of China and other perennially puzzling matters are illuminated in dozens of brief articles.",
        "Category": "",
        "Publisher": "Quill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Obsession",
        "Authors": "By Chernin, Kim",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Scribners Best of the Fiction Workshops 1998",
        "Authors": "By Kulka, John (EDT), Danford, Natalie (EDT), and Shields, Carol (EDT)",
        "Description": "A much anticipated compilation of literary masterpieces collected from some one hundred workshops contains extraordinary works by well-known authors and the daring and alluring voices of a new generation of talented writers. Original.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Coffee Will Make You Black: A Novel",
        "Authors": "By Sinclair, April",
        "Description": "Coming of age during the 1960s, Stevie Stevenson's struggles with her parent's traditional values and her own awakening sexuality are further complicated by her high school's increasing political awareness and demonstrations for civil rights. Reprint.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "HarperPb",
        "Price Starting With ($)": "12.95",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Alternatives",
        "Authors": "By Kushner, Rose",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Kensington Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Frontiers of Management: Where Tomorrows Decisions Are Being Shaped Today",
        "Authors": "By Drucker, Peter Ferdinand",
        "Description": "Discusses the new economic forces that affect lives and livelihoods, today's changing people and their workplace surroundings, the newest management concepts and practices, and the shape of evolving organizations as they respond to increasing tasks and responsibilities",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Lempriere's Dictionary: A Novel",
        "Authors": "By Norfolk, Lawrence",
        "Description": "\"An important and inspiring novel.\"VOICE LITERARY SUPPLEMENTIt is 18th-century London and John Lempriere, a young scholar, is writing a dictionary of classical mythology in an attempt to exorcise the demons raised by his father's violent and bizarre death. While tending to his father's business affairs, Lempriere discovers a 150-year old conspiracy that has kept his family from its share of the fabulously wealthy East India Company. But as John begins to untangle the years of mystery and deceit, people begin to die, in ways that mirror the very myths he is researching....",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "You Can't Keep a Good Woman Down",
        "Authors": "By Walker, Alice",
        "Description": "A natural evolution from the earlier, much-acclaimed collection In Love & Trouble, these fourteen provocative and often humorous stories show women oppressed but not defeated. “[Walker] shrinks from no moral or emotional complexity, and she writes consummately skillful short stories” (Alice Adams, San Francisco Examiner & Chronicle).",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "TIME TRIP PA",
        "Authors": "By Swigart, Rob",
        "Description": "",
        "Category": "",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "14.43",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Fourteen Sisters of Emilio Montez O'Brien, The",
        "Authors": "By Hijuelos, Oscar",
        "Description": "In The Fourteen Sisters of Emilio Montez O'Brien, Oscar Hijuelos brings to life the rambunctious Montez O'Brien family. In a small Pennsylvania town, Nelson O'Brien runs the Jewel Box Movie Theater, raising 14 daughters and a son with his wife, Mariela Montez. Through the eyes of Margarita, the eldest daughter, the lives, loves and tragedies of the Montez O'Briens and their complex family relationships unfold. While reflecting on the life of Emilio, her doggedly masculine brother, Margarita also ruminates on the nature of femininity, family, sex, love and earthly happiness. Her musings recall exhilarating adventures, eliciting tears and laughter, and tenderly reveal the bounteous heart of a warm, passionate family. At once lush, erotic and gorgeously written, The Fourteen Sisters of Emilio Montez O'Brien is a masterwork by one of America's greatest writers.",
        "Category": " Fiction , Literary",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Somebody Else's Mama (Harvest Book)",
        "Authors": "By Haynes, David",
        "Description": "As she struggles to move from antagonism to common ground with Miss Xenobia Kezee, her sick, elderly, cantankerous mother-in-law, Paula Johnson confronts her own mother’s death and her husband’s detachment from the emotional life of his family.",
        "Category": " Family & Relationships , Activities",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Shadow Baby",
        "Authors": "By McGhee, Alison",
        "Description": "Eleven-year-old Clara is struggling to find the truth about her missing father and grandfather and her dead twin sister, but her mother refuses to talk. When Clara begins interviewing Georg Kominsky--her elderly neighbor--she finds that he is equally reticent about his own concealed history. Precocious and imaginative, Clara invents versions of Mr. Kominsky’s past, just as she invents lives for the people missing from her own shadowy history. Her journey of discovery is at the heart of this beautiful story about unlikely friendship and communion, about discovering what matters most in life, and about the search to find the missing pieces of ourselves.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The All-in-One Diabetic Cookbook",
        "Authors": "By Margie, Joyce Daly and Palumbo, P.J., M.D.",
        "Description": "",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Still Catholic After All These Years",
        "Authors": "By Jones, Bob (ILT) and Meara, Mary Jane Frances Cavolina (EDT)",
        "Description": "The authors of the best-selling Growing up Catholic offer a fond, mischievous look at what it means to belong to the Catholic Church now that all the rules have changed, complete with photographs, quizzes, and drawings. Original. Tour.",
        "Category": " Religion , General",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Saving the Planet: How to Shape an Environmentally Sustainable Global Economy (Worldwatch Environmental Alert)",
        "Authors": "By Brown, Lester R., Flavin, Christopher, and Postel, Sandra",
        "Description": "Authoritative yet extremely readable, this book addresses control of energy resources, population, poverty, transportation, taxes, and other issues necessary to create an environmentally sound global economy.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "In One Day",
        "Authors": "By Parker, Tom",
        "Description": "365 megafacts and more than eighty-five drawings, reveal what Americans collectively produce, consume, and accomplish every twenty-four hours",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Don't Make Me Stop this Car: Adventures in Fatherhood",
        "Authors": "By Roker, Al",
        "Description": "Millions of Americans see Al Roker daily on NBC's top-rated Today. In Don't Make Me Stop This Car! Al takes us home. Here, we meet his wife, Deborah, and his daughters Courtney and Leila. Just like men all over the country, Al is a modern father who fantasizes about the newest sport utility vehicle, struggles with a GapKids addiction, and basks in the golden moments of first steps and special Father's Day meals. Heartwarming, honest, and funny, Don't Make Me Stop This Car! is a sneak peek into the heart of the guy in the driver's seat, the all-American dad.",
        "Category": " Humor , Topic , Family",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Obasan",
        "Authors": "By Kogawa, Joy",
        "Description": "A fictional account of the author's experiences as the daughter of Japanese immigrants, protected by her aunt, Obasan, against extreme prejudices, while growing up in Canada during World War II",
        "Category": " Fiction , General",
        "Publisher": "David R Godine Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Homes and Other Black Holes",
        "Authors": "By Barry, Dave and MacNelly, Jeff",
        "Description": "Offers a humorous look at the pitfalls of homeowning, from defining the mystical \"price range\" and keeping track of a contractor to defining a neighborhood by its bumper stickers",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Let's Talk: An Honest Conversation on Critical Issues : Abortion, AIDS, Euthanasia, Health Care",
        "Authors": "By Koop, C. Everett, M.D. and Johnson, Timothy",
        "Description": "The former U.S. Surgeon General and a medical expert discuss the subjects that often polarize the country, asking when does life begin? where do we draw the line with euthanasia? and do we condone sex when we educate children about it? Original. $50,000 ad/promo.",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "What to Expect the First Year",
        "Authors": "By Eisenberg, Arlene, Murkoff, Heidi Eisenberg, and Hathaway, Sandee E.",
        "Description": "Some things about babies, happily, will never change. They still arrive warm, cuddly, soft, and smelling impossibly sweet. But how moms and dads care for their brand-new bundles of baby joy has changed—and now, so has the new-baby bible.  Announcing the completely revised third edition of What to Expect the First Year. With over 10.5 million copies in print, First Year is the world’s best-selling, best-loved guide to the instructions that babies don’t come with, but should. And now, it’s better than ever. Every parent’s must-have/go-to is completely updated.  Keeping the trademark month-by-month format that allows parents to take the potentially overwhelming first year one step at a time, First Year is easier-to-read, faster-to-flip-through, and new-family-friendlier than ever—packed with even more practical tips, realistic advice, and relatable, accessible information than before. Illustrations are new, too.  Among the changes: Baby care fundamentals—crib and sleep safety, feeding, vitamin supplements—are revised to reflect the most recent guidelines. Breastfeeding gets more coverage, too, from getting started to keeping it going. Hot-button topics and trends are tackled: attachment parenting, sleep training, early potty learning (elimination communication), baby-led weaning, and green parenting (from cloth diapers to non-toxic furniture). An all-new chapter on buying for baby helps parents navigate through today’s dizzying gamut of baby products, nursery items, and gear. Also new: tips on preparing homemade baby food, the latest recommendations on starting solids, research on the impact of screen time (TVs, tablets, apps, computers), and “For Parents” boxes that focus on mom’s and dad’s needs. Throughout, topics are organized more intuitively than ever, for the best user experience possible.",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Workman Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "How to Live to Be 100",
        "Authors": "By Burns, George",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Stella in Heaven: Almost a Novel",
        "Authors": "By Buchwald, Art",
        "Description": "A widower seeks help from his deceased wife in finding a new bride, but the incorporeal Stella becomes jealous of the women who could potentially replace her. 50,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The One Minute Sales Person",
        "Authors": "By Johnson, Spencer and Wilson, Larry",
        "Description": "Everyone is a salesperson! Over four million people have reaped the lifetime benefits of The One Minute Manager, Spencer Johnson's phenomenal bestseller. Now Dr. Johnson reveals the unique secrets of salesmanship that can make you a success in all aspects of your life and work. Sell yourself... and you can sell anything.Behind every sale is a person. With Spencer Johnson's extraordinary One Minute methods, you can profit immeasurably by helping others to get what they want. This clear, easy and invaluable guide is the tool you need for personal well-being and financial success. It makes you feel good about selling and about yourself... and it really works!",
        "Category": "",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Mama Get The Hammer! There's a Fly on Papa's Head!",
        "Authors": "By Johnson, Barbara",
        "Description": "Laughter laced, reality based, and just a little bit off the wall, this book is vintage Barbara Johnson?a gift of hilarity and hope from America's queen of encouragement.Barbara Johnson has staked her life and her ministry on the healing power of a positive outlook. But here she zeroes directly in on the therapeutic benefit of a smile, a giggle, and a good, old-fashioned belly laugh. She insists that laughing in the face of adversity is not a form of denial, but a proven tool for managing stress, coping with pain, and maintaining hope. And to prove her point, she presents this funnybone-tickling, heart-touching laugh manual?packed with hard-earned wisdom . . . and custom designed to nudge you (giggling) down the road to positive living.",
        "Category": " Humor , Topic , Marriage & Family",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The American Saga: Stories, Poems and Essays",
        "Authors": "By Graham, Hugh (COM)",
        "Description": "",
        "Category": "",
        "Publisher": "Bbs Pub Corp",
        "Price Starting With ($)": "5.91",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Age of Sacred Terror",
        "Authors": "By Simon, Steven and Benjamin, Daniel",
        "Description": "Daniel Benjamin and Steven Simon began working on this book shortly after leaving the National Security Council, where, as director and senior director for counterterrorism, they watched the rise of al-Qaeda and helped coordinate America’s fight against Usama bin Laden and his organization. They warned in articles and interviews about the appearance of a new breed of terrorists who were determined to kill on the grand scale. More than a year before September 11, 2001, they began writing The Age of Sacred Terror to sound the alarm for a nation that had not recognized the gravest threat of our time. One of their book’s original goals has remained: to provide the insights to understand an enemy unlike any seen in living memory—one with an extraordinary ability to detect weakness and exploit it, one with a determination to inflict catastrophic damage, one that will not be deterred. But after September 11, a second, equally crucial goal was added: to understand how America let its defenses down, how warnings went unheeded, and how key parts of the government failed at vital tasks. The Age of Sacred Terror also describes the road ahead, where the terrorists will look to draw strength, and what the United States must do, at home and abroad, to stop them. For a year after the attacks that redefined terrorism and devastated the public’s sense of security, America has been searching for answers about those responsible for one of the darkest days in our history and explanations for the glaring gaps in our defenses. The Age of Sacred Terror provides both, with unique authority. It is the book that Americans must read to understand the foremost challenge we face.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Sudden Fiction: American Short Stories",
        "Authors": "By Thomas, James (EDT) and Shapard, Robert (EDT)",
        "Description": "Here Are 70 of The Very Best Short-Short  Stories of Recent Years Including  Contributions From Such Contemporary  Writers As Raymond Carver, Leonard  Michaels and John Updike; A Few Modern  Masters As Hemingway and Cheever; and An Assortment of Talented New Young  Writers. Sudden Fiction Brilliantly Captures The Tremendous Popularity of  This New and Distictly American Form.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Gibbs Smith, Publisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2013"
        }
    },
    {
        "Title": "The Harper's Index Book",
        "Authors": "By Pollan, Michael, Lapham, Lewis H., and Etheridge, Eric",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "The Essential Guide to Lesbian and Gay Weddings",
        "Authors": "By Ayers, Tess and Brown, Paul",
        "Description": "Forty black-and-white photographs accent a savvy same-sex wedding guide, which tackles topics ranging from choosing creative vows to finding a cake topper with two brides or two grooms. 10,000 first printing. Tour.",
        "Category": " Social Science , General",
        "Publisher": "Harper San Francisco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Goblins/Whirlwind",
        "Authors": "By Grant, Charles L. and Carter, Chris (CRT)",
        "Description": "A maverick FBI agent and the female agent assigned to keep him in line are given the eeriest unsolved cases--those filed under \"X\"",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "Dey Street Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Savage Spawn: Reflections on Violent Children (Library of Contemporary Thought)",
        "Authors": "By Kellerman, Jonathan",
        "Description": "This thought-provoking and timely book from a #1 New York Times bestselling novelist and noted child psychologist reveals the factors that often lead to explosive and shocking juvenile violence.“Ethically and morally, kids are works in progress. Throw in psychopathy and you’ve got a soul that will never be complete.”In this powerful, disturbing book, bestselling author and noted child psychologist Jonathan Kellerman shines a penetrating light on antisocial youth—kids who kill without remorse—asserting that “psychopathic tendencies begin very early in life, as young as three, and they endure.” Criticizing our quick impulse to blame violent movies or a “morally bankrupt” society, Kellerman convinces us that it is the kids themselves who need to be examined. Carefully. How do children become cold-blooded killers? Kellerman warns that today’s aggressive bully is tomorrow’s Mafia don, cult leader, or genocidal dictator. Violently psychopathic youths possess an overriding need for power, control, and stimulation, and all display a complete lack of regard for the humanity of others. He examines the origins of psychopathy and the ever-shifting debate between nurture and nature, offering some controversial solutions to dealing with homicidal tendencies in children.As timely as today’s headlines, more gripping than fiction, Savage Spawn is a provocative look at the links between society and biology, children and violence. Kellerman’s sobering message will remain with you long after the last page is turned.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Pigs in Heaven",
        "Authors": "By Kingsolver, Barbara",
        "Description": "A phenomenal bestseller and winner of the Los Angeles Times Book Award for fiction, Pigs in Heaven continues the story of Taylor and Turtle, first introduced in The Bean Trees.",
        "Category": " Fiction , Literary",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Moon Tiger",
        "Authors": "By Lively, Penelope",
        "Description": "Claudia Hampton, writer of best-selling popular history books, lies in a London hospital bed and looks back on her own life, including an unforgettable love affair",
        "Category": " Fiction , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "6 Nightmares: The Real Threats to American Security...",
        "Authors": "By Lake, Anthony",
        "Description": "A former National Security Advisor offers a chilling portrait of six terrifying scenarios that threaten the safety and security of the United States, including the rise of global terrorism and the proliferation of nuclear weapons, and describes why and why not the American government is prepared to meet such potential threats. Reprint. 18,000 first printing.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "We're Right, They're Wrong: A Handbook for Spirited Progressives",
        "Authors": "By Carville, James",
        "Description": "The campaign strategist for the election of Bill Clinton provides an entertaining and timely response to the Republicans' \"Contract with America,\" defending a strong government and its social role and providing a definitive program for strengthening America. Original. 150,000 first printing. Tour.",
        "Category": " Political Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Dave's World: The Unofficial Guide to the Late Show With David Letterman",
        "Authors": "By Cader, Michael and Marsh, Fabienne",
        "Description": "Letterman's fans are a dedicated bunch, ranging from Baby Boomers to young college students. His show has proven itself a worthy contender to the competition soundly beating out Arsenio Hall, Jay Leno, and the rest. This unauthorized companion book to Letterman's shows on NBC and CBS, offers a hip, unique, and hysterically funny guide that's packed with inside information. Over 100 photos.",
        "Category": " Humor , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Way to Go, Smith",
        "Authors": "By Smith, Bob",
        "Description": "In his award-winning first book, Bob Smith offered up a witty dose of nineties reality with his observations as a happily adjusted gay man. Now, after breaking up with his longtime boyfriend, Smith looks back to his painfully normal childhood to see where all the trouble really began. Like every other American kid, Bob's adolescence was marked by alternating moments of blissful ignorance, hazy confusion, and humiliating self-consciousness. And in these pages, Bob evokes his youth with a vividness that will make you shudder and howl with recognition.In these hysterically humorous pages, Bob Smith introduces readers to his comically unsympathetic grandmother, who makes light of his carsickness: \"Bob only throws up because he's near the window and he can\"; to his first teacher crush, whose \"five-o'clock shadow could plunge a room into darkness\"; and to his first brush with fame, when he fainted from his chair during a biology filmstrip (\"Way to go, Smith!\"). Sharp, observant, ingeniously ironic and wholly satisfying, this new Lambda Award-nominated collection is at once bittersweet nostalgic fun and a testament to the unquestionable gifts of a highly original comic writer.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "The Dan Quayle Quiz Book: For People Who Think They Are Smarter Than the Vice President",
        "Authors": "By Brady, Ken and Solomon, Jeremy",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Feast of Love: A Novel",
        "Authors": "By Baxter, Charles",
        "Description": "National Book Award Finalist From \"one of our most gifted writers\" (Chicago Tribune), here is a superb new novel  that delicately unearths the myriad manifestations of extraordinary love between  ordinary people. The Feast of Love is just that -- a sumptuous work of fiction about  the thing that most distracts and delights us.  In a re-imagined Midsummer Night's  Dream, men and women speak of and desire their ideal mates; parents seek out their  lost children; adult children try to come to terms with their own parents and, in  some cases, find new ones. In vignettes both comic and sexy, the owner of a coffee  shop recalls the day his first wife seemed to achieve a moment of simple perfection,  while she remembers the women's softball game during which she was stricken by the  beauty of the shortstop. A young couple spends hours at the coffee shop fueling the  idea of their fierce love. A professor of philosophy, stopping by for a cup of coffee,  makes a valiant attempt to explain what he knows to be the inexplicable workings  of the human heart  Their voices resonate with each other -- disparate people joined  by the meanderings of love -- and come together in a tapestry that depicts the most  irresistible arena of life. Crafted with subtlety, grace, and power, The Feast of  Love is a masterful novel.\"Supurb.... A near perfect book, as deep as it is broad in its humaneness, comedy and wisdom.\" -- The Washington Post Book World",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Beyond Reengineering: How the Process-Centered Organization is Changing Our Work and Our Lives",
        "Authors": "By Hammer, Michael",
        "Description": "Reengineering has captured the imagination of managers and shareholders alike, sending corporations on journeys of radical business redesign that have already begun to transfigure global industry. Yet aside from earning them improvements in their business performance, the shift into more-process-centered organizations is causing fundamental changes in the corporate world, changes that business leaders are only now beginning to understand. What will the revolutions final legacy be? Beyond Reengineering addresses this question, exploring reengineering's effects on such areas as: Jobs: What does process-centering do to the nature of jobs? What does a process-centered workplace feel like? Managers: What is the new role of the manager in a process-centered company? Education: What skills are vital in the process-centered working world, and how can young or inexperienced workers prepare? Society: What are the implications of process-centering for employment and the economy as a whole? Investment: What are the characteristics of a successful 21st-century corporation? An informed look at one of the most profound changes to ever sweep the corporate world, Beyond Reengineering is the business manual for the 21st century.",
        "Category": " Business & Economics , Development , Business Development",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Nuclear Delusion",
        "Authors": "By Kennan, George Frost",
        "Description": "Reviews the complex issues that must be addressed if the United States is to make rational, prudent decisions about future nuclear weapons systems",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Tepper Isn't Going Out: A Novel",
        "Authors": "By Trillin, Calvin",
        "Description": "Murray Tepper would say that he is an ordinary New Yorker who is simply trying to read the newspaper in peace. But he reads while sitting behind the wheel of his parked car, and his car always seems to be in a particularly desirable parking spot. Not surprisingly, he is regularly interrupted by drivers who want to know if he is going out.Tepper isn’t going out. Why not? His explanations tend to be rather literal—the indisputable fact, for instance, that he has twenty minutes left on the meter.But once New Yorkers become aware of Tepper, some of them begin to suspect that he knows something they don’t. And an ever-increasing number of them are willing to line up for the opportunity to sit in his car with him and find out what it is.Tepper Isn’t Going Out is a wise and witty story of an ordinary man who, perhaps innocently, changes the world around him.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Stiffed: The Betrayal of the American Man",
        "Authors": "By Faludi, Susan",
        "Description": "One of the most talked-about books of last year, the Pulitzer Prize-winning author of Backlash now explores the collapse of traditional masculinity that has left men feeling betrayed. With Backlash in 1991, Susan Faludi broke new ground when she put her finger directly on the problem bedeviling women, and the light of recognition dawned on millions of her readers: what's making women miserable isn't something they're doing to themselves in the name of independence. It's something our society is doing to women. The book was nothing less than a landmark. Now in Stiffed, the author turns her attention to the masculinity crisis plaguing our culture at the end of the '90s, an era of massive layoffs, \"Angry White Male\" politics, and Million Man marches. As much as the culture wants to proclaim that men are made miserable--or brutal or violent or irresponsible--by their inner nature and their hormones, Faludi finds that even in the world they supposedly own and run, men are at the mercy of cultural forces that disfigure their lives and destroy their chance at happiness. As traditional masculinity continues to collapse, the once-valued male attributes of craft, loyalty, and social utility are no longer honored, much less rewarded. Faludi's journey through the modern masculine landscape takes her into the lives of individual men whose accounts reveal the heart of the male dilemma. Stiffed brings us into the world of industrial workers, sports fans, combat veterans, evangelical husbands, militiamen, astronauts, and troubled \"bad\" boys--whose sense that they've lost their skills, jobs, civic roles, wives, teams, and a secure future is only one symptom of a larger and historic betrayal. With Backlash in 1991, Susan Faludi broke new ground when she put her finger directly on the problem bedeviling women, and the light of recognition dawned on millions of her readers: what's making women miserable isn't something they're doing to themselves in the name of independence. It's something our society is doing to women. The book was nothing less than a landmark.Now in Stiffed, the author turns her attention to the masculinity crisis plaguing our culture at the end of the '90s, an era of massive layoffs, \"Angry White Male\"  politics, and Million Man marches. As much as the culture wants to proclaim that men are made miserable--or brutal or violent or irresponsible--by their inner nature and their hormones, Faludi finds that even in the world they supposedly own and run, men are at the mercy of cultural forces that disfigure their lives and destroy their chance at happiness. As traditional masculinity continues to collapse, the once-valued male attributes of craft, loyalty, and social utility are no longer honored, much less rewarded.Faludi's journey through the modern masculine landscape takes her into the lives of individual men whose accounts reveal the heart of the male dilemma. Stiffed brings us into the world of industrial workers, sports fans, combat veterans, evangelical husbands, militiamen, astronauts, and troubled \"bad\"  boys--whose sense that they've lost their skills, jobs, civic roles, wives, teams, and a secure future is only one symptom of a larger and historic betrayal.With Backlash in 1991, Susan Faludi broke new ground when she put her finger directly on the problem bedeviling women, and the light of recognition dawned on millions of her readers: what's making women miserable isn't something they're doing to themselves in the name of independence. It's something our society is doing to women. The book was nothing less than a landmark.Now in Stiffed, the author turns her attention to the masculinity crisis plaguing our culture at the end of the '90s, an era of massive layoffs, \"Angry White Male\"  politics, and Million Man marches. As much as the culture wants to proclaim that men are made miserable--or brutal or violent or irresponsible--by their inner nature and their hormones, Faludi finds that even in the world they supposedly own and run, men are at the mercy of cultural forces that disfigure their lives and destroy their chance at happiness. As traditional masculinity continues to collapse, the once-valued male attributes of craft, loyalty, and social utility are no longer honored, much less rewarded.Faludi's journey through the modern masculine landscape takes her into the lives of individual men whose accounts reveal the heart of the male dilemma. Stiffed brings us into the world of industrial workers, sports fans, combat veterans, evangelical husbands, militiamen, astronauts, and troubled \"bad\"  boys--whose sense that they've lost their skills, jobs, civic roles, wives, teams, and a secure future is only one symptom of a larger and historic betrayal.",
        "Category": " Social Science , Feminism & Feminist Theory",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Swimming in the Volcano",
        "Authors": "By Shacochis, Bob",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Something Blue: A Novel",
        "Authors": "By Spaugh, Jean Christopher",
        "Description": "She begins to realize that things aren't quite right in her life: her cozy trailer now seems shabby and small; a redecorating project rekindles her dream of a career in architecture; and just who was her husband kissing in the parking lot? As the full constellation of family, friends, and neighbors gathers, relationships change, secrets are revealed, and Judy must make choices that will guide her future and that of her family. Depicting the ties, joys, and burdens of family life with sympathy and humor, Something Blue is the story of a woman trying to reconcile freedom and love. A reading group guide is bound into the book.",
        "Category": " Fiction , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Sherlock Holmes and the Secret Alliance",
        "Authors": "By Millett, Larry",
        "Description": "In Sherlock Holmes and the Secret Alliance, Holmes's American consort, Irish saloonkeeper Shadwell Rafferty, is taking his first crack at a case that looks like it may send a whole city government tumbling. Rafferty, large-hearted and massively built, has a talent for logic, dissimulation, bribery, and action that is surpassed only by his love of \"the detectin' game.\" On the eve of President William McKinley's visit in 1899 to Minneapolis, a gruesome crime draws Rafferty from St. Paul to the booming city across the river.A young union activist has been found, strung naked from a tree outside a ruined mansion. A placard around his neck bears the ominous words The Secret Alliance Has Spoken. Rafferty plunges into the case with his usual gusto, but finds more questions than answers. Was the murder the work of the union-busting Citizens Alliance or wild-eyed anarchists? Was the victim linked to an empire of corruption controlled by the city's slippery mayor? And how did the young man come to possess a photograph of a prominent citizen engaged in sexual congress? As the puzzle deepens and the dangers mount, Rafferty is joined, just in time, by his old friends Sherlock Holmes and Dr. John Watson.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "IBM Way: Insights into the World's Most Successful Marketing Organization",
        "Authors": "By Shook, Robert L. and Rodgers, Buck",
        "Description": "IBM is one of the greatest sales and marketing organizations ever assembled. Established over seventy years ago, it now employs 400,000 people and generates $50 billion a year in revenue. Yet it operates more like a cottage industry than a huge multinational organization.How does IBM do it? That's what even the most successful companies want to know. Now Buck Rodgers, the man who has personified \"the IBM way,\" describes for the first time the reasons behind its extraordinary achievements. He has not written a company history, or an exposé, or a book on management theory. He has written a book about everything that makes IBM IBM, as only an insider could.",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Scarlet Letter: The American Classic",
        "Authors": "By Hawthorne, Nathaniel",
        "Description": "Set in 17th-century Puritan New England, this story of illicit passion, guilt and punishment revolves around the beautiful and mysterious Hester Prynne. She is condemned to wear a scarlet letter as a sign of her adultery, and it has a strange and disturbing effect upon those around her - neighbours, husband, lover and child.",
        "Category": " Fiction , Classics",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "A Song Flung Up to Heaven",
        "Authors": "By Angelou, Maya",
        "Description": "The culmination of a unique achievement in modern American literature: the six volumes  of autobiography that began more than thirty years ago with the appearance of I Know  Why the Caged Bird Sings. A Song Flung Up to Heaven opens as Maya Angelou returns  from Africa to the United States to work with Malcolm X. But first she has to journey  to California to be reunited with her mother and brother. No sooner does she arrive  there than she learns that Malcolm X has been assassinated. Devastated, she tries  to put her life back together, working on the stage in local theaters and even conducting  a door-to-door survey in Watts. Then Watts explodes in violence, a riot she describes  firsthand. Subsequently, on a trip to New York, she meets Martin Luther King, Jr.,  who asks her to become his coordinator in the North, and she visits black churches  all over America to help support King’s Poor People’s March. But once again tragedy  strikes. King is assassinated, and this time Angelou completely withdraws from the  world, unable to deal with this horrible event. Finally, James Baldwin forces her  out of isolation and insists that she accompany him to a dinner party—where the idea  for writing I Know Why the Caged Bird Sings is born. In fact, A Song Flung Up to  Heaven ends as Maya Angelou begins to write the first sentences of Caged Bird.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Rogue Nation: American Unilateralism And The Failure Of Good Intentions",
        "Authors": "By Prestowitz, Clyde",
        "Description": "America's democratic ideals have long been the hope of the world, but our allies increasingly see us as abandoning those ideals. It's not hard to understand why. In the months before 9/11, the United States walked away from a number of international treaties including the Kyoto Accord. After the attack, the United States turned a cold shoulder to NATO's offers to assist with the invasion of Afghanistan, unilaterally terminated the ABM treaty, and actively opposed the creation of an International Criminal Court. Then came the war on Iraq, begun despite the clear refusal of the United Nations Security Council to authorize an invasion.Obsessed with our own immediate military and economic security, we now deem institutions like NATO and the UN irrelevant. We have abandoned containment for a policy of preventive attacks on potential threats. More and more, we act alone, with little regard for the needs and goals of other nations.Rogue Nation is not an argument against American dominance or the exercise of American power. It's an argument against stupidity, arrogance, and ignorance in the exercise of power. Prestowitz explores the historical roots of the unilateral impulse and shows how it now influences every important area of American foreign policy. Even now, when the need for multilateral action has never been greater, we continue to act contrary to international law, custom, and our own best interests.",
        "Category": " History , World",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Scorpion Tongues: The Irresistible History of Gossip in American Politics",
        "Authors": "By Collins, Gail",
        "Description": "Did Woodrow Wilson murder his first wife? Of course not. Did Hillary Clinton throw the lamp? Maybe. From Thomas Jefferson to William Jefferson Clinton, Scorpion Tongues is a popular history of gossip in American politics. Complete with wickedly delightful anecdotes of major and minor politicians and entertainers over the last 200 years, Gail Collins examines the evolving relationship between politicians and the press and the blurring of the lines between politicians and celebrities. Supported by extensive research and written with an entertaining flair, she speculates on how gossip reflects the current moral compass of the time, noting how a rumor, like an unpredictable summer tornado, can flatten one reputation while a similar story passes over another with hardly a rustle. \"Hilariously readable\" (The Economist), Scorpion Tongues offers sinful scandals and mild hearsay for every taste.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "A Time of Fear",
        "Authors": "By Roderick  MacLeish",
        "Description": "",
        "Category": "",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "16.81",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Children: The Challenge : The Classic Work on Improving Parent-Child Relations--Intelligent, Humane & Eminently Practical",
        "Authors": "By Dreikurs, Rudolf and Soltz, Vicki",
        "Description": "Children: The Challenge gives the key to parents who seek to build trust and love in their families, and raise happier, healthier, and better behaved children. Based on a lifetime of experience with children—their problems, their delights, their challenges—Dr. Rudolf Dreikurs, one of America's foremost child psychiatrists presents an easy to follow program that teaches parents how to cope with the common childhood problems that occur from toddler through preteen years. This warm and reassuring reference helps parents to understand their children's actions better, giving them the guidance necessary to discipline lovingly and effectively.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "The tragedy of Richard II: the life and times of Richard II (1367-1400), King of England (1377-1399) compared to those of Richard of America in his second administration",
        "Authors": "By Myers, R.",
        "Description": "",
        "Category": "",
        "Publisher": "Acropolis Books",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Masters Of The Art Of Command (A Da Capo paperback)",
        "Authors": "By Blumenson, Martin and Stokesbury, James L.",
        "Description": "\"Only rarely does a work of military history appear that serves to illuminated the paradox of the infinitely rich diversity of the military art and the fundamental continuity of principle and character revealed by its practitioners across the centuries. Such a book is Masters of the Art of Command, a wide-ranging series of essays on military leaders, ancient and modern,   whose actions and personalities provide insights into the interplay of   time, circumstance, and individual character and ability that makes  for  success--or, equally instructive, for failure.\"In a lively and perceptive introductory essay, Stokesbury sketches the ever-changing circumstances, tools, and social purposes of warfare to reveal its essential continuity of principle. In the series of essays that follow, Blumenson casts a wide net--over 'Some Masters of the Art' (Sulla, Saxe, Thomas, and Huebner, among others); over 'Masters of Mobile Warfare' (Iberville, Crook, Wolseley, Hart, Montgomery, and Patton); over 'Coalition Warfare' (Rochambeau, Eisenhower, and various command problems and situations); and over special problems such as military obedience, Hitler and his generals, and the 'maverick' military leader.\"For the general reader, this book will provide a fascinating trip across historical fields of battle; for the military professional or student of military history, it should strike sparks of recognition and illumination, and even touch a few nerve endings in the process. One can hardly ask for more.\"--Col John G. Thompson, USAWC",
        "Category": " Social Science , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Fodor's Around London with Kids, 1st Edition: 68 Great Things to Do Together (Travel Guide)",
        "Authors": "By Lehman, Andrea (EDT) and Brown, Jacqueline",
        "Description": "For this smart, cheerful little book, Fodor's parent-experts have hand-picked 68 terrific things to do around London with a child in tow from the London Zoo the Sherlock Holmes Museum. Written by parents who live in London, this book is smart about what kids like and about what parents need. It includes all the details for planning (addresses, phone numbers, admission prices, and age-appropriateness); \"Hey Kids!\" info boxes filled with fun facts; ideas for places to grab a bite to eat nearby; and a cool \"Games\" section that will keep everyone happily occupied while waiting in line. Designed to lure even the crankiest young tourists to sites of interest...with a nod toward grown-up sensibilities, too.\" -- Good Housekeeping",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Thirty Days: An Inside Account of Tony Blair at War",
        "Authors": "By Stothard, Peter",
        "Description": "For thirty days I was close by him at historic events -- in the places where writers never are.Before Britain could help the United States in the war against Saddam Hussein, Tony Blair faced a battle against his own voters, his own party, and his own allies in Europe. These were among the most tense and tumultuous weeks the world had seen since the fall of the Berlin Wall.In thirty days, Blair took on his opponents and won.Through it all, Peter Stothard had unprecedented access to Blair -- from Ten Downing Street and the House of Commons through the war summits in the Azores, Brussels, Belfast, and at Camp David. Stothard brings us inside the corridors of power during this extraordinary time, offering a vivid, up-close view of an enormously popular leader facing the challenge of his life.",
        "Category": " History , Military , Nuclear Warfare",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Punch: One Night, Two Lives, and the Fight That Changed Basketball Forever",
        "Authors": "By Feinstein, John",
        "Description": "In an incisive look at the dark side of the NBA, the author of The Last Amateurs describes a 1977 brawl between the Houston Rockets and L.A. Lakers and its repercussions, especially for two players--Rudy Tomjanovich and Kermit Washington--in terms of such issues as race, violence in sports, and conspiracy. 175,000 first printing.",
        "Category": " Sports & Recreation , History",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Clover",
        "Authors": "By Sanders, Dori",
        "Description": "\"Warmly engrossing...Sanders writes with wit and authority in this unusual gem of a love story.\"CHICAGO TRIBUNEClover is a 10-year old black girl from a small town in South Carolina, whose life changes forever when her father dies and she is forced to forge a new relationship with the white stepmother she hardly knows. A beautiful, trenchant story of family lost and found, CLOVER is a unque and heartfelt reading experience for all ages.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Daughters of the Earth: The Lives and Legends of American Indian Women",
        "Authors": "By Niethammer, Carolyn",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner Paper Fiction",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "Aeneid of Virgil",
        "Authors": "By Humphries, Rolfe",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner Paper Fiction",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Your Seven-Year-Old: Life in a Minor Key",
        "Authors": "By Ames, Louise Bates and Haber, Carol Chase",
        "Description": "Your Seven-Year-Old is devoted to the delightful but often anxious and withdrawn child of Seven. Although any seven-year-old will have moments of exuberance, security, and happiness, in general this is an age of introspection. As it begins, parents and teachers may welcome the quiet after the tussles and tangles of Six. But once the child of Seven starts to withdraw it’s almost as though he doesn't know where or when to stop. Seven-year-olds feel picked on by family, friends, and teachers alike; they worry that no one likes them; they expect every little task to prove too difficult to handle; tears come easily at this age.   With wit and wisdom, Dr. Ames of the highly respected Gesell Institute and Carol Chase Haber offer insights into what children this age are feeling and thinking, and how parents can best deal with these moody, serious Sevens.   Included in this book: • New body awareness • Sulking • Concerns about fairness • Stories from real life • Fascination with horror, gore • Threats of running away from home • Life in the second grade • Books for Sevens and the parents of Sevens   “Louise Bates Ames and her colleagues synthesize a lifetime of observation of children, consultation, and discussion with parents. These books will help parents to better understand their children and will guide them through the fascinating and sometimes trying experiences of modern parenthood.”—Donald J. Cohen, M.D., Director, Yale Child Study Center, Irving B. Harris Professor of Child Psychiatry, Pediatrics, and Psychology, Yale School of Medicine",
        "Category": " Family & Relationships , Life Stages , School Age",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Self Esteem a Family Affair",
        "Authors": "By Clarke, Jean Illsley",
        "Description": "Viewing self-esteem as a fundamental human need and emphasizing the importance of parenting, the author provides exercises, activities, and strategies based on transactional analysis for fostering healthy emotional growth in children and developing self-esteem in both parent and child",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harper San Francisco",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "Taking Charge of Arthritis",
        "Authors": "By Katzenstein, Larry",
        "Description": "Drawing on the latest medical research, a timely handbook offers practical advice and effective techniques designed to help readers manage their arthritis and control its painful and debilitating side effects, describing the different types of arthritis, various conventional and alternative therapeutic options, exercise programs and nutritional aids, and more.",
        "Category": " Health & Fitness , Diseases , Nervous System (incl. Brain)",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Beethoven or Bust: A Practical Guide to Understanding and Listening to Great Music",
        "Authors": "By Hurwitz, David",
        "Description": "Offers an accessible introduction to classical music for those with little or no musical training and suggests \"listening groups\" of compositions to build musical comprehension",
        "Category": " Music , Reference",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Locked in the Cabinet",
        "Authors": "By Reich, Robert B.",
        "Description": "Locked in the Cabinet is a close-up view of the way things work, and often don't work, at the highest levels of government - and a uniquely personal account by the man whose ideas inspired and animated much of the Clinton campaign of 1992 and who became the cabinet officer in charge of helping ordinary Americans get better jobs. Robert B. Reich, writer, teacher, social critic - and a friend of the Clintons since they were all in their twenties - came to be known as the \"conscience\" of the Clinton administration and one of the most successful Labor Secretaries in history. Here is his sometimes hilarious, sometimes poignant chronicle of trying to put ideas and ideals into practice.With wit, passion, and dead-aim honesty, Reich writes of those in Washington who possess hard heads and soft hearts, and those with exactly the opposite attributes. He introduces us to the career bureaucrats who make Washington run and the politicians who, on occasion, make it stop; to business tycoons and labor leaders who clash by day and party together by night; to a president who wants to change America and his opponents (on both the left and the right) who want to keep it as it is or return it to where it used to be. Reich guides us to the pinnacles of power and pretension, as bills are passed or stalled, reputations built or destroyed, secrets leaked, numbers fudged, egos bruised, news stories spun, hypocrisies exposed, and good intentions occasionally derailed. And to the places across America where those who are the objects of this drama are simply trying to get by - assembly lines, sweatshops, union halls, the main streets of small towns and the tough streets of central cities.Locked in the Cabinet is an intimate odyssey involving a memorable cast - a friend who is elected President of the United States, only to discover the limits of power; Alan Greenspan, who is the most powerful man in America; and Newt Gingrich, who tries to be. Plus a host of others: White House staffers and cabinet members who can't find \"the loop\"; political consultant Dick Morris, who becomes \"the loop\"; baseball players and owners who can't agree on how to divide up $2 billion a year; a union leader who accuses Reich of not knowing what a screwdriver looks like; a heretofore invisible civil servant deep in the Labor Department whose brainchild becomes the law of the land; and a wondrous collection of senators, foreign ministers, cabinet officers, and television celebrities. And it is also an odyssey for Reich's wife and two young sons, who learn to tolerate their own cabinet member but not to abide Washington.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Open House: A Home Inspection Guide for Buyers & Sellers",
        "Authors": "By Trandem, Bryan",
        "Description": "",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "25 Bicycle Tours in and Around Washington, D.C.: From the Capitol Steps to Country Roads",
        "Authors": "By Oman, Anne H.",
        "Description": "Describes the distance, road conditions, terrain, and highlights for each route",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Countryman Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Last Citadel: A Novel of the Battle of Kursk",
        "Authors": "By Robbins, David L.",
        "Description": "Spring 1943. In the west, Germany strengthens its choke hold on France. To the south an Allied invasion looms imminent. But the greatest threat to Hitler's dream of a Thousand Year Reich lies east, where his forces are pitted in a death match with a Russian enemy willing to pay any price to defend the motherland. Hitler rolls the dice, hurling his best SS forces and his fearsome new weapon, the Mark VI Tiger tank, in a last-ditch summer offensive, code-named Citadel.The Red Army around Kursk is a sprawling array of infantry, armor, fighter planes, and bombers. Among them is an intrepid group of women flying antiquated biplanes; they swoop over the Germans in the dark, earning their nickname, \"Night Witches.\" On the ground, private Dimitri Berko gallops his tank, the Red Army's lithe little T-34, like a Cossack steed. In the turret above Dimitri rides his son, Valya, a Communist sergeant who issues his father orders while the war widens the gulf between them. In the skies, Dimitri's daughter, Katya, flies with the Night Witches, until she joins a ferocious band of partisans in the forests around Kursk. Like Russia itself, the Berko family is suffering the fury and devastation of history's most titanic tank battle while fighting to preserve what is sacred - their land, their lives, and each other - as Hitler flings against them his most potent armed force.Inexorable and devastating, a company of Mark VI Tiger tanks is commanded by one extraordinary SS officer, a Spaniard known as la Daga, the Dagger. He'd suffered a terrible wound at the hands of the Russians: now he has returned with a cold fury to exact his revenge. And above it all, one quiet man makes his own plan to bring Citadel crashing down and reshape the fate of the world.",
        "Category": " Fiction , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    }
]