[
    {
        "Title": "Lee and Jackson",
        "Authors": "By Casdorph, Paul D.",
        "Description": "Describes how the collaboration between Jackson and Lee allowed them to route numerically superior Union forces",
        "Category": " History , General",
        "Publisher": "Laurel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Living Thankfully The Christian and the Sacraments",
        "Authors": "By Harold R. Landon",
        "Description": "",
        "Category": "",
        "Publisher": "Seabury",
        "Price Starting With ($)": "7.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Holiday Pumpkins",
        "Authors": "By Brennan, Georgeanne",
        "Description": "Shares recipes for soups, stews, salads, side dishes, and desserts featuring pumpkin, and offers advice on making pumpkin decorations",
        "Category": " Cooking , Holiday",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Still More Games Trainers Play",
        "Authors": "By Newstrom, John W. and Scannell, Edward E.",
        "Description": "Get any training session off the ground fast­­ or jump start one whenever it lags­­ with the more than 400 proven activities in the bestselling Games Trainers Play series. Their names may range from \"Tombstone Planning\" to \"The 'Nobel' Prize Winner,\" but these brilliantly offbeat, unexpected, disarming, fully reproducible games have one serious mission: to coax even the most reluctant groups to talk, laugh, think, and work together.Page after page of fun, easy-to-plan tear-out exercises help you:Break the ice and get participants acquaintedShake up outworn habits and perceptionsChallenge with thought-provoking brainteasersTest learning and retentionDevelop communication and listening skillsBring out and involve participant-leadersWin back lethargic, distracted, low-energy groupsEncourage creative problem-solving;Boost or reinforce a group's self-imageForge cohesive work teams that value group effortFacilitate transfer of training to the job",
        "Category": " Business & Economics , Training",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Happy Thanksgiving!: Things to Make and Do",
        "Authors": "By Conaway, Judith",
        "Description": "Provides instructions for making Indian cutouts, place mats, Indian cornbread, and other Thanksgiving decorations and foods, as well as descriptions of two games",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Frog Power (The Cul-de-Sac Kids, No. 5)",
        "Authors": "By Lewis, Beverly and Birch, Barbara (ILT)",
        "Description": "The inclusion of Jason's frog Croaker in the Easter pet parade she is planning challenges Stacy's fear of frogs",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Sea Turtles Hatching",
        "Authors": "By Orr, Katherine (NA)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Animals , Reptiles & Amphibians",
        "Publisher": "Windward Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Complete Love's Little Instruction Book: Romantic Hints for Lovers of All Ages",
        "Authors": "By Pigeon, Annie",
        "Description": "Two volumes in one! A touching and humorous collection of little instructions for loving couples. Spark some romance and keep your love alive through simple everyday actions that show how much you care:Take a hayride Tell her \"You look even prettier without makeup\" Call him your RomeoBe impractical sometimes Be extravagant sometimesBe spontaneous often Show some understanding Butter his croissant Buy her a bonsai Volunteer to do a hated chore",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "6.26",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Hawaii's Fishes : A Guide for Snorkelers and Divers",
        "Authors": "By Hoover, John P.",
        "Description": "",
        "Category": " Nature , Animals , Fish",
        "Publisher": "Mutual Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Pot Luck",
        "Authors": "By Mable Hoffman, Jan Robertson",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Truth and Error",
        "Authors": "By Gomes, Alan W. (EDT)",
        "Description": "This book is not only an introduction to the entire Zondervan Guide to Cults and Religious Movements series, but also a quick-reference guide to the groups and movements discussed in the series. Truth and Error brings together in one volume the charts from the various guides that show how the groups and movements differ theologically from historic orthodox Christianity. Each chart is introduced by the general editor, Alan Gomes. The books in the series that do not have comparison charts are introduced and summarized. Each book in the series includes - A concise introduction to the group or topic - An overview of the group's or movement's theology -- in their own words - A biblical response - Tips for witnessing effectively to members of the group - A bibliography with sources for further study -- Most books also include a comparison chart that shows the essential differences between biblical Christianity and the group. The charts from these books are reproduced in Truth & Error.",
        "Category": " Religion , Comparative Religion",
        "Publisher": "Zondervan Academic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Selling Swimsuits in the Arctic: Seven Simple Keys to Growing Churches",
        "Authors": "By Hamilton, Adam and Gadsden, Cynthia",
        "Description": "The pastor of one of today’s most dynamic churches illumines the basic principles of attracting the unchurched to the Christian message.Using the story of Bob, a successful swimsuit salesman whose business takes a turn for the worse when he moves to Alaska, Adam Hamilton reminds us that all of life is about sales. Whether we are in a job interview, a candidates’ debate, or a classroom, we are selling something: our skills, our convictions, our selves. The same is true of presenting the gospel to the unchurched. In leading a friend to a saving relationship with Christ, in inviting them to join us at church, we are presenting them with something that we believe they need, that will make all the difference in their life. Yet if we don’t understand what we are presenting, who we are presenting it to, if we don’t believe in the message we are offering, or if we don’t believe that people need that message more than anything else, then we will not be faithful witnesses to it. In short, says Hamilton, if we don’t understand some of the most basic principles that all successful salespersons know, then we will not succeed in presenting the message of Christ to those who most need to hear it. By telling the humorous and quirky story of Bob trying to sell swimsuits in the Arctic, Hamilton explains the fundamental concepts of sales that also apply in how we spread the gospel message. Drawing on his experience as the leader of one of the country’s fastest-growing churches, he offers pastors and other Christian leaders solid, simple guidance on how to share the faith, and grow one’s congregation.",
        "Category": " Religion , Christian Ministry , Evangelism",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Spirits in the Wires",
        "Authors": "By De Lint, Charles",
        "Description": "Charles de Lint's Newford novels, loosely linked \"tales\" with overlapping characters set in an imaginary modern North American city, are tales of magic and myth afoot on today's city streets. But at the center of every de Lint story is the miracle of the human heart.And at the heart of Spirits in the Wires are Saskia Madding and Christiana Tree, both of whom are tied to perennial Newford character, the writer Christy Riddell. Are either Saskia or Christiana real?  Christy's girlfriend, Saskia, believes she was born in a Web site, while Christiana is Christy's \"shadow-self\"--all the parts of him that he cast out when he was seven years old. At a popular Newford on-line research and library Web site called the Wordwood, a mysterious \"crash\" occurs. Everyone visiting the site at the moment of the crash vanishes from where they were sitting in front of their computers. Saskia disappears right before Christy's eyes, along with countless others.Now Christy and his companions must journey into Newford's otherworld, where the Wordwood, it transpires, has a physical presence of its own...to rescue their missing friends and loved ones and to set this viral spirit right before it causes further harm. Charles de Lint's Newford novels, loosely linked \"tales\" with overlapping characters set in an imaginary modern North American city, are tales of magic and myth afoot on today's city streets. But at the center of every de Lint story is the miracle of the human heart.And at the heart of Spirits in the Wires are Saskia Madding and Christiana Tree, both of whom are tied to perennial Newford character, the writer Christy Riddell. Are either Saskia or Christiana real?  Christy's girlfriend, Saskia, believes she was born in a Web site, while Christiana is Christy's \"shadow-self\"--all the parts of him that he cast out when he was seven years old. At a popular Newford on-line research and library Web site called the Wordwood, a mysterious \"crash\" occurs. Everyone visiting the site at the moment of the crash vanishes from where they were sitting in front of their computers. Saskia disappears right before Christy's eyes, along with countless others.Now Christy and his companions must journey into Newford's otherworld, where the Wordwood, it transpires, has a physical presence of its own...to rescue their missing friends and loved ones and to set this viral spirit right before it causes further harm.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "How Far from Austerlitz?: Napoleon 1805-1815",
        "Authors": "By Horne, Alistair",
        "Description": "A London Sunday Times Book of the YearA Daily Telegraph Book of the YearThe Battle of Austerlitz was Napoleon's greatest victory, the culmination of one of the greatest military campaigns of all time. It was also the last battle the \"Father of Modern Warfare\" would leave in absolute triumph, for, though he did not know it, Austerlitz marked the beginning of Napoleon's downfall. His triumph was too complete and his conquest too brutal to last. Like Hitler, he came to believe he was invincible, that no force could halt his bloody march across Europe. Like Hitler, he paid dearly for his hubris, climaxing in bitter defeat at Waterloo in 1815. In a matter of years, he had fallen from grace. Alistair Horne explores the theme of military success and failure inHow Far From Austerlitz? He chronicles Napoleon's rise and fall, drawing parallels with other great leaders of the modern era.",
        "Category": " History , Europe , France",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Frommer's Moscow & St. Petersburg (Frommer's Complete Guides)",
        "Authors": "By Charlton, Angela",
        "Description": "Savvy insider tips on exploring the treasures of the Hermitage Museum and the Kremlin.Outspoken opinions on what's worth your time and what's not.Exact prices, so you can plan the perfect trip whatever your budget.Off-the-beaten-path experiences and undiscovered gems, plus new takes on top attractions.Find great deals and book your trip at Frommers.com",
        "Category": " Travel , Russia",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Frommer's Vienna and the Danube Valley (Frommer's Complete Guides)",
        "Authors": "By Porter, Darwin",
        "Description": "You'll never fall into tourist traps when you travel with Frommer's. It's like having a friend show you around, taking you to the places locals like best. Our expert authors have already gone everywhere you might go— they've done the legwork for you, and they're not afraid to tell it like it is, saving you time and money. No other series offers candid reviews of so many hotels and restaurants in all price ranges. Every Frommer's Travel Guide is up-to-date, with exact prices for everything, dozens of color maps, and exciting coverage of sports, shopping, and nightlife. You'd be lost without us!City of music, cafes, waltzes, parks, pastries, and baroque architecture, Vienna became a showplace city under the Hapsburgs— and unlike many European capitals, managed to retain its landmarks through two world wars. Frommer's offers detailed, complete coverage of all the highlights. Rely on us for indepth reviews of attractions and museums, the best accommodations for every taste and budget, the lowdown on the dining and cafe scene, a complete shopper's guide, the best of the performing arts, and more— including side trips to nearby Danube River towns and Lake Neusiedl resorts.If you're combining your visit to Vienna with a trip to Prague or Budapest (both are just a short train ride away), check out some of Frommer's other helpful guides for your trip, such as Frommer's Prague & the Best of the Czech Republic and Frommer's Budapest & the Best of Hungary. For a book on more of Austria then \"just\" Vienna and the Danube Valley, see Frommer's Austria.",
        "Category": " Travel , Europe , Austria",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Lands and Peoples of the Living Bible: A Narrative History of the Old and New Testaments",
        "Authors": "By Youngman, Bernard",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Transformed In His Presence: The Need For Prayer In Counseling",
        "Authors": "By Peugh, Roger and Schulz, Tammy",
        "Description": "This stimulating guide fills a gap in the training and practice of Christian counselors. Each chapter uses Scripture to teach topics relevant to caregivers: the essence of prayer, counseling, suffering, waiting, burnout, the need for supportive friends, and a vision for renewal. The authors have a combination of more than 50 years of counseling, pastoral experience, and working in mental health settings.",
        "Category": " Religion , Christian Ministry , Counseling & Recovery",
        "Publisher": "BMH Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "First Impressions: Creating Wow Experiences In Your Church",
        "Authors": "By Waltz, Mark L.",
        "Description": "Before a service even begins, first-time guests usually decide whether they'll return to your church. This means church leaders need to create no-fail; practical ways to ensure a visitor's first impression is the best impression. Author Mark Waltz shares the strategies that work in his church--and takes \"greeting\" to a whole new level.When guests feel valued, they will return. And when they do, they'll have the opportunity to experience Jesus' love. Let visitors know \"You matter to God, so you matter to us.\"Adapt these practical ideas to your church's unique setting, and it won't be long before everyone feels welcome:    Learn how to create a church that's welcoming to guests with strategies on:— developing senior leadership— traffic flow— the walk to the door— to shake hands or not?— directional signs or people?    Address the philosophy, strategy and implementation of a ministry that welcomes first-time and returning guests.    Gain sure-fire, practical ways to make the first impression the best impression.",
        "Category": " Religion , Christian Church , Growth",
        "Publisher": "Group Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "365 Things to Make and Do",
        "Authors": "By Bolton, Vivienne",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Terps National Champions",
        "Authors": "By Sports Publishing Inc",
        "Description": "In the tradition of similar instant books celebrating the achievements of championship teams and individuals, including Dallas Stars: '99 NHL Champs with the Dallas Morning News and One Shining Season with The Lansing State Journal, Sports Publishing presents the first title available on the market to salute the champions of the 2002 NCAA Men's Basketball Tournament. The book promises to tell the complete story of the team's winning season through articles, columns, and photos that first appeared in the pages of the major daily newspaper in the team's city. Sports Publishing's tribute to the NCAA Men's Basketball Tournament champions will prove to be a cherished keepsake for all fans of the team who will be celebrating the victory well into the year.",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "Sports Publishing LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "How to Form Your Own Corporation Without a Lawyer for Under $ 50.00",
        "Authors": "By Ted Nicholas",
        "Description": "",
        "Category": "",
        "Publisher": "Enterprise Publishing Co Inc",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Keeping Cats",
        "Authors": "By Schmitt-Hausser, Gerd",
        "Description": "",
        "Category": " Pets , Cats , General",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "How to Do Bible Learning Activities Grades 7-12 Book 1",
        "Authors": "By Stewart, Ed, McBride, Neal, and Bundschuh (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "Gospel Light Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Travelers' Tales France",
        "Authors": "By Habegger, Larry (EDT), O'Reilly, James (EDT), Habegger, Larry, O'Reilly, James, and O'Reilly, Sean (EDT)",
        "Description": "",
        "Category": " Travel , Europe , France",
        "Publisher": "Travelers' Tales Inc",
        "Price Starting With ($)": "5.65",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Footprints: Walking through the passages of life",
        "Authors": "By Hendricks, Howard G",
        "Description": "",
        "Category": "",
        "Publisher": "Multnomah Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Lonely Planet Spain (Country Guide)",
        "Authors": "By Simonis, Damien",
        "Description": "Complemented by easy-to use, reliable maps, helpful recommendations, authoritative background information, and up-to-date coverage of things to see and do, these popular travel guides cover in detail countries, regions, and cities around the world for travelers of every budget, along with extensive itineraries, maps with cross-referencing to the text, \"Top 10\" and \"Top 5\" lists, and other practical features.",
        "Category": " Travel , Europe , Spain & Portugal",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Berlitz Italian Phrase Book and Dictionary",
        "Authors": "By Berlitz",
        "Description": "",
        "Category": " Foreign Language Study , Italian",
        "Publisher": "Berlitz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Damascened Blade (Joel Gustafsson Series)",
        "Authors": "By Cleverly, Barbara",
        "Description": "In her acclaimed mysteries set in the age of the British Raj, Barbara Cleverly brilliantly captures a fascinating collision of cultures against a backdrop of jasmine-scented nights and neatly trimmed English gardens. In her gripping new novel, the author of The Last Kashmiri Rose and Ragtime in Simla transports us to the remote and exotic setting of India’s North-West Frontier, where a group of travelers is swept into a spellbinding drama of kidnapping, vengeance, and murder.Scotland Yard Detective Joe Sandilands has been given the unenviable mission of guarding a spirited young American woman with far more wealth than sense. Lily Coblenz, accompanied by a cunning businessman, a woman doctor, and two quarreling military strategists, expects the adventure of a lifetime when she arrives at a remote British outpost. But when the son of a Pathan tribal leader is discovered dead, Sandilands, a decorated war veteran, knows that his mission to protect Lily has suddenly taken a startling new turn that may bring them all to the brink of war. Now, from the far reaches of an empire, Joe Sandilands must separate lies from truths, innocents from killers—and find the one person with a desperate motive for murder and the key to India’s destiny.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Contagious Joy: Joyful Devotions to Lift Your Spirits",
        "Authors": "By Clairmont, Patsy (EDT)",
        "Description": "The demands of everyday life can be wearing for a woman.  We need a shot in the arm--an injection of JOY!  Joy that refuses to stay quarantined.  Joy that runs rampant through the daily-ness of existence.  Like engaging smiles and hearty laughter, joy is contagious.  We catch it from one another, especially the best-selling authors and speakers on the Women of Faith core team.Lighthearted and inspirational, this collection of brand new devotions captures the warmth and wisdom women have come to expect from Women of Faith. A wonderful gift for any woman at any time  especially if she's a little short on joy.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Your Anxious Child: How Parents and Teachers Can Relieve Anxiety in Children",
        "Authors": "By Dacey, John S. and Fiore, Lisa B.",
        "Description": "Katie freezes when she's asked to perform. Jose is a clinger. Damian is terrified of animals. Felicia always worries that she's going to make a mistake. It's hard being the parent of an anxious child, watching your son's frustration grow, or seeing how your daughter tries to cope with her fears but gives up so quickly. Filled with solid information, a proven four-step program, dozens of engaging activities, and insightful personal vignettes, Your Anxious Child gives you easy, fun, and highly effective tools to help your child become a creative problem solver. Parents and teachers alike will find excellent strategies in this essential guide.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Manual of Marine Invertebrates",
        "Authors": "By Haywood, Martyn and Wells, Sue",
        "Description": "",
        "Category": " Nature , Animals , Marine Life",
        "Publisher": "Tetra Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Robert's Rules",
        "Authors": "By Sylvester, Nancy",
        "Description": "The authority on how to effectively run a meeting.  Perfect for the new president of a small group or the chairman of a large formal meeting, this guide explains everything from the ladder of motions to how to use Robert's Rules for any size or type of meeting. Expert parliamentarian Nancy Sylvester helps tailor the most popular form of parliamentary procedure today to meet any organization's needs.  ? Approximately 95% of all clubs, organizations, and governments use Robert's Rules of Order as their authority ? Author is one of the few certified parliamentary experts in the country ? Includes sample minutes, a sample agenda, and a full version of Robert's Rules for reference",
        "Category": " Reference , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Gardens for Small Country Houses",
        "Authors": "By Saville, Diana",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Cat (Eyewitness)",
        "Authors": "By Clutton-Brock, Juliet",
        "Description": "Full-color photos. Take a look at the evolution, anatomy, and behavior of those fabulous felines--how they were revered by the ancient Egyptians and then reviled during the Middle Ages, why they nearly always land on their feet when they fall, and how the most cuddly house cat resembles its fiercest wild relative.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Grilling Book",
        "Authors": "By A Cort Sinnes",
        "Description": "",
        "Category": "",
        "Publisher": "Aris Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Time and Tide",
        "Authors": "By O'Brien, Edna",
        "Description": "In her rebellion against the tyranny of her husband, Nell leaves her family to search for love and adventure, while her separation from her husband becomes a battle that eventually pulls her two beloved sons away from her. Reprint.",
        "Category": " Fiction , Literary",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Complete Step-By-Step Cookbook More Than 800 Recipes in Full Color",
        "Authors": "By Walden, Hilaire",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Salamander Books Ltd",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Great Pasta Cookbook",
        "Authors": "By Ferguson, Judith",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "Quadrillion Pub",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Garden Book an Essential Guide to Gardening",
        "Authors": "By Buczacki, Stefan",
        "Description": "",
        "Category": "",
        "Publisher": "HAMLYN PUBL GROUP LTD ENGLAND",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Skyward: Why Flyers Fly",
        "Authors": "By Munson, Russell",
        "Description": "Photographs show pilots and their planes, aircraft in flight, and aerial views, and are accompanied by the comments of professional and amateur pilots",
        "Category": " Photography , General",
        "Publisher": "Howell Pr",
        "Price Starting With ($)": "6.81",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Washington DC ABC's",
        "Authors": "By Barnes, Peter W., Golembe, Carla (ILT), Barnes, Cheryl, Golembe, Carla, Morrison, Catherine, and Cohn, David",
        "Description": "Suggests words and phrases characteristic of Washington, D.C., for each letter of the alphabet, from the National Archives and Arlington National Cemetery to the National Zoo.",
        "Category": " Juvenile Nonfiction , Art , History",
        "Publisher": "VSP Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Dog and Puppies (100 Things You Should Know About Series)",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Miles Kelly Publishing Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Terrorism and War (Open Media Series)",
        "Authors": "By Arnove, Anthony and Zinn, Howard",
        "Description": "Truth—as Zinn shows us in the interviews that make up Terrorism and War—has indeed been the first casualty of war, starting from the beginnings of American empire in the Spanish-American War. But war has many other casualties, he argues, including civil liberties on the home front and human rights abroad. In Terrorism and War, Zinn explores the growth of the American empire, as well as the long tradition of resistance in this country to U.S. militarism, from Eugene Debs and the Socialist Party during World War One to the opponents of U.S. military intervention in Afghanistan today.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Prevention's Low-Fat Italian Favorites",
        "Authors": "By Rogers, Jean (EDT) and Prevention Magazine Health Books (COR)",
        "Description": "Gathers healthful recipes for low-fat Italian fare, including appetizers, soups, salads, vegetables, meat, poultry, seafood, breads, and desserts",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Legends of Power",
        "Authors": "By Sharkey, Andrea",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "1st Book Library",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Tropical Trees of Hawaii",
        "Authors": "By Dahlquist, Ron (PHT) and Wood, Paul",
        "Description": "",
        "Category": " Nature , Plants , Trees",
        "Publisher": "Island Heritage Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Traveling With Your Pet",
        "Authors": "By AAA (COR) and Weekes, Greg (EDT)",
        "Description": "Offers tips on traveling with pets and describes accommodations and attractions that welcome dogs and cats",
        "Category": " Pets , General",
        "Publisher": "AAA",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Mr. Food Cool Cravings: Easy Chilled and Frozen Desserts",
        "Authors": "By Ginsburg, Art",
        "Description": "You know how it is when you've got a craving for a sweet, chilled dessert? Well, Mr. Food has just what you're looking for with more than 150 easy recipes for refrigerated and frozen goodies. With delicious treats like Cappuccino Custard Pie, Pecan Ice Cream Crepes, and Raspberry Baked Apples, there's something for everyone! There are chapters of cakes, pies, puddings and gelatins, trifles and parfaits, fruit desserts, frozen novelties, ice creams, and even a whole chapter of \"Treats by the Calendar\" that includes Easter Bunny Cake and Halloween Pumpkin Cake. Sinful sensations like Cherries Jubilee Parfaits, Dreamy Mocha Cream Pie, and Banana Split Bombe will keep you coming back for more. And don't worry - Mr. Food wouldn't leave out the cheesecake! He's got a whole chapter of recipes for those, too. White Chocolate Macadamia Cheesecake, German Black Bottom Cheesecake, and even Low-Fat Strawberry Cheesecake are out of this world. Of course, there's White Russian Sauce plus other incredible dessert sauces to top all your favorites.",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Insight Guide New York State (Insight Guides)",
        "Authors": "By Dailey, Donna",
        "Description": "",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Insight Guides",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Intervention (Intervention Series, Book 1)",
        "Authors": "By Blackstock, Terri",
        "Description": "Barbara Covington has one more chance to save her daughter from a devastating addiction, by staging an intervention. But when eighteen-year-old Emily disappears on the way to drug treatment—and her interventionist is found dead at the airport—Barbara enters her darkest nightmare of all. Barbara and her son set out to find Emily before Detective Kent Harlan arrests her for a crime he is sure she committed. Fearing for Emily’s life, Barbara maintains her daughter’s innocence. But does she really know her anymore? Meanwhile, Kent has questions of his own. His gut tells him that this is a case of an addict killing for drugs, but as he gets to know Barbara, he begins to hope he’s wrong about Emily. The panic level rises as the mysteries intensify: Did Emily’s obsession with drugs lead her to commit murder—or is she another victim of a cold-blooded killer?",
        "Category": " Fiction , Christian , Suspense",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Kaline Klattermaster's Tree House",
        "Authors": "By Kimmel, Haven and Brown, Peter (ILT)",
        "Description": "Kaline Klattermaster LOVES his mom. ADORES his mom. But his mom can be, well, a bit forgetful sometimes. A bit lax. A bit...CRAZY. For instance, she's a bit crazy when she leaves him in the tub for THREE HOURS. Or gives him a chicken leg for breakfast...or forgets that he needs to go to school. AND he's not completely sure his mother understands how time works. She's been even a bit MORE CRAZY since his dad left. So it's a very good thing that the folks in Kaline's tree house are not so crazy. They understand him. They don't mind that he sometimes HAS to play his pretend bugle, and, of course, they are FULL of good advice on how to handle bullies. His mom hints that the tree house is imaginary. Kaline is UNCONVINCED. The New York Times bestsellingauthor of A Girl Named Zippy is delightedto introduce Kaline Klattermaster, a little boy who understands the importance of a few good friends -- make-believe OR otherwise.",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Flowers and Plants of Hawaii: Pocket Guide Series",
        "Authors": "By Paul Wood",
        "Description": "",
        "Category": " Nature , Flowers",
        "Publisher": "Island Heritage Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Break Any Woman Down",
        "Authors": "By Johnson, Dana",
        "Description": "In this hip, vital, and sexy debut, winner of the 2001 Flannery O’Connor Award for Short Fiction, Dana Johnson launches a fleet of wonderful stories across unexpected terrain, upending notions of race, class and gender in utterly original ways.  An eleven-year-old black girl from South Central LA discovers the strangeness of moving to the suburbs and falling in love with a white boy.  A pair of enthusiastic middle-aged Iranian sisters debate whether or not their futures hold children. A punk musician falls for a girl out of his league.  A black lap dancer gives up her job to move in with her Greek actor boyfriend, who hasn’t managed to get roles in anything but porn movies.   Whether bold or rueful, salacious or sweet,  each voice in Break Any Woman Down is vibrantly authentic; together they add a fresh and welcome chorus to American literature.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "One Fine Day",
        "Authors": "By Hogrogian, Nonny",
        "Description": "This humorous retelling of a favorite Armenian folktale is a story small children will follow and read along with ease.“One fine day a fox traveled through the great forest. When he reached the other side he was very thirsty.” The jaunty red fox stole milk from an old farm woman, lost his tail under the annoyed woman’s knife, and spent the day bargaining to get it back. Awarded the Caldecott Medal for the most distinguished picture book of 1971.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1974"
        }
    },
    {
        "Title": "Who Was King Tut?",
        "Authors": "By Edwards, Roberta and Kelley, True (ILT)",
        "Description": "Ever since Howard Carter uncovered King Tutankhamun’s tomb in 1922, the young pharaoh has become a symbol of the wealth and mystery of ancient Egypt. Now, a two-and-a-half-year-long museum exhibit of Tut’s treasures is touring major cities in the U.S., drawing record crowds. This Who Was . . . ? is complete with 100 black-andwhite illustrations and explains the life and times of this ancient Egyptian ruler, covering the story of the tomb’s discovery, as well as myths and so-called mummy curses.",
        "Category": " Juvenile Nonfiction , History , Ancient",
        "Publisher": "Penguin Workshop",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Intrepid Canadian Expedition (Flat Stanley's Worldwide Adventures #4)",
        "Authors": "By Pamintuan, Macky (ILT), Pennypacker, Sara, and Brown, Jeff (CRT)",
        "Description": "There’s no place on Earth a flat kid can’t go! Join Stanley on his exciting fourth adventure in the renowned Flat Stanley's Worldwide Adventures series!Stanley Lambchop and his family are in British Columbia, Canada, for some skiing and winter fun. But when Stanley and his new friend Nick go snowboarding—with Stanley as the snowboard, of course—they take a midair tumble just as the wind picks up . . . and find themselves floating in an amazing Canadian cross-country journey that might just be Stanley's wildest adventure yet!Don’t miss all of Flat Stanley’s worldwide adventures in this chapter book series!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Frommer's Walking Tours: New York (Frommer's 24 Great Walks in New York)",
        "Authors": "By Bulkin, Rena",
        "Description": "Suggestions for excursions to notable city sites include Chinatown, the Upper East Side, Greenwich Village, and the New York Stock Exchange",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Frommer",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "A Prairie Christmas Collection: 9 Historical Christmas Romances from America's Great Plains",
        "Authors": "By Griffin, Pamela, Mindrup, Darlene, Peterson, Tracie, Bateman, Tracey, Spaeth, Janet, Grote, Joann A., Raney, Deborah, Stengl, Jill, and Langer, Maryn",
        "Description": "Experience Christmas on the historical American Great Plains as retold by nine different multi-published authors, including Tracie Peterson and Deborah Raney. Follow pioneers, immigrants, and orphans through their adventures, heartaches, challenges, victories, and romances. You are sure to find more than one favorite among the nine holiday romances in this unique collection to warm your heart and inspire your faith.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Art of Winning Conversation: Proven Communication Techniques for Personal and Professional Success",
        "Authors": "By Stettner, Morey",
        "Description": "",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Dollhouse Fun!",
        "Authors": "By Judith Conaway",
        "Description": "",
        "Category": "",
        "Publisher": "Troll Associates",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The church of our fathers,",
        "Authors": "By Bainton, Roland Herbert",
        "Description": "",
        "Category": "",
        "Publisher": "C. Scribner's Sons",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1941"
        }
    },
    {
        "Title": "Greatest Ever Baking",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Paragon Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Bridge of Peace (Ada's House, Book 2)",
        "Authors": "By Woodsmall, Cindy",
        "Description": "Love alone isn’t enough to overcome some obstacles. Lena Kauffman is a young Old Order Amish schoolteacher who has dealt all her life with attention raised by a noticeable birthmark on her cheek. Having learned to move past the stares and whispers, Lena channels her zest for living into her love of teaching. But tensions mount as she is challenged to work with a rebellious young man and deal with several crises at the schoolhouse that threaten her other students. Her lack of submission and use of ideas that don’t line up with the Old Ways strengthen the school board’s case as they begin to believe that Lena is behind all the trouble.One member of the school board, Grey Graber, feels trapped by his own stifling circumstances. His wife, Elsie, has shut him out of her life, and he doesn’t know how long he can continue to live as if nothing is wrong. As the two finally come to a place of working toward a better marriage, tragedy befalls their family. Lena and Grey have been life-long friends, but their relationship begins to crumble amidst unsettling deceptions, propelling each of them to finally face their own secrets. Can they both find a way past their losses and discover the strength to build a new bridge?",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "WaterBrook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "The Burning Bush: Antisemitism and World History",
        "Authors": "By Barnet Litvinoff",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers Ltd",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Lydia's Charm: An Amish Widow Starts Over in Charm, Ohio",
        "Authors": "By Brunstetter, Wanda E.",
        "Description": "Visit Amish Country during the fall as Lydia King attempts to make Charm, Ohio, feel like home after losing her husband. But is her heart ready to open back up to love when gifts appear on her porch from a mystery source? Could it be from the widowed father of four energetic boys, or is it from the man who has rejected romance to be his family’s caregiver? When life hands Lydia another challenge, will the gift giver be there to support her?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Waiting: A Novel (Lancaster County Secrets)",
        "Authors": "By Fisher, Suzanne Woods",
        "Description": "Jorie King has been waiting for Benjamin Zook to return home to Lancaster County so they can marry. When news arrives that Ben has been killed, Jorie finds comfort in the friendship of his brother Caleb. That friendship ripens into love, and it seems that they are meant to be together. But when the unexpected happens, their worlds are turned upside down once more. Will Jorie trust God to lead her into the arms of a new man?A multifaceted story about complex people living the simple life, The Waiting is the second book in the LANCASTER COUNTY SECRETS series. Readers will find themselves transported into the world of the Amish and deeply invested in these wonderful characters.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Love Finds You Under the Mistletoe",
        "Authors": "By Higman, Anita and Brand, Irene",
        "Description": "",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Summerside Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Ice Cube is Melting: What is Really at Risk in United Methodism?",
        "Authors": "By Schaller, Lyle E. and Hamilton, Adam (FRW)",
        "Description": "Comparing current membership figures in The United Methodist Church with those from forty years ago, it would be easy to conclude that the United Methodist \"ice cube\" is melting. Any number of factors might account for this trend, but almost every observer would agree that what Lyle Schaller calls the \"contagious disease of intradenominational quarreling\" has played a large role. Schaller says that the day has arrived to focus on the cure to this disease. Recognizing that the most difficult step in this process will be to gain agreement on what are the non-negotiable issues in the disagreements that divide United Methodists, Schaller has recruited a number of individuals from around the denomination to comment on what is really \"at risk\" in The United Methodist Church. Only by undertaking the hard work of gaining agreement on what the real issues are that divide United Methodists, he says, will it be possible to hope for a way forward.",
        "Category": " Religion , Christianity , Methodist",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Risks of Sunbathing Topless: And Other Funny Stories from the Road",
        "Authors": "By Chynoweth, Kate (EDT)",
        "Description": "If they could do it all over again, they might not...so it's a good thing none of the women in this hilarious collection had the foresight to make good decisions during these travel experiences. If they had, we wouldn't hear the delicious details of how horribly wrong it all went. Like Marrit Ingman's disastrous honeymoon in Maui?and the repercussions of societal pressure for the perfect love escape in paradise. Or of how the entire kitchen of C. Lill Ahrens's new Seoul apartment is literally lost in translation. Or why Ayun Halliday would attempt to climb Mount Kilimanjaro, when her training consisted of drinking beer and rolling her own cigarettes, and her gear cost $14.99 at Sportmart. From Kandahar to Baja to Moscow, these wry, amusing stories capture the comic essence of bad travel, and of the female experience on the road.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Seal Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The New Beadwork",
        "Authors": "By Moss, Kathlyn, Scherer, Alice, and Elder, Tommy Olof (PHT)",
        "Description": "Beadwork, the last of the traditional crafts to be discovered by fine artists, has undergone a revolution in the past two decades. Creative men and women, interested in its unique qualities of color, light reflection, refraction, and texture, are exploring its rich possibilities for fine detail and spectacular pattern. Kathlyn Moss, an important beadwork artist, and Alice Scherer, founder and director of the Center for the Study of Beadwork in Portland, Oregon, provide a survey of the best recent work in the medium. Their choices range from traditional wall hangings and jewelry to highly original and experimental pieces, including narrative sculptures, game boards, vessels, installation pieces, and wearable art.Dozens of full-color illustrations, photographed especially for this volume, present work of remarkable scope and variety. They are accompanied by detailed commentaries, often in the words of the artists themselves. The introductory essay traces the history of modern beadwork and examines the relationship between the beadwork of traditional cultures and the innovative work being done today.The book offers a wealth of reference materials. One appendix details the history and manufacture worldwide of seed beads, the basic unit of beadwork, a second describes the principal techniques, with and without a bead loom. Clear, easy-to-follow diagrams, created especially for this volume, explain each technique. Additionally, the authors have assembled a glossary of important beadwork terms, a listing of recent exhibitions of beadwork, a selected bibliography, and listings of addresses for principal bead societies, research institutions, and suppliers. Thus the book is both a full-color presentation of the finest recent work in this burgeoning art form and an indispensable reference for the artist and collector.",
        "Category": " Crafts & Hobbies , Jewelry",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Qp Golf: Life On The Links",
        "Authors": "By Ariel Books",
        "Description": "The feel of the turf underfoot. The crack of the ball against wood. Golf fans treasure every moment on the course and will cherish this homage to their sport.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "If You Lived Here, You'd Be Home Now",
        "Authors": "By Lazebnik, Claire",
        "Description": "From the well-loved author of Knitting Under the Influence and The Smart One and the Pretty One comes a new novel about a young single mother trying to move out of her family's shadow.Rickie left home a long time ago-so how is it that at the age of twenty-five, she's living with her parents again, and sleeping in the bedroom of her childhood home? At least one thing has changed since high school: She now has a very sweet but frequently challenging son named Noah, who attends the same tony private LA school she herself attended. Rickie fit in fine when she was a student, but now her age and tattoos make her stand out from all the blond Stepford moms, who are desperate to know why someone so young-and so unmarried-has a kid in first grade.  Already on the defensive, Rickie goes into full mother-tigress mode when her small and unathletic son tells her that the gym teacher is out to get him. She storms the principal's office, only to discover that Andrew Fulton, the coach, is no dumb jock. As her friendship with Andrew develops, Rickie finds herself questioning her assumptions-about motherhood, being a grown-up, and falling in love.",
        "Category": " Fiction , Women",
        "Publisher": "5 Spot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Age of Longing, The",
        "Authors": "By Koestler, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "19.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "In His Steps \"What Would Jesus Do?\"",
        "Authors": "By Sheldon, Charles M.",
        "Description": "",
        "Category": "",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1899"
        }
    },
    {
        "Title": "In My Father's Vineyard",
        "Authors": "By Jacobsen, Wayne and Buchanan, Anne Christian",
        "Description": "Wayne Jacobean relates the imagery of his years of growing up on a vineyard in central California to the lessons Christians can learn from the biblical parallels of bearing fruit and remaining on the vine.",
        "Category": "",
        "Publisher": "Word Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Into the Woods, and Other Favorite Verses",
        "Authors": "By Daughters of St Paul",
        "Description": "",
        "Category": "",
        "Publisher": "St. Paul Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "In-a-Flash PSAT, 5E",
        "Authors": "By Hoyt, Cathy Fillmore and Tarbell, Shirley",
        "Description": "",
        "Category": " Study Aids , PSAT & NMSQT (National Merit Scholarship Qualifying Test)",
        "Publisher": "Petersons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Dressmaker: A Novel",
        "Authors": "By Graeme-Evans, Posie",
        "Description": "From international bestselling author Posie Graeme-Evans comes the passionate tale of a woman ahead of her time.   Ellen Gowan is the only surviving child of a scholarly village minister and a charming girl disowned by her family when she married for love. Growing up in rural Norfolk, Ellen’s childhood was poor but blessed with affection. Resilience, spirit, and one great talent will carry her far from such humble beginnings. In time, she will become the witty, celebrated, and very beautiful Madame Ellen, dressmaker to the nobility of England, the Great Six Hundred.   Yet Ellen has secrets. At fifteen she falls for Raoul de Valentin, the dangerous descendant of French aristocrats. Raoul marries Ellen for her brilliance as a designer but abandons his wife when she becomes pregnant. Determined that she and her daughter will survive, Ellen begins her long climb to success. Toiling first in a clothing sweat shop, she later opens her own salon in fashionable Berkeley Square though she tells the world – and her daughter - she’s a widow. One single dress, a ballgown created for the enigmatic Countess of Hawksmoor, the leader of London society, transforms Ellen’s fortunes, and as the years pass, business thrives. But then Raoul de Valentin returns and threatens to destroy all that Ellen has achieved.   In The Dressmaker, the romance of Jane Austen, the social commentary of Charles Dickens and the very contemporary voice of Posie Graeme-Evans combine to plunge the reader deep into the opulent, sinister world of teeming Victorian England. And if the beautiful Madame Ellen is not quite what she seems, the strength of her will sees her through to the truth, and love, at last.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Burnt Bread and Chutney: Growing Up Between Cultures - A Memoir of an Indian Jewish Childhood (Ballantine Reader's Circle)",
        "Authors": "By Delman, Carmit",
        "Description": "“From the outside, no matter what the gradations of my mixed heritage, the shadow of Indian brown in my skin caused others to automatically perceive me as Hindu or Muslim. . . . Still, I trekked through life with the spirit of a Jew, fleshed out by the unique challenges and wonders of a combined brown and white tradition.”In the politics of skin color, Carmit Delman is an ambassador from a world of which few are even aware. Her mother is a direct descendant of the Bene Israel, a tiny, ancient community of Jews thriving amidst the rich cultural tableau of Western India. Her father is American, a Jewish man of Eastern European descent. They met while working the land of a nascent Israeli state. Bound by love for each other and that newborn country, they hardly took notice of the interracial aspect of their union. But their daughter, Carmit, growing up in America, was well aware of her uncommon heritage.Burnt Bread and Chutney is a remarkable synthesis of the universal and the exotic. Carmit Delman’s memories of the sometimes painful, sometimes pleasurable, often awkward moments of her adolescence juxtapose strikingly with mythic tales of her female ancestors living in the Indian-Jewish community. As rites and traditions, smells and textures intertwine, Carmit’s unique cultural identity evolves. It is a youth spent dancing on the roofs of bomb shelters on a kibbutz in Israel—and the knowledge of a heritage marked by arranged marriages and archaic rules and roles. It is coming of age in Jewish summer camps and at KISS concerts—and the inevitable combination of old and new: ancient customs and modern attitudes, Jewish, Indian, and American.Carmit Delman’s journey through religious traditions, family tensions, and social tribulations to a healthy sense of wholeness and self is rendered with grace and an acute sense of depth. Burnt Bread and Chutney is a rich and innovative book that opens wide a previously unseen world.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "One World",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Kids' Silliest Riddles",
        "Authors": "By Jones, Buck (ILT) and Horsfall, Jacqueline",
        "Description": "Picnic pranks and monkeyshines, knock-knocks and lots of yuks! From beach bloopers and garden goofies to fast-food freak-outs and pucks and yucks, every riddle here will make you giggle uncontrollably. What do cats carry to picnics?Mice chests. What kind of monkey can fly? Hot-air baboons. Why was the martial arts expert sick?He had kung flu. Why do dogs like to eat at Italian restaurants? For the paws-ta. And the delightfully silly drawings throughout make everything even funnier. You'll want to share the laughs with all your pals.A Selection of Scholastic Book Clubs.",
        "Category": " Juvenile Nonfiction , Humor , Jokes & Riddles",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Suite Life of Zack & Cody #7: Side by Side (Scholastic special market edition)",
        "Authors": "By",
        "Description": "Scholastic editon of book 7 in The Suite Life of Zack & Cody chapter book series.",
        "Category": "",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Road Runner: A Very Scary Lesson (A Little Golden Book)",
        "Authors": "By Russell K Schroeder",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Political Action (Influencer Discussion Guides)",
        "Authors": "By Colson, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Navpress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "New York State (Frommer's)",
        "Authors": "By Schlecht, Neil E., Silverman, Brian, and Beattie, Rich",
        "Description": "Meticulously researched by a team of expert residents who know this region intimately, Frommer's New York State, 2nd Edition is an extraordinary and highly personal guide to one of America’s most diverse regions.Frommer’s New York State is packed with candid opinions on everything about New York City, but also on the beaches, antiques shops, wineries, skiing, hiking, biking, and other outdoor adventures that make up the rest of New York State. We’ve covered all the perennial favorites, from the Hamptons to Niagara Falls, but we’ll also take you off the beaten track to discover New York's best small towns and natural escapes. Whether you want a romantic getaway in an upstate B&B or family fun on Long Island's best beaches, Frommer’s will help you design the trip that’s right for you.",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "A Flaw in the Blood: A Novel",
        "Authors": "By Barron, Stephanie",
        "Description": "The acclaimed author of the bestselling Jane Austen mysteries brings rich historical immediacy to an enthralling new suspense novel centered around Queen Victoria’s troubled court…and a secret so dangerous, it could topple thrones.Windsor Castle, 1861. Prince Albert, the Queen’s Consort, lies dying, and Victoria summons Patrick Fitzgerald, the clever, embittered Irish barrister who helped defend Her Majesty from a would-be assassin twenty years earlier. Within hours, Fitzgerald’s beautiful ward is nearly murdered, his chambers are ransacked, and another girl lies dead. Could an unknown force at Windsor want Fitzgerald silenced? And why? The answers are entangled in an electrifying tale of intrigue, seduction, and betrayal, partially narrated by Europe’s most powerful monarch.As fascinating as the Queen herself, seamlessly blending history and suspense, A Flaw in the Blood is an elegant thriller that is utterly convincing—and utterly surprising—to its very end.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Frommer's Greek Islands (Frommer's Complete Guides)",
        "Authors": "By Bowman, John S. and Marker, Sherry",
        "Description": "Experience a place the way the locals do. Enjoy the best it has to offer. Frommer's. The best trips start here.* Advice on choosing the best islands for your needs.* Outspoken opinions on what's worth your time and what's not.* Exact prices, so you can plan the perfect trip whatever your budget.* Off-the-beaten-path experiences and undiscovered gems, plus new takes on top attractions.Find great deals and book your trip at Frommers.com",
        "Category": " Travel , Europe , Greece",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Individual and Society Volume 1",
        "Authors": "By Dennis & Moldof (ed)",
        "Description": "",
        "Category": "",
        "Publisher": "The Great Books Foundation, Chicago, IL, U.S.A.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Be Wise: I Corinthians (Be)",
        "Authors": "By Wiersbe, Warren W.",
        "Description": "Follow God's Wisdom! What a difference it makes in your life when you decide to follow God's wisdom     instead of man's knowledge! Corinth was not much different from our world today--populous, proud, prosperous,     philosophical, and polluted. The church in Corinth had its share of problems,     but God in His wisdom had the answer. Don't just \"Get Smart\"--Be Wise!",
        "Category": " Religion , Biblical Commentary , New Testament",
        "Publisher": "Chariot Victor Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Experiencing Prayer with Jesus: The Power of His Presence and Example",
        "Authors": "By Blackaby, Henry T. and Blackaby, Norman",
        "Description": "Walk His Steps, Pray His Way It’s not an activity. Nor a chore. Prayer is a way of life. Here’s how you can move beyond rituals and discover new intimacy with Jesus. Henry and Norman Blackaby’s thorough study of Jesus’ prayer life reveals astounding truths about God’s intent for prayer. By the time you turn the last page of this 2006 National Day of Prayer book, your old notions will be replaced by the reality of Jesus’ example. You’ll experience the power of heaven and earth being joined together as the King of all creation lays His heart over yours. Your will becomes aligned with His. Discover freedom from methods and formulas, the beauty of a gentle step-by-step reformation process, and let God unfold His mighty purposes for you. “in the days of His flesh, when He had offered up prayers and supplications, with vehement cries and tears… was heard because of His godly fear.” Hebrews 5:7 The One who loved you to His death continues to pursue you. He will humbly lay His heart over yours. Heaven and earth will agree. The supernatural will powerfully unfold. And you will be changed forever. Story Behind the BookJesus’ ministry was marked by a life of prayer. Even more, Jesus is the pattern and definition of prayer. Who better for America to pray with on the National Day of Prayer than Him? And who better than father-son team Henry and Norman Blackaby to unveil such a message? In classic Blackaby style, they reveal how Jesus’ example can become our way of life. When prayer is genuine, life change is real. Look out, America. Prayer is changing our country like nothing ever has…or will!",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Devoured",
        "Authors": "By Marrone, Amanda",
        "Description": "Megan works at an amusement park to keep an eye on her boyfriend, Ryan, and his best friend, Alexa, who clearly likes him, only to begin seeing the ghost of her dead sister and discovering that Luke--who has a crush on Megan, but is being pursued by Megan's new friend Ari--can also see the apparition. Original.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Battle of the Sexes (Spinner Books)",
        "Authors": "By Conley, Erin (EDT)",
        "Description": "This fun, fast-paced game pits men against women in the ultimate battle of the sexes. Players can spin the spinner, answer gender-based questions, settle the score and find out once and for all which is the superior sex!",
        "Category": " Games , General",
        "Publisher": "University Games",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Prentice Hall Guide for College Writers: Brief Edition without Handbook (6th Edition)",
        "Authors": "By Reid, Stephen",
        "Description": "Focused on both traditional writing purpose and process as well as on the technological resources that influence and enhance contemporary writing, this compact, all-in-one guide offers comprehensive coverage of the purposes of writing?with a focus on the importance of a writer's research, critical-reading skills, the ability to organize ideas, and a strategy to assess and develop rhetorical contexts. Each self-contained chapter takes readers through a sequenced series of specific purpose-based writing tasks?complete with professional and student samples, rhetorical techniques, journal exercises, reading and writing activities, revision suggestions, etc. Includes nearly a hundred short quotations by composition teachers, researchers, essayists, novelists, and poets on the nature of writing.  Writing Myths and Rituals. Purposes and Processes for Writing. Observing. Remembering. Reading. Investigating. Explaining. Evaluating. Problem Solving. Arguing. Responding to Literature. Writing a Research Paper. Writing Under Pressure.  For anyone needing guidance in the writing process.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "6.28",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The Complete Guide to Writing Nonfiction",
        "Authors": "By American Society of Journalists and Authors and Evans, Glen (EDT)",
        "Description": "Gives practical advice on writing and researching magazine articles, discusses various specialized markets, and describes the life of a writer",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Best of the Best Cookbook Recipes, Vol. 13: The Best Recipes from the 25 Best Cookbooks of the Year (Food & Wine Books)",
        "Authors": "By Food & Wine (COR)",
        "Description": "Includes more than 100 recipes from the 25 best cookbooks of the year--including dishes from Bobby Flay, Emeril Lagasse, Lidia Bastianich, Patrick and Gina Neely and many more--as well as 20 previously unpublished recipes and 90 mouth-watering full-color photos.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Food & Wine",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Long Snapper: A Second Chance, a Super Bowl, a Lesson for Life",
        "Authors": "By Marx, Jeffrey",
        "Description": "Written by Pulitzer Prize-winning journalist Jeffrey Marx, The Long Snapper chronicles one of the most improbable and inspirational sports stories of our time. Marx, the New York Times bestselling author of Season of Life, tells of Brian Kinchen’s remarkable journey from Bible teacher to New England Patriot to Super Bowl champion in this transcendent tale of football and faith.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "A death in Ireland: A novel",
        "Authors": "By Everett, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Miracles by the Sea (People of the Bible)",
        "Authors": "By Molan, Chris (ILT) and Storr, Catherine",
        "Description": "Describes how Christ guided fish into the fishermen's nets, fed a huge crowd with five loaves and two fish, and walked on water to save his disciples",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Heinemann/Raintree",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Noah and His Ark (People of the Bible)",
        "Authors": "By Storr, Catherine and Russell, Jim (ILT)",
        "Description": "A retelling of the story of the Flood that lasted forty days, and the Ark on which Noah, his family, and a pair of each kind of animal took refuge.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Raintree Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Piano Adventures Popular Repertoire, Level 3A",
        "Authors": "By Nancy & Randall Faber",
        "Description": "",
        "Category": "",
        "Publisher": "FJH Music Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    }
]