[
    {
        "Title": "Betty Crocker's Sensational Salads",
        "Authors": "By Crocker, Betty",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Salads",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "All the Best Rice",
        "Authors": "By Warner, Joie",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Imperial Stars (Family D'Alembert Series #1)",
        "Authors": "By Edward. E. (\"Doc\") Smith, Stephen Goldin",
        "Description": "",
        "Category": "",
        "Publisher": "Pyramid Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Lion Encyclopedia of the Bible",
        "Authors": "By Alexander, Pat (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Chariot Victor Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Settling Down",
        "Authors": "By Whitaker, James",
        "Description": "",
        "Category": "",
        "Publisher": "Horizon Book Promotions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "Little Kangaroo Finds His Way (Little Animal Adventures)",
        "Authors": "By Jensen, Patricia, Chottin, Ariane, Fichaux, Catherine, and Fichaux, Catherine (ILT)",
        "Description": "Little Kangaroo gains self-confidence when the kangaroos send him on a mission during a life-threatening drought. Includes facts about kangaroo behavior.",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Fragrant Harbor Taste: The New Chinese Cooking of Hong Kong",
        "Authors": "By Hom, Ken",
        "Description": "Combines traditional Asian and modern Western tastes, in a collection of easy-to-prepare dishes that range from appetizers, to main dishes, to desserts",
        "Category": "",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Wok Dishes (Easy Cooking)",
        "Authors": "By Weinstein, Norman",
        "Description": "Explains the use of a wok and supplies Chinese recipes for cooking chicken, beef, pork, vegetables, and seafood with a wok",
        "Category": " Cooking , General",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "The Shelter of Each Other: Rebuilding Our Families",
        "Authors": "By Pipher, Mary Bray",
        "Description": "In The Shelter of Each Other, Mary Pipher does for the American family what she did for adolescent girls and their parents in her bestselling book Reviving Ophelia: she opens our eyes wide to the desperate realities we are facing and shows us a way out. Drawing on the fascinating stories of families rich and poor, angry and despairing, religious and skeptical, and probing deep into her own family memories and experiences, Pipher clears a path to the strength and energy at the core of family life. Wise, compassionate, and impassioned, The Shelter of Each Other challenges each of us to face the truth about ourselves and to find the courage to protect, nurture, and revivify the families we cherish.\"A canny mix of optimism and practicality gives Pipher's fans a way to resist the worst of the culture around them and substitute the best of themselves.\" *Newsweek\"Eye-opening . . . Pipher's simple solutions for survival in this family-unfriendly culture are peppered throughout the heart-wrenching and uplifting stories of several of her client families. . . . Highly readable, passionate.\" *San Francisco Chronicle\"Compelling.\" *USA Today",
        "Category": " Family & Relationships , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "James McNair's Cold Cuisine",
        "Authors": "By McNair, James",
        "Description": "Gathers recipes for vegetables, fish, shellfish, poultry, meat, sauces, and desserts designed to be served cold",
        "Category": " Cooking , Reference",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Pillsbury Family Favorites",
        "Authors": "By Elaine Christiansen, Jackie Sheehan",
        "Description": "",
        "Category": "",
        "Publisher": "Ottenheimer Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Chicken and Game Hen Menus (Great Meals in Minutes)",
        "Authors": "By By the Editors of Time-life Books",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Entertaining With Regis & Kathie Lee: Year-Round Holiday Recipes, Entertaining Tips, andParty Ideas",
        "Authors": "By Philbin, Regis, Gifford, Kathie Lee, and Albright, Barbara",
        "Description": "Two popular television hosts present their best ideas for seasonal holiday parties, offering recipes, hints for successful entertaining, party plans, and much more. 75,000 first printing. First serial, Good Housekeeping.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Love's Encore",
        "Authors": "By Brown, Sandra and Ryan, Rachel",
        "Description": "In one reckless night, Camille Jameson's life was changed forever: a tall, handsome stranger, an evening of romance -- and enough regrets to last a lifetime. Two years later, Camille is a successful interior decorator with the opportunity to restore one of Mississippi's proudest plantations. She arrives excited and eager to face her greatest professional challenge to date -- until Zack Prescott saunters through the mansion's front door and back into her life. He is exactly as she remembers, except for the knowing look in his eyes that reminds her of what they once shared. Now, forced to live in unbearably close quarters, Camille and Zack will discover if they have the courage to face the past -- and, perhaps, build a future together . . .",
        "Category": " Fiction , Romance , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Club Rules: Power, Money, Sex, and Fear : How It Works in Hollywood",
        "Authors": "By Rosenfield, Paul",
        "Description": "An insider's view of the two hundred power brokers who control Hollywood--producers, actors, costume designers, agents, and others--reveals everything about them, including where they hang out, eat, and relax. 40,000 first printing.",
        "Category": " Business & Economics , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Nature: The Other Earthlings",
        "Authors": "By Shreeve, James",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "An Altogether New Book of Top Ten Lists",
        "Authors": "By Letterman, David and O'Donnell, Steve",
        "Description": "A collection of 169 of David Letterman's top-ten lists includes Orville Redenbacher's Top Ten Most Horrifying Secrets, Top Ten Mafia Euphemisms for Death, Top Ten Signs that Your Bank Is Failing, Top Ten Freak Accidents on the Today Show Set, and others",
        "Category": " Humor , General",
        "Publisher": "POCKET",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Footprints",
        "Authors": "By Hearon, Shelby",
        "Description": "In her new novel, Shelly Hearon deals with how the comfortable compromise of a couple's long-term marriage is torn apart by the accidental death of their twenty-two-year old daughter.The rueful truce between the Mayhalls begins to unravel the evening they find themselves at a barbecue celebration in Houston, Texas, for the relatives of organ donors and the grateful recipients. Here they come face to face with the aging southern preacher whose life has been saved by the gift of their daughter's heart. The wholly different ways this thoughtful scientific couple respond to this macabre encounter - Nan, in denial, retreating to the safety of the past; Douglas, in the here and now, emotionally distraught at the idea that part of his daughter lives on in this frail man - force Nan to recognize the perilous gulf between them.Seeking escape, Nan flees to the shell-strewn beaches of Sanibel Island, while Douglas waits out a bitter New York winter seeking the warmth of someone new. But it takes another life-threatening event to allow them to step out of their own footprints and let the healing - both for them and for their surviving son - begin.",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Healthy Heart Cookbook",
        "Authors": "By Talley, Lisa Hooper (EDT) and Hooper, Lisa A.",
        "Description": "Discusses the requirements of a heart-healthy diet and way of life and how to adapt to them, and provides a selection of low-fat menus and recipes",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Betsey Brown",
        "Authors": "By Shange, Ntozake",
        "Description": "In 1957--the year in which school integration stirred both Blacks and whites--in St. Louis, thirteen-year-old Betsey Brown encounters the awkwardness, responsibilities, and the elusive promise of romance of adolescence",
        "Category": "",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Manhattan: A Photographic Tour (Photographic Tour Series)",
        "Authors": "By Highsmith, Carol M. and Landphair, Ted",
        "Description": "Who could have dreamed, when Peter Minuit traded a few trinkets for Manhattan back in 1626, that this little island on the outer reaches of civilization would one day be the world's center of shipping, finance, theater, culture, architecture, and diplomacy?  Through the tireless work and unbounded optimism of a few wealthy dreamers and a few million immigrant workers, this rocky, swampy islet at the mouth of the Hudson River was transformed into today's axis of world capitalism—a dazzling metropolis of soaring skyscrapers and great city parks, magnificent museums and professional sports teams, epicurean restaurants and intricate subway systems.Eminent photographer Carol M. Highsmith has captured the essence of Manhattan in a stunning new collection of over one hundred city portraits, ranging from breathtaking panoramas of the celebrated skyline to close-ups of architectural details.  Her camera sweeps across the city, pausing at the magnificent stainless-steel Art Deco Chrysler Building, the twin towers of the World Trade Center, Rockefeller Center, and other architectural landmarks, then traversing Manhattan's eclectic neighborhoods to discover the heartbeat of this urban wonderland. Ted Landphair's compelling account of the history of Manhattan, illustrated throughout with historical photographs, provides the perfect complement to Highsmith's contemporary photography.  The crisp, lively introduction and captions reveal little-known facts and anecdotes about the city.Manhattan: A Photographic Tour  captures the island of Manhattan in all its cocky vigor, beauty, and trendsetting sophistication.  It is the perfect souvenir of a memorable visit, and the ideal gift for anyone who savors unforgettable architecture, unsurpassed culture, and fascinating diversity.",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Crescent",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Official Nora Roberts Companion",
        "Authors": "By Little, Denise (EDT) and Hayden, Laura (EDT)",
        "Description": "With insights into the #1 New York Times bestselling author's life, work and career &#151;and little-known facts about her most popular novels &#151;this beautifully designed book celebrates Nora Roberts's enduring legacy of powerful, passionate storytelling. The books: a complete, cross-referenced list of Roberts's books&#151;with trivia, quotes, and family trees The career: a timeline of Roberts's career, with a list of major milestones and quotes from some of her best reviews The fans: inspiring true stories of how Roberts's books have changed her fans' lives, a list of fan clubs, photos of her with her fans, and \"favorite\" lists&#151;Best Kiss, Best Hero, Best Opening Line&#151;all voted on by fans The phenomenon: romance writers, industry-insiders, booksellers, reviewers, and fans talk about Roberts's successPlus, Roberts answers her readers' most frequently asked questions, reveals her favorite foods, music, and movies, and discusses the fine art of writing romance.",
        "Category": " Literary Criticism , Women Authors",
        "Publisher": "Berkley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The philosophy and practice of wildlife management",
        "Authors": "By Gilbert, Frederick F",
        "Description": "",
        "Category": "",
        "Publisher": "R.E. Krieger Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Finite mathematics",
        "Authors": "By Lial, Margaret L.",
        "Description": "Standard textbook (previous edition, 1985) covering the noncalculus portions of mathematics for undergraduate students in business, management, economics, or the life or social sciences. A course in algebra is a prerequisite. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Scott Foresman",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Encyclopedia of British Military Aircraft",
        "Authors": "By Bowyer, Chaz",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Crescent Books",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Windows Script Host Programmer's Reference",
        "Authors": "By Esposito, Dino and Dino",
        "Description": "",
        "Category": " Computers , Programming Languages , General",
        "Publisher": "Peer Information Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Myths & Legends of the Celts",
        "Authors": "By Rolleston, T",
        "Description": "",
        "Category": "",
        "Publisher": "Senate",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The Well-Wishers",
        "Authors": "By Eager, Edward and Bodecker, N. M. (ILT)",
        "Description": "The wishing well is all used up, its magic drained, its enchantment gone dry.      Or has it?      In a reckless moment, Gordy threatens the old well, telling it to get going with its magic or else! and that seems to do the trick. Suddenly Laura, Lydia, James, and Kip—who feared their autumn would unfold without magic—are plunged into just the sort of outlandish adventures they&#39;d longed for.      But is it really the well&#39;s magic that transforms troublemaker Dicky LeBaron from ne&#39;er-do-well to hero? Or keeps Appledore&#39;s orchard—and love life—in bloom? Or sends James on a doubly daring rescue of a damsel in distress?      What does it matter? Sometimes the best kind of magic is the kind that isn&#39;t so magical at all. . . .",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Young Readers Paperback",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The dead of winter",
        "Authors": "By Cooper, Dominic",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Summer Feasts",
        "Authors": "By Finn, Molly",
        "Description": "More than three hundred recipes for varied and delicious gourmet dishes that can be prepared in advance or in a few minutes feature the best produce of summer, imaginative serving suggestions, and new ideas for exciting seasonings",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "By the Light of the Moon",
        "Authors": "By Dean Koontz",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Naked Crowd: Reclaiming Security and Freedom in an Anxious Age",
        "Authors": "By Rosen, Jeffrey",
        "Description": "Argues that in the effort to catch terrorists and prevent future terrorist attacks, we are violating essential American rights to privacy and liberty, and explains how, by using properly crafted legislation and technologies, we can create an effective and reasonable balance between security and liberty. 20,000 first printing.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Angel of Darkness",
        "Authors": "By Carr, Caleb",
        "Description": "It is June 1897. A year has passed since Dr. Laszlo Kreizler, a pioneer in forensic psychiatry, tracked down the brutal serial killer John Beecham with the help of a team of trusted companions and a revolutionary application of the principles of his discipline. Kreizler and his friends - high-living crime reporter John Schuyler Moore; indomitable, derringer-toting Sara Howard; the brilliant (and bickering) detective brothers Marcus and Lucius Isaacson; powerful and compassionate Cyrus Montrose; and Stevie Taggert, the boy Kreizler saved from a life of street crime - have returned to their former pursuits and tried to forget the horror of the Beecham case. But when the distraught wife of a Spanish diplomat begs Sara's aid, the team reunites to help find her kidnapped infant daughter. It is a case fraught with danger, since Spain and the United States are on the verge of war. Their investigation leads the team to a shocking suspect: a woman who appears to the world to be a heroic nurse and a loving mother, but who may in reality be a ruthless murderer of children.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "All About Antioxidants",
        "Authors": "By Challem, Jack",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Eagle's Shadow: Why America Fascinates And Infuriates The World",
        "Authors": "By Hertsgaard, Mark",
        "Description": "What America looks like to the rest of the worldAmericans rarely used to think about the outside world. As the mightiest nation in history, the United States could do as it pleased. Now Americans have learned the hard way that what outsiders think matters. When terror struck last September 11, author Mark Hertsgaard was completing a trip around the world, gathering perceptions about America from people in fifteen countries. Whether sophisticated business leaders, starry-eyed teenagers, or Islamic fundamentalists, his subjects felt both admiring and uneasy about the United States, enchanted yet bewildered, appalled yet envious.This complex catalogue of impressions--good, bad, but never indifferent--is the departure point for a short, pointed essay in the tradition of Common Sense and The Fate of the Earth. How can the world's most open society be so proud of its founding ideals yet so inconsistent in applying them? So loved for its pop culture but so resented for its high-handedness? Exploring such paradoxes, Hertsgaard exposes uplifting and uncomfortable truths that force natives and outsiders alike to see America with fresh eyes.\"Like it or not, America is the future,\" a European tells Hertsgaard. In a world growing more American by the day, The Eagle's Shadow is a major statement about and to the place everyone discusses but few understand.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Your Mother Was a Neanderthal (The Time Warp Trio)",
        "Authors": "By Scieszka, Jon and Smith, Lane (ILT)",
        "Description": "The return of the popular Time Warp Trio finds the resourceful friends journeying back in time to the Stone Age, where school is no longer a problem but where there are plenty of other dangers and adventures awaiting. Reprint.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Miss Abigail's Guide to Dating, Mating, and Marriage: Classic Advice for Contemporary Dilemmas",
        "Authors": "By Grotke, Abigail",
        "Description": "Since 1998, Miss Abigail’s Time Warp Advice (missabigail.com) has provided classic advice for contemporary dilemmas to readers of all ages, from all walks of life. Author Abigail Grotke offers readers a chance to step back in time as she pulls out relevant quotes, tidbits, and words of wisdom from her collection of old advice books in a quest to solve modern-day problems (she has over 1,000 advice books in her library!). The books span a period from 1822 to 1978 and cover the age-old topics of dating, love, living together, marriage, beauty, puberty, and sex. While the language is often quaint and curious, the insights provided remain remarkably fresh. This book takes an affectionate look at how advice throughout the ages is still meaningful today.Combining the best of Miss Abigail’s question and answer columns, each chapter features sidebars containing freestanding tips or selections related to chapter topics. Additional material includes short features on selected authors, silly book titles, and entertaining flap copy or jacket material. Retro book covers, advertisements, \"chick-lit\"-style line drawings, and other amusing, related ephemera serve to illustrate the book.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Thunder's Mouth Press",
        "Price Starting With ($)": "8.06",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Beethoven's Hair: An Extraordinary Historical Odyssey and a Scientific Mystery Solved",
        "Authors": "By Martin, Russell",
        "Description": "The basis for the movie of the same name, an astonishing tale of one lock of hair and its amazing travels--from nineteenth-century Vienna to twenty-first-century America.When Ludwig van Beethoven lay dying in 1827, a young musician named Ferdinand Hiller came to pay his respects to the great composer, snipping a lock of Beethoven's hair as a keepsake--as was custom at the time--in the process. For a century, the lock of hair was a treasured Hiller family relic, until it somehow found its way to the town of Gilleleje, in Nazi-occupied Denmark. There, it was given to a local doctor, Kay Fremming, who was deeply involved in the effort to help save hundreds of hunted and frightened Jews.After Fremming's death, his daughter assumed ownership of the lock, and eventually consigned it for sale at Sotheby's, where two American Beethoven enthusiasts, Ira Brilliant and Che Guevara, purchased it in 1994. Subsequently, they and others instituted a series of complex forensic tests in the hope of finding the probable causes of the composer's chronically bad health, his deafness, and the final demise that Ferdinand Hiller had witnessed all those years ago. The results, revealed for the first time here, are the most compelling explanation yet offered for why one of the foremost musicians the world has ever known was forced to spend much of his life in silence.In Beethoven's Hair, Russell Martin has created a rich historical treasure hunt, a tale of false leads, amazing breakthroughs, and incredible revelations. This unique and fascinating book is a moving testament to the power of music, the lure of relics, the heroism of the Resistance movement, and the brilliance of molecular science.",
        "Category": " History , Holocaust",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Dictionary of Republicanisms: The Indispensable Guide to What They Really Mean When They Say What They Think You Want to Hear",
        "Authors": "By Vanden Heuvel, Katrina",
        "Description": "George W. Bush, a self-proclaimed straight-talking Texan, has been roundly lampooned for his weak grasp of the English language: \"subliminable,\" \"resignate,\" and transformationed\" being only a few of his malapropisms. As ridiculous as Bush sometimes sounds, we shouldn't underestimate him or the right-wingers who put him in power, because they never say what they mean or mean what they say.Over the past few decades, the radical right has engaged in a well-funded, self-conscious program of Orwellian doublespeak, transforming American political discourse to suit their political ends. \"Private accounts\" became \"personal accounts.\" \"Massachusetts liberal\" was used to slur John Kerry's record. And their \"compassionate conservative\" tax cuts were neither conservative nor compassionate, unless you happen to be a Republican fat cat.Sick and tired of their sinister deceptions, celebrated Nation editor Katrina vanden Heuvel set out to explode their verbal gymnastics by asking her readers to suggest satirical definitions of Republican jargon. The result was a grassroots groundswell of hilarious submissions from Americans who are mad as hell and aren't going to take it any more. She has collected the best in this very funny and very necessary book.",
        "Category": " Reference , Quotations",
        "Publisher": "Nation Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Denial and Deception: An Insider's View of the CIA",
        "Authors": "By Mahle, Melissa Boyle",
        "Description": "The reality for a woman agent working in the secret world of intelligence often leads to extraordinary obstacles and sacrifices. Melissa Boyle Mahle, a sixteen-year covert operative for the CIA in the Middle East, was the Agency’s top-ranked female Arabist before she left in 2002. In Denial and Deception, Mahle not only describes the Agency’s successes and failures, but details her life as a woman in one of the last professions that remain almost exclusively male-directed and dominated.The author has a unique vantage point from which to view the political and operational culture of the CIA in the post-Cold War climate, and reveals how it failed to anticipate the 9/11 attacks. From Ronald Reagan to George W. Bush, she provides a vivid narrative of how the agency became a rudderless organization, lost in the post-Cold War world. Afraid to take risks that might offend Congress and European allies after overstepping its legal bounds in the Iran-Contra era, gutted of the clandestine operators who knew how to run secret wars, demoralized by criticism and poor performance, the CIA simply became unable and unwilling \"to get down and dirty to do the hard part to fight a real war on terrorism.\"",
        "Category": " Political Science , American Government , General",
        "Publisher": "Bold Type Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Staying Street Smart in the Internet Age: What Hasn't Changed About the Way We Do Business",
        "Authors": "By McCormack, Mark H.",
        "Description": "The founder of the world's most important sports marketing firm offers a practical guide to staying afloat in the digital age, arguing that despite the technology, certain rules--such as the face-to-face meeting--still apply in business. 100,000 first printing.",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Facts Behind the Helsinki Roccamatios",
        "Authors": "By Martel, Yann",
        "Description": "Here are four unforgettable stories by the author of Life of Pi. In the exquisite title novella, a very young man dying of AIDS joins his friend in fashioning a story of the Roccamatio family of Helsinki, set against the yearly march of the twentieth century whose horrors and miracles their story echoes. In \"The Time I Heard the Private Donald J. Rankin String Concerto with One Discordant Violin, by the American composer John Morton,\" a Canadian university student visits Washington, D.C., and experiences the Vietnam War and its aftermath through an intense musical encounter. In \"Manners of Dying,\" variations of a warden's letter to the mother of a son he has just executed reveal how each life is contained in its end. The final story, \"The Mirror Machine\", is about a young man who discovers an antique mirror-making machine in his grandmother's attic. The man's fascination with the object is juxtaposed with the longwinded reminiscences it evokes from his grandmother.Written earlier in Martel's career, these tales are as moving as they are thought-provoking, as inventive in form as they are timeless in content. They display that startling mix of dazzle and depth that have made Yann Martel an international phenomenon.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "A Cafe on the Nile",
        "Authors": "By Bull, Bartle",
        "Description": "East Africa, 1935. A nation sits at the brink of war, a city is fraught with conspiracy, and at the Cataract Café in Cairo, a colorful cast of characters - professional hunter Anton Rider, his estranged wife and her Italian lover, the pampered American twins Bernadette and Harriet Mills, a German freebooter who has stolen a fortune in silver from the Italian army, the Goan dwarf and café proprietor Olivio Alevado - gathers to gamble with destiny.\"Pulses with entertainment value . . . The sort of yarn that can keep you up late at night . . . [A] spirited, sensuous, hot-blooded evocation of a rich and eventful historical world\" - Richard Bernstein, New York Times\"A breathtakingly entertaining historical novel . . . packed with daring exploits and sinister intrigues, with larger-than-life characters and exotic locales\" - Orlando Sentinel\"An enthralling novel\" - Booklist\"[A] rattling good blockbuster yarn\" - Publishers Weekly\"A Café on the Nile achieves the aim of fiction: The reader gladly suspends disbelief.\" - Houston Chronicle\"[Bull] is a terrific novelist.\" - San Jose Mercury News",
        "Category": " Fiction , Literary",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Capote: A Biography",
        "Authors": "By Clarke, Gerald",
        "Description": "Based on hundreds of hours of interviews with the man who authored In Cold Blood and Breakfast at Tiffany's, as well as with nearly everyone who knew him, this absorbing, definitive biography follows Truman Capote from his eccentric childhood in Alabama to the heights of New York society. Featuring many photographs, this book also candidly recounts a gifted and celebrated writer's descent into the life of alcohol and drugs that would ultimately consume his bulldog spirit and staggering talent?but not before he'd hobnob with the likes of Grace Paley and Lee Radziwill, feud outrageously with Gore Vidal and Jacqueline Susann, and stage at New York's Plaza Hotel the sensational Black and White Ball.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "535 Wonderful Things You Can Do This Weekend: A Guide to the Annual Events in the Mid-Atlantic States",
        "Authors": "By Kaplan, Mitch",
        "Description": "",
        "Category": "",
        "Publisher": "Middle Atlantic Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Schrodinger's Kittens and the Search for Reality: Solving the Quantum Mysteries",
        "Authors": "By Gribbin, John and Chimsky, Mark (EDT)",
        "Description": "In this eagerly anticipated sequel to the classic bestseller In Search of Schrodinger's Cat, John Gribbin digs even deeper into the mysterious and confounding world of quantum mechanics. Gribbin takes infinitely complex, mind-bending experiments, brings them to life, and makes them accessible to the lay reader. Under his deft guidance, we can begin to grasp the fundamental riddle of today's quantum mechanics: how a single photon can be seen going in two directions at once. Along the way, Gribbin reveals some fascinating discoveries: how quantum particles could one day be used in a Star Trek-type teleportation system, and how quantum cryptographers have developed ways of making unbreakable codes using quantum effects. Schrodinger's Kittens and the Search for Reality illuminates the world's most intriguing and enigmatic scientific phenomenon - and shows how the \"impossible dreams\" of such legendary scientists as Bohr, Feynman, and Einstein may soon become reality.",
        "Category": " Science , Physics , Quantum Theory",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "These Granite Islands: A Novel",
        "Authors": "By Stonich, Sarah",
        "Description": "These Granite Islands is an arresting first novel about a woman who, on her deathbed, recalls the haunting and fateful summer of 1936, a summer that forever changed her life.Isobel has been wife, mother, hatmaker. At the end of her long life she is simply herself, with one last story to tell her only surviving child. She picks up the threads of a mystery that has shadowed her for sixty years and recalls her brief but unforgettable friendship with an extraordinary woman. During one long-ago summer she witnesses a passionate and dangerous love affair that tests her loyalty and challenges her definitions of what is proper. This summer becomes the prism to refract the essence of Isobel's life. When it dissolves in a haunting tragedy, Isobel is left to assess her future and her own marriage and, finally, to ponder the risk of loving someone wholly. An intimate and gripping story of a friendship, a portrait of a marriage, and a meditation on the tragedy of loss.",
        "Category": " Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Proud Spirit: Lessons, Insights & Healing From 'the Voice Of The Spirit World'",
        "Authors": "By Altea, Rosemary",
        "Description": "Rosemary Altea, the internationally renowned medium and healer known to millions worldwide as \"The Voice of the Spirit World,\" offered proof of life after death in The Eagle and the Rose.Proud Spirit (TM) takes readers further along the path, exploring opportunities for spiritual growth in everyday life. Rosemary's storytelling skills inspire us as she recounts the time Christ laid his hands atop her own as she gave healing. Her spine-tingling tales of being visited by a group of spirit-world children and invited to a midnight picnic in a haunted house add awe, mystery, and magic to her work. Profound spiritual truths emerge: the need to know, value, and be gentle with ourselves, to be proud spirits who always quest for self-worth and that which lies within.",
        "Category": " Religion , Spirituality",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Thirty-Six Days: The Complete Chronicle of the 2000 Presidential Election Crisis",
        "Authors": "By Brinkley, Douglas (EDT) and New York Times Company",
        "Description": "From the most trusted newspaper in the country, here is the complete story of the Election 2000 standoff that stopped American politics.Beginning on Election Day and ending with the Supreme Court decision that gave victory to George W. Bush, this important volume provides a day-by-day record of events as they unfolded. Drawing on the talents of many of the the top political reporters at The New York Times, 36 Days aims to make sense of a complex and convoluted chapter in our recent history. Along with lead stories from each consecutive day, the book includes informative and enlightening background pieces, analytical essays, investigative reports, personality profiles, and opinion pieces, thus offering students and all other observations of this election a well-rounded, fair-minded, thoughtful account. These pieces are linked by original text that highlights key developments and shifting strategies. Also included are selected excerpts from all the relevant legal opinions, statistical graphics, quotations, and sidebar stories. An introduction by acclaimed presidential scholar Brinkley adds historical perspective to this authoritative and comprehensive chronicle.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Times Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Great Adventures in Food : A Fresh Market Cookbook",
        "Authors": "By Haas, Ellen and Moore, Bonnie",
        "Description": "In a country in which poor eating habits affect people of all ages, a collection of recipes helps families develop a healthy eating style and provides valuable tips on all stages of meal preparation. Reprint. 10,000 first printing.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Golden Guides from St. Martin's Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Dear Valued Customer: You Are A Loser",
        "Authors": "By Broadhead, Rick",
        "Description": "To err is human. To really screw things up takes modern technology. To enjoy reading about the misfortunes of others at the hands of technology...all it takes is this book!In addition to being one of the country's leading technology experts (he's co-authored more than 30 books), Rick Broadhead has had a life-long predilection for stories of the strange-but-true genre. In Dear Valued Customer: You are a Loser, he combines his two abiding passions to present an exhaustive, fascinating, and hysterical collection of technologically enabled blunders, bloopers, and mishaps.Have you heard the story about the bank in Chicago whose computer made overnight multi-millionaires out of hundreds of its account holders? How about the man in California who was informed that he owed 39 trillion dollars in overdue library fines? Or the woman in New York state who claimed she was seeing the names of dead people on her caller-ID box?The Most \"F\" words in a Disney movie, The Most Embarrassing Open Mike Gaffe by a Politician, The Strangest Discovery by an Airport Metal Detector (a woman discovered she had a surgical retractor in her stomach)..;.these and more than one hundred other bizarre stories will definitely keep readers uproariously enthralled.",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Courage to Grieve: The Classic Guide to Creative Living, Recovery, and Growth Through Grief",
        "Authors": "By Tatelbaum, Judy",
        "Description": "This unusual self-help book about surviving grief offers the reader comfort and inspiration. Each of us will face some loss, sorrow and disappointment in our lives, and The Courage to Grieve provides the specific help we need to enable us to face our grief fully and to recover and grow from the experience. Although the book emphasizes the response to the death of a loved one, The Courage to Grieve can help with every kind of loss and grief.Judy Tatelbaum gives us a fresh look at understanding grief, showing us that grief is a natural, inevitable human experience, including all the unexpected, intense and uncomfortable emotions like sorrow, guilt, loneliness, resentment, confusion, or even the temporary loss of the will to live. The emphasis is to clarify and offer help, and the tone is spiritual, optimistic, creative and easy to understand. Judy Tatelbaum provides excellent advice on how to help oneself and others get through the immediate experience of death and the grief that follows, as well as how to understand the special grief of children. Particularly useful are the techniques for completing or \"finishing\" grief--counteracting the popular misconception that grief never ends. The Courage to Grieve shows us how to live life with the ultimate courage: not fearing death. This book is about so much more than death and grieving it is about life and joy and growth.",
        "Category": " Self-help , Death, Grief, Bereavement",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "The Neatest Little Guide to Personal Finance",
        "Authors": "By Kelly, Jason",
        "Description": "Combining sound expertise with easy-to-follow advice, a popular money-management expert discusses everything from how to figure out one's net worth to how to get out of debt and select an IRA investment program to suit one's individual needs. Original.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Intensive Group Experience",
        "Authors": "By Rosenbaum, Max and Snadowsky, Alvin M.",
        "Description": "Leading approaches to group experiences are explored through historical reviews, examinations of techniques, and analyses of recent trends. Bibliogs",
        "Category": " Social Science , General",
        "Publisher": "Free Pr",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "November",
            "Year": "1976"
        }
    },
    {
        "Title": "Adventuras Pocket Dictionary & Language Guide: Spanish and English",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Vista Higher Learning",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Distant Mountains: Encounters with the World's Greatest Mountains (Discovery Channel Books)",
        "Authors": "By Cleare, John (EDT), Cleare, John (PHT), and Discovery Channel (Firm) (COR)",
        "Description": "Spectacular full-color photography provides a dramatic study of ten of the world's extraordinary mountain ranges, from the desert region of the American Southwest to Himalayas, from South America's Patagonia to the equatorial snow peaks of East Africa. 20,000 first printing.",
        "Category": " Sports & Recreation , Mountaineering",
        "Publisher": "Discovery Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Piltdown: A Scientific Forgery",
        "Authors": "By Spencer, Frank",
        "Description": "On the night of December 18, 1912, a packed meeting of the Geological Society of London listened to Charles Dawson, a rural lawyer and an amateur geologist, make an exciting announcement: he had found evolution's missing link in an old gravel pit near Piltdown Common.  Together with Arthur Smith Woodward, Keeper of Geology at the British Museum and a noted authority on prehistoric archaeology, Dawson had discovered the shattered remnants of a thick, human-like skull together with a simian jaw--the fossils of a strange creature halfway between apes and human beings.  Though debates raged over reconstructing Piltdown Man from these remains, few doubted their authenticity--and it was not until forty years later that further tests proved they were an elaborate fake.     Written by anthropologist Frank Spencer, Piltdown tells the story of this incredible hoax, the greatest forgery in the history of modern science.  Spencer begins by taking us back to the debates in Edwardian Britain over the antiquity of Homo sapiens and the public excitement over the search for the missing link between apes and human beings.  He recounts Dawson's initial \"discovery\" of the shattered skull, the further dramatic finds made with Woodward in the midst of the furious scientific debate over Piltdown Man, and the great public argument between Woodward and Arthur Keith over the reconstruction of the head (Keith, an anatomist and Conservator of the Hunterian Museum of the Royal College of Surgeons, won fame by promoting his own theory of a very human-like version of the Piltdown skull). Spencer also traces the increasing confusion and doubt over Piltdown Man as later archaeological discoveries were made in Africa and China: the Piltdown Man didn't seem to fit the emerging picture of human evolution, and an ever-larger number of scientists claimed that the jaw did not belong with the skull.  Finally, he captures the dramatic uncovering of the hoax, closely following anthropologist Joseph Weiner's fascinating investigation in 1953.  Weiner--troubled by the inconsistencies of Piltdown Man--revealed that the remains consisted of a modern human skull and the jaw of an orangutan, treated with chemicals to simulate great age and planted at the Piltdown site.     Yet the question of who perpetrated the forgery has remained to the present day. Certainly Dawson, a rural solicitor who craved a great scientific reputation, was intimately involved.  But who provided the tremendous expertise behind the hoax, and why would such a learned authority risk his career on a highly public fake?  Was it Woodward, the great archaeologist most closely associated with the find?  Keith, the prominent anatomist?  Or was it Teilhard de Chardin, the French priest who found a critical tooth at the site?  Spencer draws on original documents from the archives of the British Museum and other sources to identify the missing conspirator, in a startling and convincing revelation.  Compelling and authoritative, Piltdown offers a gripping account of this great hoax and the final word on one of the deepest mysteries of modern science.",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Our sciences ruled by human prejudice: Humanly necessary causal blindness persisting even in sciences",
        "Authors": "By Garan, D G",
        "Description": "",
        "Category": "",
        "Publisher": "Philosophical Library",
        "Price Starting With ($)": "26.28",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Soul of a New Machine",
        "Authors": "By Kidder, Tracy",
        "Description": "Tracy Kidder's Pulitzer Prize winning phenomenon! From the bestselling author of House and Among Schoolchildren comes the astonishing true story of the \"Hardy Boys\" and \"Microkids\" of Data General Corporation--dedicated technological wizards who envisioned the impossible...then battled time, corporate intrigue and the odds to bring their dream to breathtaking lilfe. A momentous achievement, The Soul Of A New Machine is the epic an unforgettable human adventure--an enthralling celebration of the eternal spirit of American invention.",
        "Category": "",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Ghost Images",
        "Authors": "By Minot, Stephen",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "10.87",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Greenland: Island at the Top of the World",
        "Authors": "By Anderson, Madelyn Klein",
        "Description": "Explores the land and people of Greenland, which was largely unknown and underdeveloped until WW II, with a native people until recently shrouded in Stone Age habits who now face the challenge of dealing with the advances of technological society",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Origins & Evolution of Behavior Disorders",
        "Authors": "By Thomas, Alexander and Chess, Stella",
        "Description": "",
        "Category": "",
        "Publisher": "TAYLOR & FRANCIS/ ROUTLEDGE",
        "Price Starting With ($)": "6.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Peopling of Planet Earth: Human Population Growth Through The Ages",
        "Authors": "By Gallant, Roy A",
        "Description": "Discusses the urgent problems presented by population growth in a scientific analysis of the issue, from mythic accounts of the origin of humanity, to the evolution of modern technological civilization",
        "Category": "",
        "Publisher": "Macmillan Publishing Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Outdoor structures (Home repair and improvement)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Home Security (Home Repair and Improvement)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Masonry",
        "Authors": "By Time-Life Books",
        "Description": "Clarifies the basics of working with brick, block, stone, concrete, and tile, depicting repair and construction procedures, and calls attention to the durability of masonry and the decorative uses of various textures and patterns",
        "Category": " Technology & Engineering , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "Trials, tears, and triumph",
        "Authors": "By Rogers, Dale Evans",
        "Description": "",
        "Category": "",
        "Publisher": "F. H. Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "...and the Horse He Rode In On: The People V. Kenneth Starr",
        "Authors": "By Carville, James",
        "Description": "President Clinton's most stalwart supporter, the nationally prominent pundit offers his critique of Independent Prosecutor Kenneth Starr and his investigation of the president, charging Starr with waging a politically motivated, financially wasteful campaign. 150,000 first printing.",
        "Category": " Political Science , Government , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Do Bears Give Bear Hugs?: Library of First Questions and Answers About Animals (First Questions and Answers, No 6)",
        "Authors": "By Fqa",
        "Description": "Answers a variety of questions about animals, such as why tigers have stripes, why kangaroos have pockets, and why giraffes are so tall",
        "Category": " Science , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Testament: A Novel",
        "Authors": "By Grisham, John",
        "Description": "Troy Phelan is a self-made billionaire, one of the richest men in the United States.  He is also eccentric, reclusive, confined to a wheelchair, and looking for a way to die.  His heirs, to no one's surprise--especially Troy's--are circling like vultures.Nate O'Riley is a high-octane Washington litigator who's lived too hard, too fast, for too long.  His second marriage in a shambles, and he is emerging from his fourth stay in rehab armed with little more than his fragile sobriety, good intentions, and resilient sense of humor.  Returning to the real world is always difficult, but this time it's going to be murder.Rachel Lane is a young woman who chose to give her life to God, who walked away from the modern world with all its strivings and trappings and encumbrances, and went to live and work with a primitive tribe of Indians in the deepest jungles of Brazil.In a story that mixes legal suspense with a remarkable adventure, their lives are forever altered by the startling secret of The Testament.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Starbucks Passion for Coffee",
        "Authors": "By Olsen, Dave",
        "Description": "Coffee aficionados will find recipes, brewing tips, serving suggestions, and full-color photographs, praising the glories of America's favorite beverage, coffee, in all its forms--cappuccino, espresso, mocha, latte, and more--with facts on its history and cultivation. 250,000 first printing.",
        "Category": " Cooking , Beverages , Coffee & Tea",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Spirit-controlled Woman",
        "Authors": "By Lahaye, Beverly",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Wish Giver: Three Tales of Coven Tree",
        "Authors": "By Brittain, Bill and Glass, Andrew (ILT)",
        "Description": "A Newbery Honor Book that the New York Times called \"an eerie delight,\" The Wish Giver is an engaging literary folk story about those who get what they wish for—whether they want it or not.The people of Coven Tree are no strangers to magic. In fact, the town's very name comes from a gnarled old tree where covens of witches used to gather. Even now, imps and fiends continue to appear, frightening the townsfolk with their devilish pranks. Usually these creatures are easy to spot. They have a particular smell, or sound, or way of moving, that betrays their dark nature. But Thaddeus Blinn showed none of these signs when he came to Coven Tree. He was just a funny little man who drifted into town with a strange tale about being able to give people whatever they wished—for only fifty cents.There was nothing scary about him. At least, not until the wishing began...",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2019"
        }
    },
    {
        "Title": "Doomsday Disciples (Mack Bolan The Executioner 49)",
        "Authors": "By Pendelton, Don",
        "Description": "Doomsday Disciples by Don Pendleton released on Nov 24, 1982 is available now for purchase.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "Power Play (The Destroyer, No. 36)",
        "Authors": "By Richard Sapir, Warren Murphy",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle Books, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Matt Christopher's Baseball Jokes and Riddles",
        "Authors": "By Christopher, Matt, Vasconcellos, Daniel (ILT), and True, S. (EDT)",
        "Description": "A collection of wacky jokes, riddles, puns, and anecdotes about America's favorite pastime is gathered by a favorite young sports fiction writer and is guaranteed to liven up locker rooms and baseball diamonds alike. Original.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Coming Apart at the Seams: How Baseball Owners, Players, and Television Executives Have Led Our National Pastime to the Brink of Disaster",
        "Authors": "By Sands, Jack and Gammons, Peter",
        "Description": "But can baseball survive? For years, it has.Yet now, as the national pastime aims toward the twenty-first century, the game is beset with monumental problems. Player salaries are out of sight. Television revenues are about to plummet. Several clubs are up for sale. Others claim they have great difficulty in making their team payroll. Newspaper columnists everywhere complain that the games run too long and that the World Series games start too late for the next generation of baseball fans to watch them.Baseball insiders argue that the talent pool at the major league level is extremely thin - and now, two new expansion teams come into existence in the spring of 1993. Poll after poll shows that not only has the National Football League long passed baseball as America's favorite, but that the National Basketball Association has already bypassed major league baseball as well. And of course, since the owners forced Fay Vincent to quit, there hasn't been a commissioner to grapple with all these knotty problems.And so the sport of baseball rumbles on, without any real direction nor any long-range plan to deal with its pressing concerns. Indeed, the future of what was once a leisurely pastime hangs in the balance.Like an old ball that has been smacked around once too often, major league baseball is quickly coming apart at the seams.",
        "Category": " Business & Economics , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "The Habit of Widowhood",
        "Authors": "By Barnard, Robert",
        "Description": "A young girl is brought up in seclusion by her elderly parents who are obsessed with isolating her from the sinfulness of life in the wicked world. When, to secure her future, they marry her off to an elderly widower, they set in motion events more terrible than the most hateful of parents could have foreseen.A woman with an enticing sexual secret marries an elderly gentleman - and then another and another. It is all too easy, it seems, to get into the habit of widowhood.A young soldier, home from World War I, is determined to live and love not just for himself, but for all his fallen comrades. But in doing so he enrages a number of husbands.A man going through a midlife crisis meets the bully who made his life hell at school. Some things never change, he discovers, including the taste for inflicting pain.And Albert Edward, Prince of Wales, marooned in the drafty gloom of Queen Victoria's Balmoral Castle, decides that adultery and gambling can be almost as troubling as how to spell words of more than one syllable.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Love is a decision: Ten proven principles to energize your marriage and family",
        "Authors": "By Gary Smalley",
        "Description": "",
        "Category": "",
        "Publisher": "Word",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Borrowers (Borrowers, 1)",
        "Authors": "By NORTON, MARY, Krush, Beth (ILT), and Krush, Joe (ILT)",
        "Description": "The Borrowers—the Clock family: Homily, Pod, and their fourteen-year-old daughter, Arrietty, to be precise—are tiny people who live underneath the kitchen floor of an old English country manor. All their minuscule home furnishings, from postage stamp paintings to champagne cork chairs, are “borrowed” from the “human beans” who tromp around loudly above them. All is well until Pod is spotted upstairs by a human boy! Can the Clocks stay nested safely in their beloved hidden home, or will they be forced to flee? The British author Mary Norton won the Carnegie Medal for The Borrowers in 1952, the year it was first published in England. This repackaged paperback edition still has the delightful original black-and-white illustrations by Beth and Joe Krush inside. A charmer!Awards: 1952 Carnegie Medal, a Lewis Carroll Shelf Award BookDon’t miss the other classics in the Borrowers series: The Borrowers Afield, The Borrowers Afloat, The Borrowers Aloft, and The Borrowers Avenged.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Object-Oriented Technology: A Manager's Guide",
        "Authors": "By Taylor, David A.",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Addison-Wesley Pub (Sd)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "When She Was Bad: The Story of Bess, Hortense, Sukhreet & Nancy",
        "Authors": "By Alexander, Shana",
        "Description": "Examines the roles of four women in the Bess Myerson scandal, involving a New York City public administrator who used her position to benefit her married lover, and traces its significance for the women's movement",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Tutankhamen: Life and Death of a Pharaoh",
        "Authors": "By Christiane Desroches-Noblecourt",
        "Description": "",
        "Category": "",
        "Publisher": "NEW YORK GRAPHIC SOCIETY",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "The Frog King",
        "Authors": "By Davies, Adam",
        "Description": "",
        "Category": "",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Dog Handling: A Novel",
        "Authors": "By Naylor, Clare",
        "Description": "A hilarious and hip novel for every girl who’s been desperate to find a way into her dream-man’s heart–and discovered that love is more finicky than a Chihuahua in a Prada handbag.Yesterday, Liv Elliot had it all: a great flat in London’s Notting Hill, an actual career (okay, as an accountant), and a fiancé with whom she was only weeks away from wedded bliss. Every girl’s dream, right? But then Tim declared that the wedding was off–leaving Liv shell-shocked. Luckily, she’s got her best friend’s fab Australian beach house in which to recuperate. The restorative powers of the Sydney sun, sand, and sea soon have Liv feeling wonderfully careless, wanton, and reckless. Things really couldn’t get any more anti-accountant when she runs into old flame Ben Parker. It’s been years since they fooled around on their summer vacation, but Liv never forgot that genetically-blessed face. Raring to help her land beautiful Ben, Liv’s friends teach her the Rules of Dog Handling: Treat a man like a dog, and he’ll be eating out of your hand. But surely this can’t actually work? Liv is about to find out that it can–but she’s hardly prepared for the unexpected results.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Dana's Valley",
        "Authors": "By Oke, Janette and Logan, Laurel Oke",
        "Description": "Erin Walsh thinks her family is as close to perfect as it can be.  When one grim diagnosis is all it takes to shake her family to the core, she wonders if they can ever go back to they way they were.  Erin's attempts to go about life as usual feel empty and as each member of her family seems to struggle alone, she is about ready to give up on God.  However, Erin has yet to learn that God will never give up on her.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Young Musician's Survival Guide: Tips from Teens & Pros",
        "Authors": "By Nathan, Amy",
        "Description": "Learning to play a musical instrument can be fun, but also quite a burden at times. Young people not only have to find time to practice in the midst of their super-busy schedules. They also have to deal with such tricky problems as taming performance jitters, handling pesky peers, mastering challenging pieces, preparing for rigorous competitions, and dealing with demanding conductors. This lively, highly accessible book will help young people with some of the difficulties involved in learning a new instrument. It is filled with practical tips from more experienced teens and from well-known professional musicians. Numerous studies have demonstrated that children relate much better to advice from an age group closer to their own. That is why 150 teens from renowned musical programs, such as the Juilliard School's Pre-College Program and Boston University's Tanglewood Institute--offer pointers on coping with the various problems they encountered at an earlier age. Both youngsters and adults will also benefit from the practical advice given by nineteen professional musicians, including Wynton Marsalis, Paula Robison, James Galway, Andre Watts, Joshua Bell, and Evelyn Glennie. They tell us how they tackled these same problems when they were kids, and how they handle them today. An extensive resource guide at the end of the book, complete with web address listings, both directs readers to sources of additional help and helps them in their exploration of the world of music. If you are the parent of a child with musical ability, or if your son or daughter is trying to master a musical instrument, this book is the kind of gift that will save a lot of headaches for both you and your youngsters.",
        "Category": " Juvenile Nonfiction , Music , Instruction & Study",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Ride The Tiger To The Mountain: Tai Chi For Health (Portable Stanford)",
        "Authors": "By Lee, Martin, Johnstone, Joan, and Lee, Emily",
        "Description": "T’ai Chi Ch’uan is an ?inner martial art,” a set of beautifully slow, continuous movements based on ancient Chinese philosophy and medicine. Here is a practical guide to the twelve most basic T’ai Chi exercises, a program for relaxation and surprising physical rejuvenation through greater mind-body awareness, which can also bring improvement in conditions ranging from ulcers to arthritis to high blood pressure.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "DK Biography Abraham Lincoln: A Photographic Story of a Life",
        "Authors": "By Stone, Tanya Lee",
        "Description": "Abraham Lincoln, sixteenth president of the United States, led the nation through its darkest hour-the Civil War. Find out about Lincoln's childhood on a frontier farm, how a struggling small town lawyer became president, and why he became one of America's most revered leaders. In this groundbreaking new series, DK brings together fresh voices and DK design values to give readers the most information-packed, visually exciting biographies on the market today. Full-color photographs of people, places, and artifacts, and sidebars on related subjects add dimension and relevance to stories of famous lives that students will love to read. Modern scholarship and a variety of narrative approaches give today's reader a chance to explore the extraordinary world of Abraham Lincoln. This new way of looking at classic subjects creates a unique reading experience that breathes life into the book-report and summer-reading repertoire. Supports the Common Core State Standards.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Political",
        "Publisher": "DK CHILDREN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Outlaw Sea: A World of Freedom, Chaos, and Crime by Langewiesche, William (2005) Paperback",
        "Authors": "By Langewiesch, William",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar Straus Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The New Leaders: Leadership Diversity in America (J-B US non-Franchise Leadership)",
        "Authors": "By Morrison, Ann M.",
        "Description": "By the year 2000, white males will represent less than one third of the American workforce. In this universally praised work, Ann Morrison, co-author of Breaking The Glass Ceiling, becomes the first to offer companies practical strategies for moving tomorrow's new leaders -- white women and people of color -- into the executive ranks. Using personal interviews with nearly 200 managers in organizations noted for their model diversity programs, Morrison presents a very definite, step-by-step action plan that will prove invaluable to leaders looking to guide their businesses into the next century.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Voluntary Simplicity: Toward a Way of Life That Is Outwardly Simple, Inwardly Rich (Revised edition)",
        "Authors": "By Elgin, Duane",
        "Description": "When Voluntary Simplicity was first published in 1981, it quickly became recognized as a powerful and visionary work in the emerging dialogue over sustainable ways of living.  Now, more than ten years later and with many of the planet's environmental stresses having become more urgent than ever, Duane Elgin has revised and updated his revolutionary book.Voluntary Simplicity is not a book about living in poverty; it is a book about living with balance.  It illuminates the pattern of changes that an increasing number of Americans are making in their everyday lives -- adjustments in day-to-day living that are an active, positive response to the complex dilemmas of our time.  By embracing, either partially or totally, the tenets of voluntary simplicity -- frugal consumption, ecological awareness, and personal growth -- people can change their lives.  And in the process, they have the power to change the world. First published in 1981, Voluntary Simplicity was instantly recognized as a visionary work.  The New York Times called it \"seminal\"; the Wall Street Journal noted that it was \"considered the movement's Bible.\" Revised in 1993 to address the trend toward downshifting, this pertinent book helps us to adjust our thoughts, habits, and goals and embrace the key elements of simplicity: frugal consumption, ecological awareness and personal growth.",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Quill (William Morrow)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Escape to Freedom: The Underground Railroad Adventures of Callie and William (I Am American)",
        "Authors": "By Simon, Barbara Brooks",
        "Description": "The year is 1858, and a 14-year old house servant named Callie and another young slave named William attempt a daring escape on the Underground Railroad. Traveling by night, these brave teens come across things they cannot believe, such as an African-American newspaper published by escaped slave Frederick Douglass, all the while amazingly avoiding capture.Barbara Brooks weaves fact-based oral histories of the fictional characters Callie and William with rich period photographs, maps, and/or illustrations on every page, that place the adventures squarely within the era.",
        "Category": " Juvenile Nonfiction , People & Places , United States , African American",
        "Publisher": "National Geographic Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Media Wizards: Behind The Scen",
        "Authors": "By Gourley, Catherine",
        "Description": "Explores the various tools advertisers, broadcasters, and others involved in the media use to impart messages to the public, describing both historical and contemporary media events and phenomena",
        "Category": " Young Adult Nonfiction , Curiosities & Wonders",
        "Publisher": "21st Century",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Never Be Tired Again!",
        "Authors": "By Gardner, David C. and Beatty, Grace Joely",
        "Description": "A step-by-step program intended to change life-styles and triple energy levels in just seven days. The authors show how painlessly chronic fatigue can be cured.",
        "Category": " Medical , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "The Defeat of Imperial Germany, 1917-1918 (Major Battles and Campaigns)",
        "Authors": "By Paschall, Rod",
        "Description": "The Defeat of Imperial Germany, 1917-1918 by Rod Paschall is the first volume in the Major Battles and Campaigns series under the general editorship of John S. D. Eisenhower. Designed for the \"armchair strategist,\" this book offers striking proof of the inaccuracy of the conventional depiction of the trench warfare of the First World War, in which commanding generals are seen as mediocre and unimaginative, having stubbornly sent hundreds of thousands of troops over the top to be mowed down by the lethal weaponry of modern war. Paschall builds a compelling case that the generals on both sides invented ingenious new strategies that simply failed in the context of a war of attrition. In a series of vivid analyses of successive offenses, Paschall describes the generals' plans, how their plans were aimed at dislodging the entrenched enemy and restoring maneuver and breakthrough on the Western Front, and what happened when the massed soldiery under their command sought to carry out their orders. Though these strategies and tactics largely failed at the time, they would prove successful when implemented twenty years later during World War II. Dozens of photographs, many never before published, as well as theater and battlefield maps help make The Defeat of Imperial Germany, 1917-1918 an outstanding and original contribution to the body of knowledge of the Great War.",
        "Category": " History , Military , Wars & Conflicts (Other)",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The I Hate Republicans Reader: Why the GOP Is Totally Wrong About Everything (\"I Hate\" Series, The)",
        "Authors": "By Willis, Clint (EDT)",
        "Description": "Few have the time or constitution to be able to remember the details of every horror story about how the Republican Party has repeatedly attempted to hijack the American dream for its own selfish reasons. For those who want to be sure they’re not left sputtering in an argument they know they should win hands-down, The I Hate Republicans Reader—via a wide range of lively and entertaining essays, articles, speeches, and rants—will be the place to go for the many compelling reasons to detest the GOP. From era-defining scandals such as Watergate, Iran-Contra, and Enron to coldhearted policies on health care, welfare, and race, to their outrageous theft of the 2000 election and tearing down of the liberal democratic ideals for which the Founding Fathers fought, to the isolationist arrogance of George W. Bush, this book has it all. Divided into such easy-reference sections as Greed, Corruption, Malicious Stupidity, and Big Lies, this collection includes appropriate excerpts from the likes of Eric Schlosser, Michael Moore, Joan Didion, Molly Ivins and Lou Dubose, and David Brock, as well as Ralph Nader, Paul Krugman, Hunter S. Thompson, Barbara Ehrenreich, I.F. Stone, Jimmy Carter, James Carville, Christopher Hitchens, Al Franken, and Bill Moyers.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Thunder's Mouth Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Messiah: The Wordbook for the Oratorio",
        "Authors": "By Moser, Barry (ILT) and Handel, George Frideric",
        "Description": "A gift edition of the wordbook to accompany Handel's famous, beloved oratorio, with striking watercolors, celebrates the 250th anniversary of the work's premiere performance.",
        "Category": " Music , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Hero-Surfing",
        "Authors": "By Sheldon, Anne",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Washington Writers Pub House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Washington Square",
        "Authors": "By James, Henry",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Vintage Books / The Library of America",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    }
]