[
    {
        "Title": "The dictionary of cliches",
        "Authors": "By Rogers, James T.",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Container Gardening Through the Year (DK Living)",
        "Authors": "By Hillier, Malcolm",
        "Description": "Features more than sixty planting projects, with plant quantities, pot dimensions, and growing details for each",
        "Category": " Gardening , Container",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Death Rides a Chestnut Mare (A Rough Justice Western)",
        "Authors": "By Compton, Ralph",
        "Description": "A woman sates her lust for vengeance in this Ralph Compton western...  Waylaid by a pack of murdering outlaws, Daniel Strange's lifeless body is left dangling at the end of a rope. Now, a mysterious gunslinger is on the vengeance trail, packing Strange's trademark twin Colts, and answering to the same name. With fiery green eyes and a temper to match, he won't stop until every last man who killed Strange shares the same fate. And as each bullet finds its mark, his victims will die never knowing the truth: that Daniel Strange may be dead and buried, but his daughter is alive—and killing...More Than Six Million Ralph Compton Books In Print!",
        "Category": " Fiction , Westerns",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Yellow Yacht (A to Z Mysteries)",
        "Authors": "By Gurney, John Steven (ILT) and Roy, Ron",
        "Description": "Help Dink, Josh, and Ruth Rose solve mysteries from A to Z!    Kids love collecting the entire alphabet and super editions! With over 8 million copies in print, the A to Z Mysteries® have been hooking chapter book readers on mysteries and reading for years. Now this classic kid favorite is back with a bright new look!   Y is for Yacht . . . There’s trouble in paradise! The kids are having a great time swimming, snorkeling, and soaking up the sun in Costra. But the fun is cut short when there’s a robbery on the island. Is the heist connected to a mysterious yacht docked nearby? It’s up to Dink, Josh, and Ruth Rose to find out.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "On-the-go cook book",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Insight: Case Files From the Psychic World (LARGE PRINT)",
        "Authors": "By Sylvia Brown, Lindsey Harrison",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Wedding Girl",
        "Authors": "By Wickham, Madeleine",
        "Description": "At the age of eighteen, in that first golden Oxford summer, Milly was up for anything. Rupert and his American lover, Allan, were an important part of her new, exciting life, so when Rupert suggested to her that she and Allan should get married to keep Allan in the country, Milly didn’t hesitate. Ten years later, Milly is a very different person and engaged to Simon—who is wealthy, serious, and believes her to be perfect. Milly’s secret history is locked away so securely she has almost persuaded herself that it doesn’t exist—until, only four days before her elaborate wedding. To have and to hold takes on a whole new meaning when one bride’s past catches up with her and bring the present crashing down. With her trademark style of keen insight, and razor sharp wit, Madeleine Wickham introduces her fanatical fan-base, plus a host of new readers to a fresh and irresistible heroine in The Wedding Girl.",
        "Category": " Fiction , Women",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Julius Caesar (Shakespeare, Signet Classic)",
        "Authors": "By Shakespeare, William, Rosen, William, and Rosen, Barbara",
        "Description": "The Signet Classics edition of Shakespeare's timeless tragedy of conspiracy and betrayal.In the first of his Roman history plays, the Bard tells the story of the murder of Julius Caesar and the gruesome aftermath as Rome descends into a violent mob.This revised Signet Classics edition includes unique features such as: • An overview of Shakespeare's life, world, and theater • A special introduction to the play by the editor, William and Barbara Rosen• Selections from Plutarch's Lives of Noble Grecians and Romans, the source from which Shakespeare derived Julius Caesar • Dramatic criticism from Roy Walker, Maynard Mack, Richard David, and others • A comprehensive stage and screen history of notable actors, directors, and productions • Text, notes, and commentaries printed in the clearest, most readable text • And more...",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Even Money",
        "Authors": "By Francis, Dick and Francis, Felix",
        "Description": "The New York Times-bestselling authors return with a heart-stopping new novel.O n the first day of Royal Ascot, the world's most famous horse race, the crowd rejoices in a string of winning favorites. Ned Talbot has worked all his life as a bookmaker- taking over the family business from his grandfather- so he knows not to expect any sympathy from the punters as they count their winnings, and he his losses. He's seen the ups and downs before-but, as the big gambling conglomerates muscle in on small concerns like his, Ned wonders if it's worth it any more. When a gray-haired man steps forward from the crowd claiming to be his father, Ned's life is thrown into far deeper turmoil. He'd been told since he was a baby that his parents had died in a car crash. Barely an hour later, his newly found father is stabbed by an unknown assailant in the Ascot parking lot. Blood oozing from his abdomen, his father warns Ned to \"be very careful.\" But of whom? Of what? Ned finds himself in a race to solve his father's riddle-a race where coming in second could cost him more than even money-it could cost him his life. . . .",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Doctor Dines in Prague (Dr. Andrew Fenimore, 4)",
        "Authors": "By Hathaway, Robin",
        "Description": "Dr. Andrew Fenimore is a Philadelphia general physician who still makes house calls - even when they're in New Jersey - and whose resume, were he to be so immodest as to prepare one, would include triumphs over wicked Homo sapiens as well as dangerous bacillae. In other words, he's a crack amateur detective.It has been his habit to call his Czech cousin every week, and he is especially eager to be in touch with her and her family now, as Anna is to bring her husband, Vlasta, to Philadelphia for heart surgery soon. When he is unable to reach them, he immediately flies back to Prague. If his concern is misplaced, well, he'd always meant to visit the \"most beautiful city in Europe,\" where his mother grew up.One small mystery is solved almost immediately when the doctor finds the apartment inhabited. For two weeks, Anna's nine-year-old daughter, Marie, has been hiding there, sleeping in the giant oven of the traditional stove, living on crackers and whatever else she could find in the pantry since two men with guns had taken her parents away.Fenimore smuggles young Marie off to Philadelphia, where his secretary, Mrs. Doyle, will care for her, and remains in Prague to find Anna and Vlasta. He looks up one of their colleagues at the university - a large, loud, and somewhat frighteningly flirtatious woman who insists on taking him sightseeing. He can only hope that the tour she takes him on will lead to information about his relatives. Instead, it leads him, first, to a puppet show (a popular feature of Czech culture) on the life of the Emperor Charles IV, and from there into a disturbing maelstrom of crazed ambition and a terrorist plan that would devastate the city. With luck Fenimore is able to block the plan and find his family, but only after the murder of a Czech citizen and a threat to Fenimore's own freedom - and possibly his life.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Much Ado about Nothing (The Pelican Shakespeare)",
        "Authors": "By Shakespeare, William and Holland, Peter (EDT)",
        "Description": "The acclaimed Pelican Shakespeare series edited by A. R. Braunmuller and Stephen Orgel   The legendary Pelican Shakespeare series features authoritative and meticulously researched texts paired with scholarship by renowned Shakespeareans. Each book includes an essay on the theatrical world of Shakespeare’s time, an introduction to the individual play, and a detailed note on the text used. Updated by general editors Stephen Orgel and A. R. Braunmuller, these easy-to-read editions incorporate over thirty years of Shakespeare scholarship undertaken since the original series, edited by Alfred Harbage, appeared between 1956 and 1967. With definitive texts and illuminating essays, the Pelican Shakespeare will remain a valued resource for students, teachers, and theater professionals for many years to come.   For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Goodbye, Vietnam",
        "Authors": "By Whelan, Gloria",
        "Description": "\"When Mai's family discovers that Vietnam government soldiers will soon apprehend her father and grandmother, the family slips away in the night. They trudge through the swamps of the Mekong Delta toward the sea. The gut-wrenching trip to Hong Kong is just another step toward a new life, which the family eventually finds. Whelan's characters are distinctive, and her story is riveting, haunting, and memorable, reflecting the human virtues of determination, hope, love, and courage in the face of the most devastating of circumstances and injustices.\"--Booklist.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Bhagavadgita (Dover Thrift Editions)",
        "Authors": "By Arnold, Edwin (TRN)",
        "Description": "The Bhagavadgita is part of the great Indian epic the Mahabharata, and it is one of the major religious documents of the world, occupying in Hinduism a position not unlike the Sermon on the Mount in Christianity. One of the most celebrated treasures of world literature as well, it is in the form of a poetic dialogue between the epic's hero, Arjuna, and his friend Krishna, believed to be an incarnation of God.The dialogue, which takes place on the eve of an historic battle, probes the nature of God and what man should do to reach him. As the Bhagavadgita unfolds, this majestic poem provides a fascinating synopsis of the religious thought and experience of India through the ages. This edition offers the classic English verse translation by Sir Edwin Arnold (1832–1904), long admired for its evocation of the true feeling of the original poetry.",
        "Category": " Philosophy , Eastern",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Limits of Power: The End of American Exceptionalism (American Empire Project)",
        "Authors": "By Bacevich, Andrew J.",
        "Description": "From an acclaimed conservative historian and former military officer, a bracing call for a pragmatic confrontation with the nation's problemsThe Limits of Power identifies a profound triple crisis facing America: the economy, in remarkable disarray, can no longer be fixed by relying on expansion abroad; the government, transformed by an imperial presidency, is a democracy in form only; U.S. involvement in endless wars, driven by a deep infatuation with military power, has been a catastrophe for the body politic. These pressing problems threaten all of us, Republicans and Democrats. If the nation is to solve its predicament, it will need the revival of a distinctly American approach: the neglected tradition of realism.Andrew J. Bacevich, uniquely respected across the political spectrum, offers a historical perspective on the illusions that have governed American policy since 1945. The realism he proposes includes respect for power and its limits; sensitivity to unintended consequences; aversion to claims of exceptionalism; skepticism of easy solutions, especially those involving force; and a conviction that the books will have to balance. Only a return to such principles, Bacevich argues, can provide common ground for fixing America’s urgent problems before the damage becomes irreparable.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Metropolitan Books",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Get Ready for Battle",
        "Authors": "By Jhabvala, Ruth Prawer",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Corporate Information Strategy and Management:  Text and Cases",
        "Authors": "By Applegate, Lynda M., Austin, Robert D., and McFarlan, F. Warren",
        "Description": "Corporate Information Strategy and Management: Text and Cases 7/e by Applegate, Austin and McFarlan is written for students and managers who desire an overview of contemporary information systems technology management. It explains the relevant issues of effective management of information services activities and highlights the areas of greatest potential application of the technology. No assumptions are made concerning the reader’s experience with IT, though it is presumed that the reader has some course work or work experience in administration and/or management. This text is comprised of an extensive collection of Harvard Business cases devoted to Information Technology.",
        "Category": " Computers , Management Information Systems",
        "Publisher": "McGraw-Hill/Irwin",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Common Purpose: Strengthening Families and Neighborhoods to Rebuild America",
        "Authors": "By Schorr, Lisbeth B.",
        "Description": "In her previous book, Within Our Reach, renowned Harvard social analyst Lisbeth Schorr examined pilot social programs that were successful in helping disadvantaged youth and families. But as those cutting-edge programs were expanded, the very qualities that had made them initially successful were jettisoned, and less than half of them ultimately survived. As a result, these groundbreaking programs never made a dent on the national or statewide level.Lisbeth Schorr has spent the past seven years researching and identifying large-scale programs across the country that are promising to reduce, on a community- or citywide level, child abuse, school failure, teenage pregnancy, and welfare dependence. From reformed social service agencies in Missouri, Michigan, and Los Angeles to \"idiosyncratic\" public schools in New York City, she shows how private and public bureaucracies are successfully nurturing programs that are flexible and responsive to the community, that have set clear, long-term goals, and that permit staff to exercise individual judgment in helping the disadvantaged. She shows how what works in small-scale pilot social programs can be adapted on a large scale to transform whole inner-city neighborhoods and reshape America.On the heels of the federal government's dismantling of welfare guarantees, Common Purpose offers a welcome antidote to our current sense of national despair, and concrete proof that America's social institutions can be made to work to assure that all the nation's children develop the tools to share in the American dream.",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Character Matters: How to Help Our Children Develop Good Judgment, Integrity, and Other Essential Virtues",
        "Authors": "By Lickona, Thomas",
        "Description": "Award-winning psychologist and educator Thomas Lickona offers more than one hundred practical strategies that parents and schools have used to help kids build strong personal character as the foundation for a purposeful, productive, and fulfilling life.Succeeding in life takes character, and Lickona shows how irresponsible and destructive behavior can invariably be traced to the absence of good character and its ten essential qualities: wisdom, justice, fortitude, self-control, love, a positive attitude, hard work, integrity, gratitude, and humility.  The culmination of a lifetime’s work in character education from one the preeminent psychologists of our time, this landmark book gives us the tools we need to raise respectful and responsible children, create safe and effective schools, and build the caring and decent society in which we all want to live.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Pocket Stylist: Behind-the-Scenes Expertise from a Fashion Pro on Creating Your Own Look",
        "Authors": "By Farr, Kendall and Kroencke, Anja (ILT)",
        "Description": "A celebrity fashion stylist draws on the insider tricks and techniques of her trade to help women create their own fashion look, with practical advice on selecting the right wardrobe, from how to take one's true measurements to ensure the right fit and when to use a tailor to the best fabrics, trendy versus classic fashions, lingerie, and accessories. 35,000 first printing.",
        "Category": " Design , Fashion & Accessories",
        "Publisher": "Avery",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Psychic Children: Revealing the Intuitive Gifts and Hidden Abilities of Boys and Girls",
        "Authors": "By Browne, Sylvia and Harrison, Lindsay (CON)",
        "Description": "The celebrity psychic best known for her weekly appearances on the Montel show invites readers to recognize the psychic potential of all children as a God-granted blessing, urging for greater public acceptance of children with remarkable psychic abilities. By the author of Insight. 100,000 first printing.",
        "Category": " Body, Mind & Spirit , Parapsychology , ESP (Clairvoyance, Precognition, Telepathy)",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "The Sound of Music - Vocal Selection",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Williamson",
        "Price Starting With ($)": "7.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "The Collier quick and easy guide to playing the guitar (A Collier Books original)",
        "Authors": "By Noad, Frederick M",
        "Description": "",
        "Category": "",
        "Publisher": "Collier Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Appetizers on the Grill: Innovative Hors D'Oeuvres, Pizzas, Gourmet Sandwiches, and Light Entrees",
        "Authors": "By Grunes, Barbara",
        "Description": "The author of Fish on the Grill, The Beef Lover's Great Grill Book, and Poultry on the Grill turns her sizzling expertise to the art of snacking with more than eighty recipes for gourmet appetizers. Original.",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "Chicago Review Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "PlayTime Piano Rock 'n Roll",
        "Authors": "By Nancy & Randall Faber",
        "Description": "",
        "Category": "",
        "Publisher": "The FJH Music Company Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Six Ingredients or Less: Cooking Light & Healthy",
        "Authors": "By Johnson, Carlean",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "C J Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Into the Buzzsaw: Leading Journalists Expose the Myth of a Free Press",
        "Authors": "By Vidal, Gore (FRW) and Borjesson, Kristina (EDT)",
        "Description": "The buzzsaw is what reporters call the powerful system of censorship in the US that is revealed to those investigating extremely sensitive stories, usually having to do with high-level government or corporate malfeasance. Here a group of journalists, who usually avoid collaboration and the spotlight, risk the blade by describing their encounters with it. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Social Science , General",
        "Publisher": "Prometheus Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Queen Victoria: born to succeed,",
        "Authors": "By Longford, Elizabeth (Harman) Pakenham",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "The Day Kennedy Was Shot",
        "Authors": "By Jim Bishop",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Down by the Riverside: A South Carolina Slave Community (Blacks in the New World)",
        "Authors": "By Joyner, Charles",
        "Description": "",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "University of Illinois Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Well-crafted Argument",
        "Authors": "By White, Fred D. and Billings, Simone J.",
        "Description": "The Well-Crafted Argument guides students through the process of writing effective argumentative essays across the disciplines. The two-part structure of this rhetoric/reader includes a complete pedagogical apparatus--with coverage of reading, writing, and researching a topic--and an anthology of readings grouped into eight thematic clusters. In-depth instruction, combined with real student writings, engages students and helps them discover their own voices. The Third Edition features a greater emphasis on visual argument, while maintaining the authors' practical, skill-building approach. Each chapter ends with a summary, checklist, and writing projects that allow students to apply what they learn. In addition to guidance on drafting and revising arguments, the authors provide a variety of composition strategies, from free-writing to outlining. Active reading tools, such as note-taking, summary writing, and shared reading, are also encouraged.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Jackie Robinson (Heroes of America / Illustrated Lives)",
        "Authors": "By Joshua Hanft",
        "Description": "",
        "Category": "",
        "Publisher": "Baronet Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Italian Cooking with Olive Oil",
        "Authors": "By Seed, Diane and Hocombe, Sarah (ILT)",
        "Description": "The author of The Top One Hundred Pasta Sauces presents regional Italian recipes that use olive oil, including such dishes as Deviled Spaghetti, Fisherman's Risotto, Ricotta Fritters, and Tuscan Fried Chicken with Artichokes. 50,000 first printing.",
        "Category": "",
        "Publisher": "William Morrow and Company, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Busy Girl's Guide to Looking Great: Time-Saving Ideas for Fitting Exercise, Diet, Fashion, and Beauty into Every Day",
        "Authors": "By Caroline Jones",
        "Description": "",
        "Category": "",
        "Publisher": "Unknown",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "West Highland White Terriers (Kw Dog Breed Library)",
        "Authors": "By Weil, Martin",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Maps and Globes (Reading Rainbow Book)",
        "Authors": "By Knowlton, Jack",
        "Description": "This comprehensive look at geography and the environment, Maps and Globes, can take you anywhere—to the top of the tallest mountain on earth or the bottom of the deepest ocean. Maps tell you about the world: where various countries are located, where the jungles and deserts are, even how to find your way around your own hometown. If you take a fancy to any place on earth, you can go there today and still be home in time for dinner. So open a map, spin a globe. The wide world awaits you.Supports the Common Core State Standards",
        "Category": " Juvenile Nonfiction , History , Exploration & Discovery",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Eat More Dirt: Diverting and Instructive Tips for Growing and Tending an Organic Garden",
        "Authors": "By Sandbeck, Ellen",
        "Description": "A witty, whimsical gardening primer for anyone who wants to tend their patch of earth with a truly green thumb.A garden can either bring you bliss or drive you insane, but organic landscape gardener Ellen Sandbeck has spent a lifetime discovering creative, effective techniques for growing and tending a garden with ease—while being kind to the earth itself. Eat More Dirt is her delightful compendium of homespun tips and tricks for designing, planting, nurturing, and beautifying your land without the use of harmful chemicals and pesticides. From peat moss to irksome pests and predators, Sandbeck explores the lively world of compost heaps (which can be used to naturally “vaccinate” your garden against disease), growing good soil, choosing plants well-adapted to your climate, weed warfare, planting protocols, and eco-friendly ways to quench your garden’s thirst. Whether you tend an acre or just a window box, Eat More Dirt is an essential guide to keeping your garden thriving, the natural way. • Build up topsoil without toxic fertilizers or noisy machinery  •  Compost, the other black gold•  Eradicate weeds with sunflower seeds  •  Protect berries from birds with a sugar-water spray •  Gentle pruning techniques  • Banish beetles with wheat bran • Drive off furry pests with cayenne pepper • When life hands you a seep, dig a pond—transforming garden irritants into garden pearls • Pre- and post-gardening stretches • Dancing with tools • The Zen of puttering •",
        "Category": " Gardening , Organic",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "No Bones About It #12 (Katie Kazoo, Switcheroo)",
        "Authors": "By Krulik, Nancy E., Krulik, John (ILT), and Krulik, Wendy (ILT)",
        "Description": "The class 3A trip to the Natural History Museum is turning out to be a disaster:  Many of Katie's excited classmates are acting up, and they turn on Katie and call her a goodie-goodie when she won't join in!  Even worse, their tour guide, Mr.  Weir, is a big meanie!  Still, when Katie turns into Mr. Weir and causes a big disaster of her own, it's up to her to make things right-and save Mr. Weir's job!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Strangers",
        "Authors": "By Koontz, Dean R.",
        "Description": "A group of unrelated people experience sensations of numbing terror and fear, and, groping their ways toward one another, discover their sinister, shared secrets in a climax that changes their lives forever.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Bones (Step-Into-Reading, Step 2)",
        "Authors": "By Krensky, Stephen and Jones, Davy (ILT)",
        "Description": "How many bones are there in the human body? Which bone is the longest? Or the smallest? Without bones, you would be a blob, like a jellyfish or a worm. Our bones support us and protect our insides. They work together with our muscles to allow us to do all the things we do! So when you think of your bones, say \"Thank you!\"This simple Step 2 introduction teaches young readers these facts and many more about the skeleton inside each of us!",
        "Category": " Juvenile Nonfiction , Science & Nature , Anatomy & Physiology",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Love That Dog",
        "Authors": "By Creech, Sharon",
        "Description": "The Newbery Medal-winning author of Walk Two Moons, Sharon Creech, brings readers a story with enormous heart.Love That Dog shows how one boy named Jack finds his voice with the help of a teacher, a pencil, some yellow paper, and of course, a dog. Written as a series of free-verse poems from Jack's point of view, and with classic poetry included in the back matter, this novel is perfect for kids and teachers, too.Jack hates poetry. Only girls write it and every time he tries to, his brain feels empty. But his teacher, Miss Stretchberry, won't stop giving her class poetry assignments—and Jack can't avoid them. But then something amazing happens. The more he writes, the more he learns that he does have something to say.\"I guess it doeslook like a poemwhen you see ittyped uplike that.\"",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "A Complete and Universal English Dictionary: Including, Not Only an Explanation of Difficult Words and Technical Terms... but Also, a Pronouncing Dictionary",
        "Authors": "By James Barclay",
        "Description": "",
        "Category": "",
        "Publisher": "Liverpool: The Claxton Press; Nuttall, Fisher, and Dixon",
        "Price Starting With ($)": "62.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1813"
        }
    },
    {
        "Title": "Thousand Pieces of Gold: A Biographical Novel (Asian Voices)",
        "Authors": "By McCunn, Ruthanne Lum",
        "Description": "This masterful biographical novel—which has sold more than 100,000 copies—tells the true life story of Lalu Nathoy, a young Chinese girl sold into slavery in 1871 by her poverty-stricken family and auctioned off in the American West. McCunn tells the gripping tale of how Lalu struggled out of servitude to achieve a life of freedom and dignity as a pioneer woman.\"A valuable book that gives Chinese Americans another true heroine.\" —Maxine Hong Kingston",
        "Category": " Fiction , General",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Famous Men of Medicine",
        "Authors": "By chandler, caroline",
        "Description": "",
        "Category": "",
        "Publisher": "Dodd, Mead",
        "Price Starting With ($)": "37.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "The First Rule (A Joe Pike Novel)",
        "Authors": "By Crais, Robert",
        "Description": "From the New York Times-bestselling author who sets the standard for intense, powerful crime-  writing comes a blistering thriller featuring Joe Pike and Elvis Cole.  The Watchman put Joe   Pike, Elvis Cole's strong, taciturn partner, front and center, and not only won Robert Crais new audiences but   remarkable reviews. The South Florida Sun-Sentinel said \"Robert Crais elevates crime fiction\" and now with   The First Rule he does it again. The organized criminal gangs of the former Soviet Union are   bound by what they call the thieves' code. The first rule is this: A thief must forsake his mother, father, brothers, and   sisters. He must have no family-no wife, no children. We are his family. If any of the rules are broken, it is   punishable by death. Frank Meyer had the American dream-until the day a professional crew invaded his   home and murdered everyone inside. The only thing out of the ordinary about Meyer was that- before the family and   the business and the normal life-a younger Frank Meyer had worked as a professional mercenary, with a man   named Joe Pike. The police think Meyer was hiding something very bad, but Pike does not. With the help of Cole, he   sets out on a hunt of his own-an investigation that quickly entangles them both in a web of ancient grudges, blood   ties, blackmail, vengeance, double crosses, and cutthroat criminal­ity, and at the heart of it, an act so terrible even   Pike and Cole have no way to measure it. Sometimes, the past is never dead. It's not even past. The   First Rule is the most astonishing novel yet from the master of the crime thriller.    Watch a Video",
        "Category": " Fiction , Crime",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Circle in the Sand: Why We Went Back to Iraq",
        "Authors": "By Alfonsi, Christian",
        "Description": "An important, massively researched and revelation-filled work of history that uncovers how decisions made by the first Bush White House preordained the current administration’s decision to invade Iraq.“Is this a one-time thing, or should we foreshadow more to come?”This was the prophetic question posed by National Security Adviser Brent Scowcroft in a secret April 1991 memorandum about the postwar management of Iraq, two months after the United States had defeated Iraqi forces in Operation Desert Storm—but left Saddam Hussein securely in power. Circle in the Sand challenges the widely held notion that Saddam’s survival was the result of a spur-of-the-moment decision by the first President Bush and his inner circle (especially the “Reluctant Warrior” Colin Powell) to call off the Desert Storm campaign \"one day too soon.\" Through interviews with the Bush team’s principal decision makers—including President George H.W. Bush, Dick Cheney, Brent Scowcroft, and Paul Wolfowitz—as well as hundreds of never-before-revealed White House documents, Christian Alfonsi shows how Saddam’s survival was the result of a calculated decision, albeit one with disastrous consequences, which had settled the issue of how the first Iraq war would end long before it even began. Circle in the Sand also provides the definitive account of the collapse of the first Bush administration’s Iraq policy after the war.Unprecedented in its detail about the decision making inside the Bush White House during the first Gulf War, Circle in the Sand provides not only a dramatic portrait of history in the making but also a compelling rationale for the United States’ mishandling of the current situation in Iraq. Did we invade Iraq in 2003 to ensure that George W. Bush would not suffer an electoral fate in 2004 similar to his father’s defeat in 1992? Circle in the Sand forces us to consider that disturbing scenario and its larger implications for the American war on terror.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Bible Animals (The Bible Discovery Collection, No. 1)",
        "Authors": "By Galvin, James C., Barton, Bruce B., and Kendrichs, Michael (CON)",
        "Description": "Discusses animals mentioned in the Bible, including cattle and goats, birds, snakes, and lions",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Here Comes Silent E! (Step into Reading)",
        "Authors": "By Hays, Anna Jane and Adinolfi, Joann (ILT)",
        "Description": "Research shows that early instruction in phonics is the first step to reading success. Well, here “e” comes! This Step 2 Phonics Reader uses rhyme and visual clues to illustrate the important concept of the “silent e”—personified here in our main character!Anna Jane Hays is a former editorial director and child development specialist for The Children’s Television Workshop. She lives in Santa Fe, NM.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Complete Calligrapher A Comprehensive Guide from Basic Techniques to Inspirational Alphabets",
        "Authors": "By Emma Callert",
        "Description": "",
        "Category": "",
        "Publisher": "Burlington Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "I Wonder If Dragons Are Real? (Fun Facts for Curious Kids)",
        "Authors": "By Donati, Annabelle and Barnes, Suzanne (ILT)",
        "Description": "A look at reptiles provides a definition for reptiles, examines the king cobra, tells why turtles cannot jump, and answers other pertinent questions",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Leading and Managing in Nursing",
        "Authors": "By Yoder-Wise, Patricia S. (EDT) and Yoder-Wise",
        "Description": "Offering comprehensive coverage of effective nursing leadership and management, this third edition challenges nursing students to learn the structure, concepts, and relationships of their future trade with a wide array of interactive tools. It presents the foundations and strategies for effective nursing management and leadership from role development, to the use of information and technology, to political influences within the industry. Focusing on building the complete nurse beyond actual healthcare, this new edition features a full-color design and the addition and reorganization of key chapters.Each chapter opens with The Challenge - a contemporary nurse manager's real-world concerns related to the chapter content.The Solution closes each chapter by illustrating effective methods of handling the challenges of those situations set forth in the chapter.The full-color design attracts and maintains student interest.Exercises are scattered throughout every chapter to provide a quick lesson in thinking critically as well as an opportunity to apply the chapter content to current, real-world scenarios.Theory Boxes give a brief description of relevant theory and key concepts.Research and Literature Perspectives illustrate the relevance and applicability of current studies to practice.Objectives and Questions to Consider guide students toward considering their own viewpoints or experiences with topics and issues discussed in each chapter.The glossary defines all applicable chapter terminology. Key terms are bolded in the text.A built-in Workbook, with perforated pages, enables students and instructors to evaluate learning.A chapter on Developing the Role of Leader introduces key leadership theories and cites examples of how each can be used clinically and professionally.A chapter on Leading Through Professional Associations stresses the need to be involved in professional organizations, discusses their goals and various structural formats, and provides strategies for becoming involved with major national associations.A new chapter-ending section includes the Chapter Checklist, Tips, and Terms to Know to clearly set them apart from the chapter content.",
        "Category": " Medical , Nursing , Management & Leadership",
        "Publisher": "Mosby",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "A Child's First Catholic Dictionary",
        "Authors": "By Dyches, Richard, Mustachio, Thomas, and Holmberg, Ansgar (ILT)",
        "Description": "Concisely defines terms which deal with aspects of the faith, worship, ethics, history, theology, and spirituality of the Catholic Church",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "Ave Maria Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Haley's Hints",
        "Authors": "By Haley, Graham, Haley, Rosemary, and McNiven, David (ILT)",
        "Description": "The popular Canadian television personality shares more than two thousand practical, time- and money-saving hints on cleaning, pest control, laundry, sewing, pet care, gardening, plumbing, carpentry, painting, and many other useful topics, accompanied by a helpful Easy-Find Index designed to provide quick answers to common problems. Reprint.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "MY FIRST NATURE BOOK",
        "Authors": "By Wilkes, Angela",
        "Description": "Provides an introduction to nature through a variety of simple indoor and outdoor activities including collecting seeds, feeding birds, watching a butterfly grow, and others.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Superguides: Soccer",
        "Authors": "By Lineker, Gary",
        "Description": "A beginner's guide to the skills and techniques of soccer demonstrates passing, kicking, tackling, defense, and goaltending.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Soccer",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Discerning Traveler's Guide to Romantic Hideaways of the Middle Atlantic and South Eastern States",
        "Authors": "By Glickstein, David and Glickstein, Linda",
        "Description": "A decandent meal by the flicker of candlelight, a private terrace awash in sea breezes, the radiant warmth of a wood-burning stove...the magical ingredients of a perfect romantic escape.From Old Drovers Inn in New York to Little Palm Island in Florida, the authors have selected the most idyllic hideaways in the Middle Atlantic and South Eastern states, visiting each one personally to ensure no detail is left to chance. The fifty-two inns, hotels, and bed-and-breakfasts included here each have their own distinct personality, ranging from a rustic coveside home to a luxurious country manor. Each is described fully, with an emphasis on intimate rooms, working fireplaces, claw-foot bathtubs, first-rate dining rooms, and other special touches so you can plan your ideal getaway.Includes enchanting lodgings in New York, New Jersey, Pennsylvania, Delaware, Maryland, Virginia, North Carolina, Georgia, and Florida.A decandent meal by the flicker of candlelight, a private terrace awash in sea breezes, the radiant warmth of a wood-burning stove...the magical ingredients of a perfect romantic escape.From Old Drovers Inn in New York to Little Palm Island in Florida, the authors have selected the most idyllic hideaways in the Middle Atlantic and South Eastern states, visiting each one personally to ensure no detail is left to chance. The fifty-two inns, hotels, and bed-and-breakfasts included here each have their own distinct personality, ranging from a rustic coveside home to a luxurious country manor. Each is described fully, with an emphasis on intimate rooms, working fireplaces, claw-foot bathtubs, first-rate dining rooms, and other special touches so you can plan your ideal getaway.Includes enchanting lodgings in New York, New Jersey, Pennsylvania, Delaware, Maryland, Virginia, North Carolina, Georgia, and Florida.",
        "Category": " Travel , Food, Lodging & Transportation , Bed & Breakfast",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Serious Kiss",
        "Authors": "By Hogan, Mary",
        "Description": "One summer day, Libby and her best friend hatch a plan: Before their freshman year is over, they will each have a serious kiss. Libby even has the boy picked out. But Libby's too-crazy-to-believe parents have another plan: They're moving. To the middle of nowhere. Far from Libby's friends, all hope of a normal life, and kissing, serious or otherwise.Just when things are completely falling apart, Libby starts to wonder, Is being happy really about a perfect plan? And if she stops planning, could that be the key to happiness -- and to a perfect, incredible, wonderful, serious kiss?",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Power of Positive Productivity",
        "Authors": "By Dennis E. Hensley",
        "Description": "",
        "Category": "",
        "Publisher": "Possibility Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "New England: A Photographic Journey (Photographic Journey Series)",
        "Authors": "By Forbes, Suzi",
        "Description": "Color photographs illustrate the historic homes, barns, and public buildings, cities and villages, and beautiful landscapes of Maine, New Hampshire, Vermont, Massachusetts, and Connecticut",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "The 15-Minute Organizer",
        "Authors": "By Barnes, Emilie",
        "Description": "Bestselling author and time-management expert Emilie Barnes gives women the basic strategies they need to survive in today's busy world. Realistic and practical, each chapter offers proven methods for taking the stress out of meal planning, housekeeping, finances, holiday shopping, and more. In just 15 minutes a day, readers will discover how to--whip their entire house into shape create a personalized daily planner double their closet space organize a fail-safe filing system Now with an updated cover, the 15-Minute Organizer (over 220,000 copies sold) contains more than 75 time-saving strategies on topics that include goal setting, involving children in chores, grocery shopping, and record-keeping. Women will discover they can get ahead and stay ahead.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Christmas Survival Book (Road Trip Survival Guides (Blister Packs))",
        "Authors": "By Lawhead, Alice Slaikeu",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Chariot Victor Pub",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Rebirth of Music",
        "Authors": "By Boschman, Lamar",
        "Description": "",
        "Category": " Music , Religious , Christian",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Commercial Aircraft",
        "Authors": "By Michael J. Taylor",
        "Description": "",
        "Category": "",
        "Publisher": "Exeter",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Greece and Rome",
        "Authors": "By Metropolitan Museum of Art (New York, N. Y.) (COR) and Mertens, Joan",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Metropolitan Museum of Art",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "The Rise of the Creative Class: And How It's Transforming Work, Leisure, Community, and Everyday Life",
        "Authors": "By Florida, Richard",
        "Description": "The Washington Monthly 2002 Annual Political Book Award WinnerThe Rise of the Creative Class gives us a provocative new way to think about why we live as we do today-and where we might be headed. Weaving storytelling with masses of new and updated research, Richard Florida traces the fundamental theme that runs through a host of seemingly unrelated changes in American society: the growing role of creativity in our economy.Just as William Whyte's 1956 classic The Organization Man showed how the organizational ethos of that age permeated every aspect of life, Florida describes a society in which the creative ethos is increasingly dominant. Millions of us are beginning to work and live much as creative types like artists and scientists always have-with the result that our values and tastes, our personal relationships, our choices of where to live, and even our sense and use of time are changing. Leading the shift are the nearly 38 million Americans in many diverse fields who create for a living-the Creative Class.The Rise of the Creative Class chronicles the ongoing sea of change in people's choices and attitudes, and shows not only what's happening but also how it stems from a fundamental economic change. The Creative Class now comprises more than thirty percent of the entire workforce. Their choices have already had a huge economic impact. In the future they will determine how the workplace is organized, what companies will prosper or go bankrupt, and even which cities will thrive or wither.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Financial Parenting: Showing Your Kids That Money Matters",
        "Authors": "By Burkett, Larry and Osborne, Rick",
        "Description": "With chapters on stewardship, giving, borrowing and lending, saving and budgeting, this resource includes lots of activities and interactive questions with each chapter. Perfect for children ages 5 and up.",
        "Category": " Religion , Christian Life , Family",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Uncle John's Bathroom Reader Plunges into Great Lives",
        "Authors": "By Bathroom Readers' Hysterical Society",
        "Description": "Philo T. Farnsworth is not a household word despite the fact that he invented something found in most every household: television. Farnsworth is just one of hundreds of subjects in this hefty comic compendium that plumbs the depths in a survey of great lives. Readers also learn about T’sai Lun, the Chinese eunuch who invented paper ? and by extension, toilet paper. Other clever unknowns include the inventors of Velcro, Bakelite, and the microwave oven. Of course, not all of the ?great lives” here are anonymous. The ?Fun with Heretics” section includes Thomas Paine and Rousseau, revealing some unexpected peculiarities. Liberace, Pancho Villa, and Freud happily coexist in this sometimes raunchy romp. Among the topics? ?Philosophers Who Got Killed,” ?Child Geniuses” (and its evil twin, ?High School Dropouts”), and much more.",
        "Category": " Reference , Trivia",
        "Publisher": "Portable Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "How to Know If You're Really in Love",
        "Authors": "By Shedd, Charlie W",
        "Description": "A recognized authority on the family and a nationally syndicated columnist, Dr. Shedd highlights questions that persons should ask and answer before embarking on the lifelong commitment of marriage",
        "Category": "",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Naked Empire (Sword of Truth)",
        "Authors": "By Goodkind, Terry",
        "Description": "\"You knew they were there, didn't you?\" Kahlan asked in a hushed tone as she leaned closer.Against the darkening sky, she could just make out the shapes of three black-tipped races taking to wing, beginning their nightly hunt. That was why he'd stopped. That was what he'd been watching as the rest of them waited in uneasy silence.\"Yes,\" Richard said. He gestured over his shoulder without turning to look. \"There are two more, back there.\"Kahlan briefly scanned the dark jumble of rock, but she didn't see any others.Lightly grasping the silver pommel with two fingers, Richard lifted his sword a few inches, checking that it was clear in its scabbard. A last fleeting glimmer of amber light played across his golden cape as he let the sword drop back in place. In the gathering gloom of dusk, his familiar tall, powerful contour seemed as if it were no more than an apparition made of shadows.Just then, two more of the huge birds shot by right overhead. One, wings stretched wide, let out a piercing scream as it banked into a tight gliding turn, circling once more in assessment of the five people below before stroking its powerful wings to catch its departing comrades in their swift journey west.This night they would find ample food.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "In Colt Blood",
        "Authors": "By Jaffe, Jody",
        "Description": "\"She's pure gold,\" raves The Philadelphia Inquirer about redheaded Carolina journalist and inspired snoop Natalie Gold--\"spunky, quirky, and lots of fun.\" Now Nattie's mixing it up with a crazy passel of filthy rich Southerners, a horse-whispering beauty, and one grisly murder . . . In Colt Blood.When Nattie's boss at the Charlotte Commercial Appeal orders her to find a local horse whisperer to interview, she knows just the person: yellow-haired New Age belle Sarah Jane Lowell, one of the gifted few who claims to have a psychic connection to horses. She not only talks to them, she hears what they answer. Unfortunately, before Nattie can set up a meeting, Sarah Jane vanishes along with her newfound friend: Nattie's eccentric father.Disturbingly, their sudden disappearance coincides with the brutal murder of Fuzzy McMahon, whose bludgeoned body was found at the very stable where Nattie was supposed to meet Sarah Jane. True, Fuzzy was less than popular, but who would stoop to such a bloody act of violence? Although suspicion has fallen on dark-horse candidate Sarah Jane, Nattie's splitting her money between two other front-runners: blacksmith Bobby McMahon, Fuzzy's redneck of a husband, and his tiresome cousin, Jason Sukon, who can only gain by her death--specifically millions of dollars.A sophisticated tale of reckless romance and irretrievable violence, In Cold Blood goes beyond murder to explore the mysteries of fear, love, lust, and hate. And as always, when it comes to the manners and morals of the New South, mystery author Jody Jaffe gets it right every time.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Antique Furniture Basic Primer",
        "Authors": "By Collector Books (EDT)",
        "Description": "Over 150 photos of furniture and nearly 100 line drawings of shapes, finials, legs, and decorations. Begins with Egyptian and Greek age and runs through the Early American era. For beginners as well as antiques experts.",
        "Category": " Antiques & Collectibles , Furniture",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Master Quilter (Elm Creek Quilts Series #6)",
        "Authors": "By Chiaverini, Jennifer",
        "Description": "This ninth Elm Creek Quilts novel continues the series with a tribute to matriarch Sylvia Compson, who surprised her fellow quilters by marrying her longtime sweetheart on a recent holiday. Eager to honor their favorite Master Quilter, the Elm Creek Quilters hasten to stitch a bridal quilt for the newlyweds. Until the time comes to unveil the surprise gift, Sylvia will be the one in the dark.       Such little white lies seem harmless enough. But the quilting retreat at Elm Creek Manor thrives on women sharing their creativity, their challenges and their dreams. Somehow, in their race to commemorate in the bridal quilt all they hold dear about Sylvia’s wisdom, skill and devotion, her fellow quilters forget to give honesty its pride of place.       Just when it seems that the women have everything to celebrate, forces conspire to threaten their happiness and prosperity. Two among them falter in their personal relationships, while another suffers financial problems. As still two others weigh the comfort of the present against dreams of a future far from Elm Creek Manor, closely guarded secrets strain the bonds of friendship with those who may be left behind.",
        "Category": " Fiction , Literary",
        "Publisher": "Plume",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Parables For Christmas",
        "Authors": "By Killinger, John",
        "Description": "Retells twenty-five of Jesus's parables in terms of modern-day life and our current celebration of Christmas",
        "Category": " Religion , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "American Beauty: The Shooting Script",
        "Authors": "By Ball, Alan and Mendes, Sam (INT)",
        "Description": "On a typical suburban street in a typical suburban town,there is an ordinary family living the American dream. But look closer. Lester Burnham's wife, Carolyn, regards him with contempt, his daughter, Jane, thinks he's a loser, and his boss is positioning him for the ax.Captivated by Jane's sultry high school friend Angela, Lester decides to make a few changes in his mere existence—changes that are less mid-life crisis than a life reclaimed.The freer he gets, the happier he gets, which is even more maddening to his wife and daughter. Complicating matters, Lester finds an unexpected ally in Ricky, the teenage son of the new next-door neighbors, who sees life through a camera lens that has lately focused on Jane Burnham.In pursuit of his new vision of the American dream, Lester is about to learn that the ultimate freedom comes at the ultimate price.The 1999 winner of five Academy Awards®, including Best Picture and Best Original Screenplay, American Beauty boasts an accomplished cast led by two-time Academy Award® Best Actor winner Kevin Spacey (The Usual Suspects) and Oscar® nominee Annette Bening (The Grifters).The ensemble cast also includes Thora Birch (Ghost World),Wes Bentley (The Claim), Mena Suvari (American Pie),Peter Gallagher (Mr. Deeds), Allison Janney (NBC's The West Wing), Scott Bakula (NBC's Quantum Leap), Sam Robards (A.I.: Artificial Intelligence), and Chris Cooper (Adaptation).American Beauty marks the feature film directorial debut of award-winning theater director Sam Mendes (The Blue Room, Cabaret). The film is produced by Dan Jinks (Nothing to Lose) and Bruce Cohen (The Flintstones in Viva Rock Vegas) from an original screenplay by Alan Ball (HBO's Six Feet Under). Stan Wlodkowski (One Hour Photo) and Alan Ball are the co-producers.",
        "Category": " Performing Arts , Film , Screenwriting",
        "Publisher": "Newmarket Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "My Antonia : The Troll Garden : Selected Short Stories",
        "Authors": "By Cather, Willa",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Quick Dinners in 30 Minutes or Less",
        "Authors": "By Crocker, Betty (EDT)",
        "Description": "QUICK DINNERS IN 30 MINUTES OR LESS With today's busy schedules, everyone's looking for creative ways to pare down time in the kitchen. Betty Crocker presents the answer to the time crunch with more than 100 main dishes that can be prepared in 30 minutes—or less—without giving up the great flavor of home cooking. Imagine: You can prepare such delectable dishes as Shrimp Fajitas, Tortellini in Balsamic Vinegar, Cornmeal-fried Catfish, Glazed Turkey Tenderloins or Beef-Orange Stir-fry, and still have the time to enjoy your dinner. With",
        "Category": " Cooking , General",
        "Publisher": "Betty Crocker",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Sex over 40",
        "Authors": "By Rosenthal, Saul H.",
        "Description": "Describes the effects of menopause, prostate problems, diabetes,alcoholism, and aging, offers practical advice on sexual intimacy, and includes suggestions on overcoming problems caused by arthritis, heart trouble, or prescription medicines.",
        "Category": " Self-help , Aging",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Oak Leaves (The Oak Leaves Series #1)",
        "Authors": "By Lang, Maureen",
        "Description": "Two time periods—Regency England and contemporary Chicago—are woven together when Talie Ingram finds an old journal belonging to her great-great-great grandmother, Cosima Escott. Through Cosima's entries, Talie learns that her family was once considered cursed with feebleminded offspring, the result of a genetic disorder (Fragile-X) that may have been passed down to Talie and her sister. Unwilling to face the implications their discovery might have on her own life, Talie tucks the journal back into secrecy, until she begins to see signs of developmental delay in her son.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Tyndale House Publishers, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "China: A Picture Book To Remember Her By",
        "Authors": "By Gibbon",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Mark (Proclamation Commentaries)",
        "Authors": "By Achtemeier, Paul J.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Fertility, Cycles & Nutrition",
        "Authors": "By Shannon, Marilyn",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Couple to Couple League",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Mysterious Rider",
        "Authors": "By Zane Grey",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Facts in a Flash: From Cruising the Stacks to Surfing the Net",
        "Authors": "By Metter, Ellen",
        "Description": "A one-stop research guide, combining proven research strategies and short-cuts with a range of annotated print and online sources. Material is divided into general research areas covering everything from government statistics and current events to international cultures. Each section offers its own special tips, with information on how to use Internet search engines, locate full-text books online, and access government depository collections. Includes lists of periodical databases and commercial online database vendors.  Metter is a research librarian and bibliographer at the Auraria Library. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Reference , Writing Skills",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "An Introduction to Animal Behavior",
        "Authors": "By Klopfer, Peter H.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Neal Pollack Anthology of American Literature",
        "Authors": "By Pollack, Neal",
        "Description": "This collection of satirical essays by the wildly clever Neal Pollack was among the first books published by McSweeney's. The author fabricates for himself a super-inflated ego, and goes on to apply that persona's preposterously offensive and short-sighted opinions to issues ranging from race relations to wild teenagers, but more than anything else, to his own (albeit fictional) stunning accomplishments.",
        "Category": " Fiction , Literary",
        "Publisher": "McSweeney's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Fresh Ideas In Brochure Design",
        "Authors": "By Alekzander, Terri",
        "Description": "",
        "Category": " Design , Graphic Arts , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Firefighter's Busy Day",
        "Authors": "By Scarry, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Outlaw of Buffalo Flat",
        "Authors": "By Brand, Max",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1977"
        }
    },
    {
        "Title": "Inaugural Addresses of the Presidents of the United States from George Washington 1789 to George Bush 1989",
        "Authors": "By U.S. Congressional Budget Office",
        "Description": "",
        "Category": "",
        "Publisher": "United States Government Printing Office",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Essential Asian Cookbook",
        "Authors": "By Whitecap Books",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Asian",
        "Publisher": "Whitecap Books Ltd",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Wordy Shipmates",
        "Authors": "By Vowell, Sarah",
        "Description": "The Wordy Shipmates is New York Times?bestselling author Sarah Vowell?s exploration of the Puritans and their journey to America to become the people of John Winthrop?s ?city upon a hill??a shining example, a ?city that cannot be hid.? To this day, America views itself as a Puritan nation, but Vowell investigates what that means? and what it should mean. What was this great political enterprise all about? Who were these people who are considered the philosophical, spiritual, and moral ancestors of our nation? What Vowell discovers is something far different from what their uptight shoe-buckles-and- corn reputation might suggest. The people she finds are highly literate, deeply principled, and surprisingly feisty. Their story is filled with pamphlet feuds, witty courtroom dramas, and bloody vengeance. Along the way she asks: *  Was Massachusetts Bay Colony governor John Winthrop a communitarian, a Christlike Christian, or conformity?s tyrannical enforcer? Answer: Yes! *  Was Rhode Island?s architect, Roger Williams, America?s founding freak or the father of the First Amendment? Same difference. *  What does it take to get that jezebel Anne Hutchinson to shut up? A hatchet. *  What was the Puritans? pet name for the Pope? The Great Whore of Babylon. Sarah Vowell?s special brand of armchair history makes the bizarre and esoteric fascinatingly relevant and fun. She takes us from the modern-day reenactment of an Indian massacre to the Mohegan Sun casino, from old-timey Puritan poetry, where ?righteousness? is rhymed with ?wilderness,? to a Mayflower-themed waterslide. Throughout, The Wordy Shipmates is rich in historical fact, humorous insight, and social commentary by one of America?s most celebrated voices. Thou shalt enjoy it.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Illustrated Confederate Reader",
        "Authors": "By Gragg, Rod",
        "Description": "Here is the Southern story of the War Between the States—in the words of the men and women who experienced it. Enhanced with almost 200 period photographs and illustrations—including many never before published—this is a personal, firsthand account of the Southern soldiers and civilians caught in the deadliest, most destructive war ever to be fought in America.From the war's romantic, heady first days, when the men of the South rushed to don the gray, to the final collapse of the Confederacy, when much of the South lay smoldering in grim ruins, The Illustrated Confederate Reader captures the reality and the drama of that terrible, memorable era of American history.The book opens with a parade of period photographs depicting the soldiers of the South as they appeared, and concludes with a pictorial essay on the South's aging veterans—young Confederates grown old, holding on to the memories of the Lost Cause.  In between—in the words of the participants, accompanied by contemporary photographs and illustrations—are depicted the daily life of Johnny Reb, the sacrifices and perils of the South's civilian population, the unforgettable elements of combat in the nation's bloodiest war, the agony of Northern prison camps, and the fiery destruction wrought against the South by Sherman's victorious, vengeful army.  Featured, too, is a biographical album of famous Confederates—Lee, Jackson, Cleburne, Morgan, Semmes, Stuart, Davis, Longstreet, and Forrest—first-person accounts of the Legends in Gray.Unique in the historiography of the War Between the States, The Illustrated Confederate Reader is a handsomely designed, freshly researched study of the epic Southern struggle for independence.  It will enthrall and delight Civil War buffs, fascinate partisans of the South, and captivate anyone interested in real-life stories from American history.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Hanging Justice (Slocum Series #2)",
        "Authors": "By Logan, Jake",
        "Description": "",
        "Category": "",
        "Publisher": "Playboy Press",
        "Price Starting With ($)": "8.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Mystical Life of Jesus: An Uncommon Perspective on the Life of Christ",
        "Authors": "By Browne, Sylvia",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Flavor of California: Fresh Vegetarian Cuisine from the Golden State",
        "Authors": "By Spieler, Marlene",
        "Description": "Contains some 200 recipes representing West Coast cuisine, inspired by the diverse backgrounds of California's Native American, Mexican, Spanish, Asian, Mediterranean, and European inhabitants. Includes recipes for soups and dips, grilled vegetables, barbecued foods, casseroles, pizza, and sweets, illustrated with 100 color photos, and enhanced by stories of California's history and culture. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Tales From the Track (Toddler Board Books)",
        "Authors": "By Disney Storybook Artists (ILT)",
        "Description": "Presents three stories about race car Lightning McQueen as he competes against other race cars, adjusts to life in a small town, and learns how to race more effectively. On board pages.",
        "Category": " Juvenile Fiction , Transportation , Cars & Trucks",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Remains of Company D: A Story of the Great War",
        "Authors": "By Nelson, James Carl",
        "Description": "“Not since Flags of Our Fathers—no, make that, Not since Paul Fussell’s The Great War and Modern Memory—no, make that, Not ever—has an American nonfiction writer reached into history and produced a testament of young men in terrible battle with the stateliness, the mastery of cadence, the truthfulness and the muted heartbreak of James Carl Nelson in The Remains of Company D. I wish I’d had the honor of working on this book with him. But then, he didn’t need me.”---Ron Powers, New York Times bestselling coauthor of Flags of Our Fathers and author of Mark Twain: A Life“A beautifully crafted anthem to doomed American youth, James Carl Nelson’s The Remains of Company D is a must-read for World War I enthusiasts and those looking for a damn good war book.”---Alex Kershaw, New York Times bestselling author of The Longest Winter and The Bedford Boys“War is always hell, but the unprecedented carnage on World War I’s Western Front was the stuff of nightmares. The American boys of Company D were on the front lines, and James Carl Nelson has combined previously unpublished first-person accounts, prodigious research, and vivid, you-are-there prose into one of the great books on the subject. This is a Band of Brothers for World War I.”---James Donovan, author of A Terrible Glory: Custer and the Little Bighorn—the Last Great Battle of the American West“James Carl Nelson’s book is a great contribution to AEF history. He has done an incredible amount of research in order to convey the experience of one group of doughboys...and to tell their story through their own words.….He reminds us that these long-forgotten battles of ninety years ago were as hard fought as any before or since, and that our country was well served by the young men who fought them. Get this book. It puts a very human face on the experience of Americans on the Western Front.”---Dr. Paul Herbert, executive director of the Cantigny First Division FoundationHaunted by an ancestor’s tale of near death on a distant battlefield, James Carl Nelson set out in pursuit of the scraps of memory of his grandfather’s small infantry unit. Years of travel across the world led to the retrieval of unpublished personal papers, obscure memoirs, and communications from numerous Doughboys as well as original interviews of the descendents of his grandfather’s comrades in arms. The result is a compelling tale of battle rooted in new primary sources, and one man’s search for his grandfather’s legacy in a horrifying maelstrom that is today poorly understood and nearly forgotten.The Remains of Company D follows the members of Company D, 28th Infantry Regiment, United States First Division, from enlistment to combat to the effort to recover their remains, focusing on the three major battles at Cantigny, Soissons, and in the Meuse-Argonne and the effect these horrific battles had on the men. This is an important and powerful tale of the different destinies, personalities, and motivations of the men in Company D and a timeless portrayal of men at war.",
        "Category": " History , Military , World War I",
        "Publisher": "St Martin's Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Campaign Boot Camp: Basic Training for Future Leaders (0)",
        "Authors": "By Pelosi, Christine",
        "Description": "Attorney, author, and activist Christine Pelosi presents leadership lessons from the campaign trail for anyone who wants to run for office, advocate for a cause, or win a public policy issue. In Campaign Boot Camp: Basic Training for Future Leaders—A 7-Step Guide to Launching Successful Campaigns for Candidates and Causes, Pelosi uses a boot camp model to provide practical advice and  “get real” exercises so that individual readers can integrate these leadership lessons into their own public service efforts on political campaigns, ballot initiatives, or non-profit ventures. Right from the stroller, Christine was campaigning with her mother, Former House Speaker Nancy Pelosi.  She has served candidates and party alike, and she knows like few others about the nuts and bolts of winning in politics. Distilling best practices from across the political spectrum, Pelosi shows aspiring leaders how to master the fundamentals of campaigning—management, message, money, and mobilization.  She lays out a 7-step program for effective campaigning at all levels of public service, from community initiatives to congressional races: 1. Identify your call to service 2. Know your community 3. Build your leadership teams 4. Define your message 5. Connect with people 6. Raise the money 7. Mobilize to win Along the way, Pelosi features successful campaigners with their diverse backgrounds and experiences. Among the public servants and political professionals quoted in the book are: Donna Brazile, David Brock, Willie L. Brown, Jr., Max Cleland, Bill Clinton, Andrew Cuomo, Thomas D’Alesandro, Jr., Rahm Emanuel, Al Gore, Mahatma Gandhi, Kirsten Gillibrand, Kerry Kennedy, Frank Luntz, Ellen Malcolm, Gerald W. McEntee, Markos Moulitsas, Nancy Pelosi, Carl Pope, Bill Press, Ronald Reagan, Ann Richards, Karl Rove, Jack Valenti, Tim Walz, George F. Will, and Jim Zogby. Their writings and practices help make Campaign Boot Camp both a helpful guide to participatory democracy and an inspiring collective memoir.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Louisville Slugger Book of Great Hitters",
        "Authors": "By Crisfield, Deborah",
        "Description": "GET THE FACTS BEHIND THE STATSWho set the record for the most hits during his rookie season? What player's pregame routine includes eating chicken and never having strawberries on his cheesecake? Who has won batting's Triple Crown?Leading off for the Louisville Slugger® Book of Great Hitters: the most awesome, all-star lineup of all time. This incredible collection of player profiles gives you the personal and career highlights of the greatest players to ever step into the box. From \"Big Ed\" Delahanty, who began his career in 1888, to Alex Rodriguez more than one hundred years later, these heavy hitters have all left their mark on America's national pastime. Complete career stats let you discover who holds the records for home runs, RBIs, stolen bases, lifetime averages, and much, much more. Test your knowledge as you learn about the legends of the game, including:D. W. CRISFIELD (Summit, NJ) is the author of several children's sports books, including Pick Up Games: The Rules, The Players, The Equipment.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Favorite All Time Recipes: Just for Kids -- Cool Snacks, Sweet Treats",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "All New Cookie Dough Fun",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    }
]