[
    {
        "Title": "The Trespassers",
        "Authors": "By Snyder, Zilpha Keatley",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Satisfaction Guaranteed (The Goddard Project, Book 1)",
        "Authors": "By Monroe, Lucy",
        "Description": "When she is forced to work with sexy, smart, and fearless agent Ethan Crane to catch a notorious information broker, Beth Whitney is sorely tempted to break her own personal rule of never dating an agent, especially after one hot kiss leads to something more. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Brava",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Lost City of Faar (2) (Pendragon)",
        "Authors": "By Machale, D. J.",
        "Description": "CLORAL  The second installment in an epic series of adventures  Fourteen-year-old Bobby Pendragon is not like other boys his age. His uncle Press is a Traveler, and, as Bobby has learned, that means Uncle Press is responsible, through his journeys, for solving interdimensional conflict wherever he encounters it. His mission is nothing less than to save the universe from ultimate evil. And he's taking Bobby along for the ride.  Fresh from his first adventure on Denduron, Bobby finds himself in the territory of Cloral, a vast world that is entirely covered by water. Cloral is nearing a disaster of huge proportions. Reading the journals Bobby sends home, his friends learn that the desperate citizens of the endangered floating cities are on the brink of war. Can Bobby -- suburban basketball star and all-around nice guy -- help rid the area of marauders, and locate the legendary lost land of Faar, which may hold the key to Cloral's survival?",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Sammy's House",
        "Authors": "By Gore, Kristin",
        "Description": "The heroine of Kristin Gore's bestselling inside-the-beltway romp Sammy's Hill returns, and this time the laughs are richer and the stakes are higher -- at home and in the house (the White House, that is)Samantha Joyce is many things: Health care policy wonk. Hypochondriac. Lover of Japanese Fighting Fish (and of Charlie Lawton, her Washington Post reporter boyfriend). Jumper-to-conclusions. And when all these identities collide -- as they do most days -- the results are always unpredictable.Sammy's role as an advisor to Vice President Robert Gary (RG for short) has led her down some exciting professional paths, like when she accompanies RG on a trip to India to help open pharmaceutical supply lines, and some troubling ones -- like when the president secretly asks her to plumb those lines to acquire as yet unapproved drugs for his own personal use. Her job interferes with her love life, too, after Charlie is transferred to New York for a huge story just when she's expecting a proposal, and they find that distance combines poorly with Sammy's dedication to her work and her overactive imagination. And then there's the surprising -- though ego-pleasing -- series of passes thrown Sammy's way, culminating in a highly embarrassing photo of a Hollywood hotshot's hand where it doesnt belong, published in the pages of Us Weekly . . .As the dual crises in Sammy's personal and professional lives come to a head, and her ideals are put to the ultimate test, readers will be flipping pages madly, wondering what might come next. Because in Sammy's house, anything is possible.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Passenger Liners Of The World since 1893",
        "Authors": "By Nicholas T. Cairis",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Timing of Biological Clocks (Scientific American Library)",
        "Authors": "By Winfree, Arthur T.",
        "Description": "Examines circadian rhythms, tells how biological clocks are reset, and discusses time zones, consciousness, and clocks",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Bobbi Brown Teenage Beauty: Everything You Need to Look Pretty, Natural, Sexy and Awesome",
        "Authors": "By Brown, Bobbi and Iverson, Annemarie",
        "Description": "Bobbi Brown Teenage BeautyBobbi Brown Teenage Beauty is the ultimate beauty guide for young women. It takes the mystery out of all those confusing rituals so that you can figure out how to feel happier and more relaxed about your looks. You'll look your prettiest!Your teen years are the most emotionally charged of your life. Your body's developing at a rapid pace, your skin changes from day to day, and your hormones are raging (in case you didn't notice). Everything in your life is in total flux. Bobbi's mission is to help boost your self-esteem and confidence. By listening to Bobbi's straightforward and useful beauty principles, you'll gain a sense of control over your body, your looks, and your life. Bobbi's hip, no-nonsense, and timeless advice covers such real teen problems and issues as:Zits! - Being Overweight - Braces - Beauty School 101 Eight Simple Steps to a Pretty, Natural Makeup Look - Preteen Basics - Prom Beauty - Global Beauty - Mother-Daughter Beauty - Rock 'n' Roll Babes: Hip Beauty Style - Go for It: Experimental BeautyWritten with sensitivity to help you navigate the difficult self-image issues that you face, Bobbi Brown Teenage Beauty empowers you to discover and celebrate your own unique, natural beauty. This fresh and honest makeup guide is your ultimate source for advice, tips, and lessons for achieving beauty inside and out.",
        "Category": " Young Adult Nonfiction , Health & Daily Living , Beauty & Grooming",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "How to Recognize Gothic Art",
        "Authors": "By Gozzoli, Maria Christina",
        "Description": "",
        "Category": "",
        "Publisher": "PENGUIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "Figure Drawing Workshop: How to Make Inspiring Figure Drawings in All Media",
        "Authors": "By Katchen, Carole",
        "Description": "",
        "Category": "",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Say It in Swedish (Revised) (Dover Language Guides Say It Series)",
        "Authors": "By Norris, Kerstin",
        "Description": "Contains over 1,000 useful sentences and phrases for travel or everyday living abroad: food, shopping, medical aid, courtesy, hotels, travel, and other situations. Gives the English phrase, the foreign equivalent, and a transliteration that can be read right off. Also includes many supplementary lists, signs, and aids. All words are indexed.",
        "Category": " Foreign Language Study , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "The Children's Book of Heroes",
        "Authors": "By Hague, Michael (ILT) and Bennett, William J. (EDT)",
        "Description": "William Bennett and Michael Hague, the team that brought us the national bestseller The Children's Book of Virtues, have once again collaborated to create The Children's Book of Heroes, a beautifully illustrated celebration of heroic deeds, both real and fictional, that will delight and inspire millions of young children and their parents.  \"We all need a hero or two to help us stand fast and think right,\" says William J. Bennett, author of The Book of Virtues, the #1 bestseller that millions of American families turn to for moral inspiration. With excerpts chosen for young children, this new treasury presents splendid tales of the valor and indomitable spirit that are a lasting testament to our cherished values.  Jackie Robinson stands fast on the playing field -- and his strength of character inspires a nation. David slays Goliath -- and his faith and bravery give hope to underdogs everywhere. A little boy goes in search of an angel -- and finds one who guards him day and night: his own mother. From Abraham Lincoln and Mother Teresa to warriors on the battlefield, real moms and dads, and even young girls and boys, here are worthy and heroic figures all kids can look up to and emulate.  The Children's Book of Heroes is a celebration of the endurance, sacrifice, courage, and compassion that characterize truly heroic deeds.",
        "Category": " Juvenile Fiction , Biographical , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Understanding the Old Testament",
        "Authors": "By Bernhard W. Anderson",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Dictionary Of Dreams - Understanding Dreams & Their Messages",
        "Authors": "By unknown",
        "Description": "",
        "Category": " Body, Mind & Spirit , Dreams",
        "Publisher": "Hinkler Books",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Origin of Modern Humans (Scientific American Library)",
        "Authors": "By Lewin, Roger",
        "Description": "Where and when did modern humans (Homo sapiens) first appear? Who were our immediate evolutionary ancestors? What features distinguish modern humans and how did these features arise? These questions have gripped the scientific community and the public since the mid-nineteenth century, when the discovery of Neanderthal Man and the publication of Darwin's Origin of Species rocked the foundations of long-held beliefs on the subject.Many new findings, speculations, and reevaluations have sharpened our views of modern human origins since then. Nevertheless, the controversy continues, as the patchy fossil record and new evidence derived from genetic techniques have given rise to competing theories. Are we the result of a single uninterrupted lineage, with each distinct species of human leading directly to the next? Or, do species such as the Neanderthal represent offshoots of an evolutionary tree that died out without leaving successors? Did modern humanity arise roughly contemporaneously in different parts of the world or from a single species in a single location? And how do biological, linguistic, artistic, and technological factors distinguish Homo sapiens from near and distant relatives? At stake in the argument is nothing less than the very definition of what it means, biologically and culturally, to be human.In this vividly written volume, award-winning science author Roger Lewin describes the discoveries, the intellectual clashes, and the often conflicting interpretations of evidence that have shaped the current debate on modern humanity's origin. Readers will learn of astonishing findings (the original Neanderthal bones, and provocative theories (the genetically-derived speculation that we are all the children of a single African female who lived about 200,000 years ago), as well as one preposterous hoax (the Piltdown Man). Readers will also see the evolution of the modern science of paleoanthropology, which brings molecular biology, genetics, population biology, linguistics, and other disciplines into the search for the distinctive stamp of Homo sapiens in artifacts and skeletal remains.",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Robert Ludlum's The Bourne Sanction",
        "Authors": "By Lustbader, Eric and Ludlum, Robert (CRT)",
        "Description": "Jason Bourne returns to Georgetown University and the mild world of his alter ego, David Webb, hoping for normalcy. But after so many adrenaline-soaked years of risking his life, Bourne finds himself chafing under the quiet life of a linguistics professor.  Aware of his frustrations, his academic mentor, Professor Specter, asks for help investigating the murder of a former student by a previously unknown Muslim extremist sect. The young man died carrying information about the group's terrorist activities, including an immediate plan to attack the United States.  The organization, the Black Legion, and its lethal plot have also popped up on the radar of Central Intelligence, where new director Veronica Hart is struggling to assert her authority. Sensing an opportunity to take control of CI by showing Hart's incompetence, National Security Agency operatives plan to accomplish what CI never could-hunt down and kill Bourne.  In Europe, Bourne's investigation into the Black Legion turns into one of the deadliest and most tangled operations of his double life-the pursuit of the leader of a murderous terrorist group with roots in the darkest days of World War II-all while an assassin as brilliant and damaged as himself is getting closer by the minute . . .",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Progressive Presidents: Theodore Roosevelt, Woodrow Wilson, Franklin D. Roosevelt, Lyndon B. Johnson",
        "Authors": "By Blum, John Morton",
        "Description": "",
        "Category": "",
        "Publisher": "Norton",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Rossetti Letter",
        "Authors": "By Phillips, Christi",
        "Description": "In this captivating debut, Christi Phillips blends fact and fiction, suspense and sensuality into a vibrant, richly imagined novel in which a modern historian uncovers a courtesan's secret role in a shocking conspiracy of seventeenth-century Venice.   Claire Donovan always dreamed of visiting Venice, though not as a chaperone for a surly teenager. But she can't pass up this chance to complete her Ph.D. thesis on Alessandra Rossetti, a mysterious courtesan who wrote a secret letter to the Venetian Council warning of a Spanish plot to overthrow the Venetian Republic in 1618. Claire views Alessandra as a heroine and harbors a secret hope that her findings will elevate Alessandra to a more prominent place in history. But an arrogant Cambridge professor is set to present a paper at a prestigious Venetian university denouncing Alessandra as a co-conspirator -- a move that could destroy Claire's paper and career.   As Claire races to locate the documents that will reveal the courtesan's true motives, Alessandra's story comes to life with all the sensuality, political treachery, and violence of seventeenth-century Venice. Claire also falls under the city's spell. She is courted by a handsome Italian, matches wits with her academic adversary, bonds with her troubled young charge, and, amid the boundless beauty of Venice, recaptures the joy of living every moment....   Layering wit and warmth into her portraits of two very different yet equally dynamic heroines, Christi Phillips shifts effortlessly between past and present in a remarkable novel that is at once a love story, a mystery, and an intriguing historical drama. Filled with beautifully rendered details of one of the world's oldest and most magical cities, The Rossetti Letter marks Phillips's debut as a writer of extraordinary skill and grace.",
        "Category": " Fiction , Literary",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "7.0",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "A guide to historic Alexandria",
        "Authors": "By Seale, William",
        "Description": "",
        "Category": "",
        "Publisher": "Published by The City of Alexandria 250th Anniversary Commission",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Priest: A Gothic Romance",
        "Authors": "By Disch, Thomas M.",
        "Description": "Since his work first began to appear in the early 1960s, Thomas Disch has proven himself, again and again, to be one of the most prodigiously talented novelist/playwright/poets of our time. In Newsweek he was saluted by Walter Clemons as \"the most formidably gifted unfamous American writer.\" But in 1991, with the publication of The M.D., Disch's remarkably various gifts converged in a horror novel that propelled him into the mainstream even as it remade the genre in its own startling image. Now, in The Priest, Disch gives us an even more potent, darkly hypnotic, and fiendishly comic novel - a gothic romance like no other.At the center: Father Patrick Bryce, a Catholic priest with a present-day Minneapolis parish - and a pedophile past. He's spent time at a church-run retreat for priests of his persuasion and returned \"rehabilitated\": even better equipped to keep his vice active and hidden.Until the blackmail begins.It comes from three different sources (his own bishop being one), and each tops the next in imaginative proposals: Father Pat must head a militant (and probably illegal) anti-abortion campaign; Father Pat must apologize to each of his victims, face-to-face; Father Pat must read, and be ready to discuss, the work of a bizarre cult science fiction writer, and get the face of Satan tattooed on his chest. But the blackmailers and their demands are the least of Father Pat's problems. More dire is his increasingly incontrovertible sense that the nightmares in which he has been leading the life of a thirteenth-century bishop are not dreams at all. And that the Church, rife with corruption and scandal in both eras, is the only realistic sanctuary for him and his doppelganger, Bishop Silvanus de Roquefort, as they move - at once separately and together - through their own centuries-spanning maze of soul-killing horrors toward a distinctly hellish destiny. The astonishments, mayhem, and villainy they encounter along the way come brilliantly to life in an eerie and wildly populated narrative that builds at breakneck speed to its gripping, gruesome, and romantic finale.The Priest is a spellbinding confirmation of Thomas Disch's standing as a master conjurer of the most darkly compelling tales.",
        "Category": " Fiction , Romance , Gothic",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Dancing With God: Americans Who Have Encountered the Divine",
        "Authors": "By Wall, Steve",
        "Description": "Written in the voices of a dozen ordinary people whose lives have been irrevocably altered and including more than forty original photographs, this powerful work reveals the charismatic faith an author discovered during his journey across America. 35,000 first printing.",
        "Category": " Religion , Spirituality",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "By Way of Water",
        "Authors": "By Gullick, Charlotte",
        "Description": "Struggling to feed their children in an unforgiving California forest when all the logging jobs are gone, Jake and Dale Colby make personal vows that can only make matters worse. Jake will not accept help-from the government or his neighbors-and Dale won't allow him to hunt. She believes her faith will sustain them. He believes in nothing.  But one other member of the family makes a promise to herself. Seven-year-old Justy believes that she alone can hold the family together, even when Jake's violence surfaces again.  Narrated by this gentle, even wise young girl, this moving story reveals a family's most volatile emotions and private aspirations, like old-growth trees through an inland fog. With a clear insight and the deepest empathy, young Justy isolates the stark realities around her, even as she dreams with her mother of a safe world that only God can promise.  By the final pages of Charlotte Gullick's powerful debut novel, we discover-along with Justy-how to heal the lesions that appear when obligation is delivered against human nature.",
        "Category": " Fiction , Literary",
        "Publisher": "Blue Hen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The American Heritage Spanish Dictionary: Spanish/English: Enlgish/Spanish",
        "Authors": "By American Heritage",
        "Description": "A new bilingual Spanish-English dictionary includes more than eighty thousand entries",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Journey Through Hallowed Ground: Birthplace of the American Ideal",
        "Authors": "By Cockburn, Andrew, Garrett, Kenneth (PHT), and Brooks, Geraldine (FRW)",
        "Description": "It was Abraham Lincoln, in his immortal Gettysburg Address, who first used the words \"hallowed ground\" to describe the woods and fields, the rolling hills and plashing creeks where two great armies - both American - had so recently fought and died. Although the battle his eloquence commemorated was indeed a pivotal event in our country's history, the landscape where it was waged and the region that surrounded it had already been hallowed ground for generations.Stretching from Pennsylvania through Maryland, West Virginia, and Virginia, this extraordinary tract of land set the stage for our national chronicle and served as backdrop to transformational American events, such as Captain John Smith's adventures in Monacan territory in the early 1600s and Gen. George Pickett's gallant, doomed charge at Gettysburg in 1863. It has given us Founding Fathers like George Washington and Thomas Jefferson; heroic figures like Clara Barton, founder of the American Red Cross; and models of dignity such as Gen. Robert E. Lee, who fought for his native South despite his stand against slavery. Its maps are a catalog of historical sites, from key battlefields of the American Revolution and the Civil War to the first U.S. meeting site of W. E. B. Du Bois's Niagara Movement.Illustrated with dozens of stunning modern photographs as well as evocative artifacts that summon earlier eras and aspirations, this is a book to delight travelers, U.S. history buffs, and anyone else who seeks to capture the enduring spirit and tradition of this hallowed ground. This is the birthplace of the American ideal as it has developed from unexplored wilderness to a vital artery of the American experience.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Fieldbook of Natural History",
        "Authors": "By Palmer, E. Laurence, Fowler, Seymour H., and Fowler, H. Seymour",
        "Description": "Provides descriptive entries, data on the range, life history, ecology, and economic importance of a wide variety of plants and animals and the composition of the solar system, weather, rocks, and minerals.",
        "Category": " Mathematics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "7.52",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Book of Abigail and John: Selected Letters of the Adams Family, 1762-1784",
        "Authors": "By Adams, Abigail and Adams, John",
        "Description": "",
        "Category": "",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Don't Let The World Pass You By!",
        "Authors": "By Benson, Sam",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Big Book Of Favorite Horse Story: Twenty-five Outstanding Stories By Distinguished Authors",
        "Authors": "By Braun, Phyllis Cellini",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1978"
        }
    },
    {
        "Title": "Mother of the Bride: The Dream, the Reality, the Search for a Perfect Dress",
        "Authors": "By Beckerman, Ilene",
        "Description": "“An account that is sweetly sentimental and brutally honest, touching and witty—in short, a true gem.” —Publishers Weekly, starred review “A work that adds great luster to an already golden event.” — The Memphis Commercial Appeal “Her prose is spare, but rich with meaning and always very honest.” — The Cleveland Plain Dealer “Pithy wit and cute drawings sketch the happy tears, bittersweet memories and flares of anxiety that a daughter’s wedding elicits.” — The Dallas Morning News The relationship between a mother and daughter is often fraught— but never so much as during the preparations for that walk down the aisle. Ilene Beckerman has taken that walk with three daughters and tells us—with great wisdom and wit—why childbirth is less painful than planning a wedding.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Normal Children Have Problems, Too : How Parents Can Understand and Help (A Child Magazine Best Parenting Book)",
        "Authors": "By Wernick, Sarah and Turecki, Stanley, M.D.",
        "Description": "Lack of friends * poor self-image * sibling rivalry * hyperactivity * sadness and fearfulness * eating problems * nervous habits * aggressive behavior * defiance * sleep problems * lying * learning disabilities. . .Even normal children can have problems.And parents can help them.That is the powerful assurance Dr. Stanley Turecki offers parents in this compassionate and practical book. Whatever the situation, Dr. Turecki shows you: A new way to understand your child's difficulties and gain insights into causes and solutions How to discuss problems without destructive arguments and win your child's cooperation How to strengthen self-esteem by making the most of your child's individual temperament How to improve discipline by focusing on planning and prevention rather than punishment How to collaborate with teachers about school problems What to do if you are told that your child should be tested for ADD or placed on medication When to seek professional helpIncluding vivid vignettes illustrating a wide range of problems and how they were successfully resolved, this award-winning book is destined to become a parenting classic.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Camera Crafts: Creative Projects to Make With Your Camera and a Good Roll of Film",
        "Authors": "By Finkle, Cyndi and Macdonald, Judy (ILT)",
        "Description": "Provides instructions for making and mounting photographic gifts, including a personalized calendar, a flip book, and refrigerator magnets and other objects featuring the people one knows",
        "Category": "",
        "Publisher": "Lowell House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Syndrome : A Thriller",
        "Authors": "By Case, John",
        "Description": "Dr. Jeff Duran suffers from severe panic attacks when he ventures too far outside his home office. At times, he remembers phrases of a foreign language he has never learned. And there are curious memories he cannot explain - of distinct smells, music, the spray of ocean sailing. But no sooner do these sensations and images begin to surface than they disappear.Then, after a patient commits suicide, Duran's life spirals out of control. The victim's half-sister, Adrienne Cope, blames Duran for filling her sister's head with \"recovered\" memories of horrific childhood abuse. But Adrienne soon discovers some shocking facts about him - facts that even he is unaware of.The stakes are raised when unknown assassins burst into Duran's office and bloodshed ensues. But who is their target: Adrienne or Duran? Running for their very lives, forced to trust each other, they must now work together to unlock the reason why one or both of them is marked for death. For beneath the intrigue lies a dark conspiracy that stretches halfway around the world - and a sinister plot that could change the course of history.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Traveling Hopefully: How to Lose Your Family Baggage and Jumpstart Your Life",
        "Authors": "By Gill, Libby and McGraw, Phillip C., Ph.D. (FRW)",
        "Description": "\"This book is for real, because Libby is for real...\"- Dr. Phil McGraw in his foreword to Traveling Hopefully  Are you living a life based on who you really are or one built on outdated messages from your past?  Is your past negatively influencing your present and potentially derailing your future?  What if you could shift your perspective from limiting to liberating?Now you can learn to let go of your baggage and create a life of passion and purpose. Success strategist and executive coach Libby Gill is your partner in life change as she shares her inspiring story and guides readers step-by-step through the journey of self-transformation.With courage and candor, Libby poignantly discloses how she struggled with a family legacy which included divorce, mental illness and molestation, robbing her of her best possible life until she learned to dissect the past so she could direct the future.  With a transformative process she calls the Five Steps to Jumpstart Your Life, Libby provides practical tools and down-to-earth insights that translate abstract concepts into concrete action.The 21 Hopeful Tools are easy-to-follow exercises that take readers through this process, showing them how to:*dissect the past to direct the future*link internal clarity with external action*create a Traveling Hopefully personal roadmap*recruit a Support Squad to provide information and inspiration*keep moving toward what you want and away from what no longer serves youFilled with tips and tactics, personal accounts, and client success stories, Traveling Hopefully shows readers how to create big-picture visions and turn them into bottom-line action so they can lose their baggage and live the life of their dreams.",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Bill, the Galactic Hero, Vol. 2: On the Planet of Bottled Brains",
        "Authors": "By Harrison, Harry and Sheckley, Robert",
        "Description": "Bill heads to the planet Tsuris to retrieve a secret weapon, but the planet's residents, who have more brains than bodies, are determined to capture him to put one of their brains in his body",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Monkey Book (Look-Look)",
        "Authors": "By Pfloog, Jan",
        "Description": "Introduces various types of monkey and ape and describes how they behave",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Baby Wild Animals (Look-Look)",
        "Authors": "By Pfloog, Jan and Fulton, Janet",
        "Description": "Introduces a variety of young animals as they play, rest, and accompany their mothers",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Oxford Illustrated History of the British Monarchy (Oxford Illustrated Histories)",
        "Authors": "By Cannon, John and Griffiths, Ralph Alan",
        "Description": "The rich pageant of Britain's history emerges nowhere more colorfully than in the story of its kings and queens.  This spectacular book offers the most authoritative account of the British monarchy ever published for the general reader. With over 400 illustrations--a third of them in color--it traces the crown's full history from Anglo-Saxon times to the present.      The authors present a vivid picture of the lives of individual monarchs as well as of the monarchy as a political and social force.  They begin the story in the fifth century with the rise of recognizable kingdoms in Scotland, Wales, and England and conclude with a discussion of the crown's constitutional role, which emerged in Queen Victoria's reign, and how this has affected the symbolic and popular monarchy of today.  Along the way, we gain a clear view of how key traditions evolved:  the right of succession, coronations and marriages, oaths of loyalty and military service, the granting of lands and titles, and the propagation of a powerful image of royalty.      The book not only explains the monarch's political struggles and styles of governing; it is filled with fascinating details that give the story life.  We learn, for instance, that Elizabeth I's famous journeys to various corners of her realm were not simply to show her off to her subjects: \"The standard of Tudor sanitation,\" the authors note, \"meant that the royal palaces became unbearable after several weeks of occupation and the court's absence for several months in the summer gave an opportunity to clean up.\"  We discover that Victoria's coronation was \"a splendid mixture of majesty and muddle\":  when it came time for the Archbishop to bestow the ceremonial ring, the already befuddled cleric placed it on the Queen's wrong finger, \"causing considerable delay [and] some pain.\"  And we read George VI's touching wedding message to his daughter (the present queen):  \"Your leaving us has left a great blank in our lives but do remember that your old home is still yours.\"      Supporting the text and carefully selected pictures are sidebars on each of the monarchs and on key general themes; color maps; an illustrated section on royal residences and tombs; a consolidated list of monarchs; genealogies; annotated lists of further reading; and a full index with personal dates.",
        "Category": " Fiction , Classics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "7.52",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "one foot in washington the perilous life of a senators wife",
        "Authors": "By Proxmire, Ellen",
        "Description": "",
        "Category": "",
        "Publisher": "robert B. luce cr1963",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "An Irish Country Village: A Novel (Irish Country Books, 2)",
        "Authors": "By Taylor, Patrick",
        "Description": "Patrick Taylor first charmed readers with An Irish Country Doctor, a warm and enchanting novel in the tradition of James Herriot and Jan Karon. Now Taylor returns to the colorful Northern Ireland community of Ballybucklebo, where there's always something brewing beneath the village's deceptively sleepy surface.Young Doctor Barry Laverty has only just begun his assistantship under his eccentric mentor, Dr. Fingal Flahertie O'Reilly, but he already feels right at home in Ballybucklebo. When the sudden death of a patient casts a cloud over Barry's reputation, his chances of establishing himself in the village are endangered, especially since the grieving widow is threatening a lawsuit. While he anxiously waits for the postmortem results that he prays will exonerate him, Barry must regain the trust of the gossipy Ulster village, one patient at a time. From a put-upon shop girl with a mysterious rash to the troubled pregnancy of a winsome young lass who's not quite married yet, Ballybucklebo provides plenty of cases to keep the two country G.P.s busy.Not all their challenges are medical in nature. When a greedy developer sets his sights on the very heart of the community, the village pub, it's up to the doctors to save the Black Swan (affectionately known to the locals as the \"Mucky Duck\") from being turned into an overpriced tourist trap. After all, the good citizens of Ballybucklebo need some place to drink to each other's health. . . .Whether you've visited in the past, or are discovering Ballybucklebo for the first time, An Irish Country Village is an ideal location for anyone looking for wit, warmth, and just a touch of blarney.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The American Cancer Society: Prostate Cancer, revised edition",
        "Authors": "By Bostwick, David G., Maclennan, Gregory T., and Larson, Thayne R., M.D.",
        "Description": "Presents basic information about prostate cancer",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Food Addiction: The Body Knows: Revised & Expanded Edition",
        "Authors": "By Sheppard, Kay",
        "Description": "Are you a food addict? Do you gain more weight than you lose after every diet?Can one cookie destroy all your good intentions? Do you eat when you are disappointed, tense or anxious? Since its publication, Food Addiction has become a primary resource for food addicts and compulsive eaters. Now it is updated and presented in a revised and expanded edition, with a new chapter on relapse. For a food addict, relapse is an ever present danger which begins in the mind before reaching for that cupcake or other trigger food. Here food addiction is defined, trigger foods are identified and consequences of food addiction are revealed. A lifetime eating plan demonstrating how to stick with a healthful food plan for the long term is also provided. \"For some people, foods can be as addictive as alcohol,\" Kay Sheppard explains. \"Gummy bears and marshmallow chicks can be vicious killers whose effects can lead to depression, irritability and even suicide. The terrible truth is that for certain individuals, refined carbohydrates can trigger the addictive process. This book is an effort to help you understand and solve the problems of compulsive eating.\"",
        "Category": " Self-help , Substance Abuse & Addictions , General",
        "Publisher": "Health Communications Inc",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Our Tremendous Lover: The Song of Songs",
        "Authors": "By Charles P. Schmitt",
        "Description": "",
        "Category": "",
        "Publisher": "Fellowship Publications",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "American Academy of Pediatrics Guide to Your Child's Sleep: Birth Through Adolescence",
        "Authors": "By American Academy of Pediatrics (COR) and Cohen, George J. (EDT)",
        "Description": "The foremost medical authority on children's health, the American Academy of Pediatrics, has collected in these pages the best advice on getting newborns, toddlers, and school-age children to sleep. Packed with practical tips, this guide offers invaluable information, answers questions from parents, and provides reassuring ad-vice for preventing SIDS, getting your baby to sleep through the night, and solving sleep-wake problems. Above all, the Academy weighs in on the controversies over the most popular child-sleep advice--by evaluating the pros and cons of these conflicting theories--enabling parents to make the best decisions for their families.         Here, in a compact and accessible package, is information to ensure that even the most bleary-eyed parents and their children get a good night's sleep.",
        "Category": " Health & Fitness , Sleep & Sleep Disorders",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Autograph Man",
        "Authors": "By Smith, Zadie",
        "Description": "Alex-Li Tandem sells autographs. His business is to hunt for names on paper, collect   them, sell them, and occasionally fake them—all to give the people what they want:   a little piece of Fame. But what does Alex want? Only the return of his father, the   end of religion, something for his headache, three different girls, infinite grace,   and the rare autograph of forties movie actress Kitty Alexander. With fries. The   Autograph Man is a deeply funny existential tour around the hollow trappings of modernity:   celebrity, cinema, and the ugly triumph of symbol over experience. It offers further   proof that Zadie Smith is one of the most staggeringly talented writers of her generation. Look for her new book Swing Time, coming November 2016.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Jesus Land: A Memoir",
        "Authors": "By Scheeres, Julia",
        "Description": "For Julia Scheeres and her adopted brother David, \"Jesus Land\" stretched from their parents' fundamentalist home, past the hostilities of high school, and deep into a Christian reform school in the Dominican Republic. For these two teenagers - brother and sister, black and white - the 1980's were a trial by fire.In this memoir, Scheeres takes us from the familiar Midwest, a land of cottonwood trees and trailer parks, to a place beyond her imagining. At home, the Scheeres kids must endure the usual trials of adolescence - high-school hormones, incessant bullying, and the deep-seated restlessness of social misfits everywhere - under the shadow of virulent racism neither knows how to contend with. When they start to crack (or fight back), they are packed off to Escuela Caribe.This brutal, prison-like \"Christian boot camp\" demands that its inhabitants repent for their sins - sins that few of them are aware of having committed. Julia and David's determination to make it though with heart and soul intact is told here with immediacy, candor, sparkling humor, and not an ounce of malice. Jesus Land is, on every page, a keenly moving ode to the sustaining power of love, and rebellion, and the dream of a perfect family.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Counterpoint",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "In Sheep's Clothing",
        "Authors": "By Monroe, Mary",
        "Description": "Dissatisfied with her life, Trudy, taking a job as a secretary at a travel agency,  goes too far in her quest for passion and happiness when she assumes the identity of a wealthy co-worker who was forced to quit, leading a double life and getting involved with the wrong man. 60,000 first printing.",
        "Category": " Fiction , African American , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The New Physics",
        "Authors": "By Davies, Paul (EDT)",
        "Description": "Physics affects the way we live and, ultimately, how life itself functions. This new take on a classic text investigates key frontiers in modern physics. Exploring our universe, from the particles within atoms to the stars making up galaxies, it reveals the vital role invisible mechanisms play in the world around us, and explains new techniques, from nano-engineering and brain research to the latest advances in high-speed data networks and custom-built materials. Written by leading international experts, each of the nineteen chapters will fascinate scientists in all disciplines, as well as anyone wanting to know more about the world of physics.    First Edition Hb (1989) 0-521-30420-2    First Edition Pb (1992) 0-521-43831-4",
        "Category": " Science , Physics",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "More: The Four Dimensions of Intimacy with God",
        "Authors": "By Anderes, Marilyn N.",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Chosen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Another Thing to Fall: A Novel (Tess Monaghan Novel)",
        "Authors": "By Lippman, Laura",
        "Description": "New York Times BestsellerAward-winning and New York Times bestselling author Laura Lippman’s Tess Monaghan—first introduced in the classic Baltimore Blues—must protect an up-and-coming Hollywood actress, but when murder strikes on a TV set, the unflappable PI discovers everyone’s got a secret.“[A] welcome addition to Tess Monaghan’s adventures and an insightful look at the desperation that drives those grasping for a shot at fame and those who will do anything to keep it.”—San Francisco ChronicleWhen private investigator Tess Monaghan literally runs into the crew of the fledgling TV series Mann of Steel while sculling, she expects sharp words and evil looks, not an assignment. But the company has been plagued by a series of disturbing incidents since its arrival on location in Baltimore: bad press, union threats, and small, costly on-set \"accidents\" that have wreaked havoc with its shooting schedule. As a result, Mann's creator, Flip Tumulty, the son of a Hollywood legend, is worried for the safety of his young female lead, Selene Waites, and asks Tess to serve as her bodyguard. Tumulty's concern may be well founded. Recently, a Baltimore man was discovered dead in his home, surrounded by photos of the beautiful—if difficult—aspiring star.In the past, Tess has had enough trouble guarding her own body. Keeping a spoiled movie princess under wraps may be more than she can handle since Selene is not as naive as everyone seems to think, and instead is quite devious. Once Tess gets a taste of this world of make-believe—with their vanities, their self-serving agendas, and their remarkably skewed visions of reality—she’s just about ready to throw in the towel. But she’s pulled back in when a grisly on-set murder occurs, threatening to topple the wall of secrets surrounding Mann of Steel as lives, dreams, and careers are scattered among the ruins.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Babel Effect",
        "Authors": "By Hecht, Daniel",
        "Description": "Is violence a virus? Can your genes make you a killer? Why are we so willing to hurt each other? In The Babel Effect, the husband-and-wife research team of Ryan and Jessamine McCloud are charged with answering these urgent questions. Beginning as a neurological study of murderers on death row, their research explodes into an investigation into the biomedical foundations of human history. The quest takes them from prison cells to research labs to war zones throughout the world and forces them to doubt their most basic assumptions about the human species, about themselves, and about their marriage.Combining systems theory with modern epidemiology, they soon learn that our propensity for violence resembles a contagious disease. But is the human carnage of the last hundred years an ancient plague or a new nightmare? Can they identify the cause and find a cure? As their discoveries reveal frightening secrets about multinational corporations, clandestine military programs, and millennial religious cults, they realize that finding the answers depends on a still more urgent and terrifying question: Can they survive the search?When an unknown enemy steals their data and abducts Jessamine, the FBI investigation stalls, and Ryan realizes that it is up to him alone to find his pregnant wife. He soon finds that to learn where she is, he must discover who she is - and confront the question of whether we can ever really know the one we love.",
        "Category": " Fiction , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "175 Easy-to-Do Thanksgiving Crafts",
        "Authors": "By Umnik, Sharon Dunn (EDT)",
        "Description": "Here's a cornucopia of Thanksgiving Day crafts that offers children hours of creative fun. Fanciful turkeys, wreaths, Pilgrims, garlands, and holiday-table accessories are just some of the crafts that reflect the autumn season and this most bountiful of holidays. Like its companion volume, it features easy-to-follow directions and full-color photographs.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Thanksgiving",
        "Publisher": "Boyds Mills Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "175 Easy-to-Do Halloween Crafts: Creative Uses for Recyclables",
        "Authors": "By Umnik, Sharon Dunn (EDT)",
        "Description": "Boys and girls can make October 31 the spookiest and most festive ever with this craft book filled with Halloween fun. Easy-to-follow directions and full-color photographs show young craft makers how to create frightfully funny decorations, pumpkins, gifts, masks, costumes, and so much more. All of the crafts are made of recyclable materials and everyday items found around the house.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Halloween",
        "Publisher": "Boyds Mills Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Gifted hands",
        "Authors": "By Carson, Ben",
        "Description": "",
        "Category": "",
        "Publisher": "Review and Herald Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Rise and Fall of Jesse James",
        "Authors": "By Love, Robertus",
        "Description": "Jesse and Frank James were household names long before images of America's most wanted were televised. For several decades after the Civil War, they were hunted by hundreds who supposed them to be involved in every bank and train robbery in the Midwest. Trained as guerrilla fighters in the border conflict between Kansas and Missouri, they joined with the Younger brothers in February 1866 to rob a bank in Liberty, Missouri. That was the beginning of a criminal confederation that seemed beyond the reach of the law until the Northfield, Minnesota, raid killed three of them and sent the James brothers into hiding. But they were the objects of posted rewards that proved too tempting in Jesse's case: in 1882 he was shot in the back by Robert Ford of his own gang. The Rise and Fall of Jesse James, by Robertus Love, a newspaperman who knew Frank James, is a pioneering work that plumbs the personalities of the outlaws, looks at their domestic lives, cites many stories about them, and attempts to separate fact from legend in tracking their violent operations.Michael Fellman assesses Love's 1926 book in his introduction to this Bison Books edition.",
        "Category": " History , United States , 19th Century",
        "Publisher": "University of Nebraska Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "The fragile alliance;: An orientation to the outpatient psychotherapy of the adolescent",
        "Authors": "By Meeks, John E",
        "Description": "",
        "Category": "",
        "Publisher": "Williams & Wilkins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The First Elizabeth",
        "Authors": "By Erickson, Carolly",
        "Description": "A portrait of the Tudor queen and her times attempts to give an accurate portrayal of Elizabeth's complex personality",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Arthur B. Davies (1862-1928) A Centennial Exhibition.",
        "Authors": "By Utica. Munson-Williams-Proctor Institute.  Essays by John Gordon and Harris K. Prior",
        "Description": "",
        "Category": "",
        "Publisher": "Munson-Williams-Proctor Institute",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "The Magic Moving Picture Book",
        "Authors": "By Bliss, Sands & Co.",
        "Description": "Volcanoes erupt, houses go up in flames, a steamboat plows through the water, and 15 other illusions come to life when you use the specially ruled acetate screen provided in an inside pocket.",
        "Category": " Juvenile Nonfiction , Games & Activities , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "Chaos Rising (Spy High, Mission Two)",
        "Authors": "By J., Butcher A.",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown Books for Young Readers, 2004",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Stanley in Space (Flat Stanley)",
        "Authors": "By Nash, Scott (ILT) and Brown, Jeff",
        "Description": "A Far-out adventure!The President of the United States has chosen Stanley Lambchop and his family to become the first humans to fly in the Star Scout, a new top-secret spaceship.Stanley's most exciting adventure is about to begin. He'll meet the Queen of England, have a birthday party in outer space, and save a whole planet of aliens from danger. Oh, that Stanley!",
        "Category": " Juvenile Fiction , Science Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Invisible Stanley (Flat Stanley)",
        "Authors": "By Pamintuan, Macky (ILT) and Brown, Jeff",
        "Description": "Disappearing actOne morning, after a terrible storm, Stanley Lambchop is nowhere to be found. His family can hear him, and there is a lump under his covers, but no one can find him! Just where is that boy?Then they discover the truth -- Stanley is invisible! At first, Stanley is very busy. There's so much for an invisible boy to do. But will he stay that way forever?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Flat Stanley: His Original Adventure!",
        "Authors": "By Pamintuan, Macky (ILT) and Brown, Jeff",
        "Description": "In this 50th anniversary edition, join Flat Stanley and the rest of the Lambchop family on the adventure that started it all!Kids love Flat Stanley—even reluctant readers. And for parents and teachers, each Flat Stanley book delivers multicultural adventure, plot and character development story elements, and compare and contrast.When Stanley Lambchop wakes up one morning, his brother, Arthur, is yelling. A bulletin board fell on Stanley during the night, and now he is only half an inch thick! Amazing things begin happening to him. Stanley gets rolled up, mailed, and flown like a kite. He even gets to help catch two dangerous art thieves. He may be flat, but he's a hero.\"With lots of pictures and goofy situations, this is a short, delightful story that young readers have loved for generations.\" (Brightly.com)",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2013"
        }
    },
    {
        "Title": "Stanley and the Magic Lamp (Flat Stanley)",
        "Authors": "By Nash, Scott (ILT) and Brown, Jeff",
        "Description": "Don’t miss this magical Flat Stanley chapter book adventure!Stanley Lambchop has found a real magic lamp with a genie inside! The genie tells Stanley he can wish for anything in the world: fame, a magical pet, superpowers—you name it.When Stanley's family finds out about the genie, they have some wishes, too. But the more wishes Stanley makes, the stranger his own life becomes…",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Beany Goes to Camp",
        "Authors": "By Natti, Susanna (ILT) and Wojciechowski, Susan",
        "Description": "\"Beany might well be a descendant of Beverly Cleary’s Ramona. - BOOKLISTIn BEANY GOES TO CAMP, school’s out, but Beany does not want to go to Camp Onondaga. Readers will laugh in recognition as Beany braves a buggy world of morning bugle calls, rowdy mess halls, and dreaded swimtests in this familiar tale of angst - and unexpected accomplishment - at summer camp.",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Carnival at Candlelight (Magic Tree House #33)",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "MERLIN HAS ASKED Jack and Annie to help on another Merlin Mission. This time they head back into history to Venice, Italy. With the help of a research book, a book of magic rhymes, and a set of mysterious instructions from Merlin, the heroes will save the beautiful city from a flood! Here’s another Magic Tree House book that will engage kids with history, magic, and nonstop action from beginning to end.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Ricky Ricotta's Mighty Robot vs. the Jurassic Jack Rabbits from Jupiter",
        "Authors": "By Pilkey, Dav and Ontiveros, Martin (ILT)",
        "Description": "With more than one million books in print, Ricky Ricotta and his Mighty Robot are a big hit with children! But have they finally met their match with the Jurassic Jack Rabbits from Jupiter?It's Ricky Ricotta's birthday, and as a special treat, his parents are taking him and his Mighty Robot to see dinosaurs at the museum. Too bad they've also invited Ricky's little cousin Lucy--she's a real pest! When they get to the museum, all the dinosaurs are missing their heads . . . because an evil spacebunny from Jupiter has used the dino DNA to create Jurassic Jack Rabbits! Now it's up to the entire Ricotta family, including Lucy, to stop them from taking over the planet. With their easy-to-read language and action-packed pictures, the Ricky Ricotta books are ideal for beginning readers.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Blue Sky Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Season of the Sandstorms (Magic Tree House #34)",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "Jack and Annie travel back in time to a desert in the Middle East at the behest of Merlin who has given them a rhyme to help on their mission. There they meet a Bedouin tribe and learn about the way that they live. From camel rides and oases to ancient writings and dangerous sandstorms, here’s another Magic Tree House filled with all the mystery, history, magic, and old-fashioned adventure that kids love to read about.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Bully for You, Teddy Roosevelt! (Unforgettable Americans)",
        "Authors": "By Fritz, Jean and Wimmer, Mike (ILT)",
        "Description": "Newbery Honor-winning author and preeminent biographer for young people, Jean Fritz, brings to life our colorful 26th president. Conservationist, hunter, family man, and politician, Teddy Roosevelt commanded the respect and admiration of many who marveled at his energy, drive and achievements. An ALA Notable Book. A School Library Journal Best Book of the Year.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Political",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Christmas! (A Wilton Recipe And Idea Book)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Wilton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Antique Oriental Rugs and Carpets",
        "Authors": "By Bamborough, Philip",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Exter Books, distributed by Bookthrift Co.",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Protestant Catholic Jew",
        "Authors": "By Will Herberg",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Head-to-Head Baseball: Ken Griffey, Jr. and Frank Thomas (Sports Illustrated for Kids Books)",
        "Authors": "By John rolfe",
        "Description": "",
        "Category": "",
        "Publisher": "Sports Illustrated for Kids, Time, Inc",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Bearded Dragons (Reptile and Amphibian Keeper's Guide)",
        "Authors": "By Bartlett, Patricia and Bartlett, Richard D.",
        "Description": "As part of the larger Series, Bearded Dragons describes several housing options for this exotic lizard, from a simple glass aquarium to outdoor housing in warmer climates. There are approximately 50-75 full-color photos throughout.",
        "Category": " Pets , Reptiles, Amphibians & Terrariums",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Cross My Heart and Hope to Spy (Gallagher Girls, 2)",
        "Authors": "By Carter, Ally",
        "Description": "After staking out, obtaining, and then being forced to give up her first boyfriend, Josh, all Cammie Morgan wants is a peaceful semester. But that's easier said than done when you're a CIA legacy and go to the premier school in the world . . . for spies.  Cammie may have a genius I.Q., but there are still a lot of things she doesn't know. Like, will her ex-boyfriend even remember she exists? And how much trouble is she really in after what happened last semester? And most of all, why is her mother acting so strangely?  Despite Cammie's best intentions to be a normal student, danger seems to follow her. She and her friends learn that their school is going to play host to some mysterious guests--code name: Blackthorne. Then she's blamed for a security breach that leaves the school's top secret status at risk.  Soon, Cammie and her friends are crawling through walls and surveilling the school to learn the truth about Blackthorne and clear Cammie's name. Even though they have confidence in their spy skills, this time the targets are tougher (and hotter), and the stakes for Cammie's heart--and her beloved school--are higher than ever.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Space (Magic Tree House Research Guide)",
        "Authors": "By Murdocca, Sal (ILT), Osborne, Mary Pope, and Osborne, Will",
        "Description": "The #1   bestselling chapter book series of all time celebrates 25 years with new   covers and a new, easy-to-use numbering system! Getting the facts behind the   fiction has never looked better.Track   the facts with Jack and Annie!   When Jack and Annie got back from their adventure in Magic Tree House   #8: Midnight on the Moon, they had lots of questions. How did the   universe begin? How long does it take to get to the moon? How hot is the sun?   What does it feel like to be in space? Find out the answers to these   questions and more as Jack and Annie track the facts. Filled with up-to-date information, photos, illustrations, and fun tidbits   from Jack and Annie, the Magic Tree House Fact Trackers are the perfect way   for kids to find out more about the topics they discovered in their favorite   Magic Tree House adventures. And teachers can use Fact Trackers alongside   their Magic Tree House fiction companions to meet common core text pairing   needs. Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and Annie, perfect for readers who   are just beginning chapter books Merlin Missions: More challenging adventures for the experienced   reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite   Magic Tree House adventures Have more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Nonfiction , Technology , Aeronautics, Astronautics & Space Science",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Melting of Maggie Bean",
        "Authors": "By Rayburn, Tricia",
        "Description": "Maggie Bean is a top student, a loyal friend, and has a great sense of humor. But the past year's been kind of rough, what with her dad losing his job and her loads of schoolwork. Maggie's learned to cope by eating chocolate. Lots and lots of chocolate. So much so, that Maggie is dragged by her aunt to weekly Pound Patrollers meetings. No big deal, just utter social devastation. She keeps her mind off PP meetings by \"accidentally\" running into gorgeous 8th grader Peter Applewood; updating her study spreadsheet--a.k.a, Maggie's Master Multi-Tasker; finding a job for her dad; and secretly practicing for one of the two freshman spots on the synchronized swim team. She's got a long way to go to reach her goals, but when Maggie Bean sets her mind on a goal, nothing--not even a bag of Kit Kats--can stand in her way.",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Lonely Planet Signspotting: Absurd & Amusing Signs from Around the World",
        "Authors": "By Lansky, Doug (COM)",
        "Description": "Lonely Planet: The world's leading travel guide publisher*Anyone who has spent time on the road knows that you often have to depend on signs...to navigate the town, locate your hotel, and even obey the law. A scary thought if you've ever come across any of the publicly posted absurdities that appear in this book: signs about as easy to understand as a Swahili auctioneer (to a non-Swahili speaker) or as well-planned as the dance steps in a mosh pit. With the help of signspotters around the globe, we've assembled a collection of some of the most unintentionally entertaining postings on the planet - we hope they confuse and amuse you!Author: Doug LanskyAbout Lonely Planet: Started in 1973, Lonely Planet has become the world's leading travel guide publisher with guidebooks to every destination on the planet, as well as an award-winning website, a suite of mobile and digital travel products, and a dedicated traveller community. Lonely Planet's mission is to enable curious travellers to experience the world and to truly get to the heart of the places where they travel.TripAdvisor Travellers' Choice Awards 2012 and 2013 winner in Favorite Travel Guide category'Lonely Planet guides are, quite simply, like no other.' - New York Times'Lonely Planet. It's on everyone's bookshelves; it's in every traveller's hands. It's on mobile phones. It's on the Internet. It's everywhere, and it's telling entire generations of people how to travel the world.' - Fairfax Media (Australia)  *#1 in the world market share - source: Nielsen Bookscan. Australia, UK and USA. March 2012-January 2013",
        "Category": " Travel , Pictorials",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Trompe L'Oeil: Creating Decorative Illusions With Paint",
        "Authors": "By Gordon-Smith, Roberta",
        "Description": "Presents an introduction to trompe l'oeil painting and provides step-by-step instructions on how to apply these techniques in projects around the home",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Forever Yours: Wedding Quilts, Clothing & Keepsakes",
        "Authors": "By Barickman, Amy",
        "Description": "Instructions for over fifty handmade projects including keepsakes, ribbon-embellished garments, dolls, decorations, quilts, and accessories",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Watson-Guptill Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The MOTLEY FOOL'S RULE BREAKERS, RULE MAKERS: THE FOOLISH GUIDE TO PICKING STOCKS",
        "Authors": "By Gardner, David and Gardner, Tom",
        "Description": "The fraternal operators of an immensely popular Internet site on investment follow up The Motley Fool Investment Guide and apply their irreverent but highly successful approach to investing in stocks, in a comprehensive but accessible handbook. 100,000 first printing.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Horse Tales",
        "Authors": "By Crebbin, June (COM) and Moore, Inga (ILT)",
        "Description": "For any child with a passion for horses, this collection of fourteen tales, gloriously illustrated by Inga Moore, is the perfect equine companion.Saddle up, take the reins, and prepare for an exhilarating ride through this field of horse tales! Here you'll find difficult horses and dream ponies, ponies in danger, and horses that ride to the rescue. June Crebbin's collection of fourteen stories draws on a wide range of places, times, and cultures: there are tales from Ancient Greece, fourteenth-century Mongolia, and France in the Middle Ages; traditional tales from Russia and Native America; and stories from the present day, too. The horses and ponies themselves are equally diverse — of all colors and characters — each magnificently rendered by award-winning artist Inga Moore.",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Silly Little Book Of Knock-Knock Jokes",
        "Authors": "By Magpie Books",
        "Description": "",
        "Category": "",
        "Publisher": "Mustard Parragon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Introductory Econometrics with Applications",
        "Authors": "By Ramanathan, Ramu",
        "Description": "",
        "Category": " Business & Economics , Econometrics",
        "Publisher": "Harcourt Brace College Publishers",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Emily Dickinson : Selected Poems (Cliffs Notes)",
        "Authors": "By Marcus, Mordecai",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background — all to help you gain greater insight into great works you're bound to study for school or pleasure.In CliffsNotes on Emily Dickinson: Selected Poems, you explore some 85 poems from one of America's favorite and best poets. This guide introduces you to the major themes of Dickinson's work and shows how her poems address these themes. You also find insight into her technique, tone, and methods for writing poetry.In this study guide, you'll find Life and Background on the Author, as well as essays on Dickinson's ideas and poetic methods. You'll also find detailed analyses of Dickinson's poems that address the following themes:Nature: Scene and MeaningPoetry, Art, and ImaginationFriendship, Love, and SocietySuffering and GrowthDeath, Immortality, and ReligionClassic literature or modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1982"
        }
    },
    {
        "Title": "Russian Pocket Dictionary",
        "Authors": "By Congrat-Butlar, Stefan",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "August",
            "Year": "1974"
        }
    },
    {
        "Title": "Tiny the Snow Dog (Puffin Easy-to-Read, Level 1)",
        "Authors": "By Meister, Cari and Davis, Rich (ILT)",
        "Description": "Tiny and his best friend love winter. And the best thing about winter is playing in the snow! Tiny's friend throws a snowball, and Tiny runs to catch it. Tiny runs and runs until his friend can't see him anymore. Where is Tiny? He is missing! And what is that sound? Is it a snow monster crunching through the snow, or is it just Tiny the snow dog?",
        "Category": " Juvenile Fiction , Science & Nature , General",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Vegetables (Cooking with Bon appétit)",
        "Authors": "By Knapp Press",
        "Description": "",
        "Category": "",
        "Publisher": "Knapp Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Breads (Cooking With Bon Appetit)",
        "Authors": "By Bon Appetit",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Knapp Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Cakes (Cooking with Bon appetit)",
        "Authors": "By Bon Appetit",
        "Description": "",
        "Category": "",
        "Publisher": "Knapp Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Pasta and pizza (Cooking with Bon appétit)",
        "Authors": "By The Knapp Press",
        "Description": "",
        "Category": "",
        "Publisher": "Knapp Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Italian Favorites (Cooking With Bon Appetit Series)",
        "Authors": "By The Knapp Press",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Knapp Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Bring Warm Clothes: Letters and Photos from Minnesota's Past",
        "Authors": "By Meier",
        "Description": "",
        "Category": " History , United States , State & Local , Midwest (IA, IL, IN, KS, MI, MN, MO, ND, NE, OH, SD, WI)",
        "Publisher": "Minneapolis Star & Tribune Co",
        "Price Starting With ($)": "6.28",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "Pooh's Pumpkin (Winnie the Pooh First Readers)",
        "Authors": "By Yee, Josie (ILT), Gaines, Isabel, and Stevenson, Nancy (ILT)",
        "Description": "Rabbit gives Pooh a pumpkin seed, and he watches it turn from a vine into a flower, and then into a small green ball before becoming a pumpkin",
        "Category": " Juvenile Fiction , Nature & the Natural World , General",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Richad Scarry's Lowly Worm Meets the Early Bird",
        "Authors": "By Scarry, Richard",
        "Description": "Richard Scarry's take on the classic adage \"the early bird catches the worm\" is delightfully realized in this Step 2 reader, out of print for 10 years.Early Bird looks and looks, but he can't seem to find a worm to play with. A jumping frog and a tiny field mouse try to help out, but there just aren't any worms to be found. Early Bird is about to give up when he meets a friendly fellow in a funny hat—it's Lowly Worm! Step 2 (Reading with Help) is for children who recognize familiar words and sound out new words with aural and visual cues. Step 2 titles have simple stories, basic vocabulary, and short sentences.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2013"
        }
    },
    {
        "Title": "Classic Vegetarian Recipes (Classic Cookery Series)",
        "Authors": "By Jackson, Felicity and Ashworth, Sue (EDT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "7.66",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Complete Guide to Factory-Made Houses",
        "Authors": "By Watkins, A.M.",
        "Description": "Describes and reviews with photographs, drawings, and floor plans, each basic type of factory-made housing--modular, precut, paneled, log, dome, A-frame, and mobile--and provides a comprehensive directory to home manufacturers",
        "Category": "",
        "Publisher": "Longman Financial Services Publishing",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Sports Illustrated the Baseball Book",
        "Authors": "By Fleder, Rob (EDT)",
        "Description": "Highlighted by more than three hundred photographs, a celebration of America's National Pastime captures the great teams, players, games, memorabilia, artifacts, and important moments throughout the more than one hundred years of baseball history. 200,000 first printing.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Sports Illustrated",
        "Price Starting With ($)": "7.42",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Best of Josh McDowell: A Ready Defense",
        "Authors": "By McDowell, Josh",
        "Description": "",
        "Category": " Religion , Christian Theology , Apologetics",
        "Publisher": "Here's Life Pub",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Landmarks of the American Revolution: A guide to locating and knowing what happened at the sites of independence",
        "Authors": "By Boatner, Mark Mayo",
        "Description": "",
        "Category": "",
        "Publisher": "HAWTHORN BOOKS",
        "Price Starting With ($)": "15.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Catholic Answer Book",
        "Authors": "By Stravinskas, Peter M. J.",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Our Sunday Visitor",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "National Lampoon Presents True Facts: the Big Book",
        "Authors": "By Ward, Jason (EDT) and Bendel, John (EDT)",
        "Description": "Now, for the first time, fans of National Lampoon's popular True Facts books can enjoy the complete True Facts collection in one hilarious edition.  Every weird and wacky photo, advertisement, announcement, and news article is in one handy volume.  It's a guaranteed hit.",
        "Category": " Humor , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    }
]