[
    {
        "Title": "A Good Marriage (Main Street Editions Gift Books)",
        "Authors": "By Engelbreit, Mary",
        "Description": "The warmth and whimsy of Mary Engelbreit's work is even better when shared--and A Good Marriage is the perfect way to spread the joy.",
        "Category": " Family & Relationships , Marriage",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "It Was on Fire When I Lay Down on It",
        "Authors": "By Fulghum, Robert",
        "Description": "The author presents a memorable collection of observations and commentary that range from an account of a disastrous Christmas pageant to travelogues",
        "Category": " Humor , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Thoughts along the way",
        "Authors": "By Myer, Walter E",
        "Description": "",
        "Category": "",
        "Publisher": "Hugh Birch-Horace Mann Fund, National Education Association of the United States",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "The little brothers",
        "Authors": "By Davis, Dorothy Salisbury",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "8.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Water, water everywhere",
        "Authors": "By Kimbrough, Emily",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Planet Janet In Orbit",
        "Authors": "By Sheldon, Dyan",
        "Description": "Janet's symbiotic relationship with her best friend is put to the test by the arrival of a controlling boyfriend in Dyan Sheldon's witty, diary-style sequel to PLANET JANET.Now that her mum, the Mad Cow, has split from her cad of a dad, Janet Bandry — despite her Creative, Artistic Mind — is leaving the Dark Phase to enter the Work Force.  Only one thing can ease the physical torture of waitressing at a local Mexican restaurant — a dreamy waiter named Ethan who definitely has romantic designs on . . . Disha, Janet's best friend.  Janet, of course, is mature enough to get over it — except for the fact that Disha now won't hang out with anyone but her possessive new beau.  And if that's not appalling enough, even the Mad Cow is newly besotted — with a bearded suitor who has her singing old folk songs and boycotting evil corporate greed.  Good thing Janet is sensible enough to start an advice column for the school paper and has her mates David and Marcus to talk to, as the entire female species seems to have gone insane.Detailed in humorously melodramatic diary entries and including a glossary of Britishisms, PLANET JANET IN ORBIT follows the precarious path of a comically self-absorbed teen who is learning some useful lessons about loyalty, family, and friendship.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Presidential Inaugurations",
        "Authors": "By Boller, Paul F.",
        "Description": "Paul Boller's hugely admired anecdotal histories have consistently shown us new aspects and undiscovered sides to the lives of presidents and those around them. Presidential Inaugurations is no exception, as it illuminates the new life of the president from the moment he is elected to the moment he takes office. As might be expected from the most knowledgeable observer of American presidents, every chapter brings fresh delights that range from the sublime to, inevitably, the ridiculous. Boller accompanies Lincoln on his mysterious first entrance into Washington and renders the poignancy of FDR's last inauguration. There is the surprising appearance of Tallulah Bankhead at Truman's inauguration and the charming report on Eisenhower's 1953 inaugural by Jacqueline Bouvier. Highlighting inaugural moments from 1789 to 2001, Presidential Inaugurations presents the United States displaying its pride, its passions, and its prejudices as it greets a new leader.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Robert Frost country",
        "Authors": "By Melvin, Betsy",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Down Came the Rain: My Journey Through Postpartum Depression",
        "Authors": "By Shields, Brooke",
        "Description": "In this compelling memoir, Brooke Shields talks candidly about her experience with postpartum depression after the birth of her daughter, and provides millions of women with an inspiring example of recovery. When Brooke Shields welcomed her newborn daughter, Rowan Francis, into the world, something unexpected followed--a crippling depression. Now, for the first time ever, in Down Came the Rain, Brooke talks about the trials, tribulations, and finally the triumphs that occurred before, during, and after the birth of her daughter.",
        "Category": " Biography & Autobiography , Rich & Famous",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Deception: A Novel",
        "Authors": "By Mina, Denise",
        "Description": "Things like this don't happen to people like us. That's what Lachlan Harriot thinks as he watches his wife, Susie, led to jail in handcuffs. Yes, Susie, a psychologist, was found covered in blood near the spot where one of her clients appears to have been murdered. But Susie is not a killer, Lachlan thinks. She's my wife. She's our child's mother. Secrets lurk behind closed doors, however, a dark truth made chillingly clear as Lachlan's efforts to prove Susie's innocence uncover an entire secret history--illicit affairs, false identities, unimaginable deception--and this brilliantly acclaimed, page-turning novel speeds toward a conclusion as shocking as it is ingenious.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Undercurrents: A Life Beneath the Surface",
        "Authors": "By Manning, Martha",
        "Description": "This is the memoir of an ordinary woman—a mother, a daughter, a psychologist, a wife—who tells the tale of her spiraling descent into a severe, debilitating depression. Undercurrents pioneers a new literature about women and depression that offers a vision of action instead of victimhood, hope instead of despair.",
        "Category": " Psychology , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Success is a Moving Target",
        "Authors": "By Robert A. Raines",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Meditations for Success: Thoughts & Quotations on Success in Life",
        "Authors": "By Zinker, Annie and Kravat, Leah",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Understanding Islam: An Introduction to the Muslim World, Third Edition",
        "Authors": "By Lippman, Thomas W.",
        "Description": "A little over thirteen centuries ago, the prophet Muhammad converted a few Arab desert tribes to the belief in a single god, Allah, thus founding the religion of Islam. Within a century, that belief had created one of history's mightiest empires—and today Islam continues to shape events around the globe.This comprehensive guide offers an informative and insightful introduction to Islam both as a religion and as a political-economic force. It tells the story of Muhammad—and the rise of Islam; outlines the sacred book, the Koran; explains \"the five pillars of faith\"; explores the interplay between religion and government; describes the differences that divide Islam; and, above all, shows the influence of Islam on world affairs. This second revised edition provides crucial new material on the Islamic community today, including discussion of the Gulf War and the Salman Rushdie affair; the rise and ebb of fundamentalist fervor in Iran, Algeria, and elsewhere; and the relationships among different factions of the Islamic faith. There are also updated descriptions of internal politics in Syria, Egypt, Pakistan, and other Islamic nations. Complete with glossary, bibliography. and index,Understanding Islam is engrossing, essential reading for both students and all who seek a clearer understanding of the world in which we live.",
        "Category": " Religion , Islam , Rituals & Practice",
        "Publisher": "A Meridian Book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Mason's Retreat",
        "Authors": "By Tilghman, Christopher",
        "Description": "Unfolding with the grandeur and suspenseful inevitability of real life, Mason's Retreat tells the story of a family on the Eastern Shore of Maryland on the eve of World War II.After many years of extravagant expatriate living in England, Edward and Edith Mason and their sons, Sebastien and Simon, sail to America to take up residence at the Retreat, the crumbling Mason family estate on the Chesapeake Bay. A man of large appetite and grand illusion, Edward Mason is determined to make a go of it as a gentleman farmer, even though events always seem to conspire against him. Edith and their two sons begin to flourish in America, tasting for the first time the happiness that comes from a sense of freedom and belonging. Yet the family's drift toward destruction inexorably quickens, exposing at the heart of this remarkable novel the powerful interconnections between character, history, and fate; the isolation of class and race; and the corrosive effect of secrets within a family.",
        "Category": " Fiction , War & Military",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.87",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Milan Family Therapy: Variant and Invariant Methods",
        "Authors": "By Gelcer, Esther, McCabe, Ann, and Smith-Resnick, Catherine",
        "Description": "Provides an overview of the Milan Family Therapy Team's work from its inception to its present state. The authors show how the variant and invariant family therapy methods evolved and provide the understanding necessary to allow readers to adapt these approaches to their own work.",
        "Category": " Psychology , Psychotherapy , Couples & Family",
        "Publisher": "Jason Aronson, Inc.",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Secret Lives of Toddlers: A Parent's Guide to the Wonderful, Terrible, Fascinating Behavior of Children Ages 1 to 3",
        "Authors": "By Murphy, Jana",
        "Description": "Why do they rub food in their hair? Why do they want to hear the same book over and over? Why do they love being naked? Between the ages of one and three, children can be delightful, affectionate, intelligent explorers of their newfound world. They can also be holy terrors. Grounded in up-to-date research, The Secret Lives of Toddlers demystifies 52 common behaviors of toddlers, while helping parents appreciate the miraculous development of their children. An entertaining, reassuring guide to toddler behavior, this book shows parents how to get through their kids' toddlerhood with affection, humor, and authority. With explanations from pediatricians, child development experts, and behavioral psychologists, parents will learn to:- Understand the world from a child's point of view- Learn which bad behaviors need intervention and which can be ignored- Cultivate good manners and reward good behavior- Reduce their own frustration- Play, speak, read, and interact with their toddler in healthy ways",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Talking To Your Children About God",
        "Authors": "By Osborne, Rick",
        "Description": "From the Creator and Coauthor of the Popular 101 Questions Children Ask about...Series--A Practical Guide on How to Build a Strong, Tangible Spiritual Foundation in Your Children&#39;s LivesMany of today&#39;s parents remember their own childhood experiences with God and religion as abstract and confusing, leaving them with more questions than answers. It is with this in mind that Rick Osborne has created Talking to Your Children about God, an indispensible guide for parents who want to be prepared for those \"hard-to-answer\" questions about God.  Full of helpful tips and suggestions, this book provides answers that will satisfy the inquisitive and persistent nature of kids when they pose such difficult questions as: Why can&#39;t I see God? What&#39;s so important about the Bible? Why do we go to church? What should I say when I pray? Does God watch everything I do?What is heaven like?What are angels?I highly recommend Rick&#39;s resources to every parent. [He] is one of God&#39;s gifts to parents.\"--Josh McDowell, acclaimed Christian author and speaker.",
        "Category": " Religion , Christianity , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Mind's Best Work",
        "Authors": "By Perkins, D. N.",
        "Description": "Over the years, tales about the creative process have flourished-tales of sudden insight and superior intelligence and personal eccentricity. Coleridge claimed that he wrote \"Kubla Khan\" in one sitting after an opium-induced dream. Poe declared that his \"Raven\" was worked out \"with the precision and rigid consequence of a mathematical problem.\" D. N. Perkins discusses the creative episodes of Beethoven, Mozart, Picasso, and others in this exploration of the creative process in the arts, sciences, and everyday life.",
        "Category": " Psychology , General",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Something More: Excavating Your Authentic Self",
        "Authors": "By Ban Breathnach, Sarah",
        "Description": "The best-selling author of Simple Abundance explores the nine stages essential to living an authentic life, combining storytelling and interpretation to lead women along a path to self-fulfillment and happiness. 500,000 first printing. One Spirit Main.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Woman's Encyclopedia of Natural Healing",
        "Authors": "By Null, Gary",
        "Description": "In the winter of 1995/96, bestselling nutritionist Dr. Gary Null talked with more than a hundred leading alternative health practitioners from all over the country to ascertain which approaches they found most effective when treating the health problems that affect women most. He then conducted a wide-ranging computer search of studies reported in the medical literature on the same topics. The result is The Woman's Encyclopedia of Natural Healing, a health compendium for women, founded in holistic principles and featuring the most up-to-date clinical experiences and published research. Emphasizing tried and proven alternative approaches, The Woman's Encyclopedia of Natural Healing complements works based in conventional modalities such as The New Our Bodies, Ourselves. Divided into 28 chapters, each topic includes a thorough discussion of the health problem and the recommended alternative approaches to prevention and treatments.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Tomorrow's War, Today's Decisions: Iraqi Weapons of Mass Destruction and the Implications of Wmd-Adversaries for Future U.S. Military Strategy",
        "Authors": "By Chandler, Robert W.",
        "Description": "",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Amcoda Pr",
        "Price Starting With ($)": "11.54",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Bear Went Over the Mountain",
        "Authors": "By Kotzwinkle, William",
        "Description": "Once upon a time in rural Maine, a big bear found a briefcase under a tree. Hoping for food, he dragged it into the woods, only to find that all it held was the manuscript of a novel. He couldn't eat it, but he did read it, and decided it wasn't bad. Borrowing some clothes from a local store, and the name Hal Jam from the labels of his favorite foods, he headed to New York to seek his fortune in the literary world.Then he took America by storm.The Bear Went Over the Mountain is a riotous, magical romp with the buoyant Hal Jam as he leaves the quiet, nurturing world of nature for the glittering, moneyed world of man. With a pitch-perfect comic voice and an eye for social satire to rival Swift or Wolfe, bestselling author William Kotzwinkle limns Hal's hilarious journey to New York, Los Angeles, and the great sprawling country in between, where a bear makes good despite his animal instincts, and where money-hungry executives see not a hairy beast with a purloined novel, but a rough-hewn, soulful, media-perfect nature guy who just might be the next Hemingway.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Sleep Disorders: An Alternative Medicine Definitive Guide",
        "Authors": "By Goldberg, Burton, Ross, Herbert, and Brenner, Keri",
        "Description": "Addresses the causes of insomnia, restless legs disorder, and sleep apnea, exploring how changes in diet, exercise, natural supplements, and mind/body therapies can provide lasting relief.",
        "Category": " Health & Fitness , General",
        "Publisher": "Alternativemedicine.com",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Pocket Mom: Everyday Wisdom, Practical Tips, and Down-Home Advice",
        "Authors": "By Fayer, Dina",
        "Description": "Mom Really Does Know Best   Whether you’re a new grad living on your own or you’re moving far from the place Mom calls home, Pocket Mom is there when you need it! This book is a collection of Mom’s essential wisdom, from cooking, housekeeping, safety, and hygiene tips to advice on life, love, and getting along. Learn how to:        •  Load a dishwasher      •  Cook comfort food      •  Prevent mold and mildew      •  Prioritize your outrage      •  Dress for a first date      •  Iron a shirt      •  Argue properly      •  Install shelf paper      •  Sort your laundry      •  Fight germs       •  Recognize true love   . . . and much more. When it comes to living in the real world, Mom really does know best!",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Knights and Castles: A Nonfiction Companion to Magic Tree House #2: The Knight at Dawn (Magic Tree House (R) Fact Tracker)",
        "Authors": "By Murdocca, Sal (ILT), Osborne, Mary Pope, and Osborne, Will",
        "Description": "The #1   bestselling chapter book series of all time celebrates 25 years with new   covers and a new, easy-to-use numbering system! Getting the facts behind the   fiction has never looked better.  Track   the facts with Jack and Annie!! When Jack and Annie got back from their adventure in Magic Tree House   #2: The Knight at Dawn, they had lots of questions. How were castles   built? What was it like to live inside a castle? How did boys train   to become knights? Did horses really wear armor? Find out the   answers to these questions and more as Jack and Annie track the facts. Filled with up-to-date information, photos, illustrations, and fun tidbits   from Jack and Annie, the Magic Tree House Fact Trackers are the perfect way   for kids to find out more about the topics they discovered in their favorite   Magic Tree House adventures. And teachers can use Fact Trackers alongside   their Magic Tree House fiction companions to meet common core text pairing   needs.   Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and Annie, perfect for readers who   are just beginning chapter books Merlin Missions: More challenging adventures for the experienced   reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite   Magic Tree House adventures Have more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Nonfiction , History , Medieval",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Ice Queen: A Novel",
        "Authors": "By Hoffman, Alice",
        "Description": "Be careful what you wish for. A woman who was touched by tragedy as a child now lives a quiet life, keeping other people at a cool distance. She even believes she wants it that way. Then one day she utters an idle wish and, while standing in her house, is struck by lightning. But instead of ending her life, this cataclysmic event sparks a strange and powerful new beginning.After the lightning strike, the chill in her spirit starts to have physical manifestations. She feels frozen from the inside out, and everything red looks as colorless as snow. Hearing of a fellow lightning-strike survivor - a man who was apparently dead for forty minutes, then simply got up and walked away - she goes in search of him. Perhaps Lazarus Jones, as he is known, can teach her to live without fear. He turns out to be her perfect opposite, a man whose breath can boil water and whose touch scorches. As an obsessive love affair begins between them, both hide their most dangerous secrets - what happened in the past that turned one to ice and the other to fire. And everyone in her fragile network of friends and family will be drawn into the conflagration of their joining.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Magic Cornfield",
        "Authors": "By Willard, Nancy",
        "Description": "Tottem is on his way to Minneapolis for Bottom’s birthday, but he loses his way in a Magic Cornfield. One minute he’s in Dime Box, Texas, and the next he’s in Angels Camp, California. He’s having a hard time finding his way, but a traveling mailbox is always nearby and sends his postcards on to Cousin Bottom. The postcards that tell Tottem’s story show the fantastic creatures and other curiosities that Tottem encounters on his travels through the cornfield. Authentic stamps and unique postmarks from the real American cities and towns add to the magic.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Harcourt Brace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Science Fair Success Secrets: How to Win Prizes, Have Fun, and Think Like a Scientist",
        "Authors": "By Haduch, Bill and Scheuer, Philip (ILT)",
        "Description": "This book is for anyone who wants to excel at a school science fair.  It gives complete guidance for every stage of a successful project, from brainstorming ideas to final presentation. More than a \"recipe-style\" science fair book, this work promotes the understanding of real science.  Twenty prizewinning projects from top national competitions are included: ? How to make the best chocolate-chip cookies-scientifically! ? Do lefties have slower reaction times than right-handers? ? Does grass grow faster if you cut it short? And more! Kids will love the hip, engaging text, filled with fascinating trivia and wacky science jokes, as well as the very funny illustrations. Solid science presented in a compelling manner makes this a stellar addition to the category.",
        "Category": " Juvenile Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "This Quiet Dust and Other Writings",
        "Authors": "By Styron, William",
        "Description": "Essays discuss American history, slavery, the Holocaust, prisons, the military, and American authors",
        "Category": " Literary Collections , Essays",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "The Secret Life of Food",
        "Authors": "By Crespo, Clare, Staudenmaier, Eric (ILT), and Staudenmaier, Eric",
        "Description": "A stunning gift book with lush photography contains easy-to-follow recipes to disguise food as ordinary objects found in and around the home, such as Shirt-and-Pants Cake, Potato and Stringbean flip-flops, and a Jello-O aquarium with Swedish fish.",
        "Category": " Juvenile Nonfiction , Cooking & Food",
        "Publisher": "Disney Hyperion",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Sneezing Your Head Off?: How to Live With Your Allergic Nose",
        "Authors": "By Boggs, Peter",
        "Description": "Explains how the human nose works, tells how to identify chronic nose allergies, and recommends the best nasal sprays, decongestants, and antihistamines",
        "Category": " Health & Fitness , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "A Day in the Life of the American Woman: How We See Ourselves",
        "Authors": "By Wohlmuth, Sharon J., Saline, Carol, and Sheggeby, Dawn",
        "Description": "Fifty of the world's most talented photographers spend a full day recording key moments in the lives of a wide diversity of American women--their daily lives, challenges, joys and accomplishments, and roles in the workplace, family, and community--in a remarkable assortment of photographs, accompanied by essay-length personal profiles, narrative captions, and extended quotes. 150,000 first printing.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Cirque du Freak: A Living Nightmare",
        "Authors": "By Shan, Darren",
        "Description": "From the Master of Horror comes the first gripping book in the twelve book New York Times bestselling Saga of Darren Shan. Start the tale from the beginning in the book that inspired the feature film The Vampire's Assistant and petrified devoted fans worldwide.A young boy named Darren Shan and his best friend, Steve, get tickets to the Cirque Du Freak, a wonderfully gothic freak show featuring weird, frightening half human/half animals who interact terrifyingly with the audience. In the midst of the excitement, true terror raises its head when Steve recognizes that one of the performers-- Mr. Crepsley-- is a vampire! Stever remains after the show finishes to confront the vampire-- but his motives are surprising! In the shadows of a crumbling theater, a horrified Darren eavesdrops on his friend and the vampire, and is witness to a monstrous, disturbing plea. As if by destiny, Darren is pulled to Mr. Crepsley and what follows is his horrifying descent into the dark and bloody world of vampires. This is the beginning of Darren's story.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Fall: A Novel",
        "Authors": "By Mawer, Simon",
        "Description": "Rob Dewar is driving home when he hears on the radio that his old friend and climbing partner, Jamie Matthewson, has fallen to his death on a daredevil solo climb. Although he not spoken to Jamie in many years, he turns his car around and heads to Wales to comfort Jamie's widow, Ruth. This is a detour that will take Rob on a journey back to the past, to his youth, and to his own obsessive climbing days, when he made the pivotal choices that now come back to haunt him. While unraveling the unanswered questions about Jamie's death, he confronts decades-old betrayals and lies. And it is the secrets about Jamie's life that lead Rob to the truth about his own mother's experiences in London before and during World War II.Simon Mawer unveils the layers of history connecting a group of people intertwined over the years by love, competition, and lust. In the shadow of one love triangle is the story of another, and as we follow the characters from London during the Blitz to the mountain ranges of the Alps and back to present-day Wales, Mawer reveals how the agonies of the past weigh upon the present.",
        "Category": " Fiction , General",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "American Zoom: Stock Car Racing - From the Dirt Tracks to Daytona",
        "Authors": "By Golenbock, Peter",
        "Description": "An exploration of the history, development, marketing, and appeal of American stock car racing traces the sport's evolution from moonshine runners all the way to today's multimillion dollar racing circuit, profiling some of the sport's great personalities. Original.",
        "Category": " Sports & Recreation , Motor Sports",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Itsy Bitsy Spider",
        "Authors": "By Trapani, Iza",
        "Description": "The spirited itsy bitsy spider has captured the hearts of generations of children in the much-loved nursery rhyme. Now she's back—on a new magical journey! This all-new adventure for the itsy bitsy spider has exciting encounters with a fan, a mouse, a rocking chair, a cat, and a big maple tree. Finally, the itsy bitsy spider finds a lovely spot to spin a new silky web. Iza Trapani’s vibrant watercolor illustrations paired with a playful rhythm makes this new take on an old favorite feel like an instant classic. A perfect read-aloud; children will enjoy time and again the delightful antics of the energetic itsy bitsy spider.",
        "Category": " Juvenile Fiction , Animals , Lions, Tigers, Leopards, etc.",
        "Publisher": "Charlesbridge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "England: A Guide to Recent Architecture (Architectural Guides)",
        "Authors": "By Hardingham, Samantha",
        "Description": "",
        "Category": " Architecture , Reference",
        "Publisher": "Konemann",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Industrial psychology",
        "Authors": "By McCormick, Ernest J.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Three Tall Women",
        "Authors": "By Albee, Edward",
        "Description": "WINNER OF THE PULITZER PRIZE FOR DRAMARecently revived on Broadway in a production directed by Joe Mantello, starring two-time Oscar winner Glenda Jackson and Tony winner Laurie MetcalfEarning a Pulitzer and Best Play awards from the Evening Standard, Critics Circle, and Outer Critics Circle, among others, when it premiered, Edward Albee has, in Three Tall Women, created a masterwork of modern theater.  As an imperious, acerbic old woman lies dying, she is tended by two other women and visited by a young man.  Albee’s frank dialogue about everything from incontinence to infidelity portrays aging without sentimentality.  His scenes are charged with wit, pain, and laughter, and his observations tell us about forgiveness, reconciliation, and our own fates.  But it is his probing portrait of the three women that reveals Albee’s genius.  Separate characters on stage in the first act, yet actually the same “everywoman” at different ages in the second act, these “tall women” lay bare the truths of our lives—how we live, how we love, what we settle for, and how we die.  Edward Albee has given theatergoers, critics, and students of drama reason to rejoice.",
        "Category": " Drama , American , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Bobos In Paradise: The New Upper Class and How They Got There",
        "Authors": "By Brooks, David",
        "Description": "Do you believe that spending $15,000 on a media center is vulgar, but that spending $15,000 on a slate shower stall is a sign that you are at one with the Zenlike rhythms of nature? Do you work for one of those visionary software companies where people come to work wearing hiking boots and glacier glasses, as if a wall of ice were about to come sliding through the parking lot? If so, you might be a Bobo.  In his bestselling work of \"comic sociology,\" David Brooks coins a new word, Bobo, to describe today's upper class -- those who have wed the bourgeois world of capitalist enterprise to the hippie values of the bohemian counterculture. Their hybrid lifestyle is the atmosphere we breathe, and in this witty and serious look at the cultural consequences of the information age, Brooks has defined a new generation.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "This Never Happened: A Novel",
        "Authors": "By Summers, Elly",
        "Description": "Richard Hayes gets a call late one night: His sister has murdered her husband. The origins of the violence probably lie in the complex story of their family's past, and in order to save Claire, Richard is forced to go back and back, down and down, to try to unearth what really happened at the family farm, to uncover the truth about his wealthy and respected family, and his own possible role in shocking events. Was Claire's act self-defense? Did she believe, in a vivid moment of painful memory, that the man she killed was someone else?Like Pat Conroy's The Prince of Tides, This Never Happened explores how secrets buried in a family's past can threaten to destroy the present and how, in the process of helping his sister, a man begins to find himself and come alive again - in a new love affair, and in his relationship to the past, present, and future.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Glenn the Astronaut Who Would Be President",
        "Authors": "By Van Riper, Frank",
        "Description": "Traces the life of John Glenn, a fighter pilot in World War II and Korea, a test pilot who set the transcontinental speed record, first American to orbit the Earth, successful businessman, and senator from Ohio",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Empire Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Storybook Cross-Stitch",
        "Authors": "By Vanessa-Ann Collection",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Shepherd of the Hills",
        "Authors": "By Harold Bell Wright",
        "Description": "",
        "Category": "",
        "Publisher": "Shepherd of the Hills Historical Society",
        "Price Starting With ($)": "7.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Mars and Venus in the Workplace: A Practical Guide for Improving Communication and Getting Results at Work",
        "Authors": "By Gray, John",
        "Description": "John Gray shows that by understanding the differences between men and women in the workplace, anyone can identify and respond to various business approaches in a manner that earns greater respect and promotes increased cooperation. By recognizing how men and women interpret behaviors and reactions differently, a person can make more informed choices of how to make the best impression.Mars and Venus in the Workplace analyzes the differences in the ways men and women communicate, solve problems, react to stress, earn respect, promote themselves, experience emotional support, minimize conflict, score points, view sex, and ask for what they want. By showing the many ways men and women misunderstand and misinterpret each other in the workplace, John Gray offers practical advice on reducing unnecessary conflict and frustration. Filled with his trademark communications charts and practical advice on everyday office issues, Mars and Venus In The Workplace will enable readers to achieve their goals and to make the workplace a source of fulfillment.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Getting Through to Your Kids",
        "Authors": "By Spizman, Robyn Freedman and Popkin, Michael",
        "Description": "From toddlers to teens, children are full of questions. While we all want to give the right answers, we don't always know whether to be detailed or discreet, protective or honest.  Drawn from the advice and experiences of dozens of psychological, medical, and educational experts, as well as countless parents, this timely and telling book offers answers to all the questions kids are bound to ask. Learn:  * How to jumpstart a conversation and simplify complicated topics * How to know the best age to talk about sex, drugs, and other subjects * Why once isn't always enough-and why some topics need to be revisited * Whether some questions are best left unanswered * How to gain a child's confidence and respect",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Fire of Heaven (Fire of Heaven Trilogy, Book 3)",
        "Authors": "By Myers, Bill",
        "Description": "'My words will become a fire in your mouth that you cannot contain. They will burn until you have warned my Bride. Warn her before it is too late!'So begins a dramatic journey into holiness, as newlyweds Brandon and Sarah Martus accept the call to become Revelation’s two prophets.This is not another end-times thriller, but one of the most intense and thought-provoking pieces of Christian fiction to come alone in years. As the couple prepare for the final showdown against Satan himself, they must live and proclaim the truths Christ has given his end-times church. From America, to archaeological ruins dating back to Bible times, to the Himalayas, and finally to Jerusalem, Brandon and Sarah battle the forces of man and hell while learning the true cost of following Christ . . . and experiencing a Love far deeper than either could have imagined.",
        "Category": " Fiction , Religious",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Iola Leroy, or Shadows Uplifted (Black Women Writers)",
        "Authors": "By Harper, Frances E. W.",
        "Description": "Iola Leroy, mulatto who becomes a slave when her white father dies, finds that through her maternal ancestors she is heir to a black family, searches for her true community and her real family",
        "Category": " Literary Criticism , General",
        "Publisher": "Beacon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Motherhood is a Contact Sport",
        "Authors": "By Reimer, Susan",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Baltimore Sun",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Crossing the Threshold of Hope (Random House Large Print)",
        "Authors": "By John Paul II, Pope and Messori, Vittorio",
        "Description": "Pope John Paul II speaks out on some of the major issues confronting humankind at the dawn of the twenty-first century",
        "Category": " Religion , General",
        "Publisher": "Random House Large Print",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "La Scala Encyclopedia of the Opera: A Complete Reference Guide",
        "Authors": "By Bagnoli, Giorgio and Fawcett, Graham (TRN)",
        "Description": "The La Scala Encyclopedia of the Opera is a comprehensive and easy-to-consult reference book covering, from A to Z, the varied repertoire of world opera. More than 450 operas, spanning the last four centuries, are detailed, from Jacopo Peri's Euridice through Verdi and Wagner, and up to more modern works. Each opera entry lists the specifics concerning the author, date, town, and theater of the work's first performance and includes information about the singers, as well as a summary of the plot and a commentary on the critical acclaim and public reception of the most famous performances.This encyclopedia also introduces all the performers and composers who have been associated with opera, from its origins through the popularity it enjoys today. Many entries are accompanied by sections that focus on specific themes, such as singing dynasties, the relationships between opera and cinema and between the opera singer and the impresario, the origins of American opera, the artistic and musical life that accompanies a festival, madness in opera, and operas as symbols of great theaters. This is the essential opera reference guide; up-to-date, informative, and beautifully illustrated, it can be consulted with equal ease by lay opera fans and scholars alike.",
        "Category": " Music , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Cirque du Freak: Vampire Mountain (Book Four) (Cirque Du Freak, 4)",
        "Authors": "By Shan, Darren",
        "Description": "Darren Shan and Mr. Crepsley embark on a dangerous trek to the very heart of the vampire world. But they face more than the cold on Vampire Mountain-the vampaneze have been there before them.Will a meeting with the Vampire Princes restore Darren's human side, or turn him further toward the darkness? Only one thing is certain-Darren's initiation into the vampire clan is more deadly than he can ever have imagined.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Extreme Team #2: Day of the Dragon",
        "Authors": "By Koelsch, Michael (ILT), Christopher, Matt, and Peters, Stephanie True",
        "Description": "While studying kung fu to try to overcome his clumsiness, Mark learns something that may interfere with his friends' plans for a group Halloween costume.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Angel Experiment (Maximum Ride, Book 1)",
        "Authors": "By Patterson, James",
        "Description": "In James Patterson's blockbuster series, fourteen-year-old Maximum Ride, better known as Max, knows what it's like to soar above the world. She and all the members of the \"flock\"--Fang, Iggy, Nudge, Gasman and Angel--are just like ordinary kids--only they have wings and can fly. It may seem like a dream come true to some, but their lives can morph into a living nightmare at any time...like when Angel, the youngest member of the flock, is kidnapped and taken back to the \"School\" where she and the others were experimented on by a crew of wack jobs. Her friends brave a journey to blazing hot Death Valley, CA, to save Angel, but soon enough, they find themselves in yet another nightmare--this one involving fighting off the half-human, half-wolf \"Erasers\" in New York City. Whether in the treetops of Central Park or in the bowels of the Manhattan subway system, Max and her adopted family take the ride of their lives. Along the way Max discovers from her old friend and father-figure Jeb--now her betrayed and greatest enemy--that her purpose is save the world--but can she?",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "jimmy patterson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Six Sigma: The Breakthrough Management Strategy Revolutionizing the World's Top Corporations",
        "Authors": "By Harry, Mikel J. and Schroeder, Richard",
        "Description": "The extraordinary breakthrough management program--heralded by GE, Motorola, and AlliedSignal--that is sweeping corporate America with its unprecedented ability to achieve superior financial results.Six Sigma is the most powerful breakthrough management tool ever devised, promising increased market share, cost reductions, and dramatic improvements in bottom-line profitability for companies of any size. The darling of Wall Street, it has become the mantra of Fortune 500 boardrooms around the world because it works.What is Six Sigma? It is first and foremost a business process that enables companies to increase profits dramatically by streamlining operations, improving quality, and eliminating defects or mistakes in everything a company does, from filling out purchase orders to manufacturing airplane engines. While traditional quality programs have focused on detecting and correcting defects, Six Sigma encompasses something broader: It provides specific methods to re-create the process itself so that defects are never produced in the first place.Most companies operate at a three- to four-sigma level, where the cost of defects is roughly 20 to 30 percent of revenues. By approaching Six Sigma--fewer than one defect per 3.4 million opportunities--the cost of quality drops to less than 1 percent of sales.This is because the highest quality also results in the lowest costs. When GE reduced its costs from 20 percent to less than 10 percent, it saved a billion dollars in just two years--money that goes directly to the bottom line. This is the reason Wall Street and corporations as diverse as Sony, Ford, Nokia, Texas Instruments, Canon, Hitachi, Lockheed Martin, American Express, Toshiba, DuPont, and Polaroid have embarked on corporate-wide Six Sigma programs.Six Sigma should be of paramount importance to every forward-thinking executive and manager determined to make their company world-class in their industry.",
        "Category": " Technology & Engineering , Quality Control",
        "Publisher": "Doubleday Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "D-Day: A Day That Changed America: They Fought to Free Europe from Hitler's Tyranny",
        "Authors": "By Craig, David (ILT) and Tanaka, Shelley",
        "Description": "It was the greatest invasion the world had ever seen. Officially known as \"Operation Overlord,\" this World War II assault began on the morning of June 6, 1944. Thousands of American, British, and Canadian soldiers aboard hundreds of landing craft attacked beaches along nearly fifty miles of France's coastline in Normandy. Backing them up were the big guns of some of the mightiest ships in the Allied navies, and countless bomber, fighter, and transport aircraft. By the end of that day, an Allied army had made it ashore despite sometimes fierce opposition, signaling the end of Nazi tyranny over Europe. Using the real-life stories of young men caught up in this great event, along with original paintings, photographs, and memorabilia, D-Day, the book, will present a compelling account of this world-changing day. Shelly Tanaka is the author of many acclaimed books of nonfiction for children, including the first two books in The Day That Changed America Series: Gettysburg and The Alamo. She is also the author of Attack on Pearl Harbor and many of the books in the \"I Was There\" series.",
        "Category": " Juvenile Nonfiction , History , Military & Wars",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Southern Accents on Color",
        "Authors": "By Macdougall, Frances",
        "Description": "",
        "Category": " Architecture , Design, Drafting, Drawing & Presentation",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Railroads Triumphant: The Growth, Rejection, and Rebirth of a Vital American Force",
        "Authors": "By Martin, Albro",
        "Description": "In 1789, when the First Congress met in New York City, the members traveled to the capital just as Roman senators two thousand years earlier had journeyed to Rome, by horse, at a pace of some five miles an hour. Indeed, if sea travel had improved dramatically since Caesar's time, overland travel was still so slow, painful, and expensive that most Americans lived all but rooted to the spot, with few people settling more than a hundred miles from the ocean (a mere two percent lived west of the Appalachians). America in effect was just a thin ribbon of land by the sea, and it wasn't until the coming of the steam railroad that our nation would unfurl across the vast inland territory.     In Railroads Triumphant, Albro Martin provides a fascinating history of rail transportation in America, moving well beyond the \"Romance of the Rails\" sort of narrative to give readers a real sense of the railroad's importance to our country. The railroad, Martin argues, was \"the most fundamental innovation in American material life.\" It could go wherever rails could be laid--and so, for the first time, farms, industries, and towns could leave natural waterways behind and locate anywhere. (As Martin points out, the railroads created small-town America just as surely as the automobile created the suburbs.) The railroad was our first major industry, and it made possible or promoted the growth of all other industries, among them coal, steel, flour milling, and commercial farming. It established such major cities as Chicago, and had a lasting impact on urban design. And it worked hand in hand with the telegraph industry to transform communication. Indeed, the railroads were the NASA of the 19th century, attracting the finest minds in finance, engineering, and law.     But Martin doesn't merely catalogue the past greatness of the railroad. In closing with the episodes that led first to destructive government regulation, and then to deregulation of the railroads and the ensuing triumphant rebirth of the nation's basic means of moving goods from one place to another, Railroads Triumphant offers an impassioned defense of their enduring importance to American economic life. And it is a book informed by a lifelong love of railroads, brimming with vivid descriptions of classic depots, lavish hotels in Chicago, the great railroad founders, and the famous lines. Thoughtful and colorful by turn, this insightful history illuminates the impact of the railroad on our lives.",
        "Category": " History , United States , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Journey to Beloved",
        "Authors": "By Winfrey, Oprah, Regan, Ken (PHT), and Regan, Ken",
        "Description": "The award-winning actress and talk-show host recreates her experiences while working on the film version of Toni Morrison's acclaimed novel Beloved, in an evocative account that combines Oprah's personal journals with the thoughts of Jonathan Demme, Danny Glover, and others who worked on the movie. 250,000 first printing.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Chesapeake Wildlife: Stories of Survival and Loss",
        "Authors": "By Vojtech, Pat",
        "Description": "",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "Schiffer",
        "Price Starting With ($)": "6.68",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Humane Society of the United States Complete Guide to Dog Care: Everything You Need to Keep Your Dog Healthy and Happy",
        "Authors": "By Lane, Marion S.",
        "Description": "An illustrated, definitive guide to canine care and training covers subjects ranging from choosing the right dog to understanding its particular dietary needs and emphasizes the cultivation of companionship between dogs and their owners. Reprint. 25,000 first printing.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Walt Disney's Cinderella",
        "Authors": "By Disney Book Group, Bergen, Lara",
        "Description": "This beautifully illustrated padded storybook is a perfect way to share the true classic fairytale of  Cinderella with your little princess! Plus with it's sparkly padded cover, this book is a wonderful companion to the Cinderella: Special Edition DVD.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Disney Princess: Time for the Ball - Clock and Storybook",
        "Authors": "By Bergen, Lara",
        "Description": "Every morning the palace clock awakens Cinderella for a day of hard work. But one magical night, she gets to attend the ball-until the clock strikes twelve. Will she have enough time to make her dreams come true? Her fairy tale comes to life in this storybook, complete with an elegant clock-the perfect addition to every little girl's bedroom.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Sammy's Hill",
        "Authors": "By Gore, Kristin",
        "Description": "Working as a health-care analyst for Ohio Senator Robert Gary, idealistic young intern and hypochondriac Samantha Joyce struggles to balance her seventy-hour work week, a constantly shifting set of neuroses, and a new romance as she makes her way through the labyrinthine complexities of life in the nation's capital. A first novel. Reprint.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Miramax",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Stolen Lives: Twenty Years in a Desert Jail (Oprah's Book Club)",
        "Authors": "By Oufkir, Malika, Fitoussi, Michele, and Schwartz, Ros (TRN)",
        "Description": "Malika Oufkir has spent virtually her whole life as a prisoner. Born in 1953, the eldest daughter of General Oufkir, the King of Morocco's closest aide, Malika was adopted by the King at the age of five, and was brought up as the companion to his little daughter. Spending most of her childhood and adolescence in the seclusion of the court harem, Malika was one of the most eligible heiresses in the kingdom, surrounded by luxury and extraordinary privilege.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Miramax",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Fleshmarket Alley",
        "Authors": "By Rankin, Ian",
        "Description": "On a notorious street where propriety and decadence clash, in the basement of a newly renovated bar, the bones of a woman and child are discovered beneath a cement floor. It's an unusually gruesome find, even for Fleshmarket Alley. When Inspector John Rebus is called to investigate, every fact he finds unleashes a host of new questions. Are the bones those of a mother and child? Are they actual human remains or fakes? Were they planted there - and if so, why?It could be nothing more than a ruthless and enterprising pub owner looking to create a local legend that will help lure trade. Or it could be something far worse - something as grisly as the death of a recent immigrant found brutally murdered at a local housing project, or the murder of Donald Cruikshank, a recently paroled rapist whose body is found just as a young woman goes missing. The missing girl is a friend of Inspector rebus's colleague Detective Siobhan Clarke, and Siobhan is shocked to find herself in the same intricate web of murderers as Rebus - all somehow tied to that pile of bones under Fleshmarket Alley.In a race to stop the killings before more bodies turn up - even as the possibility of romantic entanglements distracts and entices them - rebus and Siobhan plumb the darkest corners of their beloved city and confront the lawless, conscienceless men who dwell there.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Easter Bugs : A Springtime Pop-up by David A Carter",
        "Authors": "By Carter, David A. and Carter, David A. (ILT)",
        "Description": "All kinds of bugs celebrate Easter in this book filled from award-winner David Carter!All kinds of bugs are hiding behind colorful Easter eggs, just waiting for you to find them! (And there are lots more fun surprises, too!)",
        "Category": " Juvenile Fiction , Animals , Insects, Spiders, etc.",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Distributed Mind: Achieving High Performance Through the Collective Intelligence of Knowledge Work Teams",
        "Authors": "By Fisher, Kimball and Fisher, Mareen Duncan",
        "Description": "Describes how companies such as Hewlett-Packard, AT&T, Boeing, and the Mayo Clinic assemble teams of specialists with selected expertise and experience to design products and achieve other creative goals. Details the mechanics of designing and managing such a team. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Business & Economics , Management",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Crossing the Chasm: Marketing and Selling High-Tech Products to Mainstream Customers",
        "Authors": "By Moore, Geoffrey A.",
        "Description": "",
        "Category": " Technology & Engineering , Industrial Technology",
        "Publisher": "Harperbusiness",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Burning of Washington: The British Invasion of 1814",
        "Authors": "By Pitch, Anthony S.",
        "Description": "Pitch, a former journalist and the author of numerous books, uses letters, diaries, journals, and newspapers from both sides of the Atlantic to describe this key episode of American history. He also tells how Francis Scott Key was inspired to write an epic poem which became our National Anthem.  The tale is expanded to cover not only events surrounding the burning of Washington but also a campaign that evolved into the bombardment of Fort McHenry and the final clash at New Orleans. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Naval Inst Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Clockwork (A Peter Marklin Mystery)",
        "Authors": "By Steed, Neville",
        "Description": "Peter Marklin is enjoying a quiet Indian Summer in Dorset, when sixteen-year-old wheeler-dealer Tony Thorn gets him involved in a case of murder and robbery at Tony's school",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Massachusetts",
        "Authors": "By Zaroulis, Nancy",
        "Description": "A panoramic saga based on the history of the New England state begins as an orphan boy, Bartholomew Revell, steps off the \"Mayflower,\" and follows his descendants through four hundred years of uprisings, witch-hunts, wars, and other challenges",
        "Category": " Fiction , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Reinventing Yourself With The Duchess Of York: Inspiring Stories and Strategies for Changing Your Weight and Your Life",
        "Authors": "By York, Sarah Mountbatten-Windsor, Duchess of and Weight Watchers International (EDT)",
        "Description": "Are you ready to change your life? Join Sarah, The Duchess of York on an inspiring journey to help you rediscover -- and achieve -- your true goals. Today, The Duchess of York is a confident, single working mother of two girls. But, as most of the world knows, that wasn't always the case. Once targeted by the international press, The Duchess has learned one of life's great lessons: how to uncover what you want out of life and get it. She reveals how the ups and downs of her life -- including her divorce, her financial problems, and the deaths of those close to her -- have made her a stronger, wiser person and a better mother. In the first chapter, \"Transforming My Life,\" The Duchess explores how, when and why she decided to take charge and reinvent her life. In the chapters that follow, readers will discover how they, too, can change their own lives. The book provides a series of self-assessment quizzes and questionnaires, as well as concrete steps you can take to initiate change. Throughout, The Duchess offers her insights, including how each chapter topic relates to her life and what she has learned from others. Reinventing Yourself with The Duchess of York supplies a blueprint for action for anyone seeking to change her life. In an easy-to-follow format, the book provides concrete information and advice on how to use an eight-step plan to achieve your goals -- whether it's losing weight, getting fit, or simply improving your health.Reinventing Yourself also explains how to apply the plan to other areas of life, including changing careers, starting over after divorce, and more. To help inspire you toward your goals, Reinventing Yourself also includes heartwarming and motivating profiles of women who have redefined their lives: Weight Watchers Leaders, real women who have lost weight and transformed their lives in countless ways. In interviews with The Duchess and profiles throughout, these women explore how to make the best of your circumstances, live a happier, healthier life, and change your destiny.",
        "Category": " Self-help , Affirmations",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Live from the Battlefield: From Vietnam to Baghdad--35 Years in the World's War Zones",
        "Authors": "By Arnett, Peter",
        "Description": "Peter Arnett is undeniably the dean of his generation's war correspondents, a breed apart. Daring, wily, willing to put himself at enormous risk for a story. Arnett is a thinking man and a man of action.From his youth in New Zealand in the 1940s, Arnett knew journalism would be his ticket to the world. And it was - to Bangkok; then to Laos, where Arnett swam across the Mekong River to file his dispatches from Thailand; and then on to Indonesia, where he traveled with Sukarno until he was expelled after only thirteen months for his reporting on the developing war.In 1962, Arnett was sent to Vietnam along with David Halberstam, Neil Sheehan, Mal Browne, Stanley Karnow and the rest of a new young group of foreign correspondents that would later include Dan Rather, Ted Koppel and Peter Jennings. When American ground forces were committed, Arnett went right in with them. His controversial coverage for the Associated Press incurred the wrath of President Johnson but won him a Pulitzer Prize. After the fall of Saigon, when many of his peers had gone, Arnett stayed behind to get the whole story.With the dedication, passion and intelligence that one finds in great foreign correspondents, Arnett has pursued the whole story ever since. After covering wars in Cyprus and Lebanon, he joined CNN in 1981. News was going live, twenty-four hours a day, and Arnett was going with it - from San Salvador to Moscow to Iraq. And then to Afghanistan, after the defeat of the Soviet-sponsored government, a place of anarchic conflict, where Islamic radicals plot to export terrorism to the mainland United States.Satellite communications have forever changed the way we see war. Arnett's on-the-ground reporting of the Gulf War from Baghdad had an immediacy and suspense we had not experienced before. No one who watched will ever forget.Now, in the same vivid eye-of-the-Desert-Storm way in which he reported the drama and danger of the Gulf War, Peter Arnett shares the adventures, the gambles and the glory of his lifemore than thirty-five years inside the world's war zones.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Hearse of a Different Color",
        "Authors": "By Cockey, Tim",
        "Description": "Hitchcock Sewell, Baltimore's hippest undertaker and civilian sleuth, is back in a second sly, original mystery.One of the most charming and offbeat amateur detectives to come around in years, Hitchcock Sewell does for the undertaking profession what Marilyn Monroe did for the ukulele--gives it a touch of class. In this rollicking follow-up to Tim Cockey's \"witty, punchy, snappy, well-written, and dang funny debut\" (Harlan Coben, author of The Final Detail), a surprise blizzard dumps more than snow on the steps of Sewell & Sons funeral home--it leaves behind the corpse of a murdered waitress as well. Hitch's television meteorologist girlfriend sees the crime as an opportunity to move into hard news. Her unctuous mentor wants to beat Hitch to the punch. Hitch's snooping takes him from low-life strip joints to high-tone mansions, proving yet again that undertakers and their clue-happy cohorts can be a pretty lively bunch.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Let Me Tell You a Story",
        "Authors": "By Feinstein, John",
        "Description": "The life story of the famed professional basketball coach documents his seventeen-year tenure with the Boston Celtics, during which the team achieved nine NBA championships; his relationships with such players as Larry Bird, Wilt Chamberlain, and Michael Jordan; and his post-retirement consultation work with top coaches and players. Reprint. 125,000 first printing.",
        "Category": " Sports & Recreation , Basketball",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "How I Photograph Wildlife and Nature",
        "Authors": "By Rue, Leonard Lee",
        "Description": "The author describes the equipment and techniques he uses, explains how to photograph scenery, wildflowers, insects, reptiles, birds, and animals, and includes advice on transportation, underwater photography, and selling photos",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Peter and the Starcatchers",
        "Authors": "By Barry, Dave, Pearson, Ridley, and Call, Greg (ILT)",
        "Description": "Don't even think of starting this book unless you're sitting in a comfortable chair and have lots of time. A fast-paced, impossible-to-put-down adventure awaits as the young orphan Peter and his mates are dispatched to an island ruled by the evil King Zarboff. They set sail aboard the Never Land, a ship carrying a precious and mysterious trunk in its cargo hold-and the journey quickly becomes fraught with excitement and danger. Discover richly developed characters in the sweet but sophisticated Molly, the scary but familiar Black Stache, and the fearless Peter. Treacherous battles with pirates, foreboding thunderstorms at sea, and evocative writing immerse the reader in a story that slowly and finally reveals the secrets and mysteries of the beloved Peter Pan.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Disney Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "To Lay a Hearth",
        "Authors": "By Myra Scovel",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row, Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1968"
        }
    },
    {
        "Title": "The Lost Chronicles: The Official Companion Book with Bonus DVD Behind the Scenes of LOST",
        "Authors": "By Vaz, Mark Cotta",
        "Description": "The Lost Chronicles is the first official tie-in book to the popular television series. The show takes place on a remote South Pacific island, where a plane crash has left 48 survivors stranded. Forced to scavenge what they can from the plane for their survival, some panic, some pin their hopes on rescue, a few find inner strength they never knew they had. The band of friends, family, enemies, and strangers must work together against the cruel weather and harsh terrain if they want to stay alive. But the island holds many secrets, including the intense howls of the mysterious creatures stalking the jungle, which fill them all with fear. Fortunately, thanks to the calm leadership of quick-thinking Jack and level-headed Kate, they have hope. But even heroes have secrets, as the survivors will come to learn.",
        "Category": " Performing Arts , Television , Direction & Production",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Crispin: The Cross of Lead (2003 John Newbery Medal Winner)",
        "Authors": "By Avi",
        "Description": "H \"Avi's plot is engineered for maximum thrills, with twists, turns, and treachery aplenty. . . . A page-turner to delight Avi's fans, it will leave readers hoping for a sequel.\"-Publishers Weekly (starred review) H \" . . . [T]he book is a page-turner from beginning to end . . . [A] meticulously crafted story, full of adventure, mystery, and action.\"-School Library Journal (starred review)\"Historical fiction at its finest.\"-VOYA",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Waite Group's Visual Basic 6 Superbible",
        "Authors": "By Mauer, Lowell, Conley, John D., III, Jung, David (EDT), Boutquin, Pierre, Eidahl, Loren, Purdum, Jack, and Jung, David",
        "Description": "This book is the perfect resource for programmers who want comprehensive, updated coverage of the most common Visual Basic concepts and language elements. Concise descriptions detail everything you need to know about each Visual Basic command, component, and control. For quick reference, you can easily look up any function, statement, method, property, or event in the alphabetical jump table in the front of the book. Every example, project, and screenshot in the book has been created to reflect a professional coding style that takes advantage of all the new features of Visual Basic 6, making it an ideal source of knowledge for both beginners and experienced programmers.",
        "Category": " Computers , Programming Languages , Visual BASIC",
        "Publisher": "Sams",
        "Price Starting With ($)": "9.18",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Legendary Comedies",
        "Authors": "By Guttmacher, Peter",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Pub Overstock Unlimited Inc",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Collecting Teddy Bears & Dolls: The Facts at Your Fingertips",
        "Authors": "By Beckett, Alison",
        "Description": "Antique teddy bears and dolls often hit the headlines when they sell for record-breaking prices, yet they can be surprisingly affordable. This book contains all the essential information a budding collector needs to buy antique dolls and teddy bears and is packed with advice to help authenticate, date and value a wide range of models, along with tips on restoring, caring for, displaying and insuring your collection.This invaluable guide includes chapters on all the main types of doll, from 17th-century wooden dolls to special edition vinyl Sindy and Barbie dolls from the 1980s, comprehensive coverage of teddy bears, tracing their development from the first teddy bears made by Steiff in Germany in the 1900s to the wide range of highly collectible bears produced today, plus an extensive section on soft toys; over 330 full-color photographs and illustrations of dolls and teddy bears that can be found readily in antiques shops, auction houses and even fairs; and a price guide for every item shown.",
        "Category": " Antiques & Collectibles , Dolls",
        "Publisher": "Mitchell Beazley",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Third Translation",
        "Authors": "By Bondurant, Matt",
        "Description": "An ancient mystery, a hidden language, and the secrets of a bizarre Egyptian sect collide in modern-day London in this ingenious novel of seduction, conspiracy, and betrayal alter Rothschild is an American Egyptologist living in London and charged by the British Museum with the task of unlocking the ancient riddle of the Stela of Paser, one of the last remaining real-life hieroglyphic mysteries in existence today. The secrets of the stela-a centuries-old funerary stone-have evaded scholars for thousands of years due to the stela's cryptic reference to a third translation:",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Price and Quantity Trends in the Foreign Trade of the United States",
        "Authors": "By Lipsey, Robert.",
        "Description": "",
        "Category": "",
        "Publisher": "Princeton University Press, Princeton, 1963.",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Extreme Makeover: The Official Companion Book",
        "Authors": "By Lutes, Rob and Hynes, Jim",
        "Description": "Extreme Makeover: Home Edition single-handedly changed the face of reality TV with its heartfelt, philanthropic mission: to provide struggling families with safe, beautiful homes. In each episode, host Ty Pennington and the talented design team work around the clock for seven days to transform one needy family+s home into a place of comfort and love. The first season garnered an Emmy nomination for -Outstanding Reality Program+ and since then the show has only gained momentum, touching the hearts of millions every Sunday night. The official tie-in provides behind-the-scenes details on the challenging home makeovers, from demolition to last-minute decoration, profiles of the cast and crew, and profiles of the featured families-including the special circumstances that have inspired the Extreme Makeover: Home Edition team to turn these families+ houses into state-of-the-art homes-come-true. Beautiful full-color photos of the before and after transformations will run throughout.",
        "Category": " Performing Arts , Television , Direction & Production",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Recipes from an Italian Farmhouse",
        "Authors": "By Harris, Valentina",
        "Description": "Gathers traditional rural Italian recipes for soups, pasta, rice, meat, poultry, game, fish, seafood, vegetables, salads, eggs, cheese, and desserts",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Country: Crafts/Cooking/Decorating/Flowers",
        "Authors": "By Hermes House",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "9.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "A Patriot's Handbook: Songs, Poems, Stories, and Speeches Celebrating the Land We Love",
        "Authors": "By Kennedy, Caroline (INT) and Kennedy, Caroline",
        "Description": "Now available in paperback, the New York Times bestseller. When John F. Kennedy called America \"the land we love\" more than 42 years ago, he was reminding us of the lofty ideals on which our country was founded. But what are those ideals, and how have Americans defined them Is America the land of George Washington and Franklin Delano Roosevelt, who rallied the country's spirits for unity in wartime, or is it a land of dissent, a land in which Frederick Douglass, Elizabeth Cady Stanton, and Martin Luther King, Jr. remind us of our duty to protect our most fundamental freedoms? Are we defined by the speeches of Thomas Jefferson and Ronald Reagan or by the humor of H.L. Mencken and Mark Twain? Caroline Kennedy's answer in A Patriot's Handbook is that we are all of those things and more. The poems, songs, speeches, letters, and historical documents that Caroline Kennedy has chosen for this remarkable collection remind us of the foundations on which America was built. But they also ask us to examine what it truly means to be a \"patriot,\" even if our assumptions are challenged along the way, because it is only by doing so that America can \"truly be our own.\" Voices as diverse as the nation itself:  Thomas Jefferson Cole Porter Chief Red Jacket Amy Tan Betty Friedan Albert Einstein George W. Bush Loretta Lynn John F. Kennedy Martin Luther King, Jr. Bob Dylan Cesar Chavez Toni Morrison Groucho Marx and many more",
        "Category": " History , United States , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Front Row at the White House: My Life and Times",
        "Authors": "By Thomas, Helen",
        "Description": "\"I'm still here, still arriving at the White House in the wee hours of the morning, reading the papers and checking the wire, still waiting for the morning briefing, still sitting down to write the first story of the day and still waiting to ask the tough questions.\"  From the woman who has reported on every president from Kennedy to Clinton for United Press International: a unique glimpse into the White House -- and a telling record of the ever-changing relationship between the presidency and the press.  From her earliest years, Helen Thomas wanted to be a reporter. Raised in Depression-era Detroit, she worked her way to Washington after college and, unlike other women reporters who gave up their jobs to returning veterans, parlayed her copy-aide job at the Washington Daily News into a twelve-year stint as a radio news writer for UPI, covering such beats as the Department of Justice and other federal agencies.  Assigned to the White House press corps in 1961, Thomas was the first woman to close a press conference with \"Thank you, Mr. President,\" and has covered every administration since Kennedy's. Along the way, she was among the pioneers who broke down barriers against women in the national media, becoming the first female president of the White House Correspondents Association, the first female officer of the National Press Club and the first woman member, later president, of the Gridiron Club.  In this revealing memoir, which includes hundreds of anecdotes, insights, observations, and personal details, Thomas looks back at a career spent with presidents at home and abroad, on the ground and in the air. She evaluates the enormous changes that Watergate brought, including diminished press access to the Oval Office, and how they have affected every president since Nixon. Providing a unique view of the past four decades of presidential history, Front Row at the White House offers a seasoned study of the relationship between the chief executive officer and the press -- a relationship that is sometimes uneasy, sometimes playful, yet always integral to democracy.  \"Soon enough there will be another president, another first lady, another press secretary and a whole new administration to discover. I'm looking forward to it -- although I'm sure whoever ends up in the Oval Office in a new century may not be so thrilled about the prospect.\"",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Scribner",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Knight and the Dragon (Paperstar Book)",
        "Authors": "By dePaola, Tomie",
        "Description": "What happens when a sheepish knight and a not-so-fierce dragon fight for the very first time? Well, it's no ordinary battle since the knight has to go to the castle library to learn about dragon-fighting and the dragon must dig through his ancestor's things to find out how to fight a knight! \"Spontaneity of line and feeling are backed by zesty colors and a jovial, tongue-in-cheek tone to which children can relate—a top springtime choice.\" —Booklist \"There's a swirl of good-humored life to the book.\" —The New York Times Book Review",
        "Category": " Juvenile Fiction , Historical , Medieval",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Artemis Fowl (Artemis Fowl, Book 1)",
        "Authors": "By Colfer, Eoin",
        "Description": "Twelve-year-old criminal mastermind Artemis Fowl, heir to the Fowl family empire and centuries-old legacy of scams and underworld machinations, decides to uncover the secret treasure of the Fairy People by stealing one of their magical books, decoding it with his computer, kidnapping leprechaun Holly Short, and taking on the entire forces of the fairy kingdom. Reprint. 200,000 first printing.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Disney Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Don't Know Much About® the Civil War: Everything You Need to Know About America's Greatest Conflict but Never Learned (Don't Know Much About Series)",
        "Authors": "By Davis, Kenneth C.",
        "Description": "“Highly informative and entertaining…propels the reader light years beyond dull textbooks and Gone with the Wind.”—San Francisco ChronicleIt has been 150 years since the opening salvo of America’s War Between the States. New York Times bestselling author Ken Davis tells us everything we never knew about our nation’s bloodiest conflict in Don’t Know Much About ® the Civil War—another fascinating and fun installment in his acclaimed series.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Tournament of Roses: A one hundred year celebration",
        "Authors": "By Hamlin, Rick",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Companies",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "George Washington and the Founding of a Nation (PB)",
        "Authors": "By Marrin, Albert",
        "Description": "Esteemed historian Albert Marrin offers an absorbing account of our first president's life and times in this biography, which was named a Booklist Editors' Choice and a School Library Journal Best Book.",
        "Category": " Young Adult Nonfiction , History , United States , General",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Choose to Reuse: An Encyclopedia of Services, Businesses, Tools & Charitable Programs That Foster Reuse",
        "Authors": "By Goldbeck, Nikki and Goldbeck, David",
        "Description": "Discusses ways to reduce, reuse, and recycle, lists recycling companies, and shares examples for everything from air filters to zippers",
        "Category": " Science , Environmental Science",
        "Publisher": "Ceres Pr",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Favorite Scary Stories of American Children",
        "Authors": "By Young, Judy Dockrey and Young, Richard",
        "Description": "A collection, selected by children as their favorites, of twenty-three spooky tales from a variety of ethnic traditions",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "August House Pub Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Horse People: Scenes from the Riding Life",
        "Authors": "By Korda, Michael and Korda, Michael (ILT)",
        "Description": "Bestselling author Michael Korda's Horse People is the story -- sometimes hilariously funny, sometimes sad and moving, always shrewdly observed -- of a lifetime love affair with horses, and of the bonds that have linked humans with horses for more than ten thousand years. It is filled with intimate portraits of the kind of people, rich or poor, Eastern or Western, famous or humble, whose lives continue to revolve around the horse.Korda is a terrific storyteller, and his book is intensely personal and seductive, a joy for everyone who loves horses. Even those who have never ridden will be happy to saddle up and follow him through the world of horses, horse people, and the riding life.",
        "Category": " Pets , Horses",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    }
]