[
    {
        "Title": "The Roman Enigma",
        "Authors": "By Murphy, Walter F.",
        "Description": "Near the end of World War II, an American agent is sent to Rome on a bogus mission to keep the Germans from realizing that the British had broken their secret Enigma code",
        "Category": " Fiction , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "The Literary Ace Strikes Again! (Peanuts at Work & Play)",
        "Authors": "By Schulz, Charles M.",
        "Description": "While atempting to write the great American novel, Snoopy rewrites the first sentence over, and over, and over again",
        "Category": " Humor , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Rising",
        "Authors": "By Smith, Alison",
        "Description": "Judd Springfield, Chief of Police of Coolidge Corners, Vermont investigates a series of drownings which may be murders and their possible connection to a new dam being built",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Writ of Execution",
        "Authors": "By O'Shaughnessy, Perri",
        "Description": "In the mountain resort town of South Lake Tahoe, Nina Reilly is known for taking on the underdog cases, the kind that can make - or break - her one-woman law practice. Her latest case begins in the middle of a summer night when she is called away from a very personal visit to her investigator Paul van Wagoner's hotel room to meet with a desperate new client at her office who gives her name as Jessie Potter. The frightened young woman has just hit a huge slot machine jackpot, and the men in suits are waiting to hand her the check just as soon as she tells them her real identity.With time running out, Nina helps her client devise a brilliant plan to collect the money while keeping her true identity a secret. Unfortunately, powerful interests have lined up to grab the money. The gaming commission thinks the jackpot was rigged. The man sitting on the seat just before the jackpot hit says it's his, and he doesn't mind going outside the law to get it. And the wealthy man stalking Nina's client has retained an unscrupulous local lawyer, Jeff Riesner, to attack the jackpot winnings using a legal maneuver called a Writ of Execution. The odds of Jessie ever collecting are starting to look hopeless.For Nina, what began as a fight for an underdog in federal court soon escalates into something very different and far more dangerous. Jessie has a secret, and she needs that money for a very good reason. By the time Nina discovers that Jessie is withholding vital information, it might be too late for her client and even for Nina herself. Because somewhere in the darkening Tahoe night, people are dying. A cold-blooded, obsessed killer will stop at nothing - including execution-style murder - to get that jackpot in a case where the Writ of Execution has become more than a legal maneuver; it's death warrant.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Mexican Pet: More \"New\" Urban Legends and Some Old Favorites",
        "Authors": "By Brunvand, Jan Harold",
        "Description": "\"[The book] captures the spirit of convivial storytelling and even encourages the activity. . . . Many readers . . . will be gratified to know that Brunvand intends to continue this series of relaxed, unofficial excursions into popular legends. Admirers of curiosa and the psychology of crowds cannot afford to miss them.\" —Kirkus Reviews",
        "Category": " Fiction , Historical",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Curses! Broiled Again!",
        "Authors": "By Brunvand, Jan Harold",
        "Description": "Did your cousin's wife's dentist's daughter go to the tanning parlor once too often and had her insides cooked? Has your husband's brother's nephew teacher try to make a dead rabbit look alive? If so, you've heard—or you yourself may have told—two of the seventy-plus legends in this collection.Urban legends are \"those bizarre but believable stories about batter-fried rats, spiders in hairdos, Cabbage Patch dolls that get funerals, and the like that pass by word of mouth as being the gospel truth.\" But of course, though often told as having happened to a FOAF (friend of a friend), they aren't true. Included in this collection are legends about sex, horror, cars, business, and academia. Among them are \"The Bible Student's Exam,\" \"The Pregnant Shoplifter,\" \"The Ice Cream Cone Caper,\" \"Don't Mess with Texas,\" and \"Mrs. Fields' Cookie Recipe.\"",
        "Category": " Social Science , Customs & Traditions",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Remember",
        "Authors": "By Bradford, Barbara Taylor",
        "Description": "Certain that the face she has seen on a news broadcast from Rome is that of her dead lover, English aristocrat Charles Devereaux, television war correspondent Nicky Wells embarks on a quest to discover the truth",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Womanly art of Breastfeeding",
        "Authors": "By La Leche League International",
        "Description": "In the Womanly Art of Breastfeeding, you will discover how to prepare for breastfeeding during pregnancy, the effects on newborns of medications used during labor and delivery, how to maintain an ample milk supply, how to pump and store human milk, how to recognize and overcome common breastfeeding problems, breastfeeding a baby with special needs, how nursing mothers can exercise and lose weight safely, breastfeeding tips for the working mother, and current research on the benefits of breastfeeding, including improving your baby's IQ.",
        "Category": "",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Great Ideas of Operations Research",
        "Authors": "By Singh, Jagjit",
        "Description": "",
        "Category": " Business & Economics , Operations Research",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1968"
        }
    },
    {
        "Title": "English Romantic Poetry: An Anthology (Dover Thrift Editions)",
        "Authors": "By Appelbaum, Stanley (EDT)",
        "Description": "Encompassing a broad range of subjects, styles, and moods, English poetry of the late eighteenth and early nineteenth centuries is generally classified under the term \"Romantic,\" suggesting an emphasis on imagination and individual experience, as well as a preoccupation with such theme as nature, death, and the supernatural.This volume contains a rich selection of poems by England's six greatest poets: William Blake (24 poems, including \"The Tyger\" and \"Auguries of Innocence\"), William Wordsworth (27 poems, including \"Ode: Intimations of Immortality\" and \"I wandered lonely as a cloud\"), Samuel Taylor Coleridge (10 poems, including \"The Rime of the Ancient Mariner\" and \"Kubla Khan\"), Lord Byron (16 poems, including \"The Prisoner of Chillon\" and selections from Don Juan and Childe Harold's Pilgrimage), Percy Bysshe Shelley (24 poems, including \"Ode to the West Wind\" and \"Adonis\"), John Keats (22 poems, including all the great odes, \"Isabella,\" and \"The Eve of St. Agnes\").For this edition, Stanley Appelbaum has provided a concise Introduction to the Romantic period and brief commentaries on the poets represented. The result is a carefully selected anthology that will be welcomed by lovers of poetry, students, and teachers alike.",
        "Category": " Poetry , Subjects & Themes , Love & Erotica",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Barcelona the City of Gaudi",
        "Authors": "By Llatzer Moix",
        "Description": "",
        "Category": "",
        "Publisher": "Triangle Postals; Fundacio Gala-Salvador Dali",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "U/S: A Statistical Portrait of the American People",
        "Authors": "By Hacker, Andrew",
        "Description": "Provides statistical information on births, deaths, health, families, marriage, employment, income, government, crime, education, and housing in America",
        "Category": " History , General",
        "Publisher": "Penguin (Non-Classics)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "America and the Arab States: An Uneasy Encounter (Wiley Medical Publication)",
        "Authors": "By Stookey, Robert W.",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Southern Living Garden Book (Southern Living (Paperback Oxmoor))",
        "Authors": "By Bender, Steve (EDT)",
        "Description": "Presents a guide to selecting trees, berries, perennials, and vines for the garden, and offers more than five thousand plant listings with information on varieties, cultivation, and maintenance",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "The Smart Approach to Home Decorating",
        "Authors": "By Creative Homeowner Press",
        "Description": "",
        "Category": " House & Home , Decorating",
        "Publisher": "Creative Homeowner Pr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Complete Monty Python's Flying Circus; All the Words Volume One",
        "Authors": "By Jones, Terry, Chapman, Graham, Idle, Eric, Monty Python (COR), and Gillian, Terry",
        "Description": "***ALMOST CERTAINLY NOMINATED FOR SOMETHING SOMEWHERE***The complete scripts from the four Monty Python series, first shown on BBC television between 1969 and 1974, have been collected in two companion volumes.Characters' names, often not spoken, are given as in the original scripts, along with the names of the actual performer added on their first appearance in each sketch.This first volume contains twenty-three classic episodes, featuring some of the most entertaining writing to have gone into television anywhere. The minister of silly walks, the dead parrot, banter in a cheese shop - here is every silly, satirical skit, every snide insult, every saucy aside.",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Barefoot on Coral Calcium: \"An Elixir of Life\" Health Secrets of the Coral of Okinawa",
        "Authors": "By Robert R. Barefoot",
        "Description": "",
        "Category": "",
        "Publisher": "Wellness Publishing Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Pilates The Authentic Way Book & DVD kit",
        "Authors": "By Dina Matty and Keft Burdell~Strength and Control T",
        "Description": "",
        "Category": "",
        "Publisher": "Hinkler Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Mysterious Cause of Illness and How to Overcome Every Disease from Constipation to Cancer",
        "Authors": "By Jonn Matsen",
        "Description": "",
        "Category": "",
        "Publisher": "Fischer Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Call of the Wild",
        "Authors": "By London, Jack",
        "Description": "",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The House of the Seven Gables (Bantam Classics)",
        "Authors": "By Hawthorne, Nathaniel",
        "Description": "In a sleepy little New England village stands a dark, weather-beaten, many-gabled house. This brooding mansion is haunted by a centuries-old curse that casts the shadow of ancestral sin upon the last four members of the distinctive Pyncheon family. Mysterious deaths threaten the living. Musty documents nestle behind hidden panels carrying the secret of the family’s salvation—or its downfall.Hawthorne called The House of the Seven Gables “a Romance,” and freely bestowed upon it many fascinating gothic touches. A brilliant intertwining of the popular, the symbolic, and the historical, the novel is a powerful exploration of personal and national guilt, a work that Henry James declared “the closest approach we are likely to have to the Great American Novel.”",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Santa and Me",
        "Authors": "By Slangerup, Erik Jon and Janes, Joshua (ILT)",
        "Description": "Every year, Santa makes his important Christmas Eve deliveries without a hitch. What a surprise to discover that it’s not always as easy as it looks! What is life really like at the North Pole? No one knows the true secrets behind Santa’s success better than Mrs. Claus! Told through whimsical details in a facsimile scrapbook style, this humorous behind-the-scenes look at the history and antics of the North Pole reveals Santa’s real nature from one who knows him best—Mrs. Claus! Author:  Erik Slangerup  Erik Jon Slangerup is the author of several children’s books, including Dirt Boy, and Monsterlicious. His first book, Dirt Boy (March 2000, Albert Whitman & Co.), made the Children's Choices 2001 list by the Children's Book Council and the International Reading Association. Various reviews of Monsterlicious encourage “readers looking for an uproarious reading experience” to “give the Bangdoodle Restaurant and its young chef a 4-star rating.”Erik is an accomplished storyteller and lecturer, and has become a favorite guest speaker at school assemblies, writing workshops, and educational conferences nationwide. He has also appeared on television and radio, and was featured in Creativity magazine in May 2000.Illustrator:  Josh Janes   Joshua Janes has been illustrating children’s books for eight years. During the holidays, he commutes between the North Pole and Oak Harbor, Ohio, where he resides with his wife, Angie, and their little elf, Gabrielle.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Gingham Dog Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Antichrist: Two Thousand Years of the Human Fascination With Evil",
        "Authors": "By McGinn, Bernard",
        "Description": "Examines the the origins of the Antichrist concept from its Judeo-Christian roots, details man's obsession with evil, and offers an historical view of the concept's significance as the turn of the millennium approaches",
        "Category": " Religion , Eschatology",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "What I like about toads (Let's-read-and-find-out science book)",
        "Authors": "By Hawes, Judy",
        "Description": "",
        "Category": "",
        "Publisher": "Crowell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Visionary Leadership (J-B US non-Franchise Leadership)",
        "Authors": "By Nanus, Burt",
        "Description": "Warren Bennis writes,the bookfills me with equal amounts of admiration and envy. For the first time ever, Nanus defines for us what 'the vision thing' is all about.Successful leaders know that nothing drives an organization like an attractive, worthwhile, achievable vision for the future. Leadership expert and best-selling author Burt Nanus finally shows why vision is the key to leadership and demonstrates how any leader can use a logical, step-by-step process to create and implement a powerful new sense of direction in his or her organization.Designed for individual leaders to develop their own vision statement, this book guides readers through the mechanics of forming a vision, guidelines for developing the scope of the vision, and processes for implementing that vision.Visionary Leadership is an indispensable guide for leaders at all levels, from top executives to heads of divisions and departments, from large corporations to small businesses, from manufacturing and service organizations to government and nonprofit institutions.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The R.A.T. (Real World Aptitude Test): Preparing Yourself for Leaving Home (Capital Ideas)",
        "Authors": "By Moyer, Homer E., Jr.",
        "Description": "Do you know how many teaspoons of sugar the average 12 ounce can of soda contains? Can you change a flat tire? Can you identify the ten largest cities in the world? The Real-World Aptitude Test (R.A.T.) answers these questions and more. The R.A.T. is divided into two parts, the first containing questions in thirty different subject areas, and the second providing answers and explanations to these life-defining questions. Subject areas include cooking, managing money, etiquette, geography, sports, and many more. The R.A.T. provides answers to some of life’s most common stumbling blocks, as well as facts on generalized knowledge in areas such as geography and politics.",
        "Category": " Self-help , General",
        "Publisher": "Capital Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Complete Book Of Hold 'Em Poker: A Comprehensive Guide to Playing and Winning",
        "Authors": "By Carson, Gary",
        "Description": "",
        "Category": " Games & Activities , Gambling , General",
        "Publisher": "Lyle Stuart",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Rosslyn - Guardian Of The Secrets Of The Holy Grail",
        "Authors": "By Wallace-murphy, Tim and Hopkins, Marilyn",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Secret Hour: A Novel",
        "Authors": "By Rice, Luanne",
        "Description": "One of America’s most mesmerizing storytellers, Luanne Rice enthralls readers with her moving tales of ordinary people in crisis--and how they are transformed by the enduring power of love and family.  Now the author of Safe Harbor, True Blue, and other New York Times bestsellers presents the gripping story of a man fighting for his family, a woman searching for her sister--and the promise of a new life where both least expected it...The Secret HourBeneath his careful and controlled demeanor, attorney John O’Rourke is a man whose life is in turmoil. Since the death of his wife, he has been juggling the rigors of a controversial capital murder case and the demands of raising two children. Eleven-year-old Maggie’s crooked bangs and rumpled clothes eloquently reproach John’s earnest but haphazard attempts at mothering. Teddy, John’s stalwart fourteen-year-old, has quietly assumed responsibilities far too weighty for his young shoulders, as he longs for the way things used to be and tries to ignore the hostility that has swirled around his family since his father took on the defense of a killer whose crimes have rocked Connecticut.A brick through the window one autumn morning signals a dangerous new level of hatred. But a quieter event also takes place that day.  A woman arrives on the O’Rourke doorstep to find a household on the brink of chaos but brimming with love--and, she hopes, answers. Kate Harris is searching for the key to her own mystery. Six months ago her younger sister fled far from their beloved home following a devastating confrontation. After mailing a single postcard from the New England shore, Willa Harris vanished. With only a postmark to go on, Kate takes a leave of absence from her job as a marine biologist to come to the seaside Willa adored--and discovers the one man who may be able to help her.Compelling and evocative, at once suspenseful, heartbreaking, and triumphant, The Secret Hour is an unforgettable novel that explores the power of sisterly love, the gift of second chances--and the way magic can sometimes be the most real thing in the whole world.From the Hardcover edition.",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Creatures of the Kingdom: Stories About Animals and Nature",
        "Authors": "By Michener, James A.",
        "Description": "From James A. Michener, America's favorite story-teller, comes this treasury of sixteen tales about the natural world.Millions of readers have been captivated by the stories of the woolly mammoth in Alaska, the wily gander in Chesapeake, the awesome birth of the Hawaiian Islands in Hawaii, and the evolution of the Rocky Mountains in Centennial. These and other excerpts from Michener's superb novels are here collected in a single volume, along with one never-before-published story. Together they offer a mesmerizing journey through the natural world, across time, and around the globe.Mr. Michener re-creates the planet Earth as it existed millions of years ago when dinosaurs flourished; he vividly describes the vast forces that created the geological wonders we know today; he explains how, in the millennia-old struggle for survival, some species endured and evolved while others disappeared. Several stories illuminate man's relationship with animals, such as the love between master and dog in Chesapeake and the antagonism between homeowner and armadillo in Texas.Illustrated with seventeen drawings, each occupying two full pages, Creatures of the Kingdom is sure to enchant readers of all ages.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Miracle of Language",
        "Authors": "By Lederer, Richard",
        "Description": "Master verbalist Richard Lederer, America's \"Wizard of Idiom\" (Denver Post), presents a love letter to the most glorious of human achievements...Welcome to Richard Lederer's beguiling celebration of language -- of our ability to utter, write, and receive words. No purists need stop here. Mr. Lederer is no linguistic sheriff organizing posses to hunt down and string up language offenders. Instead, join him \"In Praise of English,\" and discover why the tongue described in Shakespeare's day as \"of small reatch\" has become the most widely spoken language in history:English never rejects a word because of race, creed, or national origin. Did you know that jukeboxcomes from Gullah and canoe from Haitian Creole?Many of our greatest writers have invented words and bequeathed new expressions to our eveyday conversations. Can you imagine making up almost ten percent of our written vocabulary? Scholars now know that William Shakespeare did just that!He also points out the pitfalls and pratfalls of English. If a man mans a station, what does a woman do? In the \"The Department of Redundancy Department,\" \"Is English Prejudiced?\" and other essays, Richard Lederer urges us not to abandon that which makes us human: the capacity to distinguish, discriminate, compare, and evaluate.",
        "Category": " Reference , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "100 Questions & Answers About Prostate Cancer (TAP Pharmaceuticals)",
        "Authors": "By Ellsworth, Pamela, M.D.",
        "Description": "",
        "Category": " Medical , Oncology",
        "Publisher": "JONES & BARTLETT @ PUBLISHERS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Sex Begins in the Kitchen: Because Love Is an All-Day Affair",
        "Authors": "By Leman, Kevin",
        "Description": "Describes how birth order affects relationships, discusses the keys to intimacy in marriage, and suggests ways to improve relations with one's spouse",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Mary Had a Little Lamb",
        "Authors": "By Sarah Josepha Hale",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore/Waldman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Cuddly Kittens",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Eat This!: 365 Reasons to Stop Dieting",
        "Authors": "By McHugh, Mary",
        "Description": "Eat This! is the anti-diet guide, the perfect pick-me-up for anyone with the diet blues. It's packed with 365 humorous musings on why diets are no fun, don't work, and will never compare with the pleasures of a chocolate eclair. Author Mary McHugh brings a much-needed dose of common sense to the world of dieting, extolling both the pleasures of homemade macaroni and cheese, as well as the satisfaction of burning 353 calories learning to salsa dance. Eat This! celebrates the woman who's sassy, sexy, and who'd be a lot happier if she stopped worrying about her weight. Shaped like a miniature refrigerator, Eat This! is the perfect gift for a friend or sister who's fed up with diets.",
        "Category": " Art , Popular Culture",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Your Pony, Your Horse",
        "Authors": "By Hill, Cherry",
        "Description": "Owning a horse is a lot of fun, but also requires a lot of responsibility. Designed for children ages 9 and up, this encouraging and informative guide introduces kids to both the satisfying rewards and the hard work that caring for a horse entails. With easy-to-understand language and clear illustrations, Cherry Hill covers every aspect of selecting, housing, feeding, and showing horses. Emphasizing an understanding of horse behavior, Hill provides kids with all the information they need to safely and successfully keep their own horse.",
        "Category": " Juvenile Nonfiction , Animals , Pets",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Fair Weather",
        "Authors": "By Peck, Richard",
        "Description": "Thirteen-year-old Rosie Beckett has never strayed further from her family's farm than a horse can pull a cart. Then a letter from her Aunt Euterpe arrives, and everything changes. It's 1893, the year of the World's Columbian Exposition-the \"wonder of the age\"-a.k.a. the Chicago World's Fair. Aunt Euterpe is inviting the Becketts to come for a visit and go to the fair! Award-winning author Richard Peck's fresh, realistic, and fun-filled writing truly brings the World's Fair-and Rosie and her family-to life.",
        "Category": " Young Adult Fiction , Historical , United States , 19th Century",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Happy Easter, Biscuit!: A Lift-the-Flap Book",
        "Authors": "By Capucilli, Alyssa Satin and Schories, Pat (ILT)",
        "Description": "Hippity, hoppity...Woof! Join Biscuit on an Easter adventure, with flaps for your little egg hunters to lift! Biscuit's first East egg hunt is going to be egg-stra special. Where are all the eggs hidden?Lift the flaps to find out!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2020"
        }
    },
    {
        "Title": "Roots and Branches: Grounding Religion in Our Human Experience",
        "Authors": "By Overberg, Kenneth R.",
        "Description": "",
        "Category": "",
        "Publisher": "Franciscan Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The Ultimate Ornament Book",
        "Authors": "By Childs, Anne Van Wagner (EDT)",
        "Description": "",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Monterey Peninsula",
        "Authors": "By Pistolesi, Andrea",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Bonechi",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Pdr Family Guide to Nutrition and Health: With Fat, Cholesterol, and Calorie Counter Guide (The Pdr Family Guide Series)",
        "Authors": "By Medical Economics",
        "Description": "Covers such topics as weight management, special diets and dietary concerns, food and the heart, food and cancer, nutritional needs for different stages of life, and keeping food enjoyable",
        "Category": " Health & Fitness , General",
        "Publisher": "Physicians Desk Reference Inc",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Knitting Goddess: Finding the Heart and Soul of Knitting Through Instruction, Projects, and Stories",
        "Authors": "By Bergman, Deborah and Rideout, Jenny (ILT)",
        "Description": "An unusual knitting handbook combines the stories of ancient goddesses whose lives offer inspiration and guidelines for various knitting techniques or patterns with detailed instruction in the fundamentals of the craft and a variety of projects for knitters of all skill levels. 25,000 first printing.",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "You're Grounded Till You're Thirty!: What Works - And What Doesn't - In Parenting Today's Teens (Good Housekeeping Parent Guide)",
        "Authors": "By Craig, Judith E.",
        "Description": "A down-to-earth guide for parents of teenagers is presented in a problem/solution format that addresses such issues as messy rooms, skipping school, dating, sex, eating disorders, depression, and substance abuse. Original.",
        "Category": " Family & Relationships , General",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "The Best of Bon Appetit: A Collection of Favorite Recipes from America's Leading Food Magazine: 001",
        "Authors": "By Bon Appetit Magazine Editorial Staf",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Knapp Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "The Book of Isaiah",
        "Authors": "By Bible. O. T. Isaiah. English. Jewish Publication Society. 1973.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "The Jewish Publication Society of America",
        "Price Starting With ($)": "29.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Mayo Clinic Guide to Self-Care: Answers for Everyday Health Problems",
        "Authors": "By Hagen, Philip T. (EDT)",
        "Description": "A world leader in medicine and research presents a wealth of essential information on everyday health concerns, including fevers, back pain, headaches, skin cancer, PMS, weight loss, suicide, and much more. Original.",
        "Category": " Family & Relationships , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "From mourning to morning: Healing in America's time of crisis",
        "Authors": "By Frangipane, Leo G",
        "Description": "",
        "Category": "",
        "Publisher": "Executive Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Berlin Encounter (Rendezvous with Destiny)",
        "Authors": "By Bunn, T. Davis",
        "Description": "At the end of World War II, Colonel Jake Burnes of American Intelligence makes a dangerous journey into Soviet-occupied Berlin to rescue two German rocket scientists seeking asylum in the West",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Hooked on Life: From Stuck to Starting over",
        "Authors": "By Arterburn, Stephen and Timmons, Tim",
        "Description": "Identifies the confusions, anxieties, desperations, and frustrations that most frequently turn individuals sour on life and offers those individuals guidance in recovering enthusiasm and directing their lives",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "The Birthmark: A Novel",
        "Authors": "By Straus, Dorothea",
        "Description": "The story of Nicholas Bloch, told through the eyes of the sister who has repudiated him, as he rejects his heritage as a German Jew and makes several doomed attempts as assimilation into nineteenth-century Brooklyn society",
        "Category": " Fiction , General",
        "Publisher": "George Braziller",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "The Carefree Cook",
        "Authors": "By Rodgers, Rick",
        "Description": "The Carefree Cook introduces a new, relaxed way of cooking from an award-winning star of the culinary classroom. Rick Rodgers, author of the “101” cookbook series  (Thanksgiving, Christmas, and Barbecues) and many other cookbooks, presents more than 150 recipes that busy home cooks will love, both for their ease and their flavor.Many home cooks’ palates have reached lofty levels of sophistication, but the amount of time and energy available for cooking has plummeted. With that in mind, Rick Rodgers has come up with a brilliant solution.In his most comprehensive book to date, Rodgers replaces stress and fuss with creativity and ease. While Rodgers has included numerous quick ideas in this collection, he believes “slow food” has a place in the kitchen of the busiest home cook, so many of his selections simmer and roast at a leisurely pace while the cook does something else—or nothing at all. Written in Rodgers’s appealingly irreverent style, each of the 150 recipes in The Carefree Cook draws dazzling flavor from just a handful of ingredients. What’s for dinner? Rodgers has compiled an enticing array of entrées, including meat, fish, chicken, pasta, and vegetarian dishes: Pork Tenderloin with Lime Butter Sauce, Halibut with Herbed Oil, Grilled Five-Spice Chicken, Bucatini Carbonara with Zucchini, and Santa Fe Corn Pudding, to name just a few. Soups, salads, and hot and hearty main-dish sandwiches (Potato and Roasted Red Pepper Soup, Carrot Slaw with Miso Vinaigrette,  Bistro Skirt Steak Sandwich) can be mixed and matched for satisfying suppers. To make life even easier he supplies what he calls “bonus recipes.” These are based on making larger quantities of a dish that can serve as the basis for future meals. Thus a meat stew can turn up as a pasta sauce later in the week with the addition of crushed tomatoes and some extra simmering, or a large roast chicken can be the basis of a chicken casserole the following night. He also provides the easiest and best recipes for sweets he has collected over the years, including Rocky Road Chocolate Cake, “Faux” Peach Tarte Tatin, and Banana Streusel Coffee Cake. Every recipe is conveyed in the realistic, detailed format that has won Rodgers so many fans.A down-to-earth approach to fine cooking, The Carefree Cook will give even the most inexperienced novice in the kitchen the confidence to cook well and have a good time doing it.",
        "Category": " Cooking , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "7.19",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Parents Answer Book: From Birth Through Age Five",
        "Authors": "By Parents' Magazine (EDT)",
        "Description": "Having children means having questions...Why isn't my baby rolling over yet? Will my child start talking soon? How can I get my toddler to eat her vegetables? When will my child be ready to use the potty? What type of preschool is best?The Parents Answer Book provides the answers.Parenthood is a time of overwhelming emotions-and questions. Like a wise, trusted friend, this comprehensive resource tells you everything you'll need to know to raise a happy, healthy, safe, and secure child, from birth through age five.Newborn Basics, an illustrated introduction to infant care, helps you through the daily routines and quandaries that begin the moment you get home from the hospital. An \"owner's manual\" for new parents, it takes you from day one through the first year, when your information needs are greatest.As They Grow covers physical, emotional, and cognitive milestones in a young child's life and underscores what you can do to promote your child's growth, featuring:* Developmental timelines* Q & A sidebars that address parents' pressing concerns* \"It Worked for Me\" parent-tested solutions* \"Time for You\" sidebars for new mothers* \"Dos and Don'ts\" for handling tricky situationsYour Child's Health gives you all the tools you'll need to ensure your child's well-being with a thorough guide to good health, nutritional practices, and preventive care, including: * A-Z guide to symptoms and treatments, covering everything from the flu to meningitis* Immunizaitons* First aid and medical emergencies* Special sidebars on \"When to Call the Doctor\" and \"Pediatricks,\" original tips from pediatriciansSafe and Sound provides step-by-step guidance on creating a safe home and a safe environment wherever you go throughout your child's life, covering: * Childproofing the home* Outdoor and travel safety* \"Parents Alert\" boxes that highlight specific dangers* \"It Happened to Us\" real-life vignettesThe Parents Answer Book is the one resource every family should have on their bookshelf",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Golden Guides from St. Martin's Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Two Thousand One Italian and English Idioms-Duemila",
        "Authors": "By Hall, Robert Anderson",
        "Description": "Gives the Italian and English equivalent expressions for common idioms in English and Italian, and includes sample sentences using the expression",
        "Category": "",
        "Publisher": "Barron's Educational Series, inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "The Ultimate Quilting Book: Over 1,000 Inspirational Ideas and Practical Tips",
        "Authors": "By Gordon, Maggi McCormick",
        "Description": "More than 200 antique and contemporary quilts, nearly 100 classic patchwork patterns, 800 color and 200 black-and-white illustrations, 25 projects, and a library of 100 trace-off appliqué and quilting motifs. “An astonishingly beautiful book at an astounding price. The biggest book bargain to appear in a long, long time.”—The Quilter.",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Collins & Brown",
        "Price Starting With ($)": "8.4",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Anti-ballistic missile: yes or no?",
        "Authors": "By Donald G. Brennan~Center for The Study Of Democrat",
        "Description": "",
        "Category": "",
        "Publisher": "Hill and Wang",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Power Is Within You",
        "Authors": "By Hay, Louise L. and Tomchin, Linda Carwin",
        "Description": "In The Power Is Within You, Louise L. Hay expands her philosophies of loving the self through:-learning to listen and trust the inner voice;-loving the child within;-letting our true feelings out;-the responsibility of parenting;-releasing our fears about growing older;-allowing ourselves to receive prosperity;-expressing our creativity;-accepting change as a natural part of life;-creating a world that is ecologically sound where it's safe to love each other'-and much more.She closes the audio download with a section devoted to meditations for personal and planetary healing.",
        "Category": " Health & Fitness , Alternative Therapies",
        "Publisher": "Hay House Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "A Random Walk Down Wall Street: Including a Life-Cycle Guide to Personal Investing",
        "Authors": "By Malkiel, Burton G.",
        "Description": "An updated edition of the investor's classic guide includes new chapters showing individuals how to tailor their financial objectives to their incomes, and debunks myths about the death of the \"random walk\" theory",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Hallmark keepsake ornaments",
        "Authors": "By Scroggins, Clara Johnson",
        "Description": "",
        "Category": "",
        "Publisher": "Wallace-Homestead Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Better Homes and Gardens American Christmas Crafts and Foods (Better homes and garden books)",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "Offers recipes for holiday cookies, cakes, breads, and meals, and presents instructions for making dolls, toys, puppets, ornaments, quilts, and wall hangings",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Deck the halls: A treasury of Christmas crafts",
        "Authors": "By Brossart, Judith (Ed. )",
        "Description": "",
        "Category": "",
        "Publisher": "Cowles Creative Publishing Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "American Interiors: New England and the South",
        "Authors": "By Brooklyn Museum (COR), Peirce, Donald, and Alswang, Hope",
        "Description": "Shows seven museum displays that illustrate the characteristic arrangement of eighteenth century rooms and provides comments on furniture, floors and ceilings, and other furnishings",
        "Category": " Architecture , General",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "5.73",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "The You-Do-It Book of Early American Decorating",
        "Authors": "By Gilbert, Rose Bennett",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Toward a Global Easy Street",
        "Authors": "By Insight",
        "Description": "",
        "Category": "",
        "Publisher": "Insight",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Wisdom of John Paul II: The Pope on Life's Most Vital Questions",
        "Authors": "By John Paul II, Pope, Bakalar, Nick, and Balkin, Richard",
        "Description": "Inspiration, understanding, comfort, revelation, spiritual guidance - a huge audience of devoted readers seeks all of this in the words of Pope John Paul II. The astonishing success of Crossing the Threshold of Hope (even despite the difficulty of that text) has left readers hungry for the words of the Pope, not altered or watered down, but made accessible by careful selection and organization. In The Wisdom of John Paul II, readers will find the sustenance they seek. Culled from the Pope's encyclicals, apostolic letters, addresses, occasional speeches, and other writings, The Wisdom of John Paul II is a powerful and illuminating distillation of the Pope's most moving, wise, and penetrating statements on the issues that concern us most.Organized into easy-to-read categories, Pope John Paul's fresh and inspiring words address a range of important issues - spirituality in modern life, human rights and religious freedom, marriage and family, morality, peace, prayer, women's roles, poverty, and many other concerns vital to Christian life and thought. A beacon of light for Catholics and non-Catholics alike, The Wisdom of John Paul II fulfills the promise of Crossing the Threshold by offering readers direct access to the bold and noble thoughts of the premier spiritual leader of our time.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "HarperSanFrancisco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Afterlife: The Complete Guide",
        "Authors": "By Neiman, Carol and Goldman, Emily",
        "Description": "An honest, sometimes sardonic exploration, featuring beautiful illustrations, of the many varieties of beliefs about the afterlife, reviews various religious beliefs and personal accounts of near-death experiences and reincarnation. 15,000 first printing. $15,000 ad/promo.",
        "Category": " Religion , General",
        "Publisher": "Studio",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Roman Baths and Museum: Official GuideProfessor Cunliffe (1985-05-03)",
        "Authors": "By Barry Cunliffe",
        "Description": "",
        "Category": "",
        "Publisher": "Bath Archaeological Trust",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Senate nobody knows",
        "Authors": "By Asbell, Bernard",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Circle of Henry Adams: Art & Artist",
        "Authors": "By Scheyer, Ernst",
        "Description": "",
        "Category": "",
        "Publisher": "Wayne State University Press",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Princeton Review: WORDSMART: Building an Educated Vocabulary",
        "Authors": "By A. Robinson + Staff of  Princeton Review",
        "Description": "Explains the meaning of more than eight hundred commonly misused words, and offers advice on improving one's vocabulary",
        "Category": "",
        "Publisher": "Princeton Review",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "What is the Bible? (Children's Bible basics)",
        "Authors": "By Carolyn Nystrom",
        "Description": "A simple explanation of how the Bible was written, what it contains, and its personal importance to us.",
        "Category": "",
        "Publisher": "Moody Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Self-Renewal : The Individual and the Innovative Society",
        "Authors": "By Gardner, John William",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Fast Foods: Eating in and Eating Out",
        "Authors": "By Florman, Monte and Florman, Marjorie",
        "Description": "An evaluation of the nutritional contents of convenience foods and the fast-food chains' fare. Note, for example, that the McDonald's Big Mac Meal yields some 60% of a woman's recommended daily allowance (RDA) of calories with some 80% of RDA of protein, 70% of RDA of fat, 95% of RDA of saturated fat, 35% of the RDA of sodium. Most pages are devoted to convenience foods with several given to fast-cooking appliances. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Health & Fitness , General",
        "Publisher": "Consumer Reports Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Chicago Loop",
        "Authors": "By Theroux, Paul",
        "Description": "Successful real-estate agent Parker Jagoda risks his apparently peaceful, happy life and marriage as his obsessive pursuit of sexual pleasure draws him into a terrifying nightmare of erotic psychosis and murder",
        "Category": " Education , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Blood Race",
        "Authors": "By Olshaker, Mark",
        "Description": "During the 1936 Berlin Olympics, American David Keegan and German Karl Linderhoff compete for a gold medal and for the love of scientist Miranda Wolff, while British agent David Tennyson races to stop Wolff's work--or kill her",
        "Category": " Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "View from Highway 1",
        "Authors": "By Arlen, Michael J",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "Gardening With the New Small Plants: The Complete Guide to Growing Dwarf and Miniature Shrubs, Flowers, Trees and Vegetables",
        "Authors": "By Allen, Oliver E.",
        "Description": "This guide to gardening for anyone with limited space describes a wide range of miniature and dwarf plants and offers advice on selecting and caring for plants",
        "Category": " Gardening , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Ten Thousand Day War: Vietnam: 1945-1975",
        "Authors": "By MacLear, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "The Laughing Place: A Novel",
        "Authors": "By Durban, Pam",
        "Description": "John and Louise Vess have conducted their lives seamlessly and honorably in the South Carolina home that has been in their family for generations.  Upon John's sudden death, their daughter Annie-also a recent widow-returns to comfort Louise.  But Annie finds all has changed: a gigantic artificial lake has flooded the woods she remembers, her sensible mother spouts born-again homilies, and her father's reputation is threatened by a long-hidden scandal.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "John Doe, Disciple (Sermons For The Young In Spirit)",
        "Authors": "By Peter Marshall",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Book Company",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Lincoln At Home : Two Glimpses of Abraham Lincoln's Family Life",
        "Authors": "By Donald, David Herbert",
        "Description": "As Lincoln led the nation into the Civil War, managing the Union war effort, issuing the Emancipation Proclamation, winning reelection in 1864, and planning the Reconstruction of the South, he also led a private life, defined by his close relationship with his wife and his devotion to his children. Lincoln at Home offers a view into the life of the family through their written correspondence.  With a brief account of their years in the White House and the complete collection of all the known letters exchanged by Abraham and Mary Todd Lincoln, this elegant portrait defines the sixteenth president as a dedicated -- though often a desperately busy and distracted -- family man.  Lincoln at Home is an intimate and rare glimpse of the president as husband and father, a cheerful man pinned to the floor while playing with his children, and a desolate man struck down by grief at the death of his son. Beyond this, we are shown a personal side of the man who managed one of the most difficult periods in American history.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Perfect Enemies: The Religious Right, the Gay Movement, and the Politics of the 1990s",
        "Authors": "By Bull, Chris and Gallagher, John",
        "Description": "A political war is raging in the United States between two groups once considered radical, even marginal, by most Americans: the religious right and the gay movement. Perfect Enemies reveals why this conflict has moved to the center of political debate and become a pivotal issue in elections at all levels.In Perfect Enemies, Chris Bull and John Gallagher trace the origins and growth of both groups from the seminal year of 1969, when the Stonewall Riots ushered in the modern gay rights movement and when Pat Robertson and Jerry Falwell embarked on direct political action to bring strict biblical interpretation to bear on public policy. The skillful grassroots organizational efforts of both movements, based on a mutual demonization of each side by the other, resulted in growing political clout that developed under the radar of mainstream political commentators - and exploded upon the scene in a series of bitter and, to most Americans, bewildering political conflicts.From President Clinton's aborted pledge to lift the ban on gays and lesbians in the armed forces to the statewide antigay initiatives in Oregon, Colorado, and Maine, Bull and Gallagher offer the first comprehensive account of the rhetoric and strategies - often remarkably alike - of both sides, and of how the mutual passion of these perfect enemies is influencing electoral politics from the state houses to the White House.",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Student Guidebook to Resources and Citation",
        "Authors": "By Glen Kremer",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Custom Publishing",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Sacrifice (Abram's Daughters #3)",
        "Authors": "By Lewis, Beverly",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The day Christ was born;: A reverential reconstruction",
        "Authors": "By Bishop, Jim",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Typefaces for Desktop Publishing: A User Guide",
        "Authors": "By Black, Alison",
        "Description": "",
        "Category": "",
        "Publisher": "Phaidon Inc Ltd",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Civil War",
        "Authors": "By Bradley, William J.",
        "Description": "A vivid portrayal of the bloody War Between the States includes nearly three hundred illustrations and photographs accompanying historical accounts, anecdotes, and discussions of battles, strategies, weapons, soldiers, leaders, and other aspects",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Crescent",
        "Price Starting With ($)": "8.09",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Hollywood, legend and reality",
        "Authors": "By Webb, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown, in association with Smithsonian Institution Traveling Exhibition Service",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "But Seriously, Folks",
        "Authors": "By Oliphant, Pat",
        "Description": "Cartoons satirize the administration of President Reagan and recent political events in the United States and around the world",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "7.01",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Wisdom for Living",
        "Authors": "By Falwell, Jerry",
        "Description": "",
        "Category": "",
        "Publisher": "Scripture Pr Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Edge of Eden",
        "Authors": "By Proffitt, Nicholas",
        "Description": "The discovery of a mutilated body of a man in 1978 Kenya leads to a hunt for a brutal and elusive professional poacher that takes investigators into the corruption and high stakes of the business of poaching",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "With These Words...I Thee Wed: Contemporary Wedding Vows for Today's Couples",
        "Authors": "By Eklof, Barbara",
        "Description": "Suggests a variety of wedding vows for secular and multi-denominational ceremonies, and offers advice on writing one's own vows",
        "Category": " Family & Relationships , General",
        "Publisher": "Adams Media Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "The Stronghold",
        "Authors": "By Meyer Levin",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "17.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Mind over Matter (Mysteries of the Unknown)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Examines paranormal phenomena such as poltergeists, psychokinesis, and mind control",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Off the Chart: A Novel",
        "Authors": "By Hall, James W.",
        "Description": "Passion and intrigue heat up the Florida Keys as Thorn and Alexandra Rafferty--returning from Blackwater Sound---face down a brutal killer who has kidnapped the daughter of Thorn's best friend.Before Alexandra came into Thorn's live, there had been Anne Joy, a beautiful woman who, after escaping the violence of her past, found something like happiness in the languid life of the Florida Keys. And her past includes her sadistic brother Vic, now a wealthy rogue businessman who specializes in the hijacking of pleasure boats and who delights in cruelly murdering their owners. Vic is obsessed by his sister and will do whatever it takes to drive her lovers away---even murder. When Vic decides that he must possess the land on which Thorn's beloved home is built, nothing will stand in his way---not even the life of a little girl, the daughter of Thorn's closest friend. From the lushness of the Florida Keys to a nightmare climax on the tropical coast of Central America, Off the Chart is vintage Hall.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Complete Pasta & Italian Cooking",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Plus",
        "Price Starting With ($)": "8.56",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Flowering World of \"Chinese\" Wilson.",
        "Authors": "By Foley, Daniel J.",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "39.56",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Skyline: Israel From Above",
        "Authors": "By Tal, Duby, Haramati, Moni (EDT), and Raz, Varda (EDT)",
        "Description": "",
        "Category": " Photography , Collections, Catalogs, Exhibitions , General",
        "Publisher": "Gefen Books",
        "Price Starting With ($)": "7.82",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Beating Around the Bush",
        "Authors": "By Buchwald, Art and Trudeau, G. B. (INT)",
        "Description": "Pulitzer Prize–winning Washington Post columnist Art Buchwald returns undaunted to examine the ridiculous people and preposterous events that we call our daily reality. Collected from his columns, with a foreword by Garry Trudeau, Buchwald’s satirical voice darts at politicians, power, corporations and the media without pause. A self-described troublemaker, Buchwald continues to represent the great American traits of skepticism, humor, and a refusal to compromise in the face of absurdity.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    }
]