[
    {
        "Title": "Pork (The Good Cook Techniques & Recipes Series)",
        "Authors": "By Time-Life Books",
        "Description": "Recipes accompany techniques for boning, frying, grilling, broiling, roasting, poaching, braising, and stewing pork",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "Time Life Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1980"
        }
    },
    {
        "Title": "Sleepers, Wake (An Apple Paperback)",
        "Authors": "By Jacobs, Paul Samuel",
        "Description": "Follows the adventures of a ten-year-old boy who, after awakening from a hibernation state, discovers that his hundred-year journey through space has caused his body to change. By the author of Born to Light. Reprint.",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Shug",
        "Authors": "By Han, Jenny",
        "Description": "Annemarie “Shug” Wilcox is clever and brave and true (on the inside anyway). And she’s about to become your new best friend in this enchanting middle grade novel from the New York Times bestselling author of To All the Boys I’ve Loved Before (soon to be a major motion picture!), Jenny Han.Annemarie Wilcox, or Shug as her family calls her, is beginning to think there's nothing worse than being twelve. She's too tall, too freckled, and way too flat-chested. Shug is sure that there's not one good or amazing thing about her. And now she has to start junior high, where the friends she counts most dear aren't acting so dear anymore -- especially Mark...",
        "Category": " Young Adult Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Fifteen",
        "Authors": "By Cleary, Beverly",
        "Description": "It seems too good to be true. The most popular boy in school has asked Jane out -- and she's never even dated before. Stan is tall and good-looking, friendly and hard-working -- everything Jane ever dreamed of. But is she ready for this?Suppose her parents won't let her go? What if she's nervous and makes a fool of herself? Maybe he'll think she's too young. If only she knew all the clever things to say. If only she were prettier. If only she were ready for this...With her usual warmth, perceptiveness, and humor, Beverly Cleary creates the joys and worries of a young girl's first crush.",
        "Category": " Young Adult Fiction , Romance , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "World of Physics, Volume 3",
        "Authors": "By Weaver, Jefferson Hane",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "World's Great Bombers: From 1914 to the Present Day",
        "Authors": "By Chant, Chris",
        "Description": "",
        "Category": " Transportation , Aviation , History",
        "Publisher": "Chartwell Books",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Bride's Bible",
        "Authors": "By",
        "Description": "",
        "Category": " Bibles , Other Translations , General",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Only Yesterday: An Informal History of the Nineteen-Twenties",
        "Authors": "By allen, frederick",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row Perennial Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "How Clean Is Your House?: Hundreds of Handy Tips to Make Your Home Sparkle",
        "Authors": "By Woodburn, Kim and MacKenzie, Aggie",
        "Description": "Two housekeeping experts share a host of trade secrets and inventive cleaning solutions for caring for every room in the house, presenting an entertaining \"filfth\" questionnaire, dozens of do's and don'ts, step-by-step instructions, before-and-after photographs, and ingenious home remedies. 75,000 first printing.",
        "Category": " Reference , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Taking Charge: A Personal Guide to Managing Projects and Priorities",
        "Authors": "By Feder, Michal E.",
        "Description": "",
        "Category": "",
        "Publisher": "Skillpath Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Modoc: The True Story of the Greatest Elephant That Ever Lived",
        "Authors": "By Helfer, Ralph",
        "Description": "Spanning several decades and three continents, Modoc is one of the most amazing true animal stories ever told. Raised together in a small German circus town, a boy and an elephant formed a bond that would last their entire lives, and would be tested time and again; through a near-fatal shipwreck in the Indian Ocean, an apprenticeship with the legendary Mahout elephant trainers in the Indian teak forests, and their eventual rise to circus stardom in 1940s New York City.Modoc is a captivating true story of loyalty, friendship, and high adventure, to be treasured by animal lovers everywhere.",
        "Category": " Nature , Animals , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Cat Ate My Gymsuit PMC 3.99 Promo (Puffin Modern Classics)",
        "Authors": "By Danziger, Paula",
        "Description": "",
        "Category": "",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Complete Gray's Anatomy",
        "Authors": "By Gray, Henry F. R. S. and Bolam, R. A.",
        "Description": "",
        "Category": " Medical , Reference",
        "Publisher": "Merchant Book Co",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Manager's Portfolio of Model Memos for Every Occasion",
        "Authors": "By Barnes, Cynthia A.",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Expert Resumes for Computer and Web Jobs",
        "Authors": "By Kursmark, Louise M. and Enelow, Wendy S.",
        "Description": "Presents nine resume strategies for computer and Web professionals, shows how to choose the best strategy for a particular situation, gives resume writing instructions, and explains how to create and use scannable, electronic, and Web resumes. Example resumes are taken from the files of professional resume writers in America, Canada, and Australia and represent diverse styles and approaches. The authors are Certified Professional Resume Writers and Certified Job and Career Transition Coaches. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , General",
        "Publisher": "Jist Publishing",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Untamed (House of Night, Book 4)",
        "Authors": "By Cast, P. C. and Cast, Kristin",
        "Description": "Life sucks when your friends are pissed at you. Just ask Zoey Redbird – she's become an expert on suckiness. In one week she has gone from having three boyfriends to having none, and from having a close group of friends who trusted and supported her, to being an outcast. Speaking of friends, the only two Zoey has left are undead and unMarked. And Neferet has declared war on humans, which Zoey knows in her heart is wrong. But will anyone listen to her?  Zoey's adventures at vampyre finishing school take a wild and dangerous turn as loyalties are tested, shocking true intentions come to light, and an ancient evil is awakened in PC and Kristin Cast's spellbinding fourth House of Night novel. (Recommended for readers age 13 and older)",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Effective Communication Skills: Essential Tools for Success in    Social Work",
        "Authors": "By Ludden, Marsha J.",
        "Description": "",
        "Category": " Language Arts & Disciplines , Communication Studies",
        "Publisher": "Wintergreen/Orchard House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Living the Cross Centered Life: Keeping the Gospel the Main Thing",
        "Authors": "By Mahaney, C. J.",
        "Description": "What Really Matters Have the extremities taken over and left the core of your faith forgotten? Do you get confused by what you feel versus what is real? Let dynamic pastor C. J. Mahaney strip away the nonessentials and bring you back to the simplest, most fundamental reason for your faith: Jesus Christ. This book is packed with powerful truth that will grip your heart, clear your mind, and invigorate your soul. Chapters include “Breaking the Rules of Legalism,” “The Cross Centered Day,” and “Assurance and Joy.” Get ready to behold a breathtaking view of what God intends to accomplish in and through you every day. You’ll discover how embracing this cross centered life is both our highest privilege and greatest responsibility. His Gift, Your Hope Do you desire more passion for Jesus Christ? Return to the very essence of your faith—the cross of Christ. Here, the deepest truths of Calvary will stir your passion for Him into an unquenchable fire. “Never lay it aside. Never move on,” says C. J. Mahaney, who shows you how to center every day around the life-giving reality of the gospel and how to escape the pitfalls of legalism, condemnation, and feelings-driven faith. PRAISEC. J. Mahaney’s The Cross Centered Life and Christ Our Mediator are life-changing books whose unique messages are even more powerful when combined. Living the Cross Centered Life is a careful melding of these two books with new content as well. For readers who have not yet discovered the stand-alone books, or for Mahaney fans ready to cherish their favorites in a new package, this book is sure to become a treasured classic.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "That Dark and Bloody River",
        "Authors": "By Eckert, Allan W",
        "Description": "An epic novel by an award-winning author chronicles the settling of the Ohio River Valley, home to the defiant Shawnee Indians, who vow to defend their land against the seemingly unstoppable.They came on foot and by horseback, in wagons and on rafts, singly and by the score, restless, adventurous, enterprising, relentless, seeking a foothold on the future. European immigrants and American colonists, settlers and speculators, soldiers and missionaries, fugitives from justice and from despair—pioneers all, in the great and inexorable westward expansion defined at its heart by the majestic flow of the Ohio River. This is their story, a chronicle of monumental dimension, of resounding drama and impact set during a pivotal era in our history: the birth and growth of a nation.Drawing on a wealth of research, both scholarly and anecdotal—including letters, diaries, and journals of the era—Allan W. Eckert has delivered a landmark of historical authenticity, unprecedented in scope and detail.",
        "Category": " History , United States , State & Local , Midwest (IA, IL, IN, KS, MI, MN, MO, ND, NE, OH, SD, WI)",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.33",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Fire and Ice: The United States, Canada and the Myth of Converging Values",
        "Authors": "By Adams, Michael, Langstaff, Amy, and Jamieson, David",
        "Description": "Our front pages scream US military, social and fiscal policy. It may appear that — with immigration questions, airport and border restrictions, debate about common currency and talk of private health clinics — we are drifting inevitably towards a greater political and philosophical alliance with the United States. The implication is that we share their values. As Canadians, we have long defined ourselves as “not Americans.” We cherish our differences from our powerful neighbour but, as the United States grows ever more dominant on the world stage, can we hope to hold on to our national identity? Are we fated to become Americans in a generation or two? In Fire and Ice, Michael Adams challenges the myth of inevitability that has led us to believe our Canadian way of life is doomed to extinction. Drawing upon a decade of never-before released pulse-taking from both sides of the border, he reveals that Canada and the United States are not coming together, but are diverging in significant ways. From the vehicles we buy to the deference we pay to authority, Canadians prove to be firmly separate in their attitudes and opinions. If you have ever wondered whether Canada can survive and prosper as a distinct society in an era of globalization and dizzying technological change, Fire and Ice provides fascinating evidence that the cultural divergence between our country and the United States will continue for years to come.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Penguin Canada",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Potatoes & Vegetables (Super Cookery)",
        "Authors": "By Parragon",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Pasta & Italian (Super Cookery)",
        "Authors": "By Parragon Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Lives of the Saints (Penguin 60s)",
        "Authors": "By Engelbert, Omer",
        "Description": "",
        "Category": " Religion , Christianity , Saints & Sainthood",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The 2 Oz. Backpacker: A Problem Solving Manual for Use in the Wilds",
        "Authors": "By Wood, Robert S.",
        "Description": "This featherweight little book will keep you out of trouble in the wilds by helping you make decisions like a veteran wilderness traveler. It will help you get the most from the food and gear you carry on your back, making your trip safer, more comfortable and, above all, more fun.HOW TO...make quick repairs to packs, boots, tents, beds and stoves...choose and develop a campsite for maximum comfort and shelter...deal with emergencies, storms and other difficulties...treat blisters, hypothermia, sunburn, bleeding, elevation sickness, etc... keep snug, dry, comfortable and warm in heavy weather.PLUS TIPS ON fire building, cooking, water treatment, getting found when lost, hiking, climbing, cross-country and route-finding techniques.",
        "Category": " Sports & Recreation , Hiking",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Confusions",
        "Authors": "By Ludwig, Jack Barry",
        "Description": "",
        "Category": "",
        "Publisher": "NY Graphic Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Truman Capote",
        "Authors": "By Plimpton, George",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Bird Garden",
        "Authors": "By Kress, Stephen W.",
        "Description": "Birds are the most visible and familiar form of wildlife, fascinating millions with their brilliant colors, varied songs, and entertaining behavior. By planting certain carefully selected trees and shrubs, you can create an attractive landscape that will encourage a wide variety of birds to visit your backyard, whether you have acres of land or just a small garden.The National Audubon Society's Bird Garden provides a fully illustrated guide to garden birds, and the plants that will attract them, all conveniently organized into five geographic regions. Here is complete information concerning the nest, the song, and the food preferences of 100 familiar garden birds. Descriptions and lists of more than 300 trees, shrubs, and other plants explain their growth habits and cultural preferences, their hardiness, and the birds that rely on them for food or cover.Birds are often attracted to the garden by nestboxes and platforms, feeders, dust baths, and water sources. These features are described and illustrated, with clear, concise directions for construction.",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "Dorling Kindersley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Crabtree & Evelyn Cookbook: A Book of Light Meals and Small Feasts",
        "Authors": "By Baker, Christopher (PHT), Kent, Elizabeth (EDT), Baker, Christopher (EDT), and Crabtree & Evelyn (Firm) (COR)",
        "Description": "Reflecting concerns for lighter, healthier meals, this cooking reference offers two hundred original recipes for breakfast, brunch, lunch, tea, cocktails, dinner, supper, and picnics, dividing menus seasonally and suggesting shortcuts and alternatives",
        "Category": " Cooking , Reference",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Sunrise on Stradbury Square (Sagas of a Kindred Heart, Book 3)",
        "Authors": "By Fell, Doris Elaine",
        "Description": "",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Joy of Cookies",
        "Authors": "By Herbst, Sharon Tyler",
        "Description": "Gathers international-style recipes for bar, rolled, drop, pressed, refrigerator, chocolate, and chocolate chip cookies, and includes hints on making, storing, and mailing cookies",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Home Improvement Guide - Ten Pound Books",
        "Authors": "By Ken Fund",
        "Description": "",
        "Category": "",
        "Publisher": "Creative Publishing, Int.",
        "Price Starting With ($)": "6.76",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Fortress of Eagles",
        "Authors": "By Cherryh, C. J.",
        "Description": "The wizard saved his greatest spell for last.  Tristen is the name of that Shaping, and Tristen knows nothing else for certain: Neither who he was, nor what he is, nor least of all why the wizard created him.And now the wizard is dead. And young Cefwyn is King. Cefwyn has a dream: A united Ylesuin, and a peace his land has never known. It is a dream that persists in spite of a court bent on ruling the King... self-serving barons who abhor wizards and foreigners.Hide your powers, the King asks Tristen. Cefwyn needs his only friend, this young man of mysterious origins who is more brother than vassal. He relies on Tristen, trusts him, protects him... and plans for a war that will bring his dreams to pass... or bring down ruin upon them all.And so a sword gathers dust in a corner of Tristen&#39;s room. One side says Truth. The other side says Illusion. The servants refuse to touch it... and Tristen ignores it with all his might.The eagerly awaited sequel to her acclaimed Fortress in the Eye of Time, C.J. Cherryh&#39;s newest high fantasy triumph continues the soaring tale of two friends, sovereign and sorcerer, in an age of wizardry. Fortress of Eagles is a legend in the making, an epic saga of destiny and ancient magic, an intimate tale of love and loyalty in a magical world spanning centuries.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Year's Best Science Fiction: Fourteenth Annual Collection",
        "Authors": "By Dozois, Gardner R. (EDT)",
        "Description": "A volume of an editor's favorite short science fiction pieces showcases the work of Gregory Benford, Tony Daniel, John Kessel, Nancy Kress, Maureen F. McHugh, Paul Park, Robert Silverberg, Bruce Sterling, and other notable authors. 25,000 first printing.",
        "Category": " Fiction , Science Fiction , Collections & Anthologies",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Bluebirds Forever",
        "Authors": "By Toops, Connie",
        "Description": "Details the natural history of bluebirds, exploring migratory, mating, and nesting habits of Eastern, Mountain, and Western bluebirds. Includes tips on enticing the birds to nest in yards, and includes a 16-page pullout section with building plans for several types of nest boxes and predator baffles, plus a listing of bluebird organizations. Includes numerous color photos. 9x11.25\". Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "Voyageur Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Not Till the Fat Lady Sings: The Most Dramatic Sports Finishes of All Time",
        "Authors": "By Krantz, Les and Flutie, Doug (FRW)",
        "Description": "From the moment that children start playing competitive sports, they dream of being the hero of a buzzer-beating victory, and this book and accompanying DVD chronicles 50 of the most memorable finishes in sports. Vibrant four-color photos, statistics, quotes, and stories offer fresh details on some of the most famous events in sports history, including “the Play” (Stanford vs. Cal), “the Ice Bowl,” Laettner's Buzzer-Beater, and N.C. State's Men's Basketball title. For those sports fans too young to have seen these famous moments or for those who wish to relive them over and over again, there is a exclusive DVD featuring sports icon Jim McKay, which features a detailed documentary on 20 of the highlights featured in the book.",
        "Category": " Sports & Recreation , Reference",
        "Publisher": "Triumph Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "BASS: A Handbook of Strategies",
        "Authors": "By Bobby Murray, Al Lindner",
        "Description": "",
        "Category": "",
        "Publisher": "A. Lindner Outdoors",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Helping a Child With Nonverbal Learning Disorder or Asperger's Syndrome: A Parent's Guide",
        "Authors": "By Stewart, Kathryn, Ph.D.",
        "Description": "The book offers readers ways to evaluate their child’s strengths and weaknesses in areas such as visual and spatial functioning, writing problems, information processing and organizational skills, social and emotional capabilities, language skills, and interactive abilities. It offers specific strategies for intervening and helping the child to cope with these obstacles, such as teaching the child how to socialize with humor and empathy, alternatives for learning to write, tips for organizing daily activities, multi-tasking, and more.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "New Harbinger Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Paul: An Introduction to His Thought",
        "Authors": "By Barrett, C. K.",
        "Description": "This volume, written by one of the most preeminent experts on Paul, takes the reader back to the earliest days of Christianity - a time before even the Gospels were written. C.K. Barrett concentrates on Paul as a Christian thinker. He traces the development and content of his teaching in a clear and comprehensive way and demonstrates that Paul's thought evolved out of the controversies in which he was engaged. Basing his book on detailed exegesis of relevant passages and using the whole corpus of Pauline letters, Barrett provides a solid introduction to Paul. His book will be of interest to both those approaching Paul for the first time and to those already familiar with him and the enormous literature concerning him.",
        "Category": " Religion , Biblical Criticism & Interpretation , General",
        "Publisher": "Westminster John Knox Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Country Inns of the Mid-Atlantic",
        "Authors": "By Tolf, Robert",
        "Description": "",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "101 Productions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Hyper Fitness: 12 Weeks to Conquering Your Inner Everest and Getting Into the Best Shape ofYour Life",
        "Authors": "By Burch, Sean",
        "Description": "A revolutionary, twelve-week program to take you to the top level of fitness and wellness from \"one of the fittest men on earth\" (CNN International).  Sean Burch started out with a lofty goal: to climb Mount Everest solo and without supplementary oxygen. To accomplish this, Sean developed a training regimen that incorporated cardio and strength elements, nutrition, and mental conditioning. That program took him to Everest's summit and helped launch his career as one of the world's premier athletes. He is now considered an \"American Fitness Guru\" (Men's Journal) and sought after for his unique techniques and his contagious enthusiasm.  Hyperfitness means learning to test and challenge yourself every day. It means setting short-term and long-range goals and achieving them. It means pushing yourself and discovering that you are stronger, tougher, and more capable than you ever dreamed. With Sean's three building blocks to success-hyperstrength (exercise), hyperfare (nutrition), and hypermind (mental conditioning)-you can accomplish any physical and mental goal you can imagine in twelve short weeks.  But what sets this fitness book apart is Sean Burch's incredible personal story and his encouraging, no-holds-barred motivational approach. With such creative daily exercises as speed skater drills, aerial spins, scale the whale, and ski-mogul master jumps clearly illustrated throughout, the workouts are more like obstacle courses-challenging, varied, and fun. Whether you are preparing for a marathon or another event, or are just ready to dedicate yourself to getting in the best shape of your life physically and mentally, Hyperfitness will inspire you to reach the highest level of yourself possible.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Decorative Painting Made Easy (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books and Tincher-Durik, Amy (EDT)",
        "Description": "Painting techniques including frottage, wood grain, and crackling are presented in real room settings.Full-size, half-page samples of 16 finishes allow readers to see how an application might look in their homes.Features step-by-step instructions for each technique along with complete materials listings.Provides additional information for choosing the right paint for a particular technique and the right technique for different decorating styles.Decorative-painting techniques explained through detailed instructions and photography.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Fix-It and Forget-It 5-ingredient favorites: Comforting Slow-Cooker Recipes",
        "Authors": "By Good, Phyllis Pellman",
        "Description": "So who has time to prepare food these days? We time-starved cooks need recipes that are guaranteed to be&#151; Quick to fix, Easy for anyone to make, whether you're a cook or not, Delicious and satisfying. The solution? Fix-It and Forget-It 5-Ingredient Favorites&#151;the latest member in the multi-million copy Fix-It and Forget-It cookbook series! This smart cookbook offers convenience and comfort to anyone faced with a too-full life and hungry people to feed. Gather five or fewer readily available ingredients + your slow cooker + Fix-It and Forget-It 5-Ingredient Favorites&#151;and you can have&#151; Apricot Chicken, Lazy Lasagna, Sweet and Savory Brisket, Bacon Feta-Stuffed Chicken, Tortellini with Broccoli, Upside-Down Chocolate Pudding Cake Brownies with Nuts.           Fix-It and Forget-It 5-Ingredient Favorites, with its more than 700 recipes, can be your new faithful companion. Turn to it for Main Dishes, Meats and Pastas, Vegetables, Soups, Breads, Breakfasts and Brunches, Desserts, Appetizers, Snacks, and Beverages. From New York Times best-selling author Phyllis Pellman Good, who believes that it is possible to do home-cooking and to enjoy the great satisfaction it brings to those who cook and to those who eat.Skyhorse Publishing, along with our Good Books and Arcade imprints, is proud to publish a broad range of cookbooks, including books on juicing, grilling, baking, frying, home brewing and winemaking, slow cookers, and cast iron cooking. We’ve been successful with books on gluten-free cooking, vegetarian and vegan cooking, paleo, raw foods, and more. Our list includes French cooking, Swedish cooking, Austrian and German cooking, Cajun cooking, as well as books on jerky, canning and preserving, peanut butter, meatballs, oil and vinegar, bone broth, and more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Good Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Math Curse",
        "Authors": "By Scieszka, Jon and Smith, Lane (ILT)",
        "Description": "Did you ever wake up to one of those days where everything is a problem? You have 10 things to do, but only 30 minutes until your bus leaves. Is there enough time? You have 3 shirts and 2 pairs of pants. Can you make 1 good outfit? Then you start to wonder: Why does everything have to be such a problem? Why do 2 apples always have to be added to 5 oranges? Why do 4 kids always have to divide 12 marbles? Why can't you just keep 10 cookies without someone taking 3 away? Why? Because you're the victim of a Math Curse. That's why. But don't despair. This is one girl's story of how that curse can be broken.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Viking",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "I Can Do It! I Can Do It!: 135 Sucessful Independent Learning Activities",
        "Authors": "By Gilbert, LA Britta",
        "Description": "",
        "Category": "",
        "Publisher": "Gryphon House",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Differentiated Instructional Strategies: One Size Doesn′t Fit All",
        "Authors": "By Gregory, Gayle H. and Chapman, Carolyn",
        "Description": "Teachers can use the practical process outlined in this book to adjust learning based on individual students' knowledge, skills, experience, preferences, and needs to help every student in the classroom learn and succeed.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Corwin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Mosby's Clinical Nursing",
        "Authors": "By Thompson, June M., McFarland, Gertrude K., Hirsch, Jane E., and Tucker, Susan M.",
        "Description": "",
        "Category": "",
        "Publisher": "Mosby Inc",
        "Price Starting With ($)": "11.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Sepulchre (The Languedoc Trilogy)",
        "Authors": "By Mosse, Kate",
        "Description": "From the New York Times bestselling author of Labyrinth-\"a rich brew of supernaturalism and intrigue.\"(Kirkus Reviews) In 1891, young Léonie Vernier and her brother arrive at the home of their widowed aunt in Rennes-le-Bains, in southwest France. But nothing is as Léonie had imagined. Their aunt is young, willowy, and beautiful, and the estate is a subject of local superstition. Villagers claim that Léonie's late uncle died after summoning a demon from the old Visigoth sepulchre on its grounds... More than a century later, Meredith Martin, an American graduate student, arrives in Rennes-le- Bains while researching the life of Claude Debussy. Haunted by a Tarot reading she had in Paris-and possessing the mysterious deck of cards-she checks into a grand old hotel built on the site of a famous mountain estate destroyed by fire in 1896. There, the pack of Tarot cards and a piece of 19th-century music known as Sepulchre 1891 hold the key to her fate-just as they did to the fate of Léonie Vernier.",
        "Category": " Fiction , Literary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Black Beauty - Dorling Kindersley Classics",
        "Authors": "By Sewell, Anna, Ambrus, Victor G. (ILT), and Stevenson, Juliet (NRT)",
        "Description": "A horse in nineteenth-century England recounts his experiences with both good and bad masters, in an abridged paperback version of the classic tale and an audio cassette which includes dramatic dialogue, special effects, and music.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "DK CHILDREN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Blood Lite: An Anthology of Humorous Horror Stories Presented by the Horror Writers Association",
        "Authors": "By Anderson, Kevin J. (EDT)",
        "Description": "The Horror Writers Association Presents    BLOOD LITE    ...a collection of entertaining tales that puts the fun back into dark fiction, with ironic twists and tongue-in-cheek wit to temper the jagged edge.   Charlaine Harris reveals the dark side of going green, when a quartet of die-hard environmentalists hosts a fundraiser with a gory twist in \"An Evening with Al Gore\"...In an all-new Dresden Files story from Jim Butcher, when it comes to tracking deadly paranormal doings, there's no such thing as a \"Day Off\" for the Chicago P.D.'s wizard detective, Harry Dresden...Sherrilyn Kenyon turns a cubicle-dwelling MBA with no life into a demon-fighting seraph with one hell of an afterlife in \"Where Angels Fear to Tread\"...Celebrity necromancer Jaime Vegas is headlining a sold-out séance tour, but behind the scenes, a disgruntled ghost has a bone to pick, in Kelley Armstrong's \"The Ungrateful Dead.\" Plus tales guaranteed to get under your skin -- in a good way -- from    Janet Berliner Don D'Ammassa Nancy Holder Nancy KilpatrickJ. A. Konrath and F. Paul Wilson Joe R. Lansdale Will LudwigsenSharyn McCrumb Mark Onspaugh Mike Resnick Steven SavileD. L. Snell Eric James Stone Jeff Strand Lucien Soulban Matt Venne Christopher Welch    So let the blood flow and laughter reign -- because when it comes to facing our deepest, darkest fears, a little humor goes a long way!",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Money Matters Participant's Guide: Financial Freedom for All God's Children",
        "Authors": "By Miller, Kim and Slaughter, Michael",
        "Description": "Freedom for ChristiansImagine feeling free from financial worry, free from debt, and free from the never-ending pressures of juggling all those financial demands. Imagine…feeling in control of your finances.Money Matters: Financial Freedom for all God’s Children shows you how to do God's math, which is based on spiritual principles found in Scripture. God's math results in: . Debt-Free Living. Focus & Planning. A Disciplined Lifestyle. Easy Simplicity. Surrender & Trust. Creating versus Consuming. Stewardship Versus Ownership. Generosity\"Earn all you can, save all you can,and give all you can.”—John Wesley\"I have observed how the grip of materialism can strangle a person and an organization. The only cure is understanding and applying God’s principles of stewardship and generosity. It’s all there in the Bible. Money DOES Matter. Learn from Mike, one of the best teachers of our time, how to get in sync with God’s game plan.\" — Bob Buford, Founding Chairman, Leadership NetworkContents    The Focus of Heart DEVOTION Chapter 1 – A Faith-filled Focus Chapter 2 – Devoted to Our Rightful Owner Chapter 3 – Surrender, Trust, and Freedom     The Commitment to DEBT-FREE Living Chapter 4 – Stewardship 101 Chapter 5 – Steps to Debt-free Living     The Practice of a DISCIPLINED Lifestyle Chapter 6 – Creators vs. Consumers Chapter 7 – Lifestyles of the Disciplined and Generous     The Power of Ultimate Sacrifice – a call to actionTarget audience: any person or family that needs to be more disciplined with financial resources.Michael Slaughter is senior pastor of Ginghamsburg, a thriving town and country church where over 4,000 persons worship each week. This congregation (which is influencing many others) are devoted to helping the orphans of civil war in the Sudan by giving 50 percent of their Christmas spending (over $500,000) to the orphaned children of Darfur. Mike challenges all of us to remember: \"Christmas is not your birthday! It is Jesus' birthday\" He is author of Spirtual Entrepreneurs, Out on the Edge, Momentum for Life, and Real Followers, all best sellers published by Abingdon Press. He resides in Tipp City, Ohio.Michael Slaughter is senior pastor of Ginghamsburg, a thriving town and country church where over 4,000 persons worship each week. He is author of Spirtual Entrepreneurs, Out on the Edge, and Real Followers, all best sellers published by Abingdon Press. He resides in Tipp City, Ohio.Kim Miller is Creative Director at Ginghamsburg United Methodist Church, near Dayton, Ohio. Kim is editor of Handbook for Multisensory Worship, volumes 1 and 2, and is author of Designing Worship Teams.When used with Money Matters: Financial Freedom for All God's Churches, this book offers a complete and inexpensive stewardship kit to prepare a congregation for generosity.",
        "Category": " Religion , Christian Living , Stewardship & Giving",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Essential Freshwater Aquarium",
        "Authors": "By Howell Book House (COR), Siino, Betsy Sikora (EDT), Norman, Aaron (EDT), and Skomal, Gregory (EDT)",
        "Description": "A low priced, paperback book on freshwater aquarium care filled with gorgeous four colour photographs incorporated in a beautiful design.THE ESSENTIAL GUIDES have all of the information that the new or experienced pet owner needs for a successful relationship with his or her pet.  Packed with interesting sidebars, the books discuss bringing your new pet home; the optimal way to feed your pet; and how to properly groom your pet.  Also included are comprehensive chapters on health care and how to train your pet like an expert; as well as a special chapter filled with fun facts about your specific pet.The many fun and descriptive photos in THE ESSENTIAL GUIDES are taken by a professional photographer, and each book contains perforated fact cards with lots of helpful pet care tips for your convenience.",
        "Category": " Pets , Fish & Aquariums",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Leadership Moment: Nine True Stories of Triumph and Disaster and Their Lessons for Us All",
        "Authors": "By Useem, Michael",
        "Description": "Are you ready for the leadership moment?Merck's Roy Vagelos commits millions of dollars to develop a drug needed only by people who can't afford it · Eugene Kranz struggles to bring the Apollo 13 astronauts home after an explosion rips through their spacecraft · Arlene Blum organizes the first women's ascent of one of the world's most dangerous mountains · Joshua Lawrence Chamberlain leads his tattered troops into a pivotal Civil War battle at Little Round Top · John Gutfreund loses Salomon Brothers when his inattention to a trading scandal almost topples the Wall Street giant · Clifton Wharton restructures a $50 billion pension system direly out of touch with its customers · Alfredo Cristiani transforms El Salvador's decade-long civil war into a negotiated settlement · Nancy Barry leads Women's World Banking in the fight against Third World poverty · Wagner Dodge faces the decision of a lifetime as a fast-moving forest fire overtakes his firefighting crew",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Currency",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Test Your IQ: A Detailed Explanation of What IQ Means and How It Is Measured -- Including Eight Tests You Can Take",
        "Authors": "By Eysenck, H. J. and Evans, Darrin",
        "Description": "A detailed explanation of what IQ means and how it is measured – including eight tests you can take! In Test Your IQ, Professor Hans Eysenck, the world-renowned expert on IQ testing, presents an introduction to the meaning, significance, and measurement of intelligence testing that sheds light on the controversy surrounding IQ scores. Is intelligence inherent or is it learned? Does a person’s genetic makeup and ethnic origin have any significance in the intelligence testing? Test your IQ and find your own answers to the controversy with eight sets of tests designed especially for this book. Answers to the tests and a graph to convert your results into an IQ score will reveal if you’re above average—or maybe even a genius!",
        "Category": " Education , Testing & Measurement",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "New Believer's New Testament (First Steps for New Christians)",
        "Authors": "By Greg Laurie",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Bar Cookie Bonanza",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Reiman Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "A Potful of Recipes: Recipes for Easy, Health, Devlious Dishes That Can Be Made in a Slow Cooker",
        "Authors": "By Lund, JoAnna M. and Alpert, Barbara",
        "Description": "A slow-cooking breakthrough&#151;from our fastest selling cookbook author...JoAnna Lund presents a brand-new Healthy Exchanges® instant classic&#151;with easy-to-use, lay-flat comb binding.Every busy cook wants to get in and out of the kitchen as quickly as possible&#151;and still have a delicious meal to show for it. With A Potful of Recipes, bestselling author JoAnna Lund makes preparing healthy, delicious meals easier than ever before. All of the mouthwatering recipes in this book can be prepared in a slow cooker&#151;which means that harried cooks will be serving meals with no fuss, no mess...and absolutely no stress!",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Taking Sides: Clashing Views on Educational Issues (Taking Sides: Educational Issues)",
        "Authors": "By Noll, James Wm (EDT)",
        "Description": "This fourteenth edition of TAKING SIDES: EDUCATIONAL ISSUES presents current controversial issues in a debate-style format designed to stimulate student interest and develop critical thinking skills. Each issue is thoughtfully framed with an issue summary, an issue introduction, and a postscript. An instructor’s manual with testing material is available for each volume. USING TAKING SIDES IN THE CLASSROOM is also an excellent instructor resource with practical suggestions on incorporating this effective approach in the classroom.  Each TAKING SIDES reader features an annotated listing of selected World Wide Web sites and is supported by our student website, www.dushkin.com/online.",
        "Category": " Education , Special Education , General",
        "Publisher": "McGraw-Hill/Dushkin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Painless Vocabulary (Painless Series)",
        "Authors": "By Greenberg, Michael",
        "Description": "This addition to Barron’s Painless  series is focused to meet the needs of middle school and high school students. The author’s friendly, informal narrative style takes the drudgery out of students’ vocabulary building, which is a prerequisite for their academic achievement and future success in college and beyond. Each of 24 chapters introduces 15 new words, first placing the words in a brief essay that allows students to comprehend them in a given context. “Brain Tickler” questions that follow challenge students and help them determine whether they have gained some mastery of word usage. Sidebars appear on many pages with titles such as “Major Mistake Territory,” alerting students to possible pitfalls and problems involving correct understanding of word meanings and normal usage. Each chapter concludes with an “On Your Own” section, which invites students to use the target vocabulary list within the context of their own everyday speech. Morbid. . . furtively . . . predecessor . . . infer . . . are typical examples of words students will learn to use with ease. The book’s vocabulary is neither too easy nor too arcane—focusing instead on words that students should have at their command in high-school and by the time they enter college.",
        "Category": " Language Arts & Disciplines , Spelling & Vocabulary",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Helping children know the Bible, (Leadership education series)",
        "Authors": "By Heikkinen, Jacob W",
        "Description": "",
        "Category": "",
        "Publisher": "Lutheran Church Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Excalibur (The Warlord Chronicles), cover images may vary",
        "Authors": "By Cornwell, Bernard",
        "Description": "In The Winter King and Enemy of God Bernard Cornwell demonstrated his astonishing ability to make the oft-told legend of King Arthur fresh and new for our time. Now, in this riveting final volume of The Warlord Chronicles, Cornwell tells the unforgettable tale of Arthur's final struggles against the Saxons and his last attempts to triumph over a ruined marriage and ravaged dreams. This is the tale not only of a broken love remade, but also of forces both earthly and unearthly that threaten everything Arthur stands for. Peopled by princesses and bards, by warriors and magicians, Excalibur is the story of love, war, loyalty, and betrayal-the work of a magnificent storyteller at the height of his powers.",
        "Category": " Fiction , Historical , General",
        "Publisher": "St. Martin's Griffin Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "More Sewing For Home Volume 9",
        "Authors": "By Singer Sewing",
        "Description": "Demonstrates how to make curtains, drapes, duvet covers, dust skirts, padded headboards, shower curtains, and towel embellishments, and discusses useful materials and techniques",
        "Category": "",
        "Publisher": "Cy Decosse",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "DK Readers: Busy, Buzzy Bee (Level 1: Beginning to Read) (DK Readers Level 1)",
        "Authors": "By Wallace, Karen",
        "Description": "You   know bees hum, but did you know that they dance? Find out why in this fun story about a very busy bee. Stunning photographs combine with lively illustrations and engaging, age-appropriate stories in DK Readers, a multilevel reading program guaranteed to capture children's interest while developing their reading skills and general knowledge. With DK Readers, children will learn to read—then read to learn!",
        "Category": " Juvenile Nonfiction , Animals , Insects, Spiders, etc.",
        "Publisher": "DK CHILDREN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Anatomy for the artist: The dynamics of the human form",
        "Authors": "By Flint, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Headaches and health",
        "Authors": "By Heywood Gould",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "6.91",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Duck Who Loved Puddles",
        "Authors": "By Pellowski, Michael J. and Paterson, Diane (ILT)",
        "Description": "A little duck looks everywhere on the farm for a wet place to splash, but all the water seems to be intended for someone else",
        "Category": "",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Iron Man: I Am Iron Man (I Can Read: Level 2)",
        "Authors": "By Guidi, Guido (ILT) and Rao, Lisa (ADP)",
        "Description": "Tony Stark invents his greatest creation yet—an iron suit that protects him from danger! At first, he keeps it a secret. But when he sees the power of his new suit, Tony must decide: is the world ready for the truth about Iron Man?",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Harper Trophy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Journey of a Humpback Whale (Dorling Kindersley Readers, Level 2: Beginning to Read Alone)",
        "Authors": "By Jenner, Caryn",
        "Description": "Written by children's authors and compiled by leading experts in the field of literacy, DK READERS capture children's interest and help them learn. DK Readers is a multi-level learning-to-read program combining DK's highly visual style with appealing stories at four graduated levels. Stunning photographs and engaging, age-appropriate stories are guaranteed to capture a child's interest while developing reading skills and general knowledge. DK Readers allow progression from stories for beginning readers with simple sentences and word repetition through to stories with rich vocabulary and more challenging sentence structure for proficient readers.",
        "Category": " Juvenile Nonfiction , Animals , Marine Life",
        "Publisher": "DK CHILDREN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The HBJ Anthology of Drama",
        "Authors": "By Worthen, William B.",
        "Description": "",
        "Category": " Drama , General",
        "Publisher": "Harcourt College Pub",
        "Price Starting With ($)": "6.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Trains (Discovery Program)",
        "Authors": "By Woodcock, John (ILT) and Turnbull, Stephanie",
        "Description": "Explores various trains and their uses, from steam locomotives to magnetic levitation trains, and includes Internet sites to visit that enhance the learning process.",
        "Category": " Juvenile Nonfiction , Transportation , Railroads & Trains",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Instant Calm: Over 100 Easy-to-Use Techniques for Relaxing Mind and Body",
        "Authors": "By Wilson, Paul",
        "Description": "Available in a serene new package, Instant Calm is the busy person's guide to finding peace and contentment in a restless world. These ingenious shortcuts to calm, are written in entertaining, easy-to-follow language and are gleaned from sources as divergent as the wisdom of ancient civilizations and the discoveries of modern science. Paul Wilson's solutions are based on meditation, acupressure, self-hypnosis, psychotherapy, aromatherapy, exercise, diet, and much more.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Mission to Mars (Let's-Read-and-Find-Out Science 2)",
        "Authors": "By Kelley, True (ILT), Branley, Franklyn Mansfield, and Armstrong, Neil (FRW)",
        "Description": "Let's-read-and-find-out about MarsSomeday people from Earth may live on Mars.In this century, we will go to the planet to learn more about it. It will become our outpost in space -- our space colony.",
        "Category": " Juvenile Nonfiction , Technology , Aeronautics, Astronautics & Space Science",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "My Five Senses (Let's-Read-and-Find-Out Science 1)",
        "Authors": "By Aliki",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The bicycle; a guide & manual,",
        "Authors": "By Way, Robert John",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Lord Rochester's Monkey",
        "Authors": "By Greene, Graham",
        "Description": "",
        "Category": "",
        "Publisher": "Viking",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1974"
        }
    },
    {
        "Title": "Happy Feet: The Movie Storybook",
        "Authors": "By Bryant, Megan E.",
        "Description": "When the penguin elders blame Mumble's unique \"happy feet\" for the shortage of food, Mumble--a young penguin who loves to dance--bravely sets off on an epic quest to prove them wrong. Original.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Stephanie's Ponytail (Munsch for Kids)",
        "Authors": "By Munsch, Robert N. and Martchenko, Michael (ILT)",
        "Description": "None of the kids in her class wear a ponytail, so Stephanie decides she must have one. The loud, unanimous comment from her classmates is: &#147;Ugly, ugly, very ugly.” Steadfast, when all the girls have copied her ponytail, she resolves to try a new style. With true Munsch flair, each of Stephanie’s ponytails is more outrageous than the last, while the cast of copycats grows and grows.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Annick Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Gandhi: An Autobiography - The Story of My Experiments With Truth",
        "Authors": "By Gandhi, Mahatma and Desai, Mahadev (TRN)",
        "Description": "Mohandas K. Gandhi is one of the most inspiring figures of our time. In his classic autobiography he recounts the story of his life and how he developed his concept of active nonviolent resistance, which propelled the Indian struggle for independence and countless other nonviolent struggles of the twentieth century.In a new foreword, noted peace expert and teacher Sissela Bok urges us to adopt Gandhi's \"attitude of experimenting, of tesing what will and will not bear close scrutiny, what can and cannot be adapted to new circumstances,\"in order to bring about change in our own lives and communities. All royalties earned on this book are paid to the Navajivan Trust, founded by Gandhi, for use in carrying on his work.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "A Very Brave Witch",
        "Authors": "By Bliss, Harry (ILT) and McGhee, Alison",
        "Description": "On the far side of town in a big dark house lives a brave little witch. She has heard lots and lots about that very human holiday Halloween, and even though she thinks she knows what humans are like, she has never, ever seen Halloween for herself.On the far side of town in a big dark house lives a brave little witch. She has heard lots and lots about that very human holiday Halloween, and even though she thinks she knows what humans are like, she has never, ever seen Halloween for herself. Until one very special Halloween comes along . . .",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Simon & Schuster/Paula Wiseman Books",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Collected Stories Including the Member of the Wedding and the Ballad of the Sad Cafe",
        "Authors": "By McCullers, Carson",
        "Description": "This collection of nineteen stories includes \"Madame Zilensky and the King of Finland,\" \"The Haunted Boy,\" \"The Member of the Wedding,\" \"The Ballad of the Sad Cafe,\" several early stories, and other important works",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "The Children's Illustrated Atlas of the World",
        "Authors": "By Madgwick, Wendy",
        "Description": "",
        "Category": "",
        "Publisher": "Templar Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Great Tabasco Recipes",
        "Authors": "By Paul McIlhenny",
        "Description": "",
        "Category": "",
        "Publisher": "Brimar Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Natural Cleaning for Your Home: 95 Pure and Simple Recipes",
        "Authors": "By Kellar, Casey and Kella, Casey",
        "Description": "The author of Natural Beauty & Bath Book introduces ninety-five simple recipes that use natural materials to clean, beautify, and refresh the home and explains how to replace harsh commercial cleansers with effective, economical, and safe products. 20,000 first printing. BOMC.",
        "Category": " House & Home , Cleaning & Caretaking",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Thomas Wolfe a Biography",
        "Authors": "By Nowell, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Sports Illustrated: The College Football Book",
        "Authors": "By Sports Illustrated (EDT) and Telander, Rick (INT)",
        "Description": "A richly illustrated survey of American college football captures some of the most memorable moments and athletes in the history of the sport in compelling action photographs, biographical profiles, statistics, and essays from the pages of Sports Illustrated.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Sports Illustrated",
        "Price Starting With ($)": "7.76",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Sun King",
        "Authors": "By Mitford, Nancy",
        "Description": "Details the life of the king, courtiers, and government officials in France in the late seventeenth and early eighteenth centuries, focusing on the Court of Versailles.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Artful Bride: Simple, Handmade Wedding Projects",
        "Authors": "By Paffrath, April L. and McFadden, Laura",
        "Description": "Every bride-to-be wants her wedding to be unique and spectacular. Savvy, stylish brides are looking for ways to add their own style and sophistication to their wedding without relying on tradition-heavy standards. This idea-packed guide contains everything you need to personalize a wedding beautifully and elegantly—but also simply and inexpensively. The Artful Bride includes more than 30 fashionable and fun-to-make projects, from novel wedding invitations to cool gifts for the wedding party, and from playful seating cards to a glamorous tiara. For those of you short on time but high on style, this guide will help you create a wedding that reflects you and your fiance exactly.",
        "Category": " Reference , Weddings",
        "Publisher": "Quarry Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Over Boston: Aerial Photographs",
        "Authors": "By Gleason, David King",
        "Description": "Presents aerial views of the buildings, parks, neighborhoods, and sporting events of the city of Boston",
        "Category": " Photography , General",
        "Publisher": "Louisiana State Univ Pr",
        "Price Starting With ($)": "6.81",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Frommer's South Africa (Frommer's Complete Guides)",
        "Authors": "By Bruyn, Pippa De and De Bruyn, Pippa",
        "Description": "Meticulously researched and beautifully written by a South African native, Frommer's South Africa, 4th Edition, should be the discerning reader's only guide to a memorable trip to southern Africa, including the lion-rich reserves of Botswana and the wonders of Victoria Falls. It offers complete safari coverage, from what to wear to the top game lodges to tracking tips from professional safari trackers. But there's so much more: An exploration of Cape Town, perhaps the world's most beautiful city, surrounded by mountains and sea, and the nearby picturesque Winelands country; Whale-watching and eating seafood on the Western Cape; Walking through carpets of flowers in Namaqualand plains after the first spring rains; Rafting or surfing the churning waters of the Zambezi River.Frommer's South Africa, 4th Edition, gives you all that and much more, from the best places to stay and eat to expert advice on getting there, getting around, and having the trip of a lifetime!",
        "Category": " Travel , Africa , Republic of South Africa",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Year's Best Science Fiction: Twelfth Annual Collection",
        "Authors": "By Dozois, Gardner R. (EDT)",
        "Description": "A consistently award-winning collection once again provides the best science fiction stories of the year, featuring work by veterans and newcomers including Michael Bishop, Nancy Kress, Ursula Le Guin, Mike Resnick, Geoff Ryman, Brian Stableford, and many others.",
        "Category": " Fiction , Science Fiction , Collections & Anthologies",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "27.12",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Modern Classics of Fantasy",
        "Authors": "By Dozois, Gardner R. (EDT)",
        "Description": "A collection of thirty-three classic short fantasy works, written since the 1940s, includes the contributions of such authors as H. L. Gold, Fritz Lieber, Manly Wade Wellman, Terry Bisson, Suzy McKee, Ursula K. LeGuin, Jane Yolen, and Roger Zelazny.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "One Prayer at a Time: A Day-to-Day Path to Spiritual Growth",
        "Authors": "By Bundesen, Lynne",
        "Description": "A prizewinning journalist and photographer offers a moving and inspirational guide to incorporating prayer into your daily life, showing how the growth of the spirit, whatever your religious beliefs, can blossom through these meditations. 20,000 first printing.",
        "Category": " Religion , Spirituality",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Panda Bear, Panda Bear, What Do You See?",
        "Authors": "By Carle, Eric (ILT) and Martin, Bill, Jr.",
        "Description": "The author and illustrator team behind the classic Brown Bear, Brown Bear, What do you see? turn their extraordinary talents ot the theme of animal conservation.Thirty-five years after their first groundbreaking collaboration, the creators of Brown Bear, Brown Bear, What Do You See? and Polar Bear, Polar Bear, What Do You Hear? reunite to address the important topic of animal conservation. A Bald Eagle soars, a Spider Monkey swings, a Macaroni Penguin struts, and a Red Wolf sneaks through Bill Martin Jr's rhythmic text and Eric Carle's vibrant images, and all are watched over by our best hope for the future-a dreaming child.Panda Bear, Panda Bear, What Do You See? is a 2004 Bank Street - Best Children's Book of the Year.",
        "Category": " Juvenile Fiction , Concepts , Senses & Sensation",
        "Publisher": "Henry Holt and Co. (BYR)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Amelia's Family Ties",
        "Authors": "By Moss, Marissa and Amelia",
        "Description": "After not seeing her father since she was a baby and her parents divorced, Amelia travels to Chicago to visit him, his new wife, and their baby, which challenges Amelia to learn what it's like to be a big sister and adjust to a blended family. Simultaneous.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Enrique's Journey: The Story of a Boy's Dangerous Odyssey to Reunite with His Mother",
        "Authors": "By Nazario, Sonia",
        "Description": "An astonishing story that puts a human face on the ongoing debate about immigration reform in the United States, now updated with a new Epilogue and Afterword, photos of Enrique and his family, an author interview, and more—the definitive edition of a classic of contemporary America   Based on the Los Angeles Times newspaper series that won two Pulitzer Prizes, one for feature writing and another for feature photography, this page-turner about the power of family is a popular text in classrooms and a touchstone for communities across the country to engage in meaningful discussions about this essential American subject.   Enrique’s Journey recounts the unforgettable quest of a Honduran boy looking for his mother, eleven years after she is forced to leave her starving family to find work in the United States. Braving unimaginable peril, often clinging to the sides and tops of freight trains, Enrique travels through hostile worlds full of thugs, bandits, and corrupt cops. But he pushes forward, relying on his wit, courage, hope, and the kindness of strangers. As Isabel Allende writes: “This is a twenty-first-century Odyssey. If you are going to read only one nonfiction book this year, it has to be this one.”  Praise for Enrique’s Journey “Magnificent . . . Enrique’s Journey is about love. It’s about family. It’s about home.”—The Washington Post Book World   “[A] searing report from the immigration frontlines . . . as harrowing as it is heartbreaking.”—People (four stars)   “Stunning . . . As an adventure narrative alone, Enrique’s Journey is a worthy read. . . . Nazario’s impressive piece of reporting [turns] the current immigration controversy from a political story into a personal one.”—Entertainment Weekly   “Gripping and harrowing . . . a story begging to be told.”—The Christian Science Monitor   “[A] prodigious feat of reporting . . . [Sonia Nazario is] amazingly thorough and intrepid.”—Newsday",
        "Category": " Social Science , Emigration & Immigration",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Sarum: The Novel of England",
        "Authors": "By Rutherfurd, Edward",
        "Description": "A masterpiece of breathtaking scope—a brilliantly conceived epic novel that traces the entire turbulent course of English history  This rich tapestry weaves a compelling saga of five families—the Wilsons, the Masons, the family of Porteus, the Shockleys, and the Godfreys—who reflect the changing character of Britain. As their fates and fortunes intertwine over the course of the centuries, their greater destinies offer a fascinating glimpse into the future. An absorbing historical chronicle, Sarum is a keen tale of struggle and adventure, a profound human drama, and a magnificent work of sheer storytelling.   Praise for Sarum   “Bursts with action, encyclopedic in historic detail . . . supremely well crafted and a delight to read.”—Chicago Tribune   “A fascinating journey . . . a clear yet sparkling window upon history with a superb narrative, so perfectly balanced between history and fiction that it clears away the mists of time from antiquity, giving the reader the impression that events over a span of ten centuries occurred only yesterday.”—Fort Worth Star-Telegram “Strong . . . appealing . . . I haven’t read so satisfactory a saga in years . . . in fact, perhaps not ever before. . . . It gives you not only history but comfort.”—Chicago Sun-Times   “[Edward] Rutherfurd holds us all consistently intrigued. In Sarum he has created a splendid novel that will bring many hours of diversified reading pleasure.”—The Plain Dealer   “A richly imagined vision of history, written with genuine delight.”—San Francisco Chronicle   “Rutherfurd is at his best. . . . His storytelling skills are substantial. . . . One of the best books of the season.”—Kansas City Star   “Absorbing . . . a superior historical novel . . . This blockbuster saga should appeal to discriminating readers, since Rutherfurd has an excellent grasp of his subject and a compelling story to tell.”—Publishers Weekly",
        "Category": " Fiction , Sagas",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Fun with Phone Solicitors: 50 Ways to Get Even",
        "Authors": "By Harris, Robert W.",
        "Description": "A zany guide for readers looking for revenge on annoying telephone solicitors presents fifty foolproof ways to get even with such ingenious solutions as \"The Drop-the-Phone Drill,\" \"The Receptionist Ruse,\" \"The Verbatim Variation,\" and many more. Original.",
        "Category": " Humor , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "In Pale Battalions",
        "Authors": "By Goddard, Robert",
        "Description": "Six months after her husband's sudden death, Leonora Galloway sets off for a holiday in Paris with her daughter Penelope.  At last the time has come when secrets can be shared and explanations begin...Their journey starts with an unscheduled stop at the imposing Thiepval Memorial to the dead of the Battle of the Somme near Amiens.  Amongst those commemorated is Leonora's father.  The date of his death is recorded and 30th  April, 1916.  But Leonora wasn't born until 14th March 1917.Penelope at once supposes a simple wartime illegitimacy as the clue to her mother's unhappy childhood and the family's sundered connections with her aristocratic heritage, about which she has always known so little.But nothing could have prepared her, or the reader, for the extraordinary story that is about to unfold.From the Paperback edition.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Nights Of Rain And Stars - Large Print Edition",
        "Authors": "By Binchy, Maeve",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday Large Print/Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "A Book of Hugs",
        "Authors": "By Ross, Dave and Rader, Laura (ILT)",
        "Description": "Have a Hug!There are all kinds of hugs. Porcupine hugs are done very carefully.Knee hugs are good for hugging someone tall.And piggyback hugs are the best way to see a parade.From birthday hugs to Great-Aunt Mary hugs, every hug has a purpose even a lamppost hug.You should never hug tomorrow when you can hug today.But which hug will you choose?   Puppy hugs Fraidycat hugs Birthday hugs I love-you-hugsIn this delightfully cuddly book, Dave Ross and Laura Rader team up to give us a warm and friendly look at some of the best kinds of hugs around. An Alternate Selection of Childrens Book-of-the-Month Club.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , General",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Colors (Anne Geddes Collection)",
        "Authors": "By Geddes, Anne",
        "Description": "Photographs of imaginatively costumed youngsters, from a baby in a red hat to a benchful of flower girls, show commonly seen colors",
        "Category": " Juvenile Nonfiction , Science & Nature , Physics",
        "Publisher": "Cedco Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    }
]