[
    {
        "Title": "Animal Talk: Interspecies Telepathic Communications",
        "Authors": "By Smith, Penelope",
        "Description": "",
        "Category": " Nature , Animals , General",
        "Publisher": "Pegasus Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Women, Resistance & Revolution: A History of Women and Revolution in the Modern World",
        "Authors": "By Rowbotham, Sheila.",
        "Description": "Records one woman's view of the feminist movement and its important role in effecting social change",
        "Category": " Political Science , General",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1973"
        }
    },
    {
        "Title": "Cold Spaghetti at Midnight",
        "Authors": "By Waldron, Maggie",
        "Description": "What do hot chicken soup for breakfast and cold spaghetti at midnight have in common?The power to comfort, revive, and even heal, or so goes the wisdom of folk medicine. The body and the mind respond quite miraculously to nourishment and intelligent therapy - and food is the first and best medicine in both cases.Maggie Waldron, a storyteller par excellence and a true exponent of commonsense health, concurs. In this irresistible and persuasive volume she convinces us of the remarkable curative powers and psychological benefits hidden in even the most ordinary foods.She explains comforters and revivers, the foods and remedies drawn from our warmest childhood memories, the foods we still turn to when we're blue and out of sorts: steaming cinnamon tea on a bleak winter night, cooling sherbet for a sore throat, cold spaghetti for a nighttime raid on the refrigerator to erase a trying day.Ms. Waldron teaches us how fasting cleanses and clears the decks of toxins. She analyzes one hundred foods, herbs, and spices that can actually heal bodies and even ward off certain diseases, from that now proverbial chicken soup rich in mother love to fruits and vegetables containing beta carotene, effective against some types of cancers. She offers age-old remedies for dozens of ills from migraines (the herb feverfew) to hayfever (stone fruits) to insomnia (a spoonful of molasses) to motion sickness (fresh ginger), and stomach cramps (anise).Throughout, there are more than 150 recipes, from cornbread to egg creams and the king of gumbos, that will let you keep those health-giving foods on hand.This is the book to curl up with when you're sick, when you're well, when you need to be advised and would love to be entertained. Maggie Waldron tells her stories and offers her advice with incomparable wit and charm. She'll probably make you feel as good as cold spaghetti at midnight tastes.",
        "Category": " Cooking , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Triumph of Evolution: and the Failure of Creationism",
        "Authors": "By Eldredge, Niles",
        "Description": "A curator in invertebrate paleontology at the American Museum of Natural History, Eldredge sets out and counters the arguments of conservative Christians against evolution and for divine creation. He describes their basic argument and their strategies for advancing it, the recent attack on philosophical naturalism, and models of intelligent design. He also disputes the claim that the study of evolution cannot be scientific and leads to a demise of family, religion, and traditional values. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Science , Life Sciences , Evolution",
        "Publisher": "W. H. Freeman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Eloise at the Wedding",
        "Authors": "By Lyon, Tammie (ILT), Knight, Hilary (ILT), and McNamara, Margaret",
        "Description": "Ooooooo, Eloise just loves weddings! And there's to be one at The Plaza. But when Eloise takes a peek at the bride, little does she know the surprise that awaits her!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "When in Florence",
        "Authors": "By Day, Richard Cortez",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The psychology of women",
        "Authors": "By Matlin, Margaret W.",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Saul and Patsy: A Novel",
        "Authors": "By Baxter, Charles",
        "Description": "1. How does the town of Five Oaks, Michigan figure as a character in the novel? How is it a particularly Midwestern town? How do the various town folk—whom Saul refers to as “rural Gentiles, connoisseurs of rifles, violence, and piety”—play into the narrative? Harold the barber, the local high school teachers and students, Mrs. O’Neil the lonely neighbor, the various students, Susan the bank teller, Brenda Gordy’s aunt? 2. 2. Saul and Patsy are definitely outsiders in this small Midwestern town. What sets Saul apart from the other inhabitants? Does his Jewishness play a role, or is this largely in Saul’s imagination? By the end, are they Midwesterners as well? 3. 3. Saul views himself as a missionary, “bringing education and the higher enlightenments to rural benighted adolescents.” What exactly is a missionary? Do you think Saul is one? Later in the novel when asked if he is going to stay in the Midwest, Saul responds, “I have to. I’m on a mission. We are.” What is this mission? Is it ultimately to save himself or others? And from what? 4. Discuss the relationship between Saul and Patsy. Compare and contrast them. Why is theirs such a fulfilled and satisfied relationship despite their different views on love? “In Saul, love took the form of desperation-to-share.” For Patsy, “she might have loved anybody, but it had turned out to be this man…there was certainly no logic to it.” What determines and then later threatens to undermine their marriage? What is the author saying of love? Describe the other marriages in the book, that of Saul’s parents, and the McPhees. 5. 5. How does having a child transform Saul and Patsy’s life? Do they change individually and/or as a couple? What do they learn about each other in the process of accepting a third person into their world, and growing from a couple into a family? 6. After meeting the McPhees, Saul “began to be obsessed with happiness” and realized “compared to others, he was, except for his marriage, actually and truly unhappy.” He becomes preoccupied with the McPhees and their happiness without really knowing much about their lives. Why the jealousy and obsession? 7. Saul and Patsy overflows with references to written words. Saul teaches writing at the local high school and later writes a newspaper column. Saul and Patsy adore Scrabble and crossword puzzles. Various authors are referred to and quoted. Saul writes on Patsy’s body. Gordy leaves notes for Saul. What is the importance of the written word in the novel? Give examples of the success and the failure of words in the novel. 8. Discuss the theme of betrayal in Saul and Patsy . What types of betrayal occur? What are the causes and consequences of them? Are the betrayals justified? Is anyone innocent? As a teacher, does Saul betray Gordy? As a brother, does Howie betray Saul? Does Patsy betray Delia? 9. Does Gordy Himmelman represent or symbolize something larger than himself, a troubled teen, to Saul and to the novel as a whole? What? Why is he obsessed with Saul, and why does he commit suicide in front of him? 10. 10. What does Saul learn about himself and his relationship with Patsy and his family through his experiences with Gordy? Through his experiences in Five Oaks? What does Patsy learn? 11. Why do you think the adolescents of Five Oaks react the way they do after Gordy Himmelman’s death? Is it indicative of Five Oaks, the Midwest, our society as a whole? Do you think the reaction is realistic? 12. Discuss the role and importance of the media and television in the novel. Is the author making a social commentary on the media and its omnipresence? 13. At various points throughout Saul and Patsy , characters invade other characters’ privacy. Give some specific instances of characters trespassing or spying on other characters. What is really going on in these situations? 14. Discuss the significance of the conclusion. Why does the novel end this way? What do you think is in the future for Saul and Patsy?",
        "Category": " Fiction , Literary",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Galloway's Book on Running (New and Revised)",
        "Authors": "By Galloway, Jeff",
        "Description": "",
        "Category": "",
        "Publisher": "Shelter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Its Time to Be Bold",
        "Authors": "By Smith, Michael W. and Haseltine, Dan (FRW)",
        "Description": "Michael W. Smith has seen with clarity the spriritual poverty and emotional numbness of teens who are out of touch with God's love. He writes, \"Somewhere along the way, I had forgotten what the real world was like. But something was starting to break inside of me. God began to renew a heart of compassion for the lost. From then on, I decided that if God was opening a door for me, I wasn't going to waste any time making up my mind about entering it.\"It's Time to Be Bold is a call to commitment for all believers, a personal and heartfelt cry rallying youth to follow Christ's example. Drawing from events in his own life, Michael dicusses with relevance the essential issues of living out extreme faith.Topics include:The importance of Christian friendsStanding stong against Satan's attacksUsing crises as stepping stones to deeper faithGetting into the Word and growing in a lifestyle of prayerAn Xt4J book",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Another Life: A Memoir of Other People",
        "Authors": "By Korda, Michael",
        "Description": "In the sequel to Charmed Lives, Michael Korda shares his reminiscences of forty years in book publishing, offering frank profiles of famous writers--from Harold Robbins to Tennessee Williams--as well as celebrities, stars, and other publishing figures. 60,000 first printing. Tour.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Kirsten on the Trail (American Girl Collection)",
        "Authors": "By Graef, Renee (ILT) and Shaw, Janet Beeler",
        "Description": "Nine-year-old Kirsten keeps her friendship with a Sioux Indian girl a secret until Kirsten's little brother becomes lost in the woods, in a short story that includes a section on Sioux Indians and a project related to the story.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Molly Takes Flight (American Girl Collection)",
        "Authors": "By Tripp, Valerie and Backes, Nick (ILT)",
        "Description": "Molly feels that everything in her life has changed when her father goes off to England to help wounded soldiers and her beloved aunt joins the Women's Airforce Service Pilots. Includes a section on women pilots in the armed services, and a project related to the story.Molly feels that everything has changed when her aunt joins the Women's Airforce Service Pilots, in a story with a section on women pilots in the armed services, and a project",
        "Category": " Juvenile Fiction , Historical , General",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "What Is Theatre: Incorporating the Dramatic Event, and Other Reviews, 1944-1967",
        "Authors": "By Bentley, Eric",
        "Description": "The contemporary drama critic discusses various aspects of American and international theater and criticizes the dramatic styles of specific playwrights and actors",
        "Category": "",
        "Publisher": "Limelight Editions",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "To Do Doing Done: A Creative Approach to Managing Projects & Effectively Finishing What Matters Most",
        "Authors": "By Wycoff, Joyce and Snead, G. Lynne",
        "Description": "To Do...Doing...Done!: A Creative Approach to Managing Projects and Effectively Finishing What Matters Most focuses on the skills required to manage any project without getting bogged down in conflicts or sidetracked by unexpected changes or developments.  In this book are proven techniques for bringing any project to a successful and satisfying conclusion. The techniques provided in To Do...Doing...Done! are based on Franklin Quest's highly successful Planning for Results seminar, which has boosted the productivity of thousands of employees in corporations across the country, as well as in Europe and Asia.",
        "Category": " Self-help , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "For the Beary Best Mom",
        "Authors": "By Regan, Patrick",
        "Description": "The Boyds Collection Ltd. includes more than 250 different irresistible teddy bears!From the cuddly, soft world of Boyds-the foremost authority on teddy bears-comes a simple gift book designed to show Mom how much she means.For the Beary Best Mom is the perfect present for Mother's Day, her birthday, or simply to say \"I love you.\" Mom will be sure to appreciate the thoughts and thoughtfulness in conjunction with the award-winning Boyds collection. An appropriate and meaningful thought is accompanied on each page by an adorable Boyds bear. Some of the sentiments include:*Your love was always the best medicine.*You were the first one to read me bedtime stories and snuggle me to sleep*I can't think of a time when you weren't there for me.*You were my very first love-and that's something that will never change.After all, Mom deserves the \"beary\" best!",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Lonely Planet Egyptian Arabic Phrasebook",
        "Authors": "By Wayne, Scott",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Living With Art",
        "Authors": "By Gilbert, Rita",
        "Description": "",
        "Category": " Art , Criticism & Theory",
        "Publisher": "Mcgraw-Hill College",
        "Price Starting With ($)": "12.18",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Yoga for Busy People",
        "Authors": "By Dawn Groves",
        "Description": "",
        "Category": "",
        "Publisher": "New World Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Union Square Cafe Cookbook: 160 Favorite Recipes from New York's Acclaimed Restaurant",
        "Authors": "By Meyer, Danny and Romano, Michael",
        "Description": "Union Square Cafe serves some of the most imaginative, interesting, and tasty food in America. The restaurant and its owners, Danny Meyer and chef Michael Romano, have been lauded for their outstanding food and superb service by Gourmet, Food & Wine, the New York Times, and the James Beard Foundation. Now its devoted fans from down the block and across the globe can savor the restaurant's marvelous dishes, trademark hospitality, and warm decor at home.Offered are recipes for 160 of Union Square Cafe's classic dishes, from appetizers, soups, and sandwiches to main courses, vegetables, and desserts. Hot Garlic Potato Chips, Porcini Gnocchi with Prosciutto and Parmigiano Cream, Grilled Marinated Fillet Mignon of Tuna, Herb-Roasted Chicken, Eggplant Mashed Potatoes, and Baked Banana Tart with Caramel and Macadamia Nuts are some of the all-time favorites included in this long-awaited collection.Union Square's recipes are easily mastered by home cooks. They call for ingredients that are widely available (mail-order sources are listed for those few that are not), employ familiar techniques, and take a reasonable amount of time to complete. Amateurs and pros alike will find the dishes here as accessible as they are irresistible.Beyond just providing recipes, The Union Square Cafe Cookbook inspires confidence in home cooks by sharing Michael Romano's tips for success. Readers learn that soaking baby onions in warm water makes them easier to peel (in the recipe for Sweet Peas with Escarole, Onions, and Mint); that the Corn and Tomatillo Salsa served with Polenta-Crusted Sea Bass also goes well with barbecued chicken or pork; that leftover Sautéed Spinach with Garlic makes a great sandwich filling; and that yesterday's sourdough bread should be kept for such soups and salads as Ribollita and Sourdough Panzanella. Danny Meyer's wine suggestions, inspired by the restaurant's remarkable cellar, accompany almost every recipe.The Union Square Cafe Cookbook does the rare job of capturing the bustling energy and ebullient enthusiasm of the restaurant itself and the spirited personalities—those of Danny and Michael—that drive it. Folks will still go out of their way to eat at Union Square Cafe, but this cookbook—filled with the restaurant's vitality, warm artwork, and tempting recipes—ensures that its pleasures are as close as your bookshelf.",
        "Category": " Cooking , Reference",
        "Publisher": "Ecco",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Learn Golf in a Weekend (Learn in a Weekend)",
        "Authors": "By Ballingall, Peter",
        "Description": "Covers rules, clubs, clothes, strategy, and etiquette, and demonstrates the techniques of driving, pitching, chipping, and putting",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Echinacea: The Immune Herb (Herbs and Health Series)",
        "Authors": "By Hobbs, Christopher",
        "Description": "",
        "Category": " Health & Fitness , Herbal Medications",
        "Publisher": "Interweave Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Multiple Streams of Income",
        "Authors": "By Allen, Robert G.",
        "Description": "Would you like multiple streams of lifetime income flowing into your life?If you answered \"YES!\", then you will profit from Robert G. Allens new book, Multiple Streams of Income. In these pages, the bestselling author of the #1 megahits Nothing Down and Creating Wealth will teach you how to create Multiple Streams of Lifetime Cash Flow. Youll learn 10 revolutionary new methods for generating over $100,000 a year–on a part-time basis, working from your home, using little or none of your own money.  Bestselling financial author and mentor Robert Allen has researched hundreds of income-producing opportunities and narrowed them down to 10 surefire moneymakers for the new millennium. Now, with his no-nonsense money book Multiple Streams of Income, Allen reports the overwhelming evidence of his findings. You will learn:How to retire wealthy on a dollar a day How to earn an extra million in your lifetimeThe 9 characteristics of the ideal home-based businessLow-risk ways to double your money in the stock market–FAST!9 ways to find super real estate bargains How to earn 18%, 36%, and up to 50% returns on your investments–guaranteed How to earn as much as $1,000 a day right from your own homeHow to profit from the Internet explosionHow to become an information multimillionaireHow to cash in on the secrets of intellectual propertyAnd much, much moreYoull learn how to make a fortune. Youll also learn how to keep it, using ingenious tax-sheltering strategies designed to help you keep much more of the wealth you create. Multiple Streams of Income is the result of a lifetime of research and experience in teaching thousands of people how to achieve financial freedom. And now its your turn. In this book, youll learn how one good deal can set you up for life.HERES WHAT SOME OF THE WORLDS MOST TRUSTED ADVISORS ARE SAYING ABOUT MULTIPLE STREAMS OF INCOME\"The whole idea of Multiple Streams of Income will be a powerful paradigm shift for most people. Bob Allen then gives practical and beautifully illustrated knowledge on how to do it. Mastering financial principles is an important habit in life because it gives us the freedom to focus on what matters most. A valuable read.\"–—Dr. Stephen R. Covey,Author of The 7 Habits of Highly Effective People\"If youre ready to have the money just keep rolling in, read Multiple Streams of Income by Robert Allen. Bob knows how to share his lifetime of learning, compressed in an easy-to-read, easy-to-absorb, and easy-to-use format.\"–—Jack Canfield and Mark Victor Hansen, Authors of the Chicken Soup for the Soul® series\"I have tremendous respect for Robert Allens ability to teach people how to make a lot of money. His latest book, Multiple Streams of Income, contains a wealth of information.\"–—Robert T. Kiyosaki, Author of Rich Dad, Poor Dad and CEO of Cash Flow Technologies\"Multiple Streams of Income is a wise investment! Robert Allen once again delivers us the simple and sound advice that quenches our thirst for healthy economic prosperity.\"–—Ken Blanchard, Coauthor of The One Minute Manager\"Multiple Streams of Income is an incredible book! You will learn more practical ideas to make money, keep the money you make and become financially independent in this book than in any other single source. It is a financial success bible for the twenty-first century.\"–—Brian Tracy, Author of The 100 Absolutely Unbreakable Laws of Business Success\"One idea that Robert Allen gave me added an additional stream of over $100,000 in our income. Think what 18 chapters full of innovative, no-nonsense strategies can do for you! Read Multiple Streams of Income and reap the harvest.\"–—Dr. Denis Waitley, Author of The Psychology of Winning",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Problems of Philosophy",
        "Authors": "By Russell, Bertrand",
        "Description": "Discusses historical approaches to such essential questions as appearance and reality, the nature of matter, and knowledge of universals",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1959"
        }
    },
    {
        "Title": "Entry-Level Life: A Complete Guide to Masquerading as a Member of the Real World",
        "Authors": "By Zevin, Dan",
        "Description": "Provides a humorous guide for new and recent college graduates to the challenging, sometimes frightening, frequently unnerving aspects of the real world after college, from apartment hunting to the acquisition of social graces. Original.",
        "Category": " Humor , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "I Feel Great And You Will Too: An Inspiring Journey Of Success With Practical Tips On How To Score Big In Life",
        "Authors": "By Croce, Pat and Lyon, Bill",
        "Description": "Passionate, spirited, and brimming with enthusiasm, Pat Croce is the former personal trainer who overcame odds and adversity to become president and part owner of the Philadelphia 76ers basketball team. Today he is one of the nation's top motivational speakers, eagerly sought by Fortune 500 companies and other organizations to share his winning attitude and the principles that have helped him steer a course to phenomenal achievement. I Feel Great and You Will Too! is at once Croce's incredible rags-to-riches story and a road map to realizing personal and professional goals for anyone wishing to apply his can-do keys to success. What People Are Saying: \"Pat's enthusiasm and positive outlook will inspire your everyday life.\" -Lance Armstrong \"This book will lead you down a path of inspiration and encouragement, offering many practical tools for capitalizing on all of your life experiences.\" -Michael Jordan \"...a fast, funny, candid, and intelligent read.\" -Bruce Willis \"Pat's fascinating journey breathes so much energy, vision, discipline, and passion that readers will, in turn, feel affirmed and empowered. A mother lode of common sense.\" -Steven R. Covey \"A great read from a fascinating man.\" Pat Croce tells his life story with the humor, honesty, and good sense that has long won him so many friends and admirers-a group I am lucky and proud to belong to. -Senator John McCain",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Tiger Woods Way: An Analysis of Tiger Woods' Power-Swing Technique",
        "Authors": "By Andrisani, John",
        "Description": "A complete guide to the perfect golf swing explains the fundamentals of grip, stance, aim, alignment, tempo, timing, and rhythm, examining the effective swing of superstar golfer Tiger Woods and illustrated with full-color action photographs and detailed, step-by-step drawings. 50,000 first printing.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "A Whole New Life",
        "Authors": "By Price, Reynolds",
        "Description": "Reynolds Price has long been one of America's most acclaimed and accomplished men of letters - the author of novels, stories, poems, essays, plays, and a memoir. In A Whole New Life, however, he steps from behind that roster of achievements to present us with a more personal story, a narrative as intimate and compelling as any work of the imagination.In 1984 a large cancer was discovered in his spinal cord (\"The tumor was pencil-thick and gray-colored, ten inches long from my neck-hair downward\"). Here, for the first time. Price recounts without self-pity what became a long struggle to withstand and recover from this appalling, if all too common, affliction (one American in three will experience some form of cancer). He charts the first puzzling symptoms; the urgent surgery that fails to remove the growth and the radiation that temporarily arrests it (but hurries his loss of control of his lower body); the occasionally comic trials of rehab; the steady rise of severe pain and reliance on drugs; two further radical surgeries; the sustaining force of a certain religious vision: an eventual discovery of help from biofeedback and hypnosis; and the miraculous return of his powers as a writer in a new, active life.Beyond the particulars of pain and mortal illness, larger concerns surface here - a determination to get on with the human interaction that is so much a part of this writer's much-loved work, the gratitude he feels toward kin and friends and some (though by no means all) doctors, the return to his prolific work, and the \"now appalling, now astonishing grace of God.\"A Whole New Life offers more than the portrait of one brave person in tribulation; it offers honest insight, realistic encouragement, and inspiration to others who suffer the bafflement of catastrophic illness or who know someone who does or will.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Ibsen's Plays II: Ghosts, An Enemy of the People & The Wild Duck (Cliffs Notes)",
        "Authors": "By Ibsen, Henrik",
        "Description": "Ibsen's plays are wide open to interpretation, yet his absurd expression of human analysis stimulates and enlightens. These Cliff's Notes are ideally used as a basis for critical dialogue, to help amplify the reader's comprehension and appreciation of his plays, which are highly absurd, abstract, and yet filled with noble ideas and the struggle inherent in human existence.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1965"
        }
    },
    {
        "Title": "Jeremy's Decision",
        "Authors": "By Martchenko, Michael (ILT) and Brott, Ardyth",
        "Description": "When Jeremy grows up he does not want to be a famous orchestra conductor like his father, and one day he gets the courage to tell everyone his real ambition",
        "Category": "",
        "Publisher": "Kane Miller Book Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Carbohydrate Addict's Cookbook: 250 All-New Low-Carb Recipes That Will Cut Your Cravings and Keep You Slim for Life",
        "Authors": "By Heller, Richard F.",
        "Description": "#1 New York Times bestselling authors of The Carbohydrate Addict?s LifeSpan Program and The Carbohydrate Addict?s DietLose weight and cut your cravings with the first cookbook from the world?s #1 authorities on carbohydrate addiction and weight lossWith 250 all-new mouthwatering low-carb recipes from Drs. Richard and Rachael Heller, the #1 New York Times bestselling authors and pioneers in carbohydrate-smart dieting, it is now easier than ever to shed those extra pounds permanently. Unlike many low-carb and low-fat cookbooks, which skimp on taste, The Carbohydrate Addict?s Cookbook seizes on the dynamic flavors of a rich crop of foods, from tasty appetizers and hearty soups to succulent seafood and sinfully delicious salads, from vegetarian alternatives to traditional, down-home beef and poultry dishes and easy-to-make breakfasts. With a special section on \"Quick Fix Dishes and Snacks,\" this is the one low-carb cookbook you will rely on every day.?Herbed Cheese Dip ? Hearty Breakfast Quiche ? Mushrooms AllegroDijon Creme in Salmon Rolls ? Curried Eggs ? Baked Buffalo Wings?Beefy Cream Cheese Roll-Up ? Breakfast Delhi Delight ? Peking Stir-Fried Beef?Far East Beef Teriyaki ? Paprika Pork Chops ? Shanghai Pork Roast ? Spicy Chicken?Chicken Breast Apollo ? Country Baked Chicken ? Chicken in Cream Sauce?Crustless Chicken Pot Pie ? Breakfast Pockets ? Island Lime Chicken?Curried Basil Chicken ? Baked Salmon with Herbs ? Bounty of the Sea?Steamed Mussels Peppercorn ? Cheesy Broccoli Casserole ?Manhattan Mushroom Salad ? Far East Tofu?\"Ham\" and Cheese with Tofu ? Parsley Buttered \"Steaks\"",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Ultimate Rose Book: The Complete Guide to Growing, Decorating and Creating Beautiful Gifts with Roses",
        "Authors": "By McHoy, Peter",
        "Description": "",
        "Category": " Crafts & Hobbies , Flower Arranging",
        "Publisher": "Anness",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Step By Step, Cooking for One & Two",
        "Authors": "By rosemary-wadey",
        "Description": "",
        "Category": "",
        "Publisher": "Shooting Star Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Cheesecake Madness",
        "Authors": "By Segreto, John J.",
        "Description": "Gives recipes for a hundred kinds of baked and refrigerator cheesecakes and includes tips on producing the best results with each variety",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "The Great Big Elephant and the Very Small Elephant",
        "Authors": "By Seuling, Barbara",
        "Description": "Despite the predicaments encountered in each of three stories, Great Big Elephant and Very Small Elephant demonstrate the humor and mutual understanding that characterize their warm friendship",
        "Category": "",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "Blossoms of Friendship",
        "Authors": "By Rice, Helen Steiner",
        "Description": "",
        "Category": " Poetry , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Breakaway (Space 1999, #1)",
        "Authors": "By E. C. Tubb",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "August",
            "Year": "1975"
        }
    },
    {
        "Title": "Indian Sign Language (Native American)",
        "Authors": "By Tomkins, William",
        "Description": "Plains Indians from different tribes speaking different languages were nevertheless able to communicate facts and feelings of considerable complexity when they met. They used a language composed of gestures made almost entirely with the hands and fingers, probably the most highly developed gesture language to be found in any part of the world.With this book, you will find it simple to use this language, which the author learned in the late nineteenth and early twentieth centuries, principally from Sioux Indians in Wyoming. Drawings and short descriptions make clear the proper positions and motions of the hands to convey the meaning of over 870 alphabetically arranged common words — hungry, camp, evening, angry, fire, laugh, owl, cat, many times, brave, cold, heart, rain, spotted, together, river, etc. The words are then used in sample sentences. There are also brief sections on the pictography and ideography of the Sioux and Ojibway tribes, and on smoke signals.This is a book for anyone who wants to learn or teach Indian sign language — scouts, school teachers, camp counselors, scout leaders, parents, linguists, and students of Indian culture. To help counselors and teachers, the last chapters give instructions on how to conduct the Indian ceremony for opening a council fire, an Indian initiation ceremony, and suggestions for sign language tests and exercises.",
        "Category": " Juvenile Nonfiction , Games & Activities , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1969"
        }
    },
    {
        "Title": "Dead to rites",
        "Authors": "By Angus, Sylvia",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Wedding: A Novel",
        "Authors": "By West, Dorothy",
        "Description": "In her final novel, Dorothy West offers an intimate glimpse into African American middle class.  Set on bucolic Martha's Vineyard in the 1950s, The Wedding tells the story of life in the Oval, a proud, insular community made up of the best and brightest of the East Coast's black bourgeoisie.  Within this inner circle of \"blue-vein society,\" we witness the prominent Coles family gather for the wedding of the loveliest daughter, Shelby, who could have chosen from \"a whole area of eligible men of the right colors and the right professions.\" Instead, she has fallen in love with and is about to be married to Meade Wyler, a white jazz musician from New York. A shock wave breaks over the Oval as its longtime members grapple with the changing face of its community.With elegant, luminous prose, Dorothy West crowns her literary career by illustrating one family's struggle to break the shackles of race and class.",
        "Category": " Fiction , African American , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Paris One: A novel",
        "Authors": "By Brady, James",
        "Description": "",
        "Category": "",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "InDesign 2 for Macintosh and Windows",
        "Authors": "By Cohen, Sandee",
        "Description": "If you work in page-layout programs -- whether you're transitioning fromQuark or PageMaker, or just getting started using InDesign, you'll want tohave a copy of \"InDesign 2 for Windows and Macintosh: Visual QuickStartGuide\" as your resource of choice.Adobe InDesign 2.0 is coming of age -- it offers new features such as truetransparency, table creation, long document support, indexing, a superior printing interface,and native Mac OS X support. The program's tighter integration with other Adobe products enables graphic designers, production artists, and prepress professionals to exercise design innovation and improve productivity. This cross-platform, visual guide introduces you to the InDesign interface, including the tools and palettes, how to create and navigate a document, import and style text and objects, automate your work, manage longdocuments, use the Bezier pen tools, and work with color. More advancedtopics, such as advanced text control and preflighting are also covered.Sandee Cohen has been training in the field of desktop publishing for the past 12 years. The graphics curriculum instructor for the New School Computer Instruction Center in New York City, she is a lively speaker at many conferences, including Seybold Seminars, Macworld Expo, and Thunder Lizardevents. In addition to InDesign, she is the author of Visual QuickStartGuides on Fireworks and FreeHand..",
        "Category": " Computers , Electronic Publishing",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Writing a Research Paper: A Step-By-Step Approach",
        "Authors": "By Goldenberg, Phyllis",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "William H Sadlier",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Dans La Rue Ou Vit Celle Que J'Aime (Collections Litterature) (French Edition)",
        "Authors": "By Higgins Mary, Clark",
        "Description": "",
        "Category": "",
        "Publisher": "Albin Michel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Michele Gerbrandt's Scrapbook Basics",
        "Authors": "By Gerbrandt, Michele",
        "Description": "Welcome to the world of creative scrapbooking!If you are new to the art and hobby of scrapbooking, you may be confused as to how and where to begin. This book has been created to set you on the path to a lifetime of scrapbooking enjoyment.You'll learn:The meaning of scrapbooking termsHow to organize photos and memorabiliaWhat you need to get startedHow to identify \"safe\" scrapbook productsHow to use scrapbook tools and suppliesThe page-making and album-making processesHow to preserve and safely display memorabiliaTips to help you tell the stories behind your photosWhere to go for scrapbooking information, ideas and more!You have so many special memories to preserve and stories that are just waiting to be told. Learn tips from the scrapbook pro herself, Michele Gerbrandt, founder of Memory Makers magazine - The First Source for Scrapbook Ideas. This book eliminates the guesswork from scrapbooking!",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Memory Makers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "In Radical Pursuit: Critical Essays and Lectures",
        "Authors": "By Snodgrass, William Dewitt",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Healing with Vitamins",
        "Authors": "By Feinstein, Alice (EDT) and Prevention Magazine Health Books (EDT)",
        "Description": "There's an explosion of new research showing that individual nutrients do everything from preventing and curing disease to holding back the aging process.Vitamins and minerals can ease the pain and inflammation of arthritis. They can help burns and other wounds heal faster. They can help women get through menopause and help men stay sexually vital on into their later years. Vitamins and minerals can help prevent recurring headaches and ease symptoms of the common cold. They can protect you from heart disease and the damage that comes from high cholesterol. They can help preserve your memory and help keep your skin smooth as you age...Does all of this sound a little too good to be true?Well, it all comes from top doctors and researchers around the nation. Over the past few years, they've made incredible leaps forward in understanding how to use common vitamins and minerals for healing. All that new knowledge is presented in this book in easy-to-use format.The editors of this book spent two years reviewing studies and interviewing hundreds of researchers to answer your vital questions about how to use vitamins and minerals to prevent and cure disease.",
        "Category": " Health & Fitness , Diet & Nutrition , Vitamins",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Understanding the Dead Sea Scrolls: A Reader From the Biblical Archaeology Review",
        "Authors": "By Shanks, Hershel (EDT)",
        "Description": "A groundbreaking anthology that demolishes the myths -- and reveals the true significance -- of the greatest archaeological discovery of our time.Ever since their initial discovery in 1947, the Dead Sea Scrolls have aroused excitement, jealousy, and not a little dread among some who feared their contents might undermine the foundations of Judaism and Christianity. For more than 35 years the majority of scroll texts remained the intellectual property of an exclusive coterie of scholars. Recently, however, the Biblical Archaeology Review succeeded in breaking that monopoly.This path-clearing volume is an illuminating assessment of what these texts reveal about a lost era in the history of two world religions, Christianity and rabbinic Judaism. Were the Dead Sea Scrolls written by the Essenes, an ascetic sect of Jews that may have included John the Baptist among its members? Is the Copper Scroll a secret map to the treasures of the Jerusalem Temple? In what way do these books prefigure the teachings of early Christianity? Additional chapters address the controversies surrounding the Scrolls' discovery and their long suppression -- including the possible role of the Vatican and charges of anti-Semitism on the part of a former chief editor of the official scroll publication team.",
        "Category": " Religion , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Twenty Questions for the Writer",
        "Authors": "By BERKE",
        "Description": "",
        "Category": "",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Bicycle Days",
        "Authors": "By Schwartz, John Burnham",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Guilt Is the Teacher, Love Is the Lesson: A Book to Heal You, Heart and Soul",
        "Authors": "By Borysenko, Joan",
        "Description": "From the bestselling author of Minding the Body, Mending the Mind: an accessible guide to healing the destructive effects of guilt. The reaction by parents, teachers, and peers to our own actions often determines our sense of self--how confident we feel and how secure we are about our place in the world. When self-blame and pessimism begin to overtake self-esteem and optimism, the result may be emotional, physical, and spiritual distress. In Guilt Is the Teacher, Love Is the Lesson, Dr. Joan Borysenko, a Harvard Ph.D., explores this mind/body connection as she offers personal and professional advice for journeying toward recovery and self-love. Here at last is an insightful and uplifting approach for turning the teachings of guilt into the lessons of love.",
        "Category": " Self-help , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Clutter Be Gone: Cleaning Your House the Easy Way",
        "Authors": "By Aslett, Don",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Betterway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Elizabeth R",
        "Authors": "By Jay, Antony",
        "Description": "",
        "Category": "",
        "Publisher": "McClelland & Stewart Ltd",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Guerrilla Marketing",
        "Authors": "By Levinson, Jay Conrad",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Freedom and Reform: Essays in Honor of Henry Steele Commager -1st Edition/1st Printing",
        "Authors": "By Hyman, Harold M. and Leonard W. Levy (editors)",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row Publishers",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Steady On (The Artists Devotional Series)",
        "Authors": "By Point of Grace and Jones, Denise (EDT)",
        "Description": "The music of Point Of Grace has reached millions of hearts. Their concerts are consistently sold out; their audience grows every year. Now, in this beautiful devotional book, they reveal more of their personal faith, insights, struggles, and relationship with the God who has given them their talents and their dynamic ministry.   Using the lyrics from their most popular songs, along with selections from their newest Word Record release, these four tremendously talented women -- Denise, Shelley, Heather, and Terry -- take readers on a quest to grow closer to the Savior and firmer in the faith. They draw on their own vast experiences, discoveries, disappointments, and heartaches to display God as the Father, Friend, Savior, and Lord who loves us and longs to be close to us every day.",
        "Category": " Religion , Devotional",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Mad's Dave Berg Looks At Things",
        "Authors": "By Dave Berg (Author), Albert B. Feldstein (Editor), and Jerry De Fuccio (Foreward)",
        "Description": "",
        "Category": "",
        "Publisher": "New American Library",
        "Price Starting With ($)": "10.39",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "King Arthur and the Knights of the Round Table",
        "Authors": "By Berthelot, Anne",
        "Description": "Examines the historical and mythological figure of King Arthur and explores the legends and literary tradition surrounding Arthur and the Knights of the Round Table",
        "Category": " Fiction , Fairy Tales, Folk Tales, Legends & Mythology",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Way of Faith",
        "Authors": "By Sizoo, Joseph Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Brothers",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1935"
        }
    },
    {
        "Title": "Magic of Conflict: Turning a Life of Work Into a Work of Art",
        "Authors": "By Crum, Thomas F.",
        "Description": "Gives techniques for transforming conflict into an opportunity for choice and change and how to grow beyond the striving competitiveness, and pressure of personal and professional life",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "How to Buy and Manage Rental Properties: The Milin Method of Real Estate Management for the Small Investor",
        "Authors": "By Milin, Irene and Milin, Mike",
        "Description": "Mike and Irene Milin are the world's most successful couple in real estate education, the \"Dynamic Duo\" whose amazing sellout seminars in real estate management have shown thousands across the country how to find, purchase, and rent properties -- and let their tenants do the work!  Now the Milins have put their practical, time-tested techniques into a book, How to Buy and Manage Rental Properties. They show you how to use the Milin Method to avoid problems and expenses while keeping the money coming in -- the Milin promise is financial freedom in two to three years! How to Buy and Manage Rental Properties will show you how you can get tenants involved in the maintenance of your rental properties -- the remarkable \"hands-off\" strategies that put your properties on auto pilot, leaving you the time to achieve more as a real estate entrepreneur. Their program covers in detail all aspects of buying, financing, maintaining, and renting properties, including:  * Managing people, not property * Buying right to manage right * Rental interviews and agreements * Keeping good tenants, and getting rid of bad ones * Bookkeeping, taxes, and property tracking * Real estate agents and property sales * Equity sharing and partnerships  It's all here in a guide you can easily read and refer to -- the best, most comprehensive program of buying and rental techniques ever developed, detailing sound and sensible ways to protect your investments and get the most out of your properties with the least trouble.",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Succulent Wild Woman",
        "Authors": "By Sark",
        "Description": "This book is my glowing invitation to you—to live a rich, succulent life!I explore love, sexuality, romance, money, fat, fear and creativity. It's a little bit like reading my diary -- with permission. Succulence is powerFull! and so are we as women.",
        "Category": " Humor , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Last Siege",
        "Authors": "By Stroud, Jonathan",
        "Description": "When three lonely teenagers--Emily, Simon, and the enigmatic Marcus--break into the forbidden interior of the keep of a castle in an attempt to feel the power of occupation, their playful re-enactment unexpectedly plunges them into a nightmare. Original.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Astonishing Adventures of Fanboy and Goth Girl",
        "Authors": "By Lyga, Barry",
        "Description": "A School Library Journal Best Book of the Year *“Fanboy’s whip-smart, often hilariously sarcastic voice . . . adds fresh, urgent perspective to age-old questions about how young people cope with . . . being misunderstood as they try to discover themselves.” —Booklist, starred review “A captivating, darkly entertaining first novel.” —Tom Perrotta, author of Election and Little Children Fanboy has never had it good, but lately his sophomore year is turning out to be its own special hell. The bullies have made him their favorite target, his best (and only) friend seems headed for the dark side (sports and popularity), and his pregnant mother and the step-fascist are eagerly awaiting the birth of the alien life form known as Fanboy’s new little brother or sister. Fanboy, though, has a secret: a graphic novel he’s been working on without telling anyone, a graphic novel that he is convinced will lead to publication, fame, and—most important of all—a way out of the crappy little town he lives in and all the people that make it hell for him. When Fanboy meets Kyra, a.k.a. Goth Girl, he finds an outrageous, cynical girl who shares his love of comics as well as his hatred for jocks and bullies. Fanboy can’t resist someone who actually seems to understand him, and soon he finds himself willing to heed her advice—to ignore or crush anyone who stands in his way.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Baltasar and Blimunda",
        "Authors": "By Saramago, Jose and Pontiero, Giovanni (TRN)",
        "Description": "From the recipient of the 1998 Nobel Prize in Literature, a “brilliant...enchanting novel” (New York Times Book Review) of romance, deceit, religion, and magic set in eighteenth-century Portugal at the height of the Inquisition.  Portugal, 1711: an amorous friar is pursued naked through the rubble-strewn streets of Lisbon; an enthusiastic procession of flagellants roars with pleasure over the damnation of adultery; a royal prince uses hapless sailors for target practice; and women dressed in colorful finery watch as lapsed converts and sorcerers are put to death by flames. In the midst of the terrors of the Inquisition and the plague, a seemingly mismatched couple discover the wonders of love. This poetic tale, graced with exquisite historical details and full of magic and adventure, is a tapestry of human folly and human will.",
        "Category": " Fiction , Literary",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Later Life",
        "Authors": "By A. R. Gurney",
        "Description": "",
        "Category": "",
        "Publisher": "The Fireside Theatre",
        "Price Starting With ($)": "10.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Pride and Prejudice (The World's Classics)",
        "Authors": "By Austen, Jane",
        "Description": "Human foibles and early-nineteenth-century manners are satirized in this romantic tale of country English family life",
        "Category": " Fiction , Literary",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Looking for Peyton Place: A Novel",
        "Authors": "By Delinsky, Barbara",
        "Description": "For Annie Barnes, going home to Middle River means dealing with truths long hidden, some of which she buried there herself. But it is a journey she knows she must take if she is to put to rest, once and for all, her misgivings about her mother's recent death.To an outsider, Middle River is a picture-perfect New Hampshire town. But Annie grew up there, and she knows all its secrets - as did her idol Grace Metalious, author of the infamous novel Peyton Place, which laid a small town's sexual secrets bare for all the world to see. Though Grace actually lived in a nearby town, the residents of Middle River have always believed she used them as the model for her revolutionary novel, and some even insist Annie's grandmother was the model for one of Grace's most scandalous characters. With these rumors and whispers about Peyton Place haunting her childhood, Annie came to identify so closely with the author that it was Grace and her bold rebellion against 1950s conformity that inspired Annie to get out of Middle River and make a life for herself in Washington, D.C.It's been a good life, too. Annie Barnes is now a bestselling author, reaching that level with only her third novel. Success has given her a confidence she never had as a young girl in Middle River - and it has given the residents of that town something new to worry about. When they hear Annie is returning for a lengthy visit, everyone, including Annie's two sisters, believes she's coming home to write about them.Though amused by the discomfort she causes in Middle River, Annie has no intention of writing a novel about the town or its people. It is her mother's death - under circumstances that don't quite add up - that has brought her back, and soon her probing questions start to make people nervous. When she discovers evidence of dangerous pollutants emanating from the local paper mill - poisons that she comes to believe contributed to her mother's fatal illness - Annie finds herself at odds with most of the town's inhabitants, including her sisters, both of whom are seemingly unfazed by the incriminating evidence she uncovers. Because the mill is the town's main employer, everyone is afraid of what might happen if Annie digs deeper, and their fears soon start to turn ugly.For Annie, though, there is no turning back, as passion and rage propel her forward in a determined quest. Coming face-to-face with decades of secrets and lies, she knows she must find the strength to move beyond the legacy of Grace Metalious, defying her past to heal the wounds of the town and her own family.",
        "Category": " Fiction , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Holy Vote: The Politics of Faith in America",
        "Authors": "By Suarez, Ray",
        "Description": "The Holy Vote examines the way Americans worship, how organized religion and politics intersect in America, and how this powerful collision is transforming the current and future American mind-setNot since the Civil War has the United States been sopolarized—politically and ideologically. But at the very heart of this fracture is a fascinating rig and paradoxical marriage between our country’s politics and religions.Over the past several election cycles, the differences between so-called \"Red America\"—conservative, church-affiliated, suburban, and rural—and \"Blue America\"—urban, secular, and socially liberal—have hardened. Although on most days, these two big American mainstreams move on parallel tracks, they increasingly find themselves head to head, ready to fight at the slightest offense. They react to new stories in different ways. They react to government power in different ways. They certainly vote in different ways. With The Holy Vote, Ray Suarez explores the advent of this polarization and how it is profoundly changing the way in which we live our lives. With hands-on reporting, Suarez explores the attitudes and beliefs of the people behind the voting numbers, the places in which these new beliefs are being born, and how the political divide is manifesting itself across the country. The reader will come to a greater understanding of how Americans believe, and how this belief structure fuels the debates that dominate the issues on our evening news.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Rayo",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Blood of Angels: A Novel",
        "Authors": "By Arvin, Reed",
        "Description": "Reed Arvin's previous novel, The Last Goodbye, was \"the best thing a thriller can be: suspenseful, intelligent, and well written\" (Harlan Coben), and had the critics raving: People magazine stated, \"You'll be hooked,\" and the New York Times declared it \"sultry, devious, adrenaline-boosting suspense.\" Now comes a vivid and haunting tale of one man's search for the truth -- no matter what the consequences.Thomas Dennehy, senior prosecutor in Davidson County, Tennessee, doesn't recognize Nashville anymore: a decade of relentless immigration means cops are learning Spanish, and the DA' s office is looking for Vietnamese translators. Thomas's latest case is prosecuting Moses Bol, a Sudanese refugee who faces the death penalty for killing a white woman in the Nations, a notorious, racially charged part of town. Bol's conviction seems certain, until a university professor claims Thomas sent the wrong man to the death chamber in a previous case. The DA' s office is rocked to its core, but within days another blow falls: a beautiful and brilliant anti-death penalty activist mysteriously surfaces as Bol's alibi, claiming she was with him at the time of the crime. Bol's case becomes a lightning rod as protesters on all sides converge on Nashville and tensions threaten to explode.Meanwhile, Bol's alibi has her own secrets -- and is terrified of someone working behind the scenes to get what he wants -- even if it means murder.Will Dennehy be able to piece things together before everything he believes about the law, and about justice, is torn apart?Vivid with the emotional complexity that has become the hallmark of Reed Arvin's work,Blood of Angels is filled with nonstop action, impeccable detail, and unforgettable characters, making this a novel that is impossible to resist.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The last will and testament of George Washington and schedule of his property to which is appended the last will and testament of Martha Washington",
        "Authors": "By Washington, George",
        "Description": "",
        "Category": "",
        "Publisher": "Mount Vernon Ladies Association of the Union",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "Charge!: History's Greatest Military Speeches",
        "Authors": "By Israel, Steve (EDT)",
        "Description": "One of the leading voices on national security issues in the U.S. Congress demonstrates how words have been sharp and powerful weapons of victory in this compilation of great military speeches that helped turn the tide of history. Among the dozens of inspirational speeches featured are: Moses instructing his followers to cross the Jordan River without him. . . Queen Elizabeth pledging to die with her soldiers as they faced the Spanish Armada. . . Patrick Henry choosing between liberty and death. . . Napoleon exhorting his troops as they marched on Egypt. . . Winston Churchill rallying his nation to victory. . . General Sir Montgomery refusing to retreat from Rommel. . . President Roosevelt preparing the American people for World War II. . . General Eisenhower fortifying his troops for the invasion of Normandy. . . President Reagan demanding that Gorbachev tear down the Berlin Wall. . . President George W. Bush encouraging America after 9/11. . . and more.Congressman Israel has included speeches that have motivated and mobilized, challenged and comforted. Some were blurted in the heat of combat, others were carefully written in places far removed from the brutality of the battlefield, but all will inspire readers with the courage that moved people forward against all odds. Each speech is introduced with an insightful historic context. This dramatic sweep of military history in the words of history's military leaders serves to reinforce the concept that the pen is mightier than the sword.",
        "Category": " History , Military , General",
        "Publisher": "Naval Institute Press",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "July",
            "Year": "2013"
        }
    },
    {
        "Title": "How to Have a XXX Sex Life: The Ultimate Vivid Guide",
        "Authors": "By Anderson, Dan, Vivid, Girls, and Berman, Maggie",
        "Description": "The biggest names in adult entertainment lend their erotic experience and knowledge to a comprehensive guide to 'making love like a star'.Who is better qualified to share their sexual secrets than people who spend every day perfecting their lovemaking technique? Drawing from their extensive experience both on camera and off, the wildly popular and incredibly hot Vivid Girls—along with male star Bobby Vitale and the legendary adult filmmakers Paul Thomas, Justin Sterling, and ChiChi LaRue—provide hundreds of provocative sex tips for at-home amateurs who want to create exciting new sexual scenarios and incorporate the element of fantasy into their sex life. Whether you want to improve your oral sex skills, bring toys to bed, or simply try out a new position or 20, the Vivid panel of experts is here to help make your erotic productions the award-winning creations they deserve to be. After the basics of seduction and setting the scene, they cover detailed technical lovemaking tips. By the end of the book, you might be ready for 'advanced' techniques, including multiple orgasms, multiple partners, anal sex, and more. Whatever you choose to use, or leave to the realm of fantasy, all of it is designed to help you and your partner have the most satisfying sex ever.Take your sex life to a higher level—to a place where inhibitions fall away and creativity and a sense of adventure flourish!",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Prickly Pig",
        "Authors": "By McClure, Gillian",
        "Description": "",
        "Category": "",
        "Publisher": "E. P. Dutton",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1980"
        }
    },
    {
        "Title": "Fun With Clay",
        "Authors": "By Joseph Leeming~Jessie B. Robinson",
        "Description": "",
        "Category": "",
        "Publisher": "J.B. Lippincott Co",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1944"
        }
    },
    {
        "Title": "Unto This Hour",
        "Authors": "By Wicker, Tom",
        "Description": "A fictional account of the August, 1862, Civil War battle of Second Manassas--or Second Bull Run--interweaves the lives of the famous and the ordinary in a drama of death, victory, survival, and defeat",
        "Category": " History , United States , General",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Good Mornings",
        "Authors": "By McLaughlin, Michael",
        "Description": "Start the day off right with Good Mornings. Whether you prefer to delight family and friends with a light breakfast or an elaborate brunch, in Good Mornings you'll find a tempting array of dishes - many of which can be easily prepared in advance.From old-fashioned favorites to bold contemporary flavors, Good Mornings features over eighty recipes for homemade cereals, pancakes, and waffles; egg, meat, and fish entrees; muffins and rolls; beverages; and refreshing fruit treats.Complete with detailed make-ahead notes and illustrated with vibrant, full-color photographs, the recipes in Good Mornings are well worth waking up to.",
        "Category": " Cooking , Courses & Dishes , Brunch & Tea Time",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Men and Apes",
        "Authors": "By Morris, Desmond and Morris, Ramona",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Landscape (Hometime How-To Series)",
        "Authors": "By Johnson, Dean, Hartl, Robin, Price, Pamela S. (EDT), Price, Pamela S., and Kelsey, John (EDT)",
        "Description": "",
        "Category": " Gardening , Landscape",
        "Publisher": "Hometime",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "ShrinkLits: Seventy of the World's Towering Classics Cut Down to Size",
        "Authors": "By Sagoff, Maurice",
        "Description": "From Antigone to Lolita, from Beowulf to The Hobbit. The world's greatest literature is summarized in Maurice Sagoff's hilarious light verse. The result-70 intoxicating distillations of the classics everyone has been taking far too seriously for far too long. Selection of the Quality Paperback Book Club and aNew York Times Best Seller. 180,000 copies in print.",
        "Category": " Poetry , American , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Coriolanus (Signet Classics)",
        "Authors": "By Shakespeare, William and Brower, Reuben Arthur (EDT)",
        "Description": "The Signet Classics edition of Shakespeare's powerful tragedy of divided politics. One of the Bard’s final tragedies, this is the story of an Ancient Roman soldier whose political machinations and military might gain him heroic status, but ultimately lead to his assassination.This revised Signet Classics edition includes unique features such as:• An overview of Shakespeare's life, world, and theater • A special introduction to the play by the editor, Reuben Brower • Selections from Plutarch's Lives of Noble Grecians and Romans, the source from which Shakespeare derived Coriolanus • Dramatic criticism from A. C. Bradley, Wyndham Lewis, D. A. Traversi, and others • A comprehensive stage and screen history of notable actors, directors, and productions • Text, notes, and commentaries printed in the clearest, most readable text • And more...",
        "Category": " Literary Criticism , Shakespeare",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Child of Flame (Crown of Stars, Vol. 4)",
        "Authors": "By Elliott, Kate",
        "Description": "In the sequel to The Burning Stone, Alain becomes caught in the middle of an ancient conflict between humankind and the Cursed Ones, while Liath is kidnapped by strange alien creatires and forced into a difficult trial in a land of exile, and Sanglant, mourning the loss of his wife, Liath, struggles to warn King Henry of a deadly conspiracy of sorcerers.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "DAW Hardcover",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Adams Streetwise Small Business Start-Up: Your Comprehensive Guide to Starting and Managing a Business",
        "Authors": "By Adams, Bob",
        "Description": "Packed with information, illustrations, graphs, forms, and worksheets, the Streetwise “RM” books provide everything business-people need to get up and running in the fast lane. Readers benefit from the expert advice of seasoned professionals in all areas of business, from motivating employees to marketing, building website traffic to financing.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "JavaScript for the World Wide Web, Fourth Edition",
        "Authors": "By Negrino, Tom and Smith, Dori",
        "Description": "Discusses integration of the JavaScript programming language to add interactivity to web pages with scripts for such tasks as navigation, form validation, cookie management, frame creation, and event handling.  The fourth edition expands explanations of HTML in the sidebars. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Programming , Games",
        "Publisher": "Peachpit Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Hunt for Bin Laden: Task Force Dagger",
        "Authors": "By Moore, Robin",
        "Description": "“As the [al-Qaida terrorists] charged one wall, three Green Berets leaned over the parapets, oblivious to the enemy small-arms fire that was cracking by their heads and shoulders.“ ‘Focus, squeeze, focus, squeeze,’ they recited quietly. . . . Each time . . . the lifeless body [of an al-Qaida terrorist] would snap back through the desert air and drop onto the sandy courtyard.”The war in Afghanistan was the most secret conflict since the CIA’s covert war in Laos; thousands of journalists covered it, yet, ironically, little is known about how it was waged or what really happened—until now.The Hunt for bin Laden plunges the reader into America’s War on Terror, from the first top-secret meetings of TASK FORCE DAGGER in Tampa on the afternoon of September 11, 2001, through the liberation of Kabul sixty-two days later and the tragedies of OPERATION ANACONDA. The book takes the reader into the heat of battle—as seen through the eyes of the Green Berets on the ground. This is the story of how only a few hundred men, operating from a secret Special Forces base, changed the course of history in Central Asia and destroyed a hundred-thousand-man terrorist army in less than ninety days.Action-packed and controversial, The Hunt for bin Laden is teeming with revelations and inside information: the truth about John Walker Lindh and Mike Spann; the failure of the “conventional” generals; the courage of the Northern Alliance; the wounding and murder of journalists; and the flaws and frustrations of the hunt for bin Laden himself.In mid-December 2001, Robin Moore arrived in Afghanistan, where he joined his old friends, whom he had celebrated thirty-five years earlier in his book The Green Berets  and who were now calling in airstrikes and fighting alongside the armies of the Northern Alliance against the terrorist al-Qaida and Taliban. In less than three winter months, about a hundred Green Berets accounted for the deaths of perhaps as many as forty thousand terrorists and the winning of a war in Afghanistan—where the Soviets had found fighting a war all but impossible.",
        "Category": " Political Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The God We Never Knew: Beyond Dogmatic Religion to a More Authentic Contemporary Faith",
        "Authors": "By Borg, Marcus J.",
        "Description": "How to have faith—or even think about God—without having to stifle modern rational thought is one of the most vital challenges facing many of us today. Marcus J. Borg, author of the bestselling Meeting Jesus Again for the First Time, traces his personal spiritual journey to the discovery of an authentic yet fully contemporary understanding of God. In a compelling, readable way, he leads us from the distant, authoritarian God of our childhood to an equally powerful, dynamic adult image of God—\"the beyond in our midst,\" the life spirit that is within us and all around us—that reconciles faith with science, history, critical thinking, and religious pluralism.",
        "Category": " Religion , Spirituality",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "To Gather the Wind (Wayward Wind Series/Bodie Thoene, Bk 2)",
        "Authors": "By Thoene, Bodie and Thoene, Brock",
        "Description": "This adventurous novel of danger and romance takes readers out to the old West with heart-stopping action and colorful characters. The second book in The Wayward Wind series.",
        "Category": " Fiction , Historical",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Killing Mister Watson",
        "Authors": "By Matthiessen, Peter",
        "Description": "The arrival of Edgar J. Watson, a complex man with a troubling and violent reputation, spells trouble for the inhabitants of the nineteenth-century Everglades, in a recreation of the life and death of a real-life character",
        "Category": " Fiction , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Not Out Of Africa: How \"\"Afrocentrism\"\" Became An Excuse To Teach Myth As History",
        "Authors": "By Lefkowitz, Mary",
        "Description": "Was Socrates black? Did Aristotle steal his ideas from the library in Alexandria? Do we owe the underlying tenets of our democratic civilization to the Africans? Hardly a week goes by when an article does not appear in a newspaper or magazine by an Afrocentrist writer making such allegations. But so far, no one has responded fully to these Afrocentrist claims or explained why these strange ideas are being circulated, and indeed taught, in American schools and universities.Not Out of Africa is the first book to refute these spurious claims. Mary Lefkowitz examines the ancient evidence and shows how it was misunderstood both in antiquity and in modern time. She explains how we know that Socrates and Cleopatra were Greeks and that Plato, Aristotle, and other Greek philosophers did not steal their ideas from Egyptian sources. Lefkowitz, a distinguished classicist, demonstrates that there has been no modern conspiracy among scholars to conceal the debt of Greece to Egypt and that some of the misconceptions arise form the ancient Greeks' own misunderstanding of Egyptian religions.Not Out of Africa explains why revisionist histories of the ancient world are being written now - and perhaps always will be. Modern Afrocentric writers are following a long-established pattern in which peoples, particularly if they regard themselves as having been deprived of a history, seem keen to acquire a glorious past.Lefkowitz explains how the notion that Greek religion and philosophy were derived from Egypt was preserved in the ritual and mythology of Freemasonry, and how extreme Afrocentrists came to allege that what they supposed to be an Egyptian legacy was not just borrowed but actually stolen by the ancient Greeks.This book will be of interest to everyone who cares about the ancient world and its traditions, and to all who believe that our civilization has preserved some of the Greeks' best traditions, such as democratic government, freedom of speech, learning, and discussion.",
        "Category": " Social Science , Ethnic Studies , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Sinner",
        "Authors": "By Gerritsen, Tess",
        "Description": "From the New York Times bestselling author of The Surgeon and The Apprentice comes a chilling new novel of suspense featuring Boston medical examiner Dr. Maura Isles, on the deadly trail of an anonymous madman who’s committed an unholy crime. . . .THE SINNERNot even the icy temperatures of a typical New England winter can match the bone-chilling scene of carnage discovered in the early morning hours at the chapel of Our Lady of Divine Light. Within the sanctuary walls of the cloistered convent, now stained with blood, lie two nuns—one dead, one critically injured—victims of an unspeakably savage attacker.The brutal crime appears to be without motive, and the elderly nuns in residence can offer little help in the police investigation. But medical examiner Maura Isles’s autopsy of the dead woman yields a shocking surprise: Twenty-year-old Sister Camille, the order’s sole novice, gave birth before she was murdered. Then the disturbing case takes a stunning new turn when another woman is found murdered in an abandoned building, her body mutilated beyond recognition.Together, Isles and homicide detective Jane Rizzoli uncover an ancient horror that connects these terrible slaughters. As long-buried secrets come to light, Maura Isles finds herself drawn inexorably toward the heart of an investigation that strikes closer and closer to home—and toward a dawning revelation about the killer’s identity too shattering to consider.As spine-tingling as it is mind-jolting, The Sinner showcases Tess Gerritsen in peak form—bringing her intimate knowledge of the dark depths of criminal investigation brilliantly to bear. Beneath its layers of startling insight into the souls of its characters, and the richly wrought depiction of the everyday war between good and evil, beats the unstoppable heart of an irresistible thriller.Tess Gerritsen left a successful practice as an internist to raise her children and concentrate on her writing. She gained nationwide acclaim for her first novel of medical suspense, the New York Times bestseller Harvest. She is also the author of the bestsellers Life Support, Bloodstream, Gravity, and The Surgeon and The Apprentice. Tess Gerritsen lives in Maine.PRAISE FOR TESS GERRITSENThe Surgeon“A briskly paced, terrifically suspenseful work that steadily builds toward a tense and terrifying climax.”—People (Page-Turner of the week)“Creepy . . . [The Surgeon] will exert a powerful grip on readers.”—Chicago Tribune“Grabbed me by the throat and didn’t let go.”—TAMI HOAGThe Apprentice“Skillful and scary.”—The Washington Post Book World“An adrenaline rush from start to finish.”—IRIS JOHANSEN“Masterful . . . Gerritsen moves into the Thomas Harris class, though with a style all her own.”—Kirkus Reviews (starred review)",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Bible Cure: A Renowned Physician Uncovers the Bible's Hidden Health Secrets",
        "Authors": "By Cherry, Reginald B.",
        "Description": "The Bible Cure has the answers to these and other questions.    What does the Bible say about carbohydrates and fat?    Is there a way to avoid infectious diseases?    What Bible foods can help lengthen your life?    What are God's nutritional laws?    Which herbs and vitamins should you take?    How should you pray for your healing?Within the ancient texts of the Bible are passages that provide hidden health clues to help rid people of almost every major disease. These findings have been validated by both scientific and medical research-a truth that amazes scientists and physicians alike.In his private practice, renowned physician Reginald Cherry, M.D., has seen The Bible Cure miraculously heal people with allergies, high blood pressure, diabetes, fatigue, genetic defects, arthritis, even heart disease and cancer. In this ground-breaking book, he deciphers passages from ancient Greek, Aramaic, and Hebrew Bibles, explaining how these sacred texts anticipate many of the same findings of today's cutting-edge medical research. Filled with powerful testimonies and sage advice, The Bible Cure will empower you with the Bible's wisdom about nutrition and health while building your faith in a God who heals.",
        "Category": " Religion , General",
        "Publisher": "Siloam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Asthma: Questions You Have ...Answers You Need",
        "Authors": "By Brisco, Paula",
        "Description": "",
        "Category": "",
        "Publisher": "Peoples Medical Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Jarka Ruus (High Druid of Shannara, Book 1) (High Druid of Shannara, 1)",
        "Authors": "By Brooks, Terry",
        "Description": "Twenty years after renouncing her former life as the dreaded Ilse Witch, Grianne Ohmsford leads a new Druid Counsel dedicated to defending the Four Lands but falls prey to enemies who refuse to forgive her earlier deeds, a situation that prompts her nephew and his companions to embark on a perilous rescue mission. 200,000 first printing.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Del Rey / Ballantine Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Glucose Revolution: The Authoritative Guide to the Glycemic Index--the Groundbreaking Medical Discovery",
        "Authors": "By Wolever, Thomas M. S., Colagiuri, Stephen, Brand Miller, Janette (EDT), and Miller, Jennie Brand (EDT)",
        "Description": "Thoroughly explains the benefits of a diet that emphasizes foods low on the glycemic index and includes more than fifty recipes and a glycemic index for three hundred foods and beverages. Original. 40,000 first printing. Tour.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Mandie and the Shipboard Mystery  (Mandie, Book 14)",
        "Authors": "By Leppard, Lois Gladys",
        "Description": "Mandie accompanies her grandmother to Europe, and finds herself relying on her Christian faith as she gets involved in another mystery when objects start to disappear from her steamship cabin",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Garfield Bigger and Better (Garfield (Numbered Paperback))",
        "Authors": "By Davis, Jim",
        "Description": "A collection of cartoons and comic strips features the cynical and insatiable Garfield and his adventures with Odie and Jon",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Gooseberry Patch Christmas: Merry Ideas, Recipes & How-To's for the Happiest of Holidays!",
        "Authors": "By Leisure Arts",
        "Description": "Provides instructions for making holiday decorations, and includes recipes for breads, cakes, cookies, and festive meals",
        "Category": " Crafts & Hobbies , Needlework , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Sauce it!: Making sauces, purees, and gravies from fruits and vegetables",
        "Authors": "By Blanchard, Marjorie P",
        "Description": "",
        "Category": "",
        "Publisher": "Garden Way Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Blueberry Connection (Connection Cookbook)",
        "Authors": "By Buszek, Beatrice Ross",
        "Description": "The Blueberry Connection has blueberry cookery with flavor, fact, and folklore from memories, libraries, and kitchens of old and new friends and strangers. What goes best with blueberries? Memories of berry picking and the delectable delights that follow—pies, jams, jellies, cakes, cookies, puddings and drinks, salads, and of course, blueberry muffins—this book has them all.",
        "Category": " Cooking , Regional & Ethnic , American , New England",
        "Publisher": "Nimbus Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Feminine Face of God: The Unfolding of the Sacred in Women",
        "Authors": "By Anderson, Sherry Ruth, Ph.D. and Hopkins, Patricia (CON)",
        "Description": "“An honest, compelling, surprising, and vastly reassuring book about the spiritual life of women . . . This landmark book is spiritual precisely because it is authentic.”—Joan Borysenko, Ph.D., author of Minding the Body, Mending the MindWith a foreword by Jean Shinoda Bolen, M.D. For many contemporary women, the old patriarchal models of religion are no longer relevant, forming a need to look beyond the male-oriented past to a wider, more fulfilling spiritual horizon. In this fascinating and thought-provoking book, Sherry Anderson and Patricia Hopkins show how many women have redefined traditional beliefs and rediscovered their own unique spiritual heritage—The Feminine Face of God. Anderson and Hopkins guide you through the sacred garden of:• Childhood—seedbed of life's sacred passage• Leaving home—finding your own inner authority• Relationships—new perspectives on intimacy• Spiritual practice—the importance of guidance and discipline• Sexuality—a wild card constantly cracking open the heart• And much moreAs women enter their sacred garden and learn the art of inner listening, they acquire the tools for living, loving, and praying authentically. In The Feminine Face of God there are seeds for growth: for creating and sustaining intimacy and love in a new way; for a new understanding of sexuality; for a new vision of family, a family of choice in a community of love.",
        "Category": " Body, Mind & Spirit , Spiritualism",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    }
]