[
    {
        "Title": "Under the Water: Level 2 (Easy-to-Read, Puffin)",
        "Authors": "By Ziefert, Harriet and Mandel, Suzy (ILT)",
        "Description": "Illustrations and simple text depict the types of things to be found in the ocean, from plants and small fish to coral reefs and exotic-looking animals",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Life in the Rain Forest: Student Book (Ranger Rick Science Spectacular)",
        "Authors": "By Melvin Berger",
        "Description": "",
        "Category": "",
        "Publisher": "Newbridge Educational Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "VIVO [Voice-In/Voice-Out]: The Coming Age of Talking Computers",
        "Authors": "By Crossman, William",
        "Description": "A positive look at how talking computers, VIVOs, will make text/written language obsolete, replace all writing and reading with speech and graphics, democratize information flow worldwide, and recreate an oral culture by 2050. Text is an ancient technology for storing and retrieving information; VIVOs will do the same job more quickly, efficiently, and universally. Among VIVO’s potential benefits: 80% of the world’s people are functionally nonliterate; they will be able to use VIVOs to access all information without having to learn to read and write. VIVO’s instantaneous translation function will let people speak with other people around the world using their own native languages. People whose disabilities prevent them from reading and/or writing will be able to access all information. Four “engines” are driving us irreversibly into the VIVO Age and oral culture: human evolution, technological breakthroughs, young people’s rejection of text, and people’s demand for textless, universal access to information. Future generations, using eight key VIVOlutionary learning skills, will radically change education, human relations, politics, the arts, business, our relation to the environment, and even human consciousness itself. Worldwide access to VIVO technology looms as a key human rights issue of the 21st Century.",
        "Category": " Computers , Social Aspects , General",
        "Publisher": "Regent Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Get Off the Bench and Back in the Game",
        "Authors": "By Leaman, Frank H.",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "1st Book Library",
        "Price Starting With ($)": "9.5",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Biting the Apple: Women Getting Wise About Love",
        "Authors": "By Sills, Judith",
        "Description": "At last, #1 bestselling author Judith Sills tells us: women are strong enough to love men more, now that we need them less.Love men more? But don't women love men too much already? No, says Sills. Women have needed men too much, made them too important in our lives, and that got in the way of loving men and of feeling loved.The path to love is not about finding the right man, fixing the one you've already found, or trading him in for someone better.It's about recognizing the emotional reactions - the fantasies, the wishful thinking, the fear, the rage - that suffocate our feelings of love. It's about stretching love to include his less lovable self, instead of withholding love until he deserves it. Get to love not by changing the man, but by changing the eyes through which you see him - not for the sake of his happiness, but for your own.",
        "Category": " Social Science , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Ladd Report",
        "Authors": "By Ladd, Everett Carll",
        "Description": "The U.S. economy has passed through one of the longest and most impressive booms in its history. We are enjoying our highest standard of living ever, buoyed by low crime and an improving environment. Still, we worry that, in other important ways, we're losing ground as a society. In particular, social commentators are bemoaning the state of our communities. Is our civic engagement declining even amidst material well-being? Do we no longer join together, care about each other, and trust one another as we once did?  Everett Carll Ladd, a political scientist who directs the Roper Center for Public Opinion Research, uses a vast array of data to offer a definitive report on the state of America's civic life. He shows that, far from withering, civic life is thriving.  Participation in community affairs has dramatically increased. You might be surprised, considering most media portrayals, to learn that:   The national PTA has declined, but overall parent-teacher involvement has soared, and more parents report spending more time than ever with their kids' schooling.  The Sierra Club and Audubon Society have grown fourfold since 1970.  A rich variety of new community churches find their membership burgeoning. Despite the decline of mainline denominations, more people attend church now than ever before.  Levels of charitable giving have been climbing steadily in real terms for more than a half century.  Volunteer rates are up significantly. For all the time-squeeze on two-wage-earner families and the allure of television sitcoms, a record number of Americans now do volunteer work.   If you are wondering how to organize your own community, or how you can pitch in, or simply want to know what all the doomsayers are talking about, then The Ladd Report is for you. Here is an essential guide that will answer every argument and remind us all how right Tocqueville was when he described America as a \"nation of joiners.\"",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Free Press",
        "Price Starting With ($)": "10.11",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "MasterHarper of Pern (Dragonriders of Pern)",
        "Authors": "By McCaffrey, Anne",
        "Description": "Pern: a beautiful world ravaged by Thread, the deadly spores that fall like silver rain, devouring every living thing in their path. Pern: where dragons' flaming breath burns Thread out of the sky before it can drop on the helpless land below. Pern: where harper songs warn of Thread, record history, and prepare for the future. The harpers are the glue that holds the people of Pern together; and no man is more influential than the Masterharper of Pern.The son of Petiron, renowned composer, and Merelan, one of Pern's most gifted singers, Robinton is a prodigy from birth. As a child, he is already composing music that the apprentice and journeyman harpers play with delight. And he also discovers another gift: he has the ability to speak with the dragons, who tend to reach out telepathically only to their riders.But not everyone appreciates his talents. His own father, driven by jealousy, spurns the boy. And far to the north, in the High Reaches, trouble is brewing in the form of a despotic holder, Fax, who hates harpers in general - and Robinton in particular.It is a perilous time for harpers. They sing of Thread, yet more and more people are beginning to doubt the return of that deadly scourge. They teach reading, writing, and history, yet Fax is determined to keep his growing area of influence free of the learning that might sow unrest. And they extol the dragonriders, whom many view, increasingly as a drain on the resources of the Holds. Now harpers are being turned away from holds; and, worse yet, they are being derided, attacked, even beaten.It is in this climate of unrest that Robinton will come into his own. For despite the tragedies that beset his own life, he continues to believe in music and in the dragons, and he is determined to save his beloved Pern from itself...so that the dragonriders can be ready to fly against the dreaded Thread when at last it returns!",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Pilgermann",
        "Authors": "By Hoban, Russell",
        "Description": "A traveler on the road to Jerusalem during the First Crusade of 1096, moving across a landscape of grotesque horror and extravagant beauty, meets God and Satan in all their forms",
        "Category": " Fiction , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Social Security, Medicare and Pensions (Social Security, Medicare & Government Pensions)",
        "Authors": "By Repa, Barbara Kate, Matthews, Joseph L., Repa, Barbara Kate (EDT), and Berman, Dorothy Matthews",
        "Description": "",
        "Category": " Law , General",
        "Publisher": "Nolo Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Bug Park",
        "Authors": "By Hogan, James P.",
        "Description": "Kevin Heber had it good. He had his own lab, a colleague he could trust, and an idea that could make him millions. Using his father's breakthrough technology in direct neural interfacing, he and his friend Taki have created a new entertainment media - live action adventure in micro mechanical scale. Bug Park: The ultimate out of body experience. And Taki's uncle wants to take it public.Two problems: 1) Kevin and Taki are teenagers. 2) Somebody wants to squash Bug Park dead, and Kevin's father along with it.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "11.69",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Complete Home Office: Planning Your Workspace for Maximum Efficiency",
        "Authors": "By Rosenbaum, Alvin",
        "Description": "A practical guide to creating a decent workplace at home, on any budget, covers every sort of design plan from converting a room to constructing an addition, furniture and equipment, phone and computer systems, and more.",
        "Category": "",
        "Publisher": "Studio",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Heart of a Woman (Oprah's Book Club)",
        "Authors": "By Angelou, Maya",
        "Description": "In The Heart of a Woman Maya Angelou leaves California with her son, Guy, to go to New York. There she enters the society and world of black artists and writers. Not since her childhood has she lived in an almost black environment, and she is surprised at the obsession her new friends have with the white world around them. She stays for a while with John and Grace Killens and begins to read her writing at the Harlem Writers Guild. She continues to sing, most notably at the Apollo Theatre in Harlem, but more and more she begins to take part in the struggle of black Americans for their rightful place in the world. She helps organize a benefit cabaret for the Southern Christian Leadership Conference, and then is appointed Martin Luther Kings Northern Coordinator.Shortly after that, through her friend Abbey Lincoln, she takes one of the lead parts in Genet's The Blacks (it was a remarkable cast, including Godfrey Cambridge, Roscoe Lee Brown, James Earl Jones, Cicely Tyson, Raymond St. Jacques, and Lou Gossett), and even writes music for the production.In the meantime her personal life has taken a tempestuous turn. She has left the New York bail bondsman she was intending to marry and has fallen in love with a South African freedom fighter named Vusumzi Make, who sweeps her off her feet and eventually takes her to London and then to Cairo, where, as her marriage begins to break up, she becomes the first female editor of the English-language magazine.The Heart of a Woman is filled with unforgettable vignettes of famous people, from Billie Holiday to Malcolm X, but perhaps most important is the story of Maya Angelou's relationship with her son. Because this book chronicles, finally, the joys and the burdens of a black mother in America and how the son she had cherished so intensely and worked for so devotedly finally grows to be a man.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Quantum Questions: Mystical Writings of The World's Great Physicists",
        "Authors": "By Wilber, Ken (EDT)",
        "Description": "Brings together for the 1st time the mystical writings of the world's great physicists - all of whom express a deep belief that physics and mysticism are somehow fraternal twins. Written in non-technical language.",
        "Category": "",
        "Publisher": "Shambhala",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Mercy Among the Children: A Novel",
        "Authors": "By Richards, David Adams",
        "Description": "When twelve-year-old Sidney Henderson pushes his friend Connie off the roof of a local church in a moment of anger, he makes a silent vow: Let Connie live and I will never harm another soul. At that very moment, Connie stands, laughs, and walks away. Sidney keeps his promise through adulthood despite the fact that his insular, rural community uses his pacifism to exploit him. Sidney's son Lyle, however, assumes an increasingly aggressive stance in defense of his family. When a small boy is killed in a tragic accident and Sidney is blamed, Lyle takes matters into his own hands. In his effort to protect the people he loves -- his beautiful and fragile mother, Elly; his gifted sister, Autumn; and his innocent brother, Percy -- it is Lyle who will determine his family's legacy.",
        "Category": " Fiction , Literary",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Wheels on the Bus (Spin-a-Song Storybook)",
        "Authors": "By Playmor Inc.",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore Inc",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Twinkle, Twinkle, Little Star (Spin a Song Storybook)",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "Imprint unknown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Creeds to Live by, Dreams to Follow",
        "Authors": "By Schutz, Susan Polis",
        "Description": "",
        "Category": "",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Why Can't My Child Behave?: Why Can't She Cope?  Why Can't He Learn?  The Feingold Diet updated for today's busy families",
        "Authors": "By Hersey, Jane and Lawlor, Robert C.",
        "Description": "\"Sometimes good parents have difficult children, very difficult children!   The reason may be right under your child's nose.  Consider that marshmallow breakfast cereal she consumed, or the fluorescent vitamins he takes, or the bubble gum flavored medicine.  Do you know what gives these things their pretty colors?  How about the \"\"fruity\"\" flavors that have never set foot outside a chemistry lab?  This book is about families who have found that good parenting techniques don't usually work for a child who is reacting to some of the many synthetic chemicals in his food.  They have seen first hand how today's typical diet is loaded with strange additives that can directly affect their child's behavior and ability to pay attention.  Add to that the countless health problems that are being triggered by a steady diet of \"\"foodless foods.\"\"   The good news is that these parents have also found solutions!  Yes, you can have it both ways.  This book shows you how to find the foods your family enjoys, but without the unwanted chemical additives, whether you are at a health food store, the supermarket, the mall, the Quickie Mart, or McDonald's.\"",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Pear Tree Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2014"
        }
    },
    {
        "Title": "Little People Big Book About Faraway Places",
        "Authors": "By Time-Life for Children",
        "Description": "An illustrated collection of folktales, poems, rhymes, informational articles, and related activities relating to different peoples and places in the world.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Shutter Island",
        "Authors": "By Lehane, Dennis",
        "Description": "The basis for the blockbuster motion picture directed by Martin Scorsese and starring Leonardo DiCaprio,Shutter Island by New York Times bestselling author Dennis Lehane is a gripping and atmospheric psychological thriller where nothing is quite what it seems. TheNew York Times calls Shutter Island, “Startlingly original.” TheWashington Post raves, “Brilliantly conceived and executed.” A masterwork of suspense and surprise from the author ofMystic River and Gone, Baby, Gone, Shutter Islandcarries the reader into a nightmare world of madness, mind control, and CIA Cold War paranoia andis unlike anything you’ve ever read before.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "A Reasonable World",
        "Authors": "By Knight, Damon",
        "Description": "When researchers accidentally release an alien lifeform, McNulty's Symbiont, into the world, the alien alters thousands of adults who produce Symbiont children, beings who punish violence with instant death but who offer heightened consciousness to those who desire it",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Power and impotence: the failure of America's foreign policy,",
        "Authors": "By Edmund O Stillman, William Pfaff",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The Chocolate Bear Burglary (Chocoholic Mysteries, No. 2)",
        "Authors": "By Carl, Joanna",
        "Description": "CONFESSIONS OF A CONFECTIONER After leaving her bad-news husband back in Texas, Lee McKinney moved up north to a quaint resort town. Now she keeps the books for her aunt's luxury-chocolate shop. But Lee soon finds that Michigan winters can be murder.... Lee and Aunt Nettie can't believe their luck. A teddy bear promotion will have tourists flocking to Warner Pier, which could mean skyrocketing sales for TenHuis Chocolade. To help decorate the scrumptious store, their friend Gail, an antique dealer, lends them a collection of valuable chocolate molds. But after a burglary at the shop, Gail meets with a grisly fate'and the main suspect in her murder is Lee's troubled teenage stepson. Lee sets out to clear his name, but awakening long-hibernating family secrets might be more than this daring crime solver can bear' INCLUDES TASTY CHOCOLATE TRIVIA!",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "DK Readers: Twisters! (Level 2: Beginning to Read Alone)",
        "Authors": "By Hayden, Kate",
        "Description": "Describes how tornadoes form and what effects they have on people and their surroundings.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Little ABC Coloring Book (Dover Little Activity Books)",
        "Authors": "By Pomaska, Anna",
        "Description": "Even the youngest children can have an easy time learning the alphabet with this charming coloring book. Each letter of the alphabet is illustrated by an object whose name begins with that letter: for example \"A is for Apple.\" And the miniature format makes this book perfect for little hands.",
        "Category": " Juvenile Nonfiction , Games & Activities , Word Games",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "Close Encounters Of The Third Kind",
        "Authors": "By Spielberg, Steven",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Non-Designer's Web Book: An Easy Guide to Creating, Designing, and Posting Your Own Web Site",
        "Authors": "By Williams, Robin and Tollett, John",
        "Description": "An introducton to design principles for beginning Web users explains how to create a Web site without any code, how to integrate graphics into a personal Web page, and how to get their finished site up on the Web. Original. (Beginner).",
        "Category": " Computers , Digital Media , Desktop Publishing",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Talismans of Shannara (The Heritage of Shannara #4)",
        "Authors": "By Brooks, Terry",
        "Description": "The descendants of the Elven house of Shannara had all completed their quests. Walker Boh, using the power of the Black Elfstone, had restored the lost Druid's Keep, Paranor, and become the last Druid himself. Wren had found the missing Elves and brought them back from the island of Morrowindl to the Four Lands. Now she was Queen of the Elves. And Par had found what quite possibly was the legendary Sword of Shannara.But their work was not yet done - the Shadowen still swarmed over the Four Lands, poisoning all with their dark magic. And the leader of the Shadowen, Rimmer Dall, was determined that the scions of Shannara would not share with each other the knowledge that would end the sickness. Against Walker Boh then, he would dispatch the Four Horsemen. To Wren Elessedil, he would send a friend who would betray her. And for Par Ohmsford, whose wishsong was growing steadily more uncontrollable, he had devised the most terrible fate of all...The charges given by the shade of the Druid Allanon were doomed to fail - unless the Shannara children could escape the traps being laid for them, and Par could find a way to use the Sword of Shannara.Here, in the final volume of his bestselling series, THE HERITAGE OF SHANNARA, Terry Brooks tells of the culmination of the struggle between a handful of determined heroes and the insidious, pervasive evil that seeks to crush them.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Beginning Fun With Water & Bubbles (Beginning Fun With Science Ser)",
        "Authors": "By Bittinger, Gayle",
        "Description": "",
        "Category": "",
        "Publisher": "Warren Pub House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Treasure (Explorer books)",
        "Authors": "By Waricha, Jean",
        "Description": "Describes many different kinds of treasure, the places where it is hidden, and the adventurers who search for it.",
        "Category": "",
        "Publisher": "Trumpet Club",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Great Grins (Phonics Readers Plus)",
        "Authors": "By Sibbing",
        "Description": "",
        "Category": "",
        "Publisher": "Hmh Supplemental",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Young Victoria",
        "Authors": "By Tyler-Whittle, Michael Sidney",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Paperback Library",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Fine Things: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "#1 NEW YORK TIMES BESTSELLERSmart, likable Bernie Fine was the wonder boy of Wolff’s, New York’s most glamorous department store. A senior VP on the way up, he arrives in San Francisco to open a West Coast store. His career is skyrocketing, but his life lacks a center. When he looks into the wide, innocent eyes of five-year-old Jane O’Reilly, and then into the equally enchanting eyes of her mother, Liz, Bernie knows he has found what he has been looking for. Bernie thought he had found love to last a lifetime, but when Liz is stricken with cancer, time becomes painfully short. Alone with two children, Bernie must face the loss and learn that life has other fine things to offer.",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Return to Eden (West of Eden, Book 3)",
        "Authors": "By Harrison, Harry",
        "Description": "In the finale of the trilogy begun with \"West of Eden,\" Kerrick and his fellow humans regroup on an island haven but remain on guard against the inevitable--another attack by the Yilane, the intelligent descendents of the dinosaurs",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Anne Frank: Life in Hiding",
        "Authors": "By Hurwitz, Johanna and Rosenberry, Vera (ILT)",
        "Description": "From July 1942 until August 1944, a young girl named Anne Frank kept a diary. Keeping a diary isn't unusual. Lots of girls do. But Anne's diary was unique. It chronicled the two years she and her family spent hiding from the Germans who were determined to annihilate all the Jews in Europe. In this sensitive and thoughtful introduction to the Holocaust and to the life of one of its best known victims, acclaimed author Johanna Hurwitz deftly evokes the background of World War II while capturing the unforgettable spirit and tragedy of Anne's life.From July 1942 until August 1944, a young girl named Anne Frank kept a diary. Keeping a diary isn't unusual. Lots of girls do. But Anne's diary was unique. It chronicled the two years she and her family spent hiding from the Germans who were determined to annihilate all the Jews in Europe.In this sensitive and thoughtful introduction to the Holocaust and to the life of one of its best known victims, acclaimed author Johanna Hurwitz deftly evokes the background of World War II while capturing the unforgettable spirit and tragedy of Anne's life.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Other, Religious",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Balthazar",
        "Authors": "By Lawrence Durrell",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "When Love Awaits (Avon Historical Romance)",
        "Authors": "By Lindsey, Johanna",
        "Description": "Once Lady Leonie cursed 'the Black Wolf' - handsome Rolfe d'Ambert, the mercenary Lord of Kempston - for his bloody deeds and cruelty to the local peasants. Now she must marry the magnificent blackguard to bring peace to the land. Young, innocent, and possessing a rare and exquisite beauty, Leonie would be a prize for any man - yet Rolfe seeks the match solely for revenge. But her sensuous kiss ignites within him the fiery need to claim her - and an irresistible desire to unite their warring hearts in glorious love.",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "What's so Lucky About A Four-Leaf Clover?",
        "Authors": "By Lys, Claudia De",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "3001: The Final Odyssey",
        "Authors": "By Clarke, Arthur C.",
        "Description": "The conclusion of the classic series that began with 2001: A Space Odyssey explains what really happened to Dave Bowman, who reentered the Discovery to incapacitate the psychotic computer Hal, and speculates about the future relationship between human and machine. 300,000 first printing.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Evidence That Demands A Verdict Vol. 2",
        "Authors": "By McDowell, Josh",
        "Description": "Among important books in the defense of Christianity, this one has few equals. Evidence That Demands a Verdict is an easy-to-read, front-line defense for Christians facing the tough questions of critics and skeptics. Using secular evidences and other historical sources, Josh McDowell's faith-building book is a \"must read\" for every Christian.",
        "Category": " Religion , Christian Theology , Apologetics",
        "Publisher": "Nelson Reference & Electronic Pub",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Man behind the Magic: The Story of Walt Disney",
        "Authors": "By Greene, Richard, Barrett, Katherine, and Greene, Katherine",
        "Description": "Follows the life of Walt Disney from his boyhood on a Missouri farm through his struggles as a young animator to his building of a motion picture and amusement park empire.",
        "Category": " Young Adult Nonfiction , Art , Cartooning",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Warrior",
        "Authors": "By McQuinn, Donald E.",
        "Description": "The story of Gan Moondark of the Dog People and the nation he forged in the post-apocalyptic Northwest.For centuries the proud Dog People had roamed with their horses across the grassy plains and fir-clad hills of the Northwest. Then, when their strength was as its greatest, the Dogs turned their bows on one another in a struggle over who would become War Chief after Col Moondark..... From the Paperback edition.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Georgetown Historic Waterfront Washington, DC: A Review of Canal and Riverside Architecture",
        "Authors": "By NOT STATED",
        "Description": "",
        "Category": "",
        "Publisher": "United States Commission of Fine Arts and Office of Archeology and Historic Pers",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Guinevere",
        "Authors": "By Newman, Sharan",
        "Description": "Shaman New man tells the story of the golden child whose dearest friend is a saint who hears spirits singing; of the gentle-hearted woman who begins to dream of love, glory, and the fierce, proud king who will become her husband; of the passionate beauty whose name will be remembered and hated for centuries.Sharan Newman portrays Guinevere with all the charm, skill, and erudition that have won her the hearts of readers and the admiration of critics for her Catherine LeVendeur medieval mystery series. In Guinevere, Newman offers a reinterpretation of the Arthurian saga and as memorable as The Mists of Avalon and The Hollow Hills.",
        "Category": "",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Memory",
        "Authors": "By Nagata, Linda",
        "Description": "Acclaimed hard-SF author Linda Nagata introduces a new world: a human colony whose people have forgotten their past, on a tremendous structure that forms a great ring around the sun . . . where the sky is bisected by an arch of light and the mysterious \"silver\" rises from the ground each night to completely transform the landscape-and erase from existence anything it touches.Young Jubilee is devastated when her brother Jolly is caught and taken by the silver. But when a forbidding stranger with the incredible power to control the silver comes seeking Jolly-and claiming that Jolly knows him-Jubilee first distrusts the man, then fears him and flees. For she has learned an impossible secret: Jolly may still be alive . . . and may somehow become the catalyst for the annihilation of everything she knows if she does not find him first.Jubilee's flight will lead her to discoveries she could never have imagined, from the secret history of her civilization and her people's origins to the true nature of the silver, to the awesome forgotten memories within her. And with these she will forever alter her world's future . . . unless the dark stranger, relentless in his pursuit, achieves his goal of destroying it. One way or another, Jubilee's final confrontation will change everything . . . .",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "2877218",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Crystal Rain",
        "Authors": "By Buckell, Tobias S.",
        "Description": "Long ago, so the stories say, the old-fathers came to Nanagada through a worm’s hole in the sky. Looking for a new world to call their own, they brought with them a rich mélange of cultures, religions, and dialects from a far-off planet called Earth. Mighty were the old-fathers, with the power to shape the world to their liking---but that was many generations ago, and what was once known has long been lost. Steamboats and gas-filled blimps now traverse the planet, where people once looked up to see great silver cities in the sky.Like his world, John deBrun has forgotten more than he remembers. Twenty-seven years ago, he washed up onto the shore of Nanagada with no memory of his past. Although he has made a new life for himself among the peaceful islanders, his soul remains haunted by unanswered questions about his own identity.These mysteries take on new urgency when the fearsome Azteca storm over the Wicked High Mountains in search of fresh blood and hearts to feed their cruel, inhuman gods. Nanagada’s only hope lies in a mythical artifact, the Ma Wi Jung, said to be hidden somewhere in the frozen north. And only John deBrun knows the device’s secrets, even if he can’t remember why or how!Crystal Rain is the much-anticipated debut novel by one of science fiction’s newest and most promising talents.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "15.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "From This Day Forward: 13 Stories by John Brunner",
        "Authors": "By Brunner, John",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Hello Reader, Level 1: Here Comes the Snow",
        "Authors": "By Medearis, Angela Shelf and Chambliss, Maxie (ILT)",
        "Description": "The young children in a rhyming first reader storybook bundle up in boots and warm coats, anticipating wintertime fun, but the lack of snow foils their plans until the first snowflakes of the season begin to fall. Original.",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Gutbucket Quest",
        "Authors": "By Anthony, Piers and Leming, Ron",
        "Description": "Slim's a Texas bluesman of a certain age, down on his luck and just about broke - but hey, that's what the blues are all about. He loves his music: \"Not the popular blues, homogenized, synthesized, and zombilized; but the real down-home gut-bucket blues.\" Then one day the music loves him back.In a single hot burst of lightning that comes straight up out of the ground, Slim finds himself in Tejas. It's a little bit magic and a whole lot different, but the blues are the same.And the blues - manifest here in the form of a maple-necked, pearl-gray Fender Stratocaster with blue-chrome pickups, a.k.a. The Gutbucket - need him and need him bad. The Strat's fallen into the hands of T-Bone Pickens and his Vipers, who want to suck up all its power and turn it to evil.Slim's off and running on the Gutbucket Quest, with the help of his new mentor, rhythm guitarist Progress T. Hornsby, and a purely unstoppable blues singer named Nadine.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Man Who Melted",
        "Authors": "By Dann, Jack",
        "Description": "Raymond Mantle, a subliminal artist, searches for his wife, who disappeared during the Great Scream, an attack of group telepathic insanity",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "The Story of the Lewis and Clark Expedition (Cornerstones of freedom)",
        "Authors": "By Stein, R. Conrad",
        "Description": "Commissioned by President Jefferson, Lewis and Clark began their expedition in 1804, traveling from St. Louis through the Louisiana Territory to Oregon and the Pacific, returning more than two years later",
        "Category": "",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "Tales from Planet Earth",
        "Authors": "By Clarke, Arthur C.",
        "Description": "A collection of fourteen stories by a master of the genre addresses the fate of the planet and includes \"The Lion of Comarre,\" \"The Deep Range,\" and \"The Wall of Darkness\"",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Mistress of the Catacombs (Lord of the Isles, Book 4)",
        "Authors": "By Drake, David",
        "Description": "For the first time in a thousand years, the Kingdom of the Isles has a government and a real ruler: Prince Garric of Haft. The enemies joining against him intend to destroy not only the kingdom but humankind as well.The rebels gathering in the West outnumber the royal army and the magic they wield can strike into the heart of the palace itself, but far greater dangers lie behind those. On the far fringes of the Isles, ancient powers ready themselves for a titanic struggle in which human beings are mere pawns--or fodder!Reptilian and insect monsters from out of the ages march on the kingdom, commanded by wizards no longer human or never human at all. If unchecked, their ravening slaughter will sweep over the Isles as destructively as a flood of lava. Garric, ripped from his time and body, must make new allies if he and his kingdom are to survive.His sister Sharina struggles with the chaos threatening the kingdom as swords and wizardry both gather to bring it down.Their friend Cashel, thrown into a place not of his world, faces each succeeding challenge with the calm certainty that he will overcome it or die, and that nothing yet has been able to kill him.And while her comrades strive in their own fashions, Ilna studies a pattern more complex than perhaps than even she and the skills she learned in Hell can master. If she fail, humanity will never escape the web being woven for it.Watching them all from the blackness of a tomb walled off in time and space, the Mistress waits...And her fangs drip poison!",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Martian Race",
        "Authors": "By Benford, Gregory",
        "Description": "With NASA's mission to Mars scrapped because of a tragic accident, billionaire John Axelrod steps in to compete with the European-Chinese effort to reach the fourth planet first, and the race is on. 30,000 first printing.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Aspect",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Pictorial Encyclopedia of Birds of the World",
        "Authors": "By Rauzon, Mark",
        "Description": "Color photographs show hundreds of species of birds from around the world, with descriptions of their environments and behavior",
        "Category": " Science , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "That's Not All! (Start to Read! Series)",
        "Authors": "By Gregorich, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "School Zone Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Baby Minds: Brain-Building Games Your Baby Will Love",
        "Authors": "By Acredolo, Linda P. and Goodwyn, Susan",
        "Description": "More than 65 delightful games and activities to jump-start your baby's amazing brainpowerCan simply singing a song or blowing a dandelion under a toddler's nose help her mind to blossom? Can your baby count, remember events, and solve problems even before he can talk? The exciting answer to both questions is yes! Breakthrough research is revealing the extraordinary inborn abilities of infants. It is also showing how experiences during the first years of life profoundly influence intelligence, creativity, language development-and even later reading and math skills.Now two psychologists and child development experts-authors of the bestselling Baby Signs-have created a delightful guide for parents based on the most up-to-date knowledge of how babies discover the world. You'll learn how to:_ Create a homemade mobile to stimulate your three-month-old's delight in solving problems_ Play a patty-cake game to help your two-year-old make logical connections_ Initiate bedtime conversations that build your child's memory and sense of personal history_ Develop \"Baby Signs\" to help your toddler communicate before he or she can talk_ Stimulate your child's natural number skills with puppets and counting games_ Use nursery rhymes and special read-aloud techniques to foster reading readiness_ Nurture budding creativity with humor and fantasy play_ And much more!Baby Minds is not another program for creating \"super babies.\" Instead it builds on activities that babies instinctively love to develop their unique abilities and make your daily interactions full of the joy of discovery-for both of you.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Chick and the Duckling (Rise and Shine)",
        "Authors": "By Aruego, Jose (ILT), Dewey, Ariane (ILT), Ginsburg, Mirra, and Suteyev, V. (TRN)",
        "Description": "This charming tale, with brightly colored illustrations by Jose Aruego and Ariane Dewey, will delight small children who are discovering the world around them.As Duckling sets off to explore the world, Chick is close behind, mimicking each of his actions. But when Duckling decides to go for a swim, his friend is in for a surprise.",
        "Category": " Juvenile Fiction , Animals , Birds",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Sheep Out to Eat (Sheep in a Jeep)",
        "Authors": "By Shaw, Nancy and Apple, Margot (ILT)",
        "Description": "A simple rhyming text follows the group of hungry sheep, who decide to check out the tea shop but soon create a ruckus and are asked to leave, only to find what they really like is outside. Reprint.",
        "Category": " Juvenile Fiction , Animals , Farm Animals",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Here If You Need Me: A True Story",
        "Authors": "By Braestrup, Kate",
        "Description": "Ten years ago, Kate Braestrup and her husband Drew were enjoying the life they shared together. They had four young children, and Drew, a Maine state trooper, would soon begin training to become a minister as well. Then early one morning Drew left for work and everything changed. On the very roads that he protected every day, an oncoming driver lost control, and Kate lost her husband.   Stunned and grieving, Kate decided to continue her husband's dream and became a minister herself. And in that capacity she found a most unusual mission: serving as the minister on search and rescue missions in the Maine woods, giving comfort to people whose loved ones are missing, and to the wardens who sometimes have to deal with awful outcomes.  Whether she is with the parents of a 6-year-old girl who had wandered into the woods, with wardens as they search for a snowmobile rider trapped under the ice, or assisting a man whose sister left an infant seat and a suicide note in her car by the side of the road, Braestrup provides solace, understanding, and spiritual guidance when it's needed most.   HERE IF YOU NEED ME is the story of Kate Braestrup's remarkable journey from grief to faith to happiness. It is dramatic, funny, deeply moving, and simply unforgettable, an uplifting account about finding God through helping others, and the tale of the small miracles that occur every day when life and love are restored.",
        "Category": " Family & Relationships , Death, Grief, Bereavement",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Americas (Family Library of World Travel)",
        "Authors": "By Manias, Paul and May, Fiona",
        "Description": "",
        "Category": "",
        "Publisher": "Xs Books",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Daddies: All About The Work They Do (Little Golden Book)",
        "Authors": "By Meisel, Paul (ILT), Lundell, Margo, and Frank, Janet",
        "Description": "Daddies work hard all day at jobs that range from growing wheat and making steel to writing children's books and teaching school",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Chimaera's Copper (TOR fantasy)",
        "Authors": "By Anthony, Piers and Margroff, Robert E.",
        "Description": "Kelvin of Rud, the transdimensional hero, and his father are shunted to a third frame world as the Prophecy of Mouvar continues to unfold",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Cats and Kittens (Learning About Animals)",
        "Authors": "By Modern Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Bear cub: At home in the forest",
        "Authors": "By Sarah Toast",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Puppies and Kittens (A Golden Little Look-Look Book)",
        "Authors": "By Sanderson, Ruth (ILT) and Manushkin, Fran",
        "Description": "Describes the activities and development of kittens and puppies as they grow up",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Yankee Magazine's Now That's Ingenious",
        "Authors": "By The Editors of Yankee Magazine",
        "Description": "Use your car's brake fluid to dry-clean your clothes? Banish back pain with a toothbrush? Get pencil marks off your wallpaper with rye bread? Now That's Ingenious! Now, for the first time ever, you'll find years of hard-won wisdom from 95 of America's hands-on experts distilled into one book. Our experts know their stuff, too--because they use it every day to make their living. From kindergarten teachers to professional recyclers, from chefs to hat designers, these everyday experts give you effective, practical solutions for every house and yard problem, including: * A \"kool\" cure for toilet-bowl stains * The nail polish remover rescue for melted plastic * A cleaning expert's secret ingredient * The fabric-softener solution for stiff paintbrushes * A \"beer-ly\" believable quick fix for that ugly white coating on old bricks * The ultimate cure for dry, cracked skin: bananas * And hundreds and hundreds more! Now That's Ingenious! is brought to you by the editors of Yankee magazine, where ingenuity has been honed to a fine art. Each month, more than two million readers turn to Yankee magazine for its clever advice and traditional Yankee wisdom.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Yankee Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "More Endangered Baby Animals",
        "Authors": "By Jill Wolf",
        "Description": "",
        "Category": "",
        "Publisher": "Antioch Publ Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Robot Adept (Apprentice Adept)",
        "Authors": "By Anthony, Piers",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "The Most Beautiful Villages of Tuscany",
        "Authors": "By Bentley, James and Palmer, Hugh (PHT)",
        "Description": "There are vineyards producing the finest wine, and miles of wild mountain scenery; almost any view will take in other villages, clustering around the upper reaches of some hill or the russet roofs of a fortified town deep in a valley. Tuscany has its grand cities—Florence and Siena—but their distinctive elegance is found on a more intimate scale in numerous small towns and villages.There is a richness in these small places, of architecture and artistic life, which lends them an interest and complexity shared by no other rural communities in Europe. Their sense of civilization is deep and ancient, but it is the late Middle Ages and the Renaissance which have left their mark, tempting travelers and settlers from abroad from the time of the Grand Tour to the present day. Here is the village of Settignano, where Michelangelo lived and which also boasts the glorious Renassiance garden of the Villa Gamberaia. Piero della Francesca's lovely Madonna del Parto decorates the tiny cemetery chapel of Monterchi. The medieval towers of San Gimignano loom over the town's squares and streets like the backdrop to some surreal stage set.James Bentley has chosen thirty-seven villages and small towns, both for their intrinsic beauty and for the part they have played in Tuscan history and culture. Page after page of Hugh Palmer's magnificent color photographs evoke the beauty and the wonder of this land. For the visitor, there are specially compiled listings of hotels, restaurants, and festivals to complete the tribute to Tuscany and its villages.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "8.09",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Magic Science Tricks",
        "Authors": "By Moche, Dinah",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "12.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Hope's End (Vel Chronicles)",
        "Authors": "By Chambers, Stephen",
        "Description": "On the planet Hera, the city of Hope was once bustling and prosperous. No more. A mysterious and deadly plague has decimated the population. Almost all traces of technology have vanished. Anarchy has erupted as powerful minorities within the tottering government intrigue against each other to tip the balance of power.To make matters worse, unknown to the inhabitants of Hera, a vicious colony of alien predators - the Frill - have established themselves on the planet.For Vel - at age sixteen already a seasoned con man who seeks his fortune in the streets - none of this matters. His only concern is his own survival. Up to now he has relied upon his cunning and wit. But a death that hits close to home forces Vel into a reckless confrontation with one of the leaders of the ruling elite.Targeted as an outlaw and hunted by the secret police, Vel must go underground to avoid capture. Here he meets a soldier from a mysterious separatist movement.Can he trust her?More important, does he have a choice?Forced to choose sides in a conflict that may very well decide Hope's future, Vel stumbles upon a startling secret...a secret so profound that it will change everything he thought he knew about Hope. And about himself.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Frank Lloyd Wright: American Art Series (American Architects Series)",
        "Authors": "By Costantino, Maria",
        "Description": "Studies the life and work of Frank Lloyd Wright, describes the changing face of modern architecture and his designs for public and private spaces, and depicts his major buildings",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Rome Then and Now",
        "Authors": "By D'Orazio, Federica",
        "Description": "D'Orazio, a tour guide in Rome for eight years, depicts the transformation of Rome over the last century by comparing vintage and contemporary photographs of the same vistas. The beautiful photographs of Rome's most famous architecture and tourist spots reveal constancy as well as change. D'Orazio introduces the photographs with a brief synopsis of the history of Rome. Her captions are useful in contextualizing the sites and explaining their significance. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Thunder Bay Press",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Conversationally speaking",
        "Authors": "By Garner, Alan",
        "Description": "Sets forth techniques for improving interpersonal communication and features effective strategies for promoting conversation, handling criticism, resisting manipulation, and developing self-confidence",
        "Category": "",
        "Publisher": "McGraw-Hill Companies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Confidence: How to Succeed at Being Yourself",
        "Authors": "By McGinnis, Alan Loy",
        "Description": "Helps readers build inner strength, handle rejection, develop uniqueness, keep flaws in perspective, make friends with one's body, find a place to excel, expand one's network of love and help others become more confident, in a book that includes fascinating stories and anecdotes, showing how to increase self-confidence without falling into the trap of self-worship. Original.",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Augsburg Publishing House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "A History of the Arab Peoples",
        "Authors": "By Hourani, Albert",
        "Description": "Upon its publication in 1991, Albert Hourani’s masterwork was hailed as the definitive story of Arab civilization, and became both a bestseller and an instant classic. In a panoramic view encompassing twelve centuries of Arab history and culture, Hourani brilliantly illuminated the people and events that have fundamentally shaped the Arab world.Now this seminal book is available in an expanded second edition. Noted Islamic scholar Malise Ruthven brings the story up to date from the mid-1980s, including such events as the Gulf War; civil unrest in Algeria; the change of leadership in Syria, Morocco, and Jordan; and the aftermath of the events of September 11, 2001.The terrorist attacks in the United States, ongoing crisis in Iraq, and renewed violence between Israelis and Palestinians all underscore the need for a balanced and well-informed understanding of the Arab world, and make this insightful history of the Arab peoples more important than ever.",
        "Category": "",
        "Publisher": "Belknap Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "How to Win over Depression",
        "Authors": "By LaHaye, Tim F.",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan Publishing House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "As Is.",
        "Authors": "By William M. Hoffman.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Farmyard Noises: Shaped Board Book (Potter Shaped Board Book)",
        "Authors": "By Potter, Beatrix",
        "Description": "Introduces the noises of farm animals with Jemima Puddle-duck, Tom Kitten, Kep the sheepdog, Sally Henny-penny, and Aunt Pettitoes and her piglets",
        "Category": "",
        "Publisher": "Warne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Finding Happiness in the Most Unlikely Places",
        "Authors": "By McCullough, Donald W.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "A Life God Rewards for Kids (Breakthrough Series)",
        "Authors": "By Wilkinson, Bruce, Brawner, Dan (ILT), and Thomas, Mack",
        "Description": "Nobody understands rewards better than kids. We bribe them every day to get them to do what we want! In A Life God Rewards, Bruce Wilkinson said that God treats His kids -- sometimes known as adults -- the same way. Now he teams up with children's communicator Mack Thomas to speak directly to kids ages six to nine, making a really important concept quickly understandable",
        "Category": " Juvenile Nonfiction , Religion , Christianity",
        "Publisher": "Multnomah Kidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Tony Hawk: Professional Skateboarder",
        "Authors": "By Hawk, Tony and Mortimer, Sean",
        "Description": "In this young adult autobiography, Tony Hawk shares the stories from his life that have helped him become a skateboarding hero.  Hawk speaks of being a super-competitive ′demon′ child who found peace while on a skateboard. Classmates teased him because of his interest in an ′uncool′ sport. Instead of retaliating with violence, he practised even more. With his story, he will inspire a younger generation of fans to stand up for what they believe in and follow their dreams.  Ages 8-12",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Sports & Recreation",
        "Publisher": "It Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Dinosaurs and Other Monsters from the Past",
        "Authors": "By Wolf, J.",
        "Description": "",
        "Category": "",
        "Publisher": "Antioch Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "My World and Globe: Revised Edition",
        "Authors": "By Meisel, Paul (ILT) and Wolfman, Ira",
        "Description": "The world has changed since 1991. There are even ten more countries, from East Timor to Palau. But one thing hasn't changed-the need for kids to learn their geography, and to have fun doing it. Introducing the revised edition of My World & Globe, the 558,000-copy bestselling book and kit whose praises were sung by Better Homes & Gardens Guide to Children's Products-helps kids . . . understand everything from animals and oceans to explorers and the equator. Child magazine--comes with a child-friendly geography book, an inflatable globe, and stickers so kids can customize their globe--making the world their own. And The Los Angeles Times [explains] everything from how a map maker puts a round world on a flat page, to why it's night in Los Angeles when it's morning in London. The package is irresistible, combining a fully illustrated book with an inflatable, custom-designed 18-inch globe printed with basic physical features, with 110 full-color stickers. The book is revised throughout, and redesigned for a contemporary look. The included stickers are now durable vinyl and reusable, so after putting the banana sticker where bananas grow and the I Live Here arrow where it belongs, kids can peel them off and start all over again--or have a friend or sibling give it a try. And the coolest new feature: The new square package includes a cardboard display stand, allowing kids one and all to show off their world.",
        "Category": " Juvenile Nonfiction , People & Places , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The baby (Collections for young scholars)",
        "Authors": "By Koss, Amy Goldman",
        "Description": "",
        "Category": "",
        "Publisher": "Open Court Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Horses & Ponies (An Animal Information Book)",
        "Authors": "By Price Stern Sloan, Inc.",
        "Description": "",
        "Category": "",
        "Publisher": "Price/Stern/Sloan",
        "Price Starting With ($)": "14.8",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Story of Benjamin Franklin: Amazing American (Dell Yearling Biography)",
        "Authors": "By Speirs, John (ILT) and Davidson, Margaret",
        "Description": "Ben Franklin was an amazing American because he  was:* a printer and businessman who created Poor Richard's  Almanac* the inventor of the lightning rod and the Franklin stove* a community leader who started the first public library in  America* a statesman who helped to gain our country's freedom from the BritishThese are only a few ways in which Ben was amazing. This book tells you much more about him.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The Faqs of Life: Frequently Asked Questions",
        "Authors": "By Cline, Camille N. (EDT) and Cader Books (COR)",
        "Description": "",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "From Cradle to Grave: The Human Face of Poverty in America",
        "Authors": "By Freedman, Jonathan",
        "Description": "In this eloquent and revealing book, Pulitzer Prize-winning journalist Jonathan Freedman offers the first comprehensive view of poverty in a generation, showing us beyond the shadow of any possible doubt that the poor are no longer confined to some Other America or so-called \"underclass.\" Drawing on the true stories of people at every stage of life - infancy, childhood, adolescence, the family, midlife, aging, and dying - he has written a singular book about hardship, about courage, and, in the face of incalculable odds, considerable hope.To do so, Freedman went to the people who have been shunned, visiting prenatal clinics, schools, job-training centers, and nursing homes, he asked, \"What helps, what hurts, what works?\" Their responses give poverty a recognizable human face, as he shows us children struggling to grow up, families fighting to keep their homes, displaced workers seeking training, retirees struggling to age and die with dignity.In his three years of investigating and recording, Freedman also discovered a surprising and, in many cases, heartening number of individuals and organizations already working to eliminate suffering. It is one of this book's achievements to show how innovative programs, funded on shoestring budgets, can help seemingly hopeless people cope with tribulation and transform their lives. Building on lessons from all parts of the country, Freedman suggests further coherent solutions that are affordable in this deficit-conscious era.A major work of reportage, From Cradle to Grave is also a timely, deeply informed call for change.",
        "Category": " Social Science , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Films of Bing Crosby",
        "Authors": "By Bookbinder, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Lyle Stuart",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "November",
            "Year": "1977"
        }
    },
    {
        "Title": "The singing voice",
        "Authors": "By Rushmore, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Distributed by W.W. Norton",
        "Price Starting With ($)": "53.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Llama Llama Red Pajama",
        "Authors": "By Dewdney, Anna and Dewdney, Anna (ILT)",
        "Description": "Llama, Llama red pajamawaiting, waiting for his mama.Mama isn't coming yet.Baby Llama starts to fret.In this infectious rhyming read-aloud, Baby Llama turns bedtime into an all-out llama drama! Tucked into bed by his mama, Baby Llama immediately starts worrying when she goes downstairs, and his soft whimpers turn to hollers when she doesn't come right back. But just in time, Mama returns to set things right. Children will relate to Baby Llama's need for comfort, as much as parents will appreciate Mama Llama's reassuring message.Watch a Video",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Viking",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The TA Primer: Transactional Analysis in Everyday Life",
        "Authors": "By Bry, Adelaide",
        "Description": "Uses simple terminology to illustrate the principles and dynamics of this interpersonal form of therapy",
        "Category": " Psychology , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "September",
            "Year": "1973"
        }
    },
    {
        "Title": "Principles and Practice of Psychiatric Nursing",
        "Authors": "By Stuart, Gail Wiscarz, Sundeen, Sandra J.",
        "Description": "Discusses the role of nursing in psychiatric care, specific conditions and how to deal with them, care settings, and specific types of treatment",
        "Category": "",
        "Publisher": "Mosby",
        "Price Starting With ($)": "10.22",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Black, White & Jewish: Autobiography of a Shifting Self",
        "Authors": "By Walker, Rebecca",
        "Description": "The Civil Rights movement brought author Alice Walker and lawyer Mel Leventhal together, and in 1969 their daughter, Rebecca, was born. Some saw this unusual copper-colored girl as an outrage or an oddity; others viewed her as a symbol of harmony, a triumph of love over hate. But after her parents divorced, leaving her a lonely only child ferrying between two worlds that only seemed to grow further apart, Rebecca was no longer sure what she represented. In this book, Rebecca Leventhal Walker attempts to define herself as a soul instead of a symbol&#151and offers a new look at the challenge of personal identity, in a story at once strikingly unique and truly universal.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Norman Rockwell's Patriotic Times",
        "Authors": "By Mendoza, George",
        "Description": "Full-color reproductions of the well-loved artist's portraits of America's most patriotic moments are accompanied by speeches, essays, poetry, and prose excerpts, in a celebration of basic American values and aspirations",
        "Category": " Art , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Ellis Island: Gateway to America",
        "Authors": "By Szucs, Loretto Dennis",
        "Description": "Almost half of all Americans have at least one ancestor who entered the United States through Ellis Island (also called America's Gateway\"\"). In Ellis Island: Tracing Your Family History Through America's Gateway, leading family history author and researcher Loretto Dennis Szucs explains how you can find out if your relatives were among the millions who were processed for entry at this historic landmark. This book details the immigrant experience at Ellis Island and teaches you about the records that are available to help you trace your ancestors' entry into the New World.\"\"",
        "Category": " Reference , Genealogy & Heraldry",
        "Publisher": "Ancestry.com",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Forgotten Arts, Book 3",
        "Authors": "By Bacon, Richard M.",
        "Description": "Shows how to repair clocks, weave with a tape loom, recane chairs, preserve food, install a slate roof, splice rope, reclaim a field, make a hammock, and take care of old quilts",
        "Category": " House & Home , General",
        "Publisher": "Yankee Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1976"
        }
    },
    {
        "Title": "MySQL Cookbook",
        "Authors": "By Dubois, Paul",
        "Description": "While MySQL has turned up among high profile users such as Yahoo!, NASA and the U.S. Census Bureau, the rising popularity of this open source database is especially keen among users with little database experience. These days, even a small organization or web site has uses for a database, and MySQL is an obvious choice. Affordable and easy to use, MySQL packs the power, speed and efficiency that enable it to rival expensive, proprietary database solutions. Yet, even if you know the basics, anyone without practical MySQL experience--novices and skilled DBAs alike--might stumble over common database-related tasks. Fortunately, there's a sensible shortcut.MySQL Cookbook provides a unique problem-and-solution format that offers practical examples for everyday programming dilemmas. For every problem addressed in the book, there's a worked-out solution or \"recipe\"--short, focused pieces of code that you can insert directly into your applications. But MySQL Cookbook is more than a collection of cut-and-paste code. You also get explanations of how and why the code works, so you can learn to adapt the techniques to similar situations.The book covers a lot of ground. Solutions for typical MySQL dilemmas range from simple ways to find all records that contain a given string, to more difficult problems, such as finding matching/non-matching records in two tables. Whether you use MySQL on Unix, Linux, Windows or the Mac OS X platform, the book will show you how to:Import data from external sourcesExport data for use by external programsAccess MySQL from your web serverUse scripts with MySQL to read queries from a fileAccess MySQL from within client programs that use Perl, PHP, Java, Python and other languagesConstruct queries that solve commonly-occurring questionsInteract with the serverThis learn-as-you-go resource will help users of all levels exploit MySQL more fully. MySQL Cookbook supplies you with an armory of ready-made techniques for specific problems so that, even if you're an experienced MySQL user, you don't have to write everything from scratch.",
        "Category": " Computers , Database Management , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    }
]