[
    {
        "Title": "A Year or So With Edgar",
        "Authors": "By Higgins, George V.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Bad Trips: A Sometimes Terrifying, Sometimes Hilarious Collection of Writing on the Perils of the Road",
        "Authors": "By Fraser, Keath (EDT)",
        "Description": "The entries in this collection take us to the farthest extremes of travel with tales of danger, disorientation and bemused discomfort; combines reportage, fiction and poetry representing some of the best-known writers of our time.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Jeremiah: Terrorist Prophet",
        "Authors": "By Smith, Michael A.",
        "Description": "Jeremiah is a modern-day terrorist with an agenda: the collapse of the United States as we know it. Jeremiah claims to be anointed by God to wield vengeance against the \"evils\" that plague America. His targets are carefully chosen to undermine the nation's legal system, political structure, and economy, as well as to create religious, racial, and ethnic strife. Jeremiah even makes skillful use of the Internet to preach and proselytize.Television is the main medium for his message, however, and the unwitting messenger is Laura Delaney, the beautiful anchor of a top-rated news-magazine show. Jeremiah gives Laura advance notice of his attacks, and calls in his rationale during the show. Off the air, he stalks her obsessively and irrationally, wanting her love and endorsement.Spearheading the government effort to capture Jeremiah is FBI agent Steve Wallace, who must also protect Laura Delaney. Together Steve and Laura risk their careers and lives to foil Jeremiah's master plan.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Literature: An introduction to reading and writing",
        "Authors": "By Roberts, Edgar V.",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Anyone Can Grow Up: How George Bush and I Made It to the White House",
        "Authors": "By Carlson, Margaret",
        "Description": "Margaret Carlson -- widely read Time columnist, regular CNN panelist, political insider, and hostess of A-list but scarcely traditional Washington dinners -- has been commenting on American life for over a decade. In Anyone Can Grow Up, she expands on her writings about presidents, politics, morals, children, family life, and lessons from her own life.  In the section entitled \"Presidential Material,\" Carlson reflects on what it takes to be president by looking at those who choose to pursue the office (and by extension, those, like her, who choose to cover the pursuit). She looks at the hard facts (offices held, speeches given, money raised) and the soft, sometimes determinative, ones (how the candidates talk and look, how they perform under pressure, who they marry and divorce when no one is looking, and how they get into -- and out of  -- scrapes). The best man doesn't always win. That's why those who've lost, and those who almost run but don't, are covered as well. Bush Sr. and son, and Clinton in his scandalous term, are here. Carlson also takes a look at those whom have thought of running, like Donald Trump, those who America wanted to run, like Colin Powell, and those who've run and lost, like John McCain.  Carlson draws from her own life in the \"Family Matters\" section as well, commenting on subjects relating to children, women, and men -- from abortion to balancing work and family, from feminism to sexual harassment.  Finally, in the last section, we read about what makes us who we are and what makes us do what we do. From breaking down how congressmen make money on the side to what cost Newt Gingrich his job, from days in court trying the Menendez brothers to a memorable three-hour lunch with Katharine Hepburn that didn't turn out the way she imagined, Carlson finds the strength of character, or lack of it, in Americans famous and not.  Carlson gets as many as a hundred letters a week from readers who say, \"That's exactly what I was thinking.\" In the vein of Anna Quindlen, Ellen Goodman, and Bill O'Reilly, here is a wise and witty book from a writer who knows what makes us tick.",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "School is Not a Four Letter Word: How to Help Your Child Make the Grade",
        "Authors": "By Johnson, Louanne",
        "Description": "Offering the hope that every child wants to learn, the author of My Posse Don't Do Homework details her strategy for helping even the most difficult child solve his or her learning problems. 30,000 first printing. Tour.",
        "Category": " Education , Parent Participation",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Living With Grief When Illness Is Prolonged",
        "Authors": "By Doka, Kenneth J. (EDT) and Davidson, Joyce (EDT)",
        "Description": "First published in 1997. Routledge is an imprint of Taylor & Francis, an informa company.",
        "Category": " Family & Relationships , Death, Grief, Bereavement",
        "Publisher": "Hospice Foundation of America/Taylor & Francis",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "How to prepare, stage, and deliver winning presentations",
        "Authors": "By Leech, Thomas",
        "Description": "Explains the importance of effective business presentations, describes special situations, and tells how to research and evaluate a presentation",
        "Category": "",
        "Publisher": "American Management Associations",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Family and Nation (Godkin Lectures, 1985)",
        "Authors": "By Moynihan, Daniel Patrick",
        "Description": "The senior United States Senator from New York addresses the deteriorating state of the American family unit and calls for the establishment of a national policy to reverse this disturbing trend.",
        "Category": " Political Science , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Christians in the Shadow of the Kremlin:  Passport to Russia",
        "Authors": "By Anita Deyneka, Peter Deyneka Jr.",
        "Description": "",
        "Category": "",
        "Publisher": "David C. Cook Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1974"
        }
    },
    {
        "Title": "Backtalk: 4 Steps to Ending Rude Behavior in Your Kids",
        "Authors": "By Ricker, Audrey and Crowder, Carolyn, Ph.D.",
        "Description": "\"So what? All the other kids get to do it!\"  Few behavioral problems challenge and frustrate parents, caregivers, and teachers as does verbal rudeness in children of any age. Reinforced by the wise-cracking kids on TV and in the movies, backtalk has become all too common among today's youngsters. But there is nothing cute about this behavior. Remarks like \"Yeah, right,\" \"Big deal,\" and \"Make me\" -- form children as young as three -- get in the way of real communication between parents and kids, and can also be detrimental to a child's social and intellectual development.  Now two experts in the field share their simple and specific four-step program for ending backtalk and restoring balance in relationships between parents and children, from preschoolers to teens. You'll learn how to recognize backtalk, how to choose and enact a response that will make sense to you and the backtalker, and when to disengage from the struggle and move forward. Full of advice and encouragement as well as suggestions on how to keep track of what works and what doesn't, Backtalk can be put to use immediately, before you hear another \"Whatever.\"",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The History Of Ships",
        "Authors": "By Peter Kemp",
        "Description": "",
        "Category": "",
        "Publisher": "Longmeadow Press",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Defense Revolution: Strategy for the Brave New World : By an Arms Controller and an Arms Builder",
        "Authors": "By Adelman, Kenneth L. and Augustine, Norman R.",
        "Description": "Argues that America's defense must be downsized in the aftermath of the Cold War, and makes suggestions for its reshaping and reform",
        "Category": " Political Science , General",
        "Publisher": "Ics Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "The Howell Book of Dog Care",
        "Authors": "By Hawcroft, Tim",
        "Description": "A first-rate practical guide to all aspects of dog ownership, including choosing a suitable dog, behavior training, grooming, and other general considerations, as well as an alphabetical index of some 150 diseases and health problems with their causes, symptoms, treatments, and prevention. With some 250 color photographs. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Technology & Engineering , General",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Temperance Songbook",
        "Authors": "By Coleman, Emmet",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Doggonest Vacation",
        "Authors": "By Stack, Richard Lynn and Mowrer, Sheri Lynn (ILT)",
        "Description": "While visiting his Uncle Leo, Josh, a young dog, helps his new friend, Trevor, believe in himself",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Windmill Pr",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Dear America: Letters from Vietnam",
        "Authors": "By Edelman, Bernard (EDT) and New York Vietnam Veterans Memorial Commission (COR)",
        "Description": "Collects letters, poems, and petitions from the front, written mostly by infantrymen to their families and friends",
        "Category": " History , Military , Vietnam War",
        "Publisher": "POCKET",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "James McNeill Whistler: Beyond the Myth",
        "Authors": "By Anderson, Ronald and Koval, Anne",
        "Description": "The myth perpetuated throughout Whistler's life - of a witty, irascible dandy endlessly feuding with the establishment or anyone else who stood in his way - clouds his artistic achievement. Now, for the first time, his art and life are brought together in this major new biography to recreate the extraordinary career of the man behind the myth.By examining Whistler's life and work together with the impact his followers, collectors and friends made on his reputation after his death, Anderson and Koval show this most controversial and accomplished artist to be one of the most remarkable men of his age.",
        "Category": " Biography & Autobiography , Artists, Architects, Photographers",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Wine Lover's Guide to Champagne (The Wine Lover's Regional Guides Series)",
        "Authors": "By Busselle, Michael",
        "Description": "An introduction to getting acquainted with the regions and its wines in France",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Swallowing Clouds",
        "Authors": "By Ng, Lillian",
        "Description": "In an old village a few miles outside of Shanghai, a blind soothsayer warns Syn that she will never find happiness in love and is destined to seek her revenge on men for past wrongs. Her recurring nightmare of death by drowning, he tells her, points at truth: in a vivid \"past life\" that ended in 1918, Syn was thrown into the HuangPu River in a pig's basket as punishment for committing adultery.A week later, Syn leaves Shanghai for the streets of modern Sydney to study the English language on a temporary visa. After the Tiananmen Square massacre strands her in Australia with no money or prospects, Syn becomes entangled in a steamy and consuming affair with a married butcher named Zhu.Though ever sensible of the soothsayer's predictions, Syn, in the grip of passion, is full of hope for the future. Perhaps this time, the couple's feelings for each other will be able to alter fate. Or are the paths of their lives already destined?",
        "Category": " Fiction , Erotica , General",
        "Publisher": "Ecco",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Amish Life",
        "Authors": "By Hostetler, John Andrew",
        "Description": "",
        "Category": "",
        "Publisher": "HERALD PRESS *",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Technology in America: A History of Individuals and Ideas",
        "Authors": "By Pursell, Carroll W. (EDT)",
        "Description": "The American Revolution and the Industrial Revolution began at the same time, and ever since the development of America and the development of technology have proceeded in tandem, each dependent on and contributing to the other. From the beginning until well into the twentieth century, technical innovation was largely the work of the rugged individualists who have since entered the pantheon of American folklore: their names, coupled with the enterprises they opened up in the chapter titles below, are still for the most part familiar to American readers.Contents: The Artisan during America's Wooden Age, Brooke Hindle; Thomas Jefferson and a Democratic Technology, Hugo A. Meier; Benjamin Henry Latrobe and the Transfer of Technology, Darwin H. Stapleton; Eli Whitney and the American System of Manufacturing, Merritt Roe Smith; Thomas P. Jones and the Evolution of Technical Education, Bruce Sinclair; Cyrus Hall McCormick and the Mechanization of Agriculture, Carroll W. Pursell, Jr.; James Buchanan Eads and the Engineer as Entrepreneur, John A. Kouwenhoven; James B. Francis and the Rise of Scientific Technology, Edwin T. Layton, Jr.; Alexander Graham Bell and the Conquest of Solitude, Robert V. Bruce; Thomas Alva Edison and the Rise of Electricity, Thomas Parke Hughes; George Eastman and the Coming of Industrial Research, Reese V. Jenkins; Ellen Swallow Richards: Technology and Women, Ruth Schwartz Cowan; Gifford Pinchot and the Conservation Movement, Samuel P. Hays;  Henry Ford and the Triumph of the Automobile, James J. Flink; Charles A. Lindbergh: His Flight and the American Ideal, John William Ward; Keaton and Chaplin: The Silent Film's Response to Technology, George Basalla; Morris L. Cooke and Energy for America, Jean Christie; Enrico Fermi and the Development of Nuclear Power, Lawrence Badash; Robert H. Goddard and the Origins of Space Flight, Barton C. Hacker.The book was originally published in 1979 in the Voice of America Forum Series for distribution outside the United States. This MIT Press edition contains a new preface by the editor.",
        "Category": " Science , History",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "Endgame: A Play in One Act and Act Without Words",
        "Authors": "By Beckett, Samuel",
        "Description": "Samuel Beckett was awarded the Nobel Prize for Literature n 1969; his literary output of plays, novels, stories and poetry has earned him an uncontested place as one of the greatest writers of our time. \"Endgame, \" originally written in French and translated into English by Beckett himself, is considered by many critics to be his greatest single work. A pinnacle of Beckett's characteristic raw minimalism, it is a pure and devastating distillation of the human essence in the face of approaching death.",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Metaphysics of Star Trek",
        "Authors": "By Hanley, Richard",
        "Description": "Uses the Star Trek series to explore various philosophical ideas and theories, including the extent of free will, the proper treatment of nonhumans, the nature of personal survival, and the nature of a person.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Complete Restaurateur: A Practical Guide to the Craft and Business of Restaurant Ownership (Plume)",
        "Authors": "By Lawrence, Elizabeth",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Hang on to Your Diapies, Babies, We're Going In!: Trivia from the Hit Movie! (The Rugrats Movie)",
        "Authors": "By Richards, Kitty",
        "Description": "Come on, Rugrats fans... you gotta find out:   Just who that funny-looking new kid is  What's a \"'sponsitility\"  How Chaz keeps in shape  That bouncing on a mattress is more fun than a lot of things!   Thank \"Bob\" these and other mysteries of The Rugrats Movie can be found in this treasure trove of trivia that's a treat for everyone. After all, a baby's got to know what a baby's got to know!",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Simon & Schuster Merchandise &",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Susan B. Anthony: Champion of Women's Rights (Childhood of Famous Americans)",
        "Authors": "By Monsell, Helen Albee",
        "Description": "Focuses on the childhood of a pioneer in the crusade for human rights, particularly those of women.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Little Prayer Series: Mealtime Prayers",
        "Authors": "By Parry, Alan (EDT) and Parry, Linda (EDT)",
        "Description": "Beautiful, classic prayers are combined with timeless art in these four books designed especially for little hands.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Lean, Long & Strong: The 6-Week Strength-Training, Fat-Burning Program for Women",
        "Authors": "By Linguvic, Wini and Williams, Montel (FRW)",
        "Description": "Lean Long & Strong is a tailored strength training program created just for women. Each workout, designed to be completed in just 12 minutes a day, incorporates synergy sets, a combination of precision strength training exercises with specially chosen stretches.Now top personal trainer Wini Linguvic tailors her precision body-sculpting methods just for women in workouts that integrate the \"flow\" and stretching of yoga to produce the even more impressive real results of strength training. Finally, an expert women can turn to for a program designed to create the fabulously fit, lean, long, strong body that today's woman yearns to achieve.o Features beautiful, large full-color photographs of the author doing each exercise, accompanied by detailed instructions for completing each moveo All exercises can be done at home with hand weights and an exercise ballo Specific workouts focus on firming key trouble spots such as abs and core, butt and thighs, or upper body",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Skywatch East: A Weather Guide",
        "Authors": "By Keen, Richard A.",
        "Description": "Provides detailed descriptions of all types of weather phenomena, including cyclones, fronts, thunderstorms, hail, tornadoes, and hurricanes, and includes lists of weather extremes in the eastern United States and Canada",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Fulcrum Publishing",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "From Little Acorns Grow: Main Street Millionaires",
        "Authors": "By Mike Wendland",
        "Description": "",
        "Category": "",
        "Publisher": "National Association of Investors Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Australians",
        "Authors": "By Terrill, Ross",
        "Description": "From frontier mining towns to the Great Barrier Reef, this book traces the history of Australia from its origins two hundred years ago as a British penal colony to its emergence as a commonwealth",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Improving Performance: How to Manage the White Space on the Organization Chart (The Jossey-Bass management series)",
        "Authors": "By Rummler, Geary A., Brache, Alan P.",
        "Description": "In this classic book that launched the process improvement revolution, Geary A. Rummler and Alan P. Brache offer an expanded and updated set of practical, experience-based tools for managing organizations as systems and improving the processes that form a link between organization strategy and the individual. Through illustrative examples from such successful organizations as AT&T, GTE, Ford, and Motorola, Improving Performance provides a blueprint for managing change and enhancing organization and human performance.",
        "Category": "",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Comfort Me with Apples: More Adventures at the Table",
        "Authors": "By Reichl, Ruth",
        "Description": "In the sequel to Tender at the Bone, the noted food critic describes her odyssey from chef to food writer, traces her journey through restaurants from Bangkok to Paris to Los Angeles, and offers colorful anecdotes about her life and encounters with great food. 75,000 first printing.",
        "Category": " Cooking , Essays & Narratives",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Circle Of Stones: Woman's Journey To Herself",
        "Authors": "By Duerk, Judith",
        "Description": "",
        "Category": "",
        "Publisher": "LuraMedia",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Between Washington and Jerusalem: A Reporter's Notebook",
        "Authors": "By Blitzer, Wolf",
        "Description": "Many journalists have mastered the Washington political scene, while others have gained entree to the highest echelons of Israeli politics.  Wolf Blitzer is one of the few to have done both.  An American fluent in Hebrew, Blitzer has interviewed and gained the respect of nearly all the major policy-makers in Israel and the United States over the past dozen years.  The late Anwar Sadat credited Blitzer with first giving him the idea of making his historic trip to Jerusalem.     The U.S.-Israeli relationship is like no other and this book helps explain why.  Most importantly, it outlines the limits of the relationship, explaining why neither country can afford an all-out confrontation.  There is special emphasis on the way decisions are made in Washington--the role of the foreign policy bureaucracy, Congress, the press, the Jewish community, the Arabs and their supporters, and the official Israeli presence.  In addition, chapters cover the special U.S.-Israeli cooperation in military, strategic, and intelligence matters.     The book is filled with fascinating vignettes of people: the career diplomat responsible for the explosive (in 1975 terms) Saunders document which said, \"In many ways, the Palestinian dimension of the Arab-Israeli conflict is the heart of that conflict.\"...the American industrialist who became involved in some spectacular diplomatic back-channel efforts to save Soviet Jews...the German-Jewish refugee secretary of state who came to play such a decisive role in American-Israeli affairs...the three deeply religious leaders, Begin, Sadat, and Carter, \"who progressed from an agreement to pray together to an agreement to make peace once and for all.\"     From his unique vantage point, Blitzer considers the potential for either sharp strains or even closer collaboration in the future.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "The Trial of Socrates",
        "Authors": "By Stone, I. F.",
        "Description": "In unraveling the long-hidden issues of the most famous free speech case of all time, noted author I.F. Stone ranges far and wide over Roman as well as Greek history to present an engaging and rewarding introduction to classical antiquity and its relevance to society today. The New York Times called this national best-seller an \"intellectual thriller.\"",
        "Category": " Philosophy , History & Surveys , Ancient & Classical",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "The Tea Party Book",
        "Authors": "By Wheeler, Jody (ILT) and Penner, Lucille Recht",
        "Description": "Includes easy recipes, instructions for making decorations and favors, and simple activities for all kinds of tea parties",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Mad Dog: Stories",
        "Authors": "By Boll, Heinrich and Mitchell, Breon",
        "Description": "A collection of ten previously unpublished stories written between 1938 and 1945 by the Nobel Prize winner examines the sad effects of war on ordinary people's lives. 15,000 first printing.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Arts At Mid-Century",
        "Authors": "By Robert, ed Richman",
        "Description": "",
        "Category": "",
        "Publisher": "Horizon",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "The Naked Chef Takes Off",
        "Authors": "By Oliver, Jamie",
        "Description": "Jamie Oliver, the Naked Chef, is a culinary star with charm that shines even brighter than his glossy pictures (People). He's the Food Network's latest sensation, a Today Show regular, and a GQ man of the month. His audience appeal keeps growing, and his primetime show on the Food Network continues to reap huge ratings as he teaches everyone the secret behind fresh, simple, delicious cooking. In The Naked Chef Takes Off, TV's hottest young chef (USA Weekend) returns to offer even more delectable stripped-down recipes with basic ingredients and a minimum of fuss. In this new book, Jamie features fantastic breakfasts, tapas, roasts, fish dishes, and desserts to die for. Best of all, each of the recipes is accompanied by Jamie's winning, off-the-cuff commentary and straightforward food philosophy (Los Angeles Times) that will encourage confidence and inspire both new and experienced cooks. Filled throughout with gorgeous photographs of both the recipes and the chef, here is a book to savor and to share.",
        "Category": " Cooking , Methods , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Selecting the Pope: Uncovering the Mysteries of Papal Elections",
        "Authors": "By Tobin, Greg and Wister, Robert J. (FRW)",
        "Description": "Award-winning author Greg Tobin offers a compelling guide to what will surely be one of the most important and headline-making events in modern history: the election of the new Pope. Every rule of this secretive process receives close scrutiny, as does the rich history behind the conclave and the key issues that will shape the future of the Catholic Church at a time when it is in crisis, in the U.S. and abroad. You'll discover why the election always concludes with the rising of white smoke; what powers the Cardinals hold during the vacancy of the holy See; and what startling changes Pope John Paul II made to the centuries-old procedures. Look back at some of the more than 200 holy men and scoundrels, geniuses and mediocrities who have held the lofty position of Pope, and then look forward to possible successors to Pope John Paul II. In addition, there's a day-by-day account of the balloting inside the Sistine Chapel.Whether your interest is historical, religious, or political, you'll enjoy a rare glimpse into the inner workings of the Vatican.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Sterling / Barnes & Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Man as Male and Female: A Study in Sexual Relationships from a Theological Point of View",
        "Authors": "By Jewett, Paul King",
        "Description": "",
        "Category": " Religion , Sexuality & Gender Studies",
        "Publisher": "Wm. B. Eerdmans-Lightning Source",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The Web of Wizardry",
        "Authors": "By Juanita Coulson",
        "Description": "",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "Christopher Columbus and How He Received and Imparted the Spirit of Discovery",
        "Authors": "By Winsor, Justin",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "River of Hidden Dreams",
        "Authors": "By Fowler, Connie May",
        "Description": "\"HEARTBREAKING...COMPELLING...The story carries you like a slow, implacable current.\"--San Francisco ChronicleForty-something Sadie Hunter is a loner. But more than that, she is afraid of not being alone. Ever since her mother and Native American grandmother died together when she was a child, dancing cheek-to-cheek in a saloon in the middle of a violent storm, Sadie hasn't let anyone get too close. Not even Carlos, a passionate Cuban who sees the rich soul that Sadie tries to hide from herself.Cynical and loveless, she becomes obsessed with learning more about her unacknowledged identity, torn apart by tragic family legends she can't quite believe. And although she tries to fight it, she half suspects that with Carlos's help, she could find the truth of the past, and it could set her free....\"A fluid, fun read--a story of self-discovery told by a woman haunted by female forebears while struggling to learn love....A work of accomplished introspection.\"--The Philadelphia Inquirer",
        "Category": " Fiction , Sagas",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Controlling Cholesterol the Natural Way: Eat Your Way to Better Health with New Breakthrough Food Discoveries",
        "Authors": "By Cooper, Kenneth H.",
        "Description": "Dr. Kenneth H. Cooper's all-new plan to lower cholesterol without drugs!The Old News: Elevated levels of cholesterol put you at risk for heart attack and stroke.The New News: Now you can control cholesterol naturally!Dr. Kenneth H. Cooper, a leading authority on controlling cholesterol, shares his all-new plan for balancing your blood lipids--without drugs and without side effects.Drawing on clinical trials and the most up-to-date medical research, Dr. Cooper explains how exciting new food discoveries can give you a revolutionary new way to manage your cholesterol. Inside you'll discover: How the new functional foods, such as Benecol and Take Control, can lower bad cholesterol while improving the ratio between good and bad cholesterol in only three weeks How these \"anti-cholesterol\" foods work, why they are safe to use, and who should use them How Dr. Cooper's approach can end--or greatly reduce--your use of prescription cholesterol-lowering medications Expert advice on diet and exercise, including recipes and more amazing nutritional discoveries And much moreYou don't have to go farther than your fridge to find an effective, nonprescription cholesterol-controlling product.",
        "Category": " Health & Fitness , Nutrition",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Every Breath You Take: A True Story of Obsession, Revenge, and Murder",
        "Authors": "By Rule, Ann",
        "Description": "If anything ever happens to me, promise me that you will see that there is an investigation....And find Ann Rule and ask her to write my story,\" Sheila Blackthorne Bellush told her sister after she divorced multimillionaire Allen Blackthorne. Now, in perhaps the first book ever written at a victim's request, America's Number One bestselling true-crime writer, Ann Rule, untangles a horrific web of lies that culminated in Sheila's savage murder more than ten years after she left Blackthorne. When beautiful, blond Sheila married the charming, handsome Blackthorne, she was convinced she had found her perfect soul mate, and helped him reach his goal of living the privileged life of the country club set. But behind Allen's smooth facade, she discovered a violent, controlling sociopath -- a liar, a scam artist, a sexual deviant. When she finally fled with their two young daughters, she was skeletally thin, bruised, and beaten. Although Sheila recovered, remarried, and was starting a new life and family, she still felt she was doomed. Joyously pregnant, she and her new husband expecting quadruplets, Sheila still feared Blackthorne, who had sworn to her he would monitor her every move and \"every breath you take.\" And, in fact, Blackthorne inevitably tracked her down, as did her killer, who left her in a pool of blood marked by the tiny footprints of her two-year-old toddlers. The questions remained: Could the authorities ever link Sheila's murder to Blackthorne himself? Was his true obsession high-stakes golf and his extravagant pink mansion -- or was it to destroy Sheila? Following a trail of deception from Oregon and Hawaii to Texas and Florida, Ann Rule gained complete access to Sheila's family, friends, and neighbors, as well as to the detectives and prosecutors on the case. With Every Breath You Take, Ann Rule has written a heart-pounding account of obsession, revenge, and murder that will enthrall readers from beginning to end.",
        "Category": " True Crime , Murder , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Graphing Technology Guide (for use with TI-81, TI-82, TI-85, Casio fx-7700G, Sharp EL 9200-9300, Hewlett-Packard 48G-48GX, BestGrapher Software (IBM), Best Grapher Software (Macintosh)",
        "Authors": "By Larson, Ron",
        "Description": "",
        "Category": " Mathematics , Graphic Methods",
        "Publisher": "D.C. Heath",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Race to Mars: The Mars flight atlas",
        "Authors": "By Frank Miles",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Little Farm in the Ozarks (Little House, The Rocky Ridge Years)",
        "Authors": "By MacBride, Roger Lea and Gilleece, David (ILT)",
        "Description": "The second book in the Rose Years series, the story of the spirited daughter of the author of the beloved Little House series.Rose Wilder, Laura Ingalls Wilder's daughter, is the last of the Little House girls. Going fishing for the first time, starting in a new school, saving the farmhouse from a fire—these are just a few things that happen during young Rose Wilder's first year at Rocky Ridge Farm. She and her parents, Laura and Almanzo, have moved to the Missouri Ozarks to begin a new life. Rose feels out of place as the new girl in her class but gradually gains confidence, and Rocky Ridge truly becomes her home.",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Feng Shui: Arranging Your Home to Change Your Life",
        "Authors": "By Lagatree, Kirsten M., Wong, Angi Ma (INT), and Paine, Frank (ILT)",
        "Description": "With feng shui, the ancient Chinese art of placement, you can change your life by rearranging your home. The careful arrangement of the contents of any room, from kitchen to office, can dramatically improve your health, finances, and relationships.Creating good feng shui can be as simple as moving your furniture, and as subtle as hanging a mirror or highlighting an auspicious color. Feng shui can be as personal as your own decorating taste: Once you set your goals and priorities - whether to improve family harmony or succeed in business - you can put feng shui to work especially for you.This easy-to-use room-by-room handbook provides tips for good feng shui in every part of your home, as well as simple cures for feng shui problems: If you have an interior staircase that directly faces your front door, good luck may be running directly out the door - and out of your life. A mirror on the landing of the stairs can draw in positive energy and circulate it around your home for better luck. For more restful sleep and better health, move your bed away from overhanging beams. A beam that cuts across a bed can create aches and pains in the parts of the body exposed to it - virtually \"cutting in half\" the life of the sleeper - and a beam that divides the bed between the sleepers can result in marital problems. Keep stove burners clean - clogged burners can block your income potential - and use all the burners regularly. The heat and energy passing through these openings will keep your family's business prospects from growing cold. Move your desk so it faces your office door, not the wall. If your back is to the door, you'll be surprised by people coming in - as well as by what they have to say. Enhance your finances by placing a fish tank in your living room or office. The flow of water represents cash flow, and the fish symbolize abundant wealth - there are always more fish in the sea!",
        "Category": " Body, Mind & Spirit , Feng Shui",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Maui Maui",
        "Authors": "By Stephen Cosgrove",
        "Description": "",
        "Category": "",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "39.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Open Secrets: The News TV Won't Tell You",
        "Authors": "By Marjorie Gray, Don Gray",
        "Description": "",
        "Category": "",
        "Publisher": "Pacific Press Pub. Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "American Museum of Natural History's Book of Dinosaurs and Other Ancient Creatures",
        "Authors": "By Wallace, Joseph E.",
        "Description": "Visitors to the American Museum of Natural History's renovated vertebrate paleontology halls are in for an awe-inspiring treat. Featuring fossils of dinosaurs as well as mammals, amphibians, and other ancient creatures, these breathtaking new halls showcase more than eight hundred spectacular prehistoric fossil specimens and share the latest in scientific thinking regarding ancient life. Complete with interactive computer programs and new models that take full advantage of modern technology to depict dinosaurs and other ancient animals as they would have looked millions of years ago, the exhibition halls also display the Museum's best-known and most widely recognized fossil specimens, paying homage to the talent and devotion of the fossil hunters from the Museum's Department of Vertebrate Paleontology who have collected, assembled, and analyzed this world-renowned collection.Now, with The American Museum of Natural History's Book of Dinosaurs and Other Ancient Creatures, dinosaur lovers of all ages can take both an exciting behind-the-scenes look at the explorers who unearthed these intriguing fossils as well as an in-depth armchair tour of the animals on display in the Museum's fossil halls. This beautiful, full-color illustrated volume brings the world-famous Museum, its collectors, and its collection vividly to life.Brimming with offbeat tidbits and anecdotes about the fossil hunters and their discoveries, this insider's companion to the Museum includes profiles of such men as Henry Fairfield Osborn, the first curator of the Department of Vertebrate Paleontology at the Museum; Barnum Brown, the Museum's premier fossil hunter for more than sixty years and the first to discover a specimen of the magnificent carnivore Tyrannosaurus rex; Charles Sternberg, who devoted his outwardly successful but personally troubled life to collecting dinosaur and other fossils; and Roy Chapman Andrews, who is said to be the real-life model for the movie character Indiana Jones and who made the world-famous discovery of the first dinosaur eggs.This volume also details the fascinating work that the Museum's modern-day scientists conduct both in New York City at the Museum and in the field. New discoveries about life on the planet during the dinosaurs' reign are being made regularly, and many of these new theories are discussed here. In fact, the illustrations presented throughout this volume reflect the latest in scientific thinking, showing animals in reconfigured postures, which adds greater insight into their eating and hunting habits as well as their evolutionary lineages.This fact-filled guidebook then moves on to profile the animals themselves. Presented as galleries of dinosaurs, mammals, and other ancient creatures, the entries combine informative and entertaining text detailing each specimen's discovery and describing its life on earth with an original full-color illustration, photograph, or line drawing.A must for dinosaur aficionados, The American Museum of Natural History's Book of Dinosaur and Other Ancient Creatures draws you in to the excitement of exploration and the anticipation of discovery that has always surrounded the field of vertebrate paleontology. Join the Museum's fossil hunters - both past and present - and take a thrilling journey through one of the world's most beloved institutions, stopping to examine some of the most phenomenal creatures ever to stalk the earth.",
        "Category": " Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Dumping Billy",
        "Authors": "By Goldsmith, Olivia",
        "Description": "When multiple women are dumped by Brooklyn bad boy Billy Nolan--and then meet Mr. Right directly after--Kate Jameson hopes to heal her best friend's broken heart by setting her up with Billy, a plan that goes awry when Kate and Billy develop feelings for each other instead. 75,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Bill Clinton: An American Journey: Great Expectations",
        "Authors": "By Hamilton, Nigel",
        "Description": "Bill Clinton, forty-second president of the United States, is the quintessential baby boomer: on the one hand blessed with a near-genius IQ, on the other, beset by character flaws that made his presidency a veritable soap opera of high ideals, distressing incompetence, model financial stewardship, and domestic misbehavior. In an era of cultural civil war, the Clinton administration fed the public an almost daily diet of scandal and misfortune.Who is Bill Clinton, though, and how did this baby-boom saga begin? Clinton's upbringing in Arkansas and his student years at Georgetown, Oxford, and Yale universities help us to see his life not only as a personal story but as the story of modern America.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Baseball's Boneheads, Bad Boys, and Just Plain Crazy Guys",
        "Authors": "By Green, Anne Canevari (ILT) and Sullivan, George",
        "Description": "Profiles past and present professional baseball players known for their quirky superstitions, joke-playing, outrageous behavior, or illegal play, and discusses superstitions and silly ways the players confuse their opponents. Simultaneous.",
        "Category": " Juvenile Nonfiction , Humor , General",
        "Publisher": "Millbrook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Gimmick I: Français Parlé (The Gimmick Series) (Gimmick (W.W. Norton))",
        "Authors": "By Adrienne",
        "Description": "Adrienne's Gimmick helps you speak and understand French. With its vocabulary of words and expressions, the Gimmick can serve as exercise books (with or without a teacher), class book or reference book, and is intended for students of intermediate level with vocabulary range of 5000+ words.",
        "Category": " Foreign Language Study , French",
        "Publisher": "Norton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2013"
        }
    },
    {
        "Title": "A Manager's Guide to Software Engineering",
        "Authors": "By Pressman, Roger S.",
        "Description": "Presents a unique approach to software engineering management for managers with little technical background. Written in a nontechnical style, shows how software engineering methods, metrics, and CASE combine to form a winning strategy for companies of all sizes. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "6.11",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "America the Beautiful: The Stirring True Story Behind Our Nation's Favorite Song",
        "Authors": "By Sherr, Lynn",
        "Description": "We've all sung it a thousand times, and most of us know at least the first verse by heart. \"America the Beautiful\" has been called a hymn, a prayer, even the \"national heartbeat set to music.\" Numerous proposals and half a dozen bills in Congress have tried to replace our national anthem, \"The Star-Spangled Banner,\" with this more lyrical, less militaristic song. But who knows the story behind the song?   In America the Beautiful, Lynn Sherr tells the story of Katharine Lee Bates, a poet and pioneering young English professor at the newly established Wellesley College, who penned \"America the Beautiful\" at age 33, as she gazed over the glorious panorama from the top of Pike's Peak, Colorado. The poem, published two years later on July 4, 1895, struck a chord. Americans embraced it and immediately set it to music, trying out at least 74 different melodies. There were even Mexican, Canadian, and Australian versions. Analyzing the lyrics of \"America the Beautiful\" and the story of Katharine Lee Bates's unusual life, Lynn Sherr opens a window onto the shifting world of late 19th century America. She explores the lingering impact of the Civil War and the dramatic developments in commerce and technology, which shaped the American Century and the popularity of one brilliant, stirring song.",
        "Category": " History , United States , General",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Golf (Fourth Edition)",
        "Authors": "By Virginia and Elwood, Davis Lindblad Nance Craig",
        "Description": "",
        "Category": "",
        "Publisher": "Wm. C. Brown Company Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The life and works of Mr. Anonymous",
        "Authors": "By Willard R. Espy",
        "Description": "",
        "Category": "",
        "Publisher": "Hawthorn Books",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Unforgettable Fire: Past, Present, and Future--The Definitive Biography of U2",
        "Authors": "By Dunphy, Eamon",
        "Description": "An authorized biography of U2, one of the world's most popular rock bands, features information gathered over an eighteen-month period during which the author lived and traveled with the band members",
        "Category": " Music , Instruction & Study , Appreciation",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Tile Indoors and Out, Every Kind and Use",
        "Authors": "By Monte Burch",
        "Description": "",
        "Category": "",
        "Publisher": "Creative Homeowner Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Georgiana: Duchess of Devonshire",
        "Authors": "By Foreman, Amanda",
        "Description": "Provides a dramatic portrait of the colorful life of eighteenth-century British aristocrat Lady Georgiana Spencer, her roles as a society and political hostess, and her disastrous and profligate private life. 20,000 first printing.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Unique Voice of Hillary Rodham Clinton: A Portrait in Her Own Words",
        "Authors": "By Clinton, Hillary Rodham and Osborne, Claire G. (EDT)",
        "Description": "An autobiographical portrait of the first lady answers questions on a range of topics, from her husband's infidelities to her own involvement in Whitewater, and voices her beliefs regarding women's rights, childcare, and health-care reform.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Blood Sport: The President and His Adversaries",
        "Authors": "By Stewart, James B.",
        "Description": "In July 1993, White House official Vincent Foster wrote an anguished lament: \"in Washington...ruining people is considered a sport.\"Nine days later, Foster was dead. Shock at the apparent suicide of one of President Clinton's top aides turned to mystery, then suspicion, as the White House became engulfed in an ever-widening net of unanswered questions. Among the confidential matters Foster was working on when he died was the Clintons' ill-fated investment in Whitewater, an Arkansas land development. Soon conspiracy theories were circulating, alleging that Foster was murdered because he knew too much. And the Whitewater affair, a minor footnote to the 1992 presidential campaign, was suddenly resurrected in the national media. To a degree that left them stunned and at times depressed, the president and first lady have been buffeted by a succession of scandals, from the first lady's profitable commodities trading to the sexual harassment allegations of Paula Jones. Like its predecessors, the Clinton presidency soon found itself engulfed in allegations of scandal, conspiracy, and cover-up.Drawing on hundreds of interviews, many with people speaking publicly for the first time, James B. Stewart sheds startling new light on these and other mysteries of the Clinton White House. In a fast paced narrative that ranges from a backwater town in the Ozarks to the Oval Office, from newsrooms in New York and Los Angeles to offices of conservative think tanks and special prosecutors, the result is an unprecedented portrait of political combat as it is waged in America today.Going beyond the news headlines, Blood Sport also tells the fascinating stories of key figures at the heart of the action, such as Jim McDougal, once Clinton's political and financial mentor, and his glamorous but naive wife, Susan, who swept the Clintons into their real estate empire, then faced financial ruin. It is the story of top national reporters and editors such as Jeff Gerth of The New York Times, who broke the Whitewater story only to find himself the object of controversy. It is the story of David Bossie, the tireless conservative operative who became a one-man army against the Clintons and even penetrated a network news operation. It is the story of Paula Jones, a small-town girl with dreams of Hollywood, and of the Arkansas state troopers who broke their code of silence to add fuel to the Clinton scandals. It is the story of prosecutors Kenneth Starr and Robert Fiske, the secretive, powerful independent counsels whose wide-ranging investigations could vindicate - or destroy - a president.",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Education and Public Health: Natural Partners in Learning for Life",
        "Authors": "By Smith, Jenny",
        "Description": "",
        "Category": "",
        "Publisher": "Association for Supervision & Curriculum Development",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Where Two Worlds Touch",
        "Authors": "By Karpinski, Gloria",
        "Description": "No matter where you are in your own spiritual work, this book can show you how to harness the power of an experience we all share and often fear: change. Discover how you can learn to consciously use change as a spiritual rite of passage. Illustrated with wonderful allegorical tales from all the major spiritual traditions, compelling life stories and transformative exercises, WHERE TWO WORLDS TOUCH shows you that even the mundane details of everyday life offer rich fuel for personal evolution.",
        "Category": " Philosophy , Mind & Body",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The Power of Being Debt Free: How Eliminating the National Debt Could Radically Improve Your Standard of Living",
        "Authors": "By Schuller, Robert Harold and Dunn, Paul David",
        "Description": "Arguing that we have a moral imperative to eliminate the national debt, the authors offer a visionary approach, utilizing the unified efforts of the public and private sectors, to pay off the national debt",
        "Category": " Business & Economics , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "A Woman's Workshop on the Fruit of the Spirit",
        "Authors": "By Swanson, Sandi",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "The Unplayable Lie: The Untold Story of Women and Discrimination in American Golf",
        "Authors": "By Chambers, Marcia",
        "Description": "A woman in Indiana had belonged to the local country club since she was a child. Her parents were members. She gets married and brings her husband into the club. Eventually, she and her husband divorce. He remains a member and she is thrown out....Traditionally and historically, men owned the shares in the clubs - they created the rules that restricted access to their non-working wives. In the past, women accepted such restraints. But today, a young, determined generation of women who grew up believing in equality insist that golf is a key to business success, and refuse to accept the indignities of the past.For five years, seasoned journalist and legal expert Marcia Chambers interviewed these women, following them from living room to courtroom, from clubhouse to statehouse, from fairway to picket line. Now, in the first book to expose the rampant discrimination that pervades the game, Marcia Chambers presents a lively, authoritative look at why traditional activism doesn't work, and offers winning strategies to help women break through these barriers and create positive change. From the informal, conciliatory approaches that have been successful in some clubs to the hardball tactics that become necessary when rules won't bend, The Unplayable Lie offers women a wide range of options and alternatives.From public and resort courses to some of the nation's most exclusive private - even all-male - clubs, Marcia Chambers draws on other true stories of women, and some men, who have challenged their clubs' policies, sometimes successfully, sometimes with disastrous results. She shows how their tenacity ultimately helped change the clubs' agendas, with positive and permanent results.The Unplayable Lie shows women how to claim their rightful status as equal partners enjoying the many benefits of golf - professional, social, and recreational - that have long been enjoyed exclusively by men.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Heart of the Order",
        "Authors": "By Boswell, Thomas",
        "Description": "The Washington Post sports columnist presents a collection of his most memorable baseball writings, offering his selections of a player from each position who exemplifies the best in baseball.",
        "Category": " Sports & Recreation , Training",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Road to Debt Freedom: Paving the Way to Prosperity",
        "Authors": "By Cook, S. Todd and Kiefer, Michael A.",
        "Description": "",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Amer Literary Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Internet Roadmap",
        "Authors": "By Falk, Bennett",
        "Description": "Your journey begins with your first step. The first step to using the Internet is getting connected. The Internet Roadmap will show you how to choose an Internet provider and set up a proper telephone link to the Internet. You'll also find out how to turn your computer into a full-fledged Internet host with a protocol dialup connection, giving you the ability to send and receive text and graphics quickly and easily.Get guidance every step of the way. You'll get step-by-step directions for logging in, downloading files, using electronic mail, and more. You'll also find out how to use Gopher, the World Wide Web, and USENET News, Internet's huge global bulletin board. Even if you've never used an on-line service before, this concise, easy-to-read handbook will put the full power of the Internet in your hands.Find important Internet landmarks. Learn how to use the Internet to find out what's on the Internet. You can find out about anything, from the Paris Metro to the far reaches of the universe. With the help of The Internet Roadmap, you'll always know where you are and what's happening anywhere on the information superhighway.",
        "Category": " Computers , General",
        "Publisher": "Sybex Publishing -",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Dance of Deception: Pretending and Truth-Telling in Women's Lives",
        "Authors": "By Lerner, Harriet Goldhor",
        "Description": "In this fresh, challenging new book, Dr. Lerner invites us to join her in a groundbreaking exploration of the many faces of truth and deception in women's lives. Through examples that are both startlingly intimate and deeply political, Dr. Lerner provides us with bold insights into the countless ways (and whys) that women show the false and hide the real.Deception is not a \"woman's problem,\" or even a uniquely human phenomenon: From viruses to large mammals, deception is continuously at play. We are all affected by lying and faking, by silence and pretending, by self-deception, and by brave - as well as misguided - efforts to tell the truth. Dr. Lerner shows us that women's failure to live authentically and speak truly deserves our closest attention. She illustrates how pretending is so closely linked with femininity that it is, quite simply, what the culture teaches us to do.Truth-telling is the central challenge in women's lives, the foundation of intimacy, self-regard, and joy. At the center of a woman's life is the quest to discover, speak and live her own truth, to cease living a life dictated and defined by others. Yet in the name of \"truth\" or \"being ourselves,\" we may hurt others by disregarding their different realities and move situations from bad to worse.How can we approach the process of truth-telling, of knowing and being known, of refining and deepening our disclosures to one another? Like peace-making, truthtelling does not just \"happen.\" Sometimes it must be worked toward and planned.Drawing on more than two decades of clinical experience, Dr. Lerner articulates her rich philosophy and thoughtful guidelines about speaking out and holding back. She shows us how honesty can sometimes impede truth-telling and how pretending can be a bold move toward the truth, rather than a misdirected flight from it. She examines how patriarchy shapes what truths a woman can uncover, share, and invent about herself. And she teaches us how to widen the path to truth-telling for everyone.The Dance of Deception is Harriet Lerner's most timely, provocative, and passionate work to date. From sexual faking to family secrets, readers will be rewarded with important insights into how we engage in deception and approach truth-telling - a subject that is at the heart of who we are in the world and what kind of world this is.",
        "Category": " Psychology , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Leonard Marshall",
        "Authors": "By Klein, Dave and Marshall, Leonard",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Big Six: Why Americans Can't Trust the Nation's Top Accounting Firms",
        "Authors": "By Stevens, Mark",
        "Description": "Argues that, due to mergers, the six leading accounting firms have lost their sense of professionalism, thereby bringing about a decline in their standards",
        "Category": " Business & Economics , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Food Editors' Hometown Favorites Cookbook: American Regional and Local Specialties",
        "Authors": "By Baker, Jane L. (EDT), Ostmann, Barbara Gibbs (EDT), and Newspaper Food Editors and Writers Association (U. S.) (EDT)",
        "Description": "Shares regional recipes for appetizers, soups, stews, salads, main dishes, side dishes, breads and desserts",
        "Category": " Cooking , General",
        "Publisher": "Hammond World Atlas Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Service of Death and Resurrection",
        "Authors": "By Hickman, Hoyt",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "Nature on the Rampage",
        "Authors": "By De Blij, Harm J. (EDT)",
        "Description": "Shows and describes the impact of hurricanes, tornadoes, blizzards, floods, earthquakes, and meteors",
        "Category": " Social Science , General",
        "Publisher": "Smithsonian Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "North with Lee and Jackson",
        "Authors": "By Kegel, James A.",
        "Description": "Discusses the South's strategy",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "6.14",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Marguerite of Navarre",
        "Authors": "By Chamberlin, Eric Russell",
        "Description": "",
        "Category": "",
        "Publisher": "Dial Press",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Jungle is My Home (Viking Kestrel Picture Books)",
        "Authors": "By Fischetto, Laura",
        "Description": "Describes the jungle and how man's destructive behavior threatens to ruin it as a unique home to a multitude of animals.Describes the jungle and how man's destructive behavior threatens to ruin it as a unique home to a multitude of animals",
        "Category": "",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Bad Elements: Chinese Rebels from Los Angeles to Beijing",
        "Authors": "By Buruma, Ian",
        "Description": "An intriguing study of the China as seen from the perspective of its dissidents profiles these opponents of China's official policies, reporting on exiles in California, religious dissidents in Beijing, the clash between cultural traditions and contemporary politics, the role of Taiwan, the handover of Hong Kong in 1997, and more. 20,000 first printing.",
        "Category": " History , Asia , China",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Kindly Lights: A History of the Lighthouses of Southern New England",
        "Authors": "By Gleason, Sarah C.",
        "Description": "The lighthouse on a lonely point of land has become a romantic symbol of a bygone era when ships plied the seas without the aid of modern technology. In this concise history of the development of the lighthouse system in New England, Sarah Gleason brings to life this fascinating navigational era.Kindly Lights chronicles the history of the lights from the early days of the colonies, when lighthouses were built shoddily and haphazardly, usually soon after an all-too-predictable shipwreck, to the mid-nineteenth century when a national lighthouse system was established. In one compelling chapter, the author uncovers the story of David Melville, who conducted a remarkable experiment in gas lighting at Rhode Island's Beavertail lighthouse in 1817/18. It was to be a short-lived trial; Melville's innovations were resisted by Nantucket whalers fearful of losing their lucrative lighthouse oil market and by federal inspector Winslow Lewis, who plays a part in Melville's failure, as he did in so much of the history of the new nation's attempts to build a rational and technically sound lighthouse system.Kindly Lights includes an illustrated catalog of lights listing all inactive and active lights of southern New England, making it a practical as well as an armchair guide for the lighthouse devotee.In the last chapter we learn of the keepers themselves and of their families: of Newport's Ida Lewis, who became a national heroine for her oarsmanship and bravery and who, when asked how she kept her watch every night, replied, \"The light is my child, and I know when it needs me, even if I sleep.\" Through voices such as these Willett Clark's, Myrtle Corbishly's, George Nemetz's, and many others'--stories of unthinkable isolation, hardship, and dedication unfold.",
        "Category": " Reference , General",
        "Publisher": "Beacon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Crossing the Border",
        "Authors": "By Chernin, Kim",
        "Description": "Kim Chernin breaks literary boundaries and shatters silences in everything she writes - from her explosive memoir In My Mother's House, hailed by Newsday as \"an artistic triumph that brings rich characters to life,\" to The Obsession, which The New York Times called \"eloquently written, passionate...and consistently absorbing,\" Now, in Crossing the Border, Chernin examines a near-forgotten part of her past.More than twenty years ago, Kim Chernin set out on a journey, leaving behind a husband and young daughter. The story of this journey, which took her to a border kibbutz in Israel, becomes a mysterious tale of erotic awakening.Crossing the Border is a powerful story of sex, seduction, and intrigue. Love at the border is a dangerous affair, and in Crossing the Border love in a war zone becomes violent. The wild and tempestuous Kim Chernin set out on an adventure in 1971; the woman who came back was altered forever.Rich, multilayered, and as suspenseful as fiction, Crossing the Border is a tale of passion lived to its extreme. As lyrical as the writing of Marguerite Duras and as daring as the work of Jeanette Winterson, Crossing the Border is certain to provoke and captivate.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Wisdom, Inc. : 26 Business Virtues That Turn Ordinary People into Extraordinary Leaders",
        "Authors": "By Godin, Seth",
        "Description": "A look at the 30 virtues of good business that have inspired success in thousands of leaders, by the man voted Boss of the Year, 1994. Persistent, honest, resourceful, creative -- these adjectives begin to define the qualities of a great business leader. Along with the 26 other virtues enumerated in Wisdom, Inc., they are the fundamentals behind a business strategy that works, but they often get lost beneath passing fads and the color of one&#39;s parachute. Seth Godin&#39;s simple, highly readable handbook of business virtues will help everyone from assistant managers to CEOs cultivate habits that lead to a lifetime of good business. Godin interviewed 1,500 top executives from a wide range of industries to isolate the 30 virtues consistently named by respondents. Each virtue is addressed with inspirational stories of historical business leaders who distinguished themselves by exhibiting that virtue, as well as modern-day accounts by the executives interviewed demonstrating how the virtue has contributed to their companies&#39; successes. Most important, each virtue is accompanied by a section entitled \"To Do Today,\" which provides concrete suggestions for immediately incorporating the virtue into a daily routine. Both practical and inspirational, Wisdom, Inc. is a perfect gift or anyone in business.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Arkadians",
        "Authors": "By Alexander, Lloyd",
        "Description": "Three unusual companions—one fantastic journey! Lucian is on the run from a pair of murderous soothsayers. Joy-in-the-Dance knows magic and marvels, and is on a quest. Fronto is a poet-turned-donkey who wants to break the spell that turned him into an animal. The three of them join forces and set out through Arkadia—on an amazing trip that will change their lives.  “Master storyteller Alexander keeps the action brisk, packs the text with a riveting collection of weird characters, fantastic settings, plot twists, derring-do, heroes, villains, magic, prophecy, humor, shipwrecks, fires—what more could readers ask for?”—Kirkus Reviews",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Little Visits for Families",
        "Authors": "By Jahsmann, Allan Hart and Simon, Martin P.",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , General",
        "Publisher": "Concordia Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Pilot's Wife",
        "Authors": "By Shreve, Anita",
        "Description": "Anita Shreve's hauntingly beautiful #1 bestseller and Oprah's Book Club selection about tragedy, grief, betrayal, and the 'impossibility of knowing another person.'As a pilot's wife, Kathryn has learned to expect both intense exhilaration and long periods alone, but nothing has prepared her for a late-night knock that lets her know her husband has died in a crash.Until now, Kathryn Lyons's life has been peaceful if unextraordinary: a  satisfying job teaching high school in the New England mill town of her  childhood; a picture-perfect home by the ocean; a precocious,  independent-minded fifteen-year-old daughter; and a happy marriage whose  occasional dull passages she attributes to the unavoidable deadening of  time. As Kathryn struggles with her grief, she descends into a maelstrom of publicity stirred up by the modern hunger for the details of tragedy. Even before the plane is located in waters off the Irish coast, the relentless scrutiny of her husband's life begins to bring a bizarre personal mystery into focus. Could there be any truth to the increasingly disturbing rumors that he had a secret life?",
        "Category": " Fiction , Women",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Kato Kaelin: The Whole Truth (The Real Story of O.J., Nicole, and Kato from the Actual Tapes)",
        "Authors": "By Eliot, Marc",
        "Description": "Interviews with Kato Kaelin offer his perspective on the O.J. Simpson murder trial and the relationship between O.J. and Nicole Brown Simpson",
        "Category": " Law , General",
        "Publisher": "Harper Prism",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The World Below",
        "Authors": "By Miller, Sue",
        "Description": "Maine, 1919. Georgia Rice, who has cared for her father and two siblings since her mother's death, is diagnosed, at nineteen, with tuberculosis and sent away to a sanitarium. Freed from the burdens of caretaking, she discovers a nearly lost world of youth and possibility, and meets the doomed young man who will become her lover.Vermont, the present. On the heels of a divorce, Catherine Hubbard, Georgia's granddaughter, takes up residence in Georgia's old house. Sorting through her own affairs, Cath stumbles upon the true story of Georgia's life and marriage, and of the misunderstanding upon which she built a lasting love.",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Suzanne's Diary for Nicholas",
        "Authors": "By Patterson, James",
        "Description": "Discover James Patterson's powerfully moving novel of love, loss, hope, and family.Katie Wilkinson has found her perfect man at last. He's a writer, a house painter, an original thinker-everything she's imagined she wanted in a partner. But one day, without explanation, he disappears from her life, leaving behind only a diary for her to read.This diary is a love letter written by a new mother named Suzanne for her baby son, Nicholas. In it she pours out her heart about how she and the boy's father met, about her hopes for marriage and family, and about the unparalleled joy that having a baby has brought into her life. As Katie reads this touching document, it becomes clear that the lover who has just left her is the husband and father in this young family. She reads on, filled with terror and hope, as she struggles to understand what has happened-and whether her new love has a prayer of surviving.Written with James Patterson's perfect pitch for emotion and suspense, Suzanne's Diary for Nicholas captures beautifully the joys of a new family even as it builds to an overwhelmingly moving climax. This is an unforgettable love story, at once heartbreaking and full of hope.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The King of Torts",
        "Authors": "By Grisham, John",
        "Description": "The office of the public defender is not known as a training ground for bright young litigators.  Clay Carter has been there too long and, like most of his colleagues, dreams of a better job in a real firm.  When he reluctantly takes the case of a young man charged with a random street killing, he assumes it is just another of the many senseless murders that hit D.C. every week.As he digs into the background of his client, Clay stumbles on a conspiracy too horrible to believe.  He suddenly finds himself in the middle of a complex case against one of the largest pharmaceutical companies in the world, looking at the kind of enormous settlement that would totally change his life—that would make him, almost overnight, the legal profession’s newest king of torts...",
        "Category": " Fiction , Legal",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Hot and Bothered",
        "Authors": "By Dennis, Wendy",
        "Description": "A witty look at life in the time of AIDS offers interviews with men and women infected with the virus to address the plight of both sexes, singles, couples; the mores of dating; one-night stands; orgasms; intimacy; and love.",
        "Category": " Social Science , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Truth About Lorin Jones",
        "Authors": "By Lurie, Alison",
        "Description": "Polly Aller, a single parent and compassionate feminist, researches the untimely death of painter Lorin Jones, only to be exposed to fast-paced worlds beyond her experiece and her own difficult questions",
        "Category": " Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Fat Ollie's Book: A Novel of the 87th Precinct",
        "Authors": "By McBain, Ed",
        "Description": "Murders happen every day in the big bad city. They're not such a big deal, you know. Even when the victim is a city councilman as well known as Lester Henderson.  But this is the first time Fat Ollie Weeks of the 88th Precinct has written a novel, ah yes. Called Report to the Commissioner, it follows a cunning detective named Olivia Wesley Watts, who, apart from being female and slim, is rather like Fat Ollie himself. While Ollie's responding to the squeal about the dead councilman, his leather dispatch case is stolen from the back of his car -- and in it, the only copy of his precious manuscript.  Joined by Carella and Kling from the neighboring 87th Precinct, Ollie investigates the homicide with all the exquisite crudeness, insensitivity, and determination for which he is famous. But the theft of his first novel fills Ollie with a renewed passion for old-fashioned detective work.  Following the exploits of one of Ed McBain's most beloved detectives, this lively and complicated novel -- the fifty-second in the award-winning 87th Precinct series -- is perhaps his best book yet.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Good Benito",
        "Authors": "By Lightman, Alan",
        "Description": "From the author of the best-selling Einstein's Dreams comes a wonderfully original, deeply moving, and wryly funny novel about the clash between the absolutes of science and the vagaries of human experience.Bennett always knew he would live a life of science. From the homemade rockets and experiments of his childhood to the complex equations he solved as a professor of physics, his vision has transformed the uncertainty and frailty of life into an order and beauty that he inhabits with deep satisfaction. But his vision betrays him, revealing a profound incompleteness, an inadequacy to confront the contradictions of his life: the black maid who raises him and loves him but cannot welcome him into her own house, the mentally absent father who wishes he'd died a hero in World War II, the self-destructive wife who invites Bennett's cruelty. As Bennett struggles between reason and intuition, he slowly learns to allow the imperfections of daily life - the chaos he has worked so hard to control - to broaden his understanding of the world and his place in it.Written with lyrical sparseness, hilarity mixed with sadness, the story of Bennett's struggle becomes both a beautifully rendered portrait of the emotional life of a scientist and a resonant tale of the disillusionment that haunts us all.",
        "Category": " Fiction , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    }
]