[
    {
        "Title": "Third Eagle, The",
        "Authors": "By MacAvoy, R. A.",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Batman Beyond:New Hero in Town (Pictureback(R))",
        "Authors": "By Peterson, Scott, Tanguay, David (ILT), Kane, Bob, Cooper, Dave (ILT), and Kruse, Brandon (ILT)",
        "Description": "Gotham City in the 21st century. Bruce Wayne, now in his 70s, has hung up his cape for good. Enter Terry McGinnis, teen rebel. Terry stumbles upon the reclusive billionaire's secret, and Wayne agrees to train the fearless youth for a life of crime fighting. With a high-tech Batsuit loaded with gadgets and with the voice of the original Dark Knight in his ear, Terry becomes Batman for the new millennium.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Exiles of the Stars - ACE 22365",
        "Authors": "By Andre Norton",
        "Description": "",
        "Category": "",
        "Publisher": "Ace",
        "Price Starting With ($)": "20.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Amos & Susie",
        "Authors": "By Good, Merle and Benner, Cheryl (ILT)",
        "Description": "Rhymed couplets follow two Amish children through the 12 months of the year in Amos and Susie: An Amish Story. Children will love to follow the activities of the two youngsters through the colorful pages of this charming book--ice skating on a frozen winter pond, visiting a new baby, canning peaches in the summer, baling hay, and going to school.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Good Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Voyage of the Starwolf",
        "Authors": "By Gerrold, David",
        "Description": "When the alien Morthan Solidarity strikes at the Silk Road Convoy--the oldest, richest, and safest caravan in the starlines--the destroyer, LS-1187, leaves her moorings untested to protect the outworlds from invaders",
        "Category": " Fiction , Science Fiction , Adventure",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Hope's Edge: The Next Diet for a Small Planet",
        "Authors": "By Lappe, Frances Moore and Lappe, Anna",
        "Description": "Thirty years ago, Frances Moore Lappé started a revolution in the way Americans think about food and hunger. Now Frances and her daughter, Anna, pick up where Diet for a Small Planet left off. Together they set out on an around-the-world journey to explore the greatest challenges we face in the new millennium. Traveling to Asia, Africa, Latin America, and Europe, they discovered answers to one of the most urgent issues of our time: whether we can transcend the rampant consumerism and capitalism to find the paths that each of us can follow to heal our lives as well as the planet. Featuring nearly seventy recipes from celebrated vegetarian culinary pioneers-including Alice Waters, Mollie Katzen, Laurel Robertson, Nora Pouillon, and Anna Thomas-Hope's Edge highlights true trailblazers engaged in social, environmental, and economic transformations.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "1000 Recipies",
        "Authors": "By Martha Day",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House,",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Road from Paradise",
        "Authors": "By Mestrovic, Stjepan G., Goreta, Miroslav, and Letica, Slaven",
        "Description": "Are we really at the \"end of history,\" as some have claimed? Has the United States really won the Cold War? Will liberal democracy now triumph over nationalism and totalitarianism? The authors of this book warn that history may already have returned in newly free Eastern Europe, with war in the Balkans, capitalism not yet established, and a number of new democracies already turning autocratic. The West has responded to these sinister developments with paralysis and confusion.The 1989 fall of communism in Eastern Europe occurred in a period when Western intellectuals were involved in a confusing discourse on a number of other dramatic endings: the end of modernity, the end of the century, even the possible end of sociology. Against this backdrop, the authors focus on continuities based on the \"habits of the heart\" of those who threw off communism in Eastern Europe, contrasting them with Western modes of thought. Their cultural explanation draws on theories of Tocqueville, Durkheim, and others to examine positive as well as negative aspects of the nations that survived communism. While focusing on the Balkans, they also make cautious prognoses for the rest of Eastern Europe.They conclude that, in addition to the scenario desired by the West - establishment of a market economy, democracy, and pluralism in postcommunist lands - other possible scenarios need to be recognized, including continued balkanization, conflict, and chaos, and the emergence of new totalitarian states. If the West is to plant democracy in Eastern Europe, it must base its actions on a realistic appraisal of the historical and cultural forces at work. Boosterish optimism and unrealistic hopes, they warn, are an unrealistic response to the fall of communism.",
        "Category": " Social Science , General",
        "Publisher": "University Press of Kentucky",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Firestar",
        "Authors": "By Flynn, Michael",
        "Description": "It is the beginning of the twenty-first century and one woman is determined to bring America and the world back on track in the technological future. She has the strength, the intelligence, the money. It will be done. This is the story of the rebirth of innovative technological expansion on Earth and in space.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Science Fiction",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Thunder Rift",
        "Authors": "By Farrell, Matthew",
        "Description": "After Thunder was chaos. The energy output of the inexplicable alien artifact that humans called Thunder Rift shattered the fragile links that held Earth's highly technological society together. And the only world young Taria Spears knew fell violently to pieces.Thirty years later, the adult Taria -- an anthropologist -- has seen the planet renewed and the true nature of Thunder Rift revealed. An artificially constructed \"wormhole,\" it was created to provide human beings with a bridge to somewhere else in the galaxy...or as an open door for an invading alien fleet.Joining the crew of the exploratory ship Lightbringer, Taria is venturing into the wormhole on a mission of knowledge, contact and, possibly, survival. What awaits her on the other side is a destiny too powerful to deny -- and a perplexing alien culture that thrives in a strange aural landscape, where what is seen is meaningless...and where devastating truths lie in silence.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Mary, Mary: A Novel",
        "Authors": "By Parsons, Julie",
        "Description": "Late on a hot Dublin night, Dr. Margaret Mitchell, a widow in her mid-forties, phones the police with a sense of dread and foreboding. Her daughter, Mary, went out with some friends twenty-four hours ago. She has not come home.Two days later, Margaret receives an anonymous phone call. Having worked in an institution for the criminally insane, Margaret is all too familiar with what she hears on the other end of the line and it fills her with terror.A week later an old man walking his dog beside a canal finds the body of Mary Mitchell half-submerged in the water. She has been raped, tortured, and beaten to death.Inspector Michael McLoughlin, who has a reputation as a drinker and a womanizer, is assigned to the case. Although he was once a successful detective, there are now doubts about his stability. McLoughlin is taken with Margaret's beauty and the force of her personality: he becomes obsessed and watches her constantly.The killer, meanwhile, has transferred his desire to damage and kill to Margaret, who finds herself drawn to the man who ruined her life and destroyed her daughter's.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Body by God: The Owners Manual for Maximized Living",
        "Authors": "By Lerner, Ben",
        "Description": "In the human body, God created a perfect design, equipped with all the organs, tissues, and cells necessary for health, production, and reproduction. The problem, asserts Dr. Ben Lerner, is when we as humans interfere with God's design for our bodies. Junk food, high-stress living, and neglecting exercise are just a few of the things we do to hinder our bodies' performance.In Body by God, Dr. Lerner offers a comprehensive plan for getting in touch with our bodies in four areas: nutrition, exercise, stress management, and time management. His \"5-in-5\" plan is designed to instill the good habits that will lead to optimum health benefits. Readers will learn how to get in shape with 10-minute workouts, reprogram the way they react to stress, and more. \"Owner's Manual Tips\" give specific ways to apply the material to real life. Our bodies are \"fearfully and wonderfully made.\" With the help of Body by God, readers will learn how to achieve the highest level of performance from God's handiwork.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Stephen Hawking's Universe: The Cosmos Explained",
        "Authors": "By Hawking, Stephen W. and Filkin, David",
        "Description": "The lavishly illustrated companion to the fall 1997 BBC-PBS televison series offers a fascinating glimpse of the efforts of Stephen Hawking and other scientists to understand the mysteries and origins of the universe. TV tie-in.",
        "Category": " Science , Cosmology",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Story of Edgar Sawtelle: A Novel",
        "Authors": "By Wroblewski, David",
        "Description": "Born mute, speaking only in sign, Edgar Sawtelle leads an idyllic life with his parents on their farm in remote northern Wisconsin. For generations, the Sawtelles have raised and trained a fictional breed of dog whose thoughtful companionship is epitomized by Almondine, Edgar's lifelong friend and ally. But with the unexpected return of Claude, Edgar's paternal uncle, turmoil consumes the Sawtelles' once peaceful home. When Edgar's father dies suddenly, Claude insinuates himself into the life of the farm - and into Edgar's mother's affections.Grief-stricken and bewildered, Edgar tries to prove Claude played a role in his father's death, but his plan backfires - spectacularly. Forced to flee into the vast wilderness lying beyond the farm, Edgar comes of age in the wild, fighting for his survival and that of the three yearling dogs who follow him. But his need to face his father's murderer and his devotion to the Sawtelle dogs turn Edgar ever homeward.",
        "Category": " Fiction , Family Life",
        "Publisher": "Ecco",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "The Destiny Dice (Book 1 of The Gaming Magi)",
        "Authors": "By Bischoff, David",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Roc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Chaining the Lady (Cluster, Book 2)",
        "Authors": "By Anthony, Piers",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Two to Conquer (Darkover: The Hundred Kingdoms)",
        "Authors": "By Bradley, Marion Zimmer",
        "Description": "",
        "Category": "",
        "Publisher": "DAW",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "The Blind Archer",
        "Authors": "By Betancourt, John",
        "Description": "",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "On Chesil Beach: A Novel",
        "Authors": "By McEwan, Ian",
        "Description": "A novel of remarkable depth and poignancy from one of the most acclaimed writers of our time.It is July 1962. Florence is a talented musician who dreams of a career on the concert stage and of the perfect life she will create with Edward, an earnest young history student at University College of London, who unexpectedly wooed and won her heart. Newly married that morning, both virgins, Edward and Florence arrive at a hotel on the Dorset coast. At dinner in their rooms they struggle to suppress their worries about the wedding night to come. Edward, eager for rapture, frets over Florence’s response to his advances and nurses a private fear of failure, while Florence’s anxieties run deeper: she is overcome by sheer disgust at the idea of physical contact, but dreads disappointing her husband when they finally lie down together in the honeymoon suite.Ian McEwan has caught with understanding and compassion the innocence of Edward and Florence at a time when marriage was presumed to be the outward sign of maturity and independence. On Chesil Beach is another masterwork from McEwan—a story of lives transformed by a gesture not made or a word not spoken.",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Young Helen Keller: Woman of Courage (First-Start Biographies)",
        "Authors": "By Durrell, Julie (ILT) and Benjamin, Anne",
        "Description": "A simple biography of the blind and deaf woman who spent her life writing and helping others with similar disabilities",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Period.: A Girl's Guide",
        "Authors": "By Loulan, Joann, Quackenbush, Marcia (ILT), Dyrud, Chris Wold (ILT), and Worthen, Bonnie",
        "Description": "For parents who do not know how or where to begin this discussion, here are ideas to get them started. A detachable Parent's Guide will lead them through the learning process for themselves and their daughtersand even their sons. The Parent's Guide can also be found in its entirety on the Book Peddlers website at www.bookpeddlers.com. In it you will find:Talking About Menstruation What's The Right Age To Share Information? Who Begins?What About The Boys? Creating Your Own Right-of-Passage.",
        "Category": " Juvenile Nonfiction , Health & Daily Living , Maturing",
        "Publisher": "Book Peddlers, The",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "What's the Big Idea, Ben Franklin?",
        "Authors": "By Fritz, Jean",
        "Description": "A brief biography of the eighteenth-century printer, inventor, and statesman who played an influential role in the early history of the United States.",
        "Category": "",
        "Publisher": "Coward Mc Cann",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Anybody's Bike Book",
        "Authors": "By Cuthbertson, Tom and Morrall, Rick (ILT)",
        "Description": "Still unparalleled for its friendly tone, easy-to-follow instructions, and fun funky illustrations. A Ten Speed Classic!From the Hardcover edition.",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The Monitor: Civil War Battleship, Level 4",
        "Authors": "By Day, Larry (ILT) and Thompson, Gare",
        "Description": "The U.S.S. Monitor was an entirely new type of warship when it launched in 1862. Dubbed \"the forefather of the modern Navy,\" this ironclad ship changed how wars are fought at sea. But on New Year's Eve, 1862, it sank off the coast of North Carolina in a terrible storm. No one thought the Monitor could be raised, but after 140 years, parts of the ironclad have finally been brought to the surface. This book chronicles the Monitor's revolutionary design, exciting battle, and intriguing excavation.Illustrated by Larry Day.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Glow In The Dark Animals",
        "Authors": "By Hirschmann, Kris and Cassels, Jean (ILT)",
        "Description": "Newly independent readers will enjoy learning about the viperfish, the deep-sea squid, fire worms, and other exotic creatures that glow like fireflies, in a nonfiction reader which includes an index of key terms. Original.",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Max Onstage (Jeffrey and the Third Grade Ghost #5)",
        "Authors": "By Stine, Megan and Stine, H. William",
        "Description": "Max, the incorrigible ghost who is forever happily haunting third-grader Jeffrey, gives a shy classmate some help with drama skills and makes him a star.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Jeffrey and the Third-Grade Ghost: Haunted Halloween: Volume 2 (Jeffrey the Third Grade Detective)",
        "Authors": "By Stine, Megan and Stine, H. William",
        "Description": "When Ricky Reyes dares Jeffrey to get a bloody dagger out of the old McGyver house on Halloween night, Jeffrey is counting on Max, his ghostly friend, to help him.",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "The Outlaws of Sherwood",
        "Authors": "By McKinley, Robin",
        "Description": "Robin Longbow is a sub-apprentice forester in Sherwood Forest, barely eking out a living-and barely able to control his temper when he is confronted by the taunts of the Chief Forester's favorite. One careless shot, and he has killed the man. From then on, Robin is on the run-but he is not alone. Joined first by his friends Much and Marian, then by more and more people who despise the Norman lords who tax them blind, Robin builds a community of Saxon outlaws deep in Sherwood who risk the gallows and the sword for the sake of justice and freedom. \"In the tradition of T. H. White's reincarnation of King Arthur, a novel that brings Robin Hood . . . delightfully to life!\" (Kirkus Reviews)",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Five-Minute Crimebusters: Clever Mini-Mysteries",
        "Authors": "By Smith, Stan and O'Malley, Kathleen (ILT)",
        "Description": "Murders most foul, criminal capers, and miscellaneous mysteries:welcome to the world of wily logician Thomas P. Stanwick. Join himas he fingers the guilty parties in homicides, robberies, frauds,and espionage--and helps his neighbors with less felonious puzzlers.Take a careful look at the facts, the timing, and the suspects--andtry to get to the bottom of these whodunits as quickly as Stanwick!",
        "Category": " Juvenile Nonfiction , Games & Activities , Puzzles",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Mysterious Max: (#1) (Jeffrey the Third Grade Detective)",
        "Authors": "By Stine, Megan and Stine, William",
        "Description": "A wisecracking ghost from the 1950s?   It’s the fifth day of school and Jeffrey Becker is in trouble again! Jeffrey can’t help it. He likes to tell a good story. The trouble is, his teacher calls those stories lies. And now he has to stay after school.   Jeffrey isn’t the only one with the detention. When his teacher leaves the classroom Jeffrey realizes that he has company—a ghost from the 1950s named Max. Max is one cool ghost, but he manages to get Jeffrey into more trouble than Jeffrey gets into on his own. And Jeffrey knows that no one will believe him when he says his new best friend is a ghost!",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Pure Dead Magic",
        "Authors": "By Gliori, Debi",
        "Description": "Things are not right at the Strega-Borgia castle. Signor Luciano Strega-Borgia has been kidnapped. Signora Baci Strega-Borgia is struggling with her spells at the Advanced Witchcraft Institute.Titus and Pandora don’t like their suspiciously cheerful and fearless new nanny. Baby Damp has been accidentally shrunk, e-mailed, and lost on the World Wide Web. And to top it off, there’s a gangster in a bunny suit lurking about. . . .This seriously over-the-top, gothic romp is sure to have readers clamoring for the next Strega-Borgia adventure.From the Hardcover edition.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Janice VanCleave's Guide to the Best Science Fair Projects",
        "Authors": "By VanCleave, Janice Pratt",
        "Description": "Let Janice VanCleave help you create your own winning science projectWhere can you find lots of interesting ideas?How do you begin a project?How can you create an eye-catching display?What can you do to impress the judges?Discover the answers to these and other questions in this complete guide to winning science fair projects. Learn how to develop a topic from any idea, and find out the best ways to create, assemble, and present projects--including special tips on how to display them. Try out some of Janice VanCleave's favorite experiments on topics from astronomy and biology to chemistry, math, and engineering. As you have fun completing these experiments, you'll be learning the secrets of science fair success.Praise for Janice VanCleave's books\"Stunningly clear, direct, and informative projects.\"--School Library Journal\"[They] not only teach children the basics of science, but also entertain along the way . . . great for kids.\"--Parentguide",
        "Category": " Juvenile Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Clever Costume Creating for Halloween",
        "Authors": "By Singleton, Suzanne and Ports, Linda (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "Twenty-Nine Angels Publishing",
        "Price Starting With ($)": "6.26",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Greatest Course That Never Was: The Secret of Augusta National's Lost Course",
        "Authors": "By Veron, J. Michael",
        "Description": "",
        "Category": " Fiction , Sports",
        "Publisher": "Sleeping Bear Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Disney's Brother Bear",
        "Authors": "By Disney Storybook Artists, Marsoli, Lisa Ann, Disney's Global Design Group, and Walt Disney Pictures (COR)",
        "Description": "This 72-page hardcover storybook retells Disney’s new animated film Brother Bear, an epic tale about a boy who is transformed into a bear and forced to see the world through the eyes of his enemy. Combining humor, drama, and thrilling animation, this magical coming-of-age story is sure to thrill and entertain young readers.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Polar City Blues",
        "Authors": "By Kerr, Katharine",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Master of the World",
        "Authors": "By Verne, Jules",
        "Description": "Three men set out to capture an unknown inventor who owns a machine enabling him to dominate the world",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Things That Fly (Leap frog)",
        "Authors": "By n/a",
        "Description": "Illustrations and brief text describe various flying crafts, such as a jet airplane, space shuttle, hot-air balloon, and hang glider.",
        "Category": "",
        "Publisher": "New Seasons Pub",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Emblems of the Mind",
        "Authors": "By Rothstein, Edward",
        "Description": "Unravels the mystery of the relationship between music and mathematics, discussing their differences and their surprising similarities--including their origins and historical links",
        "Category": " Music , Instruction & Study , Appreciation",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Theories of Modern Art: A Source Book by Artists and Critics (California Studies in the History of Art) (Volume 11)",
        "Authors": "By Taylor, Joshua C., Chipp, Herschel B., and Selz, Peter",
        "Description": "Herschel B. Chipp&#39;s Theories of Modern Art: A Source Book By Artists and Critics is a collection of texts from letters, manifestos, notes and interviews. Sources include, as the title says, artists and critics—some expected, like van Gogh, Gauguin, Apollinaire, Mondrian, Greenberg, just to name a few—and some less so: Trotsky and Hitler, in the section on Art and Politics. The book is a wonderful resource and insight into the way artists think and work.",
        "Category": " Art , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1968"
        }
    },
    {
        "Title": "In Madeleines Kitchen P",
        "Authors": "By Kamman, Madeleine",
        "Description": "Available for the first time in paperback, In Madeleine's Kitchen quickly established itself as a cooking classic when it was first published in 1984. Hailed as \"the most innovative cook in America today\" by the Washington Post, Madeleine Kamman does not simply offer a collection of recipes: she teaches, analyzes, and explains. In Madeleine's Kitchen is composed of more than 350 of Mrs. Kamman's personal combinations, inspired by the food cooked by women not only in France, but throughout the world, ranging from complex mousselines to grilled meats and fresh vegetables.",
        "Category": " Cooking , Reference",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Harriet Roth's Deliciously Healthy Jewish Cooking: 350 New Low-Fat, Low-Cholesterol, Low-Sodium Recipes for Holidays and Every Day",
        "Authors": "By Roth, Harriet",
        "Description": "Harriet Roth, a former director of the Pritikin Longevity Center Cooking School and a true pioneer in the art of healthful cooking, has adapted more than 300 dishes from Jewish culinary traditions around the world to meet today's nutritional standards. Remembering all her own favorite dishes from her family kitchen and determined to keep the authentic flavors everyone loves, she has trimmed the fat and cholesterol from delicious classics and come up with a whole new Jewish menu: a savory Cholent, Passover Chocolate Torte, \"Reformed\" Rugaleh, Farfel and Asparagus Risotto, Sweet and Sour Stuffed Cabbage, a delicious Vegetable Stew for Shabbat, and hundreds more wonderful dishes for everyone who loves good Jewish food but is concerned with good health.",
        "Category": " Cooking , Regional & Ethnic , Jewish & Kosher",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Copycat",
        "Authors": "By Spindler, Erica",
        "Description": "\"I won't talk to anyone else — only you. Another child, another sweet girl will die. You can stop it, Kitt. Don't you want to stop it?\"Five years ago, three young victims were found dead, posed like little angels. There were no witnesses. Strangely clean scenes. The Sleeping Angel Killer called his despicable acts \"the perfect crimes.\"The case immobilized the close-knit community of Rockford, Illinois, and nearly destroyed homicide detective Kitt Lundgren's career — and her life. During the investigation, Kitt tragically lost her own child to illness. She was overwhelmed by the death of her daughter, and the final blow was the crushing realization that she let the killer get away. Now the Sleeping Angel Killer is back.Familiar with every nuance of the cold-case file, Kitt knows there's something different about this new rash of killings — a tiny variation that opens terrifying new possibilities. Is the Sleeping Angel Killer really back, or is a copycat killer re-creating the original \"perfect crimes\"? But Kitt has no authority in this investigation. Young, ambitious detective Mary Catherine Riggio is heading up the Sleeping Angel Killer case. M.C. knows that Kitt wants back in and she's smart enough to realize that Kitt's obsession with the case has given the detective an insight that M.C. lacks. But M.C., intent on proving herself, fears Kitt will blow the investigation — again.Then Kitt starts receiving disturbing phone calls. It's him — the Sleeping Angel Killer — and he makes Kitt an unthinkable offer: help in finding his copycat. Forced to rely on each other, Kitt and M.C. must decide whether to place their trust in a murderer...or risk becoming victims of a fiend who has taken the art of the perfect murder to horrific new heights.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "For Yankee Fans Only",
        "Authors": "By Wolfe, Rich",
        "Description": "",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Lone Wolf Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Washington, D.C. Off the Beaten Path, 2nd: A Guide to Unique Places (Off the Beaten Path Series)",
        "Authors": "By Whitman, William B.",
        "Description": "Explore the Old Executive Office Building Downtown, browse the specialty shops along Georgetown's Wisconsin Avenue, and dine at Ben's Chili Bowl on U Street. Readers will find the hidden places that most tourists miss in the nation's capital.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Richard Scarry's A Day at the Airport (Pictureback(R))",
        "Authors": "By Scarry, Richard and Scarry, Huck",
        "Description": "Join Richard Scarry’s beloved characters Huckle Cat, Sally, and Lowly Worm for a day of adventure and discovery at the airport. Airplane fans will get an up-close look at the terminal, the control tower, the runway, and more! Featuring over 70 labeled words and a sticker sheet! Have hours of fun with this busy adventure from the one and only Richard Scarry!",
        "Category": " Juvenile Fiction , Transportation , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Macmillan McGraw Hill Reading 1st Grade Level 2 Here We Grow",
        "Authors": "By Mcgraw- Hill",
        "Description": "",
        "Category": "",
        "Publisher": "Mcgraw-Hill",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Patios and Walkways 1-2-3: Design and Build Beautiful Outdoor Living Spaces (Expert Advice from the Home Depot)",
        "Authors": "By Holms, John P. (EDT) and Day, Jeff (EDT)",
        "Description": "Design and installation techniques, tips, and shortcuts used by professionals.Provides step-by-step instructions, timeframe for completing plus skills and materials lists.\"Wisdom of the Aisles\" on every page guarantees success.Details how to design, layout, maintain, and work with a variety of materials in building patios and walkways.Features walkways using soft set paths, hard bed paths, brick and paver patterns, and boardwalks.",
        "Category": " House & Home , Do-It-Yourself , Masonry",
        "Publisher": "The Home Depot",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Exercise with Pilates & yoga",
        "Authors": "By Robinson, Lynne",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The New Cottage Home: A Tour of Unique American Dwellings",
        "Authors": "By Tolpin, Jim",
        "Description": "The New Cottage Home taps into today's move toward lifestyle simplicity and the idea that living space should be rich in details, conservative of resources, and no larger than necessary. Jim Tolpin celebrates the diversity and charm of 30 sample cottages, from a Pacific Northwest cottage modeled after a French hunting lodge to a \"salvage yard vernacular cottage\" built with junkyard materials.Each featured home reflects individual personality, priorities, and lifestyle. Whether by the water, on a mountain, or in a forest, field, or town, these homes emphasize quality of place over quantity of space.",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Sit & Solve IQ Tests (Sit & Solve Series)",
        "Authors": "By Simpson, Fraser",
        "Description": "02 Books for the smallest room in the house...That generate BIG salesIt's clear--people everywhere are sitting and solving! That's why more than 110,000 copies of this amazing series have nearly jumped out of stores. With their amusing shape, great content, and popular price, these compilations are a must-have on every puzzler's shelf. And the quality of the problems, games, and trickery is absolutely superb and fabulously diverse. Go for great word searches, stimulating criss-cross puzzles, brilliant brainteasers; cunning logic games, cannily challenging IQ Tests, mysterious mathamatricks, and lots more.",
        "Category": " Games , Logic & Brain Teasers",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Secrets of Success (Secrets Gift Books)",
        "Authors": "By Walters, J. Donald",
        "Description": "Popular gift book series offers a seed thought for every day of the month. By nurturing this bhijan (seed) through affirmation and repetition, we can help create transformation in our lives.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Crystal Clarity Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Stencil It!: Kids' Projects",
        "Authors": "By Buckingham, Sandra",
        "Description": "In Stencil It! kids can learn how to decorate almost everything they own, from sneakers and school notebooks to jean jackets. With step-by-step instructions and colorful how-to photographs, this beginners' guide is perfect not only for kids who insist they can't draw but for kids who do nothing but. Sandra Buckingham describes how to set up, how to select materials and how to master the basic techniques involved in creating both original and classic designs, including birds, leaves, flowers, lizards, turtles, cave-art figures and more. The author's message is simple: With these easy-to-learn methods and a few affordable supplies, everyone can learn to stencil",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "Camden House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Penny Arcade Volume 3: The Warsun Prophecies",
        "Authors": "By Holkins, Jerry",
        "Description": "So it was written, so it shall be. The coming foretold, sealed into the hands of fate by the lips of the prophets from another time. The mystery is revealed and the great plan will now come to its fruition! Its number shall be three. From the far horizons, across the deepest reaches of the ethereal gulf, the thunderous echo of its name shall be heard! PENNY ARCADE!Penny Arcade, the most powerful webcomic in the universe, returns! The third volume of this cultural and supernatural phenomenon, The Warsun Prophecies, brings you every Penny Arcade strip published online in 2002 A.D., encased with the dark secrets of the mad prophets known as Gabe and Tycho. Behold! It has been foretold!",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Dark Horse Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Houghton Mifflin Reading: The Nation's Choice: Theme Paperbacks, Above-Level Grade 2.2 Theme 4 - Spotlight on Cody",
        "Authors": "By Duffey, Betsy and Thompson, Ellen (ILT)",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Best Breads Any Way You Slice It",
        "Authors": "By Rob Wanless",
        "Description": "",
        "Category": "",
        "Publisher": "American Cooking Guild",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Webster's Legal Speller",
        "Authors": "By Springfiel",
        "Description": "",
        "Category": " Law , General",
        "Publisher": "Merriam-Webster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Unclutter Your Mind: 500 Ways to Focus on What's Important",
        "Authors": "By Smallin, Donna",
        "Description": "A calm, collected mind is the best defense against stress. In Unclutter Your Mind, Donna Smallin shows you how to address the emotional and psychological clutter that can rob you of a balanced, rewarding, meaningful life. Offering 500 creative ideas to help you clear away unnecessary worries, daily stressors, and unhelpful habits, Smallin helps you clear your head and focus on what’s most important to you. Just a few minutes each day is enough to help you establish clear priorities, develop stronger relationships, and achieve emotional fulfillment.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Claire Marvel: A Novel",
        "Authors": "By Schwartz, John Burnham",
        "Description": "A young man and woman meet, love each other, and are consumed.  It’s a story as old as romance itself, but in this enthralling novel John Burnham Schwartz tells it with heart-stopping new immediacy.  In the middle of a rainstorm Julian Rose, a self-effacing Harvard graduate student, takes refuge beneath a girl’s yellow umbrella. The girl, the woman, is Claire Marvel, lovely, mercurial, mired in family tragedy. She is the last person someone like Julian should fall in love with. But he does. What ensues is a great and difficult passion strewn with obstacles–not least those arising from Claire and Julian’s disparate characters. And as these young people find and lose each other, then seek each other anew, Schwartz places romantic love within an entire continuum of attachments that require the full reserves of our openness and courage.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Persian Brides",
        "Authors": "By Dorit Rabinyan",
        "Description": "",
        "Category": "",
        "Publisher": "Canongate Books Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Living Treasures: An Odyssey Through China's Extraordinary Nature Reserves",
        "Authors": "By Tang, Xiyang and Xiyang, Tang",
        "Description": "Describes rare and unique Chinese animal species, discusses Chinese herbs, pandas, ibises, wild elephants, cranes, swans, golden monkeys, and silver fir trees, and looks at wilderness areas in the country",
        "Category": " Nature , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Black Veil",
        "Authors": "By Moody, Rick",
        "Description": "In this searing, brilliantly acclaimed memoir, one of the most admired writers of his generation reveals how a decade of alcohol, drugs, and other indulgences led him not to the palace of wisdom but to a psychiatric hospital in one of New York's less exalted boroughs.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Goodnight, Nebraska",
        "Authors": "By McNeal, Tom",
        "Description": "At the age of 17, Randall Hunsacker shoots his mother's boyfriend, steals a car and comes close to killing himself. His second chance lies in a small Nebraska farm town, where the landmarks include McKibben's Mobil Station, Frmka's Superette, and a sign that says The Wages of Sin is Hell. This is Goodnight, a place so ingrown and provincial that Randall calls it \"Sludgeville\"-until he starts thinking of it as home. In this pitch-perfect novel, Tom McNeal explores the currents of hope, passion, and cruelty beneath the surface of the American heartland. In  Randall, McNeal creates an outcast whose redemption lies in Goodnight, a strange, small, but ultimately embracing community where Randall will inspire fear and adulation, win the love of a beautiful girl and nearly throw it all away.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Psychological Needs and Cultural Systems: A Case Study (Insight Series on Psychology)",
        "Authors": "By Aronoff, J.",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold Inc.,U.S.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1967"
        }
    },
    {
        "Title": "Nine Symphonies of Beethoven in Score...miniature Score Series",
        "Authors": "By Albert E. Weir",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace & Company",
        "Price Starting With ($)": "26.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1935"
        }
    },
    {
        "Title": "The Innocent: (War of the Roses, Book 1) (The Anne Trilogy)",
        "Authors": "By Graeme-Evans, Posie",
        "Description": "The year is 1450, a dangerous time in medieval Britain. Civil unrest is at its peak and the legitimacy of the royal family is suspect. Meanwhile, deep in the forests of western England, a baby is born. Powerful forces plot to kill both mother and child, but somehow the newborn girl survives. Her name is Anne.  Fifteen years later, England emerges into a fragile but hopeful new age, with the charismatic young King Edward IV on the throne. Anne, now a young peasant girl, joins the household of a wealthy London merchant. Her unusual beauty provokes jealousy, lust, and intrigue, but Anne has a special quality that saves her: a vast knowledge of healing herbs. News of her extraordinary gift spreads, and she is called upon to save the ailing queen. Soon after, Anne is moved into the palace, where she finds her destiny with the man who will become the greatest love of her life -- the king himself.",
        "Category": " Fiction , Historical",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Virgin's Lover",
        "Authors": "By Gregory, Philippa",
        "Description": "From #1 New York Times bestselling author and “queen of royal fiction” (USA TODAY) comes a riveting and scandalous love triangle between a young woman on the brink of greatness, a young man whose ambition far exceeds his means, and the wife who cannot forgive them.In the autumn of 1558, church bells across England ring out the joyous news that Elizabeth I is the new queen, yet one woman hears the tidings with utter dread. She is Amy Dudley, wife of Sir Robert, and she knows that Elizabeth’s ambitious leap to the throne will draw her husband back to the center of the glamorous Tudor court, where he was born to be.  Elizabeth’s excited triumph is short-lived. She has inherited a bankrupt country where treason is rampant and foreign war a certainty. Her faithful advisors warns her that she will survive only if she marries a strong prince to govern the rebellious country, but the one man Elizabeth desires is her childhood friend, the ambitious Robert Dudley. As the young couple falls back in love, a question hangs in the air: can he really set aside his wife and marry the queen? When Amy is found dead, Elizabeth and Dudley are suddenly plunged into a struggle for survival.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Queen's Fool",
        "Authors": "By Gregory, Philippa",
        "Description": "#1 New York Times bestselling author and “queen of royal fiction” (USA TODAY) Philippa Gregory weaves a spellbinding tale of a young woman with the ability to see the future in an era when destiny was anything but clear.Winter, 1553. Pursued by the Inquisition, Hannah Green, a fourteen-year-old Jewish girl, is forced to flee with her father from their home in Spain. But Hannah is no ordinary refugee; she has the gift of “Sight,” the ability to foresee the future, priceless in the troubled times of the Tudor court. Hannah is adopted by the glamorous Robert Dudley, the charismatic son of King Edward’s protector, who brings her to court as a “holy fool” for Queen Mary and, ultimately, Queen Elizabeth. Hired as a fool but working as a spy; promised in wedlock but in love with her master; endangered by the laws against heresy, treason, and witchcraft, Hannah must choose between the safe life of a commoner and the dangerous intrigues of the royal family that are inextricably bound up with her own yearnings and desires.  Teeming with vibrant period detail and peopled by characters seamlessly woven into the sweeping tapestry of history, The Queen’s Fool is a rich and emotionally resonant gem from a masterful storyteller.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Totally Crushed! (Lizzie McGuire #2)",
        "Authors": "By Thorpe, Kiki",
        "Description": "Someone has a crush on Lizzie McGuire: Larry Tudgeman, the biggest geek in North America. When he asks her out, Lizzie automatically says no, but soon her conscience makes her feel bad about it.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Breakfast with the Ones You Love",
        "Authors": "By Fintushel, Eliot",
        "Description": "Meet Lea Tillim, aka Cadaver Dimples, Star of Morgues and Emergency Rooms. Scarecrow  thin, with a sharp crew cut and a dead face, Lea’s a girl with a talent. She can  think you into a heart attack if you cross her—or, if she’s feeling kind, just a  bad case of indigestion. She has only one friend in the world, her cat, Tule. You  see, a girl like Lea can’t be too careful whom she shows her talent to. In her experience  it only leads to troubles and tragedies. Now it’s led her to Jack Konar, who’s secretly  building something strange and wonderful in an abandoned section of the local Sears  and Roebuck. According to Jack, it’s all part of a master plan to rescue the Chosen  from this godforsaken planet. But the agents of the Evil Ones–cleverly disguised  as ordinary people and sometimes even cats–are trying to stop him. Jack needs a girl  with Lea’s special talents. It would all sound just too crazy for words if the most  dangerous and unexpected thing of all hadn’t happened. After years of the best poker  face grief could buy, Lea finds herself slowly coming back to life . . . and falling  in love with the savior of the world.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Blonde Geisha",
        "Authors": "By Bacarr, Jina",
        "Description": "The early summer of 1892 brought a heavy rainy season that year in Japan. Plum Rain, the Japanese called it, because it comes when the fruit bulges with ripeness and promise. Like a young girl reaching womanhood.A girl like me.In the ancient Japanese tradition of beauty and grace, sex and erotic fantasies are hidden secrets that only a select few may learn, and which are forbidden to foreigners. But when a threat to her father's life puts her own in jeopardy, young Kathlene Mallory is sent to live in safety at the Tea House of the Look-Back Tree, where she is allowed to glimpse inside the sensual world of the geisha.During the years of her training in the art of pleasuring men, Kathlene's desires are awakened by the promise of unending physical delights, and she eagerly prepares for the final ritual that will fulfill her dream of becoming a geisha — the selling of her virginity. The man willing to pay for such an honor, Baron Tonda, is not the man for whom Kathlene carries a secret longing, but he is the man who will bring ruin to the teahouse, and danger to Kathlene, if he is disappointed&#133;.",
        "Category": " Fiction , Erotica , General",
        "Publisher": "Spice",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Nearlyweds",
        "Authors": "By Kendrick, Beth",
        "Description": "An irresistible, romantic comedy from award-winning author Beth Kendrick—three wildly different women form an unlikely friendship as they try to decide whether they’d re-do their I Do’s.They’ve had the white dresses and the fancy receptions. But now that the honeymoon’s over, Stella, Casey, and Erin have each had to face some hard truths about the men they’ve married and the lives they’ve chosen. So when the news breaks that the pastor who presided over their weddings failed to file a few critical pieces of paper, none of these newlyweds is rushing down to the courthouse to legalize her vows. Instead, the brides share their hopes, disappointments, and secrets while grappling with that pivotal question: Should they stay or should they go? Everyone says the first year of marriage is the hardest…but what would you do if you found out that you were never really married in the first place?",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Not So Snow White (Glass Slipper, Inc.)",
        "Authors": "By Kauffman, Donna",
        "Description": "Can a down-on-her-luck princess really have it all?A whisper away from thirty, gorgeous Tess Hamilton has been the tennis world’s top titleholder and celebrity since she won her first championship at fifteen. Now the headline-making party girl is getting her first taste of mortality–thanks to new teenage phenom Gabrielle Fontaine. But it’s Gaby’s cool, calm, and all-too-collected brother and manager, Max, who really has Tess seeing double. He’s the first man she can’t seem to seduce–or intimidate. It appears Tess is truly off her game, until a real-life, modern-day fairy godmother steps in.…  Aurora Favreaux, a founder of Glass Slipper, Inc., and an old family friend, has a plan to get Tess back on her stilettos, and it includes an unlikely meeting between Tess, Max, and Gaby at Glass Slipper’s new London headquarters–just in time for Wimbledon. It seems that Tess is going to hit the courts in a whole new way, to prove to the world–and herself–that a woman with the heart of a champion can ace life and love–even after the big 3-0.…",
        "Category": " Fiction , Women",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Wilde Thing",
        "Authors": "By Denison, Janelle",
        "Description": "When Liz Adams, the owner of a trendy coffee shop, hires him to find her no-good cousin, P.I. Steve Wilde, determined to bring their business arrangement to a whole new level, embarks on a sensual campaign to tear down her defenses, slowly and passionately. Original. 45,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Erotic Secrets of a French Maid",
        "Authors": "By Cach, Lisa",
        "Description": "He's master of the house. She's mistress of his desires....  After an unsuccessful search for her dream job in architecture, Emma Mayson becomes a maid for an incredibly handsome, wealthy entrepreneur. But Russell Carrick is also a total workaholic who has lost his zest for life -- or has he just misplaced it? Setting aside her feather duster and her inhibitions, Emma rekindles her employer's passion with a fantasy world of boundless pleasure. But then the unthinkable happens: She falls for him. Can she make Russell see her as more than a plaything?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Plane Trigonometry",
        "Authors": "By Heineman, E. Richard",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Book Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Shipshape and Bristol Fashion",
        "Authors": "By Borland, Loren R.",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Rinehold",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Curious George and the Rocket",
        "Authors": "By Rey, H. A. and Rey, Margret",
        "Description": "Following a day of misadventures, Curious George becomes the first space monkey, in a story in board-book form based on Curious George Gets a Medal.",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Flat Belly Diet! - A Flat Belly Is About Food & Attitude. Period. (not A Single Cruch Required)",
        "Authors": "By Vaccariello, Liz",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Inc.",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "I Love You the World",
        "Authors": "By Zobel-Nolan, Allia and Mitchell, Susan (ILT)",
        "Description": "Kids and mothers alike will love this endearing book which demonstrates the depth of a mother's love. When Mama sets out to explain her feelings for Little Bunny, \"I love you the world,\" sums it all up. To prove it, she compares his attributes to all the wonders she can imagine - including a row of rainbows in all shapes and sizes, a treasure chest overflowing with jewels and a velvety, green hillside alive with the prettiest of butterflies. Not surprisingly, Bunny finds out they would all fall short of the mark in this engaging story of a Mother's caring and love. - Adorable bright illustrations demonstrates this heartwarming story of the love between a parent and child.- Loveable characters- Embossing with spot varnish on cover- Special \"This book belongs to:\" box on inside front cover makes this a perfect gift book.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Curious George Goes Fishing",
        "Authors": "By Rey, H. A. and Rey, Margret",
        "Description": "Inspired by a vignette in the classic Curious George Flies a Kite, this amusing episode shows George at his curious best trying to catch a fish.",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The RealAge Diet: Make Yourself Younger with What You Eat",
        "Authors": "By Roizen, Michael F., M.D. and La Puma, John, M.d.",
        "Description": "Food Can Make You Younger!Dr. Michael Roizen presents his program for eating the RealAge way: a diet that is good for your overall health, plus works to delay or even reverse aging. If there's one thing you will learn from this book, it's that no matter who you are, if you eat foods that are high in nutrients and low in calories you will be on the road to renewed health and vitality.The RealAge Diet Shows You How To:Use foods to regain the energy of your youthEat nutritiously while still enjoying delicious food choicesChoose the right vitamins and supplements to keep you youngModify various popular weight-loss diets to maximize their age-reducing benefitsRead between the lines of restaurant menus to find the most healthful optionsMake your RealAge younger with every bite",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Parenting Your Asperger Child: Individualized Solutions for Teaching Your Child Practical Skills",
        "Authors": "By Sohn, Alan T. and Grayson, Cathy",
        "Description": "Asperger's Syndrome is a form of autism—but with the right guidance, these children can go on to live happy, fulfilling lives.In Parenting Your Asperger Child, Dr. Alan Sohn's and Cathy Grayson's groundbreaking Cognitive Social Integration Therapy (CSIT) offers practical solutions that help parents prepare their children for a fulfilling life of social interaction outside the confines of their syndrome, addressing such topics as:- The six characteristics of Asperger's Syndrome- How to identify a child's type of Asperger's—and the best approaches for dealing with it- Understanding how an Asperger's child sees and interprets the world- Replacing inappropriate coping techniques with productive skills- How to survive and learn from a crisis- How school programs can aid in teaching Asperger children - Making changes that last",
        "Category": " Family & Relationships , Children with Special Needs",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The Family Nutrition Book: Everything You Need to Know About Feeding Your Children - From Birth through Adolescence",
        "Authors": "By Sears, Martha and Sears, William",
        "Description": "Two leading childcare experts address children's nutritional needs, from birth through adolescence, by covering such topics as feeding a picky eater, reading labels and selecting healthy snacks, evaluating the school lunch program, discussing weight control, and much more. Simultaneous. 50,000 first printing.",
        "Category": " Medical , Pediatrics",
        "Publisher": "Little, Brown Spark",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Collins French Concise Dictionary, 3e (HarperCollins Concise Dictionary) (English and French Edition)",
        "Authors": "By HarperCollins Publishers",
        "Description": "This practical, versatile edition of the Collins French Dictionary offers comprehensive coverage of today’s language with more than 200,000 entries and translations. This is the most complete guide to grammar offered in a French dictionary, and includes all the information needed to write a paper, read a book, or tell a story.",
        "Category": " Foreign Language Study , French",
        "Publisher": "CollinsRef",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Curious George Rides",
        "Authors": "By Rey, H. A. (ILT) and Rey, Margret",
        "Description": "A speedy adventure shows how Curious George, the inquisitive monkey, rides from one adventure to another on a bicycle, in a helicopter, and, of course, in the little blue car.",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Before You Put That On",
        "Authors": "By Boston, Lloyd and Boston, Lloyd (ILT)",
        "Description": "Style guru Lloyd Boston is familiar to millions of viewers across the country as a fashion editor for NBC's Today show and a regular on E! Entertainment's Style Network. He's familiar to readers who made his style guides for men -- and the women who dress them -- bestselling books. Now with Before You Put That On, Boston delivers 365 expert fashion tips to help women create a wardrobe and a personal style they can be proud of every day of the year -- using much of what may already be in their closets!  Lloyd Boston defines finding your style as \"taking your world and giving it shape.\" That's what he's done for his individual and corporate clientele for years, and now with this beautifully designed book -- including his own original art -- he's offering his insider secrets to you. Boston's user-friendly references are filled with inspirational ideas for looking and feeling your most stylish.  Friendly, frank, and with a wealth of professional tips at his disposal, Boston guides readers through an entire year's worth of fashion choices, beginning with a new style resolution at the top of the year, through the fresh fashion possibilities of spring and barely dressed days of summer, and back through the glittering holidays.  Before You Put That On offers:  ? Hints for choosing garments to flatter every body type  ? Simple solutions for going from day to night in minutes  ? Tailoring tricks that bring new life to items you already own  ? Advice on adding accessories that turn a look from frumpy to fabulous  ? Organizational tips for creating a user-friendly closet  Named one of Crain's magazine's \"40 Under 40,\" he is also a national spokesperson for companies including Tommy Hilfiger, Jones New York, and LensCrafters. As Boston himself says, \"Nothing makes me happier than helping real people look their absolute best.\" Whether the occasion is lunch with a new client, a catch-up drink with friends, or a special holiday gathering, Before You Put That On provides classic ideas that will usher readers through every event with confidence and panache.",
        "Category": " Design , Fashion & Accessories",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Best Loved Hershey's Recipes",
        "Authors": "By Editors of Favorite Brand Name Recipes",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Bayou Bad Boys",
        "Authors": "By Warren, Nancy, Ross, JoAnn, and Sheedy, E. C.",
        "Description": "Sensual delights and wicked desires run rampant in this trio of steamy romances that includes JoAnn Ross's \"Cajun Heat,\" in which movie star Gabe Broussard returns home to Louisiana for some much needed R&R only to find himself distracted by voluptuous Emma Quinlan. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Bad Boys in Black Tie",
        "Authors": "By McCarthy, Erin, Foster, Lori, and Leigh, Morgan",
        "Description": "Three scandously sexy stories in one volume, celebrating the bad boys who give new meaning to evening attire, features Lori Foster's \"Good With His Hands,\" in which Pete Watson, despite their \"no sex\" agreement, is determined to seduce his best friend, Cassidy McClannahan. Original. 55,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "A Week from Sunday",
        "Authors": "By Garlock, Dorothy",
        "Description": "Adrianna Moore has just had a double shock: the death of her father and the discovery that he has left his entire estate to his lawyer.  The lawyer, a repulsive social climber, tells her that to regain her inheritance, she must marry him A WEEK FROM SUNDAY.   Adrianna takes off, driving desperately to a new life.  Caught in a violent rainstorm, she collides with an oncoming truck.  Quinn Baxter, the driver of the truck, demands repayment for his lost cargo.  They reach a bargain: she will live in his home, tutor his bedridden younger brother, and play piano in Quinn's tavern to pay off her debt.  Drawn to the rugged Quinn, challenged by the interaction with the tavern patrons, she also must deal with an intractable foe--Quinn's housekeeper who is scheming to become his wife.  And all the while, the spurned lawyer is following Adrianna's trail, determined to find her and force her to marry him.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "The All-American Dessert Book",
        "Authors": "By Baggett, Nancy",
        "Description": "When Nancy Baggett set out to find the best homemade desserts in America, she knew just where to look. She turned to small-town cooks who are locally famous for their specialties, innkeepers and bakers whose treats lure guests back year after year, and church and bake-sale ladies whose creations are always snapped up at events.Many of Nancy's finds have never been published, or even written down, before. Some of the local treasures include * an irresistibly easy blueberry buckle from a Vermont bed-and-breakfast * a tender peach cobbler from a home cook in the Ozarks who learned it from her mother * a lusciously thick chocolate-banana malted from a celebrated soda fountain in St. Louis * a supremely moist chiffon cake with a zingy orange glaze from Nancy's grandmother's \"receipt\" box * big, soft, glazed gingerbread cookies that were a huge favorite at a former diner in Washington, D.C.* creamy chocolate-dipped caramels, the proprietary secret of the guild members of a New Mexico Episcopal church \"Although I've been baking and writing about sweets for more than three decades, time and time again I found myself thinking, 'What a great idea! I'd never have thought of that,\" Nancy writes in the introduction.Nancy has tested and retested each recipe in her own kitchen, so that you're assured of a flaky, easy-to-roll pie crust, a brownie with a perfect fudgy center and a deep chocolate aroma, and a silky-smooth cheesecake every time -- even if you've never baked before. Since the most memorable desserts are often the ones you make with your children, this book features plenty of projects for the whole family: rock crystal swizzle sticks, caramel apples, graham cracker \"gingerbread\" houses, and gifts such as brownie bars in a jar and quick heavenly hash fudge. The All-American Dessert Book tells the intriguing story of America's fascination with sweets, complete with regional legends, behind-the-scenes recipe stories, fascinating snippets of baking history, and words of kitchen wisdom from cooks of the past.",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "High Stakes (Vegas Vampires, Book 1)",
        "Authors": "By McCarthy, Erin",
        "Description": "From the USA Today bestselling author, a vampire-meets-girl story set in the city that never sleeps-except during daylight.  He's a bloodsucking freak of nature. But, unlike other politicians, Ethan Carrick is actually a nice guy. Not to mention a very hot, wealthy, casino-owning vampire. It's an election year for vampires, which means he'll first have to escape his opponent's hit men. Then he'll have to find a suitable First Lady, preferably here in Vegas.  Brittany Baldizzi fits the bill. She's smart, pretty- and sweeter than a glass of diabetic O-Negative. But her protective sister Alexis steps in with a message for Ethan: Bite me. It's then that he realizes it's the sexy, no-nonsense Alexis who raises his stake. And as much as she denies it, Alexis wouldn't mind a romp in the coffin with him. But can a mere mortal, even one who risks her life for him, make a centuries-old, womanizing vampire feel something entirely new?",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley Sensation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Sherbrooke Bride (Bride Series, Book 1)",
        "Authors": "By Coulter, Catherine",
        "Description": "Desperate for an heir, Douglas Sherbrooke, Earl of Northcliffe, looks for a bride and finds a prospective one in Melissande Chambers, but it is Melissande's sister, Alexandra, who has loved Sherbrooke from afar since she was a girl. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Hugs for Mom: Stories, Sayings, and Scriptures to Encourage and Inspire (Hugs Series)",
        "Authors": "By Smith, John",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "The Generals' War : The Inside Story of the Conflict in the Gulf",
        "Authors": "By Gordon, Michael R. and Trainor, Bernard E.",
        "Description": "In a unique combination of journalism and military expertise, Michael R. Gordon, chief defense correspondent for The New York Times, and retired three-star Marine Corps General Bernard E. Trainor provide a definitive, behind-the-scenes account and analysis of the planning and execution of the Persian Gulf War. The inside story of the war is a tale of politics and clashing military cultures: while one war was being waged against Iraq, another was being fought among the generals themselves. Drawing on interviews with senior allied officials in the Persian Gulf, Western Europe, and the United States, The Generals' War offers unvarnished portraits of top military commanders, as well as new disclosures about the conflicts and power struggles within the anti-Iraq coalition and the American high command.The Air Force believed that wars could be decided through strategic bombing. The Army saw the war as an opportunity to apply its doctrine of maneuver warfare. The Marine Corps approached the Gulf with a history of expeditionary warfare and amphibious assault. The Navy remained aloof from Central Command, preferring to act on its own. Although General Colin Powell and General H. Norman Schwarzkopf were tasked with developing a unified plan from these separate, sometimes conflicting agendas, they never fully harmonized the war plans. As a result, half of Iraq's Republican Guard forces got away. Three and a half years after what was considered a decisive victory, some of the same Iraqi Republican Guard forces that the allies had failed to destroy again menaced Kuwait, forcing President Clinton to order American troops back to the Persian Gulf to prevent a second Iraqi invasion. Saddam Hussein was entrenched and unbowed. The Persian Gulf War was an incomplete success.",
        "Category": " History , Military , General",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Under Fire: A Novel of the Corps",
        "Authors": "By Griffin, W. E. B.",
        "Description": "After the epic struggle of World War II, W.E.B. Griffin’s bestselling chronicle of the Marine Corps enters a new stage of modern warfare—with new weapons, new strategies, and a new breed of warrior—on the battlefields of Korea...In 1950, Captain Ken McCoy’s report on North Korean hostilities meets with so much bureaucratic displeasure that he is promptly booted out of the Corps—and just as promptly picked up by the fledgling CIA. Soon, his predictions come true: on June 25th the North Koreans invade across the 38th parallel. Immediately veterans scattered throughout military and civilian life are called up, many with only seventy-two hours notice. For these men and their families, names such as Inchon and Pusan will acquire a new, bloody reality—and become their greatest challenge of all...",
        "Category": " Fiction , War & Military",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Florida Getaway (CSI: Miami, No. 1)",
        "Authors": "By Collins, Max Allan",
        "Description": "Lieutenant Horatio Caine leads a crack team of forensic scientists who investigate crimes amid the tropical surroundings and cultural crossroads of Miami. Together, they collect and analyze the evidence to expose the truth and to bring justice to those who often cannot speak for themselves: the victims.FLORIDA GETAWAYThomas Lessor left Las Vegas for Miami to get away from it all -- in fact, he felt certain he was going to get away with murder. But he was wrong, and the Las Vegas PD soon contacted Miami with a warrant for his arrest. Hot on his trail, the Miami CSIs are called to the scene of his abandoned car...a car that's been abandoned in spirit but not in body. And on a pleasant and secluded Miami beach, a young couple is about to make a gruesome discovery....",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Knight's Song",
        "Authors": "By Cajio, Linda",
        "Description": "Feeling safe within the walls of Audham's Abbey, widow Isobel Bayeux enjoys a refuge from the cruel world that surrounds her, until a mysterious knight, Sir Hugh, appears, claiming that Audham has been awarded to him by the king. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Duchess (Montgomery/Taggert)",
        "Authors": "By Deveraux, Jude",
        "Description": "Jude Deveraux captures the thrill of an American beauty's Highlands wedding, where a royal title is at stake -- and where love wins the day.  The Duchess  Claire Willoughby risked losing millions in her inheritance if, as decreed by her grandfather, she did not wed an \"acceptable\" man. Harry Montgomery, the eleventh Duke of MacArran, seemed perfect. He owned a historic castle, he looked manly in a kilt, and he was as much a titled Scotsman as Bonnie Prince Charlie himself.  Their engagement announced, Claire's future as a duchess was assured -- and she set off with her family to meet the Montgomery clan in Scotland. Bramley Castle was a damp, chill place, overþowing with eccentric relatives. But there was also Trevelyan, a secretive, brooding man who lived in Bramley's ancient halls. Whoever he was, he wasn't at all like Harry: Trevelyan was the most exasperating, arrogant, know-it-all of a man Claire had ever met. And the most fascinating...",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    }
]