[
    {
        "Title": "Bare Bones: A Novel (Temperance Brennan Novels)",
        "Authors": "By Reichs, Kathy",
        "Description": "\"Fans of TV's CSI: Crime Scene Investigation should be in heaven\" (People) stepping into the world of forensic anthropologist Dr. Temperance Brennan, star of Kathy Reichs' electrifyingly authentic bestsellers.   She works with the dead, but she works for the living.   \"Down time\" is not a phrase in Tempe Brennan's vocabulary. A string of disturbing cases has put her vacation plans on hold; instead, she heads to the lab to analyze charred remains from a suspicious fire, and a mysterious black residue from a small plane crash. But most troubling of all are the bones. . . . Tempe's daughter's new boyfriend invites them to a picnic -- a pig pickin' -- in the North Carolina countryside, where a cache of bones turns up. But are they animal or human? X-rays and DNA may link the crimes, but they can't reveal who is closing in on Tempe and her daughter -- and how far they will go to keep her from uncovering the truth.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Carnal Innocence: A Novel",
        "Authors": "By Roberts, Nora",
        "Description": "In the small town of Innocence, Mississippi, days are long, nights are fragrant, and secrets are hard to keep. But when a brutal killer starts claiming the lives of the town's most attractive women, lifelong neighbors are forced to wonder if the culprit is a stranger lurking in the bayou...or someone right next door.Burned out by a whirlwind career, world-famous concert violinist Caroline Waverly arrives in Innocence looking for a little peace and some time to think. She hopes that a stay at her late grandmother's house--the one with a covered porch just made for soft summer nights--will provide the tranquillity she needs.  But Innocence has something else to offer Caroline: handsome, charming Tucker Longstreet.Tucker is known for keeping his romances short and shallow. But one look at Caroline, and Tucker realizes that she is unlike any other woman he's met. The coolly reserved Caroline feels an unexpected thrill at his ardent advances. But when she discovers a third murder victim in the murky waters behind her home, her summer liaison threatens to become much more. Because there's just one small problem with her new romance: Tucker is the leading suspect in the killings.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Brazen Virtue (D.C. Detectives)",
        "Authors": "By Roberts, Nora",
        "Description": "After a demanding book tour, superstar mystery novelist Grace McCabe decides to visit her sister, Kathleen, who’s embroiled in a custody battle after a bitter divorce. Arriving in D.C., Grace is shocked to find Kathleen living in a run-down neighborhood and, hoping to afford a hotshot lawyer, supplementing her meager teacher’s salary by moonlighting as a phone sex operator.  According to Kathleen, Fantasy, Inc., guarantees its employees ironclad anonymity. But Grace has her doubts—which are confirmed one horrifying cherry-blossom-scented night when one of Fantasy, Inc.’s operators is murdered. As Grace is drawn to help solve the crime, her life turns into a scene from one of her own books. Yet as one of her biggest fans, investigator Ed Jackson, warns her: This isn’t fiction. Real people die—and Grace could be next. For she’s setting a trap for a killer more twisted than anything she could imagine. And not even Ed may be able to protect her from a rendezvous with lust and death.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Sweet Revenge: A Novel",
        "Authors": "By Roberts, Nora",
        "Description": "At twenty-five, Princess Adrianne lives a life most people would envy.  Beautiful and elegant, she spends her days dabbling in charities and her nights floating from one glamorous gala to the next.  But her pampered-rich-girl pose is a ruse, a carefully calculated effort to hide a dangerous truth.For ten years Adrianne has lived for revenge.  As a child, she could only watch the cruelty hidden behind the facade of her parents' fairy-tale marriage.  Nowshe has the perfect plan to make her famous father pay.  She will take possession of the one thing he values above all others--The Sun and the Moon, a fabled necklace beyond price.Yet just as she is poised to take her vengeance, she meets a man who seems to divine her every secret.  Clever, charming, and enigmatic, Philip Chamberlain has his own private reasons for getting close to Princess Adrianne.  And only when it's too late will she see the hidden danger...as she finds herself up against two formidable men--one with the knowledge to take her freedom, the other with the power to take her life.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Hot Ice: A Novel",
        "Authors": "By Roberts, Nora",
        "Description": "Reckless Whitney MacAllister possesses all the wealth and beauty every woman dreams of. Streetwise Douglas Lord has the good looks and quick wits to be a success at his chosen profession: larceny.She has the cash and the connections.He has the stolen documents leading to a fabulous hidden fortune.It is a business proposition, pure and simple.But the race to find the treasure, from Manhattan to Madagascar, is only part of the game. For their fierce and dangerous attraction to each other soon threatens to overwhelm them–unless their merciless and shadowy rivals kill them first.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Sinus Relief Now: The Ground-Breaking 5-Step Program for Sinus, Allergy, and AsthmaSufferers",
        "Authors": "By Josephson, Jordan S.",
        "Description": "Dr. Josephson's unique five-step program combines the best practices from traditional and alternative medicine to bring relief to the millions who suffer from respiratory problems. Recent research shows that many respiratory diseases are more related than previously thought. Their common, underlying cause is what Dr. Josephson terms \"Chronic Airway-Digestive Inflammatory Disease\" (CAID). His groundbreaking, proven approach will provide real relief from sinus disease, allergies, asthma, sinus infections, sinus headaches, bronchitis, ear infections, snoring, sleep apnea, GERD, and the acute mold epidemic. Sinus Relief Now will show how to: Maintain proper sinus care Remove mold and other irritants from the home, office, and car Follow a sinus-friendly nutrition program Find the right medications and treatments Experience total-body health",
        "Category": " Health & Fitness , Diseases , Respiratory",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Gospel of St. Mark (New Testament Commentary)",
        "Authors": "By Nineham, D. E.",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1964"
        }
    },
    {
        "Title": "The Confession of Fitzwilliam Darcy",
        "Authors": "By Street, Mary",
        "Description": "Pride and Prejudice told from a delightfully different point of view. \"The Holy Grail of P&P sequels.\" (Austenblog)Originally published in the U.K., Mary Street's ingenious retelling of Jane Austen's classic story now makes its U.S. debut-to the delight of the fans of Austen's comic masterpiece of divine romance. In Fitzwilliam Darcy, Austen created the ultimate romantic hero. Yet Pride and Prejudice reveals little of Darcy's innermost thoughts. Here, Street unveils the true motives and mysteries of Elizabeth Bennet's enigmatic suitor. Through Darcy's eyes we discover the reality of his relationships with his sister Georgiana, his cousin Colonel Fitzwilliam, the dastardly Wickham, his friend Bingley, and his formidable aunt, Lady Catherine. And of course, all his memorable encounters with Elizabeth, from that first view of her fine eyes to his disastrous proposal, and then to a pride and arrogance tempered by an unquenchable love.",
        "Category": " Fiction , Classics",
        "Publisher": "Berkley",
        "Price Starting With ($)": "16.48",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Stolen (Women of the Otherworld, Book 2)",
        "Authors": "By Armstrong, Kelley",
        "Description": "The only living female werewolf, thirty-year-old Elena Michaels takes on a mission to confront Internet billionaire Tyrone Winsloe, who has been capturing Elena's fellow paranormal brethren, conducting experiments on them, and hunting them to their deaths in a live video game. By the author of Bitten. Reprint.",
        "Category": " Fiction , Horror",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Simply Unforgettable (Simply Quartet)",
        "Authors": "By Balogh, Mary",
        "Description": "New York Times bestselling author Mary Balogh returns to the seductive world she knows so well–Regency England–in a new novel filled with her trademark wit, sensuality, and breathtaking storytelling. With this, the first in a dazzling new quartet of novels, Balogh invites us into a special world–a select academy for young ladies–a world of innocence and temptation. Drawing us into the lives of four women, teachers at Miss Martin’s School for Girls, Balogh introduces this novel’s marvelous heroine: music teacher Frances Allard–and the man who seduces her with a passion no woman could possibly forget.…They meet in a ferocious snowstorm. She is a young teacher with a secret past. He is the cool, black-caped stranger who unexpectedly comes to her rescue. Between these two unlikely strangers, desire is instantaneous…and utterly impossible to resist. Stranded together in a rustic country inn, Lucius Marshall, who is the Viscount Sinclair, and Frances Allard share a night of glorious, unforgettable passion. But Frances knows her place–and it is far from the privileged world of the sensual aristocrat. Due to begin her teaching position at Miss Martin’s School in Bath, Frances must try to forget that one extraordinary night–and the man who touched her with such exquisite tenderness and abandon.But Frances cannot hide forever.  And when fate once again throws them together, Lucius refuses to take no for an answer.  If Frances will not be his wife, he will make her his mistress. So begins an odyssey fraught with intrigue, one that defies propriety and shocks the straitlaced ton. For Lucius’s passionate, single-minded pursuit is about to force Frances to give up all her secrets–except one–to win the heart of the man she already loves. Once again this incomparable storyteller captures a time and a place like no other.  And in Lucius and Frances, Mary Balogh gives us her most unlikely lovers yet–a nobleman in search of the perfect wife and an unconventional woman willing to risk everything for an unforgettable love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Dell Publishing Company, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "A Little Bit Wicked (Last Man Standing, Book 1)",
        "Authors": "By Alexander, Victoria",
        "Description": "Who will be the last unmarried man standing?No man in his right mind would want to get married, but every duke, earl, and viscount knows that a fellow must do his duty in the end. So four of London's most desirable gentlemen make a wager—the prize going to the one who remains unwed the longest.Gideon Pearsall, Viscount Warton, thinks he has a fair shot at winning. After all, he's managed to enjoy the favors of many a lady while resisting the parson's noose. Even when he's stopped dead in his tracks by the most scandalous woman in all of London—Judith, Lady Chester—he vows to have her bedded but never wedded.Beautiful, and more than a little bit naughty, Judith has always kept herself within the bounds of respectability, even while playing by her own rules. And the experience has taught her to avoid marriage. She has no desire to resist Warton's hot kisses, and his tempting touch is impossible to ignore.But soon both Judith and Gideon can't help but wonder . . . is it possible to be a little bit wicked and still follow your heart?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Marriage Lesson (Effington Family & Friends, 3)",
        "Authors": "By Alexander, Victoria",
        "Description": "Lesson #1: Never Tempt a Lady Become a bride? Never! Lady Marianne Shelton has come to London to experience life, and marriage is not part of her plan. To finance her independent future, the pretty country miss pens a series of anonymous stories. Soon they are the talk of the ton-and only she knows that her wicked hero is based on none other than bold, brash Thomas Effington, the future Duke of Roxborough.Lesson #2: Never Deny a  Marquess, Thomas has been thrust into le of Marianne's protector. When she threatens to experience life with the first willing rogue to come along, he decides the best recourse is to tutor her himself. And when he accidentally compromises her honor, he's willing to accept their only recourse: a wedding. Marianne claims she wants no part of marriage, but her intoxicating allure and disarming willingness make her irresistible. And now Thomas is determined to teach her a lesson: that true love will last forever.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Good Husband of Zebra Drive",
        "Authors": "By McCall Smith, Alexander",
        "Description": "THE NO. 1 LADIES’ DETECTIVE AGENCY - Book 8 Fans around the world adore the bestselling No. 1 Ladies’ Detective Agency series, the basis of the HBO TV show, and its proprietor Precious Ramotswe, Botswana’s premier lady detective.  In this charming series, Mma  Ramotswe navigates her cases and her personal life with wisdom, and good humor—not to mention help from her loyal assistant, Grace Makutsi, and the occasional cup of tea.   In the life of Precious Ramotswe–a woman duly proud of her fine traditional build– there is rarely a dull moment, and in the latest installment in the universally beloved  No. 1 Ladies’ Detective Agency series there is much happening on Zebra Drive and  Tlokweng Road. Mma Ramotswe is experiencing staffing difficulties. First Mr. J.L.B.  Mate-koni asks to be put in charge of a case involving an errant husband. But can  a man investigate such matters as successfully as the number one lady detective can?  Then she has a minor falling-out with her assistant, Mma Makutsi, who decides to  leave the agency, taking the 97 percent she received on her typing final from the  Botswana Secretarial College with her.    Along the way, Mma Ramotswe is asked to  investigate a couple of tricky cases. Will she be able to explain an unexpected series  of deaths at the hospital in Mochudi? And what about the missing office supplies  at a local printing company? These are the types of questions that she is uniquely  well suited to answer.  In the end, whatever happens, Mma Ramotswe knows she can  count on Mr. J.L.B. Matekoni, who stands for all that is solid and true in a shifting  world. And there is always her love for Botswana, a country of which she is justifiably  proud.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Liberty: A Lake Wobegon Novel",
        "Authors": "By Keillor, Garrison",
        "Description": "Clint Bunsen is one of the old reliables in Lake Wobegon - the treasurer of the Lutheran church and the auto mechanic who starts your car on below-zero mornings. For six years he has run the Fourth of July parade, turning what was once a line of pickup trucks and girls pushing baby carriages that hold their cats into an event of dazzling spectacle. Blazing bands, marching units, cannons, horses, a fireworks show, and the famous Living Flag - one thousand men and women wearing red, white, or blue, standing in formation - have attracted the attention of CNN and prompted the governor to put in an appearance as well. The town is dizzy with anticipation. Until, that is, they hear of Clint's ambition to run for Congress. They're embarrassed for him. They know him too well - his unfortunate episodes involving vodka sours, his rocky marriage. And then there is his friendship, or whatever it is, with the twenty-four-year-old girl who dresses up as the Statue of Liberty for the parade. It's rumored that underneath those robes she is buck naked, and that her torch contains a quart of booze.It's Lake Wobegon as it's always been - good loving people who drive each other crazy.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Lady in Question (Effington Family & Friends, 7)",
        "Authors": "By Alexander, Victoria",
        "Description": "Identical twins, sensible Delia and mischievous Cassandra Effington were the most delicious debutantes to ever waltz across a London ballroom. They looked alike in every way . . . but no one ever expected Delia to be the one to get into trouble . . . How did this young lady's reputation become so questionable?Once she was lovely, respectable Miss Delia Effington, but an impulsive decision—and subsequent disaster—forces Delia to retire from society. Until one night, desperate for diversion, she attends a ball as her twin sister and finds herself dancing in the strong arms of the dashing Viscount St. Stephens.Delia believes she has never met this man who arouses her passions, yet he seems somehow familiar. For Delia doesn't know that St. Stephens, an agent for the Crown, has been in her home, protecting her under the disguise of her butler. What will happen when this lady discovers the truth about the man she has come to love?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Eldercare for the Christian Family: What to Do When a Loved One Becomes Dependent",
        "Authors": "By Smick, Timothy S. (EDT)",
        "Description": "Essays look at the problems that arise in caring for the elderly, and discuss burnout, finances, ethics and parental wishes",
        "Category": " Social Science , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.85",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Pursuit of Marriage (Effington Family & Friends)",
        "Authors": "By Alexander, Victoria",
        "Description": "What lengths would a young lady go to in her pursuit of the perfect match?And how far would a gentleman go to stop her?Cassandra Effington is one of the most delicious debutantes to ever waltz across a London ballroom. But while her identical twin sister Delia is now wed, Cassandra is still unclaimed, and everyone agrees her standards are entirely too high. So how could she possibly lose a most unseemly wager with the handsome, scandalous Viscount Berkley? The proposition: She will find him  an ideal bride well before he finds her the perfect match.But Lord Berkley intends to be very hard to please. He's already chosen the right woman, and no lady Cassandra puts forward to him will be perfect enough save the luscious Cassandra herself. And he'll do whatever it takes to make  certain no gentleman he introduces her to is enticing enough, until she realizes that the perfect object in her pursuit of  marriage is none other than the viscount himself.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Her Highness, My Wife (Effington Family & Friends)",
        "Authors": "By Alexander, Victoria",
        "Description": "Women never said no to the dashing Lord Matthew Weston and he never said no to them. But this was the first time he found one tempting enough to impetuously say \"I do.\" Was it any wonder he awoke to discover her gone? And when Matthew learned the enchanting creature he'd married was of royal blood -- and would abandon their marriage bed without a second thought -- he vowed to put her out of his life forever.But even a princess makes mistakes. And now Tatiana's back, asking for the kind of help only he can give her. But is his assistance all she wants or are there secrets the willful royal is keeping from him? Matthew may well lend her his hand but he'll never again give her his heart. Still, he's determined to tame the green-eyed beauty and change her from a perfect princess to his passionate bride.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Prince's Bride (Effington Family & Friends, 4)",
        "Authors": "By Alexander, Victoria",
        "Description": "Once upon a time there was a young debutante of means who dreamed of marrying a prince. So she traveled to London to become . . .The Prince's BrideAs a poor but proud young lady, Jocelyn Shelton had but one dream: to marry a prince and bring comfort to herself and her family. Now circumstances bring her to London, where her charms could make her wish come true. But her rendezvous with royalty is dangerously interrupted, and she finds herself rescued—and thoroughly kissed—by Rand, Viscount Beaumont . . . a daring man in the service of the king.To protect her life, Rand whisks her away to the countryside, and to defend her reputation, he agrees to marry the willful beauty. Lady Jocelyn is hardly his first choice as a bride, but beneath her fiery nature he uncovers a tender vulnerability and a sizzling passion. But Rand is keeping a shocking secret-one that, when revealed, could either shake her belief in him or make herrealize that it takes more than blue blood to be a true prince.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Perfect Wife",
        "Authors": "By Alexander, Victoria",
        "Description": "Believing that he has found the perfect bride in Sabrina Winfield, a woman who is seemingly submissive, gentle, and who would have no effect on his orderly life, the Earl of Wyldewood soon discovers that his beautiful new bride is most adventurous and clever, forcing him to thwart her devious designs with seduction and love. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The Abs Diet for Women: The Six-Week Plan to Flatten Your Belly and Firm Up Your Body for Life",
        "Authors": "By Zinczenko, David and Spiker, Ted",
        "Description": "In survey after survey, men and women say that a flat abdomen is the ultimate symbol of sex appeal. And in study after study, researchers found that getting a firm belly is the single most significant step anyone can take to stay healthy for life. Now available in paperback, The Abs Diet for Women shows the most effective way to a flat belly, a firm body, and a much better life. Packed with information developed exclusively for women, the book includes: -information on how the Abs Diet can prevent joint pain, improve female sexual response, and give a woman the flat belly she craves in just six weeks -Abs Diet adaptations to tailor the diet to each woman's individual needs -psychological strategies for dealing with obstacles and changing moods -3 weeks' worth of all-new meal plans -tips on managing menopausal symptoms without hormone replacement therapy -new and super-effective moves that incorporate yoga and Pilates to strenghten the core, stretch the body, and relieve stress—plus a postpartum workout to help moms lose the baby weight Easy to follow and more satisfying than a great-fitting pair of jeans, The Abs Diet for Women is the most effective way for a woman to change her health, her size, and her body for good.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Passionate Marriage: Keeping Love and Intimacy Alive in Committed Relationships",
        "Authors": "By Schnarch, David",
        "Description": "The greatest sexual pleasure in a person's lifetime is possible in one's middle and later years, asserts Dr. David Schnarch, when a mature sense of self has been achieved and genuine intimacy is possible with another person. At his Family Health Center in Colorado Dr. Schnarch works with couples in long-term committed relationships who want to get emotionally and sexually closer. In Passionate Marriage Dr. Schnarch shares what he has learned about how couples can--and must--simultaneously break through the sexual and the emotional blocks that hold them back from total satisfaction. He counsels that every sexual exchange, from kissing to daring erotic behaviors, is a picture of an entire relationship--a reflection of how you and your partner feel about yourselves and each other outside the bedroom. This respectful, erotic, uplifting, and spiritual guide to sexual and emotional fulfillment makes a passionate marriage within the reach of every couple.",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Mental Floss: Genius Instruction Manual",
        "Authors": "By Pearson, Will (EDT), Hattikudur, Mangesh (EDT), and Green, John (EDT)",
        "Description": "Remember that time you bumped into Stephen Hawking at the clambake and his monologue on string theory went completely over your head? Man, was that awkward. Or remember the time you were at a party and someone asked, \"Who knows how to perform open-heart surgery?\" and you were the only one who didn't raise your hand? Well, put all of that embarrassment behind you. Want to dazzle crowds with your wondrous knowledge of Shakespeare and surgeries? Want to learn to woo just like history's greatest minds? Well, start reading already! The Genius Instruction Manual is a foolproof finishing school for polishing your brain. All you've got to do is dive in.",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Fabulous Fallacies: More Than 300 Popular Beliefs That Are Not True",
        "Authors": "By Tuleja, Tad",
        "Description": "Arranged by subjects--including famous people, Americana, war, religion, the arts, famous sayings, politics, and word definition--this list for would-be iconoclasts sets straight many myths",
        "Category": " Games , Trivia",
        "Publisher": "Galahad Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The New Finch Handbook (New Pet Handbooks) (English and German Edition)",
        "Authors": "By Koepff, Christa",
        "Description": "Offers advice on the care of a finch as a pet and discusses the characteristics of the common species of finches",
        "Category": " Nature , General",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "This Common Ground: Seasons on an Organic Farm",
        "Authors": "By Chaskey, Scott",
        "Description": "In the tradition of Michael Pollan, Joan Gussow, and Verlyn Klinkenborg's The Rural Life, This Common Ground is an inspirational evocation of a life lived close to the earth, written by the head farmer at one of the country's first community-supported farms. By reflecting on four seasons of activity at his beloved Quail Hill Farm in eastern Long Island, Scott Chaskey offers stirring insight into the connections between land and the human family. Whether writing about the voice of a small wren nesting in the lemon balm or a meadow of oats, millet, and peas rising to silver and green after a fresh rain, this poet-farmer's contagious sense of wonder brings us back to our bond with the soil.",
        "Category": " Nature , Plants , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Unexpected Grace Comfort In The Midst Of Loss",
        "Authors": "By Walsh, Sheila",
        "Description": "When Eleanor Pfaehler and I met, we stood on opposite sides of an invisible, and seemingly insurmountable, wall,\" Sheila Walsh writes. \"Eleanor and I talked over this wall. At times we reached up to hug. But the wall was always there.\"Then Eleanor was diagnosed with liver cancer. Finally, by the grace and mercy of God alone, the wall came crashing down. Eleanor and I found ourselves swimming in the river of mercy with our arms around each other, holding each other, willing to give our lives for each other.\"Unexpected Grace is a tender account of the relationship between a mother and daughter-in-law and how they discovered extravagant grace in the midst of what could have been the most tragic experience of their lives. Their story will encourage you and help you see how God can bring good out of even the bleakest circumstances.Previously published as Stories from the River of Mercy.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Noah's Flood: The New Scientific Discoveries About The Event That Changed History",
        "Authors": "By Ryan, William, Pitman, Walter, and Sotiropoulos, Anastasia (ILT)",
        "Description": "Over the millennia, the legend of a great deluge has endured in the biblical story of Noah and in such Middle Eastern myths as the epic of Gilgamesh. Now two distinguished geophysicists have discovered a catastrophic event that changed history, a gigantic flood 7,600 years ago in what is today the Black Sea.  Using sound waves and coring devices to probe the sea floor, William Ryan and Walter Pitman revealed clear evidence that this inland body of water had once been a vast freshwater lake lying hundreds of feet below the level of the world's rising oceans. Sophisticated dating techniques confirmed that 7,600 years ago the mounting seas had burst through the narrow Bosporus valley, and the salt water of the Mediterranean had poured into the lake with unimaginable force, racing over beaches and up rivers, destroying or chasing all life before it. The rim of the lake, which had served as an oasis, a Garden of Eden for farms and villages in a vast region of semi-desert, became a sea of death. The people fled, dispersing their languages, genes, and memories.",
        "Category": " History , Ancient , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Class 11: My Story Inside the CIA's First Post-9/11 Spy Class",
        "Authors": "By Waters, T. J.",
        "Description": "A gripping insider?s look at the post-9/11 CIA  In the weeks following the attacks of 9/11, the Central Intelligence Agency received over 150,000 résumés from people wanting to serve their nation. T. J. Waters became one of more than a hundred students admitted into the CIA?s Clandestine Service to become Class 11, the first post- 9/11 training class. Filled with more information about the CIA?s Clandestine Service Training Program than has ever been allowed into the public domain, Waters takes readers behind closed doors, where the trainees learned methods of subterfuge, mastering disguises, how to withstand interrogations, and how to cross into hostile territory undetected?and provides a moving portrait of ordinary Americans with the courage and determination to go to any lengths to protect their country.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Cal Ripken, Jr.: Play Ball! (Puffin Easy-to-read, Level 3)",
        "Authors": "By Herman, Gail, Ripken, Cal, Jr., Bryan, Mike, and Silver, Stan (ILT)",
        "Description": "What is it like to be a major league ball player? Cal Ripken, Jr. plays third base for the Baltimore Orioles. In this autobiography for beginning readers, he talks about growing up in a baseball family, and about his love for the game. He reveals his primary goal? to play well and play every day. And he tells how, in 1995, he broke the record for playing the most games in a row. Here is Cal's story, with over 30 action-packed photographs and illustrations. Short sentences, important visual clues, and a lively text encourage young sports fans to become excited about reading.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Night Rising (Vampire Babylon, Book 1)",
        "Authors": "By Green, Chris Marie",
        "Description": "In this first book of an all-new trilogy, life proves stranger than the movies when a Hollywood underground coven of vampires comes to light-and gets targeted by the tough-as-nails daughter of a sexy screen siren. Stuntwoman Dawn Madison hasn't been on the best of terms with her father since her movie star mother died. Still, he is her dad, and when he vanishes while investigating the bizarre sighting-caught on film-of a supposedly long-dead child star, she comes home to Tinseltown to join the search for him. Working with his odd colleagues, she discovers an erotic and bloody underground society made up of creatures she thought existed only on the screen.",
        "Category": " Fiction , Horror",
        "Publisher": "Ace",
        "Price Starting With ($)": "14.48",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Official eBay Bible, Third Edition: The Newly Revised and Updated Version of the Most Comprehensive eBay How-To Manual for Everyone from First-Time Users to eBay Experts",
        "Authors": "By Griffith, Jim",
        "Description": "Jim ?Griff? Griffith, eBay?s official ambassador, presents the definitive sourcebook on all things eBay, for beginners to seasoned users alike. Uncle Griff, Dean of eBay Education, brings us the latest on all things eBay with the only officially endorsed and authorized guide to this phenomenal auction site. The Official eBay Bible has sold more than 150,000 copies in previous editions and eBay today is bigger than ever, with 203 million registered users and 541,000 official eBay stores nationwide. The Official eBay Bible, Third Edition is fully revised and totally updated with all of the latest changes to the site, making all previous books on eBay obsolete. Much more than a user?s guide, The Official eBay Bible, Third Edition includes the inspiring stories of real-life buyers and sellers, as well as tips and tricks on some of the powerful, but little-known aspects ofusing the site. This definitive sourcebook includes instructional plans for users of all levels, whether they?re running a small business through the site or simply enjoying it as a hobby. New features in the thirdedition include: a new streamlined organization, images of all the latest features and screens, and even more information for small-business owners. Packed with over seven hundred illustrations, The Official eBay Bible, Third Edition delivers the ultimate word on eBay, from an insider who has been there from the beginning.",
        "Category": " Reference , General",
        "Publisher": "Avery",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Intentional Interviewing and Counseling: Facilitating Client Development in a Multicultural Society",
        "Authors": "By Ivey, Allen E. and Ivey, Mary Bradford",
        "Description": "In this edition of their best-selling text, Allen and Mary Bradford Ivey provide a practical approach that shows beginning counselors and therapists how to conduct effective interviews using the Iveys' original Microskills approach. Students learn to master basic listening and influencing skills, how to conduct a full interview using only listening skills, and how to adapt Microskills and interviewing plans to meet the needs of multicultural clients. Each chapter includes multicultural commentaries and lively case studies that remind students that different cultural groups think of the helping process in very different ways, and that issues of gender, language, religion, physical disability, affectional orientation, and experience with life trauma (such as child abuse, rape, the Vietnam war) are factors that should be considered during the counseling interview.",
        "Category": " Psychology , Psychotherapy , Counseling",
        "Publisher": "Brooks Cole",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "100 First-Prize Make-It-Yourself Science Fair Projects",
        "Authors": "By vecchione, Glen",
        "Description": "Demonstrate the action of magnetic fields, make a moon box, build \"ant architecture,\" and measure static electricity. Plus: try homemade perfume, erupting volcanoes, jumping Puffed Wheat, a bubble gum plant graft, a big green solar machine, and a kite sighter. \"Well indexed and accurately illustrated with black-and-white pen-and-ink drawings, this book is a good starting place for finding successful science-fair projects.\"--School Library Journal. \"...can provide needed direction to parents and students facing looming classroom deadlines.\"--The Los Angeles Times. \"...offers a real varietyto young scientists...\"--Parent Council(r). Selected as Outstandingby Parent Council(r).",
        "Category": " Juvenile Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Amazing Animals (Defenses)",
        "Authors": "By Rebecca L. Grambo",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Secrets of a Perfect Night",
        "Authors": "By Gibson, Rachel, Laurens, Stephanie, and Alexander, Victoria",
        "Description": "Three spectacular stories all set on New Year′s Eve. First, Stephanie Laurens enthralls us with a New Year′s scandal, when a rake awakens in the bed of the temptress who seduced him years before. Then, Victoria Alexander enchants with her tale of a love promised, then foiled and then rekindled on another midnight. And Rachel Gibson delights with the reunion of two estranged friends and the passionate sparks that fly when the clock strikes twelve.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Four In Hand",
        "Authors": "By Laurens, Stephanie",
        "Description": "When the devilish Duke of Twyford is forced to give up his wicked ways in order to protect the four Twinning sisters, he finds himself falling in love with Caroline, the oldest Twinning sister, and vows to win her heart. Original.",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "A Fine Passion (Bastion Club)",
        "Authors": "By Laurens, Stephanie",
        "Description": "The men of the Bastion Club are powerful, loyal, and not averse to overcoming danger if they must. Now, after years of loyal service to the Crown, they each -- one by one -- must face that greatest danger of all ...love.The last of his line, Jack, Baron Warnefleet, has fled London after nearly being compromised into marrying a dreadful female. Turning his back on the entire notion of marriage, he rides home to the estate he has not seen for years, determined to set in motion an alternative course of action.But then in the lane before his gate, Jack rescues a startlingly beautiful lady from a menacing, unmanageable horse. However, while he begins by taking command, the lady continues by taking it back. Lady Clarice Altwood is no meek and mild miss. She is the very antithesis of thewoolly-headed young ladies Jack has rejected as not for him. Clarice is delectably attractive, beyond eligible, undeniably capable, and completely unforgettable. Why on earth is she rusticating in the country?That enigma is compounded by mystery, and it's quickly clear thatClarice is in danger. Jack must use every ounce of his cunning and wit to protect this highly independent and richly passionate woman ... who has so quickly stolen his heart.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Lady Chosen (Bastion Club, 1)",
        "Authors": "By Laurens, Stephanie",
        "Description": "Tristan Wemyss, Earl of Trentham, never expected he'd need to wed within a year or forfeit his inheritance. But he is not one to bow to the matchmaking mamas of the ton. No, he will marry a lady of his own choosing. And the lady he chooses is the enchanting neighbor living with her family next door. Miss Leonora Carling has beauty, spirit and passion; unfortunately, matrimony is the last thing on her mind . . .To Leonora, Tristan's kisses are oh-so-tempting, but once bitten, forever shy, she has determinedly turned her back on marriage. But Tristan is a seasoned campaigner who will not accept defeat. And when a mysterious man attempts to scare Leonora and her family from their home, Tristan realizes he's been given the perfect excuse  to offer his services—as protector, seducer and, ultimately, husband.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Captain Jack's Woman",
        "Authors": "By Laurens, Stephanie",
        "Description": "They meet in a clash of swords, drenched in the moonlight of Britain’s rugged eastern coast: Captain Jack, his handsome features etched in silver and shadow, his powerful physique compelling “Kit” Cranmer to surrender. He is her dream lover come vividly alive, and his command of the smuggling gang is absolute. His all-knowing gaze penetrates her disguise as the “lad” leader of a rival gang with frightening ease and his “punishment” with kisses leaves her maidenly modesty in tatters.Suddenly Kit finds she’s only too delighted to explore with Jack the pleasures conventionally reserved for married ladies . . . little knowing what dangerous forces she’s unleashing. For even as Kit revels in midnight gallops and cottage rendezvous, Captain Jack is laying a gentle trap that will curtail her freedom . . . and bind her to him with a ring, a promise . . . and ties of devotion and desire.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "To Distraction (Bastion Club)",
        "Authors": "By Laurens, Stephanie",
        "Description": "The gentlemen of the Bastion Club have proven their courage while fighting England's enemies, but nothing has prepared them for dealing with that most formidable of challenges: the opposite sex.Deverell, Viscount Paignton, is in desperate need of a wife. Unmoved by the matchmaking “herd,” he seeks help from his aunt, who directs him to a lady she vows is perfect for him. Dispatched to a country house party to look the lady over, he discovers her not swanning about among the guests but with her nose buried in a book in the library.Phoebe Malleson is tempted to distraction by Deverell, but marrying him isn't part of her plan. Moved by an incident in her past, Phoebe has a secret cause to which she's committed. Unfortunately, telling Deverell to go away doesn't work, and he quickly learns of her secret. But someone powerful has her cause targeted for destruction&#8212and her in their sights. Phoebe must accept Deverell's help…though the cost to them both might be dear&#8212and deadly.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "A Gentleman's Honor (Bastion Club, 2)",
        "Authors": "By Laurens, Stephanie",
        "Description": "The Season has yet to begin, and the second member of the Bastion Club, tall, handsome Anthony Blake, Viscount Torrington, is already a target for every matchmaking mama in London. None of their flighty daughters can fix his interest, but a certain lady does...Alicia is living a deception. Desperation has caused the determined but penniless lady to boldly launch her ravishing younger sister into the ton and have her make a spectacular match. By masquerading as the widowed \"Mrs. Carrington\" Alicia can act as the perfect chaperone…but fashionable ladies are not accused of murder...When Tony Blake discovers Alicia standing over a dead body in his godmother’s garden, every instinct tells him she is innocent. His connections allow him to take control of the investigation, his social prominence provides her public support, but it is more than honor that compels him to protect her and to do everything in his seductive power to make her his.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The One-in-a-Million Baby Name Book: The BabyNames.com Guide to Choosing the Best Name for Your New Arrival",
        "Authors": "By moss, jennifer and Babynames. com (COR)",
        "Description": "From one of the top parenting websites?a comprehensive naming guide featuring the unique Babynames.com popularity ratings. Forget those traditional lists of names and their meanings?in guiding readers step-by-step through the naming process, as well as the seven things to consider, this book will help parents decide upon a name perfectly suited to their child and family. The only baby name book to draw upon the opinions of 1.2 million parents, each listing features a popularity rating derived from website feedback as well as the top personality traits associated with the name. Readers can also browse lists of names organized in unique ways such as names for sports fans or fiction lovers, and names to be avoided.",
        "Category": " Reference , General",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "A Lady of His Own (Bastion Club)",
        "Authors": "By Laurens, Stephanie",
        "Description": "The seven members of the Bastion Club have served loyally in the perilous service of the Crown. Now they've banded together to support one another through their most dangerous mission of all: getting married.When Charles St. Austell returns home to claim his title as earl, and to settle quickly on a suitable wife as well, he discovers that experience has made him impatient of the young ladies who vie for his attention—with the exception of Lady Penelope Selborne. Years ago, Charles and Penelope's youthful ardor was consummated in an unforgettable afternoon. Charles is still haunted by their interlude, but Penny refuses to have anything more to do with him.If controlling her heart was difficult before, resisting a stronger, battle-hardened Charles is well nigh impossible, yet Penelope has vowed she won't make the same mistake twice, nor will she marry without love. But when a traitorous intrigue draws them together, then ultimately threatens them both—will Penny discover she has a true protector in Charles, her first and only love, who now vows to make her his own?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "A Lady of Expectations",
        "Authors": "By Laurens, Stephanie",
        "Description": "Searching for the perfect woman who will accept him as he is, Jack,  masquerading as a pauper, finds his soulmate in Sophie Winterton, a kind beauty who believes he is searching for a rich wife and would never be interested in a poor girl like her. Reprint.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Beyond Seduction (Bastion Club)",
        "Authors": "By Laurens, Stephanie",
        "Description": "In a moment of recklessness, Gervase Tregarth, 6th Earl of Crowhurst, swears he'll marry the next eligible lady to cross his path. Cloistered at his ancestral castle in Cornwall, with nary a suitable woman for miles, he never expects he'll have to fulfill his pledge, at least not until the London Season begins. But then he meets his neighbor, the very appealing Madeline Gascoigne.Years of secret service to the Crown have taught Gervase the value of always having a loophole—there will be no wedding if he and Madeline are incompatible in any way. So he sets out to prove that they would make a most dreadful match . . . by luring her into his arms and, ultimately, his bed.From their very first kiss, Gervase discovers that the headstrong and independent Madeline is no meek country miss . . . and that the fire between them will burn long beyond that first seduction.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "A Secret Love (Cynster Novels)",
        "Authors": "By Laurens, Stephanie",
        "Description": "And now, Stephanie Laurens has created her boldest Cynster yet - Gabriel - a man who has known the pleasure of many women, but who has given his heart to no one. She was desperate for his help... When a mysterious lady, her face hidden by a black veil, begs Gabriel Cynster for his help, he cannot refuse her plea. For despite her disguise, Gabriel finds the woman alluring and he is powerless to deny her. But he exacts payment as only a Cynster would demand: with each piece of information he uncovers, she must pay him - in the form of a kiss.  He was powerless to resist... Lady Alathea Morwellan knows Gabriel is intrigued, but despite the sparks that fly between them, they have never passed a civil moment together. Yet as the stakes get higher, so does Gabriel′s desire for payment. And with each overpowering kiss, each passionate embrace, Alathea knows that she will not be able to resist his ultimate seduction...but what will happen when she reveals the truth?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Lady of Sin (Seducer)",
        "Authors": "By Hunter, Madeline",
        "Description": "Award-winning author Madeline Hunter transports readers back to the scandal and intrigue of nineteenth-century England in the enthralling tale of a magnetically sensual man, a virtuous woman, and a love story that will take your breath away. . . . She arrives at his home without warning or invitation, determined to win him to her campaign to reform women’s rights. Instead, Charlotte, the widowed Baroness Mardenford, ends up being nearly seduced by Nathaniel Knightridge. No woman is safe from the mesmerizing sensual power of the famed courtroom advocate, and Charlotte discovers she is no exception. But does he recognize her as the masked woman who recklessly joined him in forbidden passion a month ago? And how to avoid becoming his Lady of Sin when he decides to pursue her again?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Seducer",
        "Authors": "By Hunter, Madeline",
        "Description": "She has captivated fans with unforgettable romance novels filled with suspense, seduction, mystery, and passionate love. Now bestselling author Madeline Hunter introduces “the Seducer” in a dazzling tale of a powerfully sensual man, a headstrong young innocent, and a scandalously perilous affair as forbidden as it is irresistible . . .    THE SEDUCER   From the moment he arrived to rescue her, Diane Albret saw more in the darkly handsome, charismatic gentleman than just a guardian. Over the years that have passed since she first laid eyes on Daniel St. John, he had become, quite simply, the most dangerously irresistible man she could ever have imagined. Diane herself has changed from a bewildered schoolgirl, tragically orphaned, into a determined young woman of alluring charm and beauty. Now, leaving the cloistered life of her school, she has been brought to Daniel’s home with dreams of her own amid rumors and hints of scandal. But the legendary seducer seems to have other plans for Diane—and he possesses a secret about her lost past that he will do everything to keep: a secret that will put both their lives in jeopardy, even as the passion they have denied for so long threatens to break out of all control.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Rules of Seduction (Rothwell)",
        "Authors": "By Hunter, Madeline",
        "Description": "Dangerous.  Sensual.  Handsome as sin.  Meet Hayden Rothwell, the shamelessly erotic hero of The Rules of Seduction and author Madeline Hunter’s most irresistible alpha male yet: a man of extraordinary passion and power, a man who can bring out the seductress in any woman.… He enters her home without warning or invitation–a stranger of shadowy motives and commanding sensuality. Within hours, Alexia Welbourne is penniless, without any hope of marriage. Until Hayden Rothwell takes her to bed. When one impulsive act of passion forces Alexia to marry the very man who has ruined her, Hayden’s seduction of Alexia is nearly complete. What Alexia doesn’t know is that her irresistible new husband is driven by a secret purpose–and a debt of honor he will risk everything to repay. Alexia is the wild card. Reluctant to give up their nightly pleasures, Hayden must find a way to keep Alexia by his side...only to be utterly, thoroughly seduced by a woman who is now playing by her own rules.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "LONGEST WAR V471",
        "Authors": "By Timerman, Jacobo",
        "Description": "Argues that the Israeli invasion of Lebanon was really designed to destroy Palestinian nationalism rather than insure the defense of Israel's borders from terrorists",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "The IQ Answer: Maximizing Your Child's Potential",
        "Authors": "By Lawlis, Frank",
        "Description": "The author of the best-selling The ADD Answer outlines a thirteen-step method for helping to bolster a child's brain strength, sharing accessible strategies that combine breathing techniques, nutrition, and exercises designed to overcome thinking obstacles.  100,000 first printing.",
        "Category": " Psychology , Assessment, Testing & Measurement",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Theatre of the Absurd.",
        "Authors": "By Esslin, Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Luckiest Girl in the World : A Young Skater Battles Her Self-Destructive Impulses",
        "Authors": "By Levenkron, Steven",
        "Description": "Just looking at Katie Roskova, you'd think she had it all: she was pretty, popular, an A-student at an exclusive private school, and on her way to becoming a champion figure skater. But there was another Katie, the one she hid from the world, who was having trouble dealing with the mounting pressures of her young life. And it was this Katie who, with no other means of expression available to her, reacted to her overbearing mother, her absent father, her unforgiving schedule, and her oblivious classmates by turning her self-doubt into self-hatred. And into self-mutilation. In his previous novel, The Best Little Girl in the World, Steven Levenkron brought insight, expertise, and sensitivity to the painful subject of anorexia nervosa. Now he applies these same talents to demystifying a condition that is just as heartbreaking, and becoming more common everyday. Through his depiction of Katie's self-mutilating behavior, she is called \"a cutter\" by her peers, and her triumphant road to recovery, he offers a compelling profile of a young girl in trouble, and much-needed hope to the growing numbers who suffer from this shocking syndrome.",
        "Category": " Fiction , Sports",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Discover Chocolate: The Ultimate Guide to Buying, Tasting, and Enjoying Fine Chocolate",
        "Authors": "By Gordon, Clay",
        "Description": "A connoisseur's guide to acquiring and consuming the world's best chocolates is a lavishly illustrated reference that provides information on cocoa-growing regions, makes recommendations for pairing chocolate with wine, and addresses the latest claims about the health benefits of chocolate. 20,000 first printing.",
        "Category": " Cooking , Courses & Dishes , Chocolate",
        "Publisher": "Gotham",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Color Me Butterfly: A True Story of Courage, Hope and Transformation",
        "Authors": "By Marlow, L. Y.",
        "Description": "",
        "Category": " Family & Relationships , Abuse , Domestic Partner Abuse",
        "Publisher": "El Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Get Out Of Our House: Revolution! (A New Plan for Selecting Representatives)",
        "Authors": "By Cox, Tim",
        "Description": "Politicians have taken control of our government, and the long-term viability of our nation is at risk. The time has come to take a stand—we cannot afford to wait any longer. Get Out of Our House (GOOOH) details the plan America will use to evict all 435 politicians from the United States House of Representatives—replacing them with patriots just like you. Author and patriot Tim Cox has created a system designed to bypass the two parties, sever all ties with special interest money, replace career politicians, and hold elected officials accountable. GOOOH was designed not to favor any person or viewpoint. The system allows the people who participate in the process to select the candidate who can best represent their district.This is your call to action. Will you join the revolution, or leave the problem for our children and grandchildren? Every American patriot is encouraged to step forward. The fate of our nation depends on you. It is time to engage!",
        "Category": " Political Science , American Government , General",
        "Publisher": "Bridgeway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The Rising Shore--Roanoke",
        "Authors": "By Homsher, Deborah",
        "Description": "As Elenor White Dare and her young servant, Margaret Lawrence, sail from London to the Virginia wilderness, they plan to explore the New World, their adventure will turn out to be nothing like what they have planned.",
        "Category": " Fiction , Historical",
        "Publisher": "Deborah Homsher/Blue Hull",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Lonely Planet Bahamas Turks & Caicos (Travel Survival Kit)",
        "Authors": "By Baker, Christopher P.",
        "Description": "A guide to the islands explores the region's cuisine, history, off-the-beaten-track attractions, beaches, plantations, fishing, accommodations, and local culture",
        "Category": " Travel , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Messages from Nature: Short Stories and Vignettes",
        "Authors": "By Daly-Lipe, Patricia",
        "Description": "Messages from Nature is a collection of short stories about animals, trials at sea, and the evolutionary journey of man and nature. It is a book for all ages. Based on my personal experiences, most of the stories were previously published in newspapers and magazines over the years. Also included is one poignant tale about a greyhound written by my late father, Daly Highleyman, and published in the 1930s.How would it feel to be on a small sailboat far from land in gale force winds or suddenly subjected to a micro-burst? What was it like to be up at the helm of a 165-foot concrete schooner and, looking down the steps, see water gushing into the cabin? Did Sweet William come back to say goodbye? How can a puppy found starving to death in the Virginia countryside become a master sailor? Explore and discover the answers to these questions and more in Messages from Nature.Progress is being made all over the world, the so-called progress named technology. But another avenue of progress is also being made all over the world and that is the progress of research in the field of creativity. It cannot be ignored that the creative endeavor has a spiritual side to it. Nor can it be said that creative work results from technical know-how. Inspiration is a key factor and its roots may not be as nebulous as they first appear. Genuine creative imagination does not just spring from the right hemisphere of the brain. I believe its roots come from a much deeper place: the heart. In this vein, it is my hope that this little tome will inspire the reader to feel and react to the beauty of nature and the love of animals; in effect, to experience the invaluable life lessons that only Nature can teach.",
        "Category": " Nature , Animals , General",
        "Publisher": "CreateSpace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Dolls' House",
        "Authors": "By RUMER GODDEN",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Seafarer",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1970"
        }
    },
    {
        "Title": "Bones That Float, A Story of Adopting Cambodia",
        "Authors": "By Grossman, kari Grady",
        "Description": "On March 24, 2001, American writer Kari Grady Grossman walked into a crowded orphanage outside Phnom Penh, Cambodia, and met her eight-month-old son. One of the first questions Kari asked was, “How did he get here?” The complex and, at times, heartwrenching answer is told in this magnificent book that encompasses Kari’s personal journey to adoption, Cambodia’s gruesome history of war and genocide, and the stories of two Cambodians—one who escaped the Khmer Rouge’s bloody reign and one who did not.The interweaving stories grab your heartstrings and never let go. From the moment Kari realizes that she will never be an “earth momma” practicing prenatal yoga to years later, as Kari wends her way on the back of a moto-taxi through Phnom Penh’s smog-choked streets trying to make a difference in her son’s birth nation, you can’t read impassively. Bones That Float takes you into the Khmer Rouge jungle where boy soldiers force starving families to labor all day at gunpoint, and it brings you to modern-day Phnom Penh streets where foreign pedophiles purchase the innocence of preteen Cambodian girls. But ultimately Bones That Float—a Cambodian phrase for the sacred that rises above the suffering—is a tale of hope. Kari reminds us that our world is “one big family” and that we cannot—or dare not—turn our backs on people who suffer, in part because of our own country’s foreign policy missteps. To read Bones That Float is to open your heart to caring.",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "Wild Heaven Press",
        "Price Starting With ($)": "7.69",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Raising Baby Green: The Earth-Friendly Guide to Pregnancy, Childbirth, and Baby Care",
        "Authors": "By Digeronimo, Theresa Foy, Greene, Alan R., Pavini, Jeanette, and Lawton, Val (ILT)",
        "Description": "In this illustrated and easy-to-use guide, noted pediatrician Dr. Alan Greene, a leading voice of the green baby movement, advises parents how to make healthy green choices for pregnancy, childbirth, and baby care—from feeding your baby the best food available to using medicines wisely. Consumer advocate Jeanette Pavini includes information for making smart choices and applying green principles to a whole new universe of products from zero-VOC paints for the nursery, to pure and gentle lotions for baby’s delicate skin, to the eco-friendly diapers now in the marketplace, as well as specific recommendations for hundreds of other products.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Last Rose: A True Celebration of Eternal Life",
        "Authors": "By Pierce, Thomas E.",
        "Description": "On March 6, 2004, Thomas Pierce, his wife, JoAnn, and his daughter Lisa were on the water taxi that overturned in Baltimore's Inner Harbor. He lost both of them that day.Pierce's account of the accident and the letter to Lisa written by one of the reservists that rescued her give the reader a grim understanding of what that day was like. But this is not a book about the accident-this is a book about the power of love. Love as we know it and understand it, and love that goes beyond our understanding. This is a book Pierce never intended to write, but he felt compelled to share the things that carried him through this tragedy and all the signs that helped him move on with his life. It is truly a celebration of two lives that will go on forever.Once you have read this book you will find yourself passing it on to friends and family, so that they too can share the experience of the power of love.",
        "Category": " Religion , Inspirational",
        "Publisher": "Bridgeway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The New Place (Sticman & the Kastle Kids) (Sticman & the Kastle Kids)",
        "Authors": "By Clabe Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "Empty Harbor Productions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Generation Kill: Devil Dogs, Ice Man, Captain America, and the New Face of American War",
        "Authors": "By Wright, Evan",
        "Description": "Based on Evan Wright's National Magazine Award-winning story in Rolling Stone, this is the raw, firsthand account of the 2003 Iraq invasion that inspired the HBO® original mini-series.Within hours of 9/11, America’s war on terrorism fell to those like the twenty-three Marines of the First Recon Battalion, the first generation dispatched into open-ended combat since Vietnam. They were a new pop-culture breed of American warrior unrecognizable to their forebears—soldiers raised on hip hop, video games and The Real World. Cocky, brave, headstrong, wary and mostly unprepared for the physical, emotional and moral horrors ahead, the “First Suicide Battalion” would spearhead the blitzkrieg on Iraq, and fight against the hardest resistance Saddam had to offer.Hailed as “one of the best books to come out of the Iraq war”(Financial Times), Generation Kill is the funny, frightening, and profane firsthand account of these remarkable men, of the personal toll of victory, and of the randomness, brutality and camaraderie of a new American War.",
        "Category": " History , Military , Iraq War (2003-2011)",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Star Trek Log Nine",
        "Authors": "By Foster, Alan Dean",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1977"
        }
    },
    {
        "Title": "The Gulf (Dan Lenson Novels)",
        "Authors": "By Poyer, David",
        "Description": "Defense policy makers from Britain and the Gulf analyze different aspects of British policy and its repercussions for Gulf security. Seeking to nurture defense and security dialogue, contributors examine both immediate and potential threats to Gulf security and underline the need for the Gulf countries to develop a greater range of consultative mechanisms. This book offers valuable perspectives on some of the more critical issues involved and provides interesting insight on the views held by prominent decision-makers, including Lord Robertson, General Sir Charles Guthrie, HH Sheikh Salman of Bahrain and HH Sheikh Salem of Kuwait.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "The Castro Gene",
        "Authors": "By Buchholz, Todd",
        "Description": "The Castro Gene is seamless, suspenseful and shocking. After killing a man in the ring, Luke Braden quits boxing. While toiling as a security guard and yearning to reinvent himself, Luke is swept up into the high-flying domain of Paul Tremont. Tremont, the hottest hedge fund hand around, has a penchant for the dramatic and a disquieting need to control. Being Tremont's protege has its perks-Luke trades in his ratty basement apartment for a penthouse view, his gym clothes for designer suits. But there are strings attached, and Tremont is pulling those strings. Why does Tremont need a washed-up boxer? The answer lies not in what Luke is, but who he is. Luke Braden is the only man who can execute Tremont's diabolical scheme. Fidel Castro risks one last trip to the U.S., and one man will be forced to stand in his way. Luke Braden is in for the fight of his life - or the fight for his life. Intricately plotted with unexpected twists and breathtaking turns, The Castro Gene is a knockout.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Oceanview Publishing",
        "Price Starting With ($)": "6.09",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Alcatraz from Inside: The Hard Years 1942-1952",
        "Authors": "By Quillen, Jim",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Golden Gate Natl Park Assn",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Acquisitive Society",
        "Authors": "By R.H. Tawney",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "The Fiction Class",
        "Authors": "By Breen, Susan",
        "Description": "Read Susan Breen's posts on the Penguin Blog.A witty, honest, and hugely entertaining story for anyone who loves books, or has a difficult mother. And, let’s face it, that’s practically everybody . . .  On paper, Arabella Hicks seems more than qualified to teach her fiction class on the Upper West Side: she’s a writer herself; she’s passionate about books; she’s even named after the heroine in a Georgette Heyer novel.  On the other hand, she’s thirty-eight, single, and has been writing the same book for the last seven years. And she has been distracted recently: on the same day that Arabella teaches her class she also visits her mother in a nursing home outside the city. And every time they argue. Arabella wants the fighting to stop, but, as her mother puts it, “Just because we’re family, doesn’t mean we have to like each other.” When her class takes a surprising turn and her lessons start to spill over into her weekly visits, she suddenly finds she might be holding the key to her mother’s love and, dare she say it, her own inspiration. After all, as a lifelong lover of books, she knows the power of a good story.",
        "Category": " Fiction , Women",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Working with Difficult People: Revised and Expanded",
        "Authors": "By Solomon, Muriel",
        "Description": "Everyone's work day is filled with them--people who frustrate, impede, maneuver, undermine, plot, connive, and whine. This top communications consultant details specific techniques for handling all of them. Easy-to-follow scenarios for every situation are featured in this handy guide.",
        "Category": " Business & Economics , Business Etiquette",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Moral Sense",
        "Authors": "By Wilson, James Q.",
        "Description": "Uses data gathered from diverse scientific disciplines to argue that the origin and development of moral reasoning do have a biological basis. By the author of Thinking about Crime. 30,000 first printing.",
        "Category": " Philosophy , History & Surveys , Modern",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Math Doesn't Suck: How to Survive Middle-School Math Without Losing Your Mind or Breaking a Nail",
        "Authors": "By McKellar, Danica",
        "Description": "Read Danica McKellar's posts on the Penguin BlogFrom a well-known actress and math genius—a groundbreaking guide to mathematics for middle school girls, their parents, and educatorsAs the math education crisis in this country continues to make headlines, research continues to prove that it is in middle school when math scores begin to drop—especially for girls—in large part due to the relentless social conditioning that tells girls they “can’t do” math, and that math is “uncool.” Young girls today need strong female role models to embrace the idea that it’s okay to be smart—in fact, it’s sexy to be smart!It’s Danica McKellar’s mission to be this role model, and demonstrate on a large scale thatmath doesn’t suck. In this fun and accessible guide, McKellar—dubbed a “math superstar” byThe New York Times—gives girls and their parents the tools they need to master the math concepts that confuse middle- schoolers most, including fractions, percentages, pre-algebra, and more. The book features hip, real-world examples, step-by-step instruction, and engaging stories of Danica’s own childhood struggles in math (and stardom). In addition, borrowing from the style of today’s teen magazines, it even includes a Math Horoscope section, Math Personality Quizzes, and Real-Life Testimonials—ultimately revealing why math is easier and cooler than readers think.",
        "Category": " Juvenile Nonfiction , Mathematics , General",
        "Publisher": "Avery",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "My Bachelor's Life",
        "Authors": "By Crebillon Fils",
        "Description": "",
        "Category": "",
        "Publisher": "Belmont",
        "Price Starting With ($)": "6.15",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "My Feet Aren't Ugly: A Girl's Guide to Loving Herself from the Inside Out",
        "Authors": "By Beck, Debra and Anthony, Maggie (ILT)",
        "Description": "Do you ever feel bad about yourself or have trouble being yourself while still fitting in? Do you have tough questions you are afraid to ask?In this funny, honest book, teen mentor Debra Beck provides personal stories, quizzes, journaling exercises, and thoughts from teens themselves to help you develop your self-confidence. Learn how to make healthy decisions in the face of peer pressure, have strong relationships with family and friends, and respect and love yourself for who you are. This revised and updated edition also has new chapters on bullying and internet safety.",
        "Category": " Young Adult Nonfiction , Social Topics , Self-Esteem & Self-Reliance",
        "Publisher": "Beaufort Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The New Rules of Lifting: Six Basic Moves for Maximum Muscle",
        "Authors": "By Schuler, Lou and Cosgrove, Alwyn",
        "Description": "Want to get more out of your workout and spend less time in the gym?  Many guys devote so many hours to lifting weight yet end up with so little to show for it.  In many cases the problem is simple:  they aren't doing exercises based on the movements their bodies were designed to do.  Six basic movements - the squat, deadlift, lunge, push, pull and twist - use all of the body's major muscles.  And, more important, they use those muscles in co-ordinated action, the way they were designed to work.  The New Rules of Lifting, now in paperback and with more than one hundred photographs, gives you more than a year's worth of workouts based on these six basic movements.  Whether you're a beginner, an experienced lifter looking for new challenges, or anything in between, you can mix and match the workouts to help you get bigger, stronger and leaner.  In addition, the comprehensive nutritional information provided makes The New Rules of Lifting a complete guide to reaching all your goals.  If you aren't using The New Rules of Lifting, you aren't getting the best possible results.",
        "Category": " Sports & Recreation , Bodybuilding & Weight Training",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Food Fights: Winning the Nutritional Challenges of Parenthood Armed with Insight, Humor, and a Bottle of Ketchup",
        "Authors": "By Jana, Laura A. and Shu, Jennifer",
        "Description": "Restore \"peas and harmony\" to the dining table with this comprehensive guide to building successful childhood feeding strategies. Focus is placed on the food-fight challenges parents are most likely to face?such as starting babies on solid foods, dealing with picky eaters, and making healthy food choices in child-care settings and restaurants?and a wide range of winning solutions are offered. More than a simple nutrition guide, this book also addresses the behavior and development issues surrounding the feeding challenges of early childhood. With a family-sized serving of useful advice and a generous helping of humor, this resource offers invaluable food for thought and real world advice that parents can use every day.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "American Academy of Pediatrics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Compromised (Berkley Sensation)",
        "Authors": "By Noble, Kate",
        "Description": "In national bestselling author Kate Noble's “delectable and delightful”* historical romance debut, a pair of mismatched lovers unwillingly find themselves engaged in a most scandalous position… Miss Gail Alton was not having a good day. Or a good year. First, she’s strong-armed into attending the Season as a foil to her beautiful sister Evangeline. Then, while riding her mare in the park, she gets toppled by a stuffy, self-important, too-handsome-by-half “gentleman” who has the audacity to blame her for their fall into the chilly lake! Little does Gail know that the very same man will soon be found in a compromising position with her sister... Forced into asking for Evangeline’s hand in marriage, Maximillian, Viscount Fontaine, can’t take his mind off the irksome girl who threw him from his horse and who can match wits with him at every turn. He’s determined to follow through with his best intentions, yet he can’t deny that Gail makes him want to cast propriety aside—and whisk away the sister of his soon-to-be bride...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Elephant in the Room",
        "Authors": "By Baker, Ed",
        "Description": "",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "First Command",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Ultimate Kauai Guidebook: Kauai Revealed",
        "Authors": "By Doughty, Andrew",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Wizard Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "A Parent's Guide to Building Resilience in Children and Teens: Giving Your Child Roots and Wings (American Academy of Pediatrics)",
        "Authors": "By Jablow, Martha Moraghan and Ginsburg, Kenneth R., M.d.",
        "Description": "Today’s children face a great deal of stress ? academic performance, heavy scheduling, high achievement standards, media messages, peer pressures, family tension. Without healthier solutions, they often cope by talking back, giving up, or indulging in unhealthy behaviors. Show your child how to bounce back ? and THRIVE ? with coping strategies from one of the nation’s foremost experts in adolescent medicine. This 7-C plan for resilience that helps kids of all ages learn competence, confidence, connection, character, contribution, coping, and control to help them bounce back from challenges. You'll find effective strategies to help your children and teens: ?  Make wise decisions?  Recognize and build on their natural strengths?  Deal effectively with stress?  Foster hope and optimism?  Develop skills to navigate a complex world?  Avoid risky behaviors?  Take care of their emotions and their bodiesPlus, two Personalized Stress Management Plans help your child create a customized strategy. It’s everything your child needs to face life’s challenges and bounce back with confidence!",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "American Academy of Pediatrics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Light a Penny Candle",
        "Authors": "By Binchy, Maeve",
        "Description": "Beloved author Maeve Binchy's first published novel, an engrossing coming of age tale about the incredible bond of friendship.To escape the chaos of London during World War II, young Elizabeth White is sent to live a safer life in the small Irish town of Kilgarret. It is there, in the crowded, chaotic O’Connor household, that she meet Aisling—a girl who soon becomes her very best friend, sharing her pet kitten and secretly teaching her the intricacies of Catholicism. Aisling’s boldness brings Elizabeth out of her proper shell; later, her support carries Elizabeth through the painful end of her parents’ chilly marriage. In return, Elizabeth’s friendship helps Aisling endure her own unsatisfying marriage to a raging alcoholic. Through the years, they come to believe they can overcome any conflict, conquer any hardship—as long as they have each other. Now they’re about to find out if they're right...“A sumptuous saga.”—Harper’s“Wonderful…a novel that could be mistaken for life.”—New York Daily News",
        "Category": " Fiction , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Dogs of a Different Collar",
        "Authors": "By Regan, Marti",
        "Description": "Abby wants both puppies, but can only bring one home. \"What happened to the other pup?\" she wonders. Follow the parallel lives of two dogs and the girls who adopt them.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Trafford Publishing",
        "Price Starting With ($)": "7.0",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Precious Moments, Seasons of Faith Series, Gifts from the Heart",
        "Authors": "By Butcher, Sam (ILT)",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Nelson Bibles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Not For Sale: The Return of the Global Slave Trade--And How We Can Fight It",
        "Authors": "By Batstone, David",
        "Description": "Award–winning journalist David Batstone reveals the story of a new generation of 21st century abolitionists and their heroic campaign to put an end to human bondage. In his accessible and inspiring book, Batstone carefully weaves the narratives of activists and those in bondage in a way that not only raises awareness of the modern–day slave trade, but also serves as a call to action.  With 2007 bringing the 200th anniversary of the climax of the 19th century abolitionist movement, the world pays tribute to great visionary figures such as William Wilberforce of the United Kingdom and American Frederick Douglass for their remarkable strides toward framing slavery as a moral issue that people of good conscience could not tolerate. This anniversary serves not only as a commemorative date for battles won against slavery, but also as a reminder that slavery and bondage still persist in the 21st century. An estimated 27 million people around the globe suffer in situations of forced labor and commercial sexual exploitation from which they cannot free themselves. Trafficking in people has become increasingly transnational in scope and highly lucrative. After illegal drug sales and arms trafficking, human trafficking is today the third most profitable criminal activity in the world, generating $31 billion annually. As many as half of all those trafficked worldwide for sex and domestic slavery are children under 18 years of age.",
        "Category": " Political Science , Human Rights",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Radical Simplicity: Small Footprints on a Finite Earth",
        "Authors": "By Merkel, Jim",
        "Description": "Imagine you are first in line at a potluck buffet. The spread includes not just food and water, but all the materials needed for shelter, clothing, healthcare, and education. How do you know how much to take? How much is enough to leave for your neighbors behind you—not just the six billion people, but the wildlife, and the as-yet-unborn?In the face of looming ecological disaster, many people feel the need to change their own lifestyles as a tangible way of transforming our unsustainable culture. Radical Simplicity is the first book that guides the reader to a personal sustainability goal, then offers a process to monitor progress to a lifestyle that is equitable amongst all people, species, and generations. It employs three tools to help readers begin their customized journey to simplicity:>It builds on steps from Your Money or Your Life so readers can design their own personal economics to save money, get free of debt, and align their work with their values.It uses refined tools from Our Ecological Footprint so readers can measure how much nature is needed to supply all they consume and absorb their waste.Combining lyrical narrative, compassionate advocacy, and absorbing science, Radical Simplicity is a practical, personal answer to twenty-first century challenges that will appeal as much to Cultural Creatives and students as to spiritual seekers, policy makers, and sustainability professionals.Jim Merkel quit his job as a military engineer following the Exxon Valdez disaster and has since worked to develop tools for personal and societal sustainability. He founded the Global Living Project to further this work and conducts workshops around North America on this topic.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "New Society Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Animal, Vegetable, Miracle: A Year of Food Life",
        "Authors": "By Kingsolver, Barbara, Kingsolver, Camille, and Hopp, Steven L.",
        "Description": "Bestselling author Barbara Kingsolver returns with her first nonfiction narrative that will open your eyes in a hundred new ways to an old truth: You are what you eat.\"As the U.S. population made an unprecedented mad dash for the Sun Belt, one carload of us paddled against the tide, heading for the Promised Land where water falls from the sky and green stuff grows all around. We were about to begin the adventure of realigning our lives with our food chain. \"Naturally, our first stop was to buy junk food and fossil fuel. . . .\"Hang on for the ride: With characteristic poetry and pluck, Barbara Kingsolver and her family sweep readers along on their journey away from the industrial-food pipeline to a rural life in which they vow to buy only food raised in their own neighborhood, grow it themselves, or learn to live without it. Their good-humored search yields surprising discoveries about turkey sex life and overly zealous zucchini plants, en route to a food culture that's better for the neighborhood and also better on the table. Part memoir, part journalistic investigation, Animal, Vegetable, Miracle makes a passionate case for putting the kitchen back at the center of family life and diversified farms at the center of the American diet. \"This is the story of a year in which we made every attempt to feed ourselves animals and vegetables whose provenance we really knew . . . and of how our family was changed by our first year of deliberately eating food produced from the same place where we worked, went to school, loved our neighbors, drank the water, and breathed the air.\"",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Harper",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Yearning: Living Between How It Is How It Ought to Be",
        "Authors": "By Barnes, M. Craig",
        "Description": "Does God want us fulfilled?Popular psychology says we should be fulfilled.  Advertisements tease us with dozens of ways we can be fulfilled. Many preachers and book promise Christian fulfillment.But in this surprising (and surprisingly liberating) book, Craig Barnes suggests we weren't created to be whole or complete.  With a fresh reading of the early chapters of Genesis, he says that much of our pain and disillusionment arises from wrong expectations of the gospel and of life.Echoing comedian Bob Newhart, Barnes \"would like to make a motion that we face reality.\"  He candidly draws from his own experience as a son, a student, a husband, a father and a pastor to help us see what we all know but are so reluctant to say aloud--that biblical living will not save us from crises or unfulfillment.Barnes writes for anyone who knows that faith must be tough enough to \"hold up in the emergency rooms of life.\" But he doesn't merely help us face reality.  He helps us see how our needs and limitations are gifts, the best opportunities we have to receive God's grace.  Because of that, Yearning may be the most honest and the most helpful book you'll read this year.",
        "Category": " Religion , Ethics",
        "Publisher": "IVP",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Sweet Talk of Success!: How 35 Amazing Women Overcame Major Challenges in Life",
        "Authors": "By Today's Christian Woman (COR)",
        "Description": "Drawn from the cover stories of the award-winning Today's Christian Woman, these 35 narratives offer comfort, inspiration, and hope to women who stuggle with problems such as emotional infidelity, divorce, disabilities, and sexual abuse. A bright color pallet and contemporary design form the background for this fascinating collection of life-changing, success stories.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Life After Deployment: Military Families Share Reunion Stories and Advice",
        "Authors": "By Pavlicin, Karen M.",
        "Description": "“No one can totally prepare us for the emotional roller coaster deployments and reintegration brings, but this book will give you tools that will help the process immensely.” — Kathy Guzzon for Homefront United NetworkLife After Deployment captures the tender and moving stories of military families during their reunion. Service members and their spouses, parents, fiancées, and children share the joy and anxiety of homecoming, the adjustments of living together again, and how they coped with anger, depression, PTSD, injuries, grief, and other challenges. Some families had fairytale endings. Most worked hard to rebuild their relationships after much time and change. A few suffered great losses. These military families talk candidly about what their experience was really like, offering hope and advice to others who walk this journey.First Lady of the Marine Corps Recommended Reading ListForeword Reviews Book of the Year Awards – FinalistMilitary Writers Society of America – Gold Medal, Best Reference“…a must have for today’s military families facing deployments.” — Alanna Schmidtke, North Dakota National Guard family support“I felt so guilty for a lot of the emotions I’d had during my husband’s deployment and reunion. And now, we are going through it all again with our son. It’s such a comfort to find out I’m not alone! I was incredibly touched by these stories. Thank you so much for blessing us with this book, your keen insights, and amazing honesty.” —Julie LaBelle, military wife and mom",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Elva Resa Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Nun and the Bureaucrat--How They Found an Unlikely Cure for America's Sick Hospitals",
        "Authors": "By Savary, Louis M. and Crawford-Mason, Clare",
        "Description": "",
        "Category": " Medical , Education & Training",
        "Publisher": "CC-M Productions, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Warrior in the Shadows",
        "Authors": "By Wynne, Marcus",
        "Description": "Thomas Harris's The Silence of the Lambs meets Richard Marcinko's Rogue Warriorin this thriller that races at breakneck pace--from the critically acclaimed author who gave Stephen Coonts \"a nightmare for a week.\"Alfie Woodard always completes a mission. The skills he learned in the Australian Special Air Service have carried over to his new life as an Aboriginal spiritual leader and contract killer for drug lord Jay Burrell. Alfie knows how to stalk and kill a victim, then disappear without a trace. But it's the ritualistic murders and the devouring of his victims during the Aboriginal ceremony that send a clear message to Burrell's enemies.Charley Payne was losing it. He had spent his life as a door kicker for the U.S. Central Intelligence Agency in the world's hot spots. When his friend, Police Detective Sergeant Bobby Lee Martaine realized that Charley was becoming a danger to himself and his missions, Bobby Lee offered him a job. Trading in his guns for a camera, Charley finds his new life as a forensic photographer in the Twin Cities uneventful and peaceful--just what he needed, until Charley is called in to photograph a gruesome murder scene.There are no fingerprints and only one clue, a bizarre Aboriginal painting. Most in the police department begin to suspect a serial killer is on the loose. Bobby Lee is closing in on Alfie, but Alfie learned in the SAS that a mission is not complete if you've left a trail behind. When Bobby Lee and his family turn up dead, Charley returns to the way of the gun. But he will be fighting a war on the spiritual leader's turf in the Australian outback. A fight to the death that took place in the Aboriginal dream world five centuries before.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Best Editorial Cartoons of the Year: 2008 Edition",
        "Authors": "By Brooks, Charles (EDT)",
        "Description": "The 2008 presidential campaign got off to an early start with Democratic hopeful Barack Obama and Republican Rudy Giuliani. Violence in the Middle East reached new levels, surpassed only by the escalating violence in Darfur. Gas prices skyrocketed, while the value of the U.S. dollar plummeted overseas. U.S. troops are still in Iraq and the fence along the Mexican border has still not been built. Wildfires, droughts, earthquakes, and tsunamis have fueled the increasing concerns about the threat of global warming, which reached celebrity status with Al Gore's documentary. Selected for clarity of position as well as for exceptional execution, this collection includes the work of Pulitzer Prize-winning artists, the year's major award-winning cartoons, and the best work from Canadian cartoonists.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Pelican Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Across the River (An Andie Rinaldi Mystery)",
        "Authors": "By Solimini, C.",
        "Description": "It’s the summer of 1992, and William Jefferson Clinton seems headed for the White House. But not all Baby Boomers are having such a great year. Medical reporter Andrealisa “Andie” Rinaldi has just lost her job at the country’s most respected newspaper. (Was it really such a breech of ethics to use her cousin as an interview source?) Her big-city apartment is about to go condo. (Why would she even miss that one-window sweatbox?) Her long-distance romance with a cell biologist is suffering from travel fatigue. (Is love ever possible on a cellular level?) And her twin sister is threatening a relapse of her “impulse control problem.” (Has Caterina gone off her meds again?)  Worse yet, Andie’s new employer, at the country’s least respected celebrity tabloid, has just learned of her past relationship with millionaire real-estate developer Joel Hartt: Nearly 25 years ago, Andie was Joel’s next-door neighbor and frequent playmate. Now the grown-up Joel is the prime suspect in the death of his daughter, Emma, a young fashion model/actress found strangled last New Year’s Eve. The case was never officially solved, and the tabloids won’t let it die. When her editor orders Andie to use her childhood connection for an exclusive interview with Joel, Andie must cross the river to the two-block-wide town she hasn’t set foot in since she was 12. And she has her own reasons for wanting to avoid this trip down Memory Lane. Back in the old neighborhood, Andie finds herself reliving her preteen world of Magic 8 Ball, Mystery Date, and Hide-and-Seek. Several former classmates from Holy Mother Little Academy (or Holy Moly, as it is known) reappear to replay the past: Her childhood nemesis is now the police detective on the case; her grade-school best friend is Joel’s lawyer; and her first crush has a few secrets of his own. When a new waterfront apartment complex goes up in smoke and another body is found under the smoldering rubble, Andie wonders if this killing was fueled by the first crime—and if the overheated tabloid stories she's been writing helped fan the flames. In this tiny riverside town, shadowed by magnificent cliffs on one side and the world's most treacherous city on the other, Andrealisa Rinaldi finds herself caught between a rock and a hard place. Rekindled rivalries and long-ago loyalties force Andie to confront the ultimate question: Can she go home again?",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Deadly Ink Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "The Chocolate Cake Sutra: Ingredients for a Sweet Life",
        "Authors": "By Larkin, Geri",
        "Description": "The Chocolate Cake Sutra demonstrates that when the best aspects of a spiritual life converge, we are better able to take the slings and arrows of our lives in stride with grace and a grin. What are the right ingredients for a life filled with delectable treats?3 cups of living an adventurous lifeInclude a large portion of true friendshipAdd a dash of genuine generosity, extreme tolerance, and clear-headednessLeave dish open to all kinds of knowledgeStir with great energyBake ethically and serve with exceptional amounts of wisdomChock full of moving and enlightening stories, The Chocolate Cake Sutra will help you let go of perfectionism and celebrate the sacred nature of the life you already have.",
        "Category": " Religion , Buddhism , Zen",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "A Reunion to Die For (Five Star Mystery Series) (Five Star Mystery Series)",
        "Authors": "By Carr, Lauren",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Five Star",
        "Price Starting With ($)": "13.57",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Prayers for a Thousand Years",
        "Authors": "By Roberts, Elizabeth J. (EDT) and Amidon, Elias (EDT)",
        "Description": "Inspiration from leaders and visionaries around the world.• Includes more than 250 selections of mostly original material by prominent spiritual teachers, writers and activists from around the world.• Editors have a strong track of high-quality material, including the bestselling 'Earth Prayers'.",
        "Category": " Religion , Inspirational",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "She's Nobody's Baby: A History of American Women in the Twentieth Century",
        "Authors": "By Levine, Suzanne (EDT)",
        "Description": "Traces the changing role of the American woman from the turn of the century to the present, and looks at notable women and their accomplishments",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    }
]