[
    {
        "Title": "Six Disciplines® Execution Revolution: Solving the One Business Problem That Makes Solving All Other Problems Easier",
        "Authors": "By Harpst, Gary",
        "Description": "Argues that developing and implementing an execution strategy plan which involves all employees will ensure that small and midsized companies will be able to manage growth, remain innovative, and increase profitability.",
        "Category": " Business & Economics , Strategic Planning",
        "Publisher": "Six Disciplines Publishing",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Secret Of Blackbeards Treasure By Mary Maden 2001 (Petsy An Tazz's)",
        "Authors": "By Mary Maden",
        "Description": "",
        "Category": "",
        "Publisher": "479667",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Spider-Man 3: Spider-Man's New Suit",
        "Authors": "By Tripathi, Namrata and Raymond, N. T.",
        "Description": "Spider-Man feels powerful in his new black suit. He's faster, stronger, bolder. But soon he realizes the suit has a life all its own. Will he be able to shed his evil skin or will the black suit take control?",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Festival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Aquariums For Dummies",
        "Authors": "By Hargrove, Mic and Hargrove, Maddy",
        "Description": "Keeping an aquarium adds beauty and grace to your life. That elegant little world in a glass box can be your respite from the cares of the day and even can lower your blood pressure. It can be a great outlet for your artistic impulses, and educational for your kids. And when it comes to pets, you can’t go wrong with fish. They eat little, require minimal space, and need no training. They never stray, bay at the moon, or leave surprises on your lawn. They’re not prone to rude sniffing, and they won’t chase your letter carrier. And fish never get hairballs or scratch your furniture.Aquariums For Dummies answers all your fishy questions about keeping an aquarium and makes it easy to get into the swim of things with your own freshwater, brackish, or marine aquarium. You’ll discover how to:Choose the right aquarium for youSelect the best fishCreate and maintain a healthy aquariumLocate good deals on equipmentDesign a dazzling underwater environmentWith humor and without a lot of jargon, expert Maddy and Mic Hargrove cover all the bases. They give you step-by-step instructions on how to select equipment and set up your aquarium. And they explore an array of important and fun topics, including:Tanks, water sources, substrates and decorations, and water testingLive plants for freshwater and brackish aquariums and invertebrates for marine aquariumsFish anatomy and physiology (plus a guide to dozens of freshwater coldwater, tropical marine, and brackish fish)Choosing a quality dealer and developing a good relationship with themDeciding what the right species for you and selecting fishFish diet and nutritionDiagnosing and treating diseases in fishBreeding fish for fun and profitA fun and easy guide to creating and maintaining a beautiful aquarium, Aquariums For Dummies is your entrée to the fascinating and rewarding world of fishkeeping.",
        "Category": " Pets , Fish & Aquariums",
        "Publisher": "Wiley Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "One Fat Englishman",
        "Authors": "By Amis, Kingsley",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Parenting Your Out-of-Control Teenager: 7 Steps to Reestablish Authority and Reclaim Love",
        "Authors": "By Sells, Scott P.",
        "Description": "Every teenager rebels against authority at some point--talks back, breaks curfew, or disobeys. But literally millions of teens take their rebellion to a point where it disrupts their families and endangers their own futures or even their lives.  If one of these teens is yours, you've probably lived through years of conflicting advice and pat solutions that don't last.  Finally, this breakthrough guide from a master therapist will show you the seven steps to positive, permanent change for you and your teenager:1.  Learn the real reasons for teen misbehavior.2.  Make an ironclad contract to stop that behavior.3.  Troubleshoot future problems.4.  End button-pushing.5.  Stop the \"seven aces\" -- from disrespect to threats of violence.6.  Mobilize outside help.7.  Reclaim lost love within the family.Clear, compassionate, and packed with real-life solutions to real-life problems, Parenting Your Out-of-Control Teenager gives parents the tools they need to turn their families' lives around for good.",
        "Category": " Family & Relationships , Life Stages , Teenagers",
        "Publisher": "Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Mazurka",
        "Authors": "By Armstrong, Campbell",
        "Description": "When a visiting Communist Party leader is murdered in a crowded train station while under the protection of Scotland Yard's Frank Pagan, the frustrated agent's subsequent inquiry uncovers a plot by CIA agents and Communist hardliners to sabotage perestroika",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "How to Lose Body Fat",
        "Authors": "By Darden, Ellington",
        "Description": "",
        "Category": "",
        "Publisher": "Anna Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "The Mountbattens;: The last royal success story",
        "Authors": "By Hatch, Alden",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Presence: Human Purpose and the Field of the Future",
        "Authors": "By Peter M. Senge, C. Otto Scharmer, Joseph Jaworski, Betty Sue Flowers",
        "Description": "",
        "Category": "",
        "Publisher": "Society for Organizational Learning",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Unconquerable World: Power, Nonviolence, and the Will of the People",
        "Authors": "By Schell, Jonathan",
        "Description": "A visionary work that explores the limits of violence and charts an unexpectedly hopeful course toward a nonviolent futureAt times of global crisis, Jonathan Schell’s writings have presented influential alternatives to conventional, dead-end thinking.  His classic bestseller, The Fate of the Earth, was hailed by The New York Times as “an event of profound historical moment.” Now as the world stands once more on the brink of upheaval, Schell reenters the fray with a lucid, impassioned, and provocative book that points the way out of the unparalleled devastation of the twentieth century toward another, more peaceful path.Tracing the relentless expansion of violence to its culmination in nuclear stalemate, Schell uncovers a simultaneous but little-noted history of nonviolent action at every level of political life. His historical journey turns up seeds of nonviolence even in the bloody revolutions of America, France, and Russia, as well as in the people’s wars of China and Vietnam. And his investigations into the great nonviolent events of modern times—from Gandhi’s independence movement in India to the explosion of civic activity that brought about the surprising collapse of the Soviet Union—suggest foundations of an entirely new kind on which to construct an enduring peace.As Schell makes clear, all-out war, with its risk of human extinction, must cease to play the role of final arbiter. The Unconquerable World is a bold book of global significance; far from being utopian, it offers the only realistic hope of safety.",
        "Category": " Social Science , General",
        "Publisher": "Metropolitan Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "No Witnesses",
        "Authors": "By Pearson, Ridley",
        "Description": "Seattle detective Lou Boldt draws on the most sophisticated forensic and psychological tools of police investigation to search for the insanely clever killer responsible for a series of poisonings targeting seemingly random victims throughout the city",
        "Category": "",
        "Publisher": "Island Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Teaching Children to Care: Management in the Responsive Classroom",
        "Authors": "By Charney, Ruth",
        "Description": "",
        "Category": "",
        "Publisher": "Center for Responsive Schools, Inc.",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Crisis: The President, the Prophet, and the Shah-1979 and the Coming of Militant Islam",
        "Authors": "By Harris, David",
        "Description": "A thrilling, page-turning account, drawing on new never-before-reported information, of one of the most dramatic and important episodes in recent history: the 444-day Iran Hostage Crisis.On November 4, 1979, Iranian students seized the American embassy in Tehran and took hostage some five dozen Americans. Those Americans would remain hostage for over one year. This is the story of how, in a heretofore unimaginable sequence of events, a seemingly ragtag mob of students inspired by a barely known Muslim cleric named Khomeini eventually undid an American president.It is a story that spans a century, full of famous characters--like Carter, Khomeini, and the Shah--and those who worked in the shadows. Cross-cutting between Washington, Tehran, Paris, and training centers for the doomed Desert One rescue mission, THE CRISIS is a work of history that reads like a thriller. Full of never-before-reported details, and drawing for the first time on comprehensive interviews with the Iranians involved, as well as fresh discussions with the central American players, this book is David Harriss masterpiece--what hes been building up to for decades.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Milestones of Manned Flight: The Ages of Flight from the Wright Brothers to Stealth Technology",
        "Authors": "By Spick, Mike",
        "Description": "Documenting the history of flight in an informative text with many color photographs, more than forty events are highlighted--from the Wright brothers to the Stealth fighter--including many \"firsts\" marking significant progress in the first ninety years of aeronautical history.",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Road Biking™ Washington, D.C. (Road Biking Series)",
        "Authors": "By Leccese, Michael and Pemberton, Rolf",
        "Description": "This completely revised, redesigned, and updated edition of Short Bike Rides Washington, D.C. presents over 30 great rides in and around the nation's capital.  Includes maps and detailed route descriptions for each ride.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Falcon Guides",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Around the Potomac;: Verses about places and people I love,",
        "Authors": "By Dickman, William J",
        "Description": "",
        "Category": "",
        "Publisher": "Printed by Newell-Cole Co",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Tool of the Trade",
        "Authors": "By Haldeman, Joe",
        "Description": "When a routine CIA investigation reveals that Nicholas Foley is a Soviet-agent, the Boston psychology professor learns that an electronic device has the power to influence the history of the world",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Lifeline",
        "Authors": "By Anderson, Kevin J. and Beason, Doug",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Sealed with a Kiss",
        "Authors": "By Morsi, Pamela",
        "Description": "From the first moment she met her new Texas neighbor, Prudence Belmont was in love. When she was old enough for marriage Gidry Chavis promptly presented her with an engagement ring, and all her dreams seemed to have come true. But the hellraising Gidry disappeared before the wedding, leaving only a brief note in explanation.My dear Miss Prudence, I have determined that it is best that we do not wed. Please forgive me and recall me with fondness.Now Chavistown's notorious favorite son is back, wiser, remorseful, sunbrowned and manly. Everyone in town has accepted his transformation to a hardworking town leader--all except Pru. After all, only a man with wicked thoughts could believe that she, the president of the Ladies' Rose and Garden Society, would mail out racy postcards, and only a cad would demand bribes of kisses to keep quiet. If he thinks he can win her love again, he's wrong. Or is he?My only lover, I am ready to fulfill your every desire, if you will agree to grant my dearest wish...Yours soon to be...Sealed with a Kiss",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Unbidden Truth (A Barbara Holloway Novel)",
        "Authors": "By Wilhelm, Kate",
        "Description": "When music professor Louise Braniff offers Barbara Holloway a large retainer to defend a young woman accused of murder, Barbara cannot even begin to anticipate the bizarre case awaiting her, or what the verdict relies upon. Reprint.",
        "Category": " Fiction , Legal",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Michelin the Green Guide Spain: Balearic and Canary Islands",
        "Authors": "By Michelin Travel Publications",
        "Description": "",
        "Category": "",
        "Publisher": "Michelin Travel Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Deep Lie",
        "Authors": "By Woods, Stuart",
        "Description": "Brilliant CIA analyst Katharine Rule fights to force her superiors and her government to act against a Soviet plot involving vanished KGB general Majorov and a military base hidden on the coast of Latvia",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Nectar in a Sieve (Signet Classics)",
        "Authors": "By Markandaya, Kamala. and Ganesan, Indira (INT)",
        "Description": "Named Notable Book of 1955 by the American Library Association, this is the very moving story of a peasant woman in a primitive village in India whose whole life was a gallant and persistent battle to care for those she loved.  \"Comparable in many ways to Cry, the Beloved Country...if anything...better.\" (Saturday Evening Post)",
        "Category": " Fiction , Classics",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Hearts in the Highlands",
        "Authors": "By Cooper, Lynna",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1980"
        }
    },
    {
        "Title": "Anackire (Daw science fiction)",
        "Authors": "By Tanith Lee",
        "Description": "",
        "Category": "",
        "Publisher": "DAW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Beachhead Planet",
        "Authors": "By Robert Moore Williams",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Sister Wendy's American Collection",
        "Authors": "By Beckett, Wendy and Toby Eady Associates (EDT)",
        "Description": "Sister Wendy Beckett has been dubbed a \"pop star\" by the New York Times and \"a phenomenon\" by the Washington Post. She is certainly one of the world's best-known and best-loved art critics, familiar to millions from her wildly popular art series on PBS.In Sister Wendy's American Collection, she visits six of America's most prestigious museums: the Metropolitan Museum of Art (New York City), the Museum of Fine Arts (Boston, Massachusetts), the Art Institute of Chicago, the Cleveland Museum of Art, the Kimbell Art Museum (Fort Worth, Texas), and the Los Angeles County Museum of Art. In each, Sister Wendy chooses a wide variety of artpaintings, sculpture, porcelain figures-and draws attention to the small details of the work, revealing hidden meanings and symbolism. She relates the background of the artist and explains the techniques and the histories behind each work in a straightforward language that speaks to all with humor and insight.More than 250 full-color illustrations illuminate Sister Wendy's text. Sister Wendy's American Collection is a wonderful tour of six great American museums -- it is also the equivalent of taking a personal tour with Sister Wendy, studying and enjoying her favorite pieces of art, chosen from across the whole breadth of history to the present. It is a fascinating journey, one that can be taken again and again. Sister Wendy's American Collection is soon to be a PBS miniseries.",
        "Category": " Art , American , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "7.19",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Best Loved Songs of the American People",
        "Authors": "By Denes Agay",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Baby Faces",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "Perfect for early childhood development, happy babies, laughing babies, silly babies and crying babies are found on the pages of this padded board book.Look at all the sweet baby faces showing that they are happy, sad, sleepy, and more. Your baby can make the same expressions to help recognize common expressions. This durable little book is sure to pique baby's interest.With bright colorful photos and simple word labels that capture the expressions and moods of babies throughout their busy days, Baby Faces will mesmerize little ones when they see other children just like them.",
        "Category": " Juvenile Nonfiction , Concepts , Colors",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Fifties: A Women's Oral History",
        "Authors": "By Harvey, Brett",
        "Description": "Many think of America in the 1950s as our last happy decade, with every family just like the one in \"Leave It to Beaver,\" and every woman living just like Donna Reed. In fact, it was a time of great fear, especially for women, and especially the fear of not fitting in. As a woman you were odd if you graduated from college without being married; if you were married, you were odd if you didn't immediately have children; if you had children, you were odd if you also wanted to work. Before the feminist movement, women were treated as second-class citizens whose roles were utterly restricted, and The Fifties: A Women's Oral History fully explores those roles, the women who lived them, and the women who broke the molds.Filled with moving and revealing stories from a broad canvas of women speaking in their own words, The Fifties tells what it really was like to be a \"good girl,\" to get an illegal abortion, to try against all odds for an advanced academic degree, to raise children and keep a home in the suburbs, to follow your dreams of having a profession, and even to live, politically and sexually, far from the mainstream of American life. These are stories of women's lives - some very tragic, some remarkably heroic - and they reveal to us all over again an era we thought we knew so well.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Baseball 1 2 3",
        "Authors": "By Buckley, James",
        "Description": "Essentials for the youngest fans: a baseball, a baseball cap, and DK's Major League Baseball board books. It's no surprise that for millions of American children, \"ball\" is their first word and a baseball cap is their first headgear. Kids and baseball go hand in hand. There's no better way to introduce America's favorite pastime to little ones than with DK's Major League Baseball Board Books. Kids' natural interest in baseball combines with their curiosity about counting and learning the ABCs in these grand-slam hits for the baby and toddler set. This adorable book uses baseballs, gloves, caps, and some of today's most popular stars to help kids learn to count. From 1 Baseball to 4 Catchers to 9 Pennants, future sluggers and pitchers count numbers with the help of stars like Mark McGwire, Sammy Sosa, Derek Jeter, Pedro Martinez, and many others.",
        "Category": " Juvenile Nonfiction , Mathematics , General",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "No Place Like Home (Remnants, Book 9)",
        "Authors": "By Applegate, Katherine",
        "Description": "The best-selling author of ANIMORPHS and EVERWORLD presents a fresh, exciting, and gritty new science-fiction series that combines a little 2001, a little Armageddon, and a whole lot of action!The Remnants are on a mission to promote peace but the Blue Meanies have created a horrifying  weapon, and the peacemakers are in grave danger. Yago's plan to rule has finally taken form, and promises death and destruction to everyone in the Zone.  How does this all tie into the disturbing appearance of a stranger?  Who is he?  Can he be trusted?  And what about Violet? The secret she hides may be a clue to the 'evolution' of the human race. Secrets will be revealed as devious plots unfold.  The future of the Remnants hangs in the balance .  Can Billy save them...can Billy save himself?",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "11.2",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Guide to Effective Military Writing: 2nd Edition",
        "Authors": "By McIntosh, William A",
        "Description": "",
        "Category": "",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Silhouette In Scarlet: A Vicky Bliss Mystery",
        "Authors": "By Elizabeth Peters",
        "Description": "",
        "Category": "",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Hands on Dyeing",
        "Authors": "By Blumenthal, Betsy and Kreider, Kathryn",
        "Description": "Introduces basic dyeing technique, tells how to select dyes and mix colors, and suggests a variety of projects",
        "Category": " Crafts & Hobbies , Dye",
        "Publisher": "Interweave Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "My First Halloween Board Book",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "Labelled illustrations of costumed children, holiday treats and decorations, animals, and carved pumpkins supply the words for clothing, foods, emotions, and other subjects seen around Halloween.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Halloween",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Feelings : A Baby and Blue Book",
        "Authors": "By Barrett, John E. (PHT), Miglis, Jenny, and Pontillo, Jenine (ILT)",
        "Description": "Making faces! Help your baby discover emotions by making different \"feeling faces\" and sounds. Then try this in front of a mirror.Baby giggles! Wave your hands in the air, spin around...making your baby laugh is good for their cognitive and physical development.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Schnauzers (Complete Pet Owner's Manual)",
        "Authors": "By Frye, Fredric L.",
        "Description": "Traces the history of the breed, discusses a schnauzer's care requirements, and includes information on training and common health concerns",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Buckingham Palace Official Guidebook.",
        "Authors": "By john-martin-robinson",
        "Description": "",
        "Category": "",
        "Publisher": "Royal Collection Enterprises Ltd., London",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Heidi (Great Illustrated Classics)",
        "Authors": "By Spyri, Johanna",
        "Description": "",
        "Category": " Juvenile Nonfiction , Antiques & Collectibles",
        "Publisher": "Abdo Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Betty Crocker's Great Main Dishes Without Meat",
        "Authors": "By Crocker, Betty",
        "Description": "Includes more than 125 recipes for soups, stews, casseroles, skillet dishes, quiches, salads, and pizzas all prepared without meat",
        "Category": " Cooking , Reference",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Sixteen: Short Stories by Outstanding Writers for Young Adults",
        "Authors": "By Gallo, Donald R. (EDT)",
        "Description": "Here are sixteen representative stories for the  eighties, written especially for this collection by  today's best-known writers for teenagers. Their  impressions radiate through an emotional prism of  hope and hate, love and death, despair and joy, in a  diverse yet strikingly unified collection.",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "Little Teddy Left Behind",
        "Authors": "By Mangan, Anne and Moss, Joanne (ILT)",
        "Description": "Left behind when his young owners move, a teddy bear has exciting adventures with a variety of people and animals.",
        "Category": " Juvenile Fiction , Toys, Dolls, Puppets",
        "Publisher": "Little Tiger Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "With Christ in the School of Prayer",
        "Authors": "By Murray, Andrew",
        "Description": "To Andrew Murray, prayer was more than a means of maintaining the Christian life. He believed prayer was the highest work entrusted to man by God, the root and strength of all our other work in Him. It is only through prayer that the believer taps into the Source of highest power. Murray discovered that it is Christ who teaches us to pray. The more we abide in Him and grow into His likeness, the more our lives will become like His. Enter into Jesus’ “school of prayer” and you, too, will…Pray with more power and understandingTap into specific prayers guided by the Holy SpiritSee your prayers answered dailyDiscover how prayer works with fastingLearn to pray with greater boldnessBecome a powerful intercessor for others It was Murray’s heartfelt desire that all Christians would enroll in a personal session With Christ in the School of Prayer.",
        "Category": " Religion , Christian Life , Prayer",
        "Publisher": "Whitaker House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "The Lion, the Witch and the Wardrobe: The Quest for Aslan (The Chronicles of Narnia)",
        "Authors": "By Jones, Jasmine",
        "Description": "Narnia has been waiting for the Pevensie children. According to the prophecy, Peter, Susan, Edmund and Lucy are destined to find Aslan, the Great Lion, and help rid Narnia of the White Witch. On their journey through this magical world, they meet many enemies but also many friends. Join the Pevensies on their dangerous quest through a land where Fauns drink tea, animals talk and trees come to life.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Eve and Her Sisters: Women of the Old Testament",
        "Authors": "By McDonough, Yona Zeldis and Zeldis, Malcah (ILT)",
        "Description": "Presents brief stories of fourteen women who are mentioned in the Old Testament, including Eve, Ruth, Hagar, and Deborah.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Greenwillow",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Mysterious Dude (Timber Trail Riders)",
        "Authors": "By Murray, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman Pub. Co",
        "Price Starting With ($)": "21.84",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "The Lost Princess",
        "Authors": "By MacDonald, George",
        "Description": "",
        "Category": " Fiction , Fairy Tales, Folk Tales, Legends & Mythology",
        "Publisher": "Chariot Family Pub",
        "Price Starting With ($)": "7.18",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "Sepulchre",
        "Authors": "By Herbert, James",
        "Description": "At a cloistered English estate, L'ain Halloran protects a multinational company's employees--including a man with double-edged psychic abilities to uncover treasures and manipulate minds--from an unspeakably violent evil",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Baja to Patagonia: Latin American Adventures",
        "Authors": "By Rice, Larry",
        "Description": "Naturalist/adventure writer Larry Rice tells of kayaking, canoeing, and backpacking the wilderness areas of Central and South America.",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Fulcrum Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Payne at Pinehurst",
        "Authors": "By Chastain, Bill and Doe, Jane (FRW)",
        "Description": "\"A fresh and concise look at Payne Stewart's victory at the 1999 U.S. Open.\"---Golf DigestIt has been called the greatest U.S. Open in the Open's over one hundred-year history.Veteran sports journalist, Bill Chastain, crafts the dramatic story of Payne Stewart's 1999 U.S. Open victory by combining extensive research with interviews of those who made it unique. Payne at Pinehurst shows how Stewart dealt with his stunning U.S. Open defeat in 1998 and planned victory for the championship that meant so much to him.            Stewart's conquest of Pinehurst No. 2, while fending off Phil Mickelson, Tiger Woods, David Duval, and Vijay Singh in an epic battle where every swing held significance, is the stuff of which golf legends are made. From compelling action by the best golfers in the world to the tournament's dramatic conclusion, Payne at Pinehurst shows readers why the 1999 U.S. Open is regarded as the best U.S. Open ever played.\"Exciting golf history combined with the poignant personal story of Stewart's life and death.\"---Booklist\"You don't have to be from North Carolina to understand what happened at the 1999 U.S. Open, and how it felt; it was an Open brushed by an angel's wing, an Open that in retrospect seems almost fictional.... That Sunday in Pinehurst, when it all happened there in the mist, is one of the most memorable days in the history of the U.S. Open. Everything about it is more profound now, and yet somehow unreal.\"---Ron Green Sr., PGATOUR.com columnist and author of Shouting at Amen Corner\"While the 1999 U.S. Open may not have been the greatest Open ever, through Chastain's effort it now makes the short list.\"---bookreporter.com\"Chastain's book is a thoughtful look at one of America's favorite golfers and at a tournament that raised his status to near legend.\"---News & Record (Greensboro, North Carolina)",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "SMP Paperback",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Day Trips from Baltimore, 4th: Getaways Less Than Two Hours Away (Day Trips Series)",
        "Authors": "By Walcoff, Gwyn, Willis, Bob, Stein, Shifra, and Willis, Gwyn",
        "Description": "Our Day Trips series takes you to no less than fifty other cities and towns, all within two hours of the city of origin with attractions ranging from museums to arboretums, from theme parks to breweries. It also includes all pertinant information to dining, shopping, and even lodging, should you decide to really play hooky! The index includes listings of parks, forests, celebrations, and festivals",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Animal Daddies and My Daddy (Little Golden Books)",
        "Authors": "By Barbara Shook Hazen",
        "Description": "",
        "Category": "",
        "Publisher": "Littlehampton Book Services Ltd",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Dinosaurs (Travel Guide)",
        "Authors": "By Lindsay, William and Clark, Neil",
        "Description": "It's a weird world out there... dazzle your friends with wacky facts and more from this mega new series. Did you know... A charging Triceratops could gore an enemy to death with its three terrifying horns. Dinosaur literally means \"terrible lizard.\" The heart of a Sauropod dinosaur would probably have weighed a staggering one ton. A full-color, fun, and informative series, Secret Worlds offers a chance to get your teeth deep into a wide range of fascinating subjects from nature, history, and science. Every title has: Easy-to-read narrative text written by a specialist who combines expert knowledge with an entertaining and fresh style. Superb color photography that entices the reader into the subject world with close-up views and dramatic shots. Weird World feature boxes that reveal a wealth of wacky facts. Tried-and-tested websites to check out the latest info. A mega reference section with even more facts and figures for the enthusiast. Suitable for children aged ten and up -- as well as every other family member who is curious about the subject.",
        "Category": " Juvenile Nonfiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Silly Sally: Lap-Sized Board Book",
        "Authors": "By Wood, Audrey",
        "Description": "Dance a jig with a silly pig. Play leapfrog with a silly dog. And that's just the beginning of all the fun! Come along and join Silly Sally and her outrageous friends as they parade into town in a most unusual way. \"Exploding with whimsy, humor, and zest. . . . Be prepared to read this one a thousand times!\"--Booklist (starred review)",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Divine Justice (Camel Club Series)",
        "Authors": "By Baldacci, David",
        "Description": "With a master spy and the U. S. government after him, former CIA assassin Oliver Stone is America's most wanted man-but escaping D.C. won't protect him from a lethal world of political corruption in this #1 New York Times bestselling thriller.Known by his alias, \"Oliver Stone,\" John Carr is the most wanted man in America. With two pulls of the trigger, the men who destroyed Stone's life and kept him in the shadows were finally silenced.But his freedom comes at a steep price: The assassinations he carried out prompt the highest levels of the U.S. government to unleash a massive manhunt. Yet behind the scenes, master spy Macklin Hayes is playing a very personal game of cat and mouse. He, more than anyone else, wants John Carr dead. With their friend and unofficial leader in hiding, the members of the Camel Club risk everything to save him. As the hunters close in, Stone's flight from the demons of his past will take him from the power corridors of Washington, D.C., to the coal-mining town of Divine, Virginia--and into a world every bit as bloody and lethal as the one he left behind.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Spies And Special Forces!",
        "Authors": "By Eldridge, Jim",
        "Description": "An engrossing look at the brave actions of history's 'secret soldiers': spies, assassins, double agents, and specially trained covert forces.Their names and faces are unknown, their stories are never spoken of, but their behind-the-scenes actions have turned the tide of history countless times.  Spies, traitors, secret forces, assassins -- their actions are shrouded in darkness and secrecy, but now SPIES AND SECRET FORCES! brings their amazing stories to light.  With stunning black and white illustrations and gripping information, this book will thrill young readers with tale after tale, from Elizabethan intrigue to World War II Nazi-resistance efforts, from Ancient Roman invasions to guerilla fighters in the Civil War.",
        "Category": " Juvenile Nonfiction , History , General",
        "Publisher": "Chicken House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Winnie the Pooh (Dma Learntodraw Books)",
        "Authors": "By",
        "Description": "'Disney fans will find Learn to Draw Winnie the Pooh the perfect introduction to the fascinating world of drawing and cartooning! Beginners and experienced artists alike will appreciate this fun instructional guide that shows them how to draw the beloved characters from the Hundred Acre Wood. Step-by-step illustrations guide aspiring artists from simple sketches to full-color renderings. And with each new step always shown in blue, the instructions are easy enough to follow that even kids will be drawing Winnie the Pooh, Tigger, Eeyore, Christopher Robin, and other classic favorites in no time at all! Learning to draw Disney’s perennial favorite TV and film characters has never been so fun and easy!",
        "Category": " Young Adult Nonfiction , Art , Drawing",
        "Publisher": "Walter Foster Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Rags' New Friend and Other Tales (Four Little Friends)",
        "Authors": "By Fujikawa, Gyo",
        "Description": "",
        "Category": "",
        "Publisher": "Honey Bear Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "The Living Trust",
        "Authors": "By Abts, Henry W., III",
        "Description": "A revised version of this popular guide to avoiding probate offers up-to-date information that reflects 1996 federal tax codes and the latest developments in the legal system, as well as new facts about individual retirement accounts and catastrophic illness. Original.",
        "Category": " Business & Economics , Taxation , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Seventeenth Summer",
        "Authors": "By Daly, Maureen",
        "Description": "What better time than summer for a little romance? Except for Angie, who doesn't really date. Didn't date, that is -- until she saw Jack Duluth's cerw cut peeking out over a booth in McKnight's drugstore one night.He looked over at me, smiled, and then sat down again.Thus starts a summer Angie will never forget -- one full of spine chills, total bliss, heartache, and confusion...all the feelling that spell love.",
        "Category": "",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "First Daughter: A McClure/Carson Novel (Jack McClure/Alli Carson Novels, 1)",
        "Authors": "By Lustbader, Eric",
        "Description": "Sometimes the weakness we fear most can become our greatest strength . . . Jack McClure has had a troubled life.  His dyslexia always made him feel like an outsider.  He escaped from an abusive home as a teenager and lived by his wits on the streets of Washington D.C.  It wasn't until he realized that dyslexia gave him the ability to see the world in unique ways that he found success, using this newfound strength to become a top ATF agent.When a terrible accident takes the life of his only daughter, Emma, and his marriage falls apart, Jack blames himself, numbing the pain by submerging himself in work.  Then he receives a call from his old friend Edward Carson.  Carson is just weeks from taking the reins as President of the United States when his daughter, Alli, is kidnapped.  Because Emma McClure was once Alli's best friend, Carson turns to Jack, the one man he can trust to go to any lengths to find his daughter and bring her home safely.The search for Alli leads Jack on a road toward reconciliation . . . and into the path of a dangerous and calculating man.  Someone whose actions are as cold as they are brilliant.  Whose power and reach are seemingly infinite.Faith, redemption, and political intrigue play off one another as McClure uses his unique abilities to journey into the twisted mind of a stone cold genius who is constantly one step ahead of him.  Jack will soon discover that this man has affected his life and his country in more ways than he could ever imagine.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Crafts for Thanksgiving (Holiday Crafts for Kids)",
        "Authors": "By Ross, Kathy and Holm, Sharon Lane (ILT)",
        "Description": "A collection of twenty craft projects, from a kitchen magnet made out of corn kernels to a pumpkin centerpiece for the Thanksgiving meal",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "Millbrook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Southern Gates of Arabia: A Journey in the Hadhramaut (Modern Library (Paperback))",
        "Authors": "By Stark, Freya and Geniesse, Jane Fletcher (INT)",
        "Description": "In 1934, famed British traveler Freya Stark sailed down the Red Sea, alighting in Aden, located at the tip of the Arabian peninsula. From this backwater outpost, Stark set forth on what was to be her most unforgettable adventure: Following the ancient frankincense routes of the Hadhramaut Valley, the most fertile in Arabia, she sought to be the first Westerner to locate and document the lost city of Shabwa. Chronicling her journey through the towns and encampments of the Hadhramaut, The Southern Gates of Arabia is a tale alive with sheikhs and sultans, tragedy and triumph. Although the claim to discovering Shabwa would not ultimately be Stark's, The Southern Gates of Arabia, a bestseller upon its original publication, remains a classic in the literature of travel. This edition includes a new Introduction by Jane Fletcher Geniesse, Stark's biographer.",
        "Category": " History , Middle East , General",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "After Midnight (Lords of Midnight)",
        "Authors": "By Medeiros, Teresa",
        "Description": "\"Our sister is marrying a vampire.\"When the ever practical Caroline Cabot first hears those words from the lips of her fanciful youngest sister, she accuses Portia of having a wild imagination. But when she discovers their sister Vivienne is actually being courted by Adrian Kane, the mysterious viscount rumored to be a vampire, she decides to accept his invitation to a midnight supper and do some sleuthing of her own.  To both her delight and her dismay, she soon finds herself falling under Kane's bewitching spell.   After all, what's a proper young lady to do when her sister's suitor arouses more than just her suspicions?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Rotary Magic: Easy Techniques to Instantly Improve Every Quilt You Make",
        "Authors": "By Johnson-Srebro, Nancy",
        "Description": "Offers tips and techniques for rotary cutting, accurate piecing, pressing, and finishing and includes step-by-step directions for twelve projects",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.92",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Ann Benson's Beadwear: Making Beaded Accessories and Adornments",
        "Authors": "By Benson, Ann",
        "Description": "",
        "Category": " Crafts & Hobbies , Jewelry",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Quest",
        "Authors": "By Stone, Lyn",
        "Description": "The Quest by Lyn Stone released on Nov 23, 2001 is available now for purchase.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Turret Room",
        "Authors": "By Armstrong, Charlotte",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Publications",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Big Words for Little People",
        "Authors": "By Curtis, Jamie Lee and Cornell, Laura (ILT)",
        "Description": "“A gracefully appropriate addition to the duo’s superb collection.” —KirkusThe eighth hilarious picture book by the #1 New York Times bestselling team of Jamie Lee Curtis and Laura Cornell helps little people communicate in a big person's world. With grown-up words like cooperate, respect, patience, and considerate, a large, boisterous family celebrates the power of language and discovers that words—big or little—are the bridge that connects us all.I know some Big Words.I'll teach them to you. Although you are small,you can use Big Words too.Big Words aren't scary.They're big fun to learn.I was taught onceand now it's your turn.",
        "Category": " Juvenile Fiction , Concepts , Words",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Teaching That Makes a Difference",
        "Authors": "By Held, Ronald G.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Gospel Pub. House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Arcturus Landing",
        "Authors": "By Gordon R. Dickson",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "CliffsNotes The Red Badge of Courage",
        "Authors": "By Cliffs Notes, Inc.",
        "Description": "",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1964"
        }
    },
    {
        "Title": "The Starfleet Academy Entrance Exam: Tantalizing Trivia from Classic Star Trek to Star Trek: Voyager",
        "Authors": "By Adler, Bill and Robin, Peggy",
        "Description": "Trekkies and other science fiction fans will relish a collection of examinations, drawn from the original Star Trek and its television and movie spinoffs, that offer rigorous and challenging tests of their knowledge of the Star Trek universe. Original.",
        "Category": "",
        "Publisher": "Citadel Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "The American Prophecies: Ancient Scriptures Reveal Our Nation's Future",
        "Authors": "By Evans, Mike",
        "Description": "Discusses ancient biblical prophecies that have significance in modern politics, offering insight into the rest of the world's animosity toward America while arguing that the U.S. must protect itself by remaining steadfast to harmonious Judeo-Christian principles, democratic foundations, and moral conduct. 100,000 first printing.",
        "Category": " Religion , Biblical Studies , Prophecy",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "If I Really Wanted to Lose Weight, I Would (If I Really Wanted Too...)",
        "Authors": "By Honor Books",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Natural Selection: A Novel",
        "Authors": "By Freedman, Dave",
        "Description": "A shocking biological discovery. A previously unknown predatory species. Evolving just like the dinosaurs. Now. Today. Being forced out of its world and into man's for a violent first encounter. Weaving science and thriller in a way not seen since Jurassic Park, Natural Selection introduces a phenomenally dangerous new species that is rapidly adapting in a way never before seen A mystery. A chase. A vast expansive puzzle. A team of marine scientists is on the verge of making the most stunning discovery in the history of man. In their quest for answers, they engage a host of fascinating characters. The world's premier neurology expert. A specialist on animal teeth. Flight simulation wizards, evolution historians, deep sea geologists, and so many more. Along the way, the team of six men and women experience love, friendship, loyalty and betrayal. Together, they set off to exotic locales. Literally to the bottom of the ocean. To a vast and mysterious redwood forest. To an unknown complex of massive caves. When people start dying, the stakes are upped even further. Then the real hunt begins ... Loaded with astonishing action sequences, Natural Selection is that rare breed of thriller, filled with intricately layered research, real three-dimensional characters, and tornado pacing. Dave Freedman lives in Southern California with his wife. He holds a Bachelor of Science degree from Princeton and a master's degree from Harvard. Natural Selection is his first novel.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Declaration of Independence: A Study in the History of Political Ideas",
        "Authors": "By Becker, Carl L.",
        "Description": "The Declaration of IndependenceCarl L. Becker's important study is an analysis of the concepts expressed in the Declaration. Here is a lucid explanation of what the Declaration really is, what views it sets forth, where those views arose, and how they have been accepted or modified by succeeding generations. A book that every American should read.",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1958"
        }
    },
    {
        "Title": "The Witch Doctor: Book III of A Wizard in Rhyme (A Wizard in Rhyme, Book 3)",
        "Authors": "By Stasheff, Christopher",
        "Description": "Saul Bremener didn't have so many friends that he could afford to lose one without a fight. So when Matt Mantrell disappeared from the university one day with not a word to anybody, Saul canvassed students, family, and even the police. Nobody had any leads. Then he climbed through a kitchen window into Matt's apartment, where he found festoons of spider webs and a scrap of parchment covered in runes - magical runes...Like Matt before him, Saul was swept away into a world of magic - and into a maelstrom of desperate danger. For in this world where poetry held the power of enchantment, Saul's love of verse made him a puissant wizard. And his search for his missing friend soon earned him a fearsome foe: a false monarch without peer in the realms of wickedness and corruption.Queen Suettay was a mistress of magic in her own right. She had entire armies at her beck and call, steeped in evil and ready to obey her every command. And Suettay was determined to break Saul's power - or win his soul for her malefic master...Saul rallied troops of his own, of course: Gruesome the troll, young squire Gilbert, an overworked guardian angel, a hand of the wee folk, and the beautiful - if insubstantial - Angelique. But it would take much more than a hardy little band to overthrow Suettay's reign of terror. Only with the aid of the legendary and mysterious Spider King could Saul spin a web to trap a tyrant...",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Pizza (Williams-Sonoma Kitchen Library)",
        "Authors": "By Williams, Chuck and De' Medici Stucchi, Lorenza",
        "Description": "Bake pizzas and calzone in your own home that rival those from the best Italian restaurants. It's surprisingly easy to make Spinach and Goat Cheese Pizza or Sausage Calzone. Try Four-Cheese Pizza, Asparagus and Ham Pizza, or Spring Vegetable Calzone. End a meal with a delicious Fresh Fruit Pizza or Orange and Grand Marnier Pizza. The range of possibilities is astonishing.Filled with kitchen-tested recipes from leading Italian cooking authority Lorenza de'Medici - each one shown in a glorious full-color photograph - this beautiful, practical book makes pizza-baking at home a delightful reality. All the basics are covered - from mixing doughs to shaping, topping and baking both pizzas and calzone. And an illustrated glossary provides you with a quick, convenient reference to essential terms.",
        "Category": " Cooking , Courses & Dishes , Pizza",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Dog Tricks: Step by Step",
        "Authors": "By Zeigenfuse, Mary Ann Rombold and Walker, Jan",
        "Description": "Written by the Trainer of President and Barbara Bush's dog (and author in her own right), Millie! All owners will find fun things to do with the family pet in this all-new book based on the sound training philosophy of Mary Ann Rombold Zeigenfuse, Millie's trainer. Without rules and regimentation, the book's format gives a built-in success formula by allowing owners to teach those tricks best suited to their pet. Owners can devise an individual Personality Profile for each dog, which allows everyone to have a choice of tricks. There are practical tricks to make the dog useful at home; simple tricks, to build a rapport between dog and owner; and cute tricks, great just for showing off. Full color and extraordinary original artwork throughout complement the easy-to-follow, step-by-step instruction, whether you want to prepare your dog for show biz or simply want to have some fun.",
        "Category": " Pets , Dogs , General",
        "Publisher": "*Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Book Of Miracles: Extraordinary Events in Ordinary Lives",
        "Authors": "By Day, Malcolm",
        "Description": "Arranged chronologically from the years of the ministry of Christ to the present day, this inspiring volume reviews unusual events and visions that have been extensively documented but which defy scientific explanation. Dozens of stories are told, each in the context of its time, with evocative illustrations to inspire today's readers. Nature miracles recounted include Christ walking on the water and his feeding of five thousand disciples. Healing miracles include Christ's healing of the ten lepers and his raising of Lazarus from the dead. Later miracles include the dramatic conversion of Roman Emperor Constantine to Christianity in AD 312, and the Black Madonna of Czestochowa, Poland, which for centuries has protected its monastery from sieges by outsiders. Here too are accounts of miraculous apparitions of the Virgin Mary by St. James the Apostle, Bernadette of Lourdes, and the three children at Fatima Portugal. Accounts of other miracles involve the Shroud of Turin, the works of St. Francis of Assisi, and the vision of the Italian monk, Padre Pio, who reportedly protected his church from bombing during World War II. This fascinating and inspiring book is beautifully produced, and includes more than 130 color illustrations.",
        "Category": " Religion , Inspirational",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Monet in the '90s",
        "Authors": "By Paul Hayes Tucker",
        "Description": "",
        "Category": "",
        "Publisher": "Museum of Fine Arts / Yale University Press",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Sex God: Exploring the Endless Connections between Sexuality and Spirituality",
        "Authors": "By Bell, Rob",
        "Description": "Introduction: This is Really about That Chapter One: God Wears Lipstick Chapter Two: Sexy on the Inside Chapter Three: Angels and Animals Chapter Four: Leather, Whips, and Fruit Chapter Five: She Ran into the Girls' Bathroom Chapter Six: Worth Dying For Chapter Seven: Under the Chuppah Chapter Eight: Johnny and June Chapter Nine: Whoopee Forever Epilogue: More Balloons, Please Endnotes/Resources/Discussion",
        "Category": " Health & Fitness , Sexuality",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Mystery of Agatha Christie",
        "Authors": "By Robyns, Gwen",
        "Description": "A new biography of the enigmatic and reclusive mistress of mystery answers the questions occasioned by Agatha Christie's notorious disappearance in 1926",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "Pasta (The Good Cook Techniques & Recipes)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Smart Mouth",
        "Authors": "By McCarthy, Erin",
        "Description": "\"I'll leave as soon as you give me what I want.\" In another time and place, that might have a nice ring to it. But standing in a Chicago hotel room with a cub reporter as obstinate as she is hot, FBI agent Derek Knight knows he has to play it charming. Something like, \"By holding on to that evidence, you're interfering with FBI business, ma'am, and by the way, those long, gorgeous legs of yours would look awfully good wrapped around my.  .  .\" Sure, losing all sense of professionalism may not help his career, but the off-duty perks would be sensational.  .  . \"Yeah, right, you're an FBI agent. And I can bake a cake from scratch.\" Reese Hampton is not giving up the envelope she found in her rental car--the one with the story that could take her from journalistic Siberia straight to the front page. She'll just have to outsmart the certifiably insane Fed with the movie-star good looks. Dodge and weave. Distract and bed. No! Bad hormones, bad! Still, spending time with that unbelievably broad chest up close and personal might just add, um, depth to her story. If only she can let her robe down while keeping her guard up.  .  .",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Simply Scandalous (The Simply Series, Book 2)",
        "Authors": "By Phillips, Carly",
        "Description": "Determined to prove to his father that he is not destined to follow the family tradition of going into politics, assistant D.A. Logan Montgomery decides to have an affair with Catherine Luck, whose family is submerged in scandal, but his clever plan is thwarted by love. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Elske",
        "Authors": "By Voigt, Cynthia",
        "Description": "Two WomenElske, a girl with no future, until her grandmother's sacrifice saves her from certain death.  Beriel, an imperious princess, determined to claim the kingdom that is her birthright. Fate brings them together, both exiles, one servant to the other. To Beriel, the mistress, Elske offers steadfast loyalty and courage -- hard to come by in her dangerous quest to regain the throne she has been denied by treachery. To Elske, the handmaiden, Beriel's proud example provides a perhaps even more precious gift -- the strength to find her true self.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Lasko Interview",
        "Authors": "By Jacobsen, Clay",
        "Description": "",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Broadman & Holman Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Silver Thunder",
        "Authors": "By Hohl, Joan",
        "Description": "Disguising himself as a cowboy to help Jessica Randall's father discover who is rustling their cattle, playboy Duncan Frazer loses his heart to the independent and fiery Jessica--a woman who sets his body and soul on fire. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Classic Crafts and Recipes for the Holidays: Christmas with Martha Stewart Living",
        "Authors": "By Stewart, Martha",
        "Description": "If the words “classic Christmas” make images of Christmas cactus, fruitcake, and roast turkey dance in your head, thenClassic Crafts and Recipes for the Holidays will make all of your yuletide dreams come true.Arranged in ten chapters with such names as “Cranberries,” “Nuts,” “Citrus,” “Leaves,” and “Pinecones,” this festive compendium of holiday ideas and recipes is certain to show you how to make every Christmas one to remember. In “Winter Berries,” berries are used to make wreaths, garlands, and centerpieces. In its own chapter, fruitcake has been reinterpreted so it will never run the risk of being left uneaten. “Leaves” shows how to make keepsake gifts out of embossed leaves and cards, and throughout the book there are clever packaging and wrapping ideas to suit every taste and budget.From now on, when you think of a classic Christmas, you’ll think of Classic Crafts and Recipes for the Holidays.",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Potter Craft",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Big Cheese (Step into Reading, Step 2) (Ratatouille movie tie in)",
        "Authors": "By Disney Storybook Artists (ILT) and Jordan, Apple",
        "Description": "Remy is no ordinary rat. A cuisine of local garbage just won't cut it—he has a taste for the finer foods in life. Can Remy make his dream of becoming a gourmet chef come true? Find out in this fun-filled Step 2 reader that retells Disney / Pixar's latest animated feature film, Ratatouille!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Great Fairy Race (Disney Fairies) (Step into Reading)",
        "Authors": "By Disney Storybook Artists (ILT) and Redbank, Tennant",
        "Description": "GET READY. GET SET. Go! A flash of light signals the start of the Great Fairy Race. The rules are simple: whoever crosses the finish line first, wins.But the fairies can’t use their own wings or legs to do it. Tink pedals one of her contraptions, Lily rides a giant snail, Fawn hops on a frog, Beck cruises on a squirrel, Fira sails on a balloon, and Rani rides Brother Dove. Who will win the Great Fairy Race? Find out in this Step 3 reader, featuring the beloved Disney Fairies.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "You Can Be My Friend (Charlie and Lola)",
        "Authors": "By Child, Lauren",
        "Description": "Lola is excited because she is going to spend the afternoon with Morten, the little brother of Charlie’s best friend. Lola has planned out the entire afternoon with fun and games, but her hopes are dashed when she discovers that Morten is so shy he won’t even speak! Lola tries everything she can think of to get Morten to break out of his shell, but nothing does the trick. How will Lola and Morten have fun?",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Software Project Management: A Unified Framework",
        "Authors": "By Royce, Walker",
        "Description": "",
        "Category": " Computers , Software Development & Engineering , General",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "While Europe Slept: How Radical Islam is Destroying the West from Within",
        "Authors": "By Bawer, Bruce",
        "Description": "The struggle for the soul of Europe today is every bit as dire and consequential as it was in the 1930s. Then, in Weimar, Germany, the center did not hold, and the light of civilization nearly went out. Today, the continent has entered yet another “Weimar moment.” Will Europeans rise to the challenge posed by radical Islam, or will they cave in once again to the extremists?As an American living in Europe since 1998, Bruce Bawer has seen this problem up close. Across the continent—in Amsterdam, Oslo, Copenhagen, Paris, Berlin, Madrid, and Stockholm—he encountered large, rapidly expanding Muslim enclaves in which women were oppressed and abused, homosexuals persecuted and killed, “infidels” threatened and vilified, Jews demonized and attacked, barbaric traditions (such as honor killing and forced marriage) widely practiced, and freedom of speech and religion firmly repudiated.  The European political and media establishment turned a blind eye to all this, selling out women, Jews, gays, and democratic principles generally—even criminalizing free speech—in order to pacify the radical Islamists and preserve the illusion of multicultural harmony. The few heroic figures who dared to criticize Muslim extremists and speak up for true liberal values were systematically slandered as fascist bigots. Witnessing the disgraceful reaction of Europe’s elites to 9/11, to the terrorist attacks on Madrid, Beslan, and London, and to the wars in Afghanistan and Iraq, Bawer concluded that Europe was heading inexorably down a path to cultural suicide.Europe's Muslim communities are powder kegs, brimming with an alienation born of the immigrants’ deep antagonism toward an infidel society that rejects them and compounded by misguided immigration policies that enforce their segregation and empower the extremists in their midst. The mounting crisis produced by these deeply perverse and irresponsible policies finally burst onto our television screens in October 2005, as Paris and other European cities erupted in flames.WHILE EUROPE SLEPT is the story of one American’s experience in Europe before and after 9/11, and of his many arguments with Europeans about the dangers of militant Islam and America’s role in combating it.  This brave and invaluable book—with its riveting combination of eye-opening reportage and blunt, incisive analysis—is essential reading for anyone concerned about the fate of Europe and what it portends for the United States.",
        "Category": " Religion , Islam , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The kids' fun-filled search & find geography book / by Anthony Tallarico",
        "Authors": "By Tallarico, Tony",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Top Wing (Matt Christopher Sports Classics)",
        "Authors": "By Christopher, Matt",
        "Description": "When his father is accused of causing a fire through faulty wiring, Dana tries to get to the bottom of the allegations. But when he discovers the shocking truth, he must decide whether to keep quiet or ruin a reputation by going public.",
        "Category": " Juvenile Fiction , Sports & Recreation , General",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    }
]