[
    {
        "Title": "All about Eve: The Complete Guide to Women's Health and Well-Being",
        "Authors": "By Semler, Tracy Chutorian",
        "Description": "A guide to getting well and staying well, by a medical news producer for CBS News This Morning, is written to help women protect themselves from illness, get well faster, and understand their bodies. Simultaneous. $45,000 ad/promo. Tour.",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Search for Meaning",
        "Authors": "By Naylor, Thomas H., Willimon, William H., and Naylor, Magdalena R.",
        "Description": "Close your eyes. Imagine that you are a European on a voyage of discovery during the time before Columbus. Your ship is destroyed by a violent storm. You are the lone survivor. Miraculously, the piece of ship's debris washes ashore onto an uninhabited tropical island.The lush island is full of fruits, nuts, and berries; an abundance of wildlife; and plenty of fresh water. There are caves to protect you from storms and animals. Physical survival poses no problem.There is only one hitch. Not only are you the island's only inhabitant, but no one knows you are there. You are presumed to have been lost at sea. There is no reason whatsoever to assume that another ship will ever pass your way before you die, since Europeans have not yet discovered America and such voyages are rare. You will never see another human being for the rest of your life.What would you do? How would you survive emotionally? What would make your life worthwhile? Is meaning possible without any human connectedness?Welcome to The Search for Meaning, a seven-step process that involves coming to grips with what it means to be a human being who lives, loves, works, plays, suffers, and dies. Will Willimon, Thomas Naylor, and Magdalena Naylor guide us as we review our life histories; come to terms with meaninglessness in our lives; confront separation from ourselves and others; contemplate the consequences of merely having; seek meaning through being; formulate a personal philosophy; and devise a personal strategy to address the most important quest human beings face - the need for our lives to have enduring meaning.",
        "Category": " Religion , General",
        "Publisher": "Abingdon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Kitchen Conversations: Robust Recipes and Lessons in Flavor from One of America's Most Innovative Chefs",
        "Authors": "By Goldstein, Joyce",
        "Description": "Kitchen Conversations is a double portion of culinary wisdom from one of the great cooks and cooking teachers of our time. It is filled with fabulous Mediterranean meals, as Joyce takes you on a luscious tour of her favorite cuisines: 160 sparkling and satisfying recipes from Italy, North Africa, Spain, Greece, and Turkey.",
        "Category": " Cooking , Methods , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The mystery of King Arthur",
        "Authors": "By Jenkins, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Coward, McCann & Geoghegan",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Huckleberry Hound and the Christmas Sleigh: A Little Golden Book",
        "Authors": "By Pat Cherr",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Herman, You Were a Much Stronger Man on Our First Honeymoon",
        "Authors": "By Unger, Jim",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Andrews Mcmeel Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Class and Community: The Industrial Revolution in Lynn",
        "Authors": "By Dawley, Alan",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "A Day in the Life of Hollywood",
        "Authors": "By Messing, Bill (EDT)",
        "Description": "The work of seventy-five photographers provides a comprehensive profile of Hollywood, following a young actress at an audition, the power elite at restaurants, special effects people, celebrities, and others. 100,000 first printing. Lit Guild.",
        "Category": "",
        "Publisher": "Collins",
        "Price Starting With ($)": "8.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Dad Cooks Up a Party: The Complete Guide to Entertaining Family and Friends",
        "Authors": "By Sloan, Bob",
        "Description": "Provides recipes and time-saving tips for various types of parties, from a do-ahead dinner for eight and a lobster boil to a Saturday night chile party and a seductive dinner for two",
        "Category": " Cooking , Entertaining",
        "Publisher": "John Wiley & Sons, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "McClane's North American Fish Cookery",
        "Authors": "By McClane, Albert Jules",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "William E. Donoghue's No-Load Mutual Fund Guide: How to Take Advantage of the Investment Opportunity of the Eighties",
        "Authors": "By Donoghue, William E.",
        "Description": "Explains how to invest profitably in mutual funds, detailing the types of mutual funds, and the advantages they offer",
        "Category": " Business & Economics , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Colony",
        "Authors": "By Siddons, Anne Rivers",
        "Description": "Looking back on her ninety years of life while waiting for the arrival of her children and grandchildren to the family summer home, Maude Chambliss recalls a life of wealth, friendship, love, and loss. 150,000 first printing. $150,000 ad/promo. Tour.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "The Progressive Years: America Comes of Age",
        "Authors": "By O'Neill, William L",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Harpercollins College Div",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "There's Nothing in the Middle of the Road but Yellow Stripes and Dead Armadillos: A Work of Political Subversion",
        "Authors": "By Hightower, Jim",
        "Description": "Revised, and with a New Introduction by the Author \"I am an agitator, and an agitator is the center post in a washing machine that gets the dirt out.\"--Jim Hightower  Hightower is mad as hell and he's not going to take it anymore! He's also funny as hell, and in  this book he focuses his sharp Texas wit, populist passion, and native smarts on America's political, economic, scientific, and media establishments. In There's Nothing in the Middle of the Road But Yellow Stripes and Dead Armadillos, Hightower shows not only what's wrong, but also how to fix it, offering specific solutions and calling for a new political movement of working families and the poor to \"take America back from the bankers and bosses, the big shots and bastards.\" \"If you don't read another book about what's wrong with this country for the rest of your life, read this one. I think it's the best and most important book about out public life I've read in years.\" --Molly Ivins, author of Molly Ivins Can't Say That, Can She? \"When do we get to vote for Jim Hightower for president? Will somebody please tell me? When do we get to vote for Jim Hightower for president?.\"--Michael Moore, author of Downsize This! \"Listen to Jim Hightower. His is a two-fisted, rambunctious voice unafraid to speak truth to power, eloquently and clearly...He's one of the best.\" --Studs Terkel",
        "Category": " Political Science , Essays",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The River",
        "Authors": "By Wastvedt, Tricia",
        "Description": "Tricia Wastvedt's debut novel, met with critical acclaim in England, is a hypnotically readable portrait of a community scarred, but eventually reawakened, by its grief. Two children drown during the summer of 1958 in the English village of Cameldip. Their parents, Isabel and Robert, are bound together in guilt and anger, and as the years pass, the tragedy weaves itself into the invisible fabric of village life.Robert, finding solace in labor, builds several tree houses that transform the look of the town, and as the years pass the structures grow entwined with other houses. It is thirty years after the tragedy when Anna, a young pregnant woman escaping her life in London, arrives in Cameldip and is taken in by Isabel. As Anna slowly uncovers the secrets of the town's past, she becomes inexorably drawn into the conflict in which Isabel and Robert have been locked for three decades. A story of families, old scars, and new beginnings, The River is a lyrical and haunting tale of betrayal, failure, love, and fortitude.",
        "Category": " Fiction , Literary",
        "Publisher": "Grove Press, Black Cat",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Emperor Qin Shihuang's Eternal Terra-cotta Warriors and Horses",
        "Authors": "By Li, Bing Wu",
        "Description": "",
        "Category": "",
        "Publisher": "Shaanxi Sanqin Publishing House",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "How to Be a Cheap Hawk: The 1999 and 2000 Defense Budgets (Brookings Studies in Foreign Policy)",
        "Authors": "By O'Hanlon, Michael E.",
        "Description": "Two important events in 1997--the balanced-budget deal and the completion of the Pentagon's Quadrennial Defense Review (QDR)--promise to shape U.S. military policy for the next several years. Unfortunately, they are at odds with each other.   The balanced budget accord will result in a real level of defense spending that is 8 percent lower in 2002 than in 1998. But the proportionate cuts in personnel and weaponry that the QDR calls for are only about half that size. Moreover, the U.S. military is near the end of its so-called  \"procurement holiday\" and will soon have to buy more equipment.     In this study, Michael O'Hanlon suggests a way out of this budgetary fix. In contrast to the current U.S. military posture, built around a requirement to fight two Desert-Storm like wars at once, he offers an alternative force structure organized around the concept of a \"Desert Storm plus Desert Shield plus Bosnia/IFOR\" requirement. O'Hanlon also suggests that naval operations be conducted more efficiently by leaving ships on forward station for longer periods of time and rotating crews by airlift. Finally, he argues for a number of selected economies in weapons modernization programs, together with some increases in areas like strategic airlift, sealift, and transport helicopters. The resulting force would save over $10 billion a year.",
        "Category": " Political Science , Public Policy , Economic Policy",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Insight Guide Germany (Germany, 1999)",
        "Authors": "By Halliday, Tony",
        "Description": "",
        "Category": " Travel , Europe , Germany",
        "Publisher": "Apa Productions",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Tournament of Roses: The first 100 years",
        "Authors": "By Hendrickson, Joe",
        "Description": "Features profiles of important personalities associated with the parade and behind-the-scenes looks at all the Rose Bowl games",
        "Category": "",
        "Publisher": "Knapp Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Appetizing Hors d'Oeuvres (Cole's Cooking Companion Series)",
        "Authors": "By Cole Group (EDT)",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "Cole Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "John and Mable Ringling Museum of Art",
        "Authors": "By Ringling, Buck",
        "Description": "",
        "Category": "",
        "Publisher": "Sunrise Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Developing Positive Assertiveness (The Fifty-minute Series)",
        "Authors": "By Crisp, Michael (EDT) and Lloyd, Sam R.",
        "Description": "",
        "Category": "",
        "Publisher": "Crisp Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "A Basement Seat to History: Tales of Covering Presidents Nixon, Ford, Carter and Reagan for the Voice of America",
        "Authors": "By Jurey, Philomena",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Linus Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Visions of Liberty: The Bill of Rights for All Americans",
        "Authors": "By Adelman, Bob, Glasser, Ira, and Adelman, Bob (ILT)",
        "Description": "Looks at the history of the struggle for basic rights in America, focusing on the freedom of conscience and of expression, fundamental fairness, and equality",
        "Category": " Law , General",
        "Publisher": "Arcade Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Chicago Bulls: The Spirit of Competition: The Official Inside Story of the 1996-97 Season",
        "Authors": "By Lazenby, Roland and Smith, Bill",
        "Description": "Featuring more than two hundred color photographs, many not published before, a chronicle of the team's fifth championship season--one that tested the ability of coach Phil Jackson to keep his team together--includes exclusive interviews with players and management. Simultaneous. IP.",
        "Category": " Sports & Recreation , Basketball",
        "Publisher": "The Summit Publishing Group",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Charleston: City of Memory",
        "Authors": "By Greene, Harlan",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Legacy Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The New Solar System",
        "Authors": "By J. Kelly Beatty",
        "Description": "",
        "Category": "",
        "Publisher": "Sky Publishing Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "Bay Tripper: Chesapeake Bay Travel Guide, Volume 2 - Western Shore",
        "Authors": "By Schmidt, Whitey",
        "Description": "",
        "Category": " Travel , United States , Northeast , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "Marian Hartnett Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "America then & now",
        "Authors": "By Cohen, David",
        "Description": "",
        "Category": "",
        "Publisher": "Cohen Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Finally Heard; Heroines of the Uncivil War",
        "Authors": "By D'Ambrosia, Angela, Arrick, Suphie, Stanford, Meg Coyle, Fouche, Gene, Mensah, Rona, and Schell, Wanda",
        "Description": "",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "AMLEX, INC.",
        "Price Starting With ($)": "11.28",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Nation 1865-1990: Selections From the Independent Magazine of Politics and Culture",
        "Authors": "By Vanden Heuvel, Katrina (EDT)",
        "Description": "The Nation  is neither as incendiary as its critics (e.g. William L. O'Neill) would have it, nor as prescient (it totally missed on the recent Nicaraguan elections) as its boosters would suggest, but it has been, for 125 years, the preeminent voice of American left-liberalism, occasionally (as in the included essay by Emma Goldman) rising above its own agenda to achieve true radical stature. This anthology of essays (political and cultural), poetry, cartoons and drawings presents the magazine at its best as an essential consciousness and conscience. Published by Thunder's Mouth Press, 54 Greene Street, Suite 4S, New York, NY 10013. (RC) Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , United States , General",
        "Publisher": "Thunder's Mouth Press",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "American Heart Association Cookbook, New and Revised Fourth Edition",
        "Authors": "By American Heart Association",
        "Description": "Offers recipes and menus calling for low-calorie, low-fat, low-cholesterol foods that reduce the chances of heart disease",
        "Category": "",
        "Publisher": "David McKay Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Source of Light",
        "Authors": "By Price, Reynolds",
        "Description": "Here is the second volume of A Great Circle, the highly acclaimed Mayfield family trilogy, from one of America's literary treasures.  Though a novel independent from The Surface of Earth, The Source of Light continues the saga of the Mayfield family, here focusing on Hutchins Mayfield, whose desire for self-knowledge removes him from his secure existence as a prep school teacher and takes him on a journey to Oxford and Italy to study and write. Hutchins comes back home for a family crisis but ultimately returns to England, where he achieves a maturity that enables him to cope with commitments, abandonments, and the creation of an honest personal agenda.  In The Source of Light, Reynolds Price combines gravity and buoyancy, a mythic sense of the past with the mysteries of place, to forge an encompassing portrait of the strange and various world one travels through in the quest for self-fulfillment.",
        "Category": " Fiction , Literary",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Joshua and the Children",
        "Authors": "By Girzone, Joseph F.",
        "Description": "The Story Continues...  Joseph F. Girzone has woven another magical story, a modern-day parable, in Joshua and the Children, which gracefully continues the teachings and inspirations from his previous bestseller, Joshua. A stronger Joshua arrives in a deceptively ordinary village only to witness the doings of unscrupulous leaders and violent people. The children are the first to recognize that something is quite different about this stranger who has come seemingly from nowhere. It is through the villagers' children that Joshua is able to restore a sense of peacefulness and honesty. \"A new day had dawned, a new spirit spread throughout the land, and it all seemed to have happened because of the simple, unassuming goodness of one gentle stranger who knew only how to love.\"",
        "Category": " Fiction , Religious",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Promise of Rest",
        "Authors": "By Price, Reynolds",
        "Description": "In this stunning and fully independent conclusion to A Great Circle, Reynolds Price tells the complex, moving story of a man's return home to die of AIDS and of the unexpected effect that his arrival -- and his death -- has on his family.  Wade Mayfield's parents are separated, but for the remaining months of his life they and their friends come together to care for Wade with the love they can muster. They are unprepared, however, for the astonishing mystery Wade has prepared to reveal once he is gone -- a mystery that initiates the possible reunion of his parents and promises to continue the proud traditions of a complex, multiracial family.",
        "Category": " Fiction , Literary",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "War Without Bloodshed",
        "Authors": "By Clift, Eleanor and Brazaitis, Tom",
        "Description": "Presents a showcase of the everyday activities, behind-the-scenes confrontations, and unlikely alliances of the people--from lobbyists to staffers to senators--who influence how laws are written and whether or not they will, in fact, become the laws of the land. Reprint. 20,000 first printing.",
        "Category": " Political Science , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Fall of a Sparrow",
        "Authors": "By Hellenga, Robert",
        "Description": "Robert Hellenga, bestselling author of The Sixteen Pleasures, once again reveals his profound understanding of the strength and resilience of the human spirit in a compelling and masterful novel.  Alan Woodhull (\"Woody\"), a classics professor at a small Midwestern college, finds himself convinced that life has taught him all the lessons he has to learn: After the tragic death of his beloved oldest daughter during a terrorist bombing in Italy seven years ago, his wife has left him and his two remaining daughters have grown up and moved away. Yet his decision to attend the trial of the terrorists and to return to the scene of the tragedy marks the beginning of a new life and the awakening of a new love.",
        "Category": " Fiction , Literary",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Fed Up with the Fanny: A Novel",
        "Authors": "By White, Franklin",
        "Description": "Kahlil Richardson seems to have it all: a stellar career as a rising young advertising executive in his native Detroit, a serious commitment to community activism, a beautiful girlfriend to whom he's just become engaged, a loving family, and a great old house that he's fixing up room by room. Things are about to get very messy, however, as the women in his life make unwise decisions that affect everyone around them.  A captivating tale driven by strong characters who aren't afraid to speak their minds, Fed Up with the Fanny is a novel for every woman who has yearned for men to communicate more and for every man who has felt blamed for the divide between the sexes. We may think the choices we face in life are ours alone to make, but Franklin White shows with compassion how those choices affect not only us but our loved ones as well.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Big Ugly",
        "Authors": "By Weld, William F.",
        "Description": "That night I dreamed of Detective Lieutenant Rudy Solano, my deer-hunting buddy, my fellow crime-fighter, who got me my job as an assistant U.S. attorney in Brooklyn. My dead buddy....  Then I saw the money on the bed, I saw the cheap metal bedpost, the bare lightbulb. My one-room apartment....That was the first time I took too much money, money that didn't belong to me. Thanks, Rudy.  Then, still in his police uniform, Rudy Solano was a judge, pointing at me, lecturing me: How could you do this? I was a prisoner in the dock, I was on trial....  Solano's face began to sweat and shake, as I had seen it do in life. He fell from the judge's bench, landing in the snow, in hunting clothes covered with blood, as I had found him when Sergeant Gatto drove me up to Jaffrey that Saturday night. I was there, in the snow, in my dream. The yellow tape from the police barrier stuck to my clothes. It was still there the next day when I walked into my office in the Hart Senate Office Building. Everyone was staring at it. How am I going to explain this snow, this tape?  Fresh from the scary world of international organized crime in Weld's bestselling and hilarious Mackerel by Moonlight, ex-prosecutor and newly elected senator Terry Mullally, one of the most charming, handsome, and fickle rogues to hit the fiction pages in recent memory, finds that his old enemies may still have murder on their minds and that new ones are laying traps for him.  In his first novel, which Kirkus described as \"Primary Colors meets George V. Higgins,\" and People magazine called \"a blisteringly funny suspense tale,\" we followed Mullally's rise from assistant U.S. attorney in Brooklyn to district attorney in Massachusetts to the U.S. Senate. Now he has married and is madly in love with the gorgeous widow of a shady murdered businessman, trying to shed the mobsters and cops who know his secrets and find his way through a new minefield. With good reason, Mullally sees danger everywhere. Does his wife know what he has done to get where he is? Does the new head of the criminal division of the Justice Department? Will the whole world?  Mullally is quickly drawn into the schemes of loose money and political vendettas. Two of his fellow Democratic senators are vying for his support in the primaries of 2000, but Mullally admires the maverick Republican vice president, Martha Holloway, who also wants to be president. He has a lot of balls to keep in the air.  Fast-paced, funny, sexy, Big Ugly follows the insouciant Mullally as he pulls off another surprise ending to save his precious skin.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Dreamer: A Novel",
        "Authors": "By Johnson, Charles Richard",
        "Description": "From the National Book Award-winning author of Middle Passage, a fearless fictional portrait of Dr. Martin Luther King Jr. and his pivotal moment in American history.Set against the tensions of Civil Rights era America, Dreamer is a remarkable fictional excursion into the last two years of Martin Luther King Jr.'s life, when the political and personal pressures on this country's most preeminent moral leader were the greatest. While in Chicago for his first northern campaign against poverty and inequality, King encounters Chaym Smith, whose startling physical resemblance to King wins him the job of official stand-in. Matthew Bishop, a civil rights worker and loyal follower of King, is given the task of training the smart and deeply cynical Smith for the job. In doing so, Bishop must face the issue of what makes one man great while another man can only stand in for greatness. Provocative, heartfelt, and masterfully rendered, Charles Johnson confirms yet again that he is one of the great treasures of modern American literature. Dr. Charles Johnson is a novelist, screenwriter, essayist, professional cartoonist and the Pollock Professor of English at the University of Washington. He is the author of more than sixteen books, including the PEN/Faulkner nominated story collection The Sorcerer's Apprentice and the novel Middle Passage, for which he won the National Book Award.",
        "Category": " Fiction , Literary",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "This is My Daughter: A Novel",
        "Authors": "By Robinson, Roxana",
        "Description": "When Peter and Emma, both refugees from failed first marriages, decide to create a new life together, they do so with an optimistic commitment to creating a union -- and forging a new family from two existing ones -- bonded by love and trust. Their young daughters, however, are not partners in this new venture, but helpless participants. Like all children of divorce, the girls feel sorrow, loss, and a longing for their earlier lives. As the tensions and complexities grow steadily more powerful, This Is My Daughter moves inexorably to a stunning and emotional climax. Roxana Robinson, who has established a reputation as a perceptive chronicler of WASP family life, delivers a beautifully moving and compassionate account of a marriage in peril, proving once more that class and privilege provide no protection from the passion of opposing desires.",
        "Category": " Fiction , Sagas",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Run Catch Kiss: A Gratifying Novel",
        "Authors": "By Sohn, Amy",
        "Description": "\"I was only twenty-two and already I was infamous...\" So begins Amy Sohn's hilarious and wise debut novel, Run Catch Kiss.  When the saucy Ariel Steiner returns home to New York City to be an actress, she is buoyed by daydreams of becoming Hollywood's hottest ingenue. Nothing can stand in her way -- nothing, that is, but her freshman-fifteen pounds, a senile talent agent, and the fact that she's living back home with her parents in Brooklyn.  While waiting for the ever-elusive big break, Ariel discovers a hidden talent for channeling her erotic fantasies and becomes a sex columnist at New York's hottest downtown weekly. Soon, art and life are imitating one another, and the junkies, commitmentphobes, and other subjects of Ariel's columns are wreaking havoc on her life. But when she finally falls in love, the real Ariel must stand up. Is she a nice Jewish girl who wants to settle down or a brazen sex kitten who'd rather meet a deadline than the man of her dreams?  Sharp, savvy, and irresistible, Run Catch Kiss is a tongue-in-cheek commentary on that dangerous turn-of-the-century phenomenon: the single girl who wants it all.",
        "Category": " Fiction , Humorous",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Jean Anderson's New Processor Cooking",
        "Authors": "By Anderson, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow & Company",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Ancestors: 900 Years in the Life of a Chinese Family",
        "Authors": "By Ching, Frank",
        "Description": "A Chinese-American journalist traces his family roots back nine hundred years, from the twelfth century to the present, in a personal genealogical guest that parallels the political and social history of the Chinese civilization.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "The Peter Pyramid: Or, Will We Ever Get the Point?",
        "Authors": "By Peter, Laurence J.",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Head to Head: The Coming Economic Battle Among Japan, Europe, and America",
        "Authors": "By Thurow, Lester C.",
        "Description": "With the dismantling of the Berlin Wall in 1989 and the implosion of the USSR in 1991, the Cold War era has ended.Immediately, a new economic struggle begins. Three economic superpowers emerge, each playing the game of capitalism in a strikingly different manner. And for the first time, the United States is the second largest economy in the world.As the domestic economy stagnates and the deficit financing of the federal government escalates, many Americans see themselves at a turning point. And well they might.In Head to Head, one of America's most influential economists provides his dynamic assessment of the emerging economic landscape: the rules of this new three-way competition; the strengths and weaknesses of the players; the information we need to win.Head to Head is full of surprises; one attribute of the new competition is that radical new skills and radical new ways of thinking are vital to success. For example:Competition and Cooperation. In the 1990s, there will be no clear winners, but losers might be destroyed. The ability to cooperate effectively with your direct adversary will be a requisite for survival.Resources. If we are to thrive in this new environment, our whole notion of essential resources must be overhauled before the year 2000.Key Industries. There are seven key industries vital to the maintenance of a high standard of living. How can we maintain competitiveness in those industries over the coming decade and beyond?Education. Education is the most potent weapon of the new warfare. How can we close the education gap?Teams. How can Americans learn to become team players in new and unfamiliar ways?",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Friends in High Places: Our Journey from Little Rock to Washington, D.C.",
        "Authors": "By Hubbell, Webster",
        "Description": "The author describes his friendship with President Clinton, his political career, and the Whitewater scandal that led to his imprisonment",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "True Enough",
        "Authors": "By McCauley, Stephen",
        "Description": "From the author of The Object of My Affection comes a warm and witty family drama about love and lust, trust and betrayal, commitment and denial.Jane Cody keeps lists. After all, how else would she keep track of her life—her job producing a Boston TV show; her amiable but frankly dull second husband; and her precocious six-year-old son who “doesn't do small talk” but loves to bake. And as if that weren't enough she has an acid-tongued mother-in-law living in her barn, an arthritic malamute lodger to walk, and a dangerously seductive ex-husband on the scene. In New York, Desmond Sullivan is fretting that his five-year relationship with smart, sweet Russell is too monogamous and settled. Perhaps a spell as writer-in-residence at Deerforth College will cure that, and also allow him to finish his biography of one of the 'sixties greatest forgotten mediocrities, torch singer Pauline Anderton? When Jane and Desmond meet in Boston, they embark on a TV documentary about the elusive Anderton, which is to take them on a journey of self-discovery in which they learn as much about their own secrets and lies than they ever wanted to know.",
        "Category": " Fiction , LGBT , Gay",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Knee Deep in Paradise",
        "Authors": "By Butler, Brett",
        "Description": "Knee Deep in Paradise is the story of a woman who has survived a gothic childhood in the Deep South, an adolescence of bewildering explorations with sex, drugs, and alcohol, and an abusive first marriage with her sense of humor - and love of language - intact.With a phoenixlike power to re-create herself from the ashes she had made of her life, Brett found comedy. And as she found her own voice - a voice as forthright as the experiences it describes - she found success. But the popularity Brett now enjoys is rooted in the stuff of her past, and it is this past she describes here, not sparing herself along the way.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "No Shirt, No Shoes, No Problem!",
        "Authors": "By Foxworthy, Jeff",
        "Description": "America's favorite Southern-fried, stand-up comedian and TV sitcom star Jeff Foxworthy - known for his \"You might be a Redneck if...\" jokes and multiplatinum albums - brings his humor to the page in this riotous laugh-out-loud book.In No Shirt. No Shoes.... No Problem!, Foxworthy examines the universal experiences of growing up, hunting, fishing, tobacco chewing, love, sex, crazy families, roommates, friendship, marriage, parenthood, mooning, Buck Lure, having a crush on your cousin, and fishball. Okay, maybe they're not all universal. Not everyone owns Buck Lure.Growing up in Georgia, Foxworthy had plenty of opportunities to get into trouble, and in No Shirt. No Shoes.... No Problem!, you'll learn all about his many hijinks, including hanging and flying BAs, dragging stuffed animals in front of oncoming cars, farting contests, and the King Slob competition - and you'll learn the real stories behind many of his favorite Redneck jokes.",
        "Category": " Humor , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Stay Here With Me: A Memoir",
        "Authors": "By Olmstead, Robert",
        "Description": "Robert Olmstead has peopled his fiction with the laconic, rough-hewn farmers, loggers, and hired hands of rural New England mountain towns where getting drunk, getting into fights, and getting thrown out of bars are the normal rites of passage. In Stay Here with Me he draws directly from his own experience as he journeys back to his youth on his grandfather's dairy farm in New Hampshire to confront the ghosts that continue to afflict him.Authentic, intimate, and intense, Stay Here with Me is about coming of age and leaving home, about the acts of rebellion that free the body even as they bind the soul to a place forever. Olmstead lays bare the acute pain of his father's alcoholism and the shattering decline of his grandfather, the family patriarch. With delicate sensuality, he traces the flowering of his love for a woman who \"walks like light would walk if it could.\" And throughout, there is the land where his family has worked and lived and died for six generations, land at once richly abundant and cruelly demanding.",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Bomber's Law: A Novel (John MacRae Books)",
        "Authors": "By Higgins, George V.",
        "Description": "Bob Brennan is an old-school Boston cop who knows a lot about Short Joey Mossi, a mob hit man who's neatly taken care of at least eleven competitors. In fact, as Harry Dell'Appa, a hotshot detective recalled from banishment in the sticks, discovers, Brennan not only knows a lot, but he talks a lot, too-about who Joey's killed, and about how and why. So why won't Brennan bring Joey in? That's what Harry has to find out.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Golf courses of the PGA Tour",
        "Authors": "By Peper, George",
        "Description": "",
        "Category": "",
        "Publisher": "H.N. Abrams",
        "Price Starting With ($)": "8.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Jacques Cousteau--Whales by Jacques Yves Cousteau (1988-11-04)",
        "Authors": "By Cousteau, Jacques-Yves",
        "Description": "",
        "Category": "",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "7.93",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Seventh-day Adventists Believe...A Biblical Exposition of 27 Fundamental Doctrines",
        "Authors": "By Ministerial Association of Seventh-Day Adventists",
        "Description": "",
        "Category": "",
        "Publisher": "Review and Herald Publishing Association",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "I Love the Word Impossible",
        "Authors": "By Kiemel, Ann",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Olympics: A History of the Games",
        "Authors": "By Johnson, William Oscar",
        "Description": "Sports Illustrated celebrates the Olympics in an illustrated coffee-table tribute to the games that includes articles by William Oscar Johnson, a detailed appendix, and 140 photographs.",
        "Category": " Sports & Recreation , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "If I should die before I live: With study guide for personal reflection or group interaction",
        "Authors": "By Sueltz, A.",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Key to Your Child's Heart: Proven Steps That Will Help You Raise Motivated, Obedient, and Loving Children",
        "Authors": "By Smalley, Gary",
        "Description": "A best-seller for nearly a dozen years, this book of dependable and biblically based advice is now updated to reflect the parenting concerns of the '90s. Smalley discusses how to cultivate a successful parenting style, ways to motivate your child, ways to reopen a child's wounded spirit, how to use parent-child contracts to teach responsibility, ways to express loving support for your child, and more. These practical and proven strategies can help you rear motivated, obedient, and loving children in a close-knit family. This is an excellent study aid for church-based parenting classes.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Bob Pierce: This One Thing I Do by Franklin Graham (1983-05-03)",
        "Authors": "By Franklin Graham, Jeanette W Lockerbie",
        "Description": "",
        "Category": "",
        "Publisher": "Word Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Candidates, Parties, and Campaigns: Electoral Politics in America",
        "Authors": "By Salmore, Barbara G. and Salmore, Stephen A.",
        "Description": "A candid glimpse into the world of election campaigns from the nineteenth century to the present. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Political Science , General",
        "Publisher": "Cq Pr",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Flickering Shadows",
        "Authors": "By Kamau, Kwadwo Agymah",
        "Description": "Offers a portrait of village life on a Caribbean island, where love and honor are complicated by political manipulation and religious corruption",
        "Category": " Fiction , African American , General",
        "Publisher": "Coffee House Press",
        "Price Starting With ($)": "8.02",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Making It on Your Own: Surviving and Thriving on the Ups and Downs of Being Your Own Boss",
        "Authors": "By Edwards, Sarah and Edwards, Paul",
        "Description": "",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Complete Guide to Your Emotions and Your Health: Hundreds of Proven Techniques to Harmonize Mind & Body for Happy, Healthy Living",
        "Authors": "By Padus, Emrika",
        "Description": "A guide to harmonizing mind and body teaches readers how to use their emotions to boost their natural healing potential, showing them how emotions make people susceptible to illness. National ad/promo.",
        "Category": " Psychology , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Practical Encyclopedia of Sex and Health: From Aphrodisiacs and Hormones to Potency, Stress, Vasectomy, and Yeast Infection",
        "Authors": "By Bechtel, Stefan",
        "Description": "The verso of the title page indicates simultaneous publication by Fireside Press under the title  The Sex Encyclopedia . Bechtel (whose credentials are not listed) has as his co-authors the editors of  Men's Health  and  Prevention  magazines. Alphabetically arranged entries offer practical information on subjects connected with enjoyment, safety, vitality, and love. No bibliography. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Health & Fitness , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Prevention's Food and Nutrition: The Most Complete Book Ever Written on Using Food and Vitamins to Feel Healthy and Cure Disease",
        "Authors": "By Prevention Magazine Health Books and Feltman, John (EDT)",
        "Description": "A popular guide to eating for health. Explains the effects of nutrition and examines all of the essential nutrients in foods what they do and who needs more of what. Includes a guide for food shopping, tips on growing foods, an array of healthy recipes, and a comparison of special diet programs offered by top clinics and spas. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Health & Fitness , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "A Broader Vision: Perspectives on the Buddha and the Christ",
        "Authors": "By Drummond, Richard Henry",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Are Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Shetland Sheepdog: An Owner's Guide to a Happy Healthy Pet (Happy Healthy Pet, 80)",
        "Authors": "By Merrithew, Cathy",
        "Description": "An Owner's Guide to a Happy Healthy Pet is the series to turn to when you want a basic reference that's reliable, up-to-date, and complete. These guides feature:* Expert authors, plus renowned guest contributors on specialized topics* Full-color photos throughout* Basic information on the breed, species, or topic* Complete coverage of care, health, grooming, training, and more* Tips and techniques to make life with a pet more rewarding",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Treatment of Psychiatric Disorders: Revised for DSM-III-R",
        "Authors": "By Reid, William H., Balis, George Ulysses, Wicoff, James S., and Tomasovic, Jerry J.",
        "Description": "Reid, (psychiatry, U. of Texas Health Science Center, San Antonio) presents a broad range of treatment approaches and integrates, where apprpriate, various facets of biological, psychological, family, social and educational interventions. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Brunner/Mazel, Inc",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Events That Shaped the Century (Our American Century)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Text and photographs chronicle more than one hundred pivotal events that shaped United States history in the twentieth century",
        "Category": " History , United States , 20th Century",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Dragonwings",
        "Authors": "By Yep, Laurence",
        "Description": "Newbery Honor Book Dragonwings by Lawrence Yep takes readers on an adventure-filled journey across the world.Inspired by the story of a Chinese immigrant who created a flying machine in 1909, Dragonwings touches on the struggles and dreams of Chinese immigrants navigating opportunity and prejudice in San Francisco. Moon Shadow only knows two things about his father, Windrider: he lives in San Francisco and used to craft beautiful kites.One day shortly after his eighth birthday, Cousin Hand Clap arrives with a letter from Windrider asking Moon Shadow to join him in San Francisco. When Moon Rider arrives in America he learns that his father makes a living doing laundry and dreams of building a flying machine just like the Wright Brothers. But making this fantastical dream a reality proves to be no easy task, as intolerance, poverty, and even an earthquake stand in their way.",
        "Category": " Young Adult Fiction , Historical , United States , 20th Century",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Leading Self-Directed Work Teams: A Guide to Developing New Team Leadership Skills (McGraw-Hill Training Series)",
        "Authors": "By Fisher, Kimball",
        "Description": "Across the country, highly competitive, self-directed work teams (SDWTs) are chalking up astonishing productivity gains. These work teams are replacing entrenched, autocratic, boss-driven organizations whose management styles are obsolete. Driving these remarkable workplace success stories is a new breed of supervisor who empowers teams through example and commitment, instead of by demanding obedience and control.Drawing upon the actual experiences of hundreds of team leaders in such self-directed workplaces as Kodak, Apple, Corning, Shell, and many others, Leading Self-Directed Work Teams reveals how supervisors in any company - large or small - an take advantage of the career-boosting leadership skills that make and keep major corporations competitive.This timely book takes a refreshingly candid look at the challenges, intricacies, and rewards of changing from a traditional supervisor to a confident SDWT leader. It focuses on hundreds of practical, time-tested techniques for developing the business, interpersonal, and technical capabilities of any team. And it explains step-by-step how you can master such crucial team leadership skills as coaching, business analysis, barrier busting, facilitating groups, customer advocacy, accessing information, and much more. Along the way, the author profiles the most innovative team leader practices learned from Kodak's 13 Room and Procter & Gamble experiments, demonstrating the remarkable benefits of managing by principle rather than by policy, and setting boundaries that change as the team matures.Leading Self-Directed Work Teams guides you confidently through each of the five evolutionary phases most SDWTs experience during their maturation, detailing the specific skills and behaviors required to meet this sequence of challenges. For exceptional utility, it provides a weekly activity guide to help team leaders remember critical activities, supplies a special chapter focusing on \"3 days in the life of a team leader,\" and shows how to quickly test and interpret your thoughts and behaviors about team leadership.Whether you're a supervisor or CEO - whether your team is a small group of office workers or a Fortune 100 company - discover how to excite, energize, and inspire team members by developing the vision and guiding principles for effective team leadership; fostering coordination, clarity, and consistency without restricting autonomy and creativity; giving and obtaining feedback in a constructive, nondefensive manner; ending temper flare-ups, grievances, and eroding trust among team members; dealing with team members, peers, and senior managers resistant to the new work paradigm; deciding when appropriate management intervention is not only acceptable, but required; and making decisions in real time without traditional wasted periods.In today's rapidly changing marketplace, the competitive edge belongs to those organizations that capitalize on the full potential of their human and technical resources. Leading Self-Directed Work Teams gives you the skills, insights, and confidence to adapt to today's indispensable leader-facilitator role and guide newly empowered, participative teams to their full potential.",
        "Category": " Business & Economics , Management",
        "Publisher": "Mcgraw Hill",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "About Time!: A Woman's Guide to Time Management",
        "Authors": "By Mackenzie, R. Alec",
        "Description": "Explains how to analyze time use, identify time-wasting activities, plan and organize work, run effective meetings, avoid interruptions, and delegate work",
        "Category": " Business & Economics , General",
        "Publisher": "Mcgraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "The Invisible Alcoholics, Women and Alcohol Abuse in America",
        "Authors": "By Marian Sandmaier",
        "Description": "Records and interprets the experiences of alcoholic women, using interviews with various women having drinking problems to identify and describe the scope and implications of alcoholism among women",
        "Category": "",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Asthma: The Complete Guide to Self-Management of Asthma and Allergies for Patients and Their Families",
        "Authors": "By Weinstein, Allan M.",
        "Description": "A practical self-help program explains the nature of the widespread ailment, and shows how sufferers can avoid expense and difficulty by controlling the illness at home",
        "Category": " Medical , General",
        "Publisher": "Mcgraw Hill",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Double Your Brain Power: Increase Your Memory by Using All of Your Brain All the Time",
        "Authors": "By Stine, Jean Marie",
        "Description": "Offers strategies and techniques for boosting mental efficiency in order to maximize one's ability to concentrate, learn, and remember",
        "Category": " Self-help , Personal Growth , Memory Improvement",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Modern therapies (A Spectrum book ; S-397)",
        "Authors": "By Binder, V. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Grand Tour: Breaking the Confines",
        "Authors": "By Conti, Flavio",
        "Description": "",
        "Category": "",
        "Publisher": "HBJ Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Scandalmonger (Harvest Book)",
        "Authors": "By Safire, William",
        "Description": "The bestselling historical novel that exposes the less than honorable side of our Founding Fathers by the Pulitzer Prize-winning columnist. In this gripping and timely work, William Safire unveils the story behind the nation's first great political scandals. James Thomson Callender, the \"scandalmonger\" of the title, is an ambitious gossip-peddling editor secretly hired by Thomas Jefferson as a political weapon. After carefully damaging Alexander Hamilton's reputation, thereby paving the way for Jefferson's success, Callender is shunned by the very politicians on whose behalf he was jailed for sedition. Broke and betrayed, Callender seeks revenge by exposing an illicit affair between Jefferson and his slave Sally Hemmings, an accusation that ultimately cost Callender his career and would not be authenticated for two centuries. By using actual letters, records, and notes to re-create dialogue and events, Scandalmonger embodies historical fiction at its best, politics at its most intriguing, and our Founding Fathers at their most notorious. For those who think that Washington sex scandals and lurid journalism are recent developments, this novel will be a revelation, for Safire shows how media intrusiveness into private lives-and politicians' cool manipulation of the press-are practices as old as the Constitution.",
        "Category": " Fiction , Political",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Energy: Demand, Conservation, and Institutional Problems",
        "Authors": "By Cambridge",
        "Description": "Over the past several years, the issues of energy demand and energy use have increasingly become the concerns of the research community. A significant number of scientists and technologists, as well as specialists in the economic and social disciplines, have responded to the critical need to resolve these issues, which are only now seriously activating decision makers in government and in the private sector and engaging the attention of consumers. In fact, the study of energy problems is rapidly gaining the status of a formally recognized subject area, supported by a sizable body of published research. This book makes a solid contribution to the foundation of this new subject area.The book is based on a conference held at MIT in February 1973. It includes in their entirety four important invited papers—\"Ways of Looking at Future Economic Growth, Resource and Energy Use,\" by Tjalling C. Koopmans; \"Theory and Practice of Effluent Control,\" by Robert Dorfman; \"Institutional Capacity to Implement Energy Conversion Proposals,\" by Edward Berlin; and \"The Entropy Crisis,\" by George N. Hatsopoulos—and a number of contributed papers that were presented at the conference by authorities from across the country and from abroad.The editor has organized the papers into a number of groups that represent major study areas and topics of general concern: economic growth and energy resources, the modeling of the energy system, input-output methodologies applied to energy studies, studies of electrical demand, energy in transportation, the transportation of energy, energy conservation, energy supply, problems of gas regulation, solar energy, and institutional problems.The conference was organized by MIT's Energy Laboratory under a grant from the RANN program of the National Science Foundation.",
        "Category": " Science , Energy",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "Terry Bradshaw, Man of Steel",
        "Authors": "By Bradshaw, Terry",
        "Description": "Photographs illustrate an account of the triumphs and tragedies of Bradshaw's football career and the place of his family and God in his life",
        "Category": "",
        "Publisher": "Zondervan Publishing House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1979"
        }
    },
    {
        "Title": "American Renaissance: Our Life at the Turn of the 21st Century",
        "Authors": "By Cetron, Marvin and Davies, Owen",
        "Description": "Written by two of America's leading forecasters, this controversial yet well-documented book presents a provocative, upbeat vision of the U.S. in the upcoming century when work and education methods will change considerably",
        "Category": " Social Science , Future Studies",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Biology of Success",
        "Authors": "By Arnot, Bob",
        "Description": "This step-by-step program designed by Dr. Arnot enables readers to change undesirable habits and behavior and to create optimal conditions for succeeding, and, ultimately, to achieve their personal best. Includes information on diet, exercise, how to make simple changes to improve mood, and more.",
        "Category": " Health & Fitness , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Making of a Public Man: A Memoir",
        "Authors": "By Linowitz, Sol",
        "Description": "",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Black Veil: A Memoir with Digressions",
        "Authors": "By Moody, Rick",
        "Description": "While still in his twenties, Rick Moody found that a decade of alcohol, drugs, and other indulgences had left him stranded in a depression so severe that he feared for his life. The road of excess led, for him, not to the palace of wisdom but rather to a psychiatric hospital in one of New York's least exalted boroughs.The Back Veil is Rick Moody's account of that debilitating passage in his life. It is the story of a mind unraveling, and of how it feels when the underpinnings of life fall away. The anxieties of early adulthood, of first finding a place in the world - the weight placed upon that first relationship, first job, first apartment - are presented here with enormous sympathy. Anyone who has ever felt his or her own psychological footing slip, even briefly, will find Moody's account of his breakdown and return both harrowing and heartbreaking.",
        "Category": " Family & Relationships , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "River, Cross My Heart: A Novel (Oprah's Book Club)",
        "Authors": "By Clarke, Breena",
        "Description": "The acclaimed bestseller--a selection of Oprah's Book Club--that brings vividly to life the Georgetown neighborhood of Washington, DC, circa 1925, and a community reeling from a young girl's tragic death.River, Cross My Heart marks the debut of a wonderfully gifted new storyteller in Breena Clarke. When five-year-old Clara Bynum drowns in the Potomac River under a seemingly haunted rock outcropping known locally as the Three Sisters, the community must reconcile themselves to the bitter tragedy.Clarke powerful charts the fallout from Clara's death on the people she has left behind: her parents, Alice and Willie Bynum, torn between the old world of their rural North Carolina home and the new world of the city; the friends and relatives of the Bynum family in the Georgetown neighborhood they now call home; and, most especially, Clara's sister, ten-year-old Johnnie Mae, who is thrust into adolescence and must come to terms with the terrible and confused emotions stirred by her sister's death. This highly accomplished first novel reverberates with ideas, impassioned lyricism, and poignant historical detail as it captures an essential and moving portrait of the Washington, DC community.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Witness to a Century: Encounters with the Noted, the Notorious, and the Three SOBs",
        "Authors": "By Seldes, George",
        "Description": "Analyzes the structure of families, examines the unexpressed rules used to raise children, and discusses family violence, child abuse, and dysfunctional families",
        "Category": " History , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Evensong: A Novel (Ballantine Reader's Circle)",
        "Authors": "By Godwin, Gail",
        "Description": "To read Gail Godwin is to touch the very core of human experience. With inimitable grace and aching emotional precision, Godwin probes our own complexities in characters whose lives oscillate between success and struggle, stoic resolve and quixotic temptation, bitter disappointment and small, sacred joys. Now with Evensong, she again translates our everyday existence into soul-touching truths as she brings to brilliantly realized life the people of a small Smoky Mountain town--and a woman whose world is indelibly altered by them.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The best",
        "Authors": "By Passell, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Confirmation",
        "Authors": "By Powers, Thomas",
        "Description": "The confirmation of the seemingly spotless nominee Frank Cabot as Director of Central Intelligence is jeopardized when Brad Cameron, a young CIA officer looking for evidence of American prisoners left behind after the Vietnam War, uncovers a suppressed report - a claim by a convicted American spy that Cabot cooperated with the Russians in a shameful cover-up twenty years earlier. As Cabot attempts to clear his name, reporter George Tater digs relentlessly for the story that will revive his career and Cameron doggedly pursues the truth about what happened. The result is a full-scale Washington media circus, as a host of interested parties - the president, the press, the senators who must vote yea or nay on Cabot's nomination, and Cabot's friends and enemies - all try to conceal, expose, or spin what he did and why.Closely paralleling these events is a different kind of conspiracy. A clandestine militia of angry Vietnam vets, convinced that officials in high places have deliberately abandoned American POWs, plot a confrontation - both clever and rash - calculated to violently disrupt Cabot's confirmation hearings.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Plain Brown Wrapper: An Alex Powell Novel",
        "Authors": "By Bates, Karen Grigsby",
        "Description": "Who killed Ev and why? The three most likely suspects are Ev's competitors -- publishers of the country's other popular black magazines who all had plenty of good reasons to make sure Ev never received his Journalist of the Year award.With the help of Paul Butler, a fellow journalist and an old friend, Alex tries to untangle the circumstances that led to Ev Carson's death. Their investigative trail will carry them from the West Coast to the East, to D.C., New York, and the social whirl of Martha's Vineyard as the summer season reaches its peak. In the middle of dissed colleagues, dumped girlfriends, disgruntled ex-employees, and the legions of enemies Ev managed to accumulate before he died, Alex Powell realizes that before everything is over Everett Carson might not be the only person who ends up with a toe tag.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Book of comfort and joy",
        "Authors": "By Ideals",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday (Galilee)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Enterprise One to One: Tools for Competing in the Interactive Age",
        "Authors": "By Rogers, Martha and Peppers, Don",
        "Description": "Is there anyone out there who isn't worried about staying far in front of the technological tidal wave that is making products smarter and changing everything about what customers buy, how they buy, and where their loyalty goes?Don Peppers and Martha Rogers, authors of the international bestseller The One to One Future, go beyond that now classic work on how to sell more products to fewer customers. For the last several years, they have been teaching companies how to stay at the head of the pack by harnessing technology to achieve killer competitive advantages in customer loyalty and unit margin. In this brave new world where microchip technology is making it possible for houses to know their occupants better than the occupants know their own houses--know the owners' temperature preferences, water use, lights, appliances--businesses have a great advantage in building unbreakable customer relationships. Peppers and Rogers explain what kinds of strategies are applicable to what kinds of businesses, and under what circumstances--from cars to credit cards, clothing manufacturers to dry cleaners, long distance phone companies to computer resellers. Suddenly car manufacturers, supermarkets, credit card companies, and fashion houses can compete not on commodity rules and price wars, but on bold new rules. Readers of Enterprise One to One will learn:* How to improve customer retention, not just incrementally but dramatically, and increase your share of each customer's business over time, despite the increasingly frantic nature of your competitors' campaigns. * How to protect and increase your unit margin despite the commoditization that has begun to infect every business in every category.* How to create entirely new markets of individual customers with diverse needs.* How to make the transition to the Interactive Age, gaining advantages from new technologies without being threatened by them.No book on marketing is as firmly planted in the competitive future as Enterprise One to One.Don Peppers is president and founder of Marketing 1:1, Inc., based in Stamford, Connecticut. Martha Rogers, Ph.D., is a founding partner at Marketing 1:1, Inc., and professor of telecommunications at Bowling Green State University. Together they are the authors of the bestselling book The One to One Future.",
        "Category": " Business & Economics , Marketing , Multilevel",
        "Publisher": "A Currency Book (Doubleday)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Shadow of Cain",
        "Authors": "By Bugliosi, Vincent",
        "Description": "When notorious mass murderer Raymond Lomak, sentenced to prison twenty-one years ago, is to be released from San Quentin, the question becomes whether or not he has been rehabilitated",
        "Category": " Fiction , Literary",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "The Book of America: Inside the Fifty States Today",
        "Authors": "By Peirce, Neal R. and Hagstrom, Jerry",
        "Description": "Examines the unique mixture of history and peoples that characterizes each one of the fifty states",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "The Megastates of America",
        "Authors": "By Peirce, Neal R.",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "41.75",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Study of American Folklore: An Introduction",
        "Authors": "By Brunvand, Jan Harold",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton & Company, Inc.",
        "Price Starting With ($)": "5.15",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Pregnancy Cookbook",
        "Authors": "By Ricciotti, Hope and Connelly, Vincent",
        "Description": "Offers information on vitamin and mineral intake, physical symptoms, and psychological concerns for preconception, pregnancy, and postpartum, and includes recipes and sample menus",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Chief Joseph of the Nez Perce",
        "Authors": "By Warren, Robert Penn",
        "Description": "A narrative poem based upon the heroic life of the great chief of the Nez Perce Indians, is told partly in the first person by Joseph, partly in the voice of the poet",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "The Astonishing World: Essays",
        "Authors": "By Harrison, Barbara Grizzuti",
        "Description": "In the illuminating prose that made Italian Days a contemporary classic and Barbara Grizzuti Harrison one of our most celebrated writers, this collection of essays spreads before us the rich abundance of life as it documents the author's love affair with the world. Harrison sorts through the complexities and contradictions of our times, bringing to each of her subjects a rare and generous ability to see the extraordinary amidst the mundane. She offers an exhilarating assortment of people, places, cultures, and--as always--food, as well as personal reflections on her own life and heritage.The most perceptive of travelers, Harrison takes us from Bensonhurst to Budapest to Morocco, from the hills of Tuscany to the walled city of Dubrovnik. We meet Nadia Comaneci, visit Gore Vidal in his Roman apartment, spend a day with Governor Mario Cuomo, and go on set with Francis Ford Coppola. In Yugoslavia Harrison explores purported sightings of the Virgin Mary, and in a small town in Vermont she witnesses the horrifying effects of a religious cult on children. Under her captivating gaze the world takes on new color, and her refreshing vision reminds us how astonishing our world really is.This collection of some of her finest writing will be a treat for Barbara Grizzuti Harrison's many fans and a wonderful surprise for the uninitiated. Altogether, these essays constitute a luminous reflection of our world and a personal testament by one of our most beloved writers.",
        "Category": "",
        "Publisher": "Ticknor & Fields",
        "Price Starting With ($)": "7.02",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    }
]