[
    {
        "Title": "Italian Menus (Great Meals in Minutes)",
        "Authors": "By Time-Life Books",
        "Description": "Eleven chefs share recipes for complete Italian-style dinners that feature pasta, sausages, lamb, chicken, veal, fish, pizza, and seafood",
        "Category": " Cooking , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Great Tales of Escape",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hart Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "A Life Worth Living: Practical and Encouraging Insights for Living the Christian Lfe",
        "Authors": "By Gumbel, Nicky",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "David C. Cook Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Garnishing: The Basics and Beyond (Kitchen masterpieces)",
        "Authors": "By Quan, Constance",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Circle Dance",
        "Authors": "By Constantine, Lynne and Constantine, Valerie",
        "Description": "",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Attica Editions",
        "Price Starting With ($)": "8.97",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The will of Zeus;: A history of Greece from the origins of Hellenic culture to the death of Alexander",
        "Authors": "By Barr, Stringfellow",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott",
        "Price Starting With ($)": "12.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Ghosts of Gettysburg V: Spirits Apparitions and Haunted Places of the Battlefield, Vol. 5",
        "Authors": "By Nesbitt, Mark",
        "Description": "",
        "Category": " History , United States , State & Local , Middle Atlantic (DC, DE, MD, NJ, NY, PA)",
        "Publisher": "Thomas Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Olympic Memories: Olympic Hopes/Olympic Cheers/Olympic Dreams/Olympic Goals (Inspirational Romance Collection)",
        "Authors": "By Lynn A. Coleman, Gail Sattler, Melanie Panagiotopoulos, Kathleen Y'Barbo",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Case Of The Sleep-Walker's Niece, The",
        "Authors": "By Gardner, Erle Stanley",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "The Reluctant Fundamentalist",
        "Authors": "By Hamid, Mohsin",
        "Description": "'Excuse me, sir, but may I be of assistance? Ah, I see I have alarmed you. Do not be frightened by my beard. I am a lover of America...' So speaks the mysterious stranger at a Lahore cafe. In this title, this speaker of immaculate English tells you his story, of how he embraced the Western dream - and a Western woman - and how both betrayed him.",
        "Category": " Fiction , General",
        "Publisher": "Penguin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Writing and Art Go Hand in Hand (Kids' Stuff)",
        "Authors": "By Bonica, Diane",
        "Description": "",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Incentive Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "The Everlasting Story of Nory",
        "Authors": "By Baker, Nicholson",
        "Description": "Our supreme fabulist of the ordinary now turns his attention on a 9-year-old American girl and produces a novel as enchantingly idiosyncratic as any he has written. Nory Winslow wants to be a dentist or a designer of pop-up books. She likes telling stories and inventing dolls. She has nightmares about teeth, which may explain her career choice. She is going to school in England, where she is mocked for her accent and her friendship with an unpopular girl, and she has made it through the year without crying.Nicholson Baker follows Nory as she interacts with her parents and peers, thinks about God and death-watch beetles, and dreams of cows with pointed teeth. In this precocious child he gives us a heroine as canny and as whimsical as Lewis Carroll's Alice and evokes childhood in all its luminous weirdness.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Piano Adventures: Theory Book Primer Level (Piano Adventures Library)",
        "Authors": "By Faber, Nancy, Faber, Randall, and McArthur, Victoris",
        "Description": "",
        "Category": " Juvenile Nonfiction , Music , Instruction & Study",
        "Publisher": "FJH Music Company, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Jazz Tradition",
        "Authors": "By Williams, Martin T.",
        "Description": "Profiles the careers, achievements, and individual styles of jazz artists, such as Louis Armstrong, Charlie Parker, Miles Davis, and John Coltrane",
        "Category": " Music , Genres & Styles , Jazz",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "The No-Cry Discipline Solution: Gentle Ways to Encourage Good Behavior Without Whining, Tantrums, and Tears: Foreword by Tim Seldin",
        "Authors": "By Pantley, Elizabeth",
        "Description": "Winner of the Disney’s iParenting Media Award for Best ProductHave the Terrible Twos become the Terrifying Threes, Fearsome Fours,  Frightening Fives, and beyond? Elizabeth Pantley, creator of the No-Cry revolution, gives you advice  for raising well-behaved children, from ages 2 through 8In The No-Cry Discipline Solution, parenting expert Elizabeth Pantley shows you how to deal with your child's behavior. Written with warmth but based in practicality, Elizabeth shows you how to deal with childhood's most common behavioral problems:Tantrums Sleep issuesBacktalkHitting, Kicking and Hair PullingSibling fightsSwearingDawdlingPublic misbehaviorWhining ... and more!\"Pantley applies succinct solutions to dozens of everyday-problem scenarios--from backtalk to dawdling to lying to sharing to screaming--as guides for readers to fashion their own responses.Pantley is a loving realist who has managed, mirabile dictu, to give disciplinarianism a good, warm name.\"--Kirkus\"While many books on discipline theory are interesting and enlightening, parents often struggle finding a way to apply the theories. Pantley’s advice is practical and specific.  If ever trapped on a desert island with a bunch of kids, this is among the most useful books you could bring along.\"--Tera Schreiber, Mom Writer’s Literary Magazine",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Self-Management Therapy for Borderline Personality Disorder: A Therapist-Guided Approach",
        "Authors": "By Langley, Michael H.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Springer Pub Co",
        "Price Starting With ($)": "9.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Mark: The Good News Preached to the Romans",
        "Authors": "By Cunningham, Phillip J.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "7.03",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Food Is a Wonder Medicine: The Power to Heal Is on Your Plate",
        "Authors": "By Barnard, Neal D.",
        "Description": "",
        "Category": "",
        "Publisher": "Magni Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Webster's Official Crossword Puzzle Dictionary",
        "Authors": "By Merriam-Webster",
        "Description": "Gives synonyms, grouped by number of letters, for each entry and includes lists of geographic names and names of people and animals",
        "Category": "",
        "Publisher": "Merriam Webster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Many Troubles of Andy Russell (1)",
        "Authors": "By Adler, David A. and Hillenbrand, Will (ILT)",
        "Description": "Boy, does Andy have troubles! His gerbils escaped and are scampering all over the basement. He's late for school and he sure doesn't want to give that boring Ms. Roman another excuse to call his parents. And he planned to ask his parents today if his good friend Tamika could live with his family until her parents fully recover from a terrible accident. It is definitely not a good day for gerbil troubles. And when Andy learns that his mother is pregnant, he knows he'll have to do some really fancy footwork if his family is going to make room for Tamika. If gerbils threaten to foul up his plan, his meddlesome sister, Rachel, could make matters even worse. It's a good thing for Andy that he's charming and full of bright ideas. As this first chapter book in a new series unfolds, it's clear the Russell household is in for more trouble--and lots of fun!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Angel Bear",
        "Authors": "By Siewert, Pauline (ILT)",
        "Description": "Describes the activities of teddy bear angels.",
        "Category": " Juvenile Nonfiction , Activity Books",
        "Publisher": "Silver Dolphin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Sierra Club Guide to the Natural Areas of New Mexico, Arizona and Nevada (Sierra Club Guides to the Natural Areas of the United States)",
        "Authors": "By Sierra Club (COR) and Perry, Jane Greverus",
        "Description": "Covering some of America's most popular national parks, and 250 natural sites, and landscapes",
        "Category": "",
        "Publisher": "Sierra Club Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Keeker and the Sneaky Pony: Book 1 in the Sneaky Pony Series",
        "Authors": "By Higginson, Hadley, Higgens, Hadley, and Andersen, Maja (ILT)",
        "Description": "Meet Catherine Corey Keegan Dana (everyone calls her Keeker). What she wants most of all is a pony.Meet Plum. Plum is a Shetland pony (who's known to be a teeny bit sneaky). She rarely, if ever, thinks about little girls. She certainly doesn't want one.When Plum moves to Keeker's farm, Keeker faces the challenge of winning a pony's trust and friendship. And when Plum and Keeker find themselves lost in the woods, they learn that working together is the best way to get out of a fix. This fast-paced story of adventure and friendship will have new readers galloping back for more.",
        "Category": " Juvenile Fiction , Lifestyles , Farm & Ranch Life",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "7.98",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Demigods and Monsters: Your Favorite Authors on Rick Riordan's Percy Jackson and the Olympians Series",
        "Authors": "By Riordan, Rick (EDT)",
        "Description": "",
        "Category": " Young Adult Nonfiction , Literary Criticism & Collections",
        "Publisher": "BenBella Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Total Cancer Wellness Guide: Reclaiming Your Life After Diagnosis",
        "Authors": "By Golant, Mitch and Thiboldeaux, Kim",
        "Description": "Organized into four sections that span the cancer-management process from diagnosis through the unpredictable future, this guide covers everything people with cancer and their families need to know about being active participants in their own long-term plan for well-being. With so many cancer patients becoming survivors, living longer and better has become an increasingly important point of focus for The Wellness Community, an international nonprofit organization dedicated to providing free emotional support, education, and hope to people affected by cancer. This book accurately and compassionately addresses all of the physical, emotional, social, and practical needs of today's cancer patients and survivors, preparing them for wellness that can follow throughout the rest of their lives, regardless of how long that may be.",
        "Category": " Health & Fitness , Diseases , Cancer",
        "Publisher": "BenBella Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Pretty Birds: A Novel",
        "Authors": "By Simon, Scott",
        "Description": "The universally respected NPR journalist and bestselling memoirist Scott Simon makes a dazzling fiction debut. In Pretty Birds, Simon creates an intense, startling, and tragicomic portrait of a classic character–a young woman in the besieged city of Sarajevo in the early 1990s.In the spring of 1992, Irena Zaric is a star on her Sarajevo high school basketball team, a tough, funny teenager who has taught her parrot, Pretty Bird, to do a decent imitation of a ball hitting a hoop. Irena wears her hair short like k. d. lang’s, and she loves Madonna, Michael Jordan, and Johnny Depp. But while Irena rocks out and shoots baskets with her friends, her beloved city has become a battleground. When the violence and terror of “ethnic cleansing” against Muslims begins, Irena and her family, brutalized by Serb soldiers, flee for safety across the river that divides the city.If once Irena knew of war only from movies and history books, now she knows its reality. She steals from the dead to buy food. She scuttles under windows in her own home to dodge bullets. She risks her life to communicate with an old Serb school friend and teammate. Even Pretty Bird has started to mimic the sizzle of mortar fire.In a city starved for work, a former assistant principal offers Irena a vague job, “duties as assigned,” which she accepts. She begins by sweeping floors, but soon, under the tutelage of a cast of rogues and heroes, she learns to be a sniper, biding her time, never returning to the same perch, and searching her targets for the “mist” that marks a successful shot. Ultimately, Irena’s new vocation will lead to complex and cataclysmic consequences for herself and those she loves.As a journalist, Scott Simon covered the siege of Sarajevo. Here, in a novel as suspenseful as a John le Carré thriller, he re-creates the atmosphere of that place and time and the pain and dark humor of its people. Pretty Birds is a bold departure, and the auspicious beginning of yet another brilliant career for its author.From the Hardcover edition.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Truckstop and Other Lake Wobegon Stories",
        "Authors": "By Keillor, Garrison",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "What Highly Effective Women Know",
        "Authors": "By Conny, Beth Mende, Ehlers, Lesley (ILT), and Ehlers, Lesley",
        "Description": "",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Peter Pauper Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Solidarity Will Transform the World: Stories of Hope from Catholic Relief Services",
        "Authors": "By Korgen, Jeffry Odell",
        "Description": "",
        "Category": " Religion , Christian Ministry , General",
        "Publisher": "Orbis Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Family & Friends First Aid for Children",
        "Authors": "By American Heart Association (COR)",
        "Description": "",
        "Category": " Health & Fitness , First Aid",
        "Publisher": "Amer Heart Assn Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Obama's BlackBerry",
        "Authors": "By Hauser, Kasper, Baedeker, Robert (CON), Klein, Dan (CON), Reichmuth, James (CON), and Reichmuth, John (CON)",
        "Description": "When Obama stated that if elected, he would keep his Blackberry, debate echoed through Washington and among the ranks of the Secret Service. What would it be like to have a president who could Twitter, send text messages, and navigate the web with ease? What would it be like to receive a text message from inside the Oval Office and, most importantly, what would it say? Now, for the first time, We The People are privy to our new leader's epistolary back-and-forths on his wily hand-held device. We're about to discover that his emails (and the replies, from his wife and daughters, Biden, Palen, Rush, Hannity, the new first puppy, and even Bush) are so tuned in to the language of electronic correspondence they come hilariously close to the brink of legibility. This giftable, imagined glimpse into Obama's beloved Blackberry traverses the mundane and momentous contours of the Commander in Chief's life, from security briefings to spam, basketball practice to domestic bliss, and the panic of oops-I-hit-reply-all, to, of course, the trauma of dealing with the First Mother In Law.To wit: BidenMyTime: Hey U, whatcha doin? BARACKO: M rly busyBidenMyTime: Right :( Can I lv at 4:45?",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The First Time",
        "Authors": "By Fleming, Karl, Fleming, Anne T.",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Publishing Group",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "1976"
        }
    },
    {
        "Title": "Silver Seeds",
        "Authors": "By Johnson, Steve (ILT), Fancher, Lou (ILT), Paolilli, Paul, and Brewer, Dan",
        "Description": "Is the night sky filled with stars, or are they really silver seeds? When you see fall leaves floating down from trees, could they be little brown parachutes?  Maybe the moon is really a melon and your shadow is a silent friend. The lyrical poems and luminous illustrations in this stellar collection will stretch readers' imaginations. Can you believe what you see?Illustrated by Steve Johnson and Lou Francher.",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "PUFFIN BOOKS",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Seduce Me in Dreams: A Three Worlds Novel",
        "Authors": "By Frank, Jacquelyn",
        "Description": "From the New York Times bestselling author of the Nightwalkers and Shadowdwellers series, Seduce Me in Dreams begins a sexy new futuristic series featuring an elite group of military heroes.   Dark. Mysterious. Sensual. When Bronse Chapel, the commander of a specialized unit of the Interplanetary Militia, begins to dream about a beautiful and exotic brunette, he wants to dismiss it as being induced by lack of sleep . . . or perhaps lack of sex. But his instincts tell him it’s something different, something far more dangerous.Ravenna is the leader of the Chosen Ones, a small group of people from her village born with extraordinary powers. She doesn’t know that draws her to Bronse’s dreams night after night, but she senses that he and his team are in jeopardy. Ravenna can help him, but first Bronse must save the Chosen Ones from those who plan to use their powers for evil. Together, Bronse and Ravenna will be unstoppable. But Ravenna is hiding something that could endanger them all.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Ground Force: Garden Handbook: Practical Advice and Projects from the Experts",
        "Authors": "By Titchmarsh, Alan, Dimmock, Charlie, and Walsh, Tommy",
        "Description": "This resource offers advice on maintaining a garden without letting it taking over your life. The book has sections allocated to each of the authors' specialities?Alan talks about plant choice and general care; Charlie deals with containers, ponds, and fountains; and Tommy looks after fences, furniture, and hard surfaces.",
        "Category": " Gardening , Techniques",
        "Publisher": "BBC Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "In the Footsteps of Robert E. Lee (In the Footsteps Series)",
        "Authors": "By Johnson, Clint",
        "Description": "",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "John F Blair Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The First Deadly Sin",
        "Authors": "By Lawrence Sanders",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Biscuit's Christmas Eve",
        "Authors": "By Young, Mary O'Keefe (ILT), Capucilli, Alyssa Satin, and Schories, Pat (ILT)",
        "Description": "Help Biscuit get ready for Santa in this lift-the-flap holiday adventure, featuring flaps that open to reveal exciting surprises!Biscuit gets ready for Santa's arrival in his newest gatefold book, with surprises under every flap!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Show me the Honey (Dr. Seuss/Cat in the Hat) (Step into Reading)",
        "Authors": "By Rabe, Tish and Moroney, Christopher (ILT)",
        "Description": "Where does honey come from? The Cat in the Hat knows that! It comes from bees, and what better way to learn about honey making than to visit inside a hive and see firsthand how it’s done? In this rhymed easy reader based on an episode from the new PBS Kids television show The Cat in the Hat Knows a Lot About That!, the Cat, Sally and Nick, and Things One and Two shrink to bee size and learn how bees communicate via dance, collect nectar and spit it into combs, turn it into honey, and seal the combs with wax.This is a sweet, funny Step into Reading book that kids will gobble up (without realizing they are ingesting an important natural-history lesson!).",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Black Hills Badlands the Web of the West (Natural World)",
        "Authors": "By Link, Mike",
        "Description": "",
        "Category": " Travel , United States , Midwest , General",
        "Publisher": "Voyageur Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Science and Health with Key to the Scriptures (Authorized, Study Edition)",
        "Authors": "By Eddy, Mary Baker",
        "Description": "Offers an insightful explanation of the spiritual teachings of the Bible. This book includes over one-hundred pages of letters from those who have experienced healing, hope, and comfort through reading and studying Mary Baker Eddy's message.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "The Christian Science Board of Directors",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Divine Soul Mind Body Healing and Transmission System: The Divine Way to Heal You, Humanity, Mother Earth, and All Universes",
        "Authors": "By Sha, Zhi Gang",
        "Description": "In 2006, Dr. Sha published his first major book on soul healing, in which he revealed this onesentence secret: Heal the soul first; then healing of the mind and body will follow. That book, Soul Mind Body Medicine, has already benefited hundreds of thousands of people worldwide. In 2009, the Divine further guided Dr. Sha to create the Divine Soul Mind Body Healing and Transmission System. This book gives you the soul secrets, wisdom, knowledge, and practices of this divine soul healing system. In this remarkable and uplifting guide to physical health, emotional wellness, and spiritual fulfillment, Dr. Sha reveals practical techniques to heal you, your loved ones, pets, relationships, finances, organizations, Mother Earth, and humanity. This divine soul healing system will teach you how to:  Remove soul, mind, and body blockages. Receive Divine Soul Mind Body Transplants. Invoke and practice with Divine Soul Mind Body Transplants. In addition, Dr. Sha shares deep secrets of traditional Chinese medicine and ancient philosophies and offers step-by-step exercises and easy tips for healing and rejuvenation. This book offers you the most powerful soul healing available at this time; it is truly a breakthrough divine gift and treasure for humanity.  The first printing offers readers a bonus soul symphony of ying yang CD. Subsequent printings offer readers a free download of this content.",
        "Category": " Body, Mind & Spirit , Healing , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Eyewitness Travel Guide to Istanbul",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "Especially strong on luscious color photos and maps, this pocket guide to Istanbul is quite comprehensive and authoritative in its information, providing a section-by-section account of the city and areas beyond, a brief history, where to eat, sleep, shop, and be entertained, and health and safety matters. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Travel , Europe , General",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "A Traveller's History of Turkey",
        "Authors": "By Stoneman, Richard",
        "Description": "",
        "Category": " History , Middle East , General",
        "Publisher": "Interlink Pub Group Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Royalty on horseback",
        "Authors": "By Campbell, Judith",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Proof Positive: How to Find Typos and Grammatical Errors Before They Embarrass You (Critical Education and Ethics) (Self-study sourcebook)",
        "Authors": "By Karen L. Anderson",
        "Description": "",
        "Category": "",
        "Publisher": "Skillpath Pubns Inc",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Historic Roadsides in New Jersey",
        "Authors": "By No Author",
        "Description": "",
        "Category": "",
        "Publisher": "Society of Colonial Wars",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1928"
        }
    },
    {
        "Title": "Dust for Dinner (I Can Read Book - Level 3)",
        "Authors": "By Barrett, Robert (ILT) and Turner, Ann Warren",
        "Description": "Jake and Maggy lived on a farm where they loved to sing and dance to the music from Mama's radio. Then terrible dust storms came and ruined the land. The family had no choice but to auction off the farm and make the long, hard journey west to California-away from the dust storms, where the land is still green.Along the way, Papa tries to find work, and Jake and Maggy try to help too. But what if Papa can't find a job? What if California isn't better after all?Ann Turner's dramatic story about the dust bowl, set during the Great Depression and beautifully captured in Robert Barrett's paintings, shows how one family stays together during difficult times.",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Chang's Paper Pony (I Can Read Level 3)",
        "Authors": "By Coerr, Eleanor and Ray, Deborah Kogan (ILT)",
        "Description": "It's the time of the gold rush, and Chang has come with his grandfather to California from China. Chang's dream is to own a horse of his own. With luck ... and a little gold dust ... that wish just might come true.",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Gold Fever! (Step into Reading, Step 4, paper) (Step into Reading. Step 3 Book)",
        "Authors": "By Eagle, Michael (ILT) and McMorrow, Catherine",
        "Description": "From the first discovery at Sutter's Mill to the vast influx of prospectors and others out to seek their fortune, an anecdotal easy-to-read account traces the history of the California Gold Rush. Simultaneous.",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Don't Drink Your Milk!",
        "Authors": "By Oski, Frank A.",
        "Description": "",
        "Category": "",
        "Publisher": "TEACH Services, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Albert Camus",
        "Authors": "By De Luppe, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Minerva Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Holy Bible-NIV",
        "Authors": "By Niv International",
        "Description": "",
        "Category": "",
        "Publisher": "American Bible Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "God Has a Dream for Your Life",
        "Authors": "By Walsh, Sheila",
        "Description": "It's never too late to remember who you are, it's never too late to dream big dreams and discover that God loves you in ways you cannot yet imagine.Do you dare believe in a God who wants to make your dreams come true? It seems like there is no time to dream these days. Yet the Bible is full of dreamers?those who exchanged their old dreams for new ones, and those who received unexpected dreams from God that changed the course of history. Best-selling author Sheila Walsh gives warm hearted stories of real people, interwoven with biblical insight, to help you discover God's dream for your life.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Wyoming Handbook: Including Yellowstone and Grand Teton National Parks, Third Edition",
        "Authors": "By Pitcher, Don",
        "Description": "",
        "Category": " Travel , United States , Midwest , East North Central (IL, IN, MI, OH, WI)",
        "Publisher": "Moon Travel Handbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Arabic Alphabet: How to Read & Write It",
        "Authors": "By Awde, Nicholas",
        "Description": "Ever larger numbers of people are starting to learn Arabic, while even more have some contact with the Arab world. Anyone who wishes to learn the language faces a hitherto formidable initial problem: the alphabet. This book proceeds step by step through all the letters of the Arabic alphabet, showing the sounds they stand for and how they are combined into words. Nothing essential is left out, but no unnecessary complications are added. Readers will find that progress is rapid and will be surprised at the relative ease with which they master the first steps in learning this increasingly important world language.The Arabic Alphabet: How to Read and Write It belongs on the desk of every student of the language, in the luggage of every visitor to the Middle East, in the briefcase of all business people with Arab clients, and in the back pocket of all employees of British or American companies working for a time in an Arab country.",
        "Category": " Foreign Language Study , Arabic",
        "Publisher": "Lyle Stuart",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Week That Led to Easter - Arch Books",
        "Authors": "By Williams, Jenny (ILT) and Larrison, Joanne",
        "Description": "Recounts in verse the events of Holy Week, from Jesus' entry into Jerusalem to Mary's meeting with Him outside the empty tomb.",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Concordia Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Collectible Glassware from the 40's, 50's, 60's: An Illustrated Value Guide",
        "Authors": "By Florence, Gene",
        "Description": "Provides information on the history and value of a wide variety of drinking glasses, plates, pitchers, vases, and related items from many different manufacturers",
        "Category": " Antiques & Collectibles , Glass & Glassware",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Miz Berlin Walks",
        "Authors": "By Yolen, Jane and Cooper, Floyd (ILT)",
        "Description": "Powerhouses Jane Yolen and Floyd Cooper come together to tell this heartwarming story of an unexpected friendship.Every evening, old as she is, Miz Berlin walks down the long block, past Mary Louise's house, talking to herself. One day Mary Louise catches up to Miz Berlin and walks with her. She is spellbound by the stories the old woman tells: block-long stories and two-day stories about how she caught crawdaddies the day the sky rained feathers, or about the day the flood rose right to her front door. Now every evening, Mary Louise walks with Miz Berlin, then runs on home, stuffed full of her own stories to tell.\"This poignant book conveys through simple words the power of stories to build bridges between two very different people.\"—Booklist \"Yolen is pitch-perfect in her delivery of this tender tale.\"—Publishers Weekly",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "PUFFIN BOOKS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Read for Me, Mama",
        "Authors": "By Rahaman, Vashanti and McElrath-Eslick, Lori (ILT)",
        "Description": "Thursday is library day, Joseph's favorite day at school. Joseph loves books, and Thursday the librarian lets him take two books home: an easy book that he can read by himself and a harder book that someone can read for him. Joseph would love nothing more than to have Mama read for him. But it seems that Mama is always too busy. Then after supper one Saturday night, Joseph takes his book to the rocking chair where Mama is sitting and asks her to read for him. Mama begins to cry. The Truth is that Mama doesn't know how to read. Vashanti Rahaman's compassionate story of how a mother and son face the challenge of literacy is told with warmth and sensitivity, while Lori McElrath-Eslick's bold and beautiful oil paintings light the pages with images of hope and love.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Boyds Mills Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Global Problems and the Culture of Capitalism (2nd Edition)",
        "Authors": "By Robbins, Richard H.",
        "Description": "This award-winning book explores one of the most successful cultures and society the world has ever seen-capitalism.  From its European roots more than 500 years ago to the present, the book examines the problems of capitalism's expansion, inequality, environmental destruction, and social unrest.  Global Problems and the Culture of Capitalism provides the reader with the anthropological, economic, and historical framework to understand the origins of global problems, why globalization and the global expansion of the culture of capitalism has generated protest and resistance, and the steps that are necessary to solve global problems. As one reviewer said, \"This is a book that will doubtless create debate and controversy, but its topic should be pondered seriously by all who consider themselves citizens of our world society today.\"  For anyone interested in global issues and international affairs.",
        "Category": " Social Science , Anthropology , General",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Beloved: A Novel",
        "Authors": "By Small, Bertrice",
        "Description": "The daughter of a powerful desert cheiftain, beautiful raven-haired Zenobia, a descendent of Cleopatra, witnesses at an early age the shocking brutality of renegade Roman soldiers and vows to hate all of the blue-eyed strangers forever. Despite that pledge, she falls hopelessly and passionately in love with Marcus Alexander Britanus, a Roman. And it will take all her cunning and skill in war to keep the precious erotic rapture she can find only in his arms....\"Bertrice Small creates cover-to-cover passion, a keen sense of history and suspense.\"PUBLISHERS WEEKLY",
        "Category": " Fiction , Romance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Dragonmaster (Dragon Master Trilogy)",
        "Authors": "By Bunch, Chris",
        "Description": "Hal Kailas was truly flying as the dragon dove for speed, then climbed high, banking, rolling. . . . Above were the moons and the stars, and below the world he had little use for. . . .    Hal is a runaway pauper in a kingdom where peace is uncertain. But long ago, he had the breathtaking experience of bonding with a young dragon, and the memory of the beast’s great strength and power consumes his thoughts and dreams.    When war comes, only the most daring and ruthless men will ride these fearsome dragons—monstrous weapons that rule the sky. Few men can bend a dragon’s will, but Hal believes he may be one of them. Squadrons of men will fly into battle on the fiercest creatures the world has ever seen, and Hal Kailas will be the greatest dragonmaster of them all.    “A vast and intricate tapestry woven by a writer who knows both history and war.”—David Drake, Author of the Lord of the Isles Series   “Slam-bang excitement, lusty action, and military magic . . . fast-paced and ferocious.”—Julian May, Author of The Many-Colored Land",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Traits of a Lasting Marriage",
        "Authors": "By Conway, Jim and Conway, Sally",
        "Description": "Respected marriage counselors Jim and Sally Conway identify 10 vital traits of thriving marriages including lifelong commitment, effective conflict resolution, energy from friends, sexual intimacy, time to laugh and play, realistic expectations, serving each other, and continued growth. Drawing on a survey of 186 couples, 35 years of experience in marriage counseling, and examples from their own marriage, they explore the importance of these traits. This popular resource for building lasting marriages presents updated information and compelling real-life stories.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Riyadh",
        "Authors": "By Guise, Anthony",
        "Description": "",
        "Category": "",
        "Publisher": "Intl Book Centre",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "HarperCollins Language Survival Guide: Italy: The Visual Phrasebook and Dictionary",
        "Authors": "By HarperCollins Publishers",
        "Description": "The HarperCollins Language Survival Guide covers every aspect of foreign travel: from traffic signs to menu items and bank machines, plus practical know-how such as how to weigh your own fruit in the supermarket and punch your ticket at the train station. The book also provides essential vocabulary and grammar.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Collins Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Christmas Gifts from the Kitchen",
        "Authors": "By Brennan, Georgeanne and Williams-Sonoma",
        "Description": "This Christmas, give friends and family something truly memorable, not to mention delicious: a special homemade treat. Whether sweet or savory, gifts from the kitchen are the ultimate personal presents, and beloved by all. This collection of enticing recipes, along with gorgeous photography and clever tips, will inspire your creativity over the holidays. You'll find time-tested favorites like Chewy Ginger-Molasses Cookies and Chocolate-Marshmallow Fudge as well as lighter sweets such as Key Lime Bars and Candied Grapefruit Peel. There are plenty of decadent savory items to choose from too, including Savory Herb Shortbread, Marinated Goat Cheese, and Lemon-Spice Olives. Along with recipes, there are lots of ideas for creative packaging to make your gifts extra special and personal.",
        "Category": " Cooking , Holiday",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Man Skills: Everything Men Need (or Just Want) to Know",
        "Authors": "By Harper, Nick",
        "Description": "For every man who has humiliated himself in public when asked to carve a turkey or fix a leaky faucet, this is the must-have guide to all those essential (and not-so-essential) man skills he never got around to learning.Written in a hilarious style, including illustrations for the trickiest maneuvers, Man Skills provides the answers to the questions most men are afraid to ask.-How to Start a Fire with Two Sticks-How to Beat a Hangover-How to Hit a Carnival Hammer (and Make the Bell Ring)-How to Tie a Bow Tie-How to Pass Yourself Off As Some Kind of Wine Buff-How to Blow a Smoke Ring-How to Undo a Bra Using Only One Hand-How to Survive in Prison-. . . and much, much more.The perfect guide for the manly man. . .or the man who needs a little help.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Sourcebooks Hysteria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Paradigms Of Clinical Social Work Vol. 2",
        "Authors": "By Dorfman, Rachelle A. (EDT)",
        "Description": "First published in 1999. Routledge is an imprint of Taylor & Francis, an informa company.",
        "Category": " Social Science , Social Work",
        "Publisher": "Routledge",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Success for Teens: Real Teens Talk About Using the Slight Edge",
        "Authors": "By John Fleming",
        "Description": "",
        "Category": "",
        "Publisher": "Success Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "King Solomon's Mines (Wordsworth Children's Classics)",
        "Authors": "By Haggard, H. Rider",
        "Description": "",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Wordsworth Editions Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Fast Talk Italian - Essential Language for Short Trips (Lonely Planet)",
        "Authors": "By Lonely Planet",
        "Description": "",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Claire of the Moon: One Woman's Journey into Her Sexual Identity : A Novel",
        "Authors": "By Conn, Nicole",
        "Description": "",
        "Category": "",
        "Publisher": "Naiad Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Golden Retrievers (Animal Planet® Pet Care Library)",
        "Authors": "By Boneham, Sheila Webster",
        "Description": "These hard-working and confident dogs are more than just great hunters--they are the ultimate family dog. This guide is the best resource for developing a stronger understanding of this breed and features detailed training suggestions. TFH Publications, Inc. has teamed up with Animal Planet, the only television network devoted to the unique bonds between humans and animals, to present an exciting new series of comprehensive guides to superior pet care. Each book in the Animal Planet Pet Care Library offers incredible value, featuring 112 pages of all-new, current information from pet care and animal experts—with a family-friendly design, over 60 full-color photographs, and helpful tip boxes. Also included is advice on feeding, housing, grooming, training, health care, and fun activities.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "TFH Publications, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Systems Analysis, Design, and Development With Structured Concepts",
        "Authors": "By Edwards, Perry",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Harcourt School",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Bible Research Made Easy",
        "Authors": "By Water, Mark",
        "Description": "From various translations of the Bible itself to the vast amount of information available on the internet, this full-color, 64 page book outlines and briefly explains the host of resources available for researching scriptures complex and sometimes confusing passages. A 7-panel fold-out surveys how to effectively use the internet for Bible study.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Hendrickson Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "When Harry Met Molly (Impossible Bachelors)",
        "Authors": "By Kramer, Kieran",
        "Description": "Dashing Lord Harry Traemore is perfectly content to live out his days in the pursuit of pleasure. But when he's named by the Prince Regent as one of society's \"Impossible Bachelors,\" Harry is drafted into a ribald romantic wager. The rules of engagement are scandalously simple: The bachelor whose mistress wins the title of \"Most Delectable Companion\" gets to remain unmarried. Harry is utterly unconcerned about his status...until his latest lightskirt abandons him.Enter Lady Molly Fairbanks. Harry's childhood friend-- actually, \"foe\" is more like it--is the most unlikely companion of all. She's attractive but hot-headed, and in no mood for games. Besides, what could the self-indulgent Harry possibly know about what makes a woman delectable? It's time for Molly to teach him a lesson once and for all...but will it lead to \"happily ever after\"?",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Blind Trust: A Novel",
        "Authors": "By Boxer, Barbara and Hayes, Mary-Rose",
        "Description": "Now married (to a Republican!) and in her second term, United States Senator Ellen Fisher (Democrat) is about to chair explosive hearings on Homeland Security. Before she goes head to head with the Vice President, whose excessive zeal in enforcing national security has begun to infringe on individual liberties, Ellen and her staff become the subjects of a barrage of charges and attacks that threaten their safety, as well as her career and marriage. This second novel by Senator Barbara Boxer is the story of dirty tricks and political survival, and the battle for integrity in the corridors of power. Combining the personal and the political, Blind Trust is an intriguing insider's view of what goes on behind closed doors in Washington, D.C.",
        "Category": " Fiction , Political",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Country Entertaining",
        "Authors": "By Ross, Pat and Morton, Keith Scott (PHT)",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Art of Watercolor",
        "Authors": "By Smith, Ray Campbell",
        "Description": "The basics, beautifully illustrated. Clear advice from an artist-teacher for those new to watercolor, on choosing materials, composition and perspective, color, tone, and solutions to specific problems. First published in Great Britain by David and Charles Publishers, 1993. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Keeping Good People: Strategies for Solving the Dilemma of the Decade",
        "Authors": "By Herman, Roger E.",
        "Description": "",
        "Category": "",
        "Publisher": "Oakhill Press",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Phantom of Pemberley: A Pride and Prejudice Murder Mystery",
        "Authors": "By Jeffers, Regina",
        "Description": "HAPPILY MARRIED for over a year and more in love than ever, Darcy and Elizabeth can’t imagine anything interrupting their bliss-filled days. Then an intense snowstorm strands a group of travelers at Pemberley, and terrifying accidents and mysterious deaths begin to plague the manor. Everyone seems convinced that it is the work of a phan-tom—a Shadow Man who is haunting the Darcy family’s grand estate. Darcy and Elizabeth believe the truth is much more menacing and that someone is trying to murder them. But Pem-berley is filled with family guests as well as the unexpected travelers—any one of whom could be the culprit—so unraveling the mystery of the murderer’s identity forces the newlyweds to trust each other’s strengths and work together.Written in the style of the era and including Austen’s romantic playfulness and sardonic humor, this suspense-packed sequel to Pride and Prejudice recasts Darcy and Elizabeth as a husband-and-wife detective team who must solve the mystery at Pemberley and catch the murderer—before it’s too late.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Ulysses Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Recipes from Historic America: Cooking & Traveling with America's Finest Hotels",
        "Authors": "By Bauer, Linda and Bauer, Steve",
        "Description": "From a wind-swept beach experience to a magnificent mansion on a wooded hillside to a serene lake setting, the rich fabric of America has been preserved and is available to diners in some of the best restaurants in America. This book combines stories from the past with enticing recipes and information for visiting or contacting the establishments.  This volume is an effort to help visitors, locals, and gourmands enjoy some of the finest food and the most interesting restaurants in the country.",
        "Category": " Travel , Food, Lodging & Transportation , Hotels, Inns & Hostels",
        "Publisher": "Bright Sky Press",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Special of the Day",
        "Authors": "By Fox, Elaine",
        "Description": "Writing with her trademark wit and humour, Elaine Fox brings us another wonderfully charming contemporary romance about a beauty who finally finds love that is more than just skin deep.Life can be difficult when you're stunningly beautiful. For Roxanne Rayeaux, a Sports Illustrated swimsuit model, beauty had its costs. Not only did she have to worry constantly about how she looked, but she was considered stupid by strangers. She became romantically involved with a man who turned out to be married. So Roxanne pitched the world of diets and philanderers and moved her orange cat, Cheeto (the closest she could come to that forbidden food) to Virginia to open a restaurant. She went looking for some peace and tranquillity and instead inherited the restaurant's contentious, but sexy bartender, Steve Serrano. An average joe most of his life, Steve cannot deny Roxanne's obvious physical charms but thinks she is stuck up and pretentious -- not his type. Roxanne, suspicious of Steve's motives after a rash of break-ins occurs at the restaurant and a string of bad publicity appears in the local gossip column, cannot let her guard down around him. Besides he's not her type. If only they weren't so darned attracted to each other...",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Ebb And Flo And The Greedy Gulls",
        "Authors": "By Simmons, Jane",
        "Description": "Ebb & Flo and their friend Bird are enjoying a peaceful day at the beach -- until Flo accuses Ebb of eating all the sandwiches. But Ebb didn't do it! Everyone is disappointed with Ebb, so she goes off by herself to sulk. It's so unfair! Children everywhere will relate to Ebb's sadness and frustration at being falsely accused. And readers will cheer when the real food thieves are discovered, and Ebb and Flo are reunited in a heartwarming and reassuring conclusion.  This is an enchanting picture book from the celebrated author/illustrator of Come Along, Daisy! and Ebb and Flo and the New Friend.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Margaret K. McElderry",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Seeing Redd: The Looking Glass Wars, Book Two",
        "Authors": "By Beddor, Frank",
        "Description": "Wonderland finally seems as if it’s getting back to normal. Queen Alyss is back on the throne, and reunited with her childhood sweetheart, Dodge. But the fight for Wonderland is far from over. King Arch, in nearby Boarderland, is conniving to overthrow everything for which Alyss and her friends have fought so hard. Even worse, King Arch has found an ally in the recently returned Redd, who has been biding her time and gathering new and evil assassins in the Catacombs of Paris. With enemies circling and danger looming, someone close to Alyss lets her down?and threatens the future of Wonderland forever.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Speak",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Stop Sitting on Your Assets: How to Safely Leverage the Equity Trapped in Your Home and Transform It Into a Constant Flow of Wealth and Security",
        "Authors": "By Snow, Marian",
        "Description": "Are you caught up in the financial thinking of the last century? That’s when we learned to buy a home and pay it off as quickly as possible. It made sense in the conditions that existed back then.  It doesn’t make sense today. In this new millennium, three unrelated events have converged creating new opportunities that will empower you to create a brighter financial future for yourself and your family.How would you like to · Safely leverage and compound assets you didn't realize you had? · Become your own bank and build family wealth? · Take in stock market gains, but never take the losses? · Lock-in a rich, secure and carefree retirement? · Transform the IRS into your wealth-building partner? · Create real wealth, empowering you to help others? · Get to your existing retirement funds with little or no taxes? · Leave a fortune for your heirs? STOP SITTING ON YOUR ASSETS makes these strategies crystal clear – and you can now apply them with security and ease.  If you own a home, you owe it to yourself to know about today’s new reality: You are sitting on a potential fortune that can safely and confidently be put to work to build a massively abundant financial future.  A future so rich that – before STOP SITTING ON YOUR ASSETS – could have only existed in your dreams.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Ethan Madison Publishing, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Disney's the Hunchback of Notre Dame (Little Golden Book)",
        "Authors": "By Walt Disney Company (COR), Korman, Justine, and Williams, Don (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Artist & Writers Guild Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Values for tomorrow's children;: An alternative future for education in the church,",
        "Authors": "By Westerhoff, John H.",
        "Description": "",
        "Category": "",
        "Publisher": "Pilgrim Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Erasers",
        "Authors": "By Alain Robbe-Grillet",
        "Description": "",
        "Category": "",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Say Goodnight (Oxenbury Board Books)",
        "Authors": "By Oxenbury, Helen",
        "Description": "An entertaining cast of playful toddlers prepares to go to bed, in a new version of a popular board book, complete with a newly designed cover, from the illustrator of We're Going on a Bear Hunt.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Sensational Soup Cookbook",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Mud Puddle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Ladies' Home Journal Adventures in Cooking",
        "Authors": "By Ferry, Preston",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice-Hall",
        "Price Starting With ($)": "19.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Mistress of Nothing: A Novel",
        "Authors": "By Pullinger, Kate",
        "Description": "The American debut of an award-winning novel about a lady’s maid’s awakening as she journeys from the confines of Victorian England to the uncharted far reaches of Egypt’s Nile Valley When Lady Duff Gordon, paragon of London society, departs for the hot, dry climate of Egypt to seek relief from her debilitating tuberculosis, her lady’s maid, Sally, doesn’t hesitate to leave the only world she has known in order to remain at her mistress’s side. As Sally gets farther and farther from home, she experiences freedoms she has never known—forgoing corsets and wearing native dress, learning Arabic, and having her first taste of romance. But freedom is a luxury that a lady’s maid can ill afford, and when Sally’s newfound passion for life causes her to forget what she is entitled to, she is brutally reminded she is mistress of nothing. Ultimately she must choose her master and a way back home—or a way to an unknown future. Based on the real lives of Lady Duff Gordon and her maid, The Mistress of Nothing is a lush, erotic, and compelling story about the power of race, class, and love",
        "Category": " Fiction , Romance , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Busy Airport: A LIft-the-Flap Learning Book",
        "Authors": "By Gabby Goldsack",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Modern Automotive Mechanics",
        "Authors": "By Duffy, James E.",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Goodheart-Willcox Pub",
        "Price Starting With ($)": "8.55",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Antigone (Methuen Drama, Methuen Student Edition)",
        "Authors": "By Bray, Barbara (TRN) and Anouilh, Jean",
        "Description": "'Anouilh is a poet, but not of words: he is a poet of words-acted, of scenes-set, of players-performing' Peter BrookJean Anouilh, one of the foremost French playwrights of the twentieth century, replaced the mundane realist works of the previous era with his innovative dramas, which exploit fantasy, tragic passion, scenic poetry and cosmic leaps in time and space. Antigone, his best-known play, was performed in 1944 in Nazi-controlled Paris and provoked fierce controversy. In defying the tyrant Creon and going to her death, Antigone conveyed to Anouilh's compatriots a covert message of heroic resistance; but the author's characterisaation of Creon also seemed to exonerate Marshal Petain and his fellow collaborators. More ambivalent than his ancient model, Sophocles, Anouilh uses Greek myth to explore the disturbing moral dilemmas of our times. Commentary and notes by Ted Freeman.",
        "Category": " Drama , General",
        "Publisher": "A & C Black (Publishers) Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Horses (DK Pockets)",
        "Authors": "By Alderton, David",
        "Description": "Describes the physical characteristics and behavior of horses, identifies wild and domestic breeds, and discusses riding and horse care.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "DK CHILDREN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Sherlock Q. Jones's Casebook of Puzzles, Riddles & Muddles",
        "Authors": "By Pinkney, John and Brailsford, Gillian (ILT)",
        "Description": "Presents a number of puzzles involving words, numbers, logic, and visual clues",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "I Shop With My Daddy (level 1) (Hello Reader)",
        "Authors": "By MacCarone, Grace and Brunkus, Denise (ILT)",
        "Description": "Father and daughter banter cheerfully up and down the grocery store aisles and finish up their shopping chores with a delicious treat, in an early reader story filled with playful rhymes. Original.",
        "Category": " Juvenile Fiction , Cooking & Food",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    }
]