[
    {
        "Title": "The Complete Idiot's Guide to Pregnancy & Childbirth, 2E",
        "Authors": "By Gliksman, Michele Isaacs, Digeronimo, Theresa Foy, and Glicksman, Michele Isaacs",
        "Description": "This easy-to-use month-to-month guide explains everything one needs to know to be an active participant in baby's development and birth. The Complete Idiot's Guide to Pregnancy and Childbirth, Second Edition, features sound advice on how to handle physical and emotional changes; idiot-proof steps for decorating a nursery; and down-to-earth advice on staying healthy.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "A Documentary History of Religion in America since 1865",
        "Authors": "By Morris, Leon",
        "Description": "Sermons, letters, and essays describe important events, movements, issues, and theological concepts that have developed in Judaism, Catholicism and Protestantism since the Civil War",
        "Category": "",
        "Publisher": "W.B. Eerdmans",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Too Beautiful for You: A Novel",
        "Authors": "By Liddle, Rod",
        "Description": "An ambitious fiction debut filled with lust, longing, and moral depravity.The tales in Too Beautiful for You, Rod Liddle’s dazzling debut, sweep readers into the lives of characters whose sexual frustrations and deviant desires lead them to the very edge of acceptable behavior—and sometimes way beyond.In a mischievous, macabre tale about a man who loses his arm in an accident on the way back from an assignation, Liddle shows just how far a husband will go to hide his infidelity from his wife. Another philandering husband, operating much closer to home, doesn’t let fleeting pangs of guilt curtail his hunger for the sexual treats proffered by his mother-in-law. Bizarre happenings are not confined to the sexually adventuresome: one woman notices that her skin is hardening into a sort of insect carapace after she uses a depilatory gel; a suicide bomber is forced to acknowledge his abysmal failure as a terrorist when he tries to blow up a Jewish art gallery with a package of trout; and a man planning to jump out a window finds some of his colleagues all too ready to assist him. Liddle presents his panoply of misfits and miscreants without passing judgment. The passions they harbor and the acts they commit may be shocking and scandalous, but Liddle shows that these hapless men and women are not so very different from the rest of us. Sharp-witted, sexy, and psychologically astute, Too Beautiful for You breaks through literary and social taboos with style and humor, reminiscent of the early work of Martin Amis.From the Hardcover edition.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.16",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Creating Web Pages For Dummies",
        "Authors": "By Smith, Bud E. and Bebak, Arthur",
        "Description": "The Web is the most sophisticated, most open, and simplest publishing medium ever created, an endless set of criss-crossing interconnections between an ever-growing number of points, and a community in the truest sense of the word. Your Web page can be your platform to say or show whatever you want to the millions of people with access to the global Internet. You can talk about yourself or your business. You can publish a short story or a collection of jokes. You can show pictures of your dog or of your company’s latest product. Your own imagination is the only limit to what you can put on the Web.If you've used the Web before and you're now ready to step out into the big wide online world with your own page, Creating Web Pages For Dummies, 6th Edition, is the place where you can nudge your wishes into reality. Without any previous experience (or painful technical instructions), you can get on track toTackling just enough HTML to format with the best of 'emIncorporating graphics, sound, and video into your pagesProviding links to other sitesPutting to good use Web publishing tools that can relieve your workloadDesigning and delivering pages that people will want to revisitInformative, educational, and just plain fun, Creating Web Pages For Dummies, 6th Edition, covers Web page topics from beginning through intermediate levels, including how toPut together a Web publishing planUse half a dozen different toolsPublish a Web page via Web-based services and the major online servicesExpand your page to a full Web siteAdd interactive features and invite feedbackKeep your page current and in good working orderThe revised and updated content in this edition also features the latest on building AOL and GeoCities pages, plus insight into adding the multimedia features that's amaze your visitors. The book includes a CD-ROM that's loaded with a variety of PC and Macintosh programs and demos – all the more for smooth sailing into having your own place on the Web!",
        "Category": " Computers , Web , Design",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "ASSISTANT",
        "Authors": "By Bernard Malamud",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Birth Of The Republic 1763-1789",
        "Authors": "By Morgan, Edmund S.",
        "Description": "",
        "Category": "",
        "Publisher": "The University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Arthur's Chicken Pox: An Arthur Adventure (Arthur Adventure Series)",
        "Authors": "By Brown, Marc Tolon",
        "Description": "Just when Arthur is looking forward to going to the circus, he comes down with the chicken pox. D.W. teases him about his spots, but she is actually jealous of all the extra attention Arthur is getting. Finally, on the day of the circus, Arthur is well enough to go, but D.W. wakes up with the spots she so badly wanted. Text copyright 2004 Lectorum Publications, Inc.",
        "Category": " Juvenile Fiction , Health & Daily Living , Diseases, Illnesses & Injuries",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Ideas That Changed The World",
        "Authors": "By Fernandez-Armesto, Felipe",
        "Description": "",
        "Category": " History , World",
        "Publisher": "DK Publishing, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "New Jerseys Historic Houses",
        "Authors": "By Groff, Sybil M.",
        "Description": "",
        "Category": "",
        "Publisher": "Oak Tree Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Ghirardelli Original Chocolate Cookbook",
        "Authors": "By Larsen, Phyllis",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Ghirardelli Chocolate Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "A Story of Deep Delight (Contemporary American Fiction)",
        "Authors": "By McNamee, Thomas",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Abiding Hope (Genesis House)",
        "Authors": "By Benson, Angela",
        "Description": "Award-winning author Angela Benson brings HeartQuest readers realistic characters, touching romance, and an inspirational faith plot. In this sequel toAwakening Mercy, Angela hits on the tough issues in life as a married couple struggles to rekindle their lost romance.",
        "Category": " Fiction , Psychological",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Antigone (French Language Edition)",
        "Authors": "By Anouilh, Jean",
        "Description": "",
        "Category": " Drama , European , General",
        "Publisher": "Table Ronde (Educa Books)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1946"
        }
    },
    {
        "Title": "The Treble Clef",
        "Authors": "By Booth, Edward C.",
        "Description": "",
        "Category": "",
        "Publisher": "Dodd, Mead and Company",
        "Price Starting With ($)": "19.23",
        "Publish Date": {
            "Month": "January",
            "Year": "1924"
        }
    },
    {
        "Title": "The Maryland line in the Confederate Army, 1861-1865",
        "Authors": "By Goldsborough, W. W",
        "Description": "",
        "Category": "",
        "Publisher": "Butternut Press",
        "Price Starting With ($)": "82.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Fifty Seventh Regiment of Massachusetts Volunteers in the War of the Rebellion Army of the Potomac ",
        "Authors": "By Captain John Anderson",
        "Description": "",
        "Category": "",
        "Publisher": "E. B. Stillings ",
        "Price Starting With ($)": "66.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1896"
        }
    },
    {
        "Title": "Dubious Honors",
        "Authors": "By Fisher, M. F. K.",
        "Description": "Bringing together twenty of the author's prefaces to books by other writers and fifteen to her own, this volume collects a variety of observations on life, art, travel, food, and drink",
        "Category": " Fiction , General",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Never Call Retreat: Lee and Grant: The Final Victory",
        "Authors": "By Gingrich, Newt, Forstchen, William R., and Hanser, Albert S.",
        "Description": "New York Times bestselling authors Newt Gingrich and William R. Forstchen conclude their inventive trilogy with this remarkable answer to the great “what if” of the American Civil War: Could the South have indeed won? After his great victories at Gettysburg and Union Mills, General Robert E. Lee’s attempt to bring the war to a final conclusion by attacking Washington, D.C., fails. However, in securing Washington, the remnants of the valiant Union Army of the Potomac, under the command of the impetuous General Dan Sickles, is trapped and destroyed. For Lincoln there is only one hope left: that General Ulysses S. Grant can save the Union cause. It is now August 22, 1863. Lincoln and Grant are facing a collapse of political will to continue the fight to preserve the Union. Lee, desperately short of manpower, must conserve his remaining strength while maneuvering for the killing blow that will take Grant’s army out of the fight and, at last, bring a final and complete victory for the South. Pursuing the remnants of the defeated Army of the Potomac up to the banks of the Susquehanna, Lee is caught off balance when news arrives that General Ulysses S. Grant, in command of more than seventy thousand men, has crossed that same river, a hundred miles to the northwest at Harrisburg. As General Grant brings his Army of the Susquehanna into Maryland, Robert E. Lee’s Army of Northern Virginia maneuvers for position. Grant first sends General George Armstrong Custer on a mad dash to block Lee’s path toward Frederick and with it control of the crucial B&O railroad, which moves troops and supplies. The two armies finally collide in Central Maryland, and a bloody week-long battle ensues along the banks of Monocacy Creek. This must be the “final” battle for both sides. In Never Call Retreat, Newt Gingrich and William Forstchen bring all of their critically acclaimed talents to bear in what is destined to become an immediate classic.",
        "Category": " Fiction , Historical",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Greyhounds of the Sea - The Story of the American Clipper Ship",
        "Authors": "By Cutler, Carl C",
        "Description": "",
        "Category": "",
        "Publisher": "Halcyon House",
        "Price Starting With ($)": "93.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1930"
        }
    },
    {
        "Title": "Circus Parades: A Pictorial History of America's Greatest Pageant",
        "Authors": "By Charles Philip Fox",
        "Description": "",
        "Category": "",
        "Publisher": "Century House",
        "Price Starting With ($)": "24.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Glen Cooper Henshaw",
        "Authors": "By Louise Heritage and Warren Wilmer Brown",
        "Description": "",
        "Category": "",
        "Publisher": "The Monumental Press",
        "Price Starting With ($)": "29.69",
        "Publish Date": {
            "Month": "January",
            "Year": "1945"
        }
    },
    {
        "Title": "Furniture in Maryland, 1740-1940: The Collection of the Maryland Historical Society",
        "Authors": "By Maryland Historical Society",
        "Description": "",
        "Category": "",
        "Publisher": "Maryland Historical Society",
        "Price Starting With ($)": "49.47",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Seven Little Sisters Who Live on the Round Ball That Floats in the Air",
        "Authors": "By Jane Andrews",
        "Description": "",
        "Category": "",
        "Publisher": "Ticknor and Fields",
        "Price Starting With ($)": "24.73",
        "Publish Date": {
            "Month": "January",
            "Year": "1861"
        }
    },
    {
        "Title": "A Few Good Neighbors",
        "Authors": "By Henry Shute",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday, Page & Co.",
        "Price Starting With ($)": "16.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1906"
        }
    },
    {
        "Title": "Mary Hunt's the Complete Cheapskate: How to Get Out of Debt, Stay Out, and Break Free from Money Worries Forever",
        "Authors": "By Hunt, Mary",
        "Description": "",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Rescue (The English Garden Series #2)",
        "Authors": "By Wick, Lori",
        "Description": "",
        "Category": " Fiction , Religious",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Canaries (Complete Pet Owner's Manuals)",
        "Authors": "By Frisch, Otto Von and Anders, Uwe (PHT)",
        "Description": "How to purchase, house, feed, train, care for, pair and breed these delightful songsters from the Canary Islands. Vital information on the three distinct categories of canary breeds is included. Twenty-five full-color photos and 35 black and white drawings.",
        "Category": " Pets , Birds",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The American Museum of Natural History guide to shells--land, freshwater, and marine, from Nova Scotia to Florida",
        "Authors": "By Emerson, William K.",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Healing the Hurt in Your Marriage",
        "Authors": "By Rosberg, Gary and Rosberg, Barbara",
        "Description": "All marriage relationships face hurts and conflicts on several levels, but not many of us know how to deal with them effectively—so we don't. Healing the Hurt in Your Marriage walks couples through a very manageable step-by-step process of understanding different styles of conflict resolution and then encourages them toward forgiveness and healing.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Living Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Heat of the Moon (Rachel Goddard Mysteries)",
        "Authors": "By Parshall, Sandra",
        "Description": "Young veterinarian Rachel Goddard's world begins to crumble when a client rushes into the animal hospital with a basset hound struck by a car during a thunderstorm. The dog owner's terrified tot, drenched with rain, loses sight of her mother in the flurry of activity and screams, \"\"Mommy! I want Mommy!\"\" Instantly Rachel is hurled back in time to a day in her own childhood when her baby sister Michelle uttered the same cry while thunder crashed and rain poured down on them. The unearthed memory feels like a fragment from a nightmare, and Rachel doesn't understand its meaning or the anguish it stirs up in her. When she seeks answers she learns nothing from Michelle or from Judith, their loving but manipulative mother. Judith is a psychologist who is only too happy to have her adult daughters still living in her elegant Tudor house outside Washington, DC. But their apparently serene home is a house of secrets where Judith's unspoken rules forbid questions about the family history or the daughters' long-dead father. As more baffling memories surface, Rachel begins to suspect that nothing about her family is what it seems. Fighting her mother's attempts to control her, Rachel embarks on a quest that takes her deep into her own memory as well as halfway across the country. The heartbreaking truth she uncovers will shatter her world and force her to make an unthinkable choice. The Heat of the Moon is Sandra Parshall's first novel.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Poisoned Pen Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Sampler of Wayside Herbs: Rediscovering Old Uses for Familiar Wild Plants",
        "Authors": "By Pond, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Greenwich House",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Good Driving, Amelia Bedelia (An Avon Camelot Book)",
        "Authors": "By Sweat, Lynn (ILT), Parish, Herman, and Sweat, Lynn (PHT)",
        "Description": "The long -awaited return of a beloved children's book character, as Peggy Parish's nephew continues the adventure of the hilariously literal-minded maid. A series of hilarious misunderstandings occur when Mr. Rogers agrees to teach Amelia Bedelia to drive. \"It's a pleasure to welcome [Amelia Bedelia] back...Herman Parish is a worth y successor o peggy parish\"-BCCB",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "GreenWilBk",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Supertot: Creative Learning Activities for Children One to Three and Sympathetic Advice for Their Parents",
        "Authors": "By Marzollo, Jean",
        "Description": "Suggests personal, noncompetitive learning activities designed to help children develop their skills, curiosity, creativity, agility, and interest in every area of their lives",
        "Category": " Education , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Domestic Sources of American Foreign Policy: Insights and Evidence",
        "Authors": "By Kegley, Charles W. and Wittkopf, Eugene R. (EDT)",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "6.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Designing Business: Multiple Media, Multiple Disciplines",
        "Authors": "By Mok, Clement",
        "Description": "",
        "Category": "",
        "Publisher": "Adobe Pr",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Yes, You Can Become A Successful Income Investor!: Reaching For Yield In Today's Market",
        "Authors": "By Stein, Benjamin and Demuth, Phil",
        "Description": "Shows the baby boomer and those in retirement communities how to safely secure the highest possible yield from investments through fixed-income securities such as bonds, real estate investment trusts, and preferred stocks, despite the downward trend of returns in the investment market.  25,000 first printing.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Hay House Inc.",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The little book of Etiquette: Tips on socially correct dining",
        "Authors": "By Long, Sheila M",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Nobles",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "ASPCA Complete Guide to Dogs (Aspc Complete Guide to)",
        "Authors": "By Gerstenfeld, Sheldon L., Schultz, Jacque Lynn, and American Society for the Prevention of Cruelty to Animals (COR)",
        "Description": "The ultimate resource for dog lovers, the ASPCA Complete Guide to Dogs is the authoritative volume on selecting and caring for any kind of dog. In the ASPCA tradition, this book has a strong focus on mixed breedsa major difference from most other dog books, which describe only purebreds. At over 500 pages with more than 650 illustrations and photos, this guide covers everything dog owners need to know to give their dog the best possible care at every stage of life, including advice on bathing and grooming, training and exercise, and the special needs of puppies and older dogs. For anyone thinking about getting a dog or seeking to understand the one they have, this lively book is the place to turn for trustworthy information on all canine matters.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Fifty Reasons Why Jesus Came to Die",
        "Authors": "By Piper, John",
        "Description": "Bestselling author John Piper explores fifty things that Jesus accomplished through his death on the cross.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Crossway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Complete Book of Duplicate Bridge",
        "Authors": "By Kay, Norman",
        "Description": "",
        "Category": " Games , Card Games , Bridge",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1969"
        }
    },
    {
        "Title": "How a Man Prays for His Family (Lifeskills for Men)",
        "Authors": "By Yates, John W. and Hazard, David (EDT)",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Caps for Sale: A Tale of a Peddler, Some Monkeys and Their Monkey Business",
        "Authors": "By Slobodkina, Esphyr",
        "Description": "",
        "Category": "",
        "Publisher": "Weekly Reader Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Sixth Sense: The Whole-Brain Book of Intuition, Hunchies, Gut Feelings, and Their Place in Your Everyday Life",
        "Authors": "By Nadel, Laurie",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Writing Smarts: A Girl's Guide to Writing Great Poetry, Stories, School Reports, and More!",
        "Authors": "By McGuinness, Tracy (ILT) and Madden, Kerry",
        "Description": "A companion title to School Smarts shows girls how to use words effectively in creative writing and in their schoolwork, with topics including how to find their voice, create characters, and tackle research papers. Original. 65,000 first printing.",
        "Category": " Young Adult Nonfiction , Language Arts , Composition & Creative Writing",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The River in Winter",
        "Authors": "By Small, David",
        "Description": "Joe Weatherfield's grandfather Henry shoots a German boy in France during World War I and Joe recalls how that one bullet \"travels on,\" setting off a series of tragedies that affect three generations of Weatherfields",
        "Category": " Fiction , Literary",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "NYT BRIDGE SERIES: GRAND SLAM (New York Times Bridge Series)",
        "Authors": "By Truscott, Alan F.",
        "Description": "Bridge essays cover openings, planning, finesse, deceptions, bidding, and other aspects of achieving a grand slam, and includes some freak hands",
        "Category": "",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "Making Birdhouses & Feeders",
        "Authors": "By Self, Charles R.",
        "Description": "Construct 41 different kinds of birdhouses, feeders, birdbaths, and nesting boxes. Includes house designs for all popular birds, even a table for hole sizes! “Simple procedures that will produce a variety of birdhouse types.”—Popular Woodworking. “Well within the range of even the novice.”—Booklist.",
        "Category": " Crafts & Hobbies , Woodwork",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "U.S. Military Museums, Historic Sites & Exhibits",
        "Authors": "By Thompson, Bryce D.",
        "Description": "",
        "Category": "",
        "Publisher": "Military Living",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "The Man with the Twisted Lip and the Adventure of the Devil's Foot (Penguin 60s)",
        "Authors": "By Doyle, Arthur Conan, Sir",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "A Passion for Books",
        "Authors": "By Rabinowitz, Harold",
        "Description": "",
        "Category": "",
        "Publisher": "Random House~trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "A Consumer's Guide to Hope: Where to Find It and How to Keep It",
        "Authors": "By O'Lill, Ruth",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Are Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Lonely Planet Edinburgh (Edinburgh, 1st ed)",
        "Authors": "By Smallman, Tom",
        "Description": "A guide to the city features walking tours, accommodation and eating options, shopping advice, and information on historic sites and festivals",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Critical: What We Can Do About the Health-Care Crisis",
        "Authors": "By Daschle, Thomas, Greenberger, Scott S. (CON), and Lambrew, Jeanne M. (CON)",
        "Description": "A much-needed and hard-hitting plan, from one of the great Democratic minds of our time, to reform America’s broken health-care system. Undoubtedly, the biggest domestic policy issue in the coming years will be America’s health-care system.  Millions of Americans go without medical care because they can’t afford it, and many others are mired in debt because they can’t pay their medical bills. It’s hard to think of another public policy problem that has lingered unaddressed for so long. Why have we failed to solve a problem that is such a high priority for so many citizens?      Former Senate Majority Leader Tom Daschle believes the problem is rooted in the complexity of the health-care issue and the power of the interest groups—doctors, hospitals, insurers, drug companies, researchers, patient advocates—that have a direct stake in it. Rather than simply pointing out the major flaws and placing blame, Daschle offers key solutions and creates a blueprint for solving the crisis.       Daschle’s solution lies in the Federal Reserve Board, which has overseen the equally complicated financial system with great success.  A Fed-like health board would offer a public framework within which a private health-care system can operate more effectively and efficiently—insulated from political pressure yet accountable to elected officials and the American people. Daschle argues that this independent board would create a single standard of care and exert tremendous influence on every other provider and payer, even those in the private sector.      After decades of failed incremental measures, the American health-care system remains fundamentally broken and requires a comprehensive fix.  With his bold and forward-looking plan, Daschle points us to the solution.",
        "Category": " Political Science , Public Policy , Social Policy",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Joy of Ice Cream",
        "Authors": "By Klein, Matthew",
        "Description": "Features more than one hundred recipes for diverse flavors of ice cream, as well as for such treats as sundaes, parfaits, and sodas, and includes tips on mixing flavors, comparisons of commercial ice cream brands, and more",
        "Category": " Cooking , Specific Ingredients , Dairy",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Self-Working Table Magic: 97 Foolproof Tricks with Everyday Objects (Dover Magic Books)",
        "Authors": "By Fulves, Karl",
        "Description": "The quickest, most certain path toward achieving a reputation as a magician is to be able to perform at a moment's notice with borrowed objects. If you are handed a coin, handkerchief, pencil, or rubber band, you should be able to do at least one amazing trick with that object. This book deals exclusively with just such tricks. It is a collection of some of the best tricks with ordinary objects.The approach throughout the book is simple. No unusual dexterity, gimmicks, or special sleights are required. The only props needed are simple, everyday objects — eggs, cards, dice, rubber bands, balloons, apples, whisk brooms, etc. Nor are long hours of practice necessary. Step-by-step instructions and over 180 helpful illustrations insure quick and effective mastery of each trick. Nearly 100 tricks in 10 categories include Money Magic, Elastic Illusions, Magic Show in a Matchbox, Hanky Panky, Dice Dexterity, Close-up Illusions, Conjuror's Collection, The Linking Pins, Psychic Tricks, and Pen-Ultimate MagicSome chapters have been designed to provide the reader with a complete act of close-up magic. For example, the chapter entitled \"Magic Show in a Matchbox,\" gives you about 15 minutes of excellent tricks and stunts to amaze and amuse your audience. Master the tricks in this book and you will be ready to entertain anytime, anywhere, with some of the finest of all close-up mysteries.Karl Fulves, one of the most renowned modern writers in the field of magic, has selected these tricks from both old and new magic stunts. Some are classic feats of time-tested wizardry, while others are new and inventive techniques. All, however, are easy-to-learn, foolproof routines that will enable you to dazzle and delight your audience.",
        "Category": " Games , Magic",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "Under Two Flags: The American Navy in the Civil War",
        "Authors": "By Fowler, William M.",
        "Description": "",
        "Category": " History , Military , Naval",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Mathematical teasers (Barnes & Noble everyday handbooks, no. 230)",
        "Authors": "By Mira, Julio A",
        "Description": "Unusual puzzles, problems, riddles and tricks, with their solutions, to challenge and entertain the mathematician and layman alike",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Hidden Falls",
        "Authors": "By Danziger, Carla",
        "Description": "",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "iUniverse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The New Illustrated Guide to the American Economy: 100 Key Issues",
        "Authors": "By Stein, Herbert and Foss, Murray",
        "Description": "",
        "Category": "",
        "Publisher": "American Enterprise Institute Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "100 Great Monologues from the Neo-Classical Theater (Monologue Audition Series)",
        "Authors": "By Beard, Jocelyn A. (EDT)",
        "Description": "A collection of monologues from seventeenth and eighteenth century authors, including Racine, Corneille, John Dryden, William Congreve, Oliver Goldsmith, George Farquhar, and Henry Fielding.",
        "Category": " Performing Arts , Acting & Auditioning",
        "Publisher": "Smith & Kraus",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "More Studio Tips for Artists and Graphic Designers",
        "Authors": "By Gray, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold Inc.,U.S.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Rumpole and the Golden Thread",
        "Authors": "By Mortimer, John",
        "Description": "Rumpole handles cases involving forgery, foreign politics, prostitution, and murder, and helps a new woman barrister get her start",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Rumpole for the Defence",
        "Authors": "By Mortimer, John Clifford",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Putnam~mass",
        "Price Starting With ($)": "13.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Rumpole of the Bailey",
        "Authors": "By Mortimer, John Clifford",
        "Description": "Horace Rumpole, an English barrister, in dealing with cases of robbery, drug-peddling, rape, divorce, and murder, must often use his sly insight and years of experience to uncover the truth",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking Pr",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "Cross Stitch Samplers (Better Homes and Gardens)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Thoreau",
        "Authors": "By Canby, Henry Seidel",
        "Description": "",
        "Category": "",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "The Burned-Over District: The Social and Intellectual History of Enthusiastic Religion in Western New York, 1800-1850",
        "Authors": "By Cross, Whitney R.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper Torchbooks",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "True Stories: Girls' Inspiring Stories of Courage and Heart (American Girl Library)",
        "Authors": "By Magruder, Trula (EDT), Payette, Shannon (EDT), Watkins, Michelle (EDT), and Haley, Amanda (ILT)",
        "Description": "In real-life tales of bravery, girls from throughout the United States describe helping others, natural disasters, friendships, emergency rescues, overcoming problems, and their heroes. Original.",
        "Category": " Juvenile Nonfiction , Social Issues , General",
        "Publisher": "Amer Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Cry Out Paper-Rights Reverted",
        "Authors": "By Quinn, Phil E.",
        "Description": "A graphic account of the abuse, brutality, and degradation suffered by one child, as told from that child's point of view",
        "Category": " Religion , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Lessons in Loyalty: How Southwest Airlines Does It - An Insider's View",
        "Authors": "By Grubbs West, Lorraine",
        "Description": "",
        "Category": " Philosophy , General",
        "Publisher": "CornerStone Leadership Institute",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Common Sense on Weapons of Mass Destruction",
        "Authors": "By Graham, Ambassador Thomas, Jr.",
        "Description": "Ambassador Graham gets past the political buzzwords to define what he believes to be the real issues of WMDs. These include the lack of basic information about what WMDs are and can do and how US policies influence their creation, stockpiling and use. He asserts that the US needs to re-assume leadership of efforts to reduce or eliminate WMD stockpiles and opportunities for use. He also believes recent US policies undermine international treaties that have, so far, kept down distribution of WMDs. He notes in particular the lack of support of the Nuclear Non-Proliferation Treaty (NPT) by the US, and how failure of the NPT will turn the lack of control of Russian nuclear material into a major disaster. Graham also believes not enough is being done to reduce the risks of WMD use or sale by volatile states such as Syria, Egypt, Iran, Israel, India, Pakistan and Libya, and that North Korea's nuclear weapons and programs are particularly dangerous. He contrasts the actions of these so-called \"rogue states\" with the assertions of the US, Britain, France, and Russia that they have the right to use nuclear weapons regardless of their signing the NPT. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , International Relations , Arms Control",
        "Publisher": "University of Washington Press",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Carsick Zebra and Other Animal Riddles",
        "Authors": "By Adler, David A. and dePaola, Tomie",
        "Description": "Sixty animal riddles, some of which are original, are enhanced by humorous illustrations.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Understanding Einstein's Theories of Relativity: Man's New Perspective on the Cosmos",
        "Authors": "By Gibilisco, Stan",
        "Description": "\"The style is very clear and concise, and the treatment is authoritative throughout.\" — ChoiceRelativity remains a topic of crucial interest for scientists grappling with its implications for physics, astronomy, cosmology, and other disciplines. Laymen, too, are fascinated by relativity theory, which overturned the classical order of Newtonian physics and postulated ideas about space and time that often seem to contradict common sense.The present work is a very clear, concise, and authoritative exposition of both the special and general theories of relativity. Intended for nonscientific readers with a knowledge of high school math, the book offers illuminating coverage of such topics as the speed of light, simultaneity, time distortion of space and mass, journeys to the stars, dimension and hyperspace, the theory of general relativity, anomalies in space, and the structure and evolution of the universe.Readers with an inquisitive bent for cosmic affairs will enjoy this mind-stretching journey into the mysteries and majesty of the physical universe, where they'll share the author's explanations and speculations about why the speed of light is the speed of time, whether it may be possible to travel backward in time, how black holes are formed, how it is possible that space is curved, and much more. For anyone curious about the nature of the universe and how relativity theory continues to help scientists unlock its secrets, this accessible popular treatment is an invaluable companion and guide.",
        "Category": " Mathematics , Geometry , Non-Euclidean",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Total Massage",
        "Authors": "By Hofer, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Potted Gardens: A Fresh Approach to Container Gardening",
        "Authors": "By Cole, Rebecca and Felber, Richard (PHT)",
        "Description": "Rebecca Cole--once an actress/activist and now the owner of the trend-setting Greenwich Village store Potted Gardens--introduces a whole new way to garden. Using any container--from the bed of a toy truck to a bedpan--and any kind of plant--from rose to weed--would-be gardeners can follow Rebecca's guidance and plant a bit of beauty in a corner of their homes or gardens.Starting at the beginning--what a garden means to urban dwellers and their country cousins and how to stimulate your own imagination--she then helps us hunt for plants at neighborhood nurseries and markets (which she advocates over catalogue shopping); gather containers from dumps, attics, flea markets, and antiques stores; and put it all together in potted gardens for windowsill, desk, and patio. In a chapter on terraces, she turns to the great outdoors, explaining the design and creation of complete gardens made up of  containers, artfully arranged to make the most of small spaces. And all along the way she shares her own experiences with breaking all the rules to achieve ebullient flowering displays.With nearly 200 spectacular photographs, illustrated step-by-step instructions on how to plant in wooden boxes, metal containers, and how to plant bulbs; tips on maintaining a finished potted garden; suggestions on further reading; and a glossary--Potted Gardens is the everyday companion for the new and experienced container gardener alike.Rebecca Cole is the proprietor of one of New York City's most talked-about shops, Potted Gardens, where she mixes well-loved antiques (and old sinks and watering cans) with flowers and plants. She has made appearances on \"Our Home\" and \"Home Matters\" and is a regular guest on \"Fox After Breakfast.\" Her work has been featured in Architectural Digest, Travel and Leisure, House Beautiful, the New York Times, and Victoria, among others. She lives in New York City.Richard Felber has been photographing America's gardens for two decades. Among the many magazines that have published his work are House Beautiful, Garden Design, and New York magazine. This is his first book. He lives in Connecticut.Grab a pot, a wooden box, or a tin can; gather your bulbs and flowers; and read Rebecca Cole's Potted Gardens for a whole new way to look at gardening.",
        "Category": " Gardening , Container",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Memory Bible: An Innovative Strategy for Keeping Your Brain Young",
        "Authors": "By Small, Gary W.",
        "Description": "Clear, concise, prescriptive steps for improving memory loss and keeping the brain young -- from one of the world's top memory experts. Everybody forgets things sometimes -- from your keys to your lunch date to the name of an acquaintance. According to Dr. Gary Small, the director of the UCLA Center on Aging, much of this forgetfulness can be eliminated easily through his innovative memory exercises and brain fitness program -- now available for the first time in a book. Using Small's recent scientific discoveries, The Memory Bible can immediately improve your mental performance. One of the ten commandments that Dr. Small has pioneered to improve your memory immediately is LOOK, SNAP, CONNECT: 1: LOOK: actively observe what you want to learn2: SNAP: create a vivid snapshot and memorable image3: CONNECT: visualize a link to associate images In addition, Dr. Small's comprehensive program includes a \"brain diet\" of memory-enhancing foods and a list of the most effective drugs, as well as a workbook with a weekly and daily calendar. Remember, as Dr. Small says, \"Great memories are not born, they are made.\"",
        "Category": " Self-help , Personal Growth , Memory Improvement",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Every Good Boy Deserves Favor and Professional Foul: Two Plays",
        "Authors": "By Stoppard, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "GROVE PRESS * (NY)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Finding a Mentor, Being a Mentor: Sharing Our Lives as Women of God",
        "Authors": "By Otto, Donna",
        "Description": "Helping women share the joys and pains of everyday life, mentoring provides a venue for discussing effective strategies for navigating the demands of being a wife, mother, friend, and businesswoman. Mentoring helps women--Understand  God's unique purpose for their lives Makes better use of time, skills, and spiritual gifts Cultivates a stronger faith and trust in God Donna shows how to develop and nourish a mentoring relationship that will produce abundant spiritual fruit. (Condensed from Between Women of God and The Gentle Art of Mentoring.)",
        "Category": " Religion , Christian Ministry , Discipleship",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Van Cortlandt Manor (A Sleepy Hollow Restorations guidebook)",
        "Authors": "By Butler, Joseph T.",
        "Description": "",
        "Category": "",
        "Publisher": "Sleepy Hollow Press",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1978"
        }
    },
    {
        "Title": "NATO and the Future of European Security (Europe Today)",
        "Authors": "By Kay, Sean",
        "Description": "Tracing NATO's formative years, its Cold War development, and its postDCold War evolution, Sean Kay draws on his policy experience in Brussels and Washington to provide unique insights into contemporary policy challenges, including NATO's outreach to the East and its Partnership for Peace, peacekeeping and the future of the Balkans, enlargement and the role of Russia in Europe, NATO's internal military adaptation, and the future of the transatlantic relationship. Kay argues that although NATO has evolved to some degree, it remains an institution dependent upon the United States with uncertain long-term prospects for playing a constructive role in Europe. Indeed, the author shows that if not implemented carefully, NATO enlargement may actually decrease rather than increase stability in the region.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "6.53",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Euro-Politics: Institutions and Policymaking in the \"New\" European Community",
        "Authors": "By Sbragia, Alberta B. (EDT)",
        "Description": "Europe 1992, the market integration of the twelve European Community (EC) member states, has attracted widespread attention as an economic project of enormous importance. But though journalists and scholars have focused much attention on the economic aspects of Europe 1992, the program's impact on the governance of the EC has been largely ignored—even though the creation of a single market is intimately linked to changes in governance.With each member state having a very different institutional structure, the variation within the EC is far greater than that found in federations such as the United States. Though this variety adds to the complexity of consensus building among the members, it allows effective representation of diverse national interests and needs, thus making the EC a very strong, competitive force. To negotiate effectively with this \"new\" Community, international policymakers will need a greater understanding of how the EC will operate in the wake of the Maastricht Summit.Euro-Politics examines various aspects of the institutional dynamics of the EC and offers important insight into policy making within the Community. David Cameron discusses the origin of the 1992 program and examines the role of the nation-state in the Community. Guy Peters surveys the \"political\" and executive institutions, while Martin Shapiro discusses the European Court of Justice and the evolution of judicial review within the Community. John Woolley examines the European Monetary System and the movement  toward the \"EuroFed,\" Gary Marks studies the importance of the Regional Funds for both the EC and selected member states, and Peter Lange discusses the Social Charter and its implications for  both employers and unions. Alberta Sbragia concludes with an analysis of institutional dynamics and policymaking with the Community in light of the new questions they raise for traditional notions of governance.",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "Brookings Inst Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Your Visit To The Louvre",
        "Authors": "By Valerie Mettais",
        "Description": "",
        "Category": "",
        "Publisher": "ART LYS",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Wiser in Battle: A Soldier's Story",
        "Authors": "By Phillips, Donald T. and Sanchez, Ricardo S.",
        "Description": "Amid all of the criticisms of America's war in Iraq, one essential voice has remained silent—until now. In his groundbreaking new memoir, Wiser in Battle, Lieutenant General Ricardo S. Sanchez, former commander of coalition forces in Iraq, reports back from the front lines of the global war on terror to provide a comprehensive and chilling exploration of America's historic military and foreign policy blunder.With unflinching candor, Sanchez describes the chaos on the Iraqi battlefield caused by the Bush administration's misguided command of the military, as well as his own struggle to set the coalition on the path toward victory. Sanchez illuminates the fallout of the communication breakdown between the leadership on the front and the politicians in Washington, revealing fractious discussions he had with, among others, Ambassador Paul Bremer and Defense Secretary Donald Rumsfeld.Drawing on his tenure on the ground, Sanchez shows how minor insurgent attacks grew into synchronized operations that finally ignited into a major insurgency and all-out civil war. He provides an insider's account of the Abu Ghraib prison scandal, explaining the circumstances that led to the abuses, who perpetrated them, and what the formal investigations revealed—all the while reflecting on America's objectionable use of torture and the grave need for the country's leadership to pursue an ethical course of action in the war on terror. Sanchez also details the cynical use of the Iraq War for political gain in Washington and shows how the pressure of an around-the-clock news cycle drove and distorted critical battle decisions, such as troop drawdowns, the fight for Fallujah, and the transfer of sovereignty.In addition, Sanchez shares the story of his career. He tells of the journey from his poverty-stricken youth on the Texas banks of the Rio Grande to joining the Reserve Officers' Training Corps at sixteen and later serving in Kosovo, Desert Shield and Desert Storm, and, ultimately, Iraq. At the time of his retirement, Sanchez was the highest-ranking Hispanic in the U.S. Army.The first book written by a former on-site commander in Iraq, Wiser in Battle is essential reading for all who wish to understand the current war and the American military's role in the new century.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Place We Call Home: Exploring the Soul's Existence after Death",
        "Authors": "By Grant, Robert J. and Ritchie, George G. (FRW)",
        "Description": "",
        "Category": " Body, Mind & Spirit , Parapsychology , General",
        "Publisher": "Are Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Love Between Mothers and Daughters (The Love Between Series)",
        "Authors": "By Exley, Helen (EDT)",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "How to Apply Paneling - Easi-Bild 605",
        "Authors": "By Donald R. Brann",
        "Description": "",
        "Category": "",
        "Publisher": "Directions Simplified",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Compensation Management In a Knowledge-Based World",
        "Authors": "By Henderson, Richard I.",
        "Description": "",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "The Bodies Left Behind: A Novel",
        "Authors": "By Deaver, Jeffery",
        "Description": "When a night-time call to 911 from a secluded Wisconsin vacation house is cut short, offduty deputy Brynn McKenzie leaves her husband and son at the dinner table and drives up to Lake Mondac to investigate. Was it a misdial or an aborted crime report?Brynn stumbles onto a scene of true horror and narrowly escapes from two professional criminals. She and a terrified visitor to the weekend house, Michelle, flee into the woods in a race for their lives. As different as night and day, and stripped of modern-day resources, Brynn, a tough deputy with a difficult past, and Michelle, a pampered city girl, must overcome their natural reluctance to trust each other and learn to use their wits and courage to survive the relentless pursuit. The deputy's disappearance spurs both her troubled son and her new husband into action, while the incident sets in motion Brynn's loyal fellow deputies and elements from Milwaukee's underside. These various forces race along inexorably toward the novel's gritty and stunning conclusion.The Bodies Left Behind is an epic cat-and-mouse chase, told nearly in real-time, and is filled with Deaver's patented twists and turns, where nothing is what it seems, and death lingers just around the next curve on a deserted path deep in the midnight forest.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Shopaholic & Sister: A Novel",
        "Authors": "By Kinsella, Sophie",
        "Description": "What’s a round-the-world honeymoon if you can’t buy the odd souvenir to ship back home? Like the twenty silk dressing gowns Becky Brandon (née Bloomwood) finds in Hong Kong, or the hand-carved dining table from Sri Lanka, or the, um, huge wooden giraffes from Malawi (that her husband expressly forbade her to buy).   Only now Becky and Luke have returned home to London, where two truckloads of those souvenirs have cluttered up their loft. The bills are outrageous, Luke is furious, and Becky’s feeling rather blue—until her parents deliver some incredible news. She has a long-lost sister! Becky is convinced her sister will be a true soulmate. They’ll go shopping together, drink cappuccinos together, get manicures together. Then Becky meets Jessica and receives the shock of her life. Surely the shopaholic’s own sister can’t hate shopping?   Praise for Sophie Kinsella   “Kinsella’s heroine is blessed with the resilience of ten women, and her damage-limitation brain waves are always good for a giggle.”—Glamour (U.K.)    “Kinsella has a genuine gift for comic writing.”—The Boston Globe   “Kinsella’s Bloomwood is plucky and funny. . . . You won’t have to shop around to find a more winning protagonist.”—People   “Faster than a swiping Visa, more powerful than a two-for-one coupon, able to buy complete wardrobes in a single sprint through the mall—it’s Shopaholic!”—The Washington Post",
        "Category": " Fiction , Women",
        "Publisher": "Dial Press Trade Paperback",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Tennis",
        "Authors": "By Gonzales, Pancho",
        "Description": "",
        "Category": "",
        "Publisher": "Cornerstone Library",
        "Price Starting With ($)": "9.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "America's First Ladies Coloring Book (Dover History Coloring Book)",
        "Authors": "By Franz, Leslie",
        "Description": "They&#39;re the women who helped shape America — presidential wives, daughters, and other female relatives, who served as official hostesses in the White House and often acted as advisers to the President. These 46 ready-to-color drawings depict them in authentic settings in Washington and around the globe. Included are Martha Custis Washington, Mary Todd Lincoln, Mamie Eisenhower, Jacqueline Kennedy, Rosalynn Carter, Nancy Reagan, Hillary Clinton, Laura Bush, Michelle Obama, Melania Trump, and others.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Presidents & First Families (U.S.)",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Knitting Under the Influence",
        "Authors": "By Lazebnik, Claire",
        "Description": "When you're in your late twenties and nothing in your life seems to be falling into place, knitting is an awfully seductive way to spend your free time. After all, as long as you're following the instructions, you can knit row after row with the knowledge that the pattern will emerge and you'll end up with just what you wanted.  Life, on the other hand, doesn't come with a stitch counter, so Kathleen, Sari, and Lucy, the heroines of KNITTING UNDER THE INFLUENCE, just have to figure things out as they go along.  Their weekly Sunday knitting circle is the only thing holding them together as Kathleen is cut off financially by her family and forced to enter `the real world' for the very first time at the age of twenty-seven, Sari finds herself falling for the man who made her life a living hell in high school but who now desperately needs her help, and Lucy finds herself torn between emotion and reason when her lab and her boyfriend are assailed by an animal-rights group.At their club meetings, they discuss the really important questions: how bad is it, really, to marry for money if you like the guy a lot anyway? Can you ever forgive someone for something truly atrocious that they've done? Is it better to be unhappily coupled than happily alone? And the little ones: Can you wear a bra with a hand-knit tube top? Is it ever acceptable to knit something for a boyfriend? And why do your stitches become lopsided after your second martini?In Claire LaZebnik's hilarious and sometimes heartbreaking novel, Sari, Lucy, and Kathleen's lives intersect, overlap, unravel, and come back together-the result is an utterly satisfying read.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "5 Spot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "If the Buddha Married: Creating Enduring Relationships on a Spiritual Path (Compass)",
        "Authors": "By Kasl, Charlotte Davis",
        "Description": "Zen and the art of lasting relationships . . .Filled with the same lighthearted, highly practical, spiritually sound guidance that resonated with readers of If the Buddha Dated, this book is a fresh and inspiring guide for anyone who wants to strengthen, deepen, or revitalize a relationship or marriage. Charlotte Kasl, PhD, renowned for her ability to speak with depth, wisdom, and humor on important matters of the heart, empowers us to create fulfilling and vibrant relationships throuhg a commitment to awareness, truth, and compassion.If the Buddha Married explores how a \"beginner's mind\" can help us see our partners and ourselves afresh each day as we learn to nurture our commitment to each other. Marriage is truly a journey. Combining key teachings of Buddhism, Christianity, and other spiritual traditions with elements of psychology, this book is a wise and trusted guide through the joys and challenges of relationships that last and grow.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Roadfood",
        "Authors": "By Stern, Jane and Stern, Michael",
        "Description": "First published in 1977, the original Roadfood became an instant classic. James Beard said, \"This is a book that you should carry with you, no matter where you are going in these United States. It's a treasure house of information.\" Now this indispensable guide is back, in an even bigger and better edition, covering 500 of the country's best local eateries from Maine to California. With more than 250 completely new listings and thorough updates of old favorites, the new Roadfood offers an extended tour of the most affordable, most enjoyable dining options along America's highways and back roads.Filled with enticing alternatives for chain-weary-travelers, Roadfood provides descriptions of and directions to (complete with regional maps) the best lobster shacks on the East Coast; the ultimate barbecue joints down South; the most indulgent steak houses in the Midwest; and dozens of top-notch diners, hotdog stands, ice-cream parlors, and uniquely regional finds in between. Each entry delves into the folkways of a restaurant's locale as well as the dining experience itself, and each is written in the Sterns' entertaining and colorful style. A cornucopia for road warriors and armchair epicures alike, Roadfood is a road map to some of the tastiest treasures in the United States.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Mystery Writer's Sourcebook: Where to Sell Your Manuscripts (MYSTERY WRITER'S MARKETPLACE AND SOURCEBOOK)",
        "Authors": "By Borcherding, David H. (EDT) and Prues, Don (EDT)",
        "Description": "The mystery should be in the book or story - not how to create and sell it. To put everything where it must be - a tight story on paper and the manuscript on the right editor's desk - use Mystery Writer's Sourcebook: Where to Sell Your Manuscripts. It's like having a team of mentors who help you hone your prose and sell it.In this completely updated second edition, you'll find market reports on 120 book and magazine publishers, writing guidance, inside information on how to get a first-rate agent, publishing house profiles, a look at developing trends, reprints of terrific work, interviews with professionals, and additional information resources. Online services, organizations, workshops, contests, mystery bookstores - these listings are like a ring full of skeleton keys.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Full Lives: A Woman's Guide to Freedom from Obsession with Food and Weight",
        "Authors": "By Hall, Lindsey",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Gurze Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "School Spirit",
        "Authors": "By Hurwitz, Johanna and Dugan, Karen (ILT)",
        "Description": "Fearing that Edison-Armstrong School will close and force him into a school away from his closest friends, Julio rallies Lucas, Cricket, and Zoe into a campaign to save the school that tests his school spirit. Reprint.",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Two Heads Are Better Than One",
        "Authors": "By Homzie, Hillary and Phillips, Matthew (ILT)",
        "Description": "Double Trouble!  Barton and Nancy Jamison are just regular kids. That is until alien clones land in their hometown of Pine Bluff. Now there are two Barts and two Nancys!  BUT (and this is a really big butt) the alien clones, Beta and Gamma, have a totally wacky take on Earth life. Whenever they're around, something always gets messed up.",
        "Category": " Juvenile Fiction , Science Fiction , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "A Long Goodbye",
        "Authors": "By Colby, William H.",
        "Description": "Looks at the 1987 right-to-die trial affecting the parents who wished to remove the feeding tube from their vegetative daughter, and examines the surrounding protests that held them in the courtroom for the next seven years.",
        "Category": " Social Science , Death & Dying",
        "Publisher": "Hay House",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Book of Bunny Suicides: Little Fluffy Rabbits Who Just Don't Want to Live Anymore (Books of the Bunny Suicides Series)",
        "Authors": "By Riley, Andy",
        "Description": "“Watership Down for the deeply sick. Very imaginative, very funny, very worrying if you're the author's mother.”—Richard Curtis, screenwriter, director, producerRabbits. We'll never quite know why, but sometimes they decide they've just had enough of this world—and that's when they start getting inventive. This cult hit and international bestseller follows over one hundred bunnies as they find ever more outlandish ways to do themselves in. From an encounter with the business end of Darth Vader's lightsaber, to supergluing themselves to a diving submarine, to hanging around underneath a loose stalactite, these bunnies are serious about suicide.Illustrated in a stark and simple style, The Book of Bunny Suicides is a collection of hilarious and outrageous cartoons that will appeal to anyone in touch with their evil side.www.bookofbunnysuicides.com",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    }
]