[
    {
        "Title": "The Hal Leonard Pocket Music Dictionary",
        "Authors": "By Hal Leonard Publishing Corporation (EDT)",
        "Description": "(Book). Here's the most contemporary music dictionary on the market! Conveniently divided into three main sections: The Dictionary of Music Terms defines over 2,000 music terms concisely, including notation and theory terms, instruments and terms used in pop music, electronic music and the music business; The Dictionary of Musicians provides more than 400 capsule biographies of composers and other musicians; and Reference Charts give instant, at-a-glance summaries of the essentials of music, encompassing instrumental and vocal ranges, notation signs and symbols, and scales, modes and key signatures.",
        "Category": " Music , Reference",
        "Publisher": "Hal Leonard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Secrets from the Southern Living Test Kitchens",
        "Authors": "By By the Editors of Southern Living",
        "Description": "Alphabetically arranged for easy access, a vast collection of more than five thousand cooking tips, secrets, shortcuts, and techniques is accompanied by more than 350 delicious recipes, as well as timesaving suggestions, quick answers to common questions, and more than three hundred photographs. 10,000 first printing.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Fodor's Greece, 7th Edition (Travel Guide)",
        "Authors": "By Fodor's Travel Publications, Inc.",
        "Description": "Marvel at medieval monasteries perched upon pinnacles, cruise the midnight-blue Aegean Sea abroad a private yacht, witness an unsurpassed sunset over a flooded caldera, see a play at a 2,500-year-old theater with perfect acoustics or explore the windswept, uninhabited island birthplace of Apollo—Fodor's Greece, 7th Edition offers all these experiences and more! Our local writers have traveled throughout the country to find the best hotels, restaurants, attractions and activities to prepare you for a journey of stunning variety. Before you leave for your trip be sure to pack your Fodor's guide to ensure you don't miss a thing.The San Francisco Chronicle sums it up best —\"Fodor's guides are saturated with information.\"- We frequently update our Greece guide, and we make every effort to bring you the most accurate and thorough book.  Plus we provide timely updates about the area at Fodors.com.- Unlike other travel books, Fodor's guides rely heavily on local experts who know the territory best—so you know you're seeing the real Greece.- We give you the planning tools you need to tailor your trip. We give options for all budgets. You make the choices.-----------------------------------With Fodor’s you get much more than a guidebook–we make it easy for you to customize your dream vacation. Visit www.fodors.com to find up-to-date travel bargains, mini-guides to worldwide destinations, information on local festivals, dazzling drives, maps, vacation planning tips and much more! And, for more insider secrets, visit “Travel Talk” and “Rants and Raves” online at www.fodors.com/forums to get advice from other travelers like you.",
        "Category": " Travel , Europe , Greece",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Downsizing: Reshaping the Corporation for the Future",
        "Authors": "By Tomasko, Robert M.",
        "Description": "",
        "Category": "",
        "Publisher": "AMACOM c1990, New York",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Stories of the Great Operas and their Composers",
        "Authors": "By Newman, Ernest",
        "Description": "",
        "Category": "",
        "Publisher": "Marboro Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "More Than Seduction",
        "Authors": "By Holt, Cheryl",
        "Description": "Mrs. Anne Smythe's Healing Spa and Bathing Emporium is a haven for fashionable women who believe the waters have aphrodisiac properties. Yet the prim proprietress never thinks of testing that theory-until grievously injured Captain Stephen Chamberlin is deposited on her doorstep. Every minute the war hero spends under her roof courts scandal. It isn't long before she discovers that having such a man at her mercy arouses her in ways she never thought possible as their \"therapeutic\" sessions in the hot springs have become steamy trysts Anne wishes would never end...Stephen thought he had reached his lowest point when the war rendered him an invalid. He's proven wrong when his sister and best friend leave him in the care of the tantalizing Mrs. Anne Smythe. Yet as the healing waters work their magic, so does the widow Smythe. Beneath her unflappable exterior lies an alluring woman: warm, witty, and refreshingly open to sensual experimentation. But when mutual pleasure turns to forbidden love, can two people outwit the forces that would see them torn apart?",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Draw Ocean Animals",
        "Authors": "By DuBosque, D. C.",
        "Description": "From initial concept to finished art, the \"Learn to Draw\" series provides young and beginning artists with practical step-by-step instruction in a warm, friendly voice.",
        "Category": " Juvenile Nonfiction , Art , Drawing",
        "Publisher": "Peel Productions",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "A Shark Out of Water: A John Putnam Thatcher Mystery",
        "Authors": "By Lathen, Emma",
        "Description": "Intrepid Wall Street banker John Putnam Thatcher finds himself embroiled in another white collar scandal involving a guasi government commission planning to modernize the Kiel Canal, the link between the North and Baltic Seas",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Cafe Pasqual's Cookbook: Spirited Recipes from Santa Fe",
        "Authors": "By Kagel, Katherine and Simpson, Barbara (PHT)",
        "Description": "Cafe Pasqual's, a small, bustling, and perpetually jammed restaurant in the heart of Santa Fe, draws on a wide range of Southwestern and Mexican culinary traditions to create an original menu based on fresh, authentic ingredients and emphatic flavors. This first collection of over 60 recipes from Cafe Pasqual's includes an enticing variety of easy-to-prepare dishes for every meal of the day, from simple breakfast quesadillas to all-out dinners. Illustrated with hand-tinted photographs and bright, kitschy Mexican calendar art, complete with a glossary of ingredients and a mail-order source guide, Cafe Pasqual's Cookbook celebrates the spirited flavors and irrepressible appeal of what is fast becoming the nation's most popular regional cuisine.",
        "Category": " Cooking , Regional & Ethnic , Mexican",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "At the Court of Napoleon",
        "Authors": "By D'Abrantes, Duchesse",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "7 Deadly Scenarios: A Military Futurist Explores War in the 21st Century",
        "Authors": "By Krepinevich, Andrew F., Jr.",
        "Description": "A global pandemic finds millions swarming across the U.S. border.Major U.S. cities are leveled by black-market nukes.China’s growing civil unrest ignites a global showdown.Pakistan’s collapse leads to a hunt for its nuclear weapons.What if the worst that could happen actually happens? How would we respond? Are we ready?These are the questions that Andrew Krepinevich asks—and answers—in this timely and often chilling new book, which describes the changing face of war in the twenty-first century and identifies seven deadly scenarios that threaten our security in the crucial years ahead. As president of the Center for Strategic and Budgetary Assessments and consultant to secretaries of defense, the CIA, the Homeland Security Council and the Joint Forces Command, Krepinevich’s job is to think the unthinkable—and prepare a response in the event our worst nightmares become reality. Basing his analysis on open intelligence sources, an assessment of the latest global and political trends, and his knowledge of contemporary military history, Krepinevich starts each of the seven scenarios in the context of current geopolitical realities and vividly tracks the path to crisis. From the implosion of Pakistan to a worldwide cyberattack, from the consequences of a timed withdrawal from Iraq to the likelihood of a China on the march, Krepinevich reveals the forces—both overt and covert—that are in play; the ambitions of world powers, terrorist groups, and rogue states; and the actions and counteractions both our enemies and our allies can be expected to take.As riveting as a thriller, 7 Deadly Scenarios takes you inside the corridors of power, peers into the world of defense planning, and explores U.S. military and political strategy in the past, present, and likely future. The result is a must-read book that will trigger discussion, thought, and—hopefully—action.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Ice cream cook book",
        "Authors": "By Goldman, Earl",
        "Description": "",
        "Category": "",
        "Publisher": "Nitty Gritty Productions",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Faith Development in the Adult Life Cycle",
        "Authors": "By Stokes, Kenneth (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Dr Ken Stokes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "I Never Promised You a Rose Garden",
        "Authors": "By Greenberg, Joanne",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1977"
        }
    },
    {
        "Title": "The Fear of God",
        "Authors": "By Chepaitis, B. A.",
        "Description": "As Sardis Malocco and his fanatical followers of the Revelation Sect prepare for the Second Coming, Jaguar Addams must use the power of her mind and a virtual reality environment of Heaven to stop Sardis before he can unleash an apocalypse on the world. Original.",
        "Category": " Fiction , Science Fiction , High Tech",
        "Publisher": "Ace",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Enterprise Architecture Planning: Developing a Blueprint for Data, Applications, and Technology",
        "Authors": "By Spewak, Steven H. and Hill, Steven C.",
        "Description": "Praise for Enterprise Architecture Planning \"... the book has given me a wealth of good, fresh ideas about every facet of the architecture process ... makes a substantive contribution to the body of IS planning knowledge.\"—John A. Zachman Zachman, Information Systems Enterprise Architecture Planning is more advanced than traditional system planning approaches because you:  define a stable business model independent of organizational boundaries, systems, and procedures, define data before application, and let data determine the sequence for implementing applications systems.  Here the authors give you a common-sense approach to Enterprise Architecture Planning. You'll find dozens of examples of architectures, procedures, checklists, and useful guidelines to support these techniques. This is the best guide available to help you ensure a cost-effective, long-term solution.",
        "Category": " Computers , Database Management , General",
        "Publisher": "*A Wiley-QED Publication",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Spartan Gold (A Sam and Remi Fargo Adventure)",
        "Authors": "By Cussler, Clive and Blackwood, Grant",
        "Description": "The debut of a brand-new, action-packed series from the #1 New York Times bestselling master of ?pure entertainment? (People).Thousands of years ago, the Persian king Xerxes the Great was said to have raided the Treasury at Delphi, carrying away two solid gold pillars as tribute. In 1800, Napoleon Bonaparte and his army stumble across the pillars in the Pennine Alps. Unable to transport them Napoleon creates a map on the labels of twelve bottles of rare wine. And when Napoleon dies, the bottles disappear?Treasure hunters Sam and Remi Fargo are exploring the Great Pocomoke Swamp in Delaware when they are shocked to discover a World War II German u-boat. Inside, they find a bottle taken from Napoleon?s ?lost cellar.? Fascinated, the Fargos set out to find the rest of the collection. But another connoisseur of sorts has been looking for the bottle they?ve just found. He is Hadeon Bondaruk?a half- Russian, half-Persian millionaire. He claims to be a descendant of King Xerxes himself.And he wants his treasure back?",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Poems and Prayers for Children",
        "Authors": "By Suesse, Lynne and Brauchmann, Krista (ILT)",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications Intl",
        "Price Starting With ($)": "6.62",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The \"noble experiment,\"",
        "Authors": "By Irving Fisher",
        "Description": "",
        "Category": "",
        "Publisher": "Alcohol Information Committee",
        "Price Starting With ($)": "55.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1930"
        }
    },
    {
        "Title": "Empress (Godspeaker, Book 1)",
        "Authors": "By Miller, Karen",
        "Description": "In a family torn apart by poverty and violence, Hekat is no more than an unwanted mouth to feed, worth only a few coins from a passing slave trader. But Hekat was not born to be a slave. For her, a different path has been chosen. It is a path that will take her from stinking back alleys to the house of her God, from blood-drenched battlefields to the glittering palaces of Mijak.This is the story of Hekat, precious and beautiful.A new fantasy trilogy of power and politics, treason and betrayal, and the rise and fall of Empires ...",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Orbit",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Calhoun Women: Lilah & Suzanna (The Calhoun Women)",
        "Authors": "By Roberts, Nora",
        "Description": "Calhoun Women; Lilah & Suzanna by Nora Roberts released on Dec 25, 2000 is available now for purchase.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Jewish Baltimore: A Family Album",
        "Authors": "By Sandler, Gilbert",
        "Description": "From East Baltimore to Forest Park to Park Heights, from Nates and Leon's deli to Hutzler's department store, Jewish Baltimore tells stories of neighborhoods, people, and landmarks that have been important to Baltimore's Jewish experience. Gilbert Sandler, whose popular columns have appeared in Baltimore's Jewish Times and the Baltimore Sun, offers a wide-ranging history of the region's Jewish community from the 1850s to the present, covering both German Jewish and Russian Jewish communities. Sandler's archival research uncovers new details about important people and events, but the heart of his book lies in its anecdotes and quotations—the reminiscences of those who recall the rich tapestry of days gone by. More than a hundred nostalgic photographs help to bring the memories to life.Many of Sandler's essays invoke famous names in Baltimore history—names like Jack Pollack, the ex-boxer turned politician; Joseph Meyerhoff, who gave his city a symphony hall; Samuel Hecht, founder of the last surviving local department store chain. But just as often, these essays remind us of unsung heros: rabbis, merchants, teachers, and camp counselors. Sandler tells many inspirational stories, including how one young woman, escaping from Germany in 1939 on a ship headed to Bolivia, seized an opportunity when she learned the ship would stop in Baltimore. She sent a cable to her boyfriend in Richmond, Virginia, telling him to meet her at the dock, and the two were married onboard—which eventually allowed her to enter the United States. Sandler always uncovers the \"human interest\" in his stories. His account of the S.S. President Warfield—refitted as the Exodus to carry food, supplies, and 4,500 European refugees to Palestine in 1947—contains personal recollections from one of the local businessmen who played a key role in the secret operation, and even a statement from someone who, as a young workman, helped to load the ship.Jewish Baltimore also highlights fondly remembered institutions. Hutzler's s department store, for example, was a common meeting place for weekend shoppers; a notebook in Hutzler's balcony allowed friends to trade messages and track each other down in the large store. Hutzler's celebrated return policy stated that \"anything could be returned within a reasonable amount of time\"—with the word reasonable conveniently left to the customer's discretion. There was also Hendler's ice cream, whose advertisements featured a kewpie doll, proclaiming \"Take home a brick!\" When a competing chain bragged about producing twenty-eight flavors, Albert Hendler counted fifty flavors in his father's stock—including licorice, eggnog, and tomato aspic (the last flavor produced as a speciality for the Southern Hotel).Focusing on religious education, Sandler tells of the Talmud Torahs, the area's first highly visible, community-wide system committed to providing a Jewish education—two hours of instruction daily, in addition to a Jewish student's other lessons. The Talmud Torahs, dating from 1889, laid the foundation for later Jewish schools, such as the Isaac Davidson Hebrew School. Sandler also visits P.S. 49, a public school remembered for its high concentration of Jewish students. For recreation, the Monument Street \"Y\" was a popular site, providing a health club, game rooms, six-lane swimming pool, soda fountain, and library. In his essays on summer vacations, Sandler discusses family visits to Eastern Shore beaches and describes the summer camps that were frequented by Jewish children. Sandler has a knack for getting the people he interviews to recall every detail, from the names of favorite teachers or rabbis down to the price of a movie at the Avalon theater and which streetcar line they used to get there.Baltimore has a strong and historically important Jewish presence, and this book engagingly tells the story of that community.",
        "Category": " Religion , Judaism , History",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "16.9",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Murder After Hours",
        "Authors": "By Christie, Agatha",
        "Description": "Hopes of a quiet uneventful weekend at The Hollow, an English manor, enjoying the company of guests including an artist, a film star, and a noted physician are destroyed for detective Hercule Poirot after he discovers a dead body near the swimming pool",
        "Category": " Fiction , Literary",
        "Publisher": "Dell Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "Maui the Last Hawaiian Place",
        "Authors": "By Wenkam, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Seabury Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "A Russian Moment",
        "Authors": "By Harris, Bill",
        "Description": "Reveals the often hidden cultural and geographical diversity of the Soviet Union in photographs that span fron the Arctic Circle to the deserts of Kazakhstan and privide portraits of the land's peoples, including Mongols, Georgians, Ukrainians, and Uzbeks",
        "Category": "",
        "Publisher": "Portland House",
        "Price Starting With ($)": "8.46",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Simplexity: Why Simple Things Become Complex (and How Complex Things Can Be Made Simple)",
        "Authors": "By Kluger, Jeffrey",
        "Description": "Why are the instruction manuals for cell phones incomprehensible? Why is a truck driver's job as hard as a CEO's? How can 10 percent of every medical dollar cure 90 percent of the world's disease? Why do bad teams win so many games? Complexity, as any scientist will tell you, is a slippery idea. Things that seem complicated can be astoundingly simple; things that seem simple can be dizzyingly complex. A houseplant may be more intricate than a manufacturing plant. A colony of garden ants may be more complicated than a community of people. A sentence may be richer than a book, a couplet more complicated than a song. These and other paradoxes are driving a whole new science--simplexity--that is redefining how we look at the world and using that new view to improve our lives in fields as diverse as economics, biology, cosmology, chemistry, psychology, politics, child development, the arts, and more. Seen through the lens of this surprising new science, the world becomes a delicate place filled with predictable patterns--patterns we often fail to see as we're time and again fooled by our instincts, by our fear, by the size of things, and even by their beauty. In Simplexity, Time senior writer Jeffrey Kluger shows how a drinking straw can save thousands of lives; how a million cars can be on the streets but just a few hundred of them can lead to gridlock; how investors behave like atoms; how arithmetic governs abstract art and physics drives jazz; why swatting a TV indeed makes it work better. As simplexity moves from the research lab into popular consciousness it will challenge our models for modern living. Jeffrey Kluger adeptly translates newly evolving theory into a delightful theory of everything that will have you rethinking the rules of business, family, art--your world.",
        "Category": " Social Science , Media Studies",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Essays and sketches of Mark Twain",
        "Authors": "By Twain, Mark",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Virginia Woolf",
        "Authors": "By King James",
        "Description": "Virginia Woolf is one of the foremost writers of this century, yet surprisingly this biography is the first to fully explore the relationship between her troubled life and her novels, essays, book reviews, letters, and diaries - celebrated works that made her such a noted literary figure.All her life Woolf struggled with sadness that threatened to overwhelm and destroy her. In many ways her writings were attempts to counteract these powerful feelings and to grasp the healing forces of life. This was her central reason for writing: to investigate and curb her fascination with death and, at the same time, to capture the vitality of existence. The paradox was that such affirmation inevitably brought her back to the subjects she knew best: the destructiveness of men, the burdens of the past, and the fragility of life. In this absorbing biography James King examines how the raw material of Woolf's daily existence was transformed into art, and he pays close attention to her search for forms of writing that encompass a new feminist aesthetic.Virginia Woolf sheds new light on this daring, impetuous, tormented artist, who strove relentlessly to find the right words to capture life's insubstantiality and its vibrancy.",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Upon a Wicked Time (An Avon Romantic Treasure)",
        "Authors": "By Ranney, Karen",
        "Description": "The triumphant return of a much-beloved Karen Ranney classic, Upon a Wicked Time is the New York Times and USA Today bestselling author at her steamy and sensuous best. A wildly romantic, deeply emotional tale of a Regency bride’s determined efforts to turn her marriage of convenience into a passionate love match, Upon a Wicked Time is a bravura display of Ranney’s exceptional talents—a story and an author Mary Balogh fans are sure to enjoy.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "A Pocket Guide to Correct Spelling (Barron's Educational Series)",
        "Authors": "By Griffith, Francis J.",
        "Description": "Provides the correct spelling for over 25,000 words",
        "Category": "",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The Story of a Marriage: A Novel",
        "Authors": "By Greer, Andrew Sean",
        "Description": "From the bestselling author of The Confessions of Max Tivoli, a love story full of secrets and astonishments set in 1950s San Francisco “We think we know the ones we love.” So Pearlie Cook begins her indirect and devastating exploration of the mystery at the heart of every relationship, how we can ever truly know another person. It is 1953 and Pearlie, a dutiful housewife, finds herself living in the Sunset district of San Francisco, caring not only for her husband’s fragile health but also for her son, who is afflicted with polio. Then, one Saturday morning, a stranger appears on her doorstep and everything changes. All the certainties by which Pearlie has lived are thrown into doubt. Does she know her husband at all? And what does the stranger want in return for his offer of $100,000? For six months in 1953, young Pearlie Cook struggles to understand the world around her, most especially her husband, Holland.  Pearlie’s story is a meditation not only on love but also on the effects of war—with one war just over and another one in Korea coming to a close. Set in a climate of fear and repression—political, sexual, and racial—The Story of a Marriage portrays three people trapped by the confines of their era, and the desperate measures they are prepared to take to escape it. Lyrical and surprising, The Story of a Marriage looks back at a period that we tend to misremember as one of innocence and simplicity.  Like Ford Madox Ford’s The Good Soldier, Andrew Sean Greer’s novel is a narrative tour de force that confirms him as “one of the most talented writers around” (Michael Chabon).",
        "Category": " Fiction , Historical",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "What Do We Do Now?: A Workbook for the President-Elect",
        "Authors": "By Hess, Stephen",
        "Description": "The period from Election Day to Inauguration Day in America seems impossibly short. Newly elected U.S. presidents have less than eleven weeks to construct a new government composed of supporters and strangers, hailing from all parts of the nation. This unique and daunting process always involves at least some mistakes&#151;in hiring, perhaps, or in policy priorities, or organizational design. Early blunders can carry serious consequences well into a president's term; minimizing them from the outset is critical. In  What Do We Do Now? Stephen Hess draws from his long experience as a White House staffer and presidential adviser to show what can be done to make presidential transitions go smoothly.   Here is a workbook to guide future chief executives, decision by decision, through the minefield of transition. You'll have to start at the beginning, settling on a management style and knowing how to \"arrange all the boxes.\" Something as seemingly mundane as parceling office space can be consequential&#151;hence the inclusion of a proposed White House organizational chart and floor plans of the West Wing. What qualities are needed for each job, and where are the best candidates for those positions most likely to be found? How can you construct a cabinet that \"looks like America\"? What Do We Do Now? is your indispensable guide through the thicket of these decisions.  There are small decisions, too. You'll have to pick a desk&#151;photos of the choices are included. Which presidential portraits should hang in the Oval Office? Which ones have previous presidents chosen? And when it comes time to write an inaugural address, what should be the content, theme, and tone? It's all here in the presidential transition workbook&#151;don't leave for Washington without it.  This concise volume is sure to be a valuable resource for the president and team of advisers as they attempt to herd cats into an effective government. o W e Do Now? is alsis also a delightful read for anyone interested in exactly how one goes about being the president of the United States.",
        "Category": " Political Science , American Government , Executive Branch",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Fairest",
        "Authors": "By Levine, Gail Carson",
        "Description": "Once upon a time, there was a girl who wanted to be pretty . . .Aza's singing is the fairest in all the land, and the most unusual. She can \"throw\" her voice so it seems to come from anywhere. But singing is only one of the two qualities prized in the Kingdom of Ayortha. Aza doesn't possess the other: beauty. Not even close. She's hidden in the shadows in her parents' inn, but when she becomes lady-in-waiting to the new queen, she has to step into the light—especially when the queen demands a dangerous favor. A magic mirror, a charming prince, a jealous queen, palace intrigue, and an injured king twine into a maze that Aza must penetrate to save herself and her beloved kingdom.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2012"
        }
    },
    {
        "Title": "Water Gardens: How to Plan and Plant a Backyard Pond (Taylor's Weekend Gardening Guides, 5)",
        "Authors": "By Thomas, Charles B. and Ellis, Barbara W.",
        "Description": "You'll learn how to select the perfect site, choose the size and shape of your garden, and install preformed or flexible-liner pools, as well as how to select pumps and filters, test and treat the water, and choose the right plants and fish for your own unique garden environment. A comprehensive gallery of plants will inspire you to try this increasingly popular form of gardening.",
        "Category": " Gardening , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Bass Ackwards and Belly Up (Bass Ackwards and Belly Up, 1)",
        "Authors": "By Craft, Elizabeth and Fain, Sarah",
        "Description": "For readers of the New York Times bestselling Gossip Girl and A-List series, here is a smart and highly commercial first novel about four best friends who, after graduating high school, decide to postpone the standard college route to pursue their creative dreams. Harper Waddle, Sophie Bushell, and Kate Foster are about to commit the ultimate suburban sin--bailing on college to each pursue their dreams: write the next Great American Novel, make it as a Hollywood actress, and backpack around the world. Middlebury-bound Becca Winsberg is convinced her friends have gone insane...until they remind her she just might have a dream of her own. So what if their lives are bass ackwards and belly up? They'll always have each other. Harper is going to be the next Jane Austen.  Or Sylvia Plath.  Or Plum Sykes.  Figuring out which should be easy.  It?s living with the lie she told her three best friends that?s going to be hard.Kate doesn?t know exactly what she wants.  But whatever it is, she won?t find it at Harvard.  Maybe the answer is in Paris, or Athens? or anywhere Kate can be someone besides the girl with perfect grades, perfect hair, and the perfect boyfriend.Sophie is a star.  She?s already got the looks, the talent, and a list of demands for her dressing room.  Now that she?s wrangled a furnished guesthouse in Beverly Hills, it?s only a matter of time before she?s discovered.  Unless she isn?t.Becca is dysfunctional.  At least, her family is.  Which is why she can?t wait to flee the drama and get to college.  But Becca?s friends know she needs more than a spot on the Middlebury ski team and a cozy dorm room.  They know she needs to fall in love.Dreams are complicated.  They almost never turn out like you imagine?they almost always change.   Sometimes, they change you.",
        "Category": " Young Adult Fiction , Careers, Occupations, Internships",
        "Publisher": "Poppy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Songs for the Missing: A Novel",
        "Authors": "By O'Nan, Stewart",
        "Description": "\"It was the summer of her Chevette, of J.P., and letting her hair grow.\" It is also the summer when, without warning, college-bound Kim Larsen disappears from her quiet Lake Erie town. Her parents, her little sister, her best friends and new boyfriend now must do everything to find her. As time passes and local search parties give way to wider TV appearances, private investigations unearth dirty secrets, and we follow those closest to Kim as they struggle to maintain hope and, finally, as the news cameras turn away, to hang on to both her and themselves. Stark and honest, this is an intimate account of what happens behind and beyond the headlines when those who stay after the media leaves deal with the real consequences of a very American tragedy.Stewart O'Nan's newest novel opens with the suspense of a thriller and soon deepens into an affecting family drama of loss.",
        "Category": " Fiction , Literary",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Collaboration: Uniting Our Gifts in Ministry",
        "Authors": "By Sofield, Loughlan and Juliano, Carroll",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Ave Maria Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Hungry Heart",
        "Authors": "By Wolff, Pierre",
        "Description": "",
        "Category": " Religion , Prayerbooks , Christian",
        "Publisher": "Liguori Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The City of Florence: Historical Vistas and Personal Sightings",
        "Authors": "By Lewis, R. W. B.",
        "Description": "In this deeply personal and learned labor of love, R.W.B. Lewis, acclaimed chronicler of such great American cosmopolitans as Edith Wharton and Henry James, provides a new look at the glories of Florence, the smallish Tuscan city which has been a prime source for modern Western culture and which has also been his second home for the past fifty years. In chapters dense with historical detail and personal reflection, Lewis reconsiders the principal focal points of this much-beloved city - the Arno, the Duomo, the Ponte Vecchio, Santa Croce - and casts new light on Florence's cultural patrimony and civic legacy from the Middle Ages to the present. With a scholar's eye and a lover's passion, he invites us to share his vision of a city and the way of life it has engendered and inspired.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Farrar Straus Giroux",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "A Mother for All Seasons: A Memoir",
        "Authors": "By Rivas, Mim Eichler and Phelps, Debbie",
        "Description": "While her son Michael thrilled the world with his record-setting eight-gold-medal performance during the 2008 Beijing Olympics, Debbie Phelps stole the show. No Olympics coverage was complete without her, and she often appeared along side her son-and proved a much more compelling guest. After all, she was the one who drove him to all those pre-dawn practices, who raised him and his sisters alone, who told him he could succeed when doubts crept in, who instilled his discipline and drive by her example. A single mother and devoted school principal, Debbie knows how to raise a successful child, no matter the odds. Her story is also one of adversity, dedication, and the struggle to overcome life′s challenges. In her memoir, she tell her full story for the first time: What happened to her husband, Michael′s father? What does it take to raise a champion? What were the challenges of being a single mother? What is Michael really like?",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "The Garden Tour Affair: A Gardening Mystery",
        "Authors": "By Ripley, Ann",
        "Description": "Everything's coming up corpses....Louise Eldridge is taking her popular television show, Gardening with Nature, on location to film a garden tour at the historic Litchfield Falls Inn. It's a weekend in the country that promises rest, relaxation, and some of New England's most beautiful gardens.But the local grapevine whispers of warring lovers, botanical scams, academic scandal, and family finagling. The tension is so thick you can hardly cut it with a scythe. And then the uneasy group of assembled guests begin to meet with the most unfortunate of accidents.Suddenly Louise suspects that someone is playing Grim Reaper in the Litchfield Falls paradise. How many more guests--including one nosy garden show host--are about to be cut down?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Dreaming in Black and White: A Phoebe Grant Novel",
        "Authors": "By Walker, Laura Jensen",
        "Description": "She's smart.  She's savvy.  She's...well, she's working on the thighs.  And with God as her witness, she'll never let that man spoil her happy ending!Phoebe Grant is everyone's favorite movie geek-unbeatable at trivia, convinced that all the world's a movie screen.  She can organize a four-hankie chick-flickathon with a wave of her tall, nonfat, double mocha.  And she's a shoo-in for the job of her dreams-movie reviewer for the newpaper where she works.Enter Alex Spencer-not only gorgeous but also a film buff, perfectly cast for a celluloid kiss and a fade to sunset.  Unfortunately, Alex is the villain who sends Phoebe packing to the last place on earth she wants to be-back home to boring little Barley, California.But wait.  It couldn't be.  Dark, handsome, and annoying Alex...in Barley?Can Phoebe protect her hometown-and her heart-and prove It's a Wonderful Life?  Or is her promising future truly Gone with the Wind?",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Bras & Broomsticks (Magic In Manhattan)",
        "Authors": "By Mlynowski, Sarah",
        "Description": "From the New York Times bestselling author of the Whatever After series, the first book in the hilariously bewitching Magic in Manhattan series!  What if all your wishes could come true? Blink your eyes, drink a fizzing pink potion,   and poof! Life is perfect. That’s Rachel’s situation. Except she’s not the one who   suddenly has magical powers. Her younger sister is. And as Rachel would tell you,   spellbooks are wasted on the young! Yes, yes, of course world peace and cures for   horrible diseases are important. But so is dancing without looking like she’s being   electrocuted, winning back her best friend, stopping her dad’s wedding, and finding   a date for Spring Fling.  Rachel’s not bewitched. Yet. . . .“Sabrina fans will get a witchy kick out of Bras & Broomsticks!”—Meg Cabot, New York Times bestselling author of The Princess Diaries“Poof, instant bliss.”—Lauren Myracle, New York Times bestselling author of TTYL and Rhymes with Witches“One magical romp you won’t want to miss.”—Discovery Girls\"Hilarious.\" —Teen People",
        "Category": " Young Adult Fiction , Fantasy , Wizards & Witches",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Best American Recipes 1999: The Year's Top Picks from Books, Magaziines, Newspapers and the Internet",
        "Authors": "By Silverman, Ellen (PHT), McCullough, Fran (EDT), and Hamlin, Suzanne (EDT)",
        "Description": "For this ground-breaking collection, two leading food authorities scoured every conceivable printed source for the year's great recipes: cookbooks, magazines of every kind, national and regional newspapers, press releases, newsletters, the Internet -- even the backs of boxes. From literally thousands of possibilities, they narrowed the field to 500 for testing, before choosing 111 of the very best. Many of their discoveries are brilliantly simple, like the delightfully retro meatball appetizer that's making the rounds of Manhattan cocktail parties and the supremely easy Moroccan-inspired weeknight chicken supper that won its creator a million dollars in a cooking contest. The roast chicken recipe that's currently considered by food insiders to be one of the two best in the world is revealed here, as is the recipe for luscious black-bean burgers, a favorite of the food editor of a major women's magazine. And gone public at last is a well-known novelist's provocative spin on linguine with clam sauce, which food lovers have been excitedly e-mailing all over the country, as is the latest update from one of the nation's most talented pastry chefs, a new twist on her definitive hot fudge sauce. You'll find memorable dishes for holidays and other special occasions: a cider-cured turkey, an exceptional wild rice soup from Minnesota that solves the problem of what to do with the leftover bird, a trick to make a cheap supermarket ham taste exceptionally elegant, and the formula for a basic cookie dough that can be easily varied to produce fifty different kinds of cookies. You'll find breakfasts and brunches, starters and drinks (both alcoholic and non-) and salads and side dishes. There's even a recipe for banana biscotti for dogs. Throughout, the editors have added cooking notes, tips, and serving suggestions based on the results of their extensive testing. Whether the source is a virtuoso chef or an obscure home cook, a famous movie star or a fireman in a small town, each dish is perfectly calibrated to produce a single reaction among all those who taste it: \"I must have that recipe!\"",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Affluenza: The All-Consuming Epidemic",
        "Authors": "By Naylor, Thomas H., De Graaf, John, Wann, David, Horsey, David (FRW), and Robin, Vicki (FRW)",
        "Description": "affluenza, n. a painful, contagious, socially transmitted condition of overload, debt, anxiety, and waste resulting from the dogged pursuit of more. We tried to warn you! The 2008 economic collapse proved how resilient and dangerous affluenza can be. Now in its third edition, this book can safely be called prophetic in showing how problems ranging from loneliness, endless working hours, and family conflict to rising debt, environmental pollution, and rampant commercialism are all symptoms of this global plague.     The new edition traces the role overconsumption played in the Great Recession, discusses new ways to measure social health and success (such as the Gross Domestic Happiness index), and offers policy recommendations to make our society more simplicity-friendly. The underlying message isn’t to stop buying—it’s to remember, always, that the best things in life aren’t things.",
        "Category": " Business & Economics , Consumer Behavior",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Bulbs: Complete Gardener (Time-life Complete Gardener)",
        "Authors": "By Janet Time-Life Books and Cave",
        "Description": "",
        "Category": " Gardening , Flowers , Bulbs",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Ultimate Audition Book for Teens: 111 One-Minute Monologues (Young Actors Series)",
        "Authors": "By Milstein, Janet B.",
        "Description": "Offers more than one hundred original monologues, all about one minute long, to be used by male and female teenage actors in auditions.",
        "Category": " Young Adult Nonfiction , Performing Arts , Theater & Musicals",
        "Publisher": "Smith & Kraus",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "A Simple Christmas: Twelve Stories That Celebrate the True Holiday Spirit",
        "Authors": "By Huckabee, Mike",
        "Description": "The New York Times bestseller by the former governor and presidential candidate-an instant classic, reissued for 2010.  Christmas has become synonymous with shopping, overindulging, and stress. But according to Mike Huckabee, that was never God's intention. Going back to the Nativity, Christmas is supposed to be about simple things: faith, love, family, and hope. The hard part, in today's crazy world, is remembering that those simple things are the most precious. Huckabee recounts twelve Christmas memories that range from his childhood in Arkansas to his years as a young husband and father to his time as a governor and then a presidential candidate. These true stories will help you smile, take a deep breath, and maybe slow down your own holiday treadmill. For instance, as kids, Mike and his sister would sneak open their gifts before Christmas, play with them, then rewrap them so their parents wouldn't notice. The plan worked great until one Christmas when young Mike unwrapped a brand-new football...that was covered in mud. That led to a powerful lesson about patience and a reminder that the best Christmases are the simple ones.",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Sentinel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Jason's Bus Ride (Penguin Young Readers, Level 2)",
        "Authors": "By Ziefert, Harriet and Taback, Simms (ILT)",
        "Description": "Jason is riding the bus when a dog sits down right in the middle of the road. He will not get out of the way! A lady tries to move him and a policeman tries, too. But only Jason knows how to get that dog to move . . .",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Only Love Can Break a Heart, But a Shoe Sale Can Come Close: A Cathy Collection (Volume 13)",
        "Authors": "By Guisewite, Cathy",
        "Description": "Only Love Can Break a Heart, But a Shoe Sale Can Come Close--is a batch of giggles and \"ouches\" for millions of adoring Cathy fans. Why do they love her so? \"Because,\" said a noted sociologist, \"one thing never changes--it\"s still very important that you look good in a bathing suit!\"Cathy has become the symbol for single career women. Her painfully funny glimpses of women's angst.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Midsummer Magic (Magic Trilogy)",
        "Authors": "By Coulter, Catherine",
        "Description": "First in the Magic Trilogy.A clever, beautiful woman disguises herself as a mousy Scottish lass to keep the notoriously rakish Earl of Rothermere from marrying her, only to find she was chosen for that very reason. After the earl discards her, she sheds her dowdy facade to become London society's brightest star—rousing the ire and igniting the passions of her faithless husband.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Best-Loved Quilt Patterns",
        "Authors": "By Hagood, Carol Cook, Lee, Josie E., and Hunter, Larry",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Cassandra and Jane: A Jane Austen Novel",
        "Authors": "By Pitkeathley, Jill",
        "Description": "They were beloved sisters and the best of friends. But Jane and Cassandra Austen suffered the same fate as many of the women of their era. Forced to spend their lives dependent on relatives, both financially and emotionally, the sisters spent their time together trading secrets, challenging each other's opinions, and rehearsing in myriad other ways the domestic dramas that Jane would later bring to fruition in her popular novels. For each sister suffered through painful romantic disappointments—tasting passion, knowing great love, and then losing it—while the other stood witness. Upon Jane's death, Cassandra deliberately destroyed her personal letters, thereby closing the door to the private life of the renowned novelist . . . until now.In Cassandra & Jane, author Jill Pitkeathley ingeniously reimagines the unique and intimate relationship between two extraordinary siblings, reintroducing readers to one of the most intriguing figures in the world of literature,  as seen through the eyes of the one person who knew her best.",
        "Category": " Fiction , Literary",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Straight Talk About Reading: How Parents Can Make a Difference During the Early Years",
        "Authors": "By Hall, Susan Long and Moats, Louisa Cook",
        "Description": "Provides parents with practical advice, games and activities, and lists of children's books and resources for helping children read. Part I gives background information on reading and education, with chapters on America's reading crisis, why reading to children is important, the whole language and phonics controversy, and how children learn to read. Part II spells out ways to help a child in preschool through third grade, and discusses reading difficulties and disabilities. Includes a glossary, and lists of recommended books. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Language Arts & Disciplines , Reading Skills",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Road to Al-Qaeda: The Story of Bin Laden's Right-Hand Man (Critical Studies on Islam)",
        "Authors": "By Al-Zayyat, Montasser, Nimis, Sara (EDT), Fekry, Ahmed (TRN), and Abu-Rabi, Ibrahim M. (INT)",
        "Description": "The Road to Al-Qaeda is a controversial book. Written by an Egyptian human rights lawyer, it is the first English-language account of the development of tensions between violent and non-violent factions in radical Islamist movements, from the perspective of an insider. It is also a biography of one of the world's most-wanted terrorists: Egyptian-born Dr Ayman al-Zawahiri. Widely recognized as the man who will take over the leadership of Al-Qaeda after Osama bin Laden, he is also the reputed architect of the Riyadh bombings in Saudi Arabia.The original version of this book sold widely across the Arabic world. Reproduced in translation here, with an extensive introduction from distinguished scholar Ibrahim Abu Rabi, it stands alone as an unrivalled account of the divisions within militant Islamist ideology. The author provides insight into the internal politics of Islamic Jihad, and the radicalisation of bin Laden's deputy; he examines Zawahiri's opposition to efforts by other militant Islamists to call a ceasefire with the Egyptian authorities; and he narrates the redirection of Zawahiri's activities towards the US and Israel.As an insight into one of the key minds behind Al-Qaeda this book makes unparalleled and disturbing reading. It is an important document for anyone who seeks to understand how a minority extremist ideology came to have such an impact on world events.",
        "Category": " Religion , Islam , General",
        "Publisher": "Pluto Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Angle Antics",
        "Authors": "By Hickey, Mary",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Martingale & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Lessons in Duck Hunting: A Novel",
        "Authors": "By Buxton, Jayne",
        "Description": "A harried single mother of two young children in London, Ally James is less than thrilled with her lackluster life. Her job marketing marmalade is a yawn fest and the domestic front seems to streak by in a flash of fish sticks and school runs. To top it all off, Ally’s ex-husband David seems to have a never-ending roulette wheel of rotating girlfriends, while Ally has endured two meager (and disastrous) dates in as many years.Then there’s David’s newest arm-candy, Chantal, who is the first flavor-of-the-month to ever meet the kids–that must mean it’s serious. Ally’s friend Mel is sure she has the solution to the malaise: a Market Yourself dating seminar. It’s either the perfect way to find a new man or the first sign of the apocalypse–Ally isn’t sure which, but she decides to give it a whirl. What happens next is stranger, and more invigorating, than Ally could ever have imagined.",
        "Category": " Fiction , Women",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Accidental Family",
        "Authors": "By Coleman, Rowan",
        "Description": "Love is supposed to be the happy ending. Maybe it's only the beginning....    Fashionable Sophie Mills was a corporate manager on a fast track to success. Then, in the space of a heartbeat -- the time it takes for a car to crash -- two little girls, Bella and Izzy, her best friend's daughters, change her life forever. Named as guardian in their father's absence, Sophie discovers that the soft touch of a little girl's hand can be far more precious than a closet full of expensive clothes or an exciting job. And when their father Louis returns, the word \"family\" takes on a whole new significance, as Sophie finds herself deeply attracted to this handsome, mysterious man.   Moving to Cornwall to be with Louis and the girls is a deliriously, frighteningly adventurous start to a whole new life for Sophie. When Louis proposes marriage, Bella and Izzy immediately vault into bridesmaid ecstasy, but Sophie is besieged by doubt. Is marrying Louis, who left one wife before, the natural next step...or a scary mistake? Can she honor her promise to the girls to be there always, forever, whatever? When startling news from Louis's past takes them all by surprise, can these individuals brought together by chance and tragedy make the commitment that a family is forever?    From the sensational Rowan Coleman, whose witty and deeply moving novels have won hearts on both sides of the Atlantic, comes a thought-provoking new tale of love, choices, and the true meaning of family.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Noogie's Time to Shine: A True Crime Novel",
        "Authors": "By Knipfel, Jim",
        "Description": "ATM thief hits the road with 350 pounds of $20 bills. Ned “Noogie” Krapczak grew up in rough circumstances in Jersey City, New Jersey.  Movies were his only escape, and he dreamed of becoming a filmmaker.  But by the time he hits 30, things haven’t worked out the way they were supposed to. Instead of making movies, Noogie has a job restocking ATM machines in delis and drug stores.  One day he sees a way out of it all, in the form of a slow-motion heist, siphoning $20 bills a few at a time out of the machines he is supposed to be filling.  When his scheme is finally uncovered, he hits the road with his Siamese cat, Dillinger, and 350 pounds of $20 bills totaling $5 million.  In that instant, he finds himself not watching movies, but living them. He’s pulled off a great caper and is on the lam cross-country, a life worthy of Edward G. Robinson or Steve McQueen. Noogie works his way down the east coast on this great escape, disguising himself by using the names of characters in some of his favorite movies.  In telling the stories of Noogie’s final days, Knipfel’s novel captures the tragic end of a broken man who, however briefly and however unseemly, managed to live the American dream—he became a movie star.",
        "Category": " Fiction , General",
        "Publisher": "Virgin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "How to Talk With Your Angels",
        "Authors": "By O'Neill, Kim",
        "Description": "DISCOVER THE JOY OF SPIRITUAL LOVE AND FRIENDSHIPAll human beings, whether they know it or not, have at least two guardian angels to guide them through life. To get in touch with your guardian angelic companions is to avail yourself of love, comfort, protection, and the ability to seize opportunities that will bring you peace of mind, success, and happiness. In How to Talk with Your Angels, professional psychic and teacher Kim O'Neill shares her own extraordinary experiences with angels and shows you how you too can open the door to the spiritual communication that will transform your life. Discover:The nine steps to getting in touch with your angelsThe art of listening to their heavenly wisdomWhat they can tell you about finding your soul mateHow they can help you open your heart to joy and fulfillment How their words can help you overcome sorrowHow they can point the way to life-changing opportunitiesWhen their warnings can save your lifeHow they can help you communicate with lost loved onesand much, much more",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Deflation: What Happens When Prices Fall",
        "Authors": "By Farrell, Chris",
        "Description": "Deflation is one of the most feared terms in economics. It immediately conjures visions of abandoned farms and idle factories, streams of unemployed workers standing in breadlines. So when Federal Reserve Board Chairman Alan Greenspan started talking openly in 2003 about his fears of deflation, it sent waves of shock through the business press and the public. Many feared that the United States was entering a period of prolonged slump after a pronounced boom, much like Japan experienced throughout the 1990s. Others worried that a sustained fall in prices would have a cataclysmic impact on our nation's overhang of consumer debt. Yet another camp blamed low-wage manufacturing countries like China and high-volume retailers like Wal-Mart for becoming the engines of relentless deflation. In this important new book, Chris Farrell explains that deflation need not presage a collapse. In the process he gives a new way of looking at our economic and our financial futures. More than an introduction to the subject, Farrell points out that deflation has always been a fundamental aspect of the business cycle. For much of the 20th century, deflation had vanished from the economic scene, but its return is no cause for panic. Instead, properly understood, deflation presents opportunities and pitfalls in equal measure for businesses, corporations, the government, and our national economy.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Collins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Prostate Cancer Treatment Book",
        "Authors": "By Grimm, Peter D. (EDT), Blasko, John C. (EDT), and Sylvester, John E. (EDT)",
        "Description": "The latest and most progressive treatment advice from prostate cancer experts at the nation's top medical centersFor each of the nearly 200,000 Americans diagnosed with prostate cancer annually, the months following the diagnosis are a time of momentous decisions and enormous emotional strain. This book offers readers complete answers to all their questions about the best treatment options for fighting and beating prostate cancer. Bringing together the insights and expertise of 21 of the nation's top prostate cancer specialists from the Mayo Clinic, Harvard Medical School, Memorial Sloan-Kettering, the Seattle Prostate Institute, and other leading treatment centers, The Prostate Cancer Treatment Book provides:Expert information on all treatment options, including surgery, hormonal treatment, external beam radiation, and more In-depth coverage of radioactive seed implantation therapy, the most promising new treatment currently available Real-life accounts of dozens of men who beat prostate cancer",
        "Category": " Health & Fitness , Healing",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Making of Civilization",
        "Authors": "By Whitehouse, Ruth and Wilkins, John",
        "Description": "Two archaeologists trace the development of ancient civilizations and discuss how and why these civilizations collapsed",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Sharks: Savage Predators of the Oceans",
        "Authors": "By McIntyre, John",
        "Description": "",
        "Category": " Nature , Animals , Marine Life",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "China today and her ancient treasures,",
        "Authors": "By Cohen, Joan Lebold",
        "Description": "",
        "Category": "",
        "Publisher": "H. N. Abrams",
        "Price Starting With ($)": "7.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "How to Get Into the Top MBA Programs",
        "Authors": "By Montauk, Richard",
        "Description": "Explains the advantages of getting an MBA degree, discusses the different types of programs, surveys the leading schools, and shows how to make the most of your credentials",
        "Category": " Business & Economics , Education",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Secret Love Affairs",
        "Authors": "By Mandel, Morris",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Jonathan David Publishers",
        "Price Starting With ($)": "6.26",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Loneliness: The Fear of Love (Perennial Library, P333)",
        "Authors": "By Tanner, Ira J.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "Running a One Person Business",
        "Authors": "By Rasberry, Salli and Whitmyer, Claude",
        "Description": "Covers bookkeeping, finances, information, time management, office layout, office equipment, marketing, and common problems",
        "Category": " Business & Economics , New Business Enterprises",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Cravings",
        "Authors": "By Davidson, MaryJanice, Wilks, Eileen, and Hamilton, Laurell K. (EDT)",
        "Description": "Four favorite paranormal romance authors present their favorite characters in four tales of bloodlust, appetites that must be sated again and again, and the passion that feeds them...In the heat of the night, anything goes. Boundaries are crossed and secret yearnings take shape. Creatures stalk the shadows, surrendering to their wildest needs—and satisfying hungers that take their victims beyond fear to the dark edge of desire...Includes an Anita Blake, Vampire Hunter story from New York Times bestselling author Laurell K. Hamilton.",
        "Category": " Fiction , Occult & Supernatural",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Profession and Practice of Program Evaluation (Jossey-Bass Social and Behavioral Science Series)",
        "Authors": "By Anderson, Scarvia B.",
        "Description": "",
        "Category": " Education , Higher",
        "Publisher": "Jossey-Bass Inc Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "Prevention's Complete Book of Walking: Everything You Need to Know to Walk Your Way to Better Health",
        "Authors": "By Spilner, Maggie (EDT)",
        "Description": "\"There are few people who have done more for walking, or who know more about walking, than Maggie Spilner.... This is truly a walking encyclopedia for the new millennium.\"--From the foreword by Elaine Ward, founder and director of the North American Racewalking Foundation From the walking editor of America's number one healthy living magazine comes the definitive guide to America's number one fitness activity: walking. Join Prevention's Maggie Spilner as she introduces you to the tools and techniques that can help you get more from your walking routine. You'll go farther and faster, with greater comfort and less risk of injury. Prevention's Complete Book of Walking features: *Three workout plans to help you walk off extra pounds (page 97) *Step-by-step instructions for finding perfect-fitting shoes (page 47) *Yoga poses that support an efficient, fluid stride (page 131) *A buyer's guide for choosing the best treadmill (page 60) *A complete program to train for a 5-K event (page 151) Prevention's Complete Book of Walking also features the 6-week Dynamic Walking program developed by Suki Munsell, Ph.D. You'll learn to move your body with grace, control, and power, so you'll get even greater benefit from your walking routine.",
        "Category": " Sports & Recreation , Walking",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Shameless Shortcuts: 1,027 Tips and Techniques That Help You Save Time, Save Money, and Save Work Every Day",
        "Authors": "By Bradley, Fern Marshall (EDT)",
        "Description": "",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Yankee Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Dragon (Vlad)",
        "Authors": "By Brust, Steven",
        "Description": "In which Vlad Taltos finds himself, much to his surprise, at the fateful Battle of Baritt's TombMarching through mud just isn't as much fun as they say.After years of surviving in Adrilankha by practicing the trade he knows best—killing people for a living—suddenly Vlad Taltos finds himself in the last place any self-respecting assassin wants to be: the army. Worse, he's right in the middle of a apocalyptic battle between two sorcerous armies, and everyone expects him to play a role they won't explain. All Vlad's got between him and the worst kind of death is his wits. Oh, and a smart-mouthed winged lizard...Dragon is Steven Brust at his best—a swashbuckling fantasy adventure.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Fantasy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Outclassing the Competition: The Up-And-Comer's Guide to Social Survival",
        "Authors": "By Darling, Jan",
        "Description": "A witty guide to social survival presents helpful advice on a wide range of style and etiquette questions, covering such topics as fashion, prep schools, and wine selections",
        "Category": " Social Science , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Tell Me Where It Hurts: A Day of Humor, Healing, and Hope in My Life as an Animal Surgeon",
        "Authors": "By Trout, Nick",
        "Description": "It’s 2:47 a.m. when Dr. Nick Trout takes the phone call that starts another hectic day at the Angell Animal Medical Center. Sage, a ten-year old German shepherd, will die without emergency surgery for a serious stomach condition. Over the next twenty-four hours Dr. Trout fights for Sage’s life, battles disease in the operating room, unravels tricky diagnoses, reassures frantic pet parents, and reflects on the humor, heartache, and inspiration in his life as an animal surgeon. And he wants to take you along for the ride.…From the front lines of modern medicine, Tell Me Where It Hurts is a fascinating insider portrait of a veterinarian, his furry patients, and the blend of old-fashioned instincts and cutting-edge technology that defines pet care in the twenty-first century. For anyone who’s ever wondered what goes on behind the scenes at your veterinarian’s office, Tell Me Where It Hurts offers a vicarious journey through twenty-four intimate, eye-opening, heartrending hours at the premier Angell Animal Medical Center in Boston.You’ll learn about the amazing progress of modern animal medicine, where organ transplants, joint replacements, and state-of-the-art cancer treatments have become more and more common.  With these technological advances come controversies and complexities that Dr. Trout thoughtfully explores, such as how long (and at what cost) treatments should be given, how the Internet has changed pet care, and the rise in cosmetic surgery.You’ll also be inspired by the heartwarming stories of struggle and survival filling these pages. With a wry and winning tone, Dr. Trout offers up hilarious and delightful anecdotes about cuddly (or not-so-cuddly) pets and their variously zany, desperate, and demanding owners.  In total, Tell Me Where It Hurts offers a fascinating portrait of the comedy and drama, complexities and rewards involved with loving and healing animals.Part ER, part Dog Whisperer, and part House, this heartfelt and candid book shows that while the technology has changed since James Herriot’s day, the humanity and compassion remains unchanged. If you’ve ever had a pet or special place in your heart for furry friends, Dr. Trout’s irresistible book is for you.",
        "Category": " Pets , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Lonely Planet Poland",
        "Authors": "By Dydynski, Krzysztof",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Lonely Planet Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Q.B.VII",
        "Authors": "By Leon Uris",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Manager as Negotiator",
        "Authors": "By Lax, David A. and Sebenius, James K.",
        "Description": "This fine blend of Harvard scholarship and seasoned judgment is really two books in one. The first develops a sophisticated approach to negotiation for executives, attorneys, diplomats -- indeed, for anyone who bargains or studies its challenges. The second offers a new and compelling vision of the successful manager: as a strong, often subtle negotiator, constantly shaping agreements and informal understandings throughout the complex web of relationships in an organization.Effective managers must be able to reach good formal accords such as contracts, out-of-court settlements, and joint venture agreements. Yet they also have to negotiate with others on whom they depend for results, resources, and authority. Whether getting fuller support from the marketing department, hammering out next year's budget, or winning the approval for a new line of business, managers must be adept at advantageously working out and modifying understandings, resolving disputes, and finding mutual gains where interests and perceptions conflict. In such situations, The Manager as Negotiator shows how to creatively further the totality of one's interests, including important relationships -- in a way that Richard Walton, Harvard Business School Professor of Organizational Behavior, describes as \"sensitive to the nuances of negotiating in organizations\" and \"relentless and skillful in making systematic sense of the process.\"This book differs fundamentally from the recent spate of negotiation handbooks that tend to espouse one of two approaches: the competitive (\"Get yours and most of theirs, too\") or the cooperative (\"Everyone can always win\"). Transcending such cynical and naive views, the authors develop a comprehensive approach, based on strategies and tactics for productively managing the tension between the cooperation and competition that are both inherent in bargaining.Based on the authors' extensive experience with hundreds of cases, and peppered with a number of wide-ranging examples, The Manager as Negotiator will be invaluable to novice and experienced negotiators, public and private managers, academics, and anyone who needs to know the state of the art in this important field.",
        "Category": " Business & Economics , Negotiating",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "WP3 - Piano Lessons - Level 2 - Bastien Piano Library",
        "Authors": "By Bastien, James",
        "Description": "",
        "Category": " Music , General",
        "Publisher": "Kjos Music Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "WP20 - Note Speller - Level 1 - Bastien Piano Library",
        "Authors": "By Jane Bastien",
        "Description": "",
        "Category": "",
        "Publisher": "Kjos Music Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Defender (A Dark Ops Novel)",
        "Authors": "By Mann, Catherine",
        "Description": "The sizzling first book in the DarkOps Defenders series.When a USO boat goes down in flames, pilot JimmyGage pulls a scantily clad Chloe Nelson out of sharkfilledwaters. Chloe isn’t looking for a jet-jock to beher bodyguard—until she finds herself side by sidewith Gage on a dangerous mission.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "HypnoBirthing: The Mongan Method: A natural approach to a safe, easier, more comfortable birthing (3rd Edition)",
        "Authors": "By Mongan, Marie F.",
        "Description": "\"Move over, Lamaze. HypnoBirthers say their form of deep relaxation takes the panting and pain out of labor.\"-Time MagazineHypnoBirthing®: A Celebration of Life Childbirth is not something to be feared; it is a natural expression of life. With HypnoBirthing, your pregnancy and childbirth will become the gentle, life-affirming process it was meant to be.In this easy-to-understand guide, HypnoBirthing founder Marie Mongan explodes the myth of pain as a natural accompaniment to birth. She proves through sound medical information that it is not our bodies but our culture that has made childbirth a moment of anguish, and that when we release the fear of birth, a fear that is keeping our bodies tense and closed, we will also release the pain.HypnoBirthing is nature, not manipulation. It relaxes the mind in order to let the body work as it is designed. The HypnoBirthing exercises—positive thinking, relaxation, visualization, breathing and physical preparation—will lead to a happy and comfortable pregnancy, even if you are currently unsure of an intervention-free birth. Your confidence, trust and happy anticipation will in turn lead to the peaceful, fulfilling and bonding birth that is your right as a mother.More than 10,000 happy couples have had their lives changed for the better by HypnoBirthing. More than 500 news organizations—including Good Morning America, The Today Show, Dateline, The Richard & Judy Show,Time, Newsweek, Parenting and Better Homes & Gardens—have joined the movement for better birthing.Why is HypnoBirthing changing the way the world gives birth? That's simple. Because it works.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Health Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Code of Honor (Hqn Romance)",
        "Authors": "By Mann, Catherine",
        "Description": "Determined to avenge the death of her husband Cooper, photojournalist Brigid Wheeler finds an ally in Cooper's best friend, Air Force Captain Joe Greco,  and together, while fighting the passion that rages between them, they make a shocking discovery that rocks both of their worlds. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Convenience Cook: 125 Best Recipes for Easy Homemade Meals Using Time-Saving Foods from Boxes, Bottles, Cans and More",
        "Authors": "By Finlayson, Judith",
        "Description": "How to make delicious meals from prepared convenience foods.     Create sensational family meals that taste like they were made from scratch, yet actually use convenience foods -- canned, frozen, bagged, boxed, or from a jar. For soul-satisfying weekday meals to decadent desserts, all you need are common and convenient supermarket ingredients. With the 125 recipes in The Convenience Cook, managing mealtime has never been easier.    Take a can of salmon and create an inspired Thai-Style Curry, simply by adding some coconut milk and a few pantry ingredients. Create an Easy Shepherd's Pie by using convenience foods like ground beef, canned beef broth and frozen hash brown potatoes. A dozen recipes use one of the most commonly available convenience foods: chicken. When kids need a quick treat, simply unwrap the crescent roll dough, add some applesauce,            dried cranberries, a little sugar and cinnamon and presto! you have an easy and delicious Apple Cranberry Pan Dowdy.    Included is a listing of pantry staples and lots of helpful tips, techniques and imaginative variations for each recipe.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Robert Rose",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Fools Rush In",
        "Authors": "By Higgins, Kristan",
        "Description": "Rewarding job as a local doctor on Cape Cod? Check. Cute cottage of her very own? Check. Adorable puppy suitable for walks past attractive locals? Check! All she needs is for golden boy and former crush Joe Carpenter to notice her, and Millie will be set.But perfection isn't as easy as it looks—especially when Sam Nickerson, a local policeman, is so distracting. Sure, he needs a friend after being dumped by Millie's fortune-hunting sister, but does she really need to enjoy his company that much? He is definitely not part of her master plan. But maybe it's time for Millie to start a new list&#133;",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Body Language (HQN Books)",
        "Authors": "By Criswell, Millie",
        "Description": "UN interpreter Ellie Peters's seemingly perfect life becomes extremely chaotic and complicated when her obsessive-compulsive, disinfectant-loving mother moves in with her, and her ex-fiancé, Michael Deavers, becomes her new boss. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The House in Ruins",
        "Authors": "By Robert S. Weekley",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Transforming Classroom Grading",
        "Authors": "By Marzano, Robert J.",
        "Description": "Discusses alternatives to grading and different types of student assessment.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "ReaLemon Recipe Collection",
        "Authors": "By ReaLemon",
        "Description": "",
        "Category": "",
        "Publisher": "Borden, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Anna Casey's Place in the World (Neighborhood Novels)",
        "Authors": "By Fogelin, Adrian and Schultz, Suzy (ILT)",
        "Description": "How do you face life without a place to call home?Anna Casey is learning to deal with the loss of her family and adjust to living in a foster home with Miss Dupree. Feeling abandoned and alone, Anna turns to her closest companion, her explorer journal filled with drawn maps of her earlier neighborhoods and all the places that she has called home.Anna is determined to become part of a real family, and with the help of a scrawny new friend named Eb, an unconventional biology teacher in cowboy boots, a homeless Vietnam vet, and a motley crew of kids from the neighborhood, Anna discovers a sense of belonging…and her own place in the world.With warmth and humor, award-winning author Adrian Fogelin follows up her critically acclaimed novel Crossing Jordan with the story of a young girl’s trials and triumphs as she tries to find a home.",
        "Category": " Juvenile Fiction , Family , Orphans & Foster Homes",
        "Publisher": "Peachtree Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Summer Bridge Activities 7th-8th Grades",
        "Authors": "By Orr, James Michael, Livingston, Spencer, and D'Amico, Francesca",
        "Description": "",
        "Category": " Education , Secondary",
        "Publisher": "Rainbow Bridge Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Yankee G-man",
        "Authors": "By Frederick Ayer",
        "Description": "",
        "Category": "",
        "Publisher": "H. Regnery C",
        "Price Starting With ($)": "9.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Liberty and Tyranny: A Conservative Manifesto",
        "Authors": "By Levin, Mark R.",
        "Description": "Don’t miss syndicated radio host and author Mark Levin's #1 New York Times acclaimed and longtime bestselling manifesto for the conservative movement.When nationally syndicated radio host Mark R. Levin’s Liberty and Tyranny appeared in the early months of the Obama presidency, Americans responded by making his clarion call for a new era in conservatism a #1 New York Times bestseller for an astounding twelve weeks. As provocative, well-reasoned, robust, and informed as his on-air commentary, with his love of our country and the legacy of our Founding Fathers reflected on every page, Levin’s galvanizing narrative provides a philosophical, historical, and practical framework for revitalizing the conservative vision and ensuring the preservation of American society.  In the face of the modern liberal assault on Constitution-based values, an attack that has resulted in a federal government that is a massive, unaccountable conglomerate, the time for reinforcing the intellectual and practical case for conservatism is now. In a series of powerful essays, Levin lays out how conservatives can counter the tyrannical liberal corrosion that has filtered into every timely issue affecting our daily lives, from the economy to health care, global warming to immigration, and more.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Threshold Editions",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Cursive Writing (Wipe-Off Workbooks)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Dalmatian Press",
        "Price Starting With ($)": "5.03",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Great American Quilts 1991",
        "Authors": "By Bonesteel, Georgia",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Wipe-Off Activity Book, Holiday Treats and Toys: Fun Activities, Numbers, What Belongs & What Doesn't Belong (Holiday Wipe-Off Books)",
        "Authors": "By Learning Horizons",
        "Description": "",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Learning Horizons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Star Wars : The Official 20th Anniversary Commemorative Magazine",
        "Authors": "By Bob Woods (ed.)",
        "Description": "",
        "Category": "",
        "Publisher": "Topps Company",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "AlphaTales (Letter S: Seal\u0092s Silly Sandwich): A Series of 26 Irresistible Animal Storybooks That Build Phonemic Awareness & Teach Each letter of the Alphabet",
        "Authors": "By Harvey, Paul (ILT) and Sklar, Dorothy I.",
        "Description": "Come for supper at Seal&#8217s house! This story about a super-duper sandwich will surprise kids and teach them the letter S. AlphaTales are humorous stories designed to help young children recognize letters and the sounds they make. Lay the foundation for reading success with these kid-pleasing books&#8212one for each letter of the alphabet. For use with Grades PreK-1.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Healing Time of Hickeys",
        "Authors": "By Rivers, Karen",
        "Description": "Haley Andromeda is 16, and in her last year of high school - \"The Greatest Year of My Life,\" or TGYML. Haley likes to think she's just a normal girl, plagued with all the normal doubts of a too-smart-for-her-own-good, slightly hypochondriac, hickey-prone teenager. But part way through the year, disaster strikes: Haley comes down with chickenpox; her best friend Jules won't speak to her; the object of her affections, a boy named J. T., won't even look at her; and worst of all, her harmless hippie Dad is in some mysterious trouble with the law. In desperation, Haley turns to the Ouija board and tries to communicate with the Other Side, but this leads to a further, unexpected complication: Why does the dead boy she channels seem more attractive than the real boy who wants to spend time with her?  The Healing Time of Hickeys,  written in diary form, takes the reader on a compelling, wryly funny journey to discover the answer to this question, and several more that Haley thinks she keeps hidden from everyone.",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "Raincoast Books, Polestar",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    }
]