[
    {
        "Title": "The Breadman's Healthy Bread Book",
        "Authors": "By Burnett, George",
        "Description": "For Every Electric Bread Machine--Foolproof Recipes For Wholesome, Naturally  Delicious, Healthful Breads!Until now, bread machine cookbooks have been full of recipes that used denatured flours, saturated fats, refined sugar, and artifical flavors. Now, at last, television's famous Breadman shows how you can use his ingeniously simple recipes to turn your bread machine into the source of life-giving, whole-grain breads that are sweetened without sugar, have almost no saturated fats, are low in calories--are 100 percent delcious! Here are amazing simple bread machine recipes for:Buckwheat Oat BreadHoney, Granola, and Yogurt BreadSourdough Wheat BreadApricot Nut BreadJalapeño CornbreadWhole-Wheat Pizza DoughBlueberry Lemon BreadAnd much, much more!You can lose weight, help lower your cholesterol, benefit from health-giving vitamins and minerals, and add essential fiber to your diet--just by eating the Breadman's scrumptious breakfast breads, hearty sandwhich loaves (topped with his special low-calorie spreads!), and phenomenal holiday and gift breads.And each recipe is given separately for large and small loaves. No matter what size machine you have, your bread will be perfect.",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Literacy for the 21st Century: A Balanced Approach (4th Edition)",
        "Authors": "By Tompkins, Gail E.",
        "Description": "NOTE: Used books, rentals, and purchases made outside of Pearson If purchasing or renting from companies other than Pearson, the access codes for the Enhanced Pearson eText may not be included, may be incorrect, or may be previously redeemed. Check with the seller before completing your purchase.This package includes the Enhanced Pearson eText with MyEducationLab and the bound book.Literacy for the 21st Century: A Balanced Approach is a thoroughly applied text written to ensure that readers understand the current theories behind and the critical components of instruction for teaching reading and writing as complementary in the development of literacy. Readers are treated to a philosophical approach that not only balances the why, what, and how of teaching literacy but also offers practical pedagogy–teaching strategies and instructional procedures–that foster thoughtful teacher preparation and ensures alignment to the literacy goals teachers are responsible to teach. New text features model practices that support diverse populations, instruction driven by sound classroom assessment, and new literacy strategies that will help teachers transform literacy learning with digital devices. Integrating the best of what we know about teaching reading and writing, the Sixth Edition of this popular introductory text provides the balance teachers need to be successful in the classroom. The Enhanced Pearson eText features embedded video.Improve mastery and retention with the Enhanced Pearson eText*The Enhanced Pearson eText provides a rich, interactive learning environment designed to improve student mastery of content. The Enhanced Pearson eText is:Engaging. The new interactive, multimedia learning features were developed by the authors and other subject-matter experts to deepen and enrich the learning experience.Convenient. Enjoy instant online access from your computer or download the Pearson eText App to read on or offline on your iPad® and Android® tablet.*Affordable. The Enhanced Pearson eText may be purchased stand-alone or with a loose-leaf version of the text for 40-65% less than a print bound book.* The Enhanced eText features are only available in the Pearson eText format. They are not available in third-party eTexts or downloads.*The Pearson eText App is available on Google Play and in the App Store. It requires Android OS 3.1-4, a 7” or 10” tablet, or iPad iOS 5.0 or later.0133400905 / 9780133400908 Literacy for the 21st Century Plus NEW MyEducationLab with Video-Enhanced Pearson eText -- Access Card PackagePackage consists of: 013283779X / 9780132837798 Literacy for the 21st Century: A Balanced Approach0133386473 / 9780133386479 NEW MyEducationLab with Video-Enhanced Pe",
        "Category": " Language Arts & Disciplines , Literacy",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Chimney Sweeper: A Murder Novel",
        "Authors": "By Cooke, John Peyton",
        "Description": "Jesse James Colson drifted into Isthmus City in a pair of too-tight blue jeans and stolen 14-eye Doc Martens, flashing a twisted grin and carrying a loaded .38 in his waistband. Before this night was over, someone was going to die from a bullet in Jesse's gun - one more death in a long, strange death trip. But Jesse would be married to this killing forever.Jesse stuffed the body of his victim into the chimney of an abandoned house before he fled Isthmus City that night. Then the city pulled him back - battered, bloodied, and stumbling wildly into the arms of an older man with bizarre tastes. In Isthmus City's gay community, Jesse found a home. Then he found a career and another side of himself. He became a cop.Burying years of rage, pain, and confusion into a custom-tailored, tight-fitting blue cotton uniform, he learned what it took to react under pressure, to match criminals with their crimes, even to pull the trigger on his 9mm Glock. He almost learned to forget about his violent past. Until he was called to a half-demolished crack house to investigate a grisly discovery: a skeleton in a chimney...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Best Ever Italian Cookbook",
        "Authors": "By Carla Capalbo",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Mara and Dann: An Adventure",
        "Authors": "By Lessing, Doris May",
        "Description": "Thousands of years in the future, all the northern hemisphere is buried under the ice and snow of a new Ice Age. At the southern end of a large landmass called Ifrik, two children of the Mahondi people, seven-year old Mara and her younger brother, Dann, are abducted from their home in the middle of the night. Raised as outsiders in a poor rural village, Mara and Dann learn to survive the hardships and dangers of a life threatened as much by an unforgiving climate and menacing animals as by a hostile community of Rock People. Eventually they join the great human migration North, away from the drought that is turning the southern land to dust, and in search of a place with enough water and food to support human life. Traveling across the continent, the siblings enter cities rife with crime, power struggles, and corruption, learning as much about human nature as about how societies function. With a clear-eyed vision of the human condition, Mara and Dann is imaginative fiction at its best.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Debbie Mumm's Joyful Traditions for the Holidays",
        "Authors": "By Mumm, Debbie",
        "Description": "",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Landauer Books",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Learning JavaScript",
        "Authors": "By Powers, Shelley",
        "Description": "As web browsers have become more capable and standards compliant, JavaScript has grown in prominence. JavaScript lets designers add sparkle and life to web pages, while more complex JavaScript has led to the rise of Ajax -- the latest rage in web development that allows developers to create powerful and more responsive applications in the browser window.Learning JavaScript introduces this powerful scripting language to web designers and developers in easy-to-understand terms. Using the latest examples from modern browser development practices, this book teaches you how to integrate the language with the browser environment, and how to practice proper coding techniques for standards-compliant web sites. By the end of the book, you'll be able to use all of the JavaScript language and many of the object models provided by web browsers, and you'll even be able to create a basic Ajax application.",
        "Category": " Computers , Programming Languages , JavaScript",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Pitcher's Choice",
        "Authors": "By Evelyn Lunemann",
        "Description": "",
        "Category": "",
        "Publisher": "Benefic Press, Westchester, Illinois",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The New Spirit of Watercolor",
        "Authors": "By Ward, Mike",
        "Description": "",
        "Category": "",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Body Clock Guide to Better Health: How to Use your Body's Natural Clock to Fight Illness and Achieve Maximum Health",
        "Authors": "By Smolensky, Michael, Ph.D. and Lamberg, Lynne",
        "Description": "A medical breakthrough explained by the leading authority on the connection between health and your body clockChronotherapy-adjusting the care of the body to coincide with the body's natural clock-is poised to be the next major revolution in medical science. An understanding and awareness of these rhythms will enable us to maximize the effects not only of medications and other treatments, but also of diets, exercise programs, and other daily routines. The Body Clock Guide to Better Health combines a detailed discussion of major issues such as sleep, exercise, and nutrition, with a comprehensive A-to-Z reference to specific disorders. Among the health concerns it addresses are AIDS, arthritis, asthma, ADD, backache, cancer, depression, diabetes, digestive problems, allergies, heart disease, chronic pain, sexual dysfunction, stroke, and complications from pregnancy. General chapters explore the big picture-including monthly cycles and life cycles-and provide invaluable advice on foods and dietary supplements, fitness, better sex, jet lag, and more. The first book to look at body rhythms from a practical perspective, The Body Clock Guide to Better Health offers readers the dual benefits of improving the treatment of specific conditions while boosting their overall health and wellness.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Dog Train: A Wild Ride on the Rock-and-Roll Side",
        "Authors": "By Boynton, Sandra and Ford, Michael",
        "Description": "Boynton rocks! So does Blues Traveler, who perform a stomping version of the title song, a moody rock journey that Boynton wrote especially for them. And then there’s Alison Krauss with “Evermore.” And Steve Lawrence & Eydie Gorme—really—who do the “Boring Song.” The Spin Doctors, who channel rock’s rebellious side—with a taste of punk—for “Tantrum”: “No No No, I don’t want to, I don’t want to./No no no, I don’t want to, no no./Leave me alone. Leave me alone./LEAVE ME ALONE.” And the sweetly unexpected pairing of “Weird Al” Yankovic and Kate Winslet (yep, Kate Winslet) as a duet singing “I Need a Nap.”   Full of attitude, full of fun, all lit up with star power, and boasting a variety of Top 40 styles—rock and roll, blues, hip-hop, and power pop—Dog Train is the third book-and-CD production by Sandra Boynton, following the #1 New York Times bestselling, Grammy-nominated Philadelphia Chickens (432,000 copies in print) and the recently re-released Rhinoceros Tap (203,000 copies in print). Like Philadelphia Chickens, features all original songs recorded by a mix of big-name acts and great voices, for the pleasure of the parents as much as the kids. Packaged similarly to the previous Boynton & Ford recordings, Dog Train is also a full-color book that features a portion of each song’s lyrics set as a little story, accompanied by Boynton’s irresistible hippos, cows, dogs, and more dogs. Full lyrics appear in the back.",
        "Category": " Juvenile Nonfiction , Music , Songbooks",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "6.34",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "No One Like You",
        "Authors": "By Jillian Harker",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Little Engine That Could and the Snowy, Blowy Christmas (All Aboard Book)",
        "Authors": "By Piper, Watty and Ong, Cristina (ILT)",
        "Description": "Poor Santa! All eight of his reindeer are sneezing so hard they can't fly. Who will help him deliver his last present? \"I think I can,\" says everyone's favorite Little Blue Engine!",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Reese's Pieces Count By Fives",
        "Authors": "By Pallotta, Jerry and Bolster, Rob (ILT)",
        "Description": "Different kinds of trucks moving Reese's Pieces show how to count to 100.",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Curious George the Movie: Curious George's Big Adventures",
        "Authors": "By Rey, H. A., Rey, Margret, and Anderson, R. P.",
        "Description": "George has lots of fun living in his jungle home until he meets a man in a yellow hat and decides to follow him out of the jungle and onto a big ship headed for adventure.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The New Potty (Little Critter) (Look-Look)",
        "Authors": "By Mayer, Gina and Mayer, Mercer",
        "Description": "Mercer Mayer’s Little Critter is dealing with his little sister learning to use the potty in this classic, funny, and heartwarming book. Whether he’s trying to help her make it to the bathroom, encouraging her when she does well, or getting frustrated when she doesn’t, both parents and children alike will relate to this beloved story. A perfect way to teach children about potty training and how to be a good older sibling!",
        "Category": " Juvenile Fiction , Health & Daily Living , Toilet Training",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Bambi's Fragrant Forest (Golden Scratch & Sniff Book)",
        "Authors": "By Walt Disney Productions and Salten, Felix",
        "Description": "Scratch-and-sniff fragrance labels allow the young reader to share with Bambi the smells and aromas of his forest and meadow home",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "7.92",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "How Do Dinosaurs Play with Their Friends?",
        "Authors": "By Yolen, Jane and Teague, Mark (ILT)",
        "Description": "The bestselling, award-winning team of Yolen and Teague present their fourth original dinosaur board book, a fun guide to friendship and playing nicely with others.What if a dinosaur's friends come to play?Does he mope, does he pout if he can't get his way?Does he hide all his dump trucks, refusing to share?Does he throw his friends' coloring books up in the air?Time and time again, children are told to \"play nice.\"  This brilliantly illustrated board book is packed with rhymes that will teach children how. Mark Teague's laugh-aloud illustrations, along with Jane Yolen's playful text, will show children that \"playing nice\" can be easy and fun.  Perfect for parents to read aloud with their children, this book is as humorous as it is instructive.",
        "Category": " Juvenile Fiction , Social Themes , Manners & Etiquette",
        "Publisher": "The Blue Sky Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Eating Well Through Cancer: Easy Recipes & Recommendations During & After Treatment",
        "Authors": "By Clegg, Holly and Miletello, Gerald, M.D.",
        "Description": "",
        "Category": " Cooking , Health & Healing , Cancer",
        "Publisher": "Holly B Clegg",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Women of Faith Devotional Bible: A Message of Grace & Hope for Every Day : New King James Version",
        "Authors": "By Thomas Nelson",
        "Description": "The Women of Faith® Devotional Bible provides women with the inspiration and resources needed to strengthen their walk with God and build stronger relationships with others. It helps women of all ages and stages in life--mature believers and those who have yet to believe, from all backgrounds, church and non-churched--to grow spiritually, emotionally, and relationally.Writers of the devotionals include the well-known and best-loved Women of Faith® speakers:Patsy Clairmont, Barbara Johnson, Marilyn Meberg, Luci Swindoll, Sheila Walsh, and Thelma Wells.Contributing writers include: Kathy Troccoli, Jan Silvious, Jill Briscoe, Babbie Mason, Point of Grace, and many others.",
        "Category": " Bibles , New King James Version , General",
        "Publisher": "Nelson Bibles",
        "Price Starting With ($)": "6.33",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "What Paul Meant",
        "Authors": "By Wills, Garry",
        "Description": "“If you think you knew Paul, get ready to have all sorts of cherished preconceptions exhilaratingly stripped away. If you've ever been vaguely curious, there is no finer introduction.” (Los Angeles Times)Look out for a new book from Garry Wills, What The Qur'an Meant, coming fall 2017.   In his New York Times bestsellers What Jesus Meant and What the Gospels Meant, Garry Wills offers fresh and incisive readings of Jesus' teachings and the four gospels. Here Wills turns to Paul the Apostle, whose writings have provoked controversy throughout Christian history. Upending many common assumptions, Wills argues eloquently that Paul’s teachings are not opposed to Jesus' message. Rather, the best way to know Jesus is to discover Paul. In this stimulating and masterly analysis, Wills illuminates how Paul, writing on the road and in the heat of the moment, and often in the midst of controversy, galvanized a movement and offers us the best reflection of those early times.",
        "Category": " Religion , Biblical Studies , New Testament , Paul's Letters",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "50 Country Quilting Projects",
        "Authors": "By Echols, Margit (EDT)",
        "Description": "Includes patterns and detailed step-by-step instructions for making quilts, wall hangings, and gift items",
        "Category": " Art , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The History of Religion",
        "Authors": "By Karen Farrington, Karen Farrington",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes&Noble",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Christmas Cooking From the Heart: Celebrating Our World",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1828"
        }
    },
    {
        "Title": "Ripley's Believe It or Not! Encyclopedia of the Bizarre (Ripley's Believe It or Not! (Scholastic Unnumbered PB))",
        "Authors": "By Mooney, Julie",
        "Description": "AN ASTONISHING TOUR OF THE MOST BIZARRE AND AMAZING OCCURRENCES FROM AROUND THE GLOBE!Ripleys Believe It or Not! Encyclopedia of the Bizarre is the weirdest, wackiest, most outrageously srange collection of feats, stories, facts and records— all real and all recorded by the editors of Ripley's Believe It or Not!More than 6,000 mind boggling oddities!More than 1,400 eye-popping photographs, illustrations and cartoons! Covers every subject including Accidents and Disasters; Feats and Stunts, Prophecies, Coincidences, Animals, Human Anatomy, Sports, Weather, Architecture, Archaeology, the Unexplained and more!IMPOSSIBLE TO PUT DOWN!WHERE ELSE CAN YOU LEARN THAT:AN ESTIMATED 10,000,000,000,000,000,000,000,000,000,000,000 SNOWFLAKES HAVE FALLEN TO THE EARTH SINCE THE EARTH WAS FORMED!QUEEN ISABEAU OF BAVARIA USED A MIXTURE OF BOAR'S BRAINS, CROCODILE GLANDS, AND WOLF BLOOD AS SKIN LOTION!ALFRED LANGEVIN COULD SMOKE A PIPE, PLAY A RECORDER, SMOKE A CIGARETTE AND EVEN BLOW UP A BALLOON THROUGH HIS EYE!ANNA BREAD MARRIED JOHN BUTTER IN LEEDS, ENGLAND, APRIL 22, 1926!PHIL TURCO OF MADISON, WISCONSIN, SWALLOWED 339 GOLDFISH IN TWO HOURS!",
        "Category": " Photography , Collections, Catalogs, Exhibitions , General",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "8.46",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Richard Scarry's First Little Learners: Cars and Trucks",
        "Authors": "By Richard Scarry",
        "Description": "",
        "Category": "",
        "Publisher": "J. B. Communications, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Weather of the Heart: Glimpses of God in Sunlight and Storm",
        "Authors": "By Gigi Graham Tchividjian",
        "Description": "",
        "Category": "",
        "Publisher": "Multnomah Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Egypt: Land of the Pharaohs",
        "Authors": "By Schulz, Regine (EDT)",
        "Description": "",
        "Category": " History , Middle East , Egypt",
        "Publisher": "Konemann",
        "Price Starting With ($)": "10.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Little Community and Peasant Society and Culture",
        "Authors": "By Redfield, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Barbie in the 12 Dancing Princesses (Step into Reading, Step 2)",
        "Authors": "By Grimm, Wilhelm, Grimm, Jacob, Redbank, Tennant, Ruby, Cliff, and Lesser, Elana",
        "Description": "Princess Barbie and her sisters dance the night away in a magical, musical adventure in Barbie in the Twelve Dancing Princesses! Barbie and her princess sisters love to dance and sing, but thier evil Aunt Rowena doesn't believe it's proper princess behavior. The princesses escape to a secret, magical palace--but when Barbie discovers that her aunt is plotting to rule the kingdom, she must return to save her father, the king! Girls will love to read all about the Barbie princesses in this beautifully illustrated hardcover storybook based on Barbie's 7th direct to DVD movie.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Family Games",
        "Authors": "By Wall, Amy",
        "Description": "Provides descriptions, rules, and strategies for games a family can play indoors or outdoors, including dominoes, poker, croquet, and hopscotch.",
        "Category": " Family & Relationships , Activities",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Lewis & Clark: Voyage of Discovery",
        "Authors": "By Ambrose, Stephen E. and Abell, Sam",
        "Description": "Lewis and Clark?s Voyage of Discovery defined the American spirit like no other event of the 19th century. Now, in celebration of its bicentennial, Stephen E. Ambrose offers a refreshing look at the explorers and their legendary journey in this IMAX® bicentennial edition of Lewis & Clark: Voyage of Discovery. In a new illustrated introduction, Ambrose talks about the making of the film and its significance in commemorating and documenting the expedition, and the land it crossed, 200 years later. Voyage of Discovery is an exceptional work of history and photography that National Geographic is proud to feature in coordination with the National Lewis and Clark Bicentennial Council and their celebration of 2003-2006. Changed by time but timeless in its inspiration, the Lewis and Clark Trail comes to life through Stephen E. Ambrose?s inspired narrative, rich commentary, personal selections from the explorers?s journals, and an accompaniment of stunning new photographs that exhibit the undying beauty of the American West. National Geographic photographer Sam Abell presents an array of compelling modern images from the Missouri to the Pacific Coast that offset rare historic photos, art, and maps?some sketched by Lewis and Clark themselves. Lewis and Clark?s Voyage of Discovery defined the American spirit like no other event of the 19th century. Now, in celebration of its bicentennial, Stephen E. Ambrose offers a refreshing look at the explorers and their legendary journey in this IMAX® bicentennial edition of Lewis & Clark: Voyage of Discovery. In a new illustrated introduction, Ambrose talks about the making of the film and its significance in commemorating and documenting the expedition, and the land it crossed, 200 years later. Voyage of Discovery is an exceptional work of history and photography that National Geographic is proud to feature in coordination with the National Lewis and Clark Bicentennial Council and their celebration of 2003-2006. Changed by time but timeless in its inspiration, the Lewis and Clark Trail comes to life through Stephen E. Ambrose?s inspired narrative, rich commentary, personal selections from the explorers?s journals, and an accompaniment of stunning new photographs that exhibit the undying beauty of the American West. National Geographic photographer Sam Abell presents an array of compelling modern images from the Missouri to the Pacific Coast that offset rare historic photos, art, and maps?some sketched by Lewis and Clark themselves.",
        "Category": " History , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Well-Tended Perennial Garden: Planting & Pruning Techniques",
        "Authors": "By Disabato-Aust, Tracy and Still, Steven M. (FRW)",
        "Description": "With more than 180,000 copies sold since its original publication, The Well-Tended Perennial Gardenhas proven itself to be one of the most useful tools a gardener can have. Now, in this expanded edition, there's even more to learn from and enjoy.This is the first, and still the most thorough, book to detail essential practices of perennial care such as deadheading, pinching, cutting back, thinning, disbudding, and deadleafing, all of which are thoroughly explained and illustrated. More than 200 new color photographs have been added to this revised edition, showing perennials in various border situations and providing images for each of the entries in the A-to-Z encyclopedia of important perennial species. In addition, there is a new 32-page journal section, in which you can enter details, notes, and observations about the requirements and performance of perennials in your own garden.Thousands of readers have commented that The Well-Tended Perennial Garden is one of the most useful and frequently consulted books in their gardening libraries. This new, expanded edition promises to be an even more effective ally in your quest to create a beautiful, healthy, well-maintained perennial garden.",
        "Category": " Gardening , Techniques",
        "Publisher": "Timber Pr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "The Cool Girl's Guide to Knitting",
        "Authors": "By Trench, Nicki",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Compassion In Action: Setting Out on the Path of Service",
        "Authors": "By Dass, Ram and Bush, Mirabai",
        "Description": "This book can make an extraordinary difference in the way we see one another, ourselves, and the vast amount of suffering in the world. Here is a guide for those who are just beginning to realize that self-fulfillment is possible through service to others. No two people are better qualified to help us along this path than Ram Dass, who has spent more than twenty years teaching and writing on the subject of living consciously, and Mirabai Bush, who succeeded him as chairperson of the Seva Foundation, an international organization devoted to compassionate service.The first part of the book is Ram Dass's spiritual autobiography, in which he reflects on the lessons of his own life and addresses two vital questions: \"What in us responds to the needs of others?\" and \"What can we actually do to alleviate suffering?\" Mirabai Bush then counsels readers on how to identify their most useful talents, gives direction for finding opportunities to serve in the community, and offers very practical suggestions on how to get started.What we have to give is who we are. We need to grow in awareness and insight if we wish to become more effective instruments for change. In this book of heartfelt encouragement and advice, Ram Dass and Mirabai Bush demonstrate the interdependence of social and spiritual development, reawakening in us the memory of true citizenship--a vital force in the conscious relief of pain and suffering. As His Holiness, the Dalai Lama, has said, \"Love and compassion are necessities, not luxuries. Without them, humanity cannot survive.\"",
        "Category": "",
        "Publisher": "Harmony / Bell Tower",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Exposures: Women & Their Art",
        "Authors": "By Raven, Arlene, Brown, Betty Ann, and Love, Kenna",
        "Description": "Offers portraits and brief profiles of fifty contemporary women artists",
        "Category": " Art , General",
        "Publisher": "Newsage Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Comfort Food",
        "Authors": "By Family Circle",
        "Description": "This cookbook offers some traditional recipes that shout pure indulgence, from the not-so-light suppers like French Onion Soup and Smoked Haddock Chowder to Macaroni Cheese Bake, Toad in the Hole and Bubble and Squeak. Other dishes include Chicken and Leek Pie, and Beef in Red Wine.",
        "Category": " Cooking , General",
        "Publisher": "Gardners Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Spot Loves His Mommy",
        "Authors": "By Hill, Eric",
        "Description": "Spot loves spending time with his Mom.Whether playing hide-and-seek, baking a cake, or reading his favorite story, Spot and Mommy have lots of fun together. Perfect for Mother’s Day and all year long, this touching and heartwarming book is great for sharing.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Warne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Endless Adventure",
        "Authors": "By Coman, Dale",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Regnery Co.",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Bunny's Noisy Book",
        "Authors": "By Brown, Margaret Wise and McCue, Lisa (ILT)",
        "Description": "From best-selling author Margaret Wise Brown, comes a wonderfully satisfying board book edition of a beloved story. Brown's lyrical text and gentle question/answer format offer young children plenty of opportunity to chime right in! The sweet characters are brought to life with adorable paintings by best-selling artist Lisa McCue.",
        "Category": " Juvenile Fiction , Animals , Rabbits",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Rani in the Mermaid Lagoon (Disney Fairies)",
        "Authors": "By Papademetriou, Lisa",
        "Description": "Rani doesn't fit in. Ever since she had to cut off her wings to save Mother Dove, she doesn’t feel like she belongs with the water talent fairies. In fact, without wings, she doesn’t feel like she belongs with any fairies at all. Rani sets off on a perilous journey to find a home, a journey that leads her underwater, deep into the lagoon, where the mermaids live. Maybe there Rani will discover who her true friends are!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Prilla And the Butterfly Lie (Disney Fairies)",
        "Authors": "By Shimabukuro, Denise (ILT) and Richards, Kitty",
        "Description": "Prilla just can't say no. When Nettle asks her to join in on caterpillar sheering for the second day in a row, Prilla tells a little white lie—she prefers butterflies to caterpillars. Then all the butterfly-herding talent fairies come down with a case of fairy pox, and because of her \"love of butterflies,\" Prilla is asked to help out. But butterfly-herding is a lot harder than it sounds. Butterflies are downright mischievous, making Prilla's life perfectly miserable. Is it time for Prilla to 'fess up?\"A charming tale about finding faith in oneself.\" —Discovery Girls",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "What Can I Bring? Sharing Good Tastes and Times in Northern Virginia",
        "Authors": "By Junior League of Northern Virginia",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Wimmer Book Dist",
        "Price Starting With ($)": "5.75",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "How to Organize (Just About) Everything: More Than 500 Step-by-Step Instructions for Everything from Organizing Your Closets to Planning a Wedding to Creating a Flawless Filing System",
        "Authors": "By Walsh, Peter",
        "Description": "Professional organizer Peter Walsh presents this witty and enormously practical guide to getting it -- and keeping it -- all together. With more than 500 easy-to-follow how-to instructions, How to Organize (Just About) Everything is packed with shrewd advice and insider tips to make your home, your workplace -- indeed, every imaginable aspect of your life -- run more smoothly. Step-by-step solutions help even the most organizationally challenged take on:  Kids Schedules Storage Photos Lists Politics Education Remodels Meals Weddings Finances Holidays Parties Vacations Emergencies",
        "Category": " Reference , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "American Indian Design and Decoration (Dover Pictorial Archive)",
        "Authors": "By Appleton, LeRoy H",
        "Description": "The most original and most powerful design art produced in the Western Hemisphere is also its most indigenous: that of the Indian, in innumerable cultures existing from prehistory to the arrival of the white man, reaching from the Arctic Circle to Tierra del Fuego. It owes, of course, nothing to Europe or the classical Orient. It is tremendous in variety, differing region by region, era by era, often tribe by tribe. It is always vigorously distinctive. This book, 20 years in preparation, shows us that art in all its profuse diversity and in the almost numberless crafts for which the American Indian is famous. Well over 700 examples, drawn with painstaking care, are shown: representations of flora and fauna, men and gods, earth and sky; symbols of clan and tribe, religion and magic; formal designs from the primal to the highly intricate. They appear in examples of basketry, weaving, pottery, sculpture, painting, lapidary work, masks, drumheads, weapons, apparel, beadwork, goldwork, blankets, ponchos, and many other forms. The arts and crafts of Inca, Tiahuanaco, Chimú, Maya, Axtec, Zapotec, Totonac, Mixtec, Navaho, Zuni, Hopi, Apache, Cherokee, Creek, Winnebago, Dakota, Blackfoot, Nez Percé, Cheyenne, Crow, Sioux, Cochiti, Haida, Bellacoola, and others known and unknown are here. Each section is preceded by a page of typical motifs of an area, making it easy to isolate the design elements. In addition, the lore and tradition behind the designs are told in a text reproducing the Indians' own stories and songs. Separate indices simplify locating the work of particular tribes and regions. Craftspeople will find in this book a prolific source of timeless, eternally valid design ideas representing years of research in museums all over the hemisphere; for the graphic artist there is a wealth of material than can be adapted directly to his needs. All those interested in the Americans who preceded us on these continents will find this work unique.",
        "Category": " Design , Decorative Arts",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1971"
        }
    },
    {
        "Title": "Tink, North of Never Land (Disney Fairies) (A Stepping Stone Book(TM))",
        "Authors": "By Clarke, Judith Holmes (ILT), Thorpe, Kiki, Brown, Adrienne (ILT), and Pickens, Charles (ILT)",
        "Description": "TINK AND TERENCE are best friends. But sometimes Terence, well . . . he gets on Tink's last nerve. So when Terence accidentally squashes Tink's favorite bowl, her anger flares up and she lets him have it! But Tink soon realizes she made a mistake. How can she make it up to Terence? With a bunch of Never flowers? Or legendary pixie dust? Tink sets off an an epic quest through Never Land. She's never failed before . . . and she's not about to start now!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "La vie éternelle, roman",
        "Authors": "By Jacques Attali",
        "Description": "",
        "Category": "",
        "Publisher": "FAYARD",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "A Masterpiece for Bess (Disney Fairies)",
        "Authors": "By Clarke, Judith H. (ILT) and Bergen, Lara",
        "Description": "Messy, creative Bess is perfectly happy creating her paintings in her out-of- the-way studio, never worrying about what the other fairies think. But after she unveils a new portrait of Tinker Bell, she finds herself in a whirlwind of attention. Every sparrow man and fairy in Pixie Hollow wants her to paint his or her picture! With hundreds of fairies to please, suddenly Bess's talent seems more like a chore than a joy!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Risotto (Williams Sonoma Kitchen Library)",
        "Authors": "By Williams, Chuck (EDT), Kidd, Kristine, and Rosenberg, Allan (PHT)",
        "Description": "Offers recipes for vegetable, seafood, and meat risottos, ideal for main courses or side dishes",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Women of Faith: New Testament With Psalms & Proverbs, New King James Version",
        "Authors": "By Nelson, Thomas",
        "Description": "From the organization that has encouraged over two million women at its conferences nationwide comes the Women of Faith New Testament with Psalms and Proverbs in the popular New King James Version. This handy-sized Bible is packed with 24 full-color devotionals from the well-known Women of Faith conference speakers.Contributors to the Women of Faith™ New Testament include:Patsy ClairmontBarbara JohnsonNicole JohnsonMarilyn MebergLuci SwindollShelia WalshThelma Wells",
        "Category": " Bibles , New King James Version , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Diabetic Cooking For 1 or 2",
        "Authors": "By Publications International staff",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "5 Steps to a 5: AP English Literature, Second Edition (5 Steps to a 5 on the Advanced Placement Examinations Series)",
        "Authors": "By Rankin, Estelle M. and Murphy, Barbara L.",
        "Description": "Every year nearly 240,000 students take the AP English Literature exam. The revised and updated 5 Steps to a 5: AP English Literature will give you the tools to analyze complex texts and win a top score.",
        "Category": " Study Aids , Advanced Placement",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Ransom (Toni Matthews Mystery Series #3)",
        "Authors": "By Mills-Macias, Kathi",
        "Description": "Just back from her honeymoon, Toni Matthews and her new husband and P.I. partner, Abe, confront a terrifying new challenge when their missing person case collides head-on with a prison riot that leaves Abe as a hostage of a group of prisoners, one of whom is a man who confessed to a crime he did not commit. Original.",
        "Category": " Fiction , Religious",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Build A Kids' Play Yard",
        "Authors": "By Beneke, Jeff",
        "Description": "Build a Kids' Play Yard is a complete guide to building a wide range of outdoor play structures, including a central tower to which a swing set and monkey bar can be attached in various configurations or built as stand-alones.  In addition, there are various sandboxes, a playhouse, a teeter-totter, a ground-hugging balance beam, and even a kids'-size picnic table.  Beginning with chapters on planning, tools, materials, and construction and finishing, the book then presents the projects themselves in lucid presentations that have become Creative Homeowner hallmarks.  All projects were designed to conform with U.S. Consumer Product Safety Commission guidelines.  For any parent considering play yard equipment, this book is an essential guide.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Ultimate Encyclopedia of Soccer",
        "Authors": "By Radnedge, Keir (EDT)",
        "Description": "",
        "Category": " Sports & Recreation , Soccer",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Most Important Place On Earth: What A Christian Home Looks Like And How To Build One",
        "Authors": "By Wolgemuth, Robert D.",
        "Description": "Many people did not grow up in a Christian home, and many more do not consider their childhood experience a good model. Robert Wolgemuth presents this inspiring, practical book for people who want to have a Christian home.So, what's so great about a Christian home? There's redemption. There's forgiveness. There's hope. Laughter and genuine happiness. There's discipline and purpose there. And there's grace . . . lots of grace.The Most Important Place on Earth covers eight answers to the question \"What does a Christian home look like?\" It's filled with stories and practical ideas that will convince any reader that a Christian home is not an illusive stereotype. It's something that really can be achieved. And it's something worth having. You'll see.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Land of a Thousand Dreams (An Emerald Ballad #3)",
        "Authors": "By Hoff, B. J.",
        "Description": "Poet Morgan Fitzgerald establishes a school in famine-ravaged Ireland, while in America, his friends Michael and Nora encounter poverty, political corruption, and racial tension",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Life as a Vapor: Thirty-One Meditations for Your Faith",
        "Authors": "By Piper, John",
        "Description": "\"You do not know what will happen tomorrow. For what is your life? It is even a vapor that appears for a little time and then vanishes away\" (James 4:14). Living knowing that your life is a vapor is different than just living. Things here are passing away. You’ve got to hold on to what will stand. Savor what matters. This collection of thirty-one articles is full of that heart-longing after Christ that distinguishes Piper’s preaching ministry. Readers will feel as though they have stumbled into a garden as they enter these pages. The Scripture cuts, Christ is exalted in God, and we worship Him.Life Is Short. Eternity Is Long. Live Like It.  You will exist forever. You and God are both in the universe to stay—either as friends on His terms, or enemies on yours—which it will be is proven in this life. And this life is a vapor. Two seconds, and we will be gone.  In these thirty-one meditations, John Piper will connect you to a fresh understanding of God and a renewed relationship with Him. You’ll find your faith stirred to make every day count for Christ when you consider life as a vapor. Story Behind the BookTime is precious. We are fragile. Life is short. Eternity is long. Every minute counts. Oh, to be a faithful steward of the breath God has given me. Three texts resound in my ears: “Redeem the time” (Ephesians 5:16 ); “It is required of stewards that one be found trustworthy” (1 Corinthians 4:2); “His grace toward me was not in vain; but I labored even more than all of them, yet not I, but the grace of God with me” (1 Corinthians 15:10 ).  Surely God means for our minutes on earth to count for something significant. Paul said, “In the day of Christ I will have reason to glory because I did not run in vain nor toil in vain” (Philippians 2:16). In the same way, I have good hope from the Lord that my “labor is not in vain in the Lord” (1 Corinthians 15:58 ).",
        "Category": " Religion , Devotional",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Thinking Body, Dancing Mind: Taosports for Extraordinary Performance in Athletics, Business, and Life",
        "Authors": "By Huang, Chungliang Al and Lynch, Jerry (CON)",
        "Description": "Written by a sports psychologist and a renowned T'ai Chi master, here is a guide to enriching all of life's pursuits through the practice of its simple mental tools and wisdom. Using stories of success from athletes and businesspeople, the authors present techniques and exercises to promote relaxation and enhance performance.",
        "Category": " Body, Mind & Spirit , Healing , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Aryan (Reg Danson Adventure #3)",
        "Authors": "By Kelly, Clint",
        "Description": "Reg Danson, an archaeologist, must stop a mysterious white supremacist group known only as WWRR, which has been stealing holy relics from the Catholic Church",
        "Category": " Fiction , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "8 Choices That Will Change a Woman's Life",
        "Authors": "By Briscoe, Jill",
        "Description": "Each day presents women with an unending parade of choices. Some are fairly mundane, while others can prove to be life changing. In this new edition of Briscoe's popular book, she addresses the crucial issues that women face on a daily basis.   Using the book of James as a model, Briscoe examines the following choices that most women face:    To resist pain or to use it To gather wealth or to gather grace To speak wisely or to speak foolishly To value our time or to fritter it away To live for ourselves or to live for the Spirit To develop God's gifts or to waste them To persevere or to protest To stand for truth or to abandon it",
        "Category": " Religion , Ethics",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Perfect: A Novel",
        "Authors": "By Friend, Natasha",
        "Description": "Depicting with humor and insight the pressure to be outwardly perfect, this novel for ages 10-13 shows how one girl develops compassion for her own and others’ imperfections.For 13-year-old Isabelle Lee, whose father has recently died, everything's normal on the outside. Isabelle describes the scene at school with bemused accuracy--the self-important (but really not bad) English teacher, the boy that is constantly fixated on Ashley Barnum, the prettiest girl in class, and the dynamics of the lunchroom, where tables are turf in a all-eyes-open awareness of everybody's relative social position.But everything is not normal, really. Since the dealth of her father, Isabelle's family has only functioned on the surface. Her mother, who used to take care of herself, now wears only lumpy, ill-fitting clothes, cries all night, and has taken every picture of her dead husband and put them under her bed. Isabelle tries to make light of this, but the underlying tension is expressed in overeating and then binging. As the novel opens, Isabelle's little sister, April, has told their mother about Isabelle's problem. Isabelle is enrolled in group therapy. Who should show up there, too, but Ashley Barnum, the prettiest, most together girl in class.",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "Milkweed Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Herbs in the Kitchen: A Celebration of Flavor",
        "Authors": "By Belsinger, Susan, Dille, Carolyn, and Coca, Joe (PHT)",
        "Description": "Offers some 200 recipes made with herbs from kitchen, garden or local market. Provides information on growing, and harvesting herbs, including cultivation tips for indoors, or out, preservation tips, and a practical garden plan. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Cooking , Specific Ingredients , Herbs, Spices, Condiments",
        "Publisher": "Interweave Pr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Indoctrination U:The Left's War Against Academic Freedom",
        "Authors": "By Horowitz, David",
        "Description": "In dramatic commentary, Indoctrination U. unveils the intellectual corruption of American universities by faculty activists who have turned America's classrooms into indoctrination centers for their political causes. It describes how academic radicals with little regard for professional standards or the pluralistic foundations of American society have created an ideological curriculum that it is as odds with the traditional purposes of a democratic education.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Encounter Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Essential Dachshund",
        "Authors": "By Howell Book House (COR), Dunbar, Ian (EDT), and Bloom, Mary (EDT)",
        "Description": "Owning a Dachshund is rewarding and fun! Get all you need to know about feeding, training, and caring for your dog's health in The Essential Dachshund. Special features include professional color photos and expert tips on how to make your dog a wonderful addition to the family. Learn how to have a great relationship with your pet with The Essential Dachshund.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Life You've Always Wanted: Spiritual Disciplines for Ordinary People (Expanded and Adapted for Small Groups)",
        "Authors": "By Ortberg, John",
        "Description": "You Can Live a Deeper, More Spiritual Life Right Where You Are. An expanded edition with a new chapter on prayer and discussion questions The heart of Christianity is transformation—a relationship with God that impacts not just our “spiritual lives,” but every aspect of living. John Ortberg calls readers back to the dynamic heartbeat of Christianity—God’s power to bring change and growth—and reveals both the how and why of transformation. With a new chapter on prayer and added discussion questions, this expanded edition of The Life You’ve Always Wanted offers modern perspectives on the ancient path of the spiritual disciplines. But this is more than just a book about things to do to be a good Christian. It’s a road map toward true transformation that starts not with the individual but with the object of the journey—Jesus Christ. As with a marathon runner, the secret to winning the race lies not in trying harder, but in training consistently—training with the spiritual disciplines. The disciplines are neither taskmasters nor an end in themselves. Rather they are exercises that build strength and endurance for the road of growth. The fruit of the Spirit—joy, peace, kindness, etc.—are the signposts along the way. Paved with humor and sparkling anecdotes, The Life You’ve Always Wanted is an encouraging and challenging approach to a Christian life that’s worth living—a life on the edge that fills an ordinary world with new meaning, hope, change, and joy.",
        "Category": " Religion , Spirituality",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Dachshund: Your Happy Healthy Pet",
        "Authors": "By Gordon, Ann",
        "Description": "The authoritative information and advice you need, illustrated throughout with full-color photographs--now revised and redesigned to be even more reader-friendly!Originally bred as badger hunters, Dachshunds today are among the world's favorite family pets--clever, inquisitive, fun-loving dogs who are a joy to own. This updated guide gives you all the information you need to understand, select, train, and care for a Dachshund, including:* An in-depth look at the Dachshund temperament* The fascinating history of the breed* Tips for selecting a Dachshund puppy or adult dog* Pointers on feeding, grooming, and health* Savvy advice on housebreaking and basic training* Bonus chapter available on companion web site",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Simply Tai Chi: Vitality, Relaxation, Balance",
        "Authors": "By Bryant, Graham and James, Lorraine",
        "Description": "",
        "Category": "",
        "Publisher": "Hinkler Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Fix Your Bicycle",
        "Authors": "By Scott, Ed and Wauson, Sydnie A. (EDT)",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Clymer Pubns",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "John Wayne, My Father",
        "Authors": "By Delsohn, Steve and Wayne, Aissa",
        "Description": "The daughter of John Wayne describes her father's private side--his surprising sensitivity, his devotion to his children, his feelings about his life and fame, his failed relationships, and his sexual exploits",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Little Critter's Staying Overnight (Road to Reading)",
        "Authors": "By Mayer, Mercer",
        "Description": "When Little Critter stays overnight at a friend's house, they swim in the pool, play games, eat dinner, and watch TV, but the next day he is glad to go home",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Richard Scarry's Best Storybook Ever",
        "Authors": "By Scarry, Richard and Scarry, Richard (ILT)",
        "Description": "A treasury of classic books from the one and only, Richard Scarry! Featuring over 80 Richard Scarry classics, this treasury is nearly 300 pages of fun, adventure, and discovery. Filled with beloved excerpts from stories like I am a Bunny, Goodnight Little Bear, The Rooster Struts, and more, readers will find it easy to see why this is - most definitely - the Best Storybook Ever.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "21.84",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "What Is the Father Like? - A Devotional Look at How God Cares for His Children",
        "Authors": "By Weldon Phillip Keller, 1920-1997",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Book of Psalms (Dover Thrift Editions: Poetry)",
        "Authors": "By King James Bible",
        "Description": "Among the best known and most quoted books of the Old Testament, the Book of Psalms contains some 150 hymns of praise, prayers of crisis, and songs of faith once attributed solely to the Biblical King David. It is now believed that this collection of poems, originally chanted or sung with instrumental accompaniment, reflects Israel's entire history from the period of the exodus (13th century B.C.) to the postexilic restoration (after 600 B.C.), and we cherish them as the expressions of faith of many generations and many peoples. The Book of Psalms is shared by all sections of Judaism and Christianity, and is fundamental to both Christian and Jewish liturgies. Its English translation in the King James Version of the Bible (1611), from which this edition is reprinted complete and unabridged, is an exceptionally beautiful and stirring one, long regarded as a classic of English literature.",
        "Category": " Poetry , Subjects & Themes , Inspirational & Religious",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Ana's Story: A Journey of Hope",
        "Authors": "By Bush, Jenna (COL) and Baxter, Mia (PHT)",
        "Description": "Ana's life is a collection of bits and pieces of her past. Infected with HIV at birth, she's unaware of many details of her early childhood and barely remembers her mother. Living with her strict grandmother, she learns how to keep secrets – secrets about her infection and about the abuse she endures at home. But after Ana falls in love and becomes pregnant at seventeen, she begins a journey of hope – a journey of protecting herself and others. She is living with HIV, not dying from it.  Jenna Bush tells of Ana's struggle to break free from the cycle of abuse, silence, and illness with passion and eloquence. But this is not just Ana's story. It is also the story of many children around the world who are marginalized, neglected, and mistreated.",
        "Category": " Young Adult Nonfiction , Social Topics , General",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Stedman's Abbreviations, Acronyms and Symbols",
        "Authors": "By Williams & Wilkins",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Williams & Wilkins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Beck and the Great Berry Battle (Disney Fairies)",
        "Authors": "By Clarke, Judith Holmes (ILT) and Driscoll, Laura",
        "Description": "As an animal-talent fairy, there’s nothing Beck likes better than speaking Bird, or Chipmunk. So when a conflict breaks out between the hummingbirds and the chipmunks, she steps forward to act as a mediator, but nothing she says seems to help. Will Beck be able to bring peace to the animals?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Queen's Bastard (The Inheritors' Cycle, Book 1)",
        "Authors": "By Murphy, C. E.",
        "Description": "“Wow. C. E. Murphy is good. Court intrigue in an alternate Elizabethan-era fantasy world: realpolitik with the sex included.”–Kate Elliott, author of Crown of StarsIn a world where religion has ripped apart the old order, Belinda Primrose is the queen’s secret weapon. The unacknowledged daughter of Lorraine, the first queen to sit on the Aulunian throne, Belinda has been trained as a spy since the age of twelve by her father, Lorraine’s lover and spymaster.Cunning and alluring, fluent in languages and able to take on any persona, Belinda can infiltrate the glittering courts of Echon where her mother’s enemies conspire. She can seduce at will and kill if she must. But Belinda’s spying takes a new twist when her witchlight appears. Now Belinda’s powers are unlike anything Lorraine could have imagined. They can turn an obedient daughter into a rival who understands that anything can be hers, including the wickedly sensual Javier, whose throne Lorraine both covets and fears. But Javier is also witchbreed, a man whose ability rivals Belinda’s own . . . and can be just as dangerous.Amid court intrigue and magic, loyalty and love can lead to more daring passions, as Belinda discovers that power is the ultimate aphrodisiac.“C. E. Murphy vividly reimagines Renaissance Europe as a world both familiar and strange. Filled with intrigue and betrayal, her story is a chess game with six of seven sides, and I look forward to seeing what the next moves are.”–Marie Brennan, author of Warrior and Witch",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Lily's Pesky Plant (Disney Fairies)",
        "Authors": "By Clarke, Judith Holmes (ILT), Larsen, Kirsten, and Driscoll, Laura",
        "Description": "Finding a mysterious seed in the woods, Lily decides to use her special talents to plant it and tend to it as it grows, but when it comes up looking oozy and strange, Lily begins to doubt that this is the type of plant she wants to keep in her beautiful garden.  Original.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Dulcie's Taste of Magic (Disney Fairies)",
        "Authors": "By Herman, Gail, Clarke, Judith Holmes (ILT), Brown, Adrienne (ILT), and Pickens, Charles (ILT)",
        "Description": "Poor Dulcie! After the overworked baking fairy nearly ruins breakfast, Queen Clarion tells her to take a holiday. But Dulcie’s vacation is no fun at all. Her friends are too busy to spend time with her. And worse, the bossy new baking fairy, Ginger, has taken over Dulcie’s job! Then Dulcie stumbles across an ancient magical recipe in the library. She’s desperate to try it out. But how can she bake the mysterious Comfort Cake if she’s not allowed in the kitchen? “These books are classic Disney with little bits of wisdom wrapped around entertaining adventures.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Look: A Guide to Dressing from the Inside Out",
        "Authors": "By Duke, Randolph",
        "Description": "Authentic personal style comes from understanding our bodies, recognizing the demands of our particular lifestyle, mining our experiences, and finding what we really like. —Randolph DukeRandolph Duke’s The Look is a guide to personal style unlike any other. Duke knows high fashion—he has dressed Hollywood A-listers for the red carpet for years—but more important, he understands that putting together a truly fabulous look has everything to do with the woman who’s wearing it. Every woman already knows what she does and doesn’t like, so The Look wastes no time prescribing one-size-fits-all fashion solutions. Instead, it helps women make today’s sometimes-intimidating array of options work cleverly and beautifully for them.It all starts with body type. Once you’ve identified your shape from five broad categories, you’ll learn to choose clothing that maximizes your positive features and downplays less desirable ones. Then, you can shop for flattering outfits that fit your lifestyle, whether you’re a fan of bohemian or preppy, urban chic or country living. The Look also teaches you to mine your own closet (and your friends’, too!) for pieces that can be refreshed or repurposed for a whole new look.Great style is more about a state of mind than it is about a designer wardrobe or a fat bank account. Learning to respect your body and your own taste is a critical part of Duke’s philosophy. Exercises throughout the book help you identify what inspires you as you update your look and feel ever more gorgeous in your own skin. Stunning photographs of real, stylish women, from linear-figured supermodel Cheryl Tiegs to hourglassy fashion writer Merle Ginsberg, will encourage you to mix up and play with fashion to send your own message.With expert tips on everything from making occasion-appropriate accessories choices and matching makeup to your ensemble to spicing up your outfit with personality pieces and stocking up on essentials for work, play, and evenings out, The Look gives you all the tools you need to let your personal style shine through.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Dear to Me (Brides of Webster County, Book 3) (Truly Yours Romance Club #20)",
        "Authors": "By Brunstetter, Wanda E.",
        "Description": "What's a girl to do when she loves animals and her boyfriend loves to hunt? Will her desire to become a vet drive a further wedge between them-- and alienate her from the close-knit Old Order Amish community?",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Going Home (Brides of Webster County, Book 1) (Truly Yours Romance Club #14)",
        "Authors": "By Brunstetter, Wanda E.",
        "Description": "Faith Stutzman Andrews left her Missouri Amish community ten years ago to pursue her career as a comedian. Now widowed, Faith shows up on her parents' doorstep with her six-year-old daughter in tow. Will the lure of the English world prove too strong for Faith, or will she discover that home is where her heart is? Confirmed bachelor Noah Hertzler often bakes desserts that he gives to others, attaching verses of Scripture to each culinary delight in the hopes of soothing the soul as well as nourishing the body. Can Noah's tactics heal a shattered Faith before she runs away again? Going Home is book 1 in the The Brides of Webster County series. Other books in the series include On Her Own: Book 2, Dear to Me: Book 3, and Allison's Journey: Book 4.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "A Sister's Test (Sisters of Holmes County, Book 2)",
        "Authors": "By Brunstetter, Wanda E.",
        "Description": "When tragedy strikes in Holmes County, Ruth Hostettler’s faith is put to the test. Will she find the strength to rise above the ashes of her dreams?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Discover Wellness: How Staying Healthy Can Make You Rich",
        "Authors": "By Hoffman, Bob and Deitch, Jason A.",
        "Description": "Discover Wellness: How Staying Healthy Can Make You Rich is the ultimate solution to America's health care crisis. A powerful and practical guide focused on fixing the cause of America's crisis: the number of people suffering chronic lifestyle diseases. With over 50% of personal bankruptcies related to medical debt and companies such as Starbucks spending more money on health care than on coffee, America's present health care crisis is making America sick.Discover Wellness solves America's health care crisis not by claiming to cure all disease with the elusive holy grail of medical treatments but by providing common sense, time tested, proven advice for better health through better living.The simple fact is that the ultimate solution to America's health care crisis is to have more people, less sick. The only way to have more people, less sick is to have more people adopt healthier habits. It's as simple as that.Anyone seeking to reduce their risk of emotional, physical and financial bankruptcy will enrich their lives by reading this book.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Center Path Publishing",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Doesn't She Look Natural (The Fairlawn Series #1)",
        "Authors": "By Hunt, Angela Elwell",
        "Description": "When Jennifer Graham, a divorced, unemployed single mom forced to live with her mother, inherits a funeral home in a small Florida town, she discovers a rewarding career that teaches her far more about life than death.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "White Christmas Pie",
        "Authors": "By Brunstetter, Wanda E.",
        "Description": "Step into Amish country for this bittersweet holiday romance. Here you'll meet Will Henderson, a young man tortured by his past, and Karen Yoder, a young woman looking for answers. Add a desperate father searching for his son, and you have all the ingredients for a first-class romance that will inspire and enthrall.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "My Big Fat Supernatural Wedding",
        "Authors": "By Kenyon, Sherrilyn, Harris, Charlaine, Banks, L. A., and Elrod, P. N. (EDT)",
        "Description": "Werewolves, vampires, witches, voodoo, Elvis---and weddingsAn \"ordinary\" wedding can get crazy enough, so can you imagine what happens when otherworldly creatures are involved? Nine of the hottest authors of paranormal fiction answer that question in this delightful collection of supernatural wedding stories. What's the seating plan when rival clans of werewolves and vampires meet under the same roof? How can a couple in the throes of love overcome traps set by feuding relatives---who are experts at voodoo? Will you have a good marriage if your high-seas wedding is held on a cursed ship? How do you deal with a wedding singer who's just a little too good at impersonating Elvis?·        L. A. Banks·        Jim Butcher·        Rachel Caine·        P. N. Elrod·        Esther M. Friesner·        Lori Handeland·        Charlaine Harris·        Sherrilyn Kenyon·        Susan KrinardShape-shifters, wizards, and magic, oh my!",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "A Time to Mend (Safe Harbor Series #1)",
        "Authors": "By Smalley, Gary and John, Sally",
        "Description": "An unopened gift. A broken vow. A tragic fire. Sometimes there are wounds that even time can't heal.Max and Claire Beaumont seem to have the perfect marriage. They live in a beautiful home, have four wonderful children and everything else that success and money can buy. Yet beneath this picture-perfect exterior, Claire's life is falling apart. She can no longer hold her peace and keep up appearances.After all the silent years, she must speak the truth.As their lives unravel, deep needs and even deeper hurts are revealed. Not only the wounds between husband and wife, but family wounds as well. Will this time of soul-searching and conflict bring them closer together--or tear their marriage apart?It's a strange irony to leave home in search of a safe harbor. Yet that is often where the journey begins . . . especially when it is time to mend.A Time to Mend is the first novel in the Safe Harbor series. Drawing on the insights of best-selling marriage expert Gary Smalley, the series explores the joys and struggles of marriage, family, and faith.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Skinny Legs and All: A Novel",
        "Authors": "By Robbins, Tom",
        "Description": "An Arab and a Jew open a restaurant together across the street from the United Nations…It sounds like the beginning of an ethnic joke, but it’s the axis around which spins Tom Robbins’s gutsy, fun-loving, and alarmingly provocative new novel, in which a bean can philosophizes, a dessert spoon mystifies, a young waitress takes on the New York art world, and a rowdy redneck welder discovers the lost god of Palestine—while the illusions that obscure humanity’s view of the true universe fall away, one by one, like Salome’s veils. Skinny Legs and All deals, in Robbins’s audacious manner, with today’s most sensitive issues: race, politics, marriage, art, religion, money, and lust. It weaves lyrically through what some call the “end days of our planet. Refusing to avert its gaze from the horrors of the apocalypse, it also refuses to let the alleged end of the world spoil its mood. And its mood is defiantly upbeat.In the gloriously inventive Tom Robbins style, here are characters, phrases, stories, and ideas that dance together on the page, wild and sexy, like Salome herself. Or was it Jezebel?",
        "Category": " Fiction , Political",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Mary My Mother (St. Joseph Picture Books)",
        "Authors": "By Lovasik, Lawrence",
        "Description": "",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "Catholic Book Publishing",
        "Price Starting With ($)": "14.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Nightmare at Norton's Mills (Emergency Rescue!)",
        "Authors": "By Cowan, James and Cowan, Lois",
        "Description": "A collection of five realistic stories about Matt and Davey, junior members of their town's Rescue Squad, features a tale of a tobogganing accident in which Davey falls through the ice and nearly freezes to death. Original.",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Heritage of America Cookbook (Better Homes & Gardens Test Kitchen)",
        "Authors": "By McConnell, Shelli (EDT) and Darling, Jennifer",
        "Description": "Rich in heritage, historical detail, and lore, this volume includes more than three-hundred regional recipes gathered from people all over the United States. 75,000 first printing. $500,000 ad/promo. Tour.",
        "Category": " Cooking , General",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "8.18",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Keeping Watch",
        "Authors": "By King, Laurie R.",
        "Description": "Allen Carmichael came back from Vietnam a lifetime ago, but only now was he ready to return home. For years, he's lived on the fringes of the law, using a soldier's skills to keep watch over those too young to defend themselves. Some consider him nothing but a kidnapper for hire - the best in the business; others call him a hero. His specialty has been rescuing children from abusive parents and escorting them to loving homes. But after twenty-five years, he is ready to take on his final case - a case that could destroy him.The boy's name is Jamie: He believes that his father is going to kill him. Allen is convinced that the twelve-year-old is right and devises a strategy to save him. His last job done, Allen heads back to Folly Island, where he plans to settle into a quiet life. But not long after his return, a small plane piloted by the boy's father crashes, leaving behind debris - but no body. Now it is up to Allen to resolve whether Jamie's father is dead or alive - and to make sure Jamie himself stays out of harm's way. But a series of ominous events leads Allen to question whether Jamie's father is really the enemy after all. Or if the real threat is far more unspeakable...and the killer unimaginable.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Dr. Mercola's Total Health Program: The Proven Plan to Prevent Disease and Premature Aging, Optimize Weight and Live Longer!",
        "Authors": "By Mercola, Joseph, Vaszily, Brian, and Bentley, Nancy Lee",
        "Description": "Featuring world-renowned natural health physician Dr. Joseph Mercola's dietary program in part one and over 150 healthy and delicious new recipes in part two.Designed to help prevent disease, premature aging, optimize weight, increase energy, and love what you eat while doing so, Mercola's easy to follow program will help you avoid and eliminate the underlying causes of health and weight issues. Built entirely around a natural approach, including eating only the cleanest and healthiest forms of proteins, fats and carbs.Everything you need to know to:. Build your body's immune system to its peak levels to prevent diseases and common illnesses. Reach your optimal weight - while actually enjoying and being satisfied by eating - and remain at your optimal weight for life. Maximize your body's ability to restore the more youthful appearance you are meant to have while avoiding any premature aging. Boost your energy and mental clarity Help eliminate the underlying causes for those currently challenged by diseases and conditions such as diabetes, heart problems, chronic fatigue, allergies",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Mercola.com",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Spiritual Power of a Mother: Encouragement for the Home Schooling Mom",
        "Authors": "By Farris, Michael",
        "Description": "A collection of letters and articles written for home schooling mothers offers spiritual encouragement and advice on such topics as prayer, teaching, protecting children, socialization, and higher education. Original.",
        "Category": " Education , Home Schooling",
        "Publisher": "B&H Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Fat Quarter Fun",
        "Authors": "By Snyder, Karen",
        "Description": "Fat quarter bundles are all the rage because there are plenty to go around, they're affordable, and often come in the latest fabrics.Recent quilting surveys show fat quarter quilting is where it's at for many of today's quilters.Fat quarter bundles are a guilty pleasure many quilters can afford to indulge in, and this follow-up to the popular guide Bundles of Fun shows you how to make the most of your investment. It features detailed instructions for making a quilt from start to finish, explained in 150+ step-by-step photos. Discover what you can create with a few or a lot of fat quarter bundles, in the 15+ features projects.",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Krause Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Saint (Paradise Series, Book 2) (The Books of History Chronicles)",
        "Authors": "By Ted Dekker",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Sexual Man",
        "Authors": "By Hart, Archibald D.",
        "Description": "Based of groundbreaking nationwide research, The Sexual Man refutes the current myths surrounding male sexuality, providing a psychologically sound, biblically respectful view of what men secretly think and feel about important sexual issues. Learn what satisfies men sexually and what the limits should be, how to ensure healthy sexual development throughout life and how to have a fulfilled and guilt-free sex life.",
        "Category": " Health & Fitness , Sexuality",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Brigade : An Epic Story of Vengeance, Salvation, and World War II",
        "Authors": "By Blum, Howard",
        "Description": "An epic true storyof three remarkable men and one womanwho set out to fight a warand in the process help to create a nationNovember, 1944. The war in Europe is drawing to a close when the British government finally agrees to send a brigade of five thousand Jewish volunteers from Palestine to Europe to fight the German army. Among these soldiers are Israel Carmi, a veteran of the Haganah underground, a man who serves one army but whose loyalties belong to another; Johanan Peltz raised on, a vast, estate in Poland he dreams of returning home as a British officer and gentleman; and Arie Pinchuk, a former student who has returned to Europe with his own secret agenda -- to rescue his last remaining family member: the little sister he left behind. At the Senio River, Peitz leads the troops in a daring bayonet charge into the heart of the German line. When the savage hand-to-hand combat is finished, the men of the brigade emerge triumphant. At a time when Jews are being victimized, these soldiers -- yellow Stars of David emblazoned on their uniform sleeves -- show the world that a Jewish army can fight back. And win.But when the war ends and the soldiers witness firsthand the horrors their people have suffered in the concentration camps, the men launch a brutal and calculating campaign of vengeance, forming secret squads to identify, locate, and kill Nazi officers in hiding. Their own ferocity threatens to overwhelm them until a fortuitous encounter with an orphaned girl sets the men on a course of action -- rescuing Jewish war orphans and transporting them to Palestine -- that will not only change their lives but also forever alter the course of world history. With The Brigade, bestselling author Howard Blum has written his most harrowing and important book to date -- a story that is certain to make headlines as well as provoke debate about the moral elements ofjustice, the dividing lines between good and evil, and the possibility of redemption.",
        "Category": " History , Military , World War II",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    }
]