[
    {
        "Title": "100 Monsters in My School (Penguin Young Readers, Level 3)",
        "Authors": "By Hendrix, Bryan (ILT) and Bader, Bonnie",
        "Description": "The one hundredth day of school at Frank N. Stein Elementary School is the best day of the year for all the monsters except Jane Brain. Readers will learn fun--and sometimes spooky--ways of counting to one hundred in this book.",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Full Flavor Cookbook",
        "Authors": "By Stendahl",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Liberty Pub. Co",
        "Price Starting With ($)": "14.81",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "Valentine's Day Mess (A Giant First-Start Reader)",
        "Authors": "By Palazzo-Craig, Janet and Morse, Deborah (ILT)",
        "Description": "Mouse friends Jen and Ken have an accident that spoils the Valentine's Day surprises they have made for each other, but they soon find other ways to celebrate together.",
        "Category": "",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "A Letter of Consolation",
        "Authors": "By Nouwen, Henri J. M.",
        "Description": "Finding Faith in a Time of SorrowBeloved author Henri Nouwen reflects on the spiritual significance of death and life in this moving meditation dedicated to \"all those who suffer the pain that death can bring and who search for new life.\"",
        "Category": " Religion , Spirituality",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "I'm Mad (Dealing with Feelings)",
        "Authors": "By Crary, Elizabeth",
        "Description": "Katie gets mad because the rain ruins her day, and she learns how to control this anger",
        "Category": " Juvenile Nonfiction , Social Topics , Emotions & Feelings",
        "Publisher": "Parenting Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Hoppily Ever After",
        "Authors": "By Tilley, Scott (ILT), Orpinas, Jean-Paul (ILT), and Risco, Elle D. (ADP)",
        "Description": "Walt Disney Pictures presents The Princess and the Frog. . . .When beautiful Tiana and the spoiled Prince Naveen are magically transformed into frogs, the two must work together to survive the Louisiana swamp and regain their human forms. This full-color Pictureback retells the story of their exciting dash through the dangers of the bayou!",
        "Category": " Juvenile Fiction , People & Places , United States , African American",
        "Publisher": "Random House / Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "A certain Democrat: Senator Henry M. Jackson;: A political biography,",
        "Authors": "By Prochnau, William W.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "8.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Nurtured by love : The Classic Approach to Talent Education",
        "Authors": "By Shinichi Suzuki",
        "Description": "",
        "Category": "",
        "Publisher": "Ability Development",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Blow-Drying the Frog & Other Parenting Adventures",
        "Authors": "By Jones, Laura M. (EDT)",
        "Description": "",
        "Category": " Family & Relationships , General",
        "Publisher": "Family & Home Network",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Leadership Pill: The Missing Ingredient in Motivating People Today",
        "Authors": "By Blanchard, Kenneth H. and Muchnick, Marc",
        "Description": "In the bestselling tradition of Whale Done! and The One Minute Manager, their entertaining and inspiring new book is a parable about the competition between two leaders with totally different management styles—a story that reveals the ingredients of truly effective leadership.How can you become a more successful manager, a stronger team leader, and a motivator who gets the best results from a group? Ken Blanchard and Marc Muchnick's The Leadership Pill provides the answer. Consider this tantalizing possibility: What if there were a pill that could actually stimulate the natural powers of the mind and body to provide leadership? In the story, an amazing new pill heightens one leader's powers, but contains the wrong ingredients, stimulating him in an obsessive and shortsighted direction with disastrous results. In contrast, the Effective Leader, working without a pill, proclaims that \"only through sustainability can our teams remain motivated and successful.\" An inspiring and supportive leader, he supplies the right ingredients, earning his team's respect and trust with a blend of integrity, partnership, and affirmation. The hard-won result is a highly motivated team producing consistent top performance and genuine success. Ultimately it is recognized that \"leadership for a lifetime\" is much easier to digest than a pill for leaders looking for a quick fix. Destined to be a transforming experience for countless readers, The Leadership Pill shows business managers at any level how to apply the right techniques for getting both results and the commitment of their people, even when the pressure to perform is high.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Wastrel",
        "Authors": "By Wakeman, Frederic",
        "Description": "",
        "Category": "",
        "Publisher": "Rinehart",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "And Nobody Got Hurt 2!: The World's Weirdest, Wackiest, Most Amazing True Sports Stories",
        "Authors": "By Berman, Len",
        "Description": "An Olympian who sacrificed a medal to save a competitor, a professional soccer player who was bribed out of retirement with pizza, a runaway pig who disrupted the start of a baseball game -- truth is stranger than fiction, especially in sports! In this sequel to his first compilation of sports bloopers and unbelievable stories, And Nobody Got Hurt, Today Show regular and Emmy Award-winning sportscaster Len Berman shares more of the funniest and most amazing stories in the history of sports, including favorite moments from his popular Spanning the World segments on NBC-TV.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Genomic Medicine: Articles from the New England Journal of Medicine",
        "Authors": "By Guttmacher, Alan E., M.D., Collins, Francis S. (EDT), Drazen, Jeffrey M. (EDT), and Zerhouni, Elias (FRW)",
        "Description": "\"Fifteen years ago, many questioned the wisdom of sequencing the human genome. There were concerns not only about the technical feasibility of such an effort, but also that its scientific worth would prove too modest to warrant the investment of human and financial capital that the project would require. This collection of essays stands as eloquent testimony to those who overcame such doubts to create, nurture, and finish the sequencing of the human genome in April 2003, a date that will forever stand out in human history. The wide and public availability of the human genome sequence and the other tools spawned by the Human Genome Project have helped to create an unparalleled era of biomedical discovery. It has opened up new avenues for the understanding of the biology of human health and disease. Many of these avenues remain to be fully explored, but this volume already demonstrates that information about genetics and genomics is increasingly permeating our clinical approach to patients.\"—from the Foreword by Dr. Elias ZerhouniFor more than a century, knowledge about the role of genes has been gradually reshaping perceptions of our health and of ourselves. From Mendel's work with plants and Watson and Crick's model of DNA's double-helix structure to the recent decoding of the human genome, the tremendous advances in our ability to analyze and interpret gene sequences are revolutionizing many aspects of medicine. Genomic Medicine collects and updates an acclaimed series of articles published in the pages of the New England Journal of Medicine since November 2002 that together provide an authoritative and comprehensive overview of the latest developments in the field of medical genetics and an exploration of where these advances might take medicine over the next decade.Beginning with a fundamental primer and a useful glossary of terms, the book offers the latest information on the use of genetics to screen, diagnose, and treat a wide variety of diseases, including breast and ovarian cancer and cardiovascular, Alzheimer, and Parkinson disease. Also included are discussions of population screening, pharmacogenetics, and the ethical, legal, and social dimensions of genomic medicine. Edited by leaders in the field, written by experts from around the globe, and brimming with full-color illustrations, Genomic Medicine is an indispensable guide to the full potential of the DNA-based transformation of medicine.",
        "Category": " Medical , Genetics",
        "Publisher": "John Hopkins University Press",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "In My Heart",
        "Authors": "By Thomas, Melody",
        "Description": "After a whirlwind affair and elopement with one of her father's officers, Lady Alexandra Marshall, daughter and sole heir of the Earl of Ware, watched helplessly as her husband was shipped off. An annulment followed, and though she waited with packed bags, Christopher never returned for her. Now, 10 years later, she can't help but wonder if fate is giving them a second chance at love .",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Get a Grip",
        "Authors": "By Capozzi, John M. and Capozz, John",
        "Description": "",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Jmc Pub Services",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Poultry (The Good Cook Techniques & Recipes Series)",
        "Authors": "By Time-Life Books",
        "Description": "Includes simple and festive recipes for meals involving frying, roasting, braising, or poaching chicken, turkey, duck, goose, squab, and guinea hen with sections on sauces and special gourmet techniques",
        "Category": " Cooking , General",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1979"
        }
    },
    {
        "Title": "Reach for the Summit: The Definite Dozen System for Succeeding at Whatever You Do",
        "Authors": "By Jenkins, Sally and Summitt, Pat",
        "Description": "Pat Summitt, head coach of the Tennessee Lady Vols, was a phenomenon in women's basketball.  Her ferociously competitive teams won three NCAA championships in a row--1996, 1997, and 1998.  The 1997-98 Lady Vols posted a historic 39-0 record, prompting the New York Times, among many others, to proclaim them \"the best women's college team ever.\" In this groundbreaking motivational book, Pat Summitt presented her formula for success, which she called the \"Definite Dozen System.\" In each of the book's twelve chapters, Summitt talked about one of the system's principles--such as responsibility, discipline, and loyalty--and showed you apply it to your own situation.  Along the way, she used her own remarkable story as a vehicle for explaining how anyone can transform herself through ambition.  Pat Summitt's story will motivate you to achieve in sports, business, and the most important game of all--life.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Crown Currency",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Lamb (The Good Cook Techniques & Recipes Series)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "82 Desire: A Skip Langdon",
        "Authors": "By Smith, Julie",
        "Description": "Though the modern bus has long since replaced the streetcar in New Orleans, Desire is still the meanest street of them all. Now Police Detective Skip Langdon finds herself on its shady side in what at first appears to be a small case with some big names--Councilwoman Bebe Fortier has misplaced her equally prominent husband. Yet Skip soon senses something big starting to unfold. Something rooted in corruption, resulting in violence--and motivated by that old demon . . . desire.Across town, Talba Wallis has a simple desire of her own--to find out what Russell Fortier's disappearance has to do with her. Wallis is a woman who leads three lives--poet, computer expert, and part-time detective once hired to spy on Fortier. But the private investigator she worked for can't help her out. He's lying in his office with a bullet in his chest.Reporter Jane Storey is also walking down that mean, sultry street--she's on the brink of the biggest story of her life. But she's got a bad feeling she's being played like a deck of cards.In fact, all three investigators--cop, private eye, and reporter--sense an unknown (and malevolent) presence pulling strings they cannot see.Smith's steamy masterpiece is a tale of desire running out of control . . . of corporate greed, a lust for power, and a legacy of misery that only now must be set right--at a cost measured in blood and heartbreak and lives.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Fawcett Columbine",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "John Kenneth Galbraith: His Life, His Politics, His Economics",
        "Authors": "By Parker, Richard",
        "Description": "The life and times of America’s most celebrated economist, assessing his lessons—and warnings—for us todayJohn Kenneth Galbraith’s books—among them The Affluent Society and American Capitalism—are famous for good reason. Written by a scholar renowned for energetic political engagement and irrepressible wit, they are models of provocative good sense that warn prophetically of the dangers of deregulated markets, war in Asia, corporate greed, and stock-market bubbles. Galbraith’s work has also deeply—and controversially—influenced his own profession, and in Richard Parker’s hands his biography becomes a vital reinterpretation of American economics and public policy.Born and raised on a small Canadian farm, Galbraith began teaching at Harvard during the Depression. He was FDR’s “price czar” during the war and then a senior editor of Fortune before returning to Harvard and to fame as a bestselling writer. Parker shows how, from his early championing of Keynes to his acerbic analysis of America’s “private wealth and public squalor,” Galbraith regularly challenged prevailing theories and policies. And his account of Galbraith’s remarkable friendship with John F. Kennedy, whom he served as a close advisor while ambassador to India, is especially relevant for its analysis of the intense, dynamic debates that economists and politicians can have over how America should manage its wealth and power. This masterful chronicle gives color, depth, and meaning to the record of an extraordinary life.                                                                               Richard Parker is an Oxford-trained economist and senior fellow of the Shorenstein Center at Harvard's Kennedy School of Government. A cofounder of the magazine Mother Jones, he writes extensively on economics and public policy. He lives in Cambridge, Massachusetts, with his wife and children.                                                     A New York Times Notable Book John Kenneth Galbraith is America's most famous economist for good reason. A witty commentator on America's political follies and a versatile author of bestselling books that warn prophetically of the dangers of deregulated markets, corporate greed, and inattention to the costs of our military power (among them The Great Crash: 1929, The Affluent Society, and The New Industrial State), Galbraith always makes economics relevant to the crises of the day. This first authorized biography is, in Richard Parker's hands, an important reinterpretation both of public policy and of how economics is practiced. Born in 1908 and raised on a small Canadian farm, Galbraith began to teach at Harvard in his twenties. In 1938 he left to work in New Deal Washington, eventually rising to become FDR's \"price czar\" during the war. Following his years as a writer at Fortune, where he did much to introduce the work of John Maynard Keynes to a wide audience, he returned to Harvard in 1949 and began writing the books that would make him famous. Over the years, Galbraith developed a distinctive way of \"doing economics,\" and it made him a critic both of conservatives and of many liberal economists. Parker's vibrant, nuanced portrait is enlightening on Galbraith's engagement with his fellow economists and the politics they influenced?from the \"Neoclassical Synthesis\" and the New Frontier to monetarism, supply-siders, and the conservative revolution of the 1980s and 1990s. It is also a dramatic narrative about public policies and the people who create them, for Galbraith was often at the very epicenter of politics in his time. From his acerbic analysis of the nation's \"private wealth and public squalor\" in the 1950s to his denunciations of the Vietnam War, Galbraith regularly challenged the \"conventional wisdom\" (a phrase he coined). Parker's account of Galbraith's friendship with John F. Kennedy, whom he served as ambassador to India, is filled with new insights and information about economic policy, about American policy in Asia, and about the heavy influence of the Pentagon's budget on every aspect of public affairs. Subsequent chapters, analyzing Galbraith's responses to the mistakes made by later administrations in managing America's wealth and power, offer a powerful critique of the Johnson, Nixon, Reagan, and Clinton years. But Parker gives equal attention to the warm, lively, and nourishing friendships that shaped the private life of Kenneth and Kitty Galbraith and their high-spirited family. This masterful chronicle gives color, depth, and meaning to the record of an extraordinary life.                  \"There was a time when John Kenneth Galbraith was the most famous economist in America, a man whose books regularly became best sellers. But today he is little honored in the economics profession, where, as Richard Parker remarks in his engaging and exhaustive biography, Mr. Galbraith is regarded as something of an outsider, a fine writer who never became comfortable with the detailed mathematical formulas that came to dominate economics.\"?Floyd Norris, The New York Times                               \"There was a time when John Kenneth Galbraith was the most famous economist in America, a man whose books regularly became best sellers. But today he is little honored in the economics profession, where, as Richard Parker remarks in his engaging and exhaustive biography, Mr. Galbraith is regarded as something of an outsider, a fine writer who never became comfortable with the detailed mathematical formulas that came to dominate economics.\"?Floyd Norris, The New York Times \"Parker's book is both a biography and a treatise on the misinterpretations and disastrous mistakes?the mystery of stagflation, the bubble of the 90's, Vietnam?that theoretical rigidity and deference to experts have brought over the last hundred years. It is also, thanks to Galbraith's longevity, his work in so many administrations, and his battles with so many other economic thinkers, a fine one-volume history of economic thought in the 20th century . . . I will confess that I was initially skeptical about the book's 820 pages of dense type, but every detail is justified and every digression fascinating . . . [A] comprehensive account of the 20th century's economic battles.\"?Thomas Frank, The New York Times Book Review \"[Parker is] an engaging writer [who] does a good job covering all [the] episodes in [Galbraith's] busy life. At every point he is at pains to set the stage, making sure that the reader understands the characters and motives involved and the issues at stake.\"?Dan Seligman, The Wall Street Journal \"With a strong grasp of complex economic issues that span some sixty years, Parker succeeds in placing Galbraith's economic contributions within the intellectual tradition?part Keynesian and part derived from the work of Thorstein Veblen?to which they belong . . . In tracing Galbraith's intellectual development, Parker has also written a much-needed history of American progressivism.\"?Jeffrey Madrick, The New York Review of Books \"Doing justice to this life story requires an outsize biography, one that not only tells Mr. Galbraith's tale but sets it on the broader canvas of America's political and economic evolution. And Richard Parker's book does just that . . . He is a good writer, who is particularly deft at bringing to life and explaining economic ideas and policy debates.\"?The Economist \"The story of this man's life and work, wonderfully rendered in this magnum opus, offers an antidote to the public ennui, economic cruelty, and government malfeasance that poison life in America today . . . Parker lifts up a single life as an image of how intelligence, compassion, and commitment remain the essence of social hope.\"?James Carroll, The Boston Globe \"John Kenneth Galbraith towered?literally and figuratively?over twentieth-century America, afflicting the comfortable with searing wit and unassailable logic, and comforting the afflicted with compelling ideas for improving society to the benefit of all. To understand the ideals that propelled America from FDR's New Deal until Bush's Raw Deal, one must comprehend Galbraith's life, politics, and economics. Herewith, a stunningly lucid guide. Richard Parker gives to Galbraith the deep insight and sweeping perspective that Galbraith gives to America.\"?Robert B. Reich, Brandeis University \"Parker's timely biography of Ken Galbraith and his brilliant career is an extraordinary gift to a nation grappling more than ever with the profound issues that Galbraith addressed so eloquently over so many years with his famed intellect and wit. Galbraith's passion for social justice, his skepticism about excessive power in the hands of either government or the private sector, and his indispensable contributions to progressive politics and economic thought shine through every page of this book, and they are still highly relevant to our twenty-first-century national debate on the great domestic and global challenges of our time. For all who care about a better world and a fairer reconciliation at home and abroad between what Galbraith called 'private affluence and public squalor,' this remarkable volume should be required reading. It is both an education and an inspiration.\"?Senator Edward M. Kennedy \"This is a superb book, literate and fascinating, about one of the truly original minds of the century. No one can write about contemporary economics, politics, diplomacy, wit, satire and phrase-making without taking John Kenneth Galbraith into just account, and Richard Parker is the ideal biographer.\"?Arthur Schlesinger, Jr. \"In its breadth of interest, its erudition, its ease in explaining economics in everyday language, and, above all, in its skillful, first-rate story-telling, Richard Parker's splendid, immensely readable biography is in every way a match for the towering and fascinating figure who strides through its pages.\"?Adam Hochschild \"John Kenneth Galbraith has been, against the tide, a shameless advocate for a government that would guarantee all of us a decent existence. This saga of his life and thought presents a lively review of what has happened to our economy and to the profession of economics in the last seventy years.\"?Barbara Bergmann, author of The Economic Emergence of Women \"John Kenneth Galbraith is the Harvard economist who became one of the most influential oracles of the contemporary world. An often searing critic of big business, he has been responsible for reshaping the anatomy of modern thought, extending his lively sanctions into the many branches of his eclectic intellect. In this thoughtful and highly readable volume, the Oxford-trained economist Richard Parker provides an essential guide to the man and his ideas. It captures an extraordinary life, extraordinarily well.\"?Peter C. Newman \"Parker has written an engrossing, thoroughly researched, and authoritative account of the life of John Kenneth Galbraith. The book not only details the richly varied experiences of one of the great public intellectuals and social commentators of our time; it also offers a most interesting account of the evolution of economic thought from the era of John Maynard Keynes to the present day.\"?Derek Bok \"An engaging and comprehensive review of the life and times of a brilliant, prolific twentieth-century thinker. Galbraith understands that the structural determinants, limitations, and consequences of markets have been largely ignored by economists?to the detriment of the discipline and of society. This is a poignant book with important messages for the twenty-first century.\"?David K. Foot, University of Toronto and co-author of Boom, Bust & Echo \"[An] accessible, well-written approach to both Galbraith's life and the larger issues to which he has so effectively devoted his thought: an exemplary intellectual biography.\"?Kirkus Reviews (starred review) \"[Galbraith] took on academic and political orthodoxies to transform the way informed people think about the economy, institutions, and social justice . . . Parker's biography is a model of clarity on these matters.\"?Publishers Weekly",
        "Category": " Biography & Autobiography , Social Scientists & Psychologists",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Rehoboth Road",
        "Authors": "By Anita Ballard-Jones",
        "Description": "",
        "Category": "",
        "Publisher": "Genesis Press Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Crusade in Europe (1948)",
        "Authors": "By Dwight D. Eisenhower",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "Thanks for the Memories: A Novel",
        "Authors": "By Ahern, Cecelia",
        "Description": "“[Ahern] gives us full permission to believe in magic.” —Redbook Magazine One of the world’s most popular writers of women’s fiction—author of the beloved international bestseller, P.S. I Love You, basis for the popular film starring Hilary Swank—Cecelia Ahern now gives us Thanks for the Memories, a heartwarming tale of déjà vu and second chances. Reminiscent of The Time Traveler’s Wife, Thanks for the Memories is a love story brimming with hope and feeling and enlivened with an enchanting touch of magic.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Forces in Modern British Literature 1885-1956",
        "Authors": "By Tindall, William York",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "The Old Bailey and its trials",
        "Authors": "By O'Donnell, Bernard",
        "Description": "",
        "Category": "",
        "Publisher": "Burke",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Making Gift Scrapbooks in a Snap: 20 Perfect Presents for Family and Friends",
        "Authors": "By Klassen, Pam, Arquette, Kerry (EDT), Regier, MaryJo (EDT), and Klassen, Pam (ILT)",
        "Description": "While a full-sized scrapbook can take months to put together, the charming gift scrapbooks in this guide can be created in a few days, allowing scrapbooks to easily share their craft with those they care about most.   Pam Klassen, a long-time editor for Memory Makers, teaches readers how to construct small-format scrapbooks, perfect for gifts, through concepting the gift book while maintaining quality and creativity. Offering readers dozens of dynamic ideas for themed albums, including books for new babies, weddings, teachers, and anniversaries, this guide provides scrapbookers of all skill levels with valuable techniques and inspiring ideas.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Satellite Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Wrapped with Style: Simple, Creative Ideas for Imaginative Gift Wrapping by Leslie Carola (2008) Hardcover",
        "Authors": "By Leslie Carola",
        "Description": "",
        "Category": "",
        "Publisher": "Arena Books Associates",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "A Treasury of Stephen Foster, arranged for piano by Ray Lev & Dorothy Berliner C",
        "Authors": "By Foster, Stephen, Deems Taylor, foreword by, historical notes by John Tasker Howa",
        "Description": "",
        "Category": "",
        "Publisher": "NY Random (1946).",
        "Price Starting With ($)": "43.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "Friendship Is a Blessing",
        "Authors": "By Rebecca Currington",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "I Like Me! (Picture Puffin Books)",
        "Authors": "By Carlson, Nancy L.",
        "Description": "Meet Nancy Carlson’s peppy pig—a character who is full of good feelings about herself. Her story will leave little ones feeling good about themselves, too!\"Little ones in need of positive reinforcement will find it here.  An exuberant pig proclaims \"I like me!\" She likes the way she looks, and all her activities....When she makes a mistake she picks herself up and tries again.\" --Booklist\"Wonderful in its simplicity, here's a story that will help kids feel good about themselves.\" -- Boston GLobe",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "PUFFIN BOOKS",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "My Struggle with Faith",
        "Authors": "By Girzone, Joseph F.",
        "Description": "The author of the bestselling Joshua series and other popular inspirational books chronicles his own spiritual journey and describes with stunning honesty the difficult decisions he made along the way.Joseph Girzone has attracted a tremendous following with his series of novels that imagine Jesus living in the contemporary world. His nonfiction writings and talks on spirituality have affected audiences around the world. Girzone’s ability to capture the meaning of faith in simple, direct language is more apparent than ever in this moving book about his personal journey through a dark night of the soul.In My Struggle with Faith, Girzone recounts the long, complicated, and often painful process he went though as he sought to find peace with his beliefs. He writes about hard decisions that set him on unexpected paths and about the immense feelings of loneliness he experienced in making those choices. In thoughtful and thought-provoking reflections he brings to life the years of searching and the deep, critical thinking that gave him the courage to embrace his beliefs, opening a world of excitement and adventure for him. In writing about what his beliefs have meant to him and about the intimate relationship with God that has sustained and guided him, Girzone illuminates the universal human struggle to find meaning in life. My Struggle with Faith offers readers insights, inspiration, and encouragement to follow their beliefs and create a more meaningful spiritual life.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Doubleday Religion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Complete Conditioning for Soccer (Complete Conditioning for Sports Series)",
        "Authors": "By Schmid, Sigi and Alejo, Bob",
        "Description": "",
        "Category": " Sports & Recreation , Soccer",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Wine-Lover's Holidays Cookbook",
        "Authors": "By Hoffman, Virginia and Hoffman, Robert",
        "Description": "",
        "Category": " Cooking , Holiday",
        "Publisher": "Rayve Productions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Sixth Wife: A Novel",
        "Authors": "By Dunn, Suzannah",
        "Description": "A gripping novel of love, passion, betrayal, and heartbreak in the unstable Tudor court following the death of King Henry VIIIClever, level-headed Katherine Parr has suffered through four years of marriage to the aging and irascible King Henry VIII—and she has survived, unlike the five wives who came before her. But less than a year after the old king's death, her heart is won by the dashing Thomas Seymour, and their hasty union undoes a lifetime of prudent caution.An unwilling witness to the queen's late-blossoming love, Catherine, Duchess of Suffolk, harbors nagging suspicions of Kate's handsome and ambitious new husband. But as Catherine is drawn deeper into the web of politics ensnaring her oldest friend, it gradually becomes clear that she has her own dark tale to tell. For though Thomas might betray his wife for power, Catherine might betray her for passion, risking everything she has in a world where love is a luxury not even royalty can easily afford.",
        "Category": " Fiction , Historical",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Miss Spider's Tea Party; the Counting Book (Sunny Patch Library)",
        "Authors": "By David Kirk",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Renaissance of Islam: Art of the Mamluks",
        "Authors": "By Esin Atil",
        "Description": "",
        "Category": "",
        "Publisher": "Smithsonian Institution Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Salting Roses: A Novel",
        "Authors": "By Marinello, Lorelle",
        "Description": "“A Southern Cinderella story with heart, soul, and humor. As sweet and tart as summer lemonade.”—Christie Ridgway, USA Today bestselling author A delightful new voice in Southern fiction, Lorelle Marinello makes a truly dazzling debut with Salting Roses—a novel that immediately places her in the esteemed company of Elinor Lipman, Loraine Despres, and Stephanie Gayle. In Salting Roses, a young woman abandoned as an infant on an Alabama porch is horrified to discover that she is the missing heiress to a vast Connecticut fortune—a birthright she wants desperately to reject in favor of her Peachtree Lane roots. A modern-day fairy tale with a Southern twist, rich in atmosphere and chock full of unforgettably eccentric characters, Lorelle Marinello’s novel is not to be missed.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Contemporary Marketing Telecourse Study Guide",
        "Authors": "By BOONE, Louis \"Gene\" Boone",
        "Description": "",
        "Category": "",
        "Publisher": "International Thomson Publishing",
        "Price Starting With ($)": "7.57",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Stinking Cookbook: From the Stinking Rose, a Garlic Restaurant",
        "Authors": "By Dal Bozzo, Jerry",
        "Description": "From San Francisco's Stinking Rose restaurant comes garlic infested recipes for chicken, soup, pork chops, clams, marinara sauce, potatoes, cough syrup, and ice cream",
        "Category": " Cooking , Reference",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "China's Unfinished Economic Revolution",
        "Authors": "By Lardy, Nicholas R.",
        "Description": "China's Unfinished Economic Revolution offers a fundamentally different interpretation of China's economic reform. The common view that China's gradualistic approach has served it well overlooks the fact that state-owned banks for the last two decades have channeled a large share of sharply rising household savings into what are mostly unreformed, money-losing companies. The result is that several of China's largest financial institutions now are insolvent. To avoid a major domestic banking crisis the book argues that China must recapitalize and restructure its domestic banking system and end the long-standing practice of making lending decisions based on political rather than economic criteria.Nicholas Lardy explains that this course will inevitably be costly in political terms, in part because it will lead for a time to a slower rate of economic growth. But the alternative is even less attractive&#151;permanently slower growth, continued macroeconomic instability, an inability to meet the expectations of the international community for the opening of its domestic financial markets, and insufficient resources to deal with severe environmental deterioration, growing water shortages, and a rapidly aging population.This timely book also analyzes the new reform initiatives China has launched in the wake of the Asian financial crisis, suggests additional steps that must be taken, and evaluates the implications for U.S. policy.",
        "Category": " Business & Economics , Economic Conditions",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Manual of Medical Therapeutics",
        "Authors": "By Packman, Robert C. (Editor)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Little Brown & Co (T)",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Country squire in the White House,",
        "Authors": "By Flynn, John Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday, Doran and Company, inc",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1940"
        }
    },
    {
        "Title": "Creative Dried Flowers",
        "Authors": "By Hogan, Elizabeth L. (EDT)",
        "Description": "Provides instructions for obtaining dried flowers and using them in arrangements, wreaths, topiary, and other projects",
        "Category": " Crafts & Hobbies , Flower Arranging",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "The Southwest (New American Cooking)",
        "Authors": "By Williams, Chuck (EDT), Beisch, Leigh (PHT), and Long, Kathi",
        "Description": "Featuring such recipes as squash blossom quesadillas, green chile stew, chile-rubbed cowboy steak, and fresh peach sangria, a celebration of culinary traditions captures the many flavors of the Southwest.",
        "Category": " Cooking , Regional & Ethnic , American , Southwestern States",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Betty Crockers New Cookbook",
        "Authors": "By Crocker, Betty",
        "Description": "",
        "Category": "",
        "Publisher": "Simon Schuster Trade",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Witch's Sister (W.I.T.C.H. (Paperback))",
        "Authors": "By Naylor, Phyllis Reynolds",
        "Description": "When the darkness, tolls the hour, I shall have you in my power...  Lynn and her best friend, Mouse, are positive their neighbor, Mrs. Tuggle, is a witch. And they suspect the old woman is forcing Lynn's sister, Judith, to join her coven to witches. But Lynn and Mouse can't prove anything and their parents don't believe them. the girls are desperate to expose Mrs. Tuggle's evil nature, especially since her actions are becoming more threatening everyday.  Now Lynn's parents have announced that they're going away for the weekend, leaving Judith and Mrs. Tuggle in charge. Can the girls outsmart Mrs. Tuggle and save Lynn's family -- or is the dark magic too strong to conquer?",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "An Intimate Journal of the Dreyfus Case",
        "Authors": "By Maurice Paleologue",
        "Description": "",
        "Category": "",
        "Publisher": "Criterion Books",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Your Health, Your Choice: Your Complete Personal Guide to Wellness, Nutrition & Disease Prevention",
        "Authors": "By Morter, M. Ted, Jr.",
        "Description": "",
        "Category": "",
        "Publisher": "LIFETIME BOOKS",
        "Price Starting With ($)": "12.95",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "God's Word for Boys",
        "Authors": "By",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "World Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Green Grows the Dollars",
        "Authors": "By Lathen, Emma",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Ultimate Pressure Cooker Cookbook: Home-Cooked Flavors for Today's Easy-to-Use Pressure Cookers",
        "Authors": "By Chace, Daniella and Keane, Maureen B.",
        "Description": "Imagine a tender chicken roast in ten minutes, or perfect vegetables in just two or three! The Ultimate Pressure Cooker Cookbook is a delicious collection of down-home American fare like stews, soups, roasts, and other main dishes, all cooked to perfection in a matter of minutes with the use of a handy pressure cooker! Maureen Keane and Daniella Chace have put their proven cooking talents to use to create hearty new dishes, as well as to convert old favorites to pressure cooker formulas.Inside you?ll find:Great recipes for vegetables, meat, seafood, poultry, and moreQuick-fix dinners for oneEasy feasts for a groupRecipes for hearty main courses, yummy desserts, baby food, and more!Pressure cooking dos and don?tsWhat to look for when purchasing a new pressure cookerHow the pressure cooker can make your meals more nutritiousAbout the AuthorsMaureen B. Keane and Daniella Chace, coauthors of Bread Machine Baking for Better Health and Grains for Better Health (both from Prima), are nutritionists and cooking instructors in Seattle, Washington.",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Worm Is Stuck (Brand New Readers Series)",
        "Authors": "By Caple, Kathy",
        "Description": "",
        "Category": "",
        "Publisher": "Candlewick Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Softball Skills & Drills",
        "Authors": "By Garman, Judi",
        "Description": "Softball Skills and Drills is based on the expertise of one of the NCAA's all-time winningest coaches, Judi Garman (1,124 victories), and current Cal State Fullerton head coach, Michelle Gromacki. The authors present techniques and strategies for all positions and skills in the game — hitting, fielding, pitching, catching and baserunning — making this full-color book applicable to players of all abilities. Over 230 drills, 160 photos and 50 illustrations accompany the instruction for easy-to-follow demonstrations. Original.",
        "Category": " Sports & Recreation , Reference",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Behavior Change in the Classroom: Self-Management Interventions (The Guilford School Practitioner Series)",
        "Authors": "By Shapiro, Edward S. and Cole, Christine L.",
        "Description": "One of the primary goals of education is to ensure that children learn varied and complex self-management skills to  become more self assured, more self reliant, and responsible for their own behavior, as well as to succeed academically.  Although learning experiences designed to actively teach self-management techniques are usually directed toward children with severe academic and behavior problems, these skills are also extremely beneficial for the general student population. An excellent resource for school-based practitioners who wish to address the needs of all school-aged children and adolescents, this book presents practical approaches for designing and implementing self-management interventions in school settings.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The Airplane Alphabet Book (Jerry Pallotta's Alphabet Books)",
        "Authors": "By Pallotta, Jerry, Bolster, Rob (ILT), and Stillwell, Fred",
        "Description": "Let your imagination take flight! This fact-filled book features  planes from A to Z, including the  Aviation Trainer Six, the Electra,  and the Zero. An high-flying tour of  the alphabet and a history of  flying machines the Wright Brothers to  hobbyist's model airplanes. Learn which type of plane is best for a dogfight, see the type of   plane Charles Lindbergh flew in the first nonstop flight across the   Atlantic, and much more. From the first flight of the Wright Flyer in   1903 to the age of jets, Rob Bolster's vivid illustrations will send you   soaring through the skies in this dynamic celebration of flight.",
        "Category": " Juvenile Nonfiction , Transportation , Aviation",
        "Publisher": "Charlesbridge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Stone's Throw",
        "Authors": "By Jackson, Faith Rehyer",
        "Description": "",
        "Category": " Fiction , Biographical",
        "Publisher": "Eloquent Books",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Love the Life You Live: 3 Secrets to Feeling Good--Deep down in Your Soul",
        "Authors": "By Parrott, Les and Warren, Neil Clark",
        "Description": "Everyone longs for healthy relationships, inner contentment, and peace. The journey toward emotional wholeness is hard work. But it's the most significant thing anyone can do for his or her relationships, since a relationship can only be as healthy as the least healthy person in it. Love the Life You Live introduces three time-tested secrets to help readers achieve enduring peace, long-lasting joy, and a deep level of emotional and spiritual health.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Picture Book to Remember Her By: Ireland",
        "Authors": "By Smart",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Uncle John's Bathroom Reader Salutes the Armed Forces",
        "Authors": "By Bathroom Readers' Institute",
        "Description": "Army, Navy, Air Force, Marines, and the Coast Guard! The patriotic folks at the BRI have stormed the proverbial beaches of Normandy and beyond to bring you this salute to the greatest force for good on planet Earth! Make your way through the ranks and read about the history, triumphs, trials, and humor of those who serve. At nearly 500 pages, this is the book you want by your side while you wait it out in the fox hole. Read about…   * The Semper Fi story* A history of the draft* The real Private Ryan* Dog tags then and now* Medal of Honor winners* M*A*S*H: the true story* The original Flying Tiger* Beetle Bailey and other cartoon soldiers* What it takes to be in the Special Forces* Can you see me now? The story of camouflage And much, much more!",
        "Category": " Reference , Trivia",
        "Publisher": "Portable Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "One Night in Scotland (1) (The Hurst Amulet)",
        "Authors": "By Hawkins, Karen",
        "Description": "New York Times bestselling author Karen Hawkins begins a sparkling new series with this thrilling tale of a desperate beauty on an urgent quest, a dark earl scarred by his beastly past—and the ancient treasure that binds their fates.  A mysterious abductor . . . Someone is holding her brother prisoner in exchange for a gold-and-onyx box covered in mysterious runes, so Mary Hurst boldly sets out from the family vicarage to find the priceless artifact. But the man who possesses it, Angus Hay, the Earl of Erroll, is less than sympathetic to her plight. A forbidding stranger . . . Himself a prisoner of his dark past, Angus refuses to yield the box—or allow Mary to leave! Suspicious of the alluring lass’s mission, he vows to wrest a confession from her, but unearths a fiery temper and a will as strong as his own. An unbreakable curse . . . Passion flares between them, but now there is more at stake: an unknown enemy is hunting down the precious box, and will stop at nothing. Risking all for love, Angus must solve the mystery behind the runes . . . and trust the only woman who can awaken his forgotten heart.",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Night Games",
        "Authors": "By Bangs, Nina",
        "Description": "A sex competitor from the future, Brian Byrne, skilled in the art of lust, seduction, and pleasure, meets his match in American tourist, author, and divorcTe Ally O'Neill who teaches him that sex is much better when love is involved. Original.",
        "Category": " Fiction , Romance , Time Travel",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Sweet Memories (Spencer, Lavyrle)",
        "Authors": "By Spencer, LaVyrle",
        "Description": "Teresa, a shy twenty-five-year-old woman lacking in self-confidence, finds her world forever changed by the arrival of her brother's army buddy, Brian Scanlon, who helps her cast aside her inhibitions and open her heart to the extraordinary possibilities of love. Originally in paperback. 150,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "In Search of Lost Civilizations",
        "Authors": "By Landsburg",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1976"
        }
    },
    {
        "Title": "Bound Together: How Traders, Preachers, Adventurers, and Warriors Shaped Globalization",
        "Authors": "By Chanda, Nayan",
        "Description": "",
        "Category": "",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Bus. 531 / Research and Strategic Communication, Second Custom Edition for Strayer University",
        "Authors": "By Paul Leedy",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Custom Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Stolen Children",
        "Authors": "By Kehret, Peg",
        "Description": "When Amy agreed to baby-sit Kendra Edgerton, she had no idea she was stepping into a kidnapping plot. Two men force the girls out of the house and into a cabin in the woods, where they create DVDs to send to the families, in hopes of a large ransom from Kendra's wealthy parents. Using her wits and imagination, Amy stealthily sends clues to the police through the DVDs, but time is working against her: She has one week until her captors decide to return Kendra and get rid of Amy.",
        "Category": " Young Adult Fiction , Family , Parents",
        "Publisher": "PUFFIN BOOKS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "The Busy Mom's Make It Quick Cookbook",
        "Authors": "By Steinback, Jyl and Karpinske, Stephanie (EDT)",
        "Description": "In her latest cookbook, America’s healthiest mom and fitness expert Jyl Steinback makes it easy to drive past the drive-through and home to nourishing meals and meaningful family time.Each delicious recipe starts with a convenient prepared or homemade mix so recipe preparation takes no more than 15 minutes.Offers a variety of recipes for main dishes, sides, appetizers, even desserts the entire family will enjoy.Includes a selection of fun, tasty kids’ snacks, and a holiday chapter for special occasions.Recipes provide at-a-glance shopping lists and nutrition information, including diabetic exchanges.Nutrition advice for deliciously healthy family meals.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Road to Armageddon",
        "Authors": "By Collins, Larry",
        "Description": "When Iran's deadly nuclear game is revealed, CIA agent Frank Williams realizes there is only one man made for the job of traveling to the other side of the world to neutralize this threat: his disgraced, but tough-as-lead former partner, agent Jim Duffy.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Phoenix Books, Inc.",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Pooh's Christmas Gifts (Disney First Readers)",
        "Authors": "By Gaines, Isabel",
        "Description": "A Disney First Reader book: paperbacks perfect for young children just beginning to read on their own.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Telling It All: A Legal Guide to the Exercise of Free Speech",
        "Authors": "By Fuson, Harold W., Jr.",
        "Description": "",
        "Category": " Law , General",
        "Publisher": "Andrews Mcmeel Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Social Dance: Steps to Success, 2nd Edition (Steps to Success)",
        "Authors": "By Wright, Judy Patterson, Ph.D.",
        "Description": "",
        "Category": " Performing Arts , Dance , Popular",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Sexual Trauma In Children And Adolescents: Dynamics & Treatment",
        "Authors": "By Everstine, Diana Sullivan and Everstine, Louis",
        "Description": "Concepts presented here were described and discussed at international conferences organized by the authors in Nice (1982), Munich (1984), and Amsterdam (1985). Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Psychology , General",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Little Chinese Cookbook",
        "Authors": "By Tan, Terry and Dray, Susan (ILT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Las Vegas For Dummies (Dummies Travel)",
        "Authors": "By Herczog, Mary",
        "Description": "With glittering casinos, glitzy shows, and over-the-top spectacles, Las Vegas can be a mind-boggling experience. This fun, friendly guide is a sure bet for a winning trip—complete with gambling tips, and more:The best shows on the StripTips on having fun without gamblingGreat experiences you can only get in Las Vegas!Like every For Dummies travel guide, Las Vegas For Dummies, Third Edition includes:Down-to-earth trip-planning adviceWhat you shouldn’t miss—and what you can skipThe best hotels and restaurants for every budgetHandy Post-it Flags to mark your favorite pages",
        "Category": " Travel , United States , West , Mountain (AZ, CO, ID, MT, NM, NV, UT, WY)",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Business Lunchatations: How an Everyday Guy Became One of America's Most Colorful CEOs...andHow You Can, Too!",
        "Authors": "By Bly, Robert W. and Dietl, Bo",
        "Description": "How one tough cop became one tough businessman.  Bo Dietl is a legend in the New York City Police Department. His hardheaded attitude and never-give-up ethic of crime fighting earned him a reputation as a man to be respected-and not to be taken lightly. After retiring from the force in 1985, Dietl went into business for himself as a security consultant and built an international company worth millions. Here, in his own inimitable style, Bo Dietl shows how, through smart networking, anyone can make it just as big as he did.  Using examples from his own vast experience in dealing with business friends and foes in a variety of situations-including his \"lunchatation situations,\" where personal connections and opportunity can come together in any setting-Dietl tells how knowing what to say, how to say it, when to say it, and who to say it to can count more than anything when it comes to success in the winner-take-all arena of big business.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Chamberlain Bros.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "April Morning",
        "Authors": "By Fast, Howard",
        "Description": "The Battle of Lexington becomes fifteen-year-old Adam Cooper's initiation into manhood",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1970"
        }
    },
    {
        "Title": "Evil Star",
        "Authors": "By Robinson, Logan",
        "Description": "",
        "Category": "",
        "Publisher": "WW Norton & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "The Glycemic Index Cookbook (Glycemic Index Ckbk)",
        "Authors": "By Steer, Gina, Watts, Charlotte, and Lewis, Sian",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Parragon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2012"
        }
    },
    {
        "Title": "Sonny The Lucky Bunny (A Wonder Book)",
        "Authors": "By Marcia Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Wonder Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Elizabeth Blackwell:First Doct (Gateway Biographies)",
        "Authors": "By Peck, Ira",
        "Description": "A biography of Elizabeth Blackwell, the first woman to attend medical school and practice medicine in the United States, also discusses her careers in Paris and London, and the medical colleges she helped establish.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Science & Technology",
        "Publisher": "Millbrook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Spring's Memory",
        "Authors": "By Colleen Coble, Carol Cox, Judith McCoy Miller, Darlene Mindrup",
        "Description": "",
        "Category": "",
        "Publisher": "bARBOUR",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "London Calling",
        "Authors": "By Bloor, Edward",
        "Description": "Martin Conway comes from a family filled with heroes and disgraces. His grandfather was a statesman who worked at the US Embassy in London during WWII. His father is an alcoholic who left his family. His sister is an overachieving Ivy League graduate. And Martin?  Martin is stuck in between--floundering.But during the summer after 7th grade, Martin meets a boy who will change his life forever. Jimmy Harker appears one night with a deceptively simple question:  Will you help?  Where did this boy come from, with his strange accent and urgent request? Is he a dream? It's the most vivid dream Martin's ever had. And he meets Jimmy again and again--but how can his dreams be set in London during the Blitz? How can he see his own grandather, standing outside the Embassy? How can he wake up with a head full of people and facts and events that he certainly didn't know when he went to sleep--but which turn out to be verifiably real?The people and the scenes Martin witnesses have a profound effect on him. They become almost more real to him than his waking companions. And he begins to believe that maybe he can help Jimmy. Or maybe that he must help Jimmy, precisely because all logic and reason argue against it.This is a truly remarkable and deeply affecting novel about fathers and sons, heroes and scapegoats. About finding a way to live with faith and honor and integrity. And about having an answer to the question: What did you do to help?",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "Ember",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Thyroid Sourcebook for Women",
        "Authors": "By Rosenthal, M. Sara",
        "Description": "Thyroid hormones are important to the functioning of a healthy body; but when the thyroid gland supplies too much, too little, or stops producing these vital hormones, many problems can occur. Women make up almost 80 percent of thyroid disorder patients; and when the thyroid gland starts to malfunction the repercussions for women are particularly serious.  M. Sara Rosenthal, the acclaimed author of The Thyroid Sourcebook, focuses on the thyroid's effect on the body, what treatments are available, and how to cope effectively with a chronic thyroid condition.",
        "Category": " Medical , Endocrinology & Metabolism",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Character Makes a Difference: Where I'm From, Where I've Been, and What I Believe",
        "Authors": "By Huckabee, Mike and Perry, John",
        "Description": "How powerful is integrity? Just ask minister-turned-statesman, Mike Huckabee.  As lieutenant governor of Arkansas in 1996, he was publicly cast between the ultimate rock and hard place when his boss, governor Jim Guy Tucker, refused to resign despite his felony convictions in the Whitewater scandal.  Holding fast to the tenets of honor and faith, and his concern over what was best for the state’s people, Huckabee led the impeachment charge against his superior before a televised audience. That same day, Tucker resigned, and Huckabee would serve as governor of Arkansas until 2007, winning many national honors along the way.Character Makes a Difference is Mike Huckabee’s biographical account of how he handled that potentially major constitutional crisis and why he believes character is the key issue in everyone’s life, “in the work you do, the candidates you vote for, the people who look to you for leadership.”",
        "Category": " Religion , Ethics",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Deep Breath",
        "Authors": "By Kent, Alison",
        "Description": "Forced to help beautiful treasure hunter Georgia McLain find and deliver a priceless historical document, or suffer deadly consequences, SG-5 operative Harry van Zandt will do anything to ensure that the artifact falls into the right hands. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Mrs. Beeton's Favorite recipes",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Bobbs-Merrill",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Reach for the Stars: Words to Inspire Action and Success",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Tangent Publications",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Humanistic Tradition Book 6",
        "Authors": "By Fiero, Gloria K.",
        "Description": "",
        "Category": " Philosophy , Movements , Humanism",
        "Publisher": "William C. Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Sympathy for the Devil (Madeline Bean Catering Mysteries #1)",
        "Authors": "By Farmer, Jerrilyn",
        "Description": "Madeline Bean, caterer to the stars, is in the middle of the biggest job of her career. She and her partner Wesley have pulled off Hollywood's most outrageous A-list Halloween party for notorious producer Bruno Huntley, complete with an eerie fortuneteller who is astonishingly accurate, and exotic food that's to die for. Before long, Bruno is thrashing and writhing out on the dance floor. Just one problem: he's not standing up, And soon, he's not even breathing.The newly late Mr. Huntley was poisoned, that's certain. But the number of suspects with a yen to send Bruno to the devil could fill an audition for extras in the next Quentin Tarantino flick. When Wesley is arrested for the murder because of a long-standing dispute with the maniacal mogul, Madeline knows he couldn't be guilty. But to prove it, she has to wade through the muck of a mudslinging family, outrun a pair of crazed canines, dodge a pair of well-aimed bullets, and expose a slew of secrets that could put a soap opera to shame. Somebody's cooked up a murder, and it's up to Madeline to find out who--before she faces a fadeout of her own.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Ingram of the Irish (The Theyn Chronicles, Book 3)",
        "Authors": "By Hunt, Angela Elwell",
        "Description": "Learning of his Irish origins, a proud English knight seeks the secrets of his birth. But the truth shatters his illusions, leaving him struggling with God's purpose for his life.",
        "Category": " Fiction , Historical",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Encouraging the Heart: A Leader's Guide to Rewarding and Recognizing Others",
        "Authors": "By Kouzes, James M. and Posner, Barry Z.",
        "Description": "All too often, simple acts of human kindness are often overlooked and under utilized by people in leadership roles. Advising mutual respect and recognition of accomplishments, Encouraging the Heart shows us how true leaders encourage and motivate those they work with by helping them find their voice and making them feel like heroes. Recognized experts in the field of leadership, authors James Kouzes and Barry Posner show us that, through love, leaders can encourage, and indeed allow those around them to be their very best. Both practical and inspirational, Encouraging the Heart gives readers a thoughtful approach to motivating individuals within an organizational structure. Read Chapter 3 or Chapter 12, or see The Encouragement Index.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Guinness World Records 2005",
        "Authors": "By Folkard, Claire (EDT)",
        "Description": "CELEBRATE THE 50TH ANNIVERSARY OF THE GLOBAL AUTHORITY ON WORLD RECORDS!Since 1955 Guinness World Records™ has been documenting the fastest and slowest, biggest and smallest, heaviest and lightest–and most amazing–of everything! And this special 2005 edition features more astonishing, inspiring, and unusual achievements than ever–spanning the wonders of the natural, material, and modern worlds, from amazing anatomy and epic journeys to entertainment, the Internet, and beyond. Did you know…• A Canadian man holds the Guinness World Record for the highest speed reached on a human-powered vehicle: 81 mph on his recumbent bike.• The most expensive burger can be ordered in New York City for a Guinness World Record price of $59.00! • The record for the tallest man ever remains held by Robert Pershing Wadlow of the United States, who stood 8 ft. 11.1 in. . . . and there’s so much more, including Guinness World Records’ awesome trademark photos! This special edition also offers the fascinating stories behind some of the most famous records, plus exclusive interviews with a selection of record breakers themselves–to make Guinness World Records 2005 the most memorable edition yet!",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Alex and the Ironic Gentleman",
        "Authors": "By Kress, Adrienne",
        "Description": "Often mistaken for a boy because of her haircut and name, Alex Morningside is an inquisitive girl of ten-and-a-half who attends the prestigious Wigpowder-Steele Academy. Unfortunately, though she loves to learn, Alex just can’t bring herself to enjoy her classes. Her teachers are all old and smelly and don’t seem to know about anything that has happened in the world the past thirty years, and her peers…well they are quite simply ridiculous. Luckily for Alex, the new school year brings an exciting new teacher. Mr. Underwood makes lessons fun and teaches her how to fence. But Mr. Underwood has a mysterious family secret - the swashbuckling and buried treasure kind - and not everyone is glad he has come to Wigpowder-Steele. When the infamous pirates of a ship called the Ironic Gentleman kidnap Mr. Underwood, Alex sets off on a journey to rescue him, along the way encountering a cast of strange and magical characters, including the dashing and sometimes heroic Captain Magnanimous, Coriander the Conjurer, the Extremely Ginormous Octopus, and the wicked Daughters of the Founding Fathers’ Preservation Society.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Weinstein Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Last Dance",
        "Authors": "By Feinstein, John and Krzyzewski, Mike (INT)",
        "Description": "Exploring what it means to a school, a coach, and a player to be in the Final Four or even at The Final, this work features stories of players and coaches who thought they'd never make it to college basketball's final weekend, the spectacular triumphs of the winning teams, and the heartbreaking defeat of those who missed the cut.",
        "Category": " Sports & Recreation , Basketball",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2016"
        }
    },
    {
        "Title": "Shortcuts for Teachers: Strategies for Reducing Classroom Workload (A Learning handbook)",
        "Authors": "By Enk, Jean",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Lake Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "Flowers (The Cultivated Gardener)",
        "Authors": "By Joyce, Kristin (EDT)",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Collins Pub San Francisco",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Plumbing (HOME REPAIR AND IMPROVEMENT (UPDATED SERIES))",
        "Authors": "By Time Life",
        "Description": "Close-up, cutaway, and exploded diagrams and step-by-step instructions guide the homeowner in unclogging drains, repairing faucets and toilets, working with pipe, and updating indoor and outdoor plumbing",
        "Category": " House & Home , Do-It-Yourself , Plumbing",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Too Many Murders: A Carmine Delmonico Novel",
        "Authors": "By McCullough, Colleen",
        "Description": "The year is 1967, and the world teeters on the brink of nuclear holocaust as the Cold War goes relentlessly on. But the little city of Holloman, Connecticut, home to prestigious Chubb University and armaments giant Cornucopia, has its own crisis: twelve murders have taken place in one day. As chief of detectives Captain Carmine Delmonico investigates, he finds himself drawn into a gruesome web of secrets and lies. And as if twelve murders were not enough, Carmine must match wits with the mysterious Ulysses, a spy giving Cornucopia’s armaments secrets to the Russians. Are the murders and espionage different cases, or are they somehow linked? When FBI special agent Ted Kelly makes himself part of the investigation, it appears the stakes are far higher than anyone had imagined. As the death toll mounts, Carmine and his team discover that the answers are not what they seem—but then, are they ever?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Missing Max: A Novel",
        "Authors": "By Young, Karen",
        "Description": "When baby Max is kidnapped during Mardi Gras, Jane and Kyle Madison’s life falls apart. What their daughter, Melanie, does next is unthinkable. Max vanished into thin air while in the care of his teenage sister, Melanie. Six months later, the family is a shadow of its former self: Melanie blames herself and is acting out and rebellious; Jane is obsessed with finding Max; and Kyle, a lawyer, struggles to cope with his own grief—and a persistent suspicion that one of his cases is connected to Max’s disappearance. With her family in turmoil and her marriage on the rocks, Jane thinks things can’t get any worse. Then when an affair and an unexpected pregnancy threaten to tear the Madisons’ lives apart, an anonymous caller leads to a break in the case. Can a second kidnapping bring their family back together?",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Popular Mechanics Home Safety Handbook: Practical Tips for Safe Living",
        "Authors": "By Becker, Nancy J.",
        "Description": "Popular Mechanics presents an all-color, essential guide to protecting home, hearth, and family. With accessible information on childproofing, environmental contaminants (such as radon), and securing the house from intruders, it could be the most important book on your shelf.Most accidents happen at home, but these 125 hints, tips, and simple how-to techniques will make any home much safer. From childproofing a space to dealing with environmental contaminants, everything is covered, along with the handiest, most economical fix for every problem. A full chapter deals directly with safeguarding children and infants. Grateful parents will become aware of dangers they probably overlooked--including malfunctioning garage doors and surprise drowning hazards, such as 5-gallon buckets. They'll also appreciate the advice on crib safety, lead poisoning, burns, and taking the proper precautions with electrical outlets, stoves, and firearms.  And there's lots of information on adult safety, too. Help prevent fires that can start due to faulty fixtures, holiday decorations, candles, and combustible materials, and lessen fire's potential for harm by correctly mounting smoke detectors, installing sprinkler systems, and planning an escape route in advance. Correct dangerous electrical and plumbing problems, get smart crime-prevention suggestions, and see what to do in case of an environmental emergency. The room-by-room tips show how to increase accessibility for anyone physically challenged. This is one manual no family can do without.",
        "Category": " House & Home , General",
        "Publisher": "Hearst",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    }
]