[
    {
        "Title": "A Creative Step-By-Step Guide to Container Gardening",
        "Authors": "By Sutherland, Neil (PHT) and Phillips, Sue",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Whitecap Books Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Encyclopedia of Social Work: 1997 Supplement(19th Edition)",
        "Authors": "By Edwards, Richard L. (EDT), Colby, Ira C., Garcia, Alejandro, McRoy, Ruth G., and Videka-Sherman, Lynn",
        "Description": "The publication of the new supplement brings the Encyclopedia up-to-date with the most current concerns in social work. With over 400 pages of new information, the supplement features new entries on timely topics such as managed care and social work, electronic technologies and the Internet, spirituality in social work, the working poor, and more— a total of 30 new entries, 15 new biographies, and 65 updates.",
        "Category": " Reference , Encyclopedias",
        "Publisher": "NASW Press",
        "Price Starting With ($)": "6.32",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Miss Peregrine's Home for Peculiar Children",
        "Authors": "By Riggs, Ransom",
        "Description": "Read the #1 New York Times best-selling series before it continues in A Map of Days. A mysterious island. An abandoned orphanage. A strange collection of very curious photographs. It all waits to be discovered in Miss Peregrine’s Home for Peculiar Children, an unforgettable novel that mixes fiction and photography in a thrilling reading experience. As our story opens, a horrific family tragedy sets sixteen-year-old Jacob journeying to a remote island off the coast of Wales, where he discovers the crumbling ruins of Miss Peregrine’s Home for Peculiar Children. As Jacob explores its abandoned bedrooms and hallways, it becomes clear that the children were more than just peculiar. They may have been dangerous. They may have been quarantined on a deserted island for good reason. And somehow—impossible though it seems—they may still be alive. \u2028\u2028A spine-tingling fantasy illustrated with haunting vintage photography, Miss Peregrine’s Home for Peculiar Children will delight adults, teens, and anyone who relishes an adventure in the shadows. “A tense, moving, and wondrously strange first novel. The photographs and text work together brilliantly to create an unforgettable story.”—John Green, New York Times best-selling author of The Fault in Our Stars “With its X-Men: First Class-meets-time-travel story line, David Lynchian imagery, and rich, eerie detail, it’s no wonder Miss Peregrine’s Home for Peculiar Children has been snapped up by Twentieth Century Fox. B+”—Entertainment Weekly “‘Peculiar’ doesn’t even begin to cover it. Riggs’ chilling, wondrous novel is already headed to the movies.”—People “You’ll love it if you want a good thriller for the summer. It’s a mystery, and you’ll race to solve it before Jacob figures it out for himself.”—Seventeen",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "12.48",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Leviathan (The Leviathan Trilogy)",
        "Authors": "By Westerfeld, Scott and Thompson, Keith (ILT)",
        "Description": "It is the cusp of World War I. The Austro-Hungarians and Germans have their Clankers, steam-driven iron machines loaded with guns and ammunition. The British Darwinists employ genetically fabricated animals as their weaponry. Their Leviathan is a whale airship, and the most masterful beast in the British fleet. Aleksandar Ferdinand, a Clanker, and Deryn Sharp, a Darwinist, are on opposite sides of the war. But their paths cross in the most unexpected way, taking them both aboard the Leviathan on a fantastical, around-the-world adventure….One that will change both their lives forever.",
        "Category": " Young Adult Fiction , Historical , Europe",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "You Can Hype Anything: Creative Tactics and Advice for Anyone with a Product, Business, or Talent to Promote",
        "Authors": "By Pinskey, Raleigh",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Kensington Publishing Corp.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Bedtime Prayers and Lullabies",
        "Authors": "By Fincher, Kathryn Andrews (ILT) and Paris, Twila",
        "Description": "An illustrated collection of prayers, lullabies, and Bible verses offers reassurance of God's love and guidance.",
        "Category": " Religion , Inspirational",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Tangled: Kingdom of Color (Step Into Reading, Step 1)",
        "Authors": "By Lagonegro, Melissa, Orpinas, Jean-Paul (ILT), Naggi, Elena (ILT), and Studio Iboix (ILT)",
        "Description": "When the kingdom's most wanted—and most charming—bandit Flynn Rider hides in a mysterious tower, the last thing he expects to find is Rapunzel, a spirited teen with an unlikely superpower—70 feet of magical golden hair! Together, the unlikely duo sets off on a fantastic journey filled with surprising heroes, laughter and suspense. With super simple text and full-color illustrations, this Step 1 Step into Reading leveled reader is based on Disney Tangled!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Santa Buddies The 2-in-1 Junior Novel",
        "Authors": "By Disney Book Group (COR)",
        "Description": "Paws is a toy puppy who comes to life and becomes Santa Claus's best buddy-thanks to some North Pole magic. Santa Claus and his talking pup take a trip to New York City, but Santa Claus has a run-in with a yellow cab and forgets who he is! Can Paws rescue Santa and get him back to the North Pole in time to save Christmas? This 2-in-1 junior novel retells The Search for Santa Paws, which releases direct-to-DVD from Walt Disney Studios Home Entertainment on Nov. 9, 2010. The book also includes a retelling of the hit film, The Legend of Santa Paws. With an eight-page, full-color insert of photos from both films, plus large text and simple sentence structure, this junior novel makes the fur-fect stocking stuffer!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Lotus Eaters: A Novel (Reading Group Gold)",
        "Authors": "By Soli, Tatjana",
        "Description": "- Winner of UK's James Tait Black Prize - New York Times Notable Book of 2010 - American Library Association 2011 Notable Book - Finalist LA Times Book Award - A Kirkus Reviews Top Debut Fiction of 2010 - Bookmarks Magazine Best Literary Fiction of 2010In the final days of a falling Saigon, The Lotus Eaters unfolds the story of three remarkable photographers brought together under the impossible umbrella of war: Helen Adams, a once-naïve ingénue whose ambition conflicts with her desire over the course of the fighting; Linh, the mysterious Vietnamese man who loves her, but is torn between conflicting loyalties to his homeland and his heart; and Sam Darrow, a man addicted to the narcotic of violence, to his intoxicating affair with Helen and to the ever-increasing danger of his job. All three become transformed by the conflict they have risked everything to record.In this much-heralded debut, Tatjana Soli creates a searing portrait of three souls trapped by their impossible passions, contrasting the wrenching horror of combat and the treachery of obsession with the redemptive power of love.",
        "Category": " Fiction , Women",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Scuba Equipment Care and Maintenance",
        "Authors": "By Farley, Michael B.",
        "Description": "",
        "Category": " Sports & Recreation , General",
        "Publisher": "Marcor Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Flags of Our Fathers: A Young People's Edition",
        "Authors": "By Bradley, James, Powers, Ron, and French, Michael (ADP)",
        "Description": "In this unforgettable chronicle of perhaps the most famous moment in American military  history, James Bradley has captured the glory, the triumph, the heartbreak, and the  legacy of the six men who raised the flag at Iwo Jima. Here is the true story behind  the immortal photograph that has come to symbolize the courage and indomitable will  of America. In February 1945, American Marines plunged into the surf at Iwo Jima—and  into history. Through a hail of machine-gun and mortar fire that left the beaches  strewn with comrades, they battled to the island's highest peak. And after climbing  through a landscape of hell itself, they raised a flag. Now the son of one of the  flagraisers has written a powerful account of six very different young men who came  together in a moment that will live forever. To his family, John Bradley never spoke  of the photograph or the war. But after his death at age seventy, his family discovered  closed boxes of letters and photos. In Flags of Our Fathers, James Bradley draws  on those documents to retrace the lives of his father and the men of Easy Company.  Following these men's paths to Iwo Jima, James Bradley has written a classic story  of the heroic battle for the Pacific's most crucial island—an island riddled with  Japanese tunnels and 22,000 fanatic defenders who would fight to the last man. But  perhaps the most interesting part of the story is what happened after the victory.  The men in the photo—three were killed during the battle—were proclaimed heroes and  flown home, to become reluctant symbols. For two of them, the adulation was shattering.  Only James Bradley's father truly survived, displaying no copy of the famous photograph  in his home, telling his son only: \"The real heroes of Iwo Jima were the guys who  didn't come back.\" Few books ever have captured the complexity and furor of war  and its aftermath as well as Flags of Our Fathers. A penetrating, epic look at a  generation at war, this is history told with keen insight, enormous honesty, and  the passion of a son paying homage to his father. It is the story of the difference  between truth and myth, the meaning of being a hero, and the essence of the human  experience of war.",
        "Category": " Young Adult Nonfiction , History , Military & Wars",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Lakeside Cottage",
        "Authors": "By Wiggs, Susan",
        "Description": "If you trust your heart, you&#39;ll always know who you are&#133;Each summer, Kate Livingston returns to her family&#39;s lakeside cottage, a place of simple living and happy times&#151;a place where she hopes her son, Aaron, can blossom. But her quiet life gets a bit more interesting with the arrival of a mysterious new neighbor, JD Harris.JD has a good reason for being secretive. In a moment of sheer bravery, the Washington, D.C., paramedic prevented a terrible tragedy&#151;and became a national hero. He&#39;s hardly able to remember who he was before the media frenzy&#133;until he escapes to this lovely, remote part of the Northwest.Now Kate and Aaron have rekindled the joy of small pleasures and peace, something JD thought he&#39;d never have again. But how long will his blissful anonymity last before reality comes banging at his door?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Limu: The Blue Turtle",
        "Authors": "By Armitage, Kimo",
        "Description": "",
        "Category": "",
        "Publisher": "Island Heritage Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Book of Twins: A Celebration in Words and Pictures",
        "Authors": "By Tresniowski, Alex, Ganz, Debra, Ganz, Lisa, and Ballenberg, Bill (PHT)",
        "Description": "A collection of photographs and essays provides a journey into the secret world of twins with profiles of thirty-eight sets of twins who speak about their relationships",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Moonlight Mile: A Kenzie and Gennaro Novel (Patrick Kenzie and Angela Gennaro Series, 6)",
        "Authors": "By Lehane, Dennis",
        "Description": "“[Lehane has] emerged from the whodunit ghetto as a broader and more substantial talent....When it comes to keeping readers exactly where he wants them, Mr. Lehane offers a bravura demonstration of how it’s done.”—New York TimesMoonlight Mile is the first Patrick Kenzie and Angela Gennaro suspense novel in more than a decade from the acclaimed, New York Times bestselling master of the new noir, Dennis Lehane. An explosive tale of vengeance and redemption—the brilliant sequel to Gone, Baby, Gone—Moonlight Mile returns Lehane’s unforgettable and deeply human detective duo to the mean streets of blue collar Boston to investigate the second disappearance of Amanda McCready, now sixteen years old. After his remarkable success with Mystic River, Shutter Island, and The Given Day, the celebrated author whom the Washington Post praises as, “one of those brave new detective stylists who is not afraid of fooling around with the genre’s traditions,” returns to his roots—and the result, as always, is electrifying.",
        "Category": " Fiction , Crime",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Second Chances: More Tales of Found Dogs",
        "Authors": "By Walker, Diana (PHT), Lufkin, Elise, and Curtis, Jamie Lee (FRW)",
        "Description": "Every year, millions of dogs are abandoned-at animal shelters, racetracks, or on the side of the road. Many of these animals end their days without ever knowing a caring human hand, but some are fortunate enough to be found and given a second chance. And these dogs, often rescued from death's door, seem to have even more than the usual canine capacity for love and loyalty. Second Chances, is full of wonderful photos and words by people who have adopted dogs in myriad ways. Celebrities from Julio Iglesias, Mikhail Baryshnikov, Donna Shalala, and Oscar de la Renta to everyday heroes who have found dogs--from sleek greyhounds to scruffy mix-breeds--that have become service dogs, protectors, and friends, offering solace, aid, companionship and inspiration. SECOND CHANCES is a moving tribute to the power of love between people and dogs-how that love has transformed dogs who were lost, and the people who were lucky enough to find them.",
        "Category": " Pets , Dogs , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Military Dimension: Mark II",
        "Authors": "By Drake, David",
        "Description": "In an alternate world during the Vietnam War, an armored battalion is forced to confront a deadly alien enemy that is older than humanity itself, and when they storm its prison camp, they learn about a fate worse than death. Original.",
        "Category": "",
        "Publisher": "Baen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "The Definitive Guitar Handbook",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Star Fire / Borders",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Complete Guide to Flooring (Black & Decker)",
        "Authors": "By Editors of Creative Publishing, international, The Editors of Creative Publishing",
        "Description": "A do-it-yourself guide to using flooring as a design element in the home offers a close-up look at different types of flooring--ceramic tile, terrazo, stone, hardwood, laminate, carpet, and more--as well as complete, step-by-step instructions on how to install different surfaces, how to repair problems, and how to care for various flooring materials. Original. 30,000 first printing.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Bank on Yourself: The Life-Changing Secret to Growing and Protecting Your Financial Future",
        "Authors": "By Yellen, Pamela G.",
        "Description": "Bank On Yourself: The Life-Changing Secret to Growing and Protecting Your Financial Future reveals the secrets to taking back control of your financial future that Wall Street, banks, and credit card companies don't want you to know. You'll discover how to:· Have a rock-solid financial plan and a predictable retirement income that can last as long as you do – with no luck, skill, or guesswork required· Turn your back on the stomach-churning twists and turns of the stock and real estate markets· Get back every penny you pay for your cars, vacations, home repairs, business equipment, a college education, and other major purchases, so you can enjoy more of life's luxuries today without robbing your nest-egg! (The average family could increase their lifetime wealth by $500,000 to $1,000,000 or more using this method, without the risk or volatility of stocks and real estate)· Become your own source of financing and recapture the interest you pay to banks and finance companies – reduce or eliminate the control those institutions have over youCan you imagine what it would be like to look forward to opening your account statements because they always have good news and never any ugly surprises?More than 100,000 Americans of all ages, incomes, and backgrounds are already using Bank On Yourself to grow a nest-egg they can predict and count on, even when stocks, real estate, and other investments tumble. You'll meet some of them and hear their stories of how Bank On Yourself has helped them reach a wide variety of short-term and long-term personal and financial goals and dreams in this book.",
        "Category": " Business & Economics , Personal Finance , Retirement Planning",
        "Publisher": "Vanguard Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Love Your Neighbor (Big Idea Books)",
        "Authors": "By Hardin, Greg",
        "Description": "Includes room at the end for kids to draw their own picture!Kids will love this fun, rhyming tale about a boy from Jibberty Lot who visits his friend in Flibber-o-loo. And just like the boy from Jibberty Lot, kids will discover the joy in loving others and being a good neighbor, too.Sunday morning values, Saturday morning fun. Now that's the Big Idea!Through imaginative and innovative products, Zonderkidz is feeding young souls.",
        "Category": " Juvenile Fiction , Religious , General",
        "Publisher": "Zonderkidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Eat, Drink, and Be From Mississippi: A Novel",
        "Authors": "By Kincaid, Nanci",
        "Description": "Truely Noonan is the quintessential Southern boy made good. Like his older sister, Courtney, Truely left behind the slow, sweet life of Mississippi for jet-set San Francisco, where he earned a fortune as an Internet entrepreneur. Courtney and Truely each find happy marriages--until, as if cursed by success, those marriages start to crumble. Then their lives are interrupted by an unexpected stranger--a troubled teenager named Arnold, garrulous, charming, thuggishly dressed, and determined to move in to their world. Arnold turns their lives upside down--and in the process this unlikely trio becomes the family that each had been searching for. In the best Southern fiction tradition, Kincaid has brought us an inspiring story about finding the way home.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Maya: life, myth and art",
        "Authors": "By Laughton, Timothy",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "6.27",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Complete Herb Garden",
        "Authors": "By Stevens, John",
        "Description": "Here is a comprehensive and inspirational guide to gardening with herbs that is filled with practical advice for choosing and growing them successfully. All aspects of planting and caring for herbs are clearly shown in step-by-step photographs - sowing seeds, dividing roots, taking cuttings, even planting herbs in a pond. Helpful advice on buying healthy plants, identifying soils, and dealing with common diseases is also included.To help you select herbs that will thrive in your area, The Complete Herb Garden describes different garden conditions, from full shade to ponds and wetlands, from dry, stony areas to moisture-retaining soils. And it gives you a list of the most suitable herbs for each habitat.The chapter devoted to designing your garden with herbs is an invaluable source of ideas and suggestions for creating different types of beds, including a water garden, a wildflower garden, a kitchen garden, and a formal herb garden. Garden features such as lawns, paths, and walls can also be planted with herbs. Indeed, even the smallest gardens can benefit from herbs that are suited to patios and containers.In addition, a fully illustrated directory lists more than 180 of the most decorative and interesting herbs and gives complete cultivation information.",
        "Category": " Gardening , Herbs",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Cake Decorating Simplified: The Roth Method",
        "Authors": "By Gamon, David",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Science With Batteries",
        "Authors": "By Shipton, P.",
        "Description": "",
        "Category": " Juvenile Nonfiction , Technology , Electricity & Electronics",
        "Publisher": "Edc Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Centennial album of the Civil War,",
        "Authors": "By Pakula, Marvin H.",
        "Description": "",
        "Category": "",
        "Publisher": "Castle Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Merriam-Webster's Intermediate Dictionary",
        "Authors": "By Merriam-Webster",
        "Description": "\"A dictionary written especially for students ages 11–14. 65,000 entries. 1,000 detailed illustrations. 300 word history paragraphs. 170 synonym paragraphs. Abundant usage examples.\"",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Merriam Webster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The desire of ages",
        "Authors": "By White, Ellen Gould Harmon",
        "Description": "",
        "Category": "",
        "Publisher": "Pacific Press Pub. Association",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Plato: Phaedo",
        "Authors": "By Hackforth, R. (EDT)",
        "Description": "The book is written for anyone seriously interested in Plato's thought and in the history of literary theory or of rhetoric. No knowledge of Greek is required. The focus of this account is on how the resources both of persuasive myth and of formal argument, for all that Plato sets them in strong contrast, nevertheless complement and reinforce each other in his philosophy.",
        "Category": " Literary Collections , Ancient & Classical",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "17.38",
        "Publish Date": {
            "Month": "May",
            "Year": "1972"
        }
    },
    {
        "Title": "Killer Station",
        "Authors": "By Caidin, Martin",
        "Description": "Sabotage transforms a giant space station, Station Pleides, into a deadly weapon, plunging relentlessly toward its point of impact, America's greatest city",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "In Mortal Danger: The Battle for America's Border and Security",
        "Authors": "By Tancredo, Thomas G.",
        "Description": "Congressman Tom Tancredo explains in cogent, rational detail how America is heading down the road to ruin. He believes that the incredible economic success and military prowess of the United States has transformed a nation founded on Judeo-Christian principles of right and wrong into an overindulgent, self-deprecating, immoral cesspool of depravity. Without strong, moral leadership, without a renewed sense of purpose, without a rededication to family and community, without shunning the race hustlers and pop-culture sham artists, without protecting our borders, language, and culture, the nation that once was the land of the free and home of the brave\"\" and the \"\"one last hope of mankind\"\" will repeat the catastrophic mistakes of the past. \"\"In Mortal Danger\"\" is his prescription for repairing the damage.\"\"",
        "Category": " Political Science , Public Policy , Cultural Policy",
        "Publisher": "Cumberland House Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "My Brother, My Enemy: America and the Battle of Ideas Across the Islamic World",
        "Authors": "By Smucker, Philip",
        "Description": "This kaleidoscopic tour behind the frontlines of the war of ideas assesses US efforts to persuade Muslims that Americans respect their rights and interests, while we fight wars and promote our interests. The author draws on his extensive travels in the Muslim world and interviews with a cross-section of the population including students, intellectuals, insurgents and politicians. For an American perspective, the author conducted candid interviews with US military officers, diplomats, and regional experts. Smucker describes turmoil within the Islamic realm and our efforts to project \"soft power\" into a world that remains misunderstood. He assesses both our failures and successes in Israel and Palestine, Egypt, Indonesia, Afghanistan, Pakistan, and Saharan Africa. Several themes resonate through these interviews. One is that the Muslim world is looking for consistent engagement from the US, particularly in regard to Israeli-Palestinian peace. After decades of paying lip service to the ideal of peace in the Middle East, the author shows why it is crucial for the Obama Administration to push forcefully for a two-state solution. Another is that the US must discontinue its policy of backing authoritarian regimes that oppress their people. In the eyes of everyday Muslims, such tactics make a mockery of our claim to be the champion of individual liberty. Muslims, many of whom already support democratic change, will only be convinced of America’s good will, says the author if our actions speak louder than our words. This revealing, vividly told narrative by a daring and experienced journalist with firsthand knowledge of the events and people in conflict areas offers unforgettable insights into the Muslim world’s hopes and fears as well as our own crucial diplomatic overtures and military campaigns across the Islamic world.",
        "Category": " Social Science , Islamic Studies",
        "Publisher": "Prometheus",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "K Blows Top: A Cold War Comic Interlude Starring Nikita Khrushchev, America's Most Unlikely Tourist",
        "Authors": "By Carlson, Peter",
        "Description": "Khrushchev’s 1959 trip across America was one of the strangest exercises in international diplomacy ever conducted??a surreal extravaganza,” as historian John Lewis Gaddis called it. Khrushchev told jokes, threw tantrums, sparked a riot in a San Francisco supermarket, wowed the coeds in a home economics class in Iowa, and ogled Shirley MacLaine as she filmed a dance scene in Can-Can. He befriended and offended a cast of characters including Nelson Rockefeller, Richard Nixon, Eleanor Roosevelt, Elizabeth Taylor, and Marilyn Monroe.Published for the fiftieth anniversary of the trip, K Blows Top is a work of history that reads like a Vonnegut novel. This cantankerous communist’s road trip took place against the backdrop of the fifties in capitalist America, with the shadow of the hydrogen bomb hanging over his visit like the Sword of Damocles. As Khrushchev kept reminding people, he was a hot-tempered man who possessed the power to incinerate America.",
        "Category": " Political Science , Political Ideologies , Communism, Post-Communism & Socialism",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Better Homes and gardens Annual Recipes 2004",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Magic Barrel",
        "Authors": "By Malamud, Bernard",
        "Description": "",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "6.94",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Trail of Crumbs: Hunger, Love, and the Search for Home",
        "Authors": "By Sunee, Kim",
        "Description": "Already hailed as \"brave, emotional, and gorgeously written\" by Frances Mayes and \"like a piece of dark chocolate--bittersweet, satisfying, and finished all too soon\" by Laura Fraser, author of An Italian Affair, this is a unique memoir about the search for identity through love, hunger, and food.Jim Harrison says, \"TRAIL OF CRUMBS reminds me of what heavily costumed and concealed waifs we all are.  Kim Sunée tells us so much about the French that I never learned in 25 trips to Paris, but mostly about the terrors and pleasure of that infinite octopus, love.  A fine book.\"When Kim Sunée was three years old, her mother took her to a marketplace, deposited her on a bench with a fistful of food, and promised she'd be right back. Three days later a policeman took the little girl, clutching what was now only a fistful of crumbs, to a police station and told her that she'd been abandoned by her mother.Fast-forward almost 20 years and Kim's life is unrecognizable. Adopted by a young New Orleans couple, she spends her youth as one of only two Asian children in her entire community. At the age of 21, she becomes involved with a famous French businessman and suddenly finds herself living in France, mistress over his houses in Provence and Paris, and stepmother to his eight year-old daughter.Kim takes readers on a lyrical journey from Korea to New Orleans to Paris and Provence, along the way serving forth her favorite recipes. A love story at heart, this memoir is about the search for identity and a book that will appeal to anyone who is passionate about love, food, travel, and the ultimate search for self.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "A Century Turns: New Hopes, New Fears",
        "Authors": "By Bennett, William J.",
        "Description": "In  A Century Turns, William J. Bennett explores America's recent and momentous history?the contentious election of 1988, the fall of the Berlin Wall and the collapse of global Communism, the presidency of William Jefferson Clinton, the technological and commercial boom of the 1990s, the war on terror, and the election of America's first black president.Surveying politics and pop culture, economics and technology, war and religion, Bennett pieces together the players, the personalities, the feats and the failures that transformed key moments in the American story. And he captures it all with piercing insight and unrelenting optimism.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Bad Neighbor Policy: Washington's Futile War on Drugs in Latin America",
        "Authors": "By Carpenter, Ted Galen",
        "Description": "The domestic phase of Washington's war on drugs has received considerable criticism over the years from a variety of individuals. Until recently, however, most critics have not stressed the damage that the international phase of the drug war has done to our Latin American neighbors. That lack of attention has begun to change and Ted Carpenter chronicles our disenchantment with the hemispheric drug war. Some prominent Latin American political leaders have finally dared to criticize Washington while at the same time, the U.S. government seems determined to perpetuate, if not intensify, the antidrug crusade. Spending on federal antidrug measures also continues to increase, and the tactics employed by drug war bureaucracy, both here and abroad, bring the inflammatory \"drug war\" metaphor closer to reality. Ending the prohibitionist system would produce numerous benefits for both Latin American societies and the United States. In a book deriving from his work at the CATO Institute, Ted Carpenter paints a picture of this ongoing fiasco.",
        "Category": " Political Science , Law Enforcement",
        "Publisher": "St Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "ANIMAL TALES: LGB CO",
        "Authors": "By Golden Books",
        "Description": "Nine timeless Golden animal tales come together in one deluxe, affordable compilation. This volume of cherished stories has 224 gilded pages, beautifully bound with the famous golden spine. This wonderful collection includes such classics as The Saggy Baggy Elephant, Mister Dog, and Tawny Scrawny Lion . . . and many more",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "California Cooking - Parties, Picnics, and Celebrations",
        "Authors": "By Art Museum Council, LA County Museum of Art",
        "Description": "Recipes for breakfast in bed, lunch on the lawn, cookout on the sand, twilight barbecue, afternoon tea, and poolside brunch are among the 160 provided by Californians to reflect the California-style",
        "Category": " Cooking , Regional & Ethnic , American , California Style",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Making Hard Decisions: An Introduction to Decision Analysis (Duxbury series in statistics and decision science)",
        "Authors": "By Clemen, Robert T.",
        "Description": "",
        "Category": "",
        "Publisher": "Pws Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Barbecue: A Selection of Delicious Sizzlers",
        "Authors": "By Lorraine and Doeser, Linda Turner",
        "Description": "",
        "Category": "",
        "Publisher": "Paragon Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Scotland: A Year Of The Land",
        "Authors": "By Smart, Ted, Gibbon, David, and Digby, Ian",
        "Description": "Shows and describes the shores, rivers, bridges, mountains, cities, castles, and countryside of Scotland",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "How to Draw Anything - A Complete Guide",
        "Authors": "By Angela Gair",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Ancient Egyptian Designs for Artists and Craftspeople (Dover Pictorial Archive)",
        "Authors": "By Wilson, Eva",
        "Description": "The timeless simplicity, elegance, and clarity of Egyptian design are clearly evident in this album of over 400 copyright-free illustrations. Spanning more than 3,000 years of arts and crafts in the land of the Pharaohs, the designs have been taken from actual clothing and textiles, furniture, tomb paintings, relief carvings, jewelry, pottery, and other artifacts.Painstakingly rendered by Eva Wilson, noted illustrator of books on art and archaeology, this wealth of beautiful and useful images includes such traditional motifs as the lotus (the most common motif in Egyptian art), papyrus, sedge, the sun god Re, plant scrolls, scarabs, garlands of flowers and petals, feather patterns, palmettes, and many more.In addition to superb reproductions of the original images, this book contains an informative introduction outlining the Egyptian approach to art, as well as the techniques and materials used in painting, pottery, and other crafts. Moreover, captions and notes on the designs provide provenances, dates, dimensions where available, and other data.Artists, needleworkers, designers, and craftspeople will welcome this ready-to-use resource of authentic Egyptian design ― the perfect way to add the exotic flavor of the ancient Near East to any art or craft project.",
        "Category": " Design , Clip Art",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Sauces (Classical And Contemporary Sauce Making)",
        "Authors": "By Peterson, James",
        "Description": "Offers tips for making sauces and more than five hundred recipes for stocks, glaces, liasons, brown sauces, meat sauces, fish sauces, and purees",
        "Category": " Cooking , General",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Ultimate Chinese & Asian CookDoeser (1998) Hardcover",
        "Authors": "By Doeser",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "8.92",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Ultimate Grill Book",
        "Authors": "By Joan Griffiths",
        "Description": "",
        "Category": "",
        "Publisher": "JG Press",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Jossey-Bass Reader on Technology and Learning",
        "Authors": "By",
        "Description": "In this extensive collection of select articles, reports, and essays, leading experts and distinguished authors explore educational technology and its impact on learning. They draw from the most current research and best practices to examine:* Technology and reform, including film and radio in the classroom, research from the Apple Classrooms of Tomorrow, statewide instructional technology programs, technology in the community, and evaluation* Teaching with technology, plus the evolution of technology- and student-centered classrooms, lessons from an on-line community of education professionals, the integration of technology with teacher preparation, and Internet use by teachers* Equitable access and technical literacy, including how to invest in technology, evaluate content, bridge the digital divide, engage students in a knowledge society, and create the virtual high schoolFilled with diverse perceptions and insights, The Jossey-Bass Reader on Technology and Learning will inspire teachers, administrators, superintAndents, school technology directors, and policy makers to become thoughtful leaders in innovation and change.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "New Garden Book (Better Homes and Gardens Gardening)",
        "Authors": "By Better Homes and Gardens Books (EDT) and Rogers, Marilyn (EDT)",
        "Description": "The complete gardening reference--plants, advice, and techniques for every region and garden styleSince 1951, Better Homes and Gardens® Garden Book has been the must-have referenceBigger and better with more growing information, plant profiles, and photosWritten by experts from around the countryShows you how to garden where you live, from planning to choosing, using, and growing lawns, trees, shrubs, flowers, fruits, and vegetablesBetter Homes and Gardens® Garden Book is your ticket to a beautiful landscape.",
        "Category": " Gardening , General",
        "Publisher": "Better Homes & Gardens",
        "Price Starting With ($)": "12.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Fu Finds The Way",
        "Authors": "By Rocco, John",
        "Description": "When the warrior Chang challenges young Fu to a duel, Fu panics. His only hope is that the Master will train him, just as he's trained all the young warriors of the village.  But instead of teaching Fu to fight, the Master teaches him to pour tea. Fu learns purpose, flow and patience in the process, but will it be enough to defeat the mighty Chang? With his signature breathtaking art, John Rocco has created a modern parable full of adventure, heart, humor, and a gentle message about the importance of focus and finding joy in simple tasks.",
        "Category": " Juvenile Fiction , Social Themes , Values & Virtues",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Art Activity Pack: Cezanne (Art Activity Packs)",
        "Authors": "By Boutan, Mila",
        "Description": "In this innovative new series, readers will learn about four of the world's best known artists--Monet, Matisse, Cezanne, and Van Gogh--and they'll also get activity ideas that will inspire them to create their own masterpieces.Each Art Activity Pack comes with a paperback book about the artist and focuses on one of the concepts behind his work. In addition, theCezanne, Monet and Van Gogh Packs include an art activity book and a poster to color. The Matisse Pack includes stencils and brightly colored paper young artists can cut to create their own collages.Included in the Art Activity Packs:(Cezanne, Monet and Van Gogh)Full Color BookArt Activity Book(Cezanne, Monet and Van Gogh)Large Format Poster(Matisse)Stencils & Colored Paper",
        "Category": "",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Mutiny on Board HMS Bounty (Great Illustrated Classics)",
        "Authors": "By Bligh, William",
        "Description": "",
        "Category": "",
        "Publisher": "Baronet Books",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Lorenza's Pasta: 200 Recipes for Family and Friends",
        "Authors": "By De' Medici Stucchi, Lorenza",
        "Description": "The story of pasta is inextricably linked to the aristocratic tradition of cucina alto borghese, or sophisticated cooking, from Renaissance Tuscany, which Lorenza has long championed. Pasta is never an ordinary dish: even when simply dressed with garlic, oil, and Parmesan cheese, it should be prepared and cooked with care and attention. Within 200 enticing recipes, Lorenza sets out the principles of selecting just the right sauce or stuffing and also provides invaluable suggestions for coordinating pasta with other dishes on the menu. Lorenza's dishes offer inspiration for every level of entertaining, whether it's a spontaneous family lunch or an elegant dinner party with friends.From classics like Ravioli with Bacon and Potatoes and Trenette with Pesto Sauce to the more sophisticated and unusual - Agnolotti with Black Truffles, Penne with Swordfish, Zitoni with Olives, Saffron, and Sardines - the recipes are defined clearly for all aspiring cooks. There are delicious molded and baked pasta dishes - Fettucine Crust with Pecorino and Mint, Macaroni Timbale with Mushrooms - or pasta in broths and soups - Angel Hair and Asparagus Soup and Quadrucci Soup - as well as stuffed pasta dishes - Green Cannelloni with Mushrooms, Ravioli with Scallops, Tortelloni Stuffed with Zucchini and Tarragon. All reveal Lorenza's particular passions and flair for simple but elegant cooking. Arranged according to sauces - seafood, meat, vegetable, and cheese - each appetizing course conjures a world of Italian flavors and aromas.",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "More Easy Everyday Cooking",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "People are staying home more and cooking more. And they’re hungry for recipes that are different but not difficult and that the whole family will enjoy. Practical approaches to cooking around hectic schedules:Everyday ingredients30-minutes prep timeAttractive presentationThe basics of good home cooking:General cooking hintsMake-ahead tipsShortcutsA new standard for eating in:Everyday cookingInteresting flavorsHealthy eating",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "1000 Questions and Answers (Our Solar System)",
        "Authors": "By Kerrod, Robin (EDT), Kingfisher Publications, and Achille, G. D. (ILT)",
        "Description": "What's the difference between a star and a planet? What killed the dinosaurs? What is acid rain? Who built the first cities - a host of straight-to-the-point, and equally eccentric questions that kids love to ask are covered in this amazing compendium. 1000 Questions and Answers combines eight fascinating subjects: Stars and Planets, Planet Earth, Dinosaurs, Birds, Ancient Civilizations, Knights and Castles, Inventions and Transportation, in one fully indexed volume.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "6.86",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Title: THE CIVIL WAR",
        "Authors": "By JASON HOOK",
        "Description": "",
        "Category": "",
        "Publisher": "Paragon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Tree Of Hate",
        "Authors": "By Powell, Philip Wayne",
        "Description": "",
        "Category": " Social Science , Discrimination & Race Relations",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "October",
            "Year": "1971"
        }
    },
    {
        "Title": "A Day in the Life of Ireland: Photographed by 75 of the World's Leading Photojournalists on One Day, May 17, 1991",
        "Authors": "By Collins Publishers, Collins1, Erwitt, Jennifer",
        "Description": "",
        "Category": "",
        "Publisher": "Collins Pub San Francisco",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Vacationing With Your Pet: Eileen's Directory of Pet-Friendly Lodging in the United States & Canada : Over 25,000 Listings of Hotels, Inns, Ranches and B&Bs That Welcome Guest p",
        "Authors": "By Barish, Eileen",
        "Description": "Presents a directory of pet-friendly hotels, bed and breakfast accommodations, and historic lodging in the United States and Canada.",
        "Category": " Pets , General",
        "Publisher": "Pet Friendly Productions",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Nebula Awards Showcase 2009",
        "Authors": "By Datlow, Ellen (EDT)",
        "Description": "Michael Chabon, Michael Moorcock, Karen Joy Fowler, and more: ?The pulse of modern science fiction.?(New York Times Book Review)This annual tradition from the Science Fiction and Fantasy Writers of America collects the best of the year?s stories, as well as essays and commentary on the current state of the genre and predictions of future science fiction and fantasy films, art, and more. This year?s award-winning authors include Michael Chabon, Karen Joy Fowler, Ted Chiang, and Nancy Kress, plus 2008 Grand Master Michael Moorcock.",
        "Category": " Fiction , Science Fiction , Collections & Anthologies",
        "Publisher": "Ace",
        "Price Starting With ($)": "32.95",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Oz Clarke's New Classic Wines",
        "Authors": "By Clarke, Oz",
        "Description": "Assesses the impact of the modern winemaker on the wines we drink today, and the benefits (and the problems) that new technology has brought to both fine and everyday wines",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Classic Magic Tricks",
        "Authors": "By Longe, Bob, Townsend, Charles Barry, and Knowles, David",
        "Description": "",
        "Category": "",
        "Publisher": "main street press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "All Cordoba [Unknown Binding]",
        "Authors": "By Various Contributors",
        "Description": "",
        "Category": "",
        "Publisher": "Editorial Escudo De Oro",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "My gigantosaurus book of colors",
        "Authors": "By Lewis, Jan",
        "Description": "",
        "Category": "",
        "Publisher": "Lowe & B. Hould",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Weight Loss : An Alternative Medicine Definitive Guide (Alternative Medicine Definative Guide)",
        "Authors": "By Goldberg, Burton",
        "Description": "Explains how to use enzymes, aromatherapy, diet, nutrition, Ayurvedic medicine, glandular extracts, exercise, and supplements to help lose weight permanently.",
        "Category": " Health & Fitness , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Frommer's Napa & Sonoma Day by Day (Frommer's Day by Day - Pocket)",
        "Authors": "By Binshtock, Avital",
        "Description": "These attractively priced, four-color guides offer dozens of neighborhood and thematic tours, complete with hundreds of photos and bulleted maps that lead the way from sight to sight. Day by Days are the only guides that help travelers organize their time to get the most out of a trip. Full-color package at an affordable priceStar ratings for all hotels, restaurants, and attractionsFoldout front covers with maps and quick-reference informationTear-resistant map in a handy, reclosable plastic walletHandy pocket-sized trimAt last, a travel guide that tells you how to see the best of everything—in the smartest, most time-efficient way.The best of Napa & Sonoma in one, two, or three daysThematic tours for every interest, schedule, and tasteTips on wine-tasting, including best wineries for aspiring oenophilesWalking tours of the region's best-loved townsOutdoor itineraries to fit in active pursuits between wine-tasting, such as exploring the region by bike, in a kayak, and along hiking trailsHundreds of evocative color photosBulleted maps that show you how to go from place to placeHotels, restaurants, & shopping, for all budgetsA tear-resistant foldout map—enclosed in a handy plastic wallet you can also use for tickets and souvenirs",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Essentials of Modern Business Statistics with Microsoft Excel",
        "Authors": "By Anderson, David Ray, Sweeney, Dennis J., and Williams, Thomas A.",
        "Description": "This new edition provides a brief introduction to business statistics that balances a conceptual understanding of statistics with the real-world application of statistical methodology. The latest version of Microsoft Excel is integrated throughout the text, showing step-by-step instructions and screen captures to enhance learning. The authors have been writing market-leading business statistics textbooks for over 20 years. This new edition contains the same learning features that have made ASW products best-sellers for years; features such as the problem-scenario approach, and real-world examples that introduce statistical techniques.",
        "Category": " Business & Economics , Statistics",
        "Publisher": "South-Western College Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Software Architecture in Practice",
        "Authors": "By Bass, Len, Clements, Paul, and Kazman, Rick",
        "Description": "This award-winning book, substantially updated to reflect the latest developments in the field, introduces the concepts and best practices of software architecture--how a software system is structured and how that system's elements are meant to interact. Distinct from the details of implementation, algorithm, and data representation, an architecture holds the key to achieving system quality, is a reusable asset that can be applied to subsequent systems, and is crucial to a software organization's business strategy.  Drawing on their own extensive experience, the authors cover the essential technical topics for designing, specifying, and validating a system. They also emphasize the importance of the business context in which large systems are designed. Their aim is to present software architecture in a real-world setting, reflecting both the opportunities and constraints that companies encounter. To that end, case studies that describe successful architectures illustrate key points of both technical and organizational discussions.  Topics new to this edition include:    Architecture design and analysis, including the Architecture Tradeoff Analysis Method (ATAM)  Capturing quality requirements and achieving them through quality scenarios and tactics  Using architecture reconstruction to recover undocumented architectures  Documenting architectures using the Unified Modeling Language (UML) New case studies, including Web-based examples and a wireless Enterprise JavaBeans&#153 (EJB) system designed to support wearable computers The financial aspects of architectures, including use of the Cost Benefit Analysis Method (CBAM) to make decisions    If you design, develop, or manage the building of large software systems (or plan to do so), or if you are interested in acquiring such systems for your corporation or government agency, use  Software Architecture in Practice, Second Edition,  to get up to speed on the current state of software architecture.",
        "Category": " Computers , Systems Architecture , General",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Games for All Occasions",
        "Authors": "By Anderson, Ken and Carlson, Morry",
        "Description": "Games for All Occasions. Planning a party? Indoors or outdoors? No problem--if you avail yourself of the 297 indoor and outdoor games clearly and simply described in Games for All Occasions by Ken Anderson and Morry Carlson. There are icebreakers. . .quiz games. . .written games. . .picnic games. . .musical games. . .waterfront games. . .games for lawn parties. . .the latest games. . .action games. . .stunts. . .thought games. . .for children--adults--group leaders--party hosts--teachers--parents--the young in heart--for all who want to entertain or be entertained. No matter what the occasion, there is bound to be an appropriate game in this handy, indexed collection assembled for you fun and recreation!",
        "Category": " Religion , Christian Education , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Guilt by Association (A Rachel Knight Novel, 1)",
        "Authors": "By Clark, Marcia",
        "Description": "Los Angeles D.A. Rachel Knight is a tenacious, wise-cracking, and fiercely intelligent prosecutor in the city's most elite division. When her colleague, Jake, is found dead at a grisly crime scene, Rachel is shaken to the core. She must take over his toughest case: the assault of a young woman from a prominent family.But she can't stop herself from digging deeper into Jake's death, a decision that exposes a world of power and violence and will have her risking her reputation--and her life--to find the truth.With her tremendous expertise in the nuances of L.A. courts and crime, and with a vibrant ensemble cast of characters, Marcia Clark combines intimate detail, riotous humor, and visceral action in a debut thriller that marks the launch of a major new figure on the crime-writing scene.",
        "Category": " Fiction , Legal",
        "Publisher": "Mulholland Books",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Craig Claiborne's The New York Times Food Encyclopedia",
        "Authors": "By Claiborne, Craig and Whitman, Joan",
        "Description": "Brief entries identify and describe the history of foods, beverages, spices, seasonings, and cooking techniques",
        "Category": " Cooking , Reference",
        "Publisher": "Times Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Bare: On Women, Dancing, Sex, and Power",
        "Authors": "By Eaves, Elisabeth",
        "Description": "It began when she was a teenager with an awareness of her body and the reaction other people had to it. It continued with the realization that women's bodies often gave them a strange power over men. As an adult, it became a fascination with professional sex workers, leading to a plunge into their world. And when Elisabeth Eaves left the world of peep shows and private dancers for the more socially acceptable career of international journalism, she found she could not put that fascination behind her. Her experiences had left her with too many questions and too few answers. So she returned to the world she had left behind. Now, in this candid and insightful book, she recounts her firsthand experience of stripping and gives us a new understanding of women's sexuality and contemporary sexual mores.Bare follows the author and her fellow dancers through Seattle strip clubs and bachelor parties, exploring in riveting detail Eaves's own motivations and behavior, as well as those of her coworkers, as they make their way through the sometimes exhilarating, often disturbing world of stripping. Grounded in an understanding of the intricate dynamics of exchanging sexual services for money, Eaves's narrative examines the ways in which the work affects the women; how they negotiate the slippery boundaries between their jobs and their \"real\" lives; how their personal relationships are altered; how they reconcile themselves - or don't - to the stereotypes that surround their profession; whether the work is exploitative or empowering or both.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Pooh Gets a Checkup (Pictureback)",
        "Authors": "By Cuddy, Robbin (ILT) and Zoehfeld, Kathleen Weidner",
        "Description": "Pooh learns that getting a checkup isn’t scary at all, especially when Owl’s the doctor and Christopher Robin is right there to hold his paw.",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Millennium Bug Debugged",
        "Authors": "By Hanegraaff, Hank",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Last Night in Twisted River",
        "Authors": "By Irving, John",
        "Description": "From the author of A Widow for One Year, A Prayer for Owen Meany and other acclaimed novels, comes a story of a father and a son - fugitives in 20th-century North America.In 1954, in the cookhouse of a logging and sawmill settlement in northern New Hampshire, a twelve-year-old boy mistakes the local constable's girlfriend for a bear. Both the twelve-year-old and his father become fugitives, pursued by the constable. Their lone protector is a fiercely libertarian logger, once a river driver, who befriends them. In a story spanning five decades, Last Night in Twisted River - John Irving's twelfth novel - depicts the recent half-century in the United States as a world \"where lethal hatreds were generally permitted to run their course.\" From the novel's taut opening sentence - \"The young Canadian, who could not have been more than fifteen, had hesitated too long.\" - to its elegiac final chapter, what distinguishes Last Night in Twisted River is the author's unmistakable voice, the inimitable voice of an accomplished storyteller.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf Canada",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Vegetarian Pasta: An Earthly Delight Cookbook (Earthly Delight Cookbook Series)",
        "Authors": "By Spieler, Marlene",
        "Description": "Vegetarian Pasta is an enthusiastic celebration of pasta's wonderful versatility. Including more than 200 recipes and 88 stunning, full-color photographs, this book offers both traditional and modern pasta recipes which are healthy, simple to prepare and, above all, delicious.There are recipes for everything from light snacks to hearty meals, including soups and stews, cold and hot dishes, quick pasta, sauces and toppings, baked pasta, stuffed pasta and dumplings, and tantalizing dishes from the Far East. Vegetarians will find meatless meals that are both nutritious and exciting. Familiar flavors abound - garlic, tomatoes, olives, and basil - as well as more exotic ingredients such as mascarpone, shiitake mushrooms and hazelnut pesto, to delight you with unexpected combinations of tastes and textures.This book also includes a world guide to pasta, a section on basic recipes to make with cooked or leftover pasta, and a visual guide to over 30 different types of pasta.Everyone loves pasta and whether you are a vegetarian or not, you will discover plenty to enjoy in this sumptuous collection.",
        "Category": " Cooking , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Taming the Family Zoo: Maximizing Harmony and Minimizing Family Stress",
        "Authors": "By Brawner, Jim and Brawner, Suzette",
        "Description": "",
        "Category": " Family & Relationships , General",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "A Heartbeat Away",
        "Authors": "By Palmer, Michael",
        "Description": "The New York Times bestselling author and master of suspense delivers another novel at the crossroads of politics and medicine in this shocker of a thriller On the night of the State of the Union address, President James Allaire expects to give the speech of his career. But no one anticipates the terrifying turn of events that forces him to quarantine everyone in the Capitol building. A terrorist group calling itself “Genesis” has unleashed WRX3883, a deadly, highly contagious virus, into the building. No one fully knows the deadly effect of the germ except for the team responsible for its development—a team headed by Allaire, himself. The only one who might be able to help is virologist Griffin Rhodes, currently in solitary confinement in a maximum security federal prison for alleged terrorist acts, including the attempted theft of WRX3883 from the lab where he worked. Rhodes has no idea why he has been arrested, but when Allaire offers to free him in exchange for his help combating the virus, he reluctantly agrees to do what he can to support the government that has imprisoned him without apparent cause. Meanwhile, every single person in line for presidential succession is trapped inside the Capitol—every person except one: the Director of Homeland Security, who is safely at home in Minnesota, having been selected as the “Designated Survivor” for this event. With enemies both named and unnamed closing in, and the security of the nation at stake, Griff must unravel the mysteries of WRX3883 without violating his pledge as a scientist to use no animal testing in his experiments…and time is running out. Tense, thrilling, and entirely plausible, A Heartbeat Away will make you reflect, wonder, and be truly afraid.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Gideon's Sword (Gideon Crew Series)",
        "Authors": "By Child, Lincoln and Preston, Douglas",
        "Description": "Introducing Gideon Crew: trickster, prodigy, master thiefGIDEON'S SWORDAt twelve, Gideon Crew witnessed his father, a world-class mathematician, accused of treason and gunned down.At twenty-four, summoned to his dying mother's bedside, Gideon learned the truth: His father was framed and deliberately slaughtered. With her last breath, she begged her son to avenge him.Now, with a new purpose in his life, Gideon crafts a one-time mission of vengeance, aimed at the perpetrator of his father's destruction. His plan is meticulous, spectacular, and successful.But from the shadows, someone is watching. A very powerful someone, who is impressed by Gideon's special skills. Someone who has need of just such a renegade.For Gideon, this operation may be only the beginning . . .",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Cold Vengeance (Special Agent Pendergast)",
        "Authors": "By Child, Lincoln and Preston, Douglas",
        "Description": "Devastated by the discovery that his wife, Helen, was murdered, Special Agent Pendergast must have retribution. But revenge is not simple. As he stalks his wife's betrayers--a chase that takes him from the wild moors of Scotland to the bustling streets of New York City and the darkest bayous of Louisiana--he is also forced to dig further into Helen's past. And he is stunned to learn that Helen may have been a collaborator in her own murder.Peeling back the layers of deception, Pendergast realizes that the conspiracy is deeper, goes back generations, and is more monstrous than he could have ever imagined--and everything he's believed, everything he's trusted, everything he's understood . . . may be a horrific lie.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "Great Book Of Trains",
        "Authors": "By Hollingsworth, J B",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "7.23",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Complete Book Of Collectible Cars 1940-1980",
        "Authors": "By Richard M. Langworth, Graham Robson",
        "Description": "",
        "Category": "",
        "Publisher": "Beekman House",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Dino Parade",
        "Authors": "By Davies, Benji (ILT) and Wiley, Thom",
        "Description": "A die-cut dinosaur-filled book that actually stretches all the way across the floor as you read!The dinosaurs are having a parade and everyone is invited.  This colorful, pull-out book unfolds to reveal a bustling four-foot-long parade of prehistoric favorites on die-cut pages!  With simple text that introduces dinosaur names and oversized art, young readers will love to read and march along with the Dino Parade!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Other, Non-Religious",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Log Cabin: The Classic American Quilt Collection",
        "Authors": "By Green, Mary V.",
        "Description": "",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Life of Mahatma Gandhi (Harper colophon books)",
        "Authors": "By Fischer, Louis",
        "Description": "Attempts to clarify for the western reader the complex personality of India's great political and spiritual leader",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The Inclusion Paradox: The Obama Era and the Transformation of Global Diversity",
        "Authors": "By Tapia, Andres T.",
        "Description": "It turns out that the warm, let's-all-get-along connotations of inclusion are misleading. Achieving true inclusion is hard. Very hard. Harder than achieving awareness. Harder than achieving tolerance and sensitivity. Harder than diversity itself. In The Inclusion Paradox: The Obama Era and the Transformation of Global Diversity Andrés Tapia, Hewitt Associates' Chief Diversity Officer, reveals how in these times of unprecedented peril and opportunity, diversity's demographic tsunami is accelerating today's social, economic, and political tectonic shifts. In the book, he explores what is required to move into the next generation of diversity work in ways that get past the tired and clichéd approaches. He makes the case for making inclusion relevant for all, including the white male, and breaks ground by challenging the notion that the melting pot leads to inclusion. On the contrary, Tapia makes the case that \"equality\" often does not equal \"same.\" The Inclusion Paradox also focuses on the cultural implications of the Obama Era in the United States and around the world. More than a political point in time, the Obama Era is a cultural marker that succinctly captures the various global trends converging at this time in history. The Inclusion Paradox will enable readers to contribute strategically and practically to the urgent work of making diversity and inclusion relevant to business and organizational success around the world.",
        "Category": " Business & Economics , Consulting",
        "Publisher": "Hewitt Associates",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Le Cordon Bleu Wine Essentials: Professional Secrets to Buying, Storing, Serving, and Drinking Wine",
        "Authors": "By Le Cordon Bleu Chefs",
        "Description": "From one of the world&#146;s leading cooking schools, expert advice on buying, storing, serving, and selling wine for the everyday wine lover  Le Cordon Bleu Wine Essentials lets the everyday wine lover become a true wine connoisseur. Shedding light on a world as fascinating for its science and history as it is for its intricate etiquette, this guide unfolds the entire art and craft of wine in a beautifully designed and illustrated volume. With contributions from the world&#146;s leading wine makers, sommeliers, and wine professionals, Le Cordon Bleu Wine Essentials provides commonsense advice on the everyday world of wine&#150;from selecting, buying, and storing wine, to guidelines for tasting, appraising, ordering, and serving all varieties. The book also includes a behind-the-scenes look at winemaking, building a well-balanced wine collection, and practical advice on investing in wine.",
        "Category": " Cooking , Beverages , Non-Alcoholic",
        "Publisher": "Wiley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Living Planet: Preserving Edens of the Earth",
        "Authors": "By Rowell, Galen, Cronkite, Walter (FRW), Lanting, Frans, Doubilet, David, and World Wildlife Fund (EDT)",
        "Description": "A companion volume to the World Wildlife Fund's Living Planet campaign describes in text and glorious full-color photographs the group's efforts to preserve 232 rich and imperiled ecoregions that are essential to preserving the health of the planet. 35,000 first printing.",
        "Category": " Nature , Wildlife",
        "Publisher": "Crown",
        "Price Starting With ($)": "7.37",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Land O'Lakes - Homestyle Cooking for Today",
        "Authors": "By O'Lakes, Land",
        "Description": "",
        "Category": "",
        "Publisher": "Land O'Lakes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Joslin Diabetes Great Chefs Cook Healthy Cookbook",
        "Authors": "By Giedt, Frances Towner, Polin, Bonnie S., and Joslin Diabetes Center (COR)",
        "Description": "Living with diabetes doesn't mean you can't enjoy five-star food. With The Joslin Diabetes Great Chefs Cook Healthy Cookbook, you can savor sophisticated, restaurant-quality cuisine at home while maintaining your blood glucose levels and healthy lifestyle. Award-winning authors Frances Towner Giedt and Bonnie Sanders Polin, Ph.D., and superstar chefs from all over the world, in conjunction with the world-famous Joslin Diabetes Center, have come together to produce a cookbook of extraordinary food for special occasions, specifically for people with diabetes. Here are more than 135 delicious recipes from acclaimed restaurants, each with a nutritional analysis that includes a list of carbohydrates, calories, and Joslin Choices provided by Joslin's nutrition staff. With sumptuous recipes like Spicy Lobster Gazpacho with Avocado Creme Fraiche, Honeyed Alaskan Black Cod over Portobello Mushrooms and Sautéed Spinach, and Chocolate Grand Marnier Soufflé with Raspberry Coulis, this book will help you plan for an elegant dinner party or an intimate dinner for two. You'll find menus for a Birthday Party, a Dinner on the Patio, Sunday Dinner with the Family, and even one for a Picnic Before the Concert, and each is accompanied by its Joslin Choices.  The Joslin Diabetes Great Chefs Cook Healthy Cookbook also offers sidebars on ingredients and mail-order sources for hard-to-find items. Eight pages of gorgeous color photographs will inspire you to head for the kitchen and start cooking. Whether you're living with diabetes or just love fine restaurant food, The Joslin Diabetes Great Chefs Cook Healthy Cookbook will become a favorite source for delicious meals.",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Dinosaur Search & Find Book",
        "Authors": "By Tony & Tony Tallarico",
        "Description": "",
        "Category": "",
        "Publisher": "Kids Books, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Impressionists",
        "Authors": "By Adams, Steven",
        "Description": "Examines the styles, techniques, and subjects of impressionists such as Monet, Renoir, and Degas, and explains the connections between impressionist art and politics, music, architecture, literature, the cabarets, and the opera",
        "Category": " Art , History , General",
        "Publisher": "Running Pr Book Pub",
        "Price Starting With ($)": "7.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Public Relations Kit For Dummies",
        "Authors": "By Bly, Robert W. and Yaverbaum, Eric",
        "Description": "When it comes to marketing, nothing beats good word of mouth. But how do you get your customers talking? This friendly guide shows you step-by-step how to create and implement an effective public relations strategy for pennies on the dollar compared to the cost of advertising. Public Relations Kit For Dummies gives you all the tools you need to spread the word about your product or service, without a PR agency. All it takes is effort and the straightforward guidelines you’ll find in this helpful guide.If you’re a small business owner or manager or an entrepreneur, good PR will give you an advantage over your competition. If you’re a corporate manager or executive, you need an effective public relations program to communicate with your target market without increasing ad spending. In Public Relations Kit For Dummies, you’ll discover how to:Map a winning PR strategyGrab attention with press releases, interviews, and eventsCultivate good media relationsGet print, TV, radio, and Internet coverageManage crisesThis book is packed with successful ideas, techniques, and campaigns that really worked – and you can customize them to fit your clientele, product, or service. This friendly guide shows you how PR works, how to brainstorm for creative ideas, how to deliver your message to the media, and how to create buzz. And there’s more:Developing and stick to a budgetBuilding an in-house PR departmentSpecific PR tactics like contests, surveys, and tie-insCompany newslettersWriting query letters and pitch lettersHandling yourself in interviewsTurning bad press into good publicityDeveloping a contact listSpecific strategies for radio, TV, newspapers, and new mediaHandling crisesMeasuring PR resultsThe book also includes a CD-ROM full of helpful PR forms, checklists, and templates; lists of resources like PR firms and media outlets; and software programs that makes PR simple. If you want people to notice your product or service, Public Relations Kit For Dummies is the only resource you need.",
        "Category": " Business & Economics , Public Relations",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Weird But True! 2: 300 Outrageous Facts (Weird But True, 4)",
        "Authors": "By National Geographic Society (U. S.) (COR)",
        "Description": "Did you know that a great white shark can weigh as much as 15 gorillas? That meteorites the size of basketballs land on Earth about once a month? Kids will devour more than 300 wacky facts in Weird but True! 2—the second installment in a lively new spin-off series from the award-winning National Geographic Kids magazine.National Geographic Kids is the nation’s largest magazine for children, with more than 1.3 million subscribers and 5 million readers. The brand is rapidly gaining traction in the book market, with the huge success of National Geographic Readers and the National Geographic Kids Almanac. Straight from the pages of the magazine’s top-scoring feature, this little book is chock-full of tremendous fun. It’s packed with even more of the wild-n-wacky facts, whimsical designs, and all-out reading fun that made the first Weird but True volume an early success.This book’s compact size makes it easy to handle and fun to browse. Eye-popping photos and bold, colorful graphics nab kids’ attention and entice them to read. Brain-bending facts cover a broad range of topics, from science to foods to pop culture and just about everything else under the sun. Kids will have so much fun that they won’t even realize they’re learning.",
        "Category": " Juvenile Nonfiction , Curiosities & Wonders",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Firm Abs Flat Stomach: In Only 30 Days",
        "Authors": "By Millard, Anne-Marie",
        "Description": "Get the body you’ve always wanted in just 30 days! With this fully illustrated day-by-day program, you can get a flat stomach, lose inches, and feel great. Designed for people of all levels of fitness, this fast and effective method consists of routines that will fit into even the busiest lifestyle. Begin by assessing your shape and goals, and calculate your personal daily caloric intake. Guidelines for healthy eating help you adjust your diet to the program and for life. Burn calories and tone muscles with progressively more challenging workouts that alternate between aerobic and resistance exercises. A maintenance program enables you to keep your fabulous new shape, and pre- and post-natal plans help you regain your figure after pregnancy.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Hamlyn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Wind is Mine and Other Poems",
        "Authors": "By Bosley Wilder",
        "Description": "",
        "Category": "",
        "Publisher": "Academic Books",
        "Price Starting With ($)": "5.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Star Trek: The Worlds of the Federation",
        "Authors": "By Johnson, Shane",
        "Description": "Outlines a negotiating strategy in which neither side emerges a loser, detailing how to use this in all areas of business and personal relationships",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Think Dog: An Owner's Guide to Canine Psychology",
        "Authors": "By FISHER, John",
        "Description": "",
        "Category": " Pets , Dogs , General",
        "Publisher": "Trafalgar Square Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    }
]