[
    {
        "Title": "Why the Rest Hates the West: Understanding the Roots of Global Rage",
        "Authors": "By Pearse, Meic",
        "Description": "\"Why do they hate us so much?\"Many in the U.S. are baffled at the hatred and anti-Western sentiment they see on the international news. Why are people around the world so resentful of Western cultural values and ideals? Historian Meic Pearse unpacks the deep divides between the West and the rest of the world. He shows how many of the underlying assumptions of Western civilization directly oppose and contradict the cultural and religious values of significant people groups. Those in the Third World, Pearse says, \"have the sensation that everything they hold dear and sacred is being rolled over by an economic and cultural juggernaut that doesn?t even know it?s doing it . . . and wouldn?t understand why what it?s destroying is important or of value.\"Pearse's keen analysis offers insight into perspectives not often understood in the West, and provides a starting point for intercultural dialogue and rapprochement.",
        "Category": " Religion , Christian Theology , Anthropology",
        "Publisher": "IVP",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Wolfsbane: A Novel",
        "Authors": "By Thomas, Craig",
        "Description": "",
        "Category": "",
        "Publisher": "HOLT, RINEHART AND WINSTON",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Weatherman: A Novel",
        "Authors": "By Thayer, Steve",
        "Description": "A serial killer is on the loose in Minnesota, snapping young women's necks with each change of the seasons. Within twenty four hours of the first murder, TV weatherman Dixon Bell, a hulking eccentric, warns his viewers that a tornado is about to strike. The National Weather Service hasn't called it, but Dixon Bell does because he sees it coming in his mind. Among all the complex and original characters in this astonishing novel, the shifting weather and landscape of Minnesota stand out - demonic, majestic, bizarre, magical.Dixon Bell is not the only eccentric on Channel 7's Sky High News. His alter ego is an investigative news producer named Rick Beanblossom, a Vietnam vet and Pulitzer Prize winner, who hides his napalmed face, and his feelings, behind a mask. Guided along the way by an unnamed police source. Rick is on the track of the serial killer. Then he is assigned an unlikely partner, Andrea Labore, a lovely and ambitious ex-cop turned TV reporter. The newsman and the weatherman start out as bitter rivals for this gifted woman. But an ambivalent friendship grows between them when Dixon Bell becomes a suspect in the weather-related killings and Rick Beanblossom sets out to prove him innocent.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Bethlehem Road: A Charlotte and Thomas Pitt Novel",
        "Authors": "By Perry, Anne",
        "Description": "He might be elegant, but there's no mistaking it--the gentleman tied to the lamppost on Westminster Bridge is definitely dead. Before Inspector Thomas Pitt can even speculate on why anyone should want to kill the eminent M.P., Sir Lockwood, a colleague of his, meets the same fate at the same spot. The public is outraged, and clever Charlotte Pitt, Thomas's well-born wife, helps her hard-pressed husband by scouting society's drawing rooms for clues to these appalling crimes. Meanwhile, another victim is being stalked....\"Mrs. Perry once again demonstrates her true and lively passion....Her finely drawn characters couldn't be more comfortable within the customs and sensibility of their historical period.\"THE NEW YORK TIMES BOOK REVIEW",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Farriers' Lane",
        "Authors": "By Perry, Anne",
        "Description": "\"Gripping and intense...Her characters are authentically and appealingly drawn, and her plot is sinister.\"BOOKLISTWhen a distinguished judge dies of opium poisoning, the crucifixion five years before of Kingsley Blaine is brought back into the public eye, and it is screaming for revenge. The police had arrested a Jewish actor, who was soon condemend to hang. Police Inspector Thomas Pitt, investigating the judge's death, is drawn into the sensational murder, because it appears the judge was about to reopen the earlier case. He receives curiously little help from his colleagues on the force, but his wife, Charlotte, gleans from her social engagements startling insights into the women in both cases. And slowly both Thomas and Charlotte begin to reach the same sinister and deeply dangerous truth....SELECTED BY THE BOOK-OF-THE-MONTH CLUB",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Rogue's march: A novel",
        "Authors": "By Tyler, W. T.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Face of a Stranger",
        "Authors": "By Perry, Anne",
        "Description": "\"Richly textured with the sights and sounds of London and its countryside...Solidly absorbing and Perry's best to date.\"THE KIRKUS REVIEWSHis name, they tell him, is William Monk, and he is a London police detecive. But the accident that felled him has left him with only half a life; his memory and his entire past have vanished. As he tries to hide the truth, Monk returns to work and is assigned to investigate the brutal murder of a Crimean War hero and man about town. Which makes Monk's efforts doubly difficult, since he's forgotten his professional skills along with everything else....A Dual Main Selection of the Mystery Guild",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Cleaning Closets-A Mother's Story",
        "Authors": "By Cole, Beverly",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Kimimi Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "50 Easy Party Cakes",
        "Authors": "By Brown, Debbie",
        "Description": "Crammed with ideas for creative cakes, 50 Easy Party Cakes features a stunning range of colorful designs from best selling cake decorating and sugarcraft author Debbie Brown.If you are planning a party, and are pushed for time, then look no further! This collection of striking yet simple cake designs is guaranteed to provide an easy solution to the problem of creating the perfect cake for any birthday party or celebration. Debbie Brown combines her exceptional flair for color and design with her unique fondant modeling skills to simplify her eye-catching cake designs, some of which you may have never dreamed you could achieve.This cake cookbook is filled with cakes which will appeal to children of all ages. Instantly lovable animal cakes include a Friendly Frog, Sporty Spider and Noah's Ark, while the Fairy Toadstool, Dotty Dragon and Alien Spaceship are among a number of fantasy ideas. Sports fans will enjoy the Soccer Player and Formula 1 Car. Keep older children entertained with the Glitter Bag and Make-up, meanwhile younger children will adore the Playful Kitten on a Ball of Wool and the Cute Yellow Chick.Ideal for beginners and experienced cake makers alike, each easy-to-follow cake recipe is clearly illustrated with step-by-step photographs and a full-page color picture to guarantee success every time.Cake recipes include:Formula 1 CarPlayful KittenFarm TractorLittle Bo PeepSkull & CrossbonesDream CastleAlien SpaceshipCute Chick",
        "Category": " Cooking , Courses & Dishes , Cakes",
        "Publisher": "Merehurst Limited",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Contracting for Public Services: Output-based Aid and Its Applications",
        "Authors": "By World Bank (COR), Brook, Penelope J. (EDT), Smith, Suzanne M. (EDT), and International Finance Corporation (COR)",
        "Description": "'Contracting for Public Services', by the World Bank's Private Sector Advisory Services, outlines an innovative approach to delivering development assistance for public basic services such as potable water, safe sanitation, modern energy, and primary education and healthcare. Called output-based aid, the approach delegates service delivery to the non-profit or for profit private sector under contracts that tie payments to the outputs or results actually delivered to target beneficiaries. The book gathers cases of innovative, output-based approaches from across the infrastructure and social sectors, and also provides a checklist for designing and implementing output-based schemes.",
        "Category": " Business & Economics , Public Relations",
        "Publisher": "World Bank Publications",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Bedford Handbook for Writers",
        "Authors": "By Hacker, Diana",
        "Description": "",
        "Category": "",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Don't Know Much About Anything: Everything You Need to Know but Never Learned About People, Places, Events, and More! (Don't Know Much About Series)",
        "Authors": "By Davis, Kenneth C.",
        "Description": "In his wildly entertaining, winningly irreverent, New York Times bestselling Don't Know Much About® series, author Kenneth C. Davis has amused and edified us with fascinating facts about history, mythology, the Bible, the universe, geography, and the Civil War.Now, the sky's the limit in his latest irresistible installment—a grand tour of knowledge that carries us from the Great Smoky Mountains to the Berlin Wall, from the Salem Witch Trials to Watergate, from Michelangelo to Houdini. Brimming with busted myths, gripping true stories, and peculiar particulars about a plethora of people, places, and events, this captivating compendium is guaranteed to delight information lovers everywhere as it feeds our insatiable appetite to know everything!",
        "Category": " Reference , Questions & Answers",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Insight Guide Chile",
        "Authors": "By Mackenzie, Kerry",
        "Description": "A colorful, detailed guide to travel in Chile, offering historical background and information on the country's culture, arts, politics, and people, as well as things to see and places to stay. Chief places of interest are coordinated by number with specially drawn maps. Descriptions of lodging and places of interest include travel details, addresses, and phone numbers. A section of travel tips offers a convenient point of reference for information on travel, accommodations, restaurants, money, and other practical aspects. Gorgeous color photos of the landscape and people are on every page. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Travel , South America , General",
        "Publisher": "Insight Guides",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "War and Moral Discourse",
        "Authors": "By Potter, Ralph B.",
        "Description": "",
        "Category": "",
        "Publisher": "John Knox Press",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Hunger of the Heart: The Call to Spiritual Growth (The Breath of Life Series)",
        "Authors": "By Delbene, Ron, Montgomery, Mary, and Montgomery, Herb",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Small Town",
        "Authors": "By Hearon, Shelby",
        "Description": "A family feud has split the family of Alma van der Linden so that its members, literally, live at opposite ends of the town",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "The Comfort of Strangers",
        "Authors": "By McEwan, Ian",
        "Description": "A vacationing English couple find more than they bargained for, in this unsettling novel from the Booker Prize-winning author of Atonement. Visiting an unnamed city, Mary and Colin attract the interest of Robert, a charismatic older man with a story to tell. But the more they get to know Robert—and his disabled wife, Caroline—the more apparent it becomes that there’s something not quite right about their new friends. A shocking work of violence and obsession, The Comfort of Strangers is Ian McEwan at his very best.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Not My Own: Abortion and the Marks of the Chruch",
        "Authors": "By Achtemeier, Elizabeth and Schlossberg, Terry",
        "Description": "",
        "Category": " Religion , Christian Theology , Ethics",
        "Publisher": "Wm. B. Eerdmans-Lightning Source",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Prodigal People: Coming Home to Right Relationships",
        "Authors": "By Hawkins, Don and Kroll, Woodrow Michael",
        "Description": "An encouraging road map back to right relationships with God and others.",
        "Category": " Religion , Biblical Studies , New Testament",
        "Publisher": "Kregel Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Your Body, Yourself: A Guide to Your Changing Body (Your Body, Your Self Book)",
        "Authors": "By Virtue, Doreen, Bell, Alison, and Rooney, Lisa",
        "Description": "Discusses the various physical changes that come with adolescence in girls",
        "Category": " Young Adult Nonfiction , Health & Daily Living , Beauty & Grooming",
        "Publisher": "Lowell House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Postcard Books: Angels",
        "Authors": "By Pavilion Books",
        "Description": "As the symbolic evocation of religion and spiritual life, angels have played a significant part in our understanding of a mystical world we cannot fully comprehend. As rendered by some of the world's most gifted artists, here are thirty stunning, full-color reproductions of beautiful paintings of angels in postcard form that you can keep or send. All at once, these paintings evoke feelings of joy and hope in a way nothing else can. This unique collection represents the work of Cipriani, Rembrandt, Martini, Procaccini, Reynolds, and more.",
        "Category": " Art , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Every Marriage Is a Fixer-Upper: A Do-It-Yourselfer's Guide to Bringing Out the Best in Your Relationship",
        "Authors": "By Farrel, Pam and Farrel, Bill",
        "Description": "",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Teenagers: Preparing for the Real World",
        "Authors": "By Foster, Chad",
        "Description": "Provides advice on making contacts, choosing a career, making moral choices, and achieving personal success, lists volunteer opportunities, and describes aptitude tests",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "RISING BOOKS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "It's Not Luck",
        "Authors": "By Goldratt, Eliyahu M.",
        "Description": "Alex Rogo, the new executive vice president of UniCo, must turn around three newly acquired companies, knowing that if he succeeds, they will be sold off and the new owners will replace him, and if he fails, the companies will be closed--in either case, he will likely be fired.",
        "Category": " Fiction , General",
        "Publisher": "North River Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Robert E. Lee: Brave Leader",
        "Authors": "By Bains, Rae",
        "Description": "Traces the life of the highly respected Confederate general, with an emphasis on his difficult boyhood in Virginia",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The High cost of indifference: Can Christians afford not to act?",
        "Authors": "By Cizik, Richard (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "1-2-3 Magic: Effective Discipline for Children 2-12",
        "Authors": "By Phelan, Thomas W.",
        "Description": "\"Addressing the task of disciplining children ages 2 through 12 without arguing, yelling, or spanking, this program offers easy-to-follow steps to immediately manage troublesome behavior with reason, patience, and compassion. Parents and teachers learn how to encourage and respect children’s growing independence with 10 strategies for building self-esteem. Also discussed are the three most important qualities for parents or teachers to exhibit in order to foster competence in kids. Tips are included on how to prevent homework arguments, make mealtimes more enjoyable, conduct effective family meetings, and encourage children to start doing their household chores. This award-winning program discusses the importance of establishing and maintaining a home or classroom with fair and consistent discipline. This revised edition includes suggestions on how to avoid over-parenting, build children’s social skills, and apply the program within mental health agencies and classrooms. \"",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Parentmagic, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Lands of Charm and Cruelty: Travels in Southeast Asia, 1st Vintage Departures",
        "Authors": "By Sesser, Stan",
        "Description": "Southeast Asia - an infinitely fascinating part of the world, whose people are beautiful and welcoming, whose ancient cultural traditions still thrive today, whose great religious relics and works of art dazzle the traveler.",
        "Category": " Political Science , World , Asian",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Best Food Writing 2000",
        "Authors": "By Hughes, Holly (EDT)",
        "Description": "A major new annual publication is born. It's a Zagat world, where everyone who isn't trying their hand as a food critic is at least talking about food writing: William Grimes' reviews and R.W. Apple's special reports in the New York Times, Jeffrey Steingarten's monthly Vogue missives, Jim Harrison in Esquire, and Ruth Reichl's revitalized Gourmet. Now is the perfect time to bring together essays, reviews, articles, and other miscellaneous pieces from a wide range of sources: food, travel, and general interest magazines, national and local newspapers, foodie newsletters and even Web sites. Because writing about food turns up in so many disparate places, food lovers will now have the opportunity to enjoy these stellar pieces, all in one place. Selections from writers including R.W. Apple, Alan Davidson, Fran Gage, William Grimes, Jim Harrison, Madhur Jaffrey, Lynne Rossetto Kasper, Nigella Lawson, Paul Levy, Eileen Yin-Fei Lo, Cheryl Mendelson, Catherine Reynolds, Michael Ruhlman, John Thorne, Calvin Trillin, and many others, are included.",
        "Category": " Cooking , Essays & Narratives",
        "Publisher": "Marlowe & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Southern Living Annual Recipes Cookbook 20th Anniversary Edition",
        "Authors": "By Southern Living",
        "Description": "It's time to pull out all the stops - time to celebrate 20 years of this classic cookbook series. What better way to mark the occasion than with this special anniversary edition that showcases over 1500 highest-rated recipes from Southern Living Annual Recipes?This extraordinary anniversary edition includes an unprecedented number of our very best recipes organized by traditional food chapters; recipes that are tried-and-true kitchen tested; simple step-by-step directions in each recipe to guide you from start to finish with ease; helpful notes about recipe methods and ingredients, handy substitutions, creative variations, and make-ahead tips; quick or easy recipes; light recipes with nutrient analyses and healthy ingredient substitutions; over 70 full-color, full-page photographs; and a handy cross-referenced index.",
        "Category": " Cooking , Regional & Ethnic , American , Southwestern States",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Ha! Ha! Giraffe",
        "Authors": "By Repchuk, Caroline and Holmes, Stephen (ILT)",
        "Description": "Crocodile has terrible toothache. His friend, Giraffe, thinks it's the funniest thing he's ever seen, but he'd better be careful or he won't get the last laugh after all. Find out what happens as you meet Giraffe and all his animal friends in the jungle. The floor puzzle is of Giraffe himself.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Red Kite Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Microeconomics: Study Guide",
        "Authors": "By Parkin, Michael",
        "Description": "",
        "Category": " Business & Economics , Economics , Microeconomics",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Simply Alice (14)",
        "Authors": "By Naylor, Phyllis Reynolds",
        "Description": "When they first broke up, Alice couldn't imagine life without Patrick in it. But once she joins the school play and becomes more involved in the news-paper, she's busier than she's ever been before -- too busy to pine for Patrick and too busy, or so Pamela and Eliza-beth think, for them. As Alice spends more time with activities that don't include Pamela and Elizabeth, they grow increasingly resentful. And Alice grows increasingly confused by their behavior.  But they aren't the only people confusing Alice. Her new friend, Faith, is seemingly incapable of ending a relationship with her abusive boyfriend. And Alice has been receiving oh-so-intriguing E-mails from an admirer...who won't sign his name. As she tries to decide whether or not to meet her mystery fan, she also watches nervously as her brother Lester's crush on his graduate school professor begins to border on obsession.  As Alice completes her first year of high school, she learns that there IS life after Patrick, and that obsessions and jealousy can affect anyone. Phyllis Reynolds Naylor has done it again with this fourteenth book in the beloved Alice series.",
        "Category": " Young Adult Fiction , Social Themes , New Experience",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Princess Present: A Princess Diaries Book (Princess Diaries, Vol. 6 1/2)",
        "Authors": "By Cabot, Meg",
        "Description": "Mia would give all the jewels in Genovia for the perfect presentEvery year, Princess Mia spends the holidays in Genovia with Grandmère. This year, she's looking forward to the most perfect Christmas ever: her boyfriend, Michael, and her best friend, Lilly, are coming to Genovia, too.But even a princess's plans can go awry. Lilly has a lot to learn about palace protocol, and with all the state holiday functions Mia must attend, there's no time to linger under the mistletoe with Michael. Worst of all, Mia hasn't been able to find him the perfect gift.Can Mia stop her (bah-hum)bugging long enough to see that the perfect present has nothing to do with international express courier -- and everything to do with real love? (Though some shiny silver ribbon never hurts ...)",
        "Category": " Young Adult Fiction , Royalty",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "It's Just a Thought ..but It Could Change Your Life: Life's Little Lessons on Leadership",
        "Authors": "By Maxwell, John C.",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Horse Breeds of North America: The Pocket Guide to 96 Essential Breeds",
        "Authors": "By Langrish, Bob (PHT) and Dutson, Judith",
        "Description": "An amazing variety of horse breeds roam North America’s vast and geographically diverse landscape. This detailed portable handbook celebrates the unique qualities of 96 regional breeds, from the sleek muscles of racing thoroughbreds and the stoic power of draft horses to the easy gait of pleasure horses at your local farm. Fascinating facts about each horse breed’s size, talents, and suitability for various types of work are accompanied by full-color photographs in this fun and informative reference guide.",
        "Category": " Nature , Animals , Horses",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "A Pocketful of Pets: A Book About Finding a Pet (Magic Castle Readers)",
        "Authors": "By Moncure, Jane Belk, Hohag, Linda (ILT), and Jacobson, Lori (ILT)",
        "Description": "Mike enlists the help of a variety of animals to find Mama Kangaroo's baby, but they all get so sleepy they hop in Mama's pouch for a nap.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "The Child's World",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Dinosaur Planet, Level 3 (Lightning Readers)",
        "Authors": "By Orme, David and Fiorin, Fabiano (ILT)",
        "Description": "When a child is learning to read, every word counts!                                  Tom and Kate like to pretend.  They use their imaginations to travel to        new worlds.  When they explore a planet full of dinosaurs, they discover        that pretending can sometimes be surprising!                                  Dinosaur Planet is an innovative Lightning Reader that        features a controlled word count to give readers practice with essential        sight words.  This leveled reader for grade 1-2 features a 150 words or        less and has been professionally leveled by reading experts to ensure        that the language and vocabulary are age-appropriate.  Word lists and        comprehension questions at the back of the book reinforce fundamental        reading concepts used in classrooms nationwide!                                  This title is also available in a Spanish version!                                  Children ages 2 to 8 will love to learn to read with our Lightning        Readers series!  Over 30 titles feature humorous, high-interest        stories in a variety of styles including, fantasy, fable, and rhyme,        which will appeal to both reluctant and enthusiastic readers.         Controlled word counts in this one of a kind series help to build the        word foundation for a lifetime of reading!  Check out our other titles        in this series!                                  Each title is available in an English and Spanish version!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Brighter Child",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "A Manual of Veneering",
        "Authors": "By Villiard, Paul",
        "Description": "This book is a clear, well-written manual on the craft of veneering that shows you how to turn out your own hardwood veneers beautifuly and economically, With a veneer press that you have made yourself, you can produce beautiful veneer panels that will be durable and unique. Apply them to the furniture you want to finish, and you will have veneered furniture that will look better and last longer than furniture made from \"honest lumber.\"When Paul Villiard found a way to make his own veneering equipment he opened up the craft to a wide audience. With this book you can now make your own veneer press and edger at a fraction of the cost of commercial models. Mr. Villiard also shows you all the techniques of veneering: how to match veneers; how to glue, clamp, tape, and edge veneered panels; how to veneer curved panels; and how to inlay, finish, and repair veneers. To anyone who wants to fix up old veneered furniture, the chapter on repairing veneers is itself worth the price of the book; it shows you how to repair chips, blisters, and stains, even replace pieces that have fallen off, with simple tools.The author also covers cores and core stocks, and 136 commonly available veneers in terms of each one's source, color, availability, and price range. Sixty-five photographs and drawings amplify the text, and sixteen different veneered woods are shown in full color on the covers.Veneering is an ancient and honorable craft, and when you select the wood yourself and do your own construction, you can be sure that the veneers you make will retain their beauty for years, even for generations. This excellent, comprehensive book will give you all the expert instruction you need.",
        "Category": " Crafts & Hobbies , Woodwork",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "Lie to Me",
        "Authors": "By Martin, David Lozell",
        "Description": "Mary and Jonathan Gaetan were the essence of elegance. He was a powerful businessman; she was beautiful, sexy, young. Then, in a night of terror, a madman broke into their suburban Washington mansion. When it was over, Jonathan Gaetan lay dead and mutilated in a bathtub of his own blood. Mary told the police nothing about an intruder. Instead, she claimed her husband had killed himself.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Champion in You",
        "Authors": "By Jeralds, Adonis",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Salem Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Necropolis Railway: A Jim Stringer Mystery (Jim Stringer Mysteries)",
        "Authors": "By Martin, Andrew",
        "Description": "Young, ambitious, and a little green, Jim Stringer moves from the country to the garish, seedy, and dangerous side of 1903 London, determined to become a railway man. A chance meeting has gotten him his foot in the door of the South East Railway, run out of Waterloo Station. Jim finds his duties are confined to a mysterious graveyard line, the so-called Necropolis Railway, which takes dead bodies from central London to the gigantic new cemeteries being built--dug--in the city's outskirts. For some reason, the men he works alongside have formed an instant loathing for him. And his predecessor has disappeared under suspicious circumstances. Forced to live by his wits and to arrive at his own deductions, Jim tries to work out what is going on before he too gets a one-way ticket on board the Necropolis Railway. This novel launches a series featuring Jim Stringer, who, with the help of his landlady--soon his wife and easily his match in wit--tackles some of the darker mysteries that have ridden the rails of England in the Edwardian Age, the period of Kipling, Peter Pan, and H.G. Wells. It will be followed by BLACKPOOL FLYER and THE LOST LUGGAGE PORTER.",
        "Category": " Fiction , Mystery & Detective , Traditional British",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Ash & Bone: A Frank Elder Mystery (Frank Elder Mysteries)",
        "Authors": "By Harvey, John",
        "Description": "In the depths of his Cornish hideaway, retired Detective Inspector Frank Elder’s solitary life is disturbed by a call from his ex-wife, telling him his seventeen-year-old daughter, Katherine, is running wild, unbalanced by the abduction and rape he feels he should have prevented. Meanwhile, in the heart of London, the takedown of a violent criminal goes badly, and Detective Sergeant Maddy Birch is uneasy about the reasons why, an uneasiness that is compounded when she starts to believe she is being stalked.  Maddy and Frank had a brief and clumsy encounter years before. In Ash & Bone their lives connect again when a second phone call persuades Elder out of retirement, only to find that a cold case has a devastating present-day impact.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Stories for the Heart: 110 Stories to Encourage Your Soul",
        "Authors": "By Gray, Alice",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Self-Defeating Behaviors: Free Yourself from the Habits, Compulsions, Feelings, and Attitudes That Hold You Back",
        "Authors": "By Cudney, Milton R. and Hardy, Robert E.",
        "Description": "“The most detailed examinations of self-defeating behavior I have ever read…. Very useful.\" — Albert Ellis, PH.D., President, Institute of Rational-emotive therapy, and author of A New Guide to Rational Living \"Some of my patients would not need therapy if they would read this book.\" — Dr. Alan Loy McGinnis, author of The Power of Optimism The groundbreaking theory expounded in Self-Defeating Behaviors asserts that, with each new moment, people have the ability to make a choice for either a self-defeating or self-enhancing behavior; this is the guide to freeing ourselves from the inappropriate and crippling behaviors that sabotage our success.",
        "Category": " Psychology , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Hoodwinked: The Documents That Reveal How Bush Sold Us a War",
        "Authors": "By Prados, John",
        "Description": "In America, the wife of the former ambassador who exposed George Bush’s sixteen-word State of the Union fib about uranium from Niger, is now being harassed by allies of the administration. In Britain, the scientist who blew the whistle on Tony Blair has been driven to suicide.For all of us who, thanks to these whistle-blowers, now realize that we have been hoodwinked and want to understand exactly how, national security analyst John Prados has compiled and annotated the key source documents behind the selling of the Iraq war to the American public. As these CIA reports, Pentagon briefings, and other materials clearly show, Bush and his spokespeople were playing a crude game of three-card monte, claiming Iraqi ties to Al Qaeda, weapons of mass destruction, and imminent threats, which are here exposed as half-truths, exaggerations, and outright fabrications of a warmongering administration.Prados, a noted historian of intelligence and national security, offers readers a firsthand view of incontrovertible evidence that we were had.",
        "Category": " Political Science , General",
        "Publisher": "The New Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Managing Your Moods (Women of Faith Study Guide Series)",
        "Authors": "By Graham, Mary (FRW)",
        "Description": "Filling the needs of today's women, we offer the next 4 titles in the best-selling Women of Faith series.These topical guides deal with issues that women wrestle with today, such as friendship, encouragement, managing moods, finding contentment, and how to live out your faith.Reaching an audience across racial, socio-economic, denominational, and age boundaries, these guides will enhance the lives of women as they empower them in their weekly devotions. The study guides can be used for both individual and group settings.Women are asking good questions about their faith. With our study guides, we want to join them in their quest for knowledge and lead them in finding the answers they are seeking.The Study Guide Series will include the following:#5 Managing Your Moods - Foreword by Marilyn Meberg ISBN: 0-7852-5151-0#6 Cultivating Contentment - Foreword by Luci Swindoll ISBN: 0-7852-5152-9#7 Encouraging One Another - Foreword by Nicole Johnson ISBN: 0-7852-5153-7#8 A Life of Worship - Foreword by Sheila Walsh ISBN: 0-7852-5154-5",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Favorite Recipes of California Winemakers",
        "Authors": "By Hecker, Lee (Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Wine Advisory Board",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Disordered Minds",
        "Authors": "By Minette Walters",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Love on the Dotted Line: A Novel",
        "Authors": "By Talbert, David E.",
        "Description": "The author of the Essence bestselling novel Baggage Claim delivers a provocative and richly entertaining new novel about what happens when love and litigation collide.    Morgan Chase, a thirty-four-year-old contracts lawyer, is pushed to her romantic wit's end when she discovers that her boyfriend of nine months, investment banker Marcus Alexander, has been diversifying his \"portfolio\" with another woman. After a few hours of venting with her girlfriends, and more than a few drinks, Morgan decides that the only way you can guarantee that a man will act right after you've been intimate is if you make him sign a contract before you've been intimate.    That very same night, Morgan heads back to the office to create the first-ever relationship contract -- a legal document full of conditions, consideration, and most important, consequences.    Sparks fly, tempers flare, and emotions hit the fan when the man Morgan finally convinces to sign her contract is caught red-handed with another woman. What follows is an ingeniously plotted and thoroughly entertaining fusion of comedy, romance, and courtroom mayhem.    What happens when love itself is put on trial? One thing's for sure...hell hath no fury like an attorney scorned!",
        "Category": " Fiction , Romance , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Nude in Tub: Stories of Quillifarkeag, Maine",
        "Authors": "By Wuori, G. K.",
        "Description": "Here is G.K. Wuori, out of nowhere and wielding a deadly weapon: his vision of our America...it's the raw. Wuori fiction is something entirely and wildly its own. Like Thomas Pynchon, Robert Coover, Mark Richard, Lewis Nordan, Wuori doesn't care to mollycoddle the reader. He's here, in this daring debut collection, to reflect what's on his mind: America's fascination with violence, with sex, with racism, with joyful immortality. Set in the northernmost corner of Maine, in a town \"usually omitted from cheap maps,\" Nude in Tub is about a young couple who make love on La-Z-Boys in the middle of a highway, about an old woman who finds a pine tree growing from her leg, about newlyweds who paint their whole house black and themselves white, and about several more stripped-down others, including, of course, a nude in tub. Descendants of Sherwood Anderson's Winesburgers, Wuori's Quillifarkeagans are Americans at the millenium, good citizens whose reality has been tweaked, twitted, quirked, smirked and found to be grimly goofy. These people - each of them caught in their own startling moment of nakedness - all live by the same credo: If you're in trouble, we'll help. But we'll still laugh like hell.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "When I Lay My Isaac Down: Unshakable Faith in Unthinkable Circumstances",
        "Authors": "By Kent, Carol",
        "Description": "Carol and Gene Kent's son is in prison. When I Lay My Isaac Down tells their story and shares the transformational power principles they learned about forgiveness and faith.Dealing with her anger, grief, and shame, Carol could have given up. Instead she tells a highly personal, heartbreaking, and uplifting story that will bolster your faith.Includes discussion questions.",
        "Category": " Religion , Inspirational",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Powerful Stuff",
        "Authors": "By Rich Wilkins",
        "Description": "",
        "Category": "",
        "Publisher": "Pos Publications",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Borneo Log: The Struggle for Sarawak's Forests",
        "Authors": "By Bevis, William W.",
        "Description": "After a year as exchange professor at a Tokyo university, William Bevis spent part of the next year traveling in Sarawak, a Malaysian state located on the northern part of the island of Borneo. About the size of New York, it has a population of 1.7 million people living, outside of a few towns, in a world of jungle and brown rivers. There the rainforest is being cut rapidly, local corruption and greed siphon off most of the profit, native rights and land uses are being obliterated, and much of the fine timber is shipped to Japan to become plywood forms for concrete that are thrown away after two uses.This book is a travel narrative and also a serious environmental study of exploitation of third-world resources. During his stay in Sarawak, the author lived with both native activists and timber camp managers, seeking to understand the motives and actions of Japanese companies, Chinese entrepreneurs, and the native population most affected by the timber trade.Interspersed with chapters narrating the author’s journey are chapters dealing with the history, economy, and political life of the region. Fascinating profiles of major figures who have influenced the course of events include James Wong, Minister of Environment for Sarawak and owner of one of the largest timber concessions, and Bruno Manser, a Swiss adventurer who was adopted by the nomadic Penan tribe and hunted by the police for organizing opposition to the timber trade.Borneo Log is not simply a book about environmental politics in a far-away place. The power of the book lies in the author’s extraordinary ability to bring home the related global disasters of the destruction of the world’s rainforests and its indigenous peoples. This is a personal and passionate account of how ordinary men and women are fighting to defend a way of life that is rapidly disappearing along with their country’s resources, and how the problems of their lives echo in our own.",
        "Category": " Nature , Plants , Trees",
        "Publisher": "University of Washington Press",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Luscious Lemon",
        "Authors": "By Swain, Heather",
        "Description": "She's finally seeing the fruits of her labors.  Chef Ellie \"Lemon\" Manelli's hip East Village bistro is suddenly all the rage; Lemon and her staff of wildly talented friends plucked from New York City's finest eateries can barely keep pace. Good thing she has her loyal, doting, bankrolling Georgia peach of a boyfriend, Eddie, to lean on -- not to mention a gaggle of loving relations over the river in Brooklyn. In fact, Lemon's life is turning out exactly as she planned -- except for the fact that she's late. As in late. Nobody said anything about, you know, labor.  Having a baby right now would jeopardize everything Lemon has worked so hard to accomplish, so the pregnancy test results leave her feeling a little sour. Eddie, bless his heart, wants to just go ahead and get married, but Lemon's not sure the timing's right. She's about to learn a lesson or two about love and loss, though. And in the end she'll discover that there's a reason things work out the way they do -- and that when life gives you lemons, you can make lemonade, or lemon tarts, or lemon meringue pie. Or, you can just be a plain ole Lemon, if that's what you were meant to be.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Cowboy Capitalism: European Myths, American Reality",
        "Authors": "By Gersemann, Olaf",
        "Description": "Although American economic growth is better than many European countries, Europeans believe Americans suffer from greater wealth inequality and other social problems because of their style of economy. Not so, argues Gersemann (Washington correspondent for Wirtschaftswoche, a German economic weekly), not only is American growth, employment, and productivity better than the Europeans, but on issues of economic justice and security the United States does not compare unfavorably with Europe. He seeks to debunk European \"prejudices about and stereotypes of the American economy\" and presents statistics to back up his case. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Political Economy",
        "Publisher": "Cato Institute",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Stones of Jerusalem (Zion Legacy)",
        "Authors": "By Thoene, Bodie and Thoene, Brock",
        "Description": "Stones of Jerusalem continues the story of the Zion Legacy Series. Once more we are transported back in time, from the 1948 war in Israel to a stirring drama of the first century A.D. in this sacred city.  Amid the chaos of street battle, Israeli strategist Moshe Sachar has taken refuge in a secret tunnel beneath the Temple Mount. There, in Stones of Jerusalem, he becomes immersed in an ancient scroll and the extraordinary, ongoing biblical love story of a Roman centurion and a beautiful but mysterious young woman. People and events of the Bible, framed by this romance, spring to life in a tapestry of superb storytelling and historical authenticity that will transfix both fans of historical and religious fiction and anyone who loves a page-turning read.  \"One is watching history unfold when reading the Thoenes' work.\" (Houston Chronicle)  \"Fast-paced, often riveting action . . . scenes that rival those of James Michener.\" (New York Post)  \"Strong characters . . . poignant stories . . . female characters with surprising chutzpah.\" (Publishers Weekly)",
        "Category": " Fiction , Religious",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Ascent of Mind: Ice Age Climates and the Evolution of Intelligence",
        "Authors": "By Calvin, William H.",
        "Description": "Investigates the rapid evolution of the ape brain into the hominid brain, and explains why understanding our evolutionary past can help us survive an uncertain future",
        "Category": " Science , Life Sciences , Evolution",
        "Publisher": "bantam books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Race Against Time",
        "Authors": "By Piers Anthony",
        "Description": "",
        "Category": "",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Blue Adept (The Apprentice Adept, Book 2)",
        "Authors": "By Anthony, Piers",
        "Description": "In Book Two of the epic adventure that began in SPLIT INFINITY, Stile discovers life on Proton and Phaze is getting more difficult. On Proton he's a serf trying to prove his right to exist by competing in the Great Games. And on Phaze, where only magic worked, he was the Blue Adept trying to master the powers of sorcery. On both worlds, someone was trying to assassinate him. And as if that weren't enough, he has to win the love of Lady Blue, fight a dragon, discover the ultimate weapon, and of course, seek out the all-powerful Citizen who was trying to kill him!THE APPRENTICE ADEPT SERIESBook One: SPLIT INFINITYBook Two: BLUE ADEPTBook Three: JUXTAPOSITION",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Source of Magic (Xanth)",
        "Authors": "By Anthony, Piers",
        "Description": "A quest for the source of power threatened to doom the land of XanthAs a ruler of a country steeped in enchantment, King Trent was naturally curious about the source of its magic. It made sense to order Bink, the only one of his subjects immune to supernatural harm, to undertake a quest to discover the wellspring of Xanth’s uniqueness.From the beginning, Bink and his companions, Chester the centaur and Crombie, the soldier transformed into a griffin, were harried by an unseen enemy determined to thwart them. Even the power of Good Magician Humfrey, together with Bink’s protective talent, scarcely saved their lives.Then when Humfrey and Crombie turned against him, all seemed lost. But Bink's ingenuity and luck prevailed, and he reached his goal.The King’s orders had been carried out . . . But the King had not expected Bink’s next act—to destroy utterly the magic of Xanth!",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Triple Detente",
        "Authors": "By Anthony, Piers",
        "Description": "After a complicated truce is worked out between Earth and the planet Kazo, a third alien intelligence appears, making the balance of peace even more delicate",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Remembered Death",
        "Authors": "By Christie, Agatha",
        "Description": "An anonymous vote declaring that his wife's supposed suicide was really murder causes George Barton to reconstruct the events of her last day",
        "Category": "",
        "Publisher": "POCKET",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Hooked on Books",
        "Authors": "By Shaevitz, Morton H. and Fader, Daniel N.",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "The Mammoth Book of Historical Detectives (Mammoth Books)",
        "Authors": "By Ashley, Mike (EDT)",
        "Description": "A companion to the Mammoth Book of Historical Whodunnits contains more fictional detectives--including monastic investigators Brother Cadfael and Sister Fidelma, cowboy sleuth Ben Snow, and newcomers William Shakespeare and Hans Christian Andersen. Original.",
        "Category": " Literary Criticism , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "The Wine-Dark Sea (Book 16)",
        "Authors": "By O'Brian, Patrick",
        "Description": "At the outset of this adventure filled with disaster and delight, Jack Aubrey and Stephen Maturin pursue a heavy American privateer through the Great South Sea. The strange color of the ocean water reminds Stephen of Homer's famous description, but it also portends a spectacular submarine volcanic eruption that will create a new island overnight and leave an indelible impression on the reader's imagination.Their ship, the Surprise, is now also a privateer, the better to escape diplomatic complications from Stephen's mission, which is to ignite the revolutionary tinder of South America. Jack will survive a desperate open-boat journey and come face to face with his illegitimate black son; Stephen, caught up in the aftermath of his failed coup, will flee for his life into the high, frozen wastes of the Andes; and Patrick O'Brian's brilliantly detailed narrative will reunite them at last in a breathtaking chase through storm seas and icebergs south of Cape Horn, where the hunters suddenly become the hunted.This is storytelling without models or equals in recent literature; critics have noted in O'Brian's great Aubrey/Maturin epic, now sixteen volumes in length, haunting echoes of such writers as Joseph Conrad, Herman Melville, and Jane Austen. Some readers will respond to the undeniable excitement of the chases, storms, and battles, others to the precision of language, or the humor, or the wealth of erudition in Maturin's researches and conversations. But the truest mark of O'Brian's stature as a novelist may be the great number of readers who find fresh delights and deeper resonances in rereading his novels.",
        "Category": " Fiction , Historical , General",
        "Publisher": "W. W. Norton",
        "Price Starting With ($)": "125.98",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The Grail (Area 51, Bk. 5)",
        "Authors": "By Doherty, Robert",
        "Description": "The Holy Grail -- is it the key to a miracle ... or a terrifying truth?The Great Wall of China, the immense carvings on Easter Island, Egypt's pyramids, UFOs. What is the chilling connection? The answer, unearthed by an elite band of soldiers and scientists based at Area 51, is rewriting human history -- to include the aliens who shaped it! Now, in this heart-pounding novel, Area 51 personnel embark on a top secret search for the Holy Grail, a glittering artifact with the power to save the world ... or lead to its destruction. Special Forces officer Mike Turcotte has paid his dues in battle and in blood. Now assigned to Area 51, he fights the toughest enemy of his career: the alien race who arrived on earth millennia ago and have returned to claim the planet. Mike has dodged bullets and faced weapons of mass destruction to give humanity another day of reprieve. But when his lover, scientist Lisa Duncan, falls into evil hands, Mike must decide which prize means the most to him -- the woman he loves or the legendary Grail. It's a decision that could damn him ... or damn us all.",
        "Category": " Fiction , Science Fiction , High Tech",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Kafka's Soup: A Complete History of World Literature in 14 Recipes",
        "Authors": "By Crick, Mark",
        "Description": "I needed a table at Maxim’s, a hundred bucks, and a gorgeous blonde; what I had was a leg of lamb and no clues. I took hold of the joint. It felt cold and damp, like a coroner’s handshake. I took out a knife and cut the lamb into pieces. Feeling the blade in my hand I sliced an onion, and before I knew what I was doing a carrot lay in pieces on the slab. None of them moved.—from “LAMB WITH DILL SAUCE À LA RAYMOND CHANDLER”If you’ve ever wondered what it would be like to make dinner with Franz Kafka, Jane Austen, or Raymond Chandler, this is the chance to find out.   Literary ventriloquist Mark Crick presents fourteen recipes in the voices of famous writers, from Homer to Virginia Woolf to Irvine Welsh.  Guaranteed to delight anyone in love with food and books, these witty pastiches will keep you so entertained in the kitchen that you’ll be sorry when the guests arrive.",
        "Category": " Cooking , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Dead Sea Scrolls Today",
        "Authors": "By Vanderkam, James C.",
        "Description": "This perennially bestselling book on the Dead Sea Scrolls by one of the fields most respected scholars has now been revised and updated to reflect scholarship and debates since the book was first published in 1994.",
        "Category": " Religion , Biblical Criticism & Interpretation , Old Testament",
        "Publisher": "Wm. B. Eerdmans Publishing Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Do You Believe?",
        "Authors": "By Lawrence, Ann",
        "Description": "DO YOU BELIEVE IN EVIL?Rose Early is searching for her missing sister Joan. The only clue she has is a horror novel with her sister's notes in the margins. The author of the book lives only a few minutes away and Rose can't resist seeking him out. She understands why his book affected her sister: the author creates an evil so palpable it shakes even skeptical Rose.  Vic Drummond, the writer, knew Rose's sister, and agrees to help Rose find her; Rose expected him to be reclusive and strange, but she didn't expect him to be quite so . . . attractive.  As their search intensifies, Rose finds herself inexorably drawn to Vic, but it seems to Rose that their feelings for each other are being influenced by some outside force-she knows love at first sight doesn't exist.  As they come closer to finding Joan, Rose and Vic journey from the local church to a mysterious sex club whose members dress in demon costumes.  The more they learn about what Joan was doing in the days before her disappearance, the more questions they have, until Rose must decide: Does she believe in real evil?  And does she believe in real love?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Tor Paranormal Romance",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Cat & Mouse (Alex Cross, 4)",
        "Authors": "By Patterson, James",
        "Description": "In this New York Times bestseller, two killers-one operating in America, one in Europe-believe Alex Cross is the only worthy opponent in the deadly game each has planned.Gary Soneji, a dying prison escapee, is looking for revenge on Cross, while another insane killer is pursued by Thomas Augustine Pierce-a brilliant and relentless detective who may even be better than Cross. As the bodies pile up, and Cross is nearly murdered in his own home, the game of cat and mouse leads to one final trap. . . The body count is high, the tension the highest, and the two killers on the loose are watching every move their pursuers make. Who is the cat, and who is the mouse? What and where is the final trap? And who survives?",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Vision",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Pillars of Creation: Sword of Truth (Sword of Truth, 7)",
        "Authors": "By Goodkind, Terry",
        "Description": "Sequel to the New York Times bestselling Faith of the FallenNew York Times bestselling author Terry Goodkind has created his most lavish adventure yet. Tormented her entire life by inhuman voices, a young woman named Lauren seeks to end her intolerable agony. She at last discovers a way to silence the voices. For everyone else, the torment is about to begin.With winter descending and the paralyzing dread of an army of annihilation occupying their homeland, Richard Rahl and his wife Kahlan must venture deep into a strange and desolate land. Their quest turns to terror when they find themselves the helpless prey of a tireless hunter.Meanwhile, Lauren finds herself drawn into the center of a struggle for conquest and revenge. Worse yet, she finds her will seized by forces more abhorrent than anything she ever envisioned. Only then does she come to realize that the voices were real.Staggered by loss and increasingly isolated, Richard and Kahlan must stop the relentless, unearthly threat which has come out of the darkest night of the human soul. To do so, Richard will be called upon to face the demons stalking among the Pillars of Creation.Discover breathtaking adventure and true nobility of spirit. Find out why millions of readers the world over have elevated Terry Goodkind to the ranks of legend.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Comfort and Joy",
        "Authors": "By Michaels, Fern, Bostwick, Marie, Lamb, Cathy, and Wolf, Deborah J.",
        "Description": "The Best Gifts Are Given From The HeartWhen spirited Maeve O'Malley stumbles upon an unconscious man one snowy night in December, she doesn't think twice before coming to his rescue. But her good intentions are no match for her brother's sense of propriety, and before long Maeve is married to the nameless--and irresistibly attractive--stranger. It doesn't matter who he is, because she is certain that he's a gift from above. . .one she means to keep.When his memory returns, Charles Rycroft, an art collector from one of Boston's oldest and wealthiest families, is astounded to learn that he's a married man--and that his lovely Irish wife is one of Boston's serving class. Intending only to give Maeve a bit of polish before ending their hasty union, Charles's primary concern is finding the valuable sketch of St. Nicholas that was stolen when he was assaulted. Yet Maeve's presence in his home is a dazzling ray of light, and as Christmas nears, he suspects her love may be his greatest joy.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Country Patchwork and Quilting",
        "Authors": "By Linsley, Leslie",
        "Description": "Patterns and instructions for making quilts and other patchwork projects",
        "Category": "",
        "Publisher": "Sedgewood Pr",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Last Call for Blackford Oakes (Blackford Oakes Mysteries)",
        "Authors": "By Buckley, William F.",
        "Description": "More than twenty years ago William F. Buckley Jr. launched the dashing character of Blackford Oakes like a missile over the literary landscape. This newly minted CIA agent-brainy, bold, and complex-began his career by saving the queen of England and quickly took his place in the pantheon of master spies drawn up by Somerset Maugham, Graham Greene, and John le Carré. Against the backdrop of sinister Cold War intrigue, in this, his eleventh outing, Oakes crosses paths-and swords-with Kim Philby, perhaps the highest-ranking in the parade of defectors to the Soviet Union. Oakes is now himself a master spy, working outside of the agency and around agency rules. His romance with an able and worldly Soviet doctor provides consolation for the death of his beloved Sally. But after his return to Washington, he receives dismaying news. It is inevitable that the great Soviet spy and the renowned American agent will meet again-this time with deadly consequences.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "National Geographic Guide To The World's Secret Places by David Yeadon (2004) Hardcover",
        "Authors": "By David Yeadon",
        "Description": "",
        "Category": "",
        "Publisher": "National Geographic Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Home Swell Home",
        "Authors": "By Rowley, Cynthia and Rosenzweig, Ilene",
        "Description": "Sex and the City meets Martha Stewart in this savvy and eclectic interior-design manifesto for high-flying chicks with nesting fantasies from the authors of the bestselling Swell: A Girl's Guide to the Good Life.  In their first breakthrough style manual, fashion designer Cynthia Rowley and former New York Times Sunday Styles editor Ilene Rosenzweig showed girls-on-the-go how to navigate the world with a little swagger and a lot of grace. Now they're taking the Swell aesthetic home with this inspiring guide to creating the ultimate dream pad. With more of the friendly tone and wry wit that lit up their first book, they introduce the idea of haute décor: How to make dressing up your home as exciting and accessible as buying a new wardrobe: Making it sexy. Trying new looks. Breaking rules. Mixing retro with modern. Changing with the seasons and your moods.  Offering a blueprint for the entire creative process, the two best friends and coauthors take you from inspiration to practical execution. Tour the swell playhouse room by room and see how design daydreams inspired by movies, a Palm Springs vacation, a painting, a favorite dress, or your own personal nostalgia (for the Brady Bunch living room) can become reality.  Full of the authors' own anecdotes and wisdom from a pantheon of swell style heroes, Home Swell Home has household hints, tips, and bits of history on everything you wish you'd known but never would have thought to ask. Some of the tour highlights ahead:  The sixty-minute makeover for when romantic company's coming  A recipe for a four-star dining room (hint: logo-print slip covers)  Furniture EMS to resuscitate doomed hand-me-downs  Turning the underused kitchen into a day spa  Wiring \"moonlight\" into your trees  Create the ultimate sitcom screening room  Three new uses for your coffee table  \"Paint\" the walls with colored fluorescent lights   Get real paint out of your hair!  Swinging from uptown decadence to downtown chic, Home Swell Home demystifies design, sweeps away snobbery, and shows how any house or apartment can be a place for high-style adventures. So come on in!",
        "Category": " Design , Decorative Arts",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "A Bouquet of Roses: Glorious Arrangements for All Occasions",
        "Authors": "By Chynoweth, Kate, Cushner, Susie (PHT), and Wressell, Christina",
        "Description": "Rose lovers rejoice! The stunning arrangements in A Bouquet of Roses offer fresh inspiration and trade secrets from professional stylist and floral designer Christina Wressell. Her expert advice makes the most of the worlds most popular flower, with tips on finding and selecting the best varieties, making bold color choices, displaying arrangements in unique containers, and preparing and conditioning stems and petals for lasting results. Arranged by color, thirty glorious bouquets feature a profusion of varieties. From elegant home accents such as vintage bowls bursting with heady blossoms to handheld bouquets like classic bridal arrangements to the wonderfully surprising addition of a lavish Victorian kissing ball, there are designs in here for every occasion. Beautifully photographed and budding with inspiration and straightforward instruction, A Bouquet of Roses is a true celebration of the most beloved of flowers.",
        "Category": " Gardening , Flowers , Roses",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Alien Clones From Outer Space: Food Fight!",
        "Authors": "By Homzie, H. B., Phillips, Matt (ILT), and Phillips, Matt",
        "Description": "While doubling for Barton and Nancy in the cafeteria while they get Skye Johnston's autograph, Beta and Gamma find themselves the cause of the biggest food fight in the school's history.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "All the King's Men  [Movie Tie-In Edition]",
        "Authors": "By Warren, Robert Penn",
        "Description": "Winner of the Pulitzer PrizeMovie Tie-in EditionWhen All the King's Men was first published in 1946, Sinclair Lewis pronounced it \"massive, impressive...one of our few national galleries of character.\" Diana Trilling, reviewing it for the Nation, wrote, \"For sheer virtuosity, for the sustained drive of its prose, for the speed and the evenness of its pacing, for its precision of language...I doubt indeed whether it can be matched in American fiction.\" The Washington Post declared, \"If the game of naming the Great American Novel is still being played anywhere, Warren's All the King's Men would easily make the final rounds.\"   Set in the 1930s, this Pulitzer Prize-winning novel traces the rise and fall of demagogue Willie Stark, a fictional character who resembles the real-life Huey \"Kingfish\" Long of Louisiana.  Stark begins his political career as an idealistic man of the people but soon becomes corrupted by success and caught between dreams of service and an insatiable lust for power.  As relevant today as it was more than fifty years ago, All the King's Men is one of the classics of American literature.",
        "Category": " Fiction , Political",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Schools of the Future: How American Business and Education Can Cooperate to Save Our Schools",
        "Authors": "By Gayle, Margaret, Cetron, Marvin J., and Soriano, Barbara",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "The Other Daughter: A Novel",
        "Authors": "By Gardner, Lisa",
        "Description": "Twenty years ago, Melanie Stokes was abandoned in a Boston hospital, then adopted by a wealthy young couple. Gifted with loving parents, a doting brother, and an indulgent uncle, Melanie has always considered herself lucky. Until the first cryptic, threatening note arrives: “You Get What You Deserve.”Melanie has no memory of her life before the adoption. Now someone wants her to remember it all—even the darkest nightmare the Stokes family ever faced: the murder of their first daughter. As Melanie pursues every lead and chases every shadow in search of her real identity, two seemingly unrelated events from her past will come together in a dangerous explosion of truth.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Jerry Baker's It Pays to Be Cheap!: 1,973 of the Niftiest, Swiftiest, and Thriftiest Secrets on Earth for Spendin' Less and Savin' More on . . . Food, ... Everything! (Jerry Baker's Good Home series)",
        "Authors": "By Baker, Jerry",
        "Description": "Fun and innovative ways to save money on items such as groceries, electronics, pet care, travel, and clothing are revealed in this indispensable savings handbook. Features such as \"Online Steals & Deals,\" \"Bargain Alerts,\" and \"Fantastic Formulas\" uncover easy ways for anyone to become a thrift expert without sacrificing personal pleasures or undergoing excessive belt-tightening. Money-saving ideas for cutting pet food bills by 25 percent, flying major airlines for free, and creating an automatic plant-watering system are included, as well as tips on how to unclutter cabinets; make simple health and beauty tonics; create eco-friendly, multipurpose cleaning supplies; save a bundle on home repairs; and snag free tickets to concerts, museums, and sporting events.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "American Master Products, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Exiles at the Well of Souls",
        "Authors": "By Chalker, Jack L.",
        "Description": "",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "Ironman",
        "Authors": "By Crutcher, Chris",
        "Description": "Participating in an anger management class with several of the least reputable students in school, troubled teen athlete Bo Brewster learns his peers' disturbing stories and discovers how to handle his over-critical father. Reprint.",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Born in Fire (Born in Trilogy, Book 1)",
        "Authors": "By Roberts, Nora",
        "Description": "#1 New York Times bestselling author Nora Roberts presents the first novel in the Irish Born Trilogy—featuring three modern sisters bound by the timeless beauty of Ireland.Margaret Mary, the eldest Concannon sister, is a glass artist with an independent streak as fierce as her volatile temper. Hand-blowing glass is a difficult and exacting art, and while she may produce the delicate and the fragile, Maggie is a strong and opinionated woman, a Clare woman, with all the turbulence of that fascinating west country. One man, Dublin gallery owner Rogan Sweeney, has seen the soul in Maggie’s art, and vows to help her build a career. When he comes to Maggie’s studio, her heart is inflamed by their fierce attraction—and her scarred past is slowly healed by love…Don't miss the other books in the Irish Born TrilogyBorn in IceBorn in Shame",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Night Tales: Night Shield & Night Moves",
        "Authors": "By Roberts, Nora",
        "Description": "This last installment in the best-selling Night Tales series includes Night Shield, in which an undercover policewoman falls for the man she has been assigned to investigate, and Night Moves, in which a young woman finds her life turned upside down by a sexy landscaper and the discovery of a skeleton in her backyard. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Night Tales: Nightshade / Night Smoke",
        "Authors": "By Roberts, Nora",
        "Description": "This second installment in the Night Tales trilogy features Nightshade, in which two former lovers must cast aside their painful past and catch a killer, and Night Smoke, in which a fierce passion is ignited between a beautiful business owner and an arson inspector. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Once Upon a Rose (The Once Upon Series)",
        "Authors": "By Roberts, Nora, Ryan, R. C., Gregory, Jill, and Willman, Marianne",
        "Description": "#1 New York Times bestselling author Nora Roberts presents four stories about the magic of blossoming love...In Nora Roberts' \"Winter Rose,\" a young queen heals a wounded soldier on a remote island cursed with eternal winter—and warms her heart with the joys of true love.In Jill Gregory's \"The Rose and the Sword,\" an exiled princess’s last hope for recovering her lost kingdom lies with the embittered prince she is pledged to marry—a man as impossible as he is irresistible.In Ruth Ryan Langan's \"The Roses of Glenross,\" a lonely lass tends a haunted rose garden in an abbey in war-torn Scotland—while a heroic soldier basks in the pure glow of her love. In Marianne Willman's \"The Fairest Rose,\" a bold Irish warrior falls for the one woman who has the power to save his life—and hold his heart.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Key of Knowledge",
        "Authors": "By Roberts, Nora",
        "Description": "#1 New York Times bestselling author Nora Roberts unlocks the dreams of a woman on a quest for the truth in her second Key Trilogy novel. Dana Steele has always found her greatest passion in books. But now her boss is making her job as a librarian a living hell. Luckily, she now has a Plan B… High on a hill overlooking the town of Pleasant Valley, Pennsylvania, sits the Warrior’s Peak estate. It’s where Dana was invited to meet Malory Price and Zoe McCourt—and where they learned that they were destined to find three keys to unlock a box holding the souls of three mythical demigoddesses: one an artist, one a bard, and one a warrior. With the promise of a million dollars each dangled before them, the women couldn’t refuse. And as Malory found the first key, they formed a fast friendship and decided to go into business together. For Dana, that meant her dream of owning a bookstore was about to come true. And now, as Dana finds herself on the threshold of some major life changes, it’s her turn to find a key. She has four weeks to unravel a riddle involving her past, present, and future, and to find the truth hidden among deception and lies—or succumb to her worst nightmare. Don’t miss the other books in the Key Trilogy Key of Light Key of Valor",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Key of Valor",
        "Authors": "By Roberts, Nora",
        "Description": "A woman’s quest for courage opens her heart to love in the third Key Trilogy novel from #1 New York Times bestselling author Nora Roberts.Growing up, Zoe McCourt did not have an easy life—some might call it “disadvantaged.” A hairstylist from a West Virginia trailer park, she ended up in beautiful Pleasant Valley, Pennsylvania, by sheer determination. How she ended up on a quest for a key to unlock the soul of a warrior demigoddess is another story…Invited to an imposing estate overlooking the town, she met Malory Price and Dana Steele. Each woman was at a crossroads in her life, each facing an uncertain future. And a mysterious couple offered them the chance of a lifetime: a million dollars each if they could free the trapped souls of three mythological sisters—an artist, a bard, and a warrior.Malory and Dana had to reach deep inside themselves to find their keys—and not without paying a price. Now, it has become Zoe’s quest. As a single mother, she has more to risk, more to lose. But her courage in the face of overwhelming odds cannot be underestimated. A nurturer to her son, a defender of her friends, she must confront dark forces amassed against her to make all of their dreams come true…Don’t miss the other books in the Key TrilogyKey of LightKey of KnowledgeFrom the Trade Paperback edition.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Born in Ice (Born in Trilogy, Book 2)",
        "Authors": "By Roberts, Nora",
        "Description": "The second novel in the Irish Born Trilogy from the #1 New York Times bestselling author of Born In Fire.  Brianna Concannon is the kind of innkeeper who doesn’t mind the harsh winters of Ireland—and the empty bed-and-breakfast that comes with them. But this year, a famous American author needs a quiet place to stay while writing his next book. A charmer whose easy smiles mask a guarded past, Grayson Thane plans to spend the cold winter alone. But his lovely landlady adds a complication he never expected. She’s exactly what he’s looking for in his heroine. And soon Grayson and Brianna will learn that sometimes fate has a plan of its own. Sometimes, fire can be born in ice...Don't miss the other books in the Irish Born TrilogyBorn in FireBorn in Shame",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The Wheel of Darkness (Agent Pendergast series, 8)",
        "Authors": "By Child, Lincoln and Preston, Douglas",
        "Description": "Taking Constance on an international tour to expose her to a world she has never experienced, FBI agent Pendergast visits the Tibetan monastery where he received martial arts training, only to learn that a rare and dangerous artifact has been stolen, following a trail that leads him aboard a treacherous Atlantic cruise. Reprint.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Emperor's General",
        "Authors": "By Webb, James H.",
        "Description": "1997. Jay Marsh, Wall Street millionaire and grand old man of the diplomatic corps, takes a sentimental journey to the scene of his first triumphs and agonies, Manila, where as a brash young captain during World War Two he served as aide-de-camp and confidant to General Douglas MacArthur. Now, as the senior statesmen stands in the serene garden of the ambassador's residence, his mind reels back in time...In the final days of the war in the Pacific, the Philippines are retaken by the Allies under the command of General MacArthur, paving the way for Japan's surrender. MacArthur enlists Captain Marsh to be his emissary to the imperial government, a mission that takes the junior officer into the shadow world of postwar Tokyo. As Marsh undertakes the delicate task of opening a dialogue with the emperor, he becomes ensnared in a web of deceit, witnesses a grave injustice, commits a life-altering act of betrayal - and discovers shocking truths about MacArthur the world was never meant to know.",
        "Category": " Fiction , War & Military",
        "Publisher": "Broadway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "A Special Day for Mommy",
        "Authors": "By Andreasen, Dan",
        "Description": "Having decided to give Mommy a special day, Little Pig sets out to do a number of tasks around the house in order to be a good helper, but Mommy isn't too far behind to lend a quiet, helping hand whenever it is needed, in a charming tale about a determined daughter with the best of intentions.",
        "Category": " Juvenile Fiction , Animals , Pigs",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Storm Runner (Tales of the Wolves, Book 3)",
        "Authors": "By Harper, Tara K.",
        "Description": "Wolfwalker Dion and her canine companion sense that something terrible is lurking on the other side of the border, and she is determined to put a stop to it before her people are destroyed. Original.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Lost Light (Harry Bosch)",
        "Authors": "By Connelly, Michael",
        "Description": "The vision has haunted him for four years--a young woman lying crumpled in death, her hand outstretched in silent supplication. Harry Bosch was taken off the Angella Benton murder case when the production assistant's death was linked with the violent theft of two million dollars from a movie set. Both files were never closed. Now retired from the L.A.P.D., Bosch is determined to find justice for Angella. Without a badge to open doors and strike fear into the guilty, he's on his own. And even in the face of an opponent more powerful and ruthless than any he's ever encountered, Bosch is not backing down.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "A Day Late and a Dollar Short",
        "Authors": "By McMillan, Terry",
        "Description": "Las Vegas, 1994.The Prices are introduced by Viola, the family's outspoken matriarch: Her husband, Cecil, has shut the door behind him for the last time; and their four adult kids, scattered across the country, seem determined to send her to her grave, or at least to the hospital with worrying. Paris is divorced, mother to a nearly seventeen-year-old son and the one who always comes to everybody's rescue&#151;although she doesn't have a clue as to how to save herself. Lewis is the scapegoat, and his troubles keep landing him in jail, which only seems to confirm what his family thinks he is. Out in Chicago, Charlotte knows she's gotten the short end of the stick for years, has \"nothing in common except blood\" with her parents and siblings and would just as soon divorce them all. Janelle, the baby of the family, is not only on the defensive about the course of her own life but she's facing a new crisis, a fast-brewing storm with her teenage daughter that threatens more than she's willing to admit. And don't even ask Viola about Cecil: \"He's a bad habit I've had for thirty-eight years which would make him my husband.\" But Cecil has some ideas for taking his hardworking life into his own hands, regardless of what his wife and kids think about it.With her hallmark exuberance and a cast of characters so sassy, resilient, and full of life that they breathe, dream, and shout right off the page, Terry McMillan has given us a tour-de-force novel of family, healing and redemption. A Day Late and a Dollar Short takes us deep into the hearts, minds, and souls of America&#151;and gives us six more friends we never want to leave.",
        "Category": " Fiction , Sagas",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Every Breath She Takes",
        "Authors": "By Forster, Suzanne",
        "Description": "Ace homicide detective Rio Scott Walker finds himself attracted to Carlie Bishop, the daughter of a U.S. Supreme Court justice and the prime suspect in a series of brutal murders in which would-be stalkers are lured to their deaths by a female serial killer posing as the perfect victim. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Five Hundred Years After (The Khaavren Romances)",
        "Authors": "By Brust, Steven",
        "Description": "In which our Heroes--Khaavren, Pel, Aerich and Tazendra--are reunited again a mere five centuries later...just in time for an uprising that threatens to destroy the Imperial Orb itself!This is the story of the conspiracy against the Empire that begins in the mean streets of Underside and flourishes in the courtly politics of the Palace where Khaavren has loyally served in the Guards this past half-millennium.It is the tale of the Dragonlord Adron's overweening schemes, of his brilliant daughter Aliers, and the eldritch Sethra Lavode.And it is the tale of four boon companions, of love, and of revenge...a tale from the history of Dragaera, of the events that changed the world!",
        "Category": "",
        "Publisher": "Tor Fantasy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    }
]