[
    {
        "Title": "Black Widow (Nancy Drew Casefiles, Case 28)",
        "Authors": "By Keene, Carolyn",
        "Description": "While cruising to Rio de Janeiro on board the \"Emerald Queen\", Nancy becomes involved in a mystery concerning Mrs. Nina da Silva, whose late husband had been involved in an enormous emerald robbery.",
        "Category": "",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Sales on the Line: Meeting the Business Demands of the '90s Through Phone Partnering",
        "Authors": "By Morgen, Sharon Drew",
        "Description": "",
        "Category": " Business & Economics , Advertising & Promotion",
        "Publisher": "Metamorphous Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Brownie Quest",
        "Authors": "By Girls Scouts of the USA",
        "Description": "",
        "Category": "",
        "Publisher": "Girl Scouts of the USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Dangerous Hour (A Sharon McCone Mystery (22))",
        "Authors": "By Muller, Marcia",
        "Description": "- Mutter's previous novel, \"Cyanide Wells, was published in Mysterious Press hardcover in 7/03, and will be released in mass market simultaneous with THE DANGEROUS HOUR.- \"Dead Midnight (Mysterious Press, 6/02) hit the \"Los Angeles Times bestseller list, winning rave reviews from the \"New York Times Book Review, San Francisco Chronicle, Library Journal, Publishers Weekly (starred review), and \"Booklist. The mass market edition was published in 7/03.- Muller's McCone series has consistently received strong reviews from national publications, including the \"New York Times Book Review, USA TODAY, and the \"Los Angeles Times, among others.- The McCone mysteries are being developed by Spring Creek Productions and CBS-TV into a pilot for a new television series.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Cam Jansen and the Mystery of the Stolen Diamonds",
        "Authors": "By Adler, David A. and Natti, Susanna (ILT)",
        "Description": "No mystery is too great for super-sleuth Cam Jansen and her amazing photographic memory! Can Cam help catch the diamond thief? Cam and her friend Eric are sitting at the mall when the jewelry store is robbed. Cam sees the thief, but the police arrest the wrong person. Now it's up to Cam to catch the real criminal!The Cam Jansen books are perfect for young readers who are making the transition to chapter books, and Cam is a spunky young heroine whom readers have loved for over two decades.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Tell Me a Story (Disney's Fun to Learn Ser)",
        "Authors": "By Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Pub Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Mathematics, Applications And Connections: Course 3",
        "Authors": "By Glencoe",
        "Description": "",
        "Category": " Young Adult Nonfiction , Mathematics , General",
        "Publisher": "Glencoe/McGraw-Hill School Pub Co",
        "Price Starting With ($)": "7.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "100 Question & Answers about Breast Cancer",
        "Authors": "By Zora K. Brown, Harold P. Freeman, Elizabeth Platt",
        "Description": "",
        "Category": "",
        "Publisher": "JONES & BARTLETT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Personal Touch",
        "Authors": "By Crabb, Rachael",
        "Description": "",
        "Category": "",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Bison (Our Wild World)",
        "Authors": "By McGee, John F. (ILT) and Winner, Cherie",
        "Description": "Every title contains: -Where the animal lives, what it eats, when it sleeps, how it raises its young, and much more. -Over 30 vivid, full color photos and illustrations. -Sidebar 'Fun Facts,' an index and a list of useful Internet Sites.",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Dream Factory",
        "Authors": "By Barkley, Brad and Hepler, Heather",
        "Description": "When the Disney World character actors go on strike, teens are hired as replacements. Ella is assigned the role of Cinderella simply because the shoes fit. And every afternoon at three o?clock she gets married to Prince Charming. A perfect dream come true?except Ella doesn?t believe in dreams anymore. Meanwhile, Luke is one of the fur characters (Dale, the chipmunk), and his girlfriend, Cassie, plays his counterpart, Chip. Cassie is perfect in every way, so why does Luke want to be with Cinderella? Then Luke and Ella are brought together during a scavenger hunt, and as they uncover the Magic Kingdom?s hidden treasures, they discover an undeniable magic between them. Perhaps dreams really can come true after all?",
        "Category": " Young Adult Fiction , Romance , General",
        "Publisher": "Speak",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "What Pets Teach Us: Life's Lessons Learned From Our Best Friends",
        "Authors": "By Donner, Andrea (Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Willow Creek Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Relational Parenting: Going Beyond Your Child's Behavior to Meet Their Deepest Needs",
        "Authors": "By Campbell, Ross and Champbell, Ross, M.D.",
        "Description": "A practical new guide to parenting technique encourages parents to teach youngsters how to assume responsibility for their own actions as well as to control a child's behavior.",
        "Category": " Religion , Inspirational",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The A, B, C's of Financial Success",
        "Authors": "By Cameron, Barry L.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "College Press Publishing Company, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Desks and bookcases (Build-it-better-yourself woodworking projects)",
        "Authors": "By Engler, Nick",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Right Word II: A Concise Thesaurus Based on the New American Heritage Dictionary",
        "Authors": "By Houghton Mifflin Company (COR) and Harris, Robert W.",
        "Description": "",
        "Category": " Reference , Word Lists",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "The Way of the World",
        "Authors": "By Congreve, William",
        "Description": "One of the greatest of all Restoration comedies, The Way of the World is Congreve's masterpiece — a rich and knowing comedy of manners that not only satirizes the falsity, pretense and shallowness of the London society of his day, but also offers a depth of feeling, sensitivity, and polished phrasing that elevates the play far above other efforts in the genre.Delightfully entertaining, The Way of the World abounds in brilliant word play, delicious verbal battles of the sexes (some consider the famous scene between Mirabell and Millamant as one of the most profound analyses of the marriage relation ever written), and scheming villains of both genders. First presented in London in 1700, this comedy has charmed audiences for over 300 years. This inexpensive paperbound edition, complete and unabridged, makes it widely available to today's readers.",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Hiawatha And Megissogwon",
        "Authors": "By Longfellow, Henry Wadsworth and Thompson, Jeffrey (ILT)",
        "Description": "Legendary Hiawatha, son of the West Wind, ventures into a desolate land to battle an evil magician in this compelling episode from Longfellow?s epic, The Song of Hiawatha. Action-packed drama combines with magic as the brave young hero slays serpents, evades ghosts, and finally confronts the mighty Megissogwon. Jeffrey Thompson?s powerful blend of scratchboard and computer illustration enchances the magic of Longfellow?s stirring poetry, drawing a new generation of children into this classic tale. An afterword by prominent Native American author Joseph Bruchac answers the question: Is this an authentic Native American legend?",
        "Category": " Juvenile Fiction , People & Places , United States , Native American",
        "Publisher": "National Geographic Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "South Beach Diet",
        "Authors": "By Agatston, Arthur, M.D.",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Japanese Cooking The Traditions Techniques Ingredients and Recipes",
        "Authors": "By Kazuko, Emi",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Out of the Girls' Room and into the Night (Iowa Short Fiction Award)",
        "Authors": "By Nissen, Thisbe",
        "Description": "Out of the Girls' Room and into the Night is a spirited,  offbeat collection of stories, elongated riffs on that thing we call  …love. All manner of love stories: thwarted love stories, imaginary love  stories, love stories offhand and obsessive, philosophical love  stories, erudite and amusing love stories.“People don't meet because they both like Burmese food,” says  one character, “or because someone's sister has a friend who's single  and new in town, or because Billy's nose happened to crook just slightly  to the left at an angle that made me want to weep…People don't fall in  love with each other …they just fall into love.”Everyone does it: women of fierce independence, men of thin  character, rambling Deadheads, gay teenage girls, despondent Peace Corps  volunteers, anorexic Broadway theatre dancers, the eager, the grieving,  the uncommunicative. Even the confused do it. And they don't just fall  in love with each other—they fall in love with certain moments and  familiar places, with things as ephemeral as gestures and as evanescent  as sunlight.Quirky, real, idealistic, deluded, bohemian, and true, these  are people who can—and often do—fall in love with a pair of ears, August  afternoons, saucers of vitamins, New Age carpenters, and dead  bumblebees. And if there's something they can teach us, it's how to  conceive of alternative worlds and the terror and the exhilaration of  venturing outside the confines of the lives we know and making our way  into a dark, glittering unknown.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "University Of Iowa Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Ashes To Easter: Lenten Meditations",
        "Authors": "By Morneau, Robert F.",
        "Description": "Join Bishop Morneau on a richly rewarding meditative journey through the forty days of Lent.Each day begins with the identification of the day of Lent and the Gospel reading. A brief commentary on that day's reading is followed by a meditative refrain taken from the Divine Office that summarizes a Gospel theme. Unique to this volume is a poem for each of the days, followed by three questions that are used for personal reflection. The entry concludes with a morning prayer from the Divine Office.From the solemn beginning of Ash Wednesday to the joyous celebration of the Resurrection, Ashes to Easter is a spiritual adventure.",
        "Category": " Religion , Meditations",
        "Publisher": "Crossroad",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Walt Disney's Mary Poppins",
        "Authors": "By Annie North Bedford",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "An Invitation to the Spiritual Journey",
        "Authors": "By John P. Gorsuch",
        "Description": "Argues that God accepts us as we are and that we do not have to become happier or more genuinely spiritual people to experience spiritual growth",
        "Category": "",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "UNIX Network Programming",
        "Authors": "By Stevens, W. Richard",
        "Description": "The leading book in its field, this guide focuses on the  design, development and coding of network software under the  UNIX operating system. Provides over 15,000 lines of C code  with descriptions of how and why a given solution is  achieved. For programmers seeking an indepth tutorial on  sockets, transport level interface (TLI), interprocess  communications (IPC) facilities under System V and BSD UNIX.",
        "Category": " Computers , Operating Systems , UNIX",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Running Deep: A Novel of Submarines, SEALS, and Souls (Winning the Battle Series)",
        "Authors": "By Stevens, Robert Evan and Agkura Design Concepts (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "Anchor House Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Baby Come to Church (Bb)",
        "Authors": "By Esquinaldo, Virginia",
        "Description": "",
        "Category": "",
        "Publisher": "Pauline Books & Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Broken Pieces",
        "Authors": "By Carla Cassidy",
        "Description": "",
        "Category": "",
        "Publisher": "Signet Eclipse Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Hook : Tinkerbell's Challenge",
        "Authors": "By Hart, Jim V., Marmo, Malia Scotch, and Castle, Nick",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "11.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Mastering Leptin (2nd Edition): The Leptin Diet, Solving Obesity and Preventing Disease",
        "Authors": "By Richards, Byron and Richards, Mary Guignon",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Weight Loss",
        "Publisher": "Wellness Resources",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Centering: A Guide to Inner Growth",
        "Authors": "By Sanders Laurie, Melvin J. Tucker",
        "Description": "",
        "Category": "",
        "Publisher": "Destiny Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The Wolf's Chicken Stew",
        "Authors": "By Kasza, Keiko",
        "Description": "The wolf loves to eat more than anything in the world and one day he has a terrible craving for chicken stew. He spots a chicken who seems just right, but then he thinks how much more stew there will be if he fattens her up before dining himself. So he goes home and begins to cook all kinds of scrumptious food for the chicken to eat. A big surprise is in store for the wolf when he finally visits Mrs. Chicken to collect his meal.",
        "Category": " Juvenile Fiction , Cooking & Food",
        "Publisher": "G.P. Putnam's Sons Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Men Are from Mars, Women Are from Venus Book of Days: 365 Inspirations to Enrich Your Relationships",
        "Authors": "By Gray, John",
        "Description": "Nobody knows more about the differences between the sexes than John Gray, Ph.D. He is the man America turns to for help in deciphering the myriad complexities men and women face daily in their interactions with each other. The author of nine bestsellers--including  the history-making Men Are from Mars, Women Are from Venus--John Gray expands on the expert advice touched upon in his previous books and distills each message into a powerful, inspiring daily meditation in this newest volume.  There&#39;s no doubt about it: The relationship between men and women is extremely complex. We often forget just how different the sexes are, and become frustrated and confused by a loved one&#39;s behavior. Every day we need to be reminded of these differences and realize that it&#39;s okay to be different as long as we recognize and understand the behavior of the opposite sex. In Men Are from Mars, Women Are from Venus Book of Days,  John Gray provides us with daily inspirations that lovingly and insightfully remind us of the contrasts between Mars and Venus, allowing us to solve conflicts in our relationships.  Each month is devoted to a single theme, with the daily meditations enlarging on the particular subject at hand. The topics correlate with the very traits of the month itself: January, an exhilarating time of new beginnings, inspires resolve and the desire to excel. In February, when we find ourselves deep in winter&#39;s grip and challenged by constant emotional upheaval, we seek reminders of the importance of commitment and the need for patience. May concentrates on such springtime issues as harmony and appreciation. The topics discussed are as diverse as relationships are.  Inside you&#39;ll find comforting and helpful advice on: The true meaning of equality Improving communicationGiving and receiving emotional support The awakening of our inner qualities   Needing time alone  Keeping the passion alive  Reacting to stress  Whether you need the thoughtful reminders yourself or know a friend or loved one who will benefit from these beautiful reflections, Men Are from Mars, Women Are from Venus Book of Days is a classic that no bookshelf should be without.  The Men Are from Mars, Women Are from Venus Book of Days contains 365 inspirations to remind you each day of the basic differences between men and women  Women love a man with a plan; men love a woman with a smile.  A woman is like a wave. When she feels loved, her self-esteem rises and falls like a wave in motion. When she is feeling really good, she will reach a peak, but then suddenly her mood may change and her wave crashes down. This crash is temporary. After she reaches bottom, her mood will shift suddenly, and she will again feel good about herself. Automatically, her wave begins to rise back up...By recognizing this pattern, a man doesn&#39;t take it personally. When he doesn&#39;t feel as if he is being blamed for her downs, he can be more supportive.  A rubber band is the perfect metaphor to understand the male intimacy cycle, which involves getting close, pulling away, and then getting close again...Most women are surprised to realize that even when a man loves a woman, periodically he needs to pull away before he can get closer. Men instinctively feel this urge to pull away. It is not a decision or a choice. It just happens. It is neither his fault nor her fault. It is a natural cycle.  Romance for women is when a man does things without her having to ask; romance for men is when a woman appreciates the things he does.  Showing interest is one of the most important secrets to opening a woman&#39;s heart.  A man is free to be the best he can be when he feels accepted just the way he is.  Women need to work on trusting, while men need to work on caring.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Harper",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Bugs Are Insects (Let's-Read-and-Find-Out Science 1)",
        "Authors": "By Rockwell, Anne F and Jenkins, Steve (ILT)",
        "Description": "Is a spider an insect? Is a ladybug a bug? Lean how to tell what is an insect and what isn't, and discover the fascinating world of the tiny creatures who live in your own backyard.",
        "Category": " Juvenile Nonfiction , Science & Nature , Biology",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Employing Generation Why?",
        "Authors": "By Chester, Eric",
        "Description": "",
        "Category": "",
        "Publisher": "Tucker House Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "AIDS in the Twenty-First Century: Disease and Globalization",
        "Authors": "By Whiteside, Alan and Barnett, Tony",
        "Description": "Essential reading for social and medical scientists and all those interested in infectious diseases and public health, AIDS and the Twenty-First Century examines the social and economic origins and impacts of the HIV/AIDS epidemic. HIV/AIDS is not only a medical problem. It is an indication of the scale of the global crisis in public health. Accessibly written, this book is necessary reading for policymakers, students and all those who are concerned about the relationship between poverty, inequality and infectious diseases.",
        "Category": " Political Science , Public Policy , Social Services & Welfare",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Eat Your Way Across the U.S.A., Revised Edition",
        "Authors": "By Stern, Jane and Stern, Michael",
        "Description": "A cross-country culinary guide takes the guesswork out of what and where to eat on road trips, providing the latest details on where to find regional favorites, all-you-can-eat buffets, donut shops, pancakes houses, and more. Original.",
        "Category": " Travel , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Intrepid's Last Case: The Super Spy Who Helped Take Down the Nazis Tackles the KGB",
        "Authors": "By Stevenson, William and Rohmer, Richard (FRW)",
        "Description": "Intrepid's Last Case chronicles the post-World War II activities of Sir William Stephenson, whose fascinating role in helping to defeat the Nazis was the subject of the worldwide best-seller A Man Called Intrepid.  Sir William Stephenson still stood at the center of events when he and author William Stevenson discussed in the 1980s an investigation into sudden allegations that Intrepid's wartime aide, Dick Ellis, has been both a Soviet mole and a Nazi spy. They concluded that the rumors grew, ironically, from Intrepid's last wartime case involving the first major Soviet intelligence defector of the new atomic age: Igor Gouzenko. Intrepid saved Gouzenko and found him sanctuary inside a Canadian spy school, Camp X. Gouzenko was about to make more devastating disclosures than those concerning atomic espionage when the case was mysteriously terminated and Intrepid's organization dissolved.  Unraveling the implications of Gouzenko's defection and Intrepid's removal from the case, tracing the steps of Dick Ellis and disclosing much new information regarding United States and Canadian postwar intelligence activities, Intrepid's Last Case is a story that for sheer excitement rivals the best spy fiction-and is all the more important because every word is true.  Filled with never-before-revealed facts on the Soviet-Western nuclear war dance and a compelling portrayal of the mind of a professional spy, Intrepid's Last Case picks up where the first book ended, at the very roots of the cold war. It describes one of the most widespread cover-ups and bizarre betrayals in intelligence history.",
        "Category": " History , Military , World War II",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Blind Alley",
        "Authors": "By Iris Johansen",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Tomorrow's Catholic: Understanding God and Jesus in a New Millennium",
        "Authors": "By Michael Morwood",
        "Description": "",
        "Category": "",
        "Publisher": "Twenty Third Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Living the Gospel of Life: A Challenge to American Catholics",
        "Authors": "By n/a",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "United States Catholic Confere",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Pieced Roman Shades: Turn Your Favorite Quilt Patterns into Window Hangings",
        "Authors": "By Sundermann, Terrell",
        "Description": "",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Houghton Mifflin Reading the Literature Experience: Bears Dont Go to School Level C",
        "Authors": "By Houghton Mifflin Company",
        "Description": "",
        "Category": " Juvenile Nonfiction , Literary Criticism & Collections",
        "Publisher": "Houghton Mifflin College Div",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Valley Drums",
        "Authors": "By Clifford M. Hixon",
        "Description": "",
        "Category": "",
        "Publisher": "C & R Publishing",
        "Price Starting With ($)": "7.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Ask the Bible Geek®: Answers to Questions From Catholic Teens",
        "Authors": "By Hart, Mark",
        "Description": "Gifted youth leader Mark Hart knows teens inside and out, and as the Bible Geek®, he asks and answers the real questions that puzzle them. Dealing realistically and honestly with concerns about God, temptations, personal issues, daily life and more, he speaks encouragement to the minds and hearts of kids. His solutions to typical situations teens wonder about, are rooted in Scripture and the Catholic tradition. A Servant Book.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Servant Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "My Best Book of Spaceships (The Best Book of)",
        "Authors": "By Graham, Ian",
        "Description": "Join the crew and find out how rockets, probes, telescopes, and space shuttles work! Discover the incredibly diverse challenges that can be met by modern satellites! The Best Book of Spaceships by Ian Graham introduces young readers to the amazing variety of spaceships past, present, and ready to blast off into the future. Full color illustrations, clear captions, combined with a simple, descriptive text will help kids to discover the answers to tricky questions such as - What's in space? - What does it feel like to put on a space suit? - and provide a fascinating overview of life and work in the space environment, from the first steps on the moon, to life on a space station. This information-packed book makes an exciting gift and is an ideal reference for the young reader who wants to know more about spaceships and the work of humans beyond the Earth's atmosphere.",
        "Category": " Juvenile Nonfiction , Science & Nature , Astronomy",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Don't Forget to Write",
        "Authors": "By Selway, Martina",
        "Description": "As she adds to the letter she is writing home, Rosie expresses her changing feelings about her visit to her grandfather's farm",
        "Category": "",
        "Publisher": "Ideals Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Capitol Offenders: How Private Interests Govern Our States",
        "Authors": "By Renzulli, Diane, Integrity, the Center for Public",
        "Description": "",
        "Category": "",
        "Publisher": "Public Integrity Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "You're Someone Special",
        "Authors": "By Narramore, Bruce",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "The Cage Bird Question and Answer Manual",
        "Authors": "By Alderton, David",
        "Description": "Provides guidelines for purchasing birds, constructing an aviary, proper diet, health care, and breeding information, and includes profiles of popular bird species.",
        "Category": " Pets , Birds",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Underdogs: Beauty Is More Than Fur Deep",
        "Authors": "By Dratfield, Jim",
        "Description": "The charming Chihuahua and the pugnacious pug. The graceful greyhound, the shaggy sheepdog, and the brazen bulldog. The miraculously mesmerizing mutt. These are not the dogs that are typically celebrated in dog books—those focus on the most popular purebreds: Labrador retrievers, Jack Russells, German shepherds Dalmatians. But where are the other breeds? And where are the non-breeds that make up more than half of the U.S. dog population, the mutts? Where is their book? If Americans love anything, it’s the underdog—every kind of underdog, whether it’s a dog or not. We recognize that beauty is more than skin deep—or fur deep. We appreciate dogs of indeterminate lineage, with mottled fur, too-large ears, or strange little bodies; we love dogs who look like impish little children or grumpy old men. Underdogs is their book—a celebration of funny faces and singular shapes, of uncommon breeds and unrecognized mixed-breeds. Underdogs is a charming, touching, and occasionally hilarious look at what we really love about dogs—the true companionship that comes from great character.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "What's Possible!",
        "Authors": "By Kagan, Daryn",
        "Description": "Introduces you to people who have dreamed big dreams and overcome daunting obstacles to achieve their goals, confronted challenges, and found new meaning and purpose in life as a result.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Orchard: A Memoir",
        "Authors": "By Robertson, Adele Crockett and Cramer, Betsy Robertson (INT)",
        "Description": "The Orchard is an exquisitely beautiful and poignant memoir of a young woman's single-handed struggle to save her New England farm in the depths of the Great Depression. Recently discovered by the author's daughter, it tells the story of Adele \"Kitty\" Robertson, young and energetic, but unprepared by her Radcliffe education for the rigors of apple farming in those bitter times. Alone at the end of a country road, with only a Great Dane for company, plagued by debts, broken machinery, and killing frosts, Kitty revives the old orchard after years of neglect. Every day is a struggle, but every day she is also rewarded by the beauty of the world and the unexpected kindness of neighbors and hired workers.Animated by quiet courage and simple goodness, The Orchard stands as a deeply moving celebration of decency and beauty in the midst of grim prospects and crushing poverty.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Dial Press Trade Paperback",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Titian",
        "Authors": "By Cecchi, Dario",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar, Straus and Cudahy",
        "Price Starting With ($)": "7.65",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Healthy Gourmet Cookbook (Healthy Gourmet Series)",
        "Authors": "By Hess, Mary Abbott, Johns, Pamela Sheldon, and Tougas, Jane Grant",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Collins Pub San Francisco",
        "Price Starting With ($)": "7.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Large 3-d Padded Pop-ups",
        "Authors": "By Bendon Publishing",
        "Description": "",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Bendon Pub Intl",
        "Price Starting With ($)": "6.16",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Empty Envelope (A to Z Mysteries)",
        "Authors": "By Gurney, John Steven (ILT) and Roy, Ron",
        "Description": "Help Dink, Josh, and Ruth Rose solve mysteries from A to Z!    Kids love collecting the entire alphabet and super editions! With over 8 million copies in print, the A to Z Mysteries® have been hooking chapter book readers on mysteries and reading for years. Now this classic kid favorite is back with a bright new look!   E is for Envelope . . . Who is sending letters to Dink? All week long, Dink has been getting strange mail. The envelopes are addressed to “D. Duncan,” but the letters inside are for someone named Doris. Plus, one envelope is empty! Could it be a secret code? And can Dink, Josh, and Ruth Rose crack it?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Time's Up (Beacon Street Girls #12)",
        "Authors": "By Bryant, Annie",
        "Description": "Katani's favorite magazine, T-Biz!, is running a contest for young entrepreneurs, and she can't wait to surprise her family and the BSG with a prize-winning entry. With the deadline just a week away, major school projects due, and a promise to knit twenty(!) scarves for a Think Pink! fund-raiser, Katani is running out of time.   It doesn't make things easier that Maeve has signed up for Betsy Fitzgerald's tutoring service. Betsy is Katani's competition! Katani wants to win the contest on her own, but she needs help -- and who can she turn to if not the BSG?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Secrets of a Fulfilled Woman: Finding True Contentment in Your Life",
        "Authors": "By Peretti, Barbara, Missler, Nancy, Thomas, Bonnie, Impe, Rexella Van, Barker, Barbara, McDowell, Dottie, Ankerberg, Darlene, Newbold, Elizabeth, and Perkins, Susie (COM)",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "New Leaf Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Managing UUCP and Usenet (A Nutshell Book)",
        "Authors": "By O'Reilly, Tim and Todino, Grace",
        "Description": "For all its widespread use, UUCP is one of the most difficult UNIX utilities to master. Poor documentation, cryptic messages, and differences between various implementations make setting up UUCP  links a nightmare for many a system administrator.This handbook is meant for system administrators who want to install  and manage the UUCP and Usenet software. It covers HoneyDanBer UUCP  as well as standard Version 2 UUCP, with special notes on Xenix. As  one reader noted over the Net, \"Don't even TRY to install UUCP  without it!\"Topics covered in Managing UUCP include:How UUCP works.RS-232 cabling.Talking with modems.Setting up a UUCP link.Security considerations.UUCP administration.Introduction to Usenet.Installing Netnews.Administering Netnews.The tenth edition of this classic work has been revised and expanded to include descriptions of:How to use NNTP (Network News Transfer Protocol) to transfer Usenet     news over TCP/IP and other high-speed networks.How to get DOS versions of UUCP.How to set up DOS-based laptop computers as traveling UUCP nodes.How the UUCP 'g' protocol works.",
        "Category": " Computers , Networking , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Country Decorating With Fabric Crafts",
        "Authors": "By Linsley, Leslie",
        "Description": "Emphasizing quick-and-easy ideas, this guide features clear instructions, patterns, and diagrams for a variety of home accessories made from fabric scraps, including a wool coverlet, a barnyard crib quilt, a Christmas placemat, and numerous pillows",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Victory Garden Kids Book P/Bnstsid",
        "Authors": "By Ulrich, George (ILT) and Waters, Marjorie",
        "Description": "Uses the experiences of a group of children, aged three to thirteen, working through an entire season in their own garden, as a background for general information on buying plants and seeds, using tools, planting and watering, and picking the harvest.Covering all aspects of an entire gardening season, this guide offers plans for a Yardstick Garden for younger children while older children can follow step-by-step instructions for thirty easy-to-grow crops",
        "Category": " Gardening , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Big Book of Afghans",
        "Authors": "By Feldman, Annette",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "Discovering the Writer Within: 40 Days to More Imaginative Writing",
        "Authors": "By Ballenger, Bruce and Lane, Barry",
        "Description": "Discover the writer inside you who only needs encouragement to turn the secret thoughts and special moments of your life into enduring words on a page.This 40-day \"workout program\" of imagination-stretching exercises will let you throw open all your inner doors, release your creativity, discover surprising connections and spark fresh ideas. By turns sober, off-the-wall, deeply emotional, thoughtful and playful, these exercises will nudge your originality into stimulating explorations. For example, you'll learn how to find something fresh and exciting about such unremarkable places as a shopping mall, a McDonald's, a bank (Day 9); write punchy first sentences for imaginary stories: mysteries, thrillers, romances, news accounts (Day 15); retell a classic fairy tale - like \"The Three Little Pigs\" - from a different viewpoint: the wolf, the wolf's psychologist, the third pig's stockbroker (Day 20); and give a voice to inanimate objects (such as a household appliance) and find out what they'd say if given the chance (Day 23).In an enjoyable, entertaining way, these 40 exercises guide you in such essential techniques as brainstorming, clustering, freewriting and revision. Whether you're a hesitant beginning writer or an experienced writer whose wellspring of wonder seems suddenly dry, this book will recharge and refresh your imagination and liberate you, through confident, effective writing, to follow wherever your dreams may lead.",
        "Category": " Reference , Writing Skills",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Small Business Bible: The Make-or-Break Factors for Survival and Success",
        "Authors": "By Resnik, Paul",
        "Description": "Authoritatively treats the basics of small business, focusing on the truly crucial concerns of the owner-manager. Covers the broader issues of how to keep the business simple and focused, how to assess the relative strengths and weaknesses one brings to the business, how to manage growth and how to develop an appropriate business plan. Also addresses more specifically how to select a top-notch operations oriented accountant and establish effective internal controls systems, how to manage cash availability/cash flow, how to develop a pricing strategy, and how to manage staff.",
        "Category": " Business & Economics , Small Business",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Furniture of the Pilgrim Century, Vol. 2",
        "Authors": "By Nutting, Wallace",
        "Description": "",
        "Category": "",
        "Publisher": "Dover Publications, Inc.",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "December",
            "Year": "1965"
        }
    },
    {
        "Title": "Servant of Truth: Messages of John Paul II (Vol 2: December 1978 - March 1979)",
        "Authors": "By John Paul",
        "Description": "",
        "Category": "",
        "Publisher": "St. Paul Editions",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Mystery on the Mississippi",
        "Authors": "By Kathryn Kenny",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Low Fat Cooking On The Grill",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "TIME LIFE BOOKS @",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Plague (My Side of the Story)",
        "Authors": "By Wooderson, Philip",
        "Description": "My Side of the Story is a completely unique approach to historical fiction. Read the story of one youngster's life in turbulent times, then flip the book and find out firsthand how another child reacts to the conclusion of events-with very different feelings and ideas!Rachel is a young girl living in London in 1665. The dreaded disease, the plague, is taking hold of the city, and everyone is fearful for his or her life. Rachel and her best friend, Robert, worry they might be next in line. Then the unthinkable happens-Rachel becomes infected . . .Robert's father forbids him to see his best friend, Rachel, in case he falls victim to the plague too. But Robert won't just sit back and let his friend die. Can their friendship survive during this dark, dark hour in England's history?",
        "Category": " Juvenile Fiction , Historical , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "7.93",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Golden Book of American Wildflowers",
        "Authors": "By Rickett, Harold W.",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "Talking to Your Children About Being Catholic",
        "Authors": "By Kreeft, Peter",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Our Sunday Visitor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Women Who Changed the World: Fifty Inspirational Woman Who Shaped History",
        "Authors": "By Smith Davies Publishing",
        "Description": "Progressing through history, from Cleopatra and Mary Magdalene to Madonna and Diana, Princess of Wales, each of these exceptional women's stories is told against the backdrop of the events of their time. For each, we learn of their achievements, backgrounds, characters and little-known details that make them ever more remarkable.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Smith-Davies",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "A Landmark Restored: The Cathedral of St. Matthew the Apostle",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Meadows Press",
        "Price Starting With ($)": "19.97",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Gulliver's Travels (Troll Illustrated Classics)",
        "Authors": "By Schindler, S. D. (ILT), Swift, Jonathan, and James, Raymond",
        "Description": "Shipwrecked and cast adrift, Lemuel Gulliver wakes to find himself in Lilliput, an island inhabited by little people, whose six-inch height makes their quarrels over fashion and fame seem ridiculous. His subsequent encounters - with the crude giants of Brobdingnag, the abstracted scientists of Laputa, the philosophical Houyhnhnms and brutish Yahoos - give Gulliver new, bitter insights into human behaviour.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Mexican National Museum of Anthropology",
        "Authors": "By Bernal, Ignacio",
        "Description": "",
        "Category": "",
        "Publisher": "Thames and Hudson",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "16 Lighthouse Road (A Cedar Cove Novel, 1)",
        "Authors": "By Macomber, Debbie",
        "Description": "Olivia Lockhart16 Lighthouse RoadCedar Cove, WashingtonDear Reader,You don't know me yet, but in a few hours that's going to change. You see, I'm inviting you to my home and my town of Cedar Cove because I want you to meet my family, friends and neighbors. Come and hear their stories—maybe even their secrets!I have to admit that my own secrets are pretty open. My marriage failed some years ago, and I have a rather…difficult relationship with my daughter, Justine. Then there's my mother, Charlotte, who has plenty of opinions and is always willing to share them.Here's an example: I'm a family court judge and she likes to drop in on my courtroom. Recently I was hearing a divorce petition.In Charlotte's view, young Cecilia and Ian Randall hadn't tried hard enough to make their marriage work—and I agreed. So I rendered my judgment: Divorce Denied.Well, you wouldn't believe the reaction! Thanks to an article by Jack Griffin, the editor of our local paper (and a man I wouldn't mind seeing more of!), everyone's talking.Cedar Cove—people love it and sometimes they leave it, but they never forget it!See you soon…Olivia",
        "Category": " Fiction , Women",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Student's Vegetarian Cookbook, Revised: Quick, Easy, Cheap, and Tasty Vegetarian Recipes",
        "Authors": "By Raymond, Carole",
        "Description": "With vegetarian eating on the rise and with more young adults adopting this lifestyle, Student's Vegetarian Cookbook, Revised provides the means for developing healthy, low-fat meals that are quick, easy, and inexpensive to prepare. This cookbook will include a wealth of new and updated recipes, new health information including food source charts, and a new section of resources.Fully updated and revised, some of the new recipes (and revised old favorites) in the book include:* Simple sushi recipe* Drink recipes for tea including Chai* Stuffed Green Peppers* Filling Stews* Tofu No-Egg Salad* Sweet Potato Fries* Popcorn with Crumbled Toasted Nori* Pizza Revised—simpler and BETTER* Lazy Lasagne RevisedThis book will also include savvy tips for grocery shopping and how to choose produce, simple cooking techniques (and new pointers),and a chapter on shortcut recipes.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Maine Off the Beaten Path®: A Guide to Unique Places (Off the Beaten Path Series)",
        "Authors": "By Curtis, Wayne",
        "Description": "",
        "Category": " Travel , United States , Northeast , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Strong at the Broken Places: Voices of Illness, a Chorus of Hope",
        "Authors": "By Cohen, Richard M.",
        "Description": "Strong at the Broken Places is the remarkable story of five ordinary people trapped in the complex world of serious chronic illness. In this intimate portrait, acclaimed journalist Richard M. Cohen probes lives of sickness as these individuals struggle to cope.In 2003 Cohen published Blindsided, a bestselling memoir of illness. The outpouring of support revealed to him that not only does the public want to hear from people who overcome the challenges of illness, but that in the isolated world of illness, there are people who want their voices to be heard. Strong at the Broken Places was born of the desire of many to share their stories in the hope that the sick and those who love them will see that they are not alone.Cohen spent three years chronicling the lives of five diverse \"citizens of sickness\": Denise, who suffers from ALS; Buzz, whose Christian faith helps him deal with his non-Hodgkin's lymphoma; Sarah, a determined young woman with Crohn's disease; Ben, a college student with muscular dystrophy; Larry, whose bipolar disorder is hidden within. The five are different in age and gender, race and economic status, but they are determined to live life on their own terms. Intimately involved with these patients' lives, Cohen formed intense relationships with each, talked to their families and friends, and shared joy, even in heart-breaking setbacks.Though each individual's illness wreaks havoc in a different way, Cohen shows how their experiences are strikingly similar and offer lessons for us all—on self-determination, on courage in the face of adversity and public ignorance, on keeping hope alive, and on finding strength and peace under the most difficult of circumstances.We are strong at the broken places, stronger than we think. In sharing these inspirational and revealing stories, Richard M. Cohen and his fellow warriors against illness offer a chorus of hope.",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Bridal Season",
        "Authors": "By Brockway, Connie",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "365 Great Barbecue and Grilling Recipes",
        "Authors": "By Gandar, Lonnie",
        "Description": "",
        "Category": "",
        "Publisher": "Scranton, Pennsylvania, U.S.A.: Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Saints: Seventy Stories of Faith",
        "Authors": "By Bonfante-Warren, Alexandra",
        "Description": "",
        "Category": " Religion , Faith",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Magic of JELL-O",
        "Authors": "By Mary Merlihan",
        "Description": "",
        "Category": "",
        "Publisher": "Time, Incorporated Home Entertainment",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Ocean Liners",
        "Authors": "By Miller, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Bdd Promotional Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "First Course in Differential Equations",
        "Authors": "By Hagin, Frank G.",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1975"
        }
    },
    {
        "Title": "Applying RCS and SCCS: From Source Control to Project Control (Nutshell Handbooks)",
        "Authors": "By Bolinger, Don and Bronson, Tan",
        "Description": "Now there's a book that gives you some help managing your project's source files. Applying RCS and SCCS is a thorough introduction to the two most popular source control systems under UNIX. The authors of this book take you from basic source control of a single file, through working with multiple releases of a software project, to coordinating teams of developers on a project involving many files and more than one target platform.The authors go well beyond lists of commands and command options: they help you define the problem you're really trying to solve, and then they show you how to solve it.This book also presents TCCS, a representative \"front-end\" to RCS and SCCS that addresses problems RCS and SCCS can't handle alone, such as managing groups of files, developing for multiple platforms, and linking public and private development areas.If you're a programmer or a software project manager, this book should be required reading.",
        "Category": " Computers , Operating Systems , UNIX",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "What's in the Bible About God?: What's in the Bible and Why Should I Care? (Why Is That in the Bible and Why Should I Care?)",
        "Authors": "By Finley, Jeanne Torrence",
        "Description": "This Bible study helps you to explore who God is and how God relates to us. Each chapter contains the following features: Bible readings, Questions, A psalm, A prayer, What's in the Bible, Reflection questions, Bible facts and Here's why I care.",
        "Category": " Religion , Biblical Studies , Old Testament",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Dispatches from a Not-So-Perfect Life: Or How I Learned to Love the House, the Man, the Child",
        "Authors": "By Fox, Faulkner",
        "Description": "When Salon.com published Faulkner Fox’s article on motherhood, “What I Learned from Losing My Mind,” the response was so overwhelming that Salon reran the piece twice. The experience made Faulkner realize that she was not alone—that the country is full of women who are anxious and conflicted about their roles as mothers and wives.In Dispatches from a Not-So-Perfect Life, her provocative, brutally honest, and often hilarious memoir of motherhood, Faulkner explores the causes of her unhappiness, as well as the societal and cultural forces that American mothers have to contend with. From the time of her first pregnancy, Faulkner found herself—and her body—scrutinized by doctors, friends, strangers, and, perhaps most of all, herself. In addition to the significant social pressures of raising the perfect child and being the perfect mom, Faulkner also found herself increasingly incensed by the unequal distribution of household labor and infuriated by the gender inequity in both her home and others’. And though she loves her children and her husband passionately, is thankful for her bountiful middle-class life, and feels wracked with guilt for being unhappy, she just can’t seem to experience the sense of satisfaction that she thought would come with the package. She’s finally got it all—the husband, the house, the kids, an interesting part-time job, even a few hours a week to write—so why does she feel so conflicted?Faulkner sheds light on the fear, confusion, and isolation experienced by many new mothers, mapping the terrain of contemporary domesticity, marriage, and motherhood in a voice that is candid, irreverent, and deeply personal, while always chronicling the unparalleled joy she and other mothers take in their children.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Captain's Dog: My Journey with the Lewis and Clark Tribe",
        "Authors": "By Smith, Roland",
        "Description": "Born the runt of his litter and gambled away to a rusty old river man, the Newfoundland pup Seaman doesn’t imagine his life will be marked by any kind of glory. But when he meets Captain Meriwether Lewis, Seaman finds himself on a path that will make history. Lewis is setting off on his landmark search for the Northwest Passage, and he takes Seaman along. Sharing the curiosity and spirit of his new master, the intrepid dog proves himself a valuable companion at every turn.      Part history, part science—and all adventure—this is the thrilling tale of America’s greatest journey of discovery.     Includes an author’s note and a reader’s guide.",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Pets Living With Cancer: A Pet Owner's Resource",
        "Authors": "By Downing, Robin",
        "Description": "",
        "Category": " Pets , Reference",
        "Publisher": "AAHA Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Organizing Projects for Success (Human Aspects of Project Management) (Human Aspects of Project Management, Volume One)",
        "Authors": "By Verma, Vijay K.",
        "Description": "",
        "Category": " Business & Economics , Project Management",
        "Publisher": "Project Management Institute",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Frommer's Memorable Walks in London",
        "Authors": "By Jones, Richard",
        "Description": "11 Great Walking Tours Through the City's Most Colorful Neighborhoods Follow Frommer's for an up-close and personal look at London?from the ancient streets of the City to Chelsea's hippest hangouts. We'll show you London as you've never seen it before! Among the highlights:London's most atmospheric pubs, including the notorious 17th-century \"Bucket of Blood\" and the Polar Bear Pub, where the Rolling Stones rehearsedThe homes and hangouts of London's most famous?and infamous?literary figures: Dickens, Keats, Wilde, Carlyle, the Bloomsbury group, Marx, and moreSir Christopher Wren's most magnificent structures, including St. Paul's CathedralTrendy Soho, where you'll find Swinging London's beatnik, red-light, and rock ?n? roll heritageThe shops of aristocratic St. James's, where you can buy anything from tea to topcoatsWith easy-to-use directions and maps?and the best places to take a break along the way It's a Whole New World with Frommer's. Find us online at www.frommers.com",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Raped",
        "Authors": "By Roberts, Deborah",
        "Description": "A rape victim tells of her attack, its aftermath, and how her faith in God enabled her to overcome the experience",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "The Usborne Round the World Cookbook",
        "Authors": "By Caroline Young",
        "Description": "",
        "Category": "",
        "Publisher": "Educational Development Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Crazy Plates: Low-Fat Food So Good, You'll Swear It's Bad for You!",
        "Authors": "By Podleski, Janet and Podleski, Greta",
        "Description": "The best-selling authors of Looneyspoons present a delectable new collection of healthful, taste-tempting recipes that include up-to-date nutritional information on each dish, special sections on diet and lifestyle, personal responses to fan questions, intriguing food facts and trivia, and more. Original.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Treasures From Yesteryear - Book 1 (Making Quilts from Vintage Blocks, Book 1)",
        "Authors": "By Newman, Sharon",
        "Description": "Treasures From Yesteryear - Book 1",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "That Patchwork Place",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Treasures of Irish art, 1500 B.C.-1500 A.D: From the collections of the National Museum of Ireland, Royal Irish Academy, Trinity College, Dublin",
        "Authors": "By Mitchell, Frank G.",
        "Description": "",
        "Category": "",
        "Publisher": "A.A. Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Tracing Your Scottish Ancestors",
        "Authors": "By Sinclair, Cecil",
        "Description": "",
        "Category": "",
        "Publisher": "The Stationery Office/Tso",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "LifeBooks : Creating a Treasure for the Adopted Child",
        "Authors": "By O'Malley, Beth",
        "Description": "",
        "Category": " Social Science , Human Services",
        "Publisher": "Adoption-Works Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    }
]