[
    {
        "Title": "Fluffy And The Fire Fighters (level 3) (Hello Reader)",
        "Authors": "By Smith, Mavis (ILT) and McMullan, Kate",
        "Description": "After firefighters visit Ms. Day's classroom, Fluffy the classroom guinea pig gets a chance to see what they do firsthand. Original.",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Daniel (ELLIE'S PEOPLE)",
        "Authors": "By Borntrager, Mary Christner",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Herald Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "From Standards to Success: A Guide for School Leaders",
        "Authors": "By O'shea, Mark R.",
        "Description": "O'Shea (education, California State University-Monterey Bay) introduces the Standards Achievement Planning Cycle (SAPC), a protocol for meeting state educational standards. To illustrate his approach, he takes readers to a fictional school as it prepares to install the SAPC. He outlines methods for identifying which standards are most important, selecting appropriate curriculum materials, providing instructional planning time for teachers, and designing effective professional development. Chapter checklists highlight best practices, and sample lessons show how to plan a curriculum that enables students to meet state standards. Annotation ©2005 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Leadership",
        "Publisher": "ASCD",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Listen! The Wind",
        "Authors": "By Anne Morrow Lindbergh",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt, Brace",
        "Price Starting With ($)": "11.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1938"
        }
    },
    {
        "Title": "The Long Man (The Max August Magikal Thrillers)",
        "Authors": "By Englehart, Steve",
        "Description": "In The Point Man, DJ Max August was thrust into a hidden war between the forces of chaos and order, where he learned how to use magick and become Timeless! More than twenty-five years later, Max is summoned by a friend to save Dr. Pamela Blackwell from a mysterious force that is using magick to kill her. Pam’s research could save the lives of countless millions, putting her in the crosshairs of the FRC, a cabal of powerbrokers intent on world domination.From San Francisco to Barbados to the shores of Suriname, Max and Pam must fight off magick-wielding assassins and legions of zombies. Max may be powerful and Timeless, but he’s not indestructible. He’s going to have to keep his wits about him if he’s going to stop the FRC before they kill millions.Supernatural enemies, dazzling magic, and romance abound in this page-turner from a longtime master of storytelling.",
        "Category": " Fiction , War & Military",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "16.46",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Edinburgh Castle (Official Guides)",
        "Authors": "By Fawcett, Richard, MacIvor, Iain, Petersen, Bent",
        "Description": "",
        "Category": "",
        "Publisher": "Stationery Office Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Encyclopedia of Opera",
        "Authors": "By Orrey, Leslie (EDT) and Chase, Gilbert (EDT)",
        "Description": "A comprehensive guide to operas, operettas, and musicals, covering composers, librettists, singers, conductors, designers, producers, houses, festivals, and technical terms and emphasizing works and performers important today",
        "Category": " Music , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "New (A Traditional Nursery Rhyme)",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Waterford Institute",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Art of Trust: Healing Your Heart and Opening Your Mind",
        "Authors": "By Jampolsky, Lee L.",
        "Description": "",
        "Category": " Psychology , Personality",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Let's Read About-- George Washington (Scholastic First Biographies)",
        "Authors": "By Weinberger, Kimberly and Doucet, Bob (ILT)",
        "Description": "A simple biography of the first president of the United States.",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "9.67",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Bravo, Amelia Bedelia",
        "Authors": "By Sweat, Lynn (ILT) and Parish, Herman",
        "Description": "When Mrs. Rogers sends Amelia Bedelia to the station to pick up the conductor for the school concert, she doesn't expect her to bring back the train conductor.  As usual, Amelia Bedelia has gotten things all mixed up in her latest hilarious adventure.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "GreenWilBk",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Black Out!: Animals That Live in the Dark: Animals That Live in the Dark (Penguin Young Readers, Level 3)",
        "Authors": "By Mueller, Pete (ILT) and Clarke, Ginjer",
        "Description": "Did you know that the luna moth only flutters around at night--or that is has a wingspan as wide as a bowl of soup? This reader is packed with interesting facts about all the creepy animals that we never get to see during the daytime, like the barn owl, the blind cave fish, and the vampire squid.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "All Rivers Run to the Sea: Memoirs (Memoirs of Elie Wiesel)",
        "Authors": "By Wiesel, Elie",
        "Description": "In this first volume of his two-volume autobiography, Wiesel takes us from his childhood memories of a traditional and loving Jewish family in the Romanian village of Sighet through the horrors of Auschwitz and Buchenwald and the years of spiritual struggle, to his emergence as a witness for the Holocaust's martyrs and survivors and for the State of Israel, and as a spokesman for humanity.  With 16 pages of black-and-white photographs.\"From the abyss of the death camps Wiesel has come as a messenger to mankind—not with a message of hate and revenge, but with one of brotherhood and atonement.\"—From the citation for the 1986 Nobel Peace Prize",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Schocken",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Walks of Jesus",
        "Authors": "By Lewis, Bessie Conway",
        "Description": "",
        "Category": "",
        "Publisher": "John Knox Press",
        "Price Starting With ($)": "10.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Stratford Upon Avon and the Shakespeare Country",
        "Authors": "By Levi Fox",
        "Description": "",
        "Category": "",
        "Publisher": "Cotman House",
        "Price Starting With ($)": "8.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Torn (Blood Lily Chronicles, Book 2)",
        "Authors": "By Kenner, Julie",
        "Description": "Lily is in trouble of the deepest kind. Having been tricked by the forces of evil, she killed what she thought were \"demons\" at will. Now, she knows better, and with a little help from half-angel, half-demon Deacon Camphire, she must try to take down the bad guys from within as a double agent.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "What's a Ghoul to Do? (Ghost Hunter Mysteries, Book 1)",
        "Authors": "By Laurie, Victoria",
        "Description": "M.J., her partner Gilley, and their client, the wealthy, de-lish Dr. Steven Sable, are at his family's lodge, where his grandfather allegedly jumped to his death from the roof-although Sable says it was foul play. But the patriarch's isn't the only ghost around. The place is lousy with souls, all with something to get off their ghoulish chests. Now M.J. will have to to quell the clamor-and listen for a voice with the answers...",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "What is Redaction Criticism?",
        "Authors": "By Norman Perrin",
        "Description": "",
        "Category": "",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Fodor's Citypack Rome, 3rd Edition (Citypacks)",
        "Authors": "By Fodor's Travel Publications, Inc. (EDT)",
        "Description": "Fodor's Citypack Rome 3ed\"The one to take along...\" -- Home News Tribune\"Rich assortment of hotel, restaurant, and entertainment options make these very atractive portables.\" -- National Geographic TravelerThese ingenious city guides package a concise full-color miniguide together with a full-size color map in a sturdy plastic sleeve.  This convenient two-in-one travel resource is perfect for the on-the-go traveler who only needs the highlights in brief.The MiniguideColor photos throughoutThe top 25 attractionsItineraries, walks, tours, and excursionsCapsule reviews of key hotels, restaurants, shops, nightlife, and moreConcise travel facts about getting there and getting aroundThe Foldout MapDetailed city coverage in full colorFully indexedNeighborhood blowupsPublic transport, hotels, points of interest, parks, and more -- all listed on mapEasy to store in durable plastic sleeve",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Sister Sweet Ella",
        "Authors": "By Hoffman, Rosekrans",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Graduate to Greatness: A Life Commencement Message",
        "Authors": "By Andrew James",
        "Description": "",
        "Category": "",
        "Publisher": "Spire Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Cocktail Bible: Traditional and Modern Cocktails for Every Occasion",
        "Authors": "By Doeser, Linda and Linton, Chris (PHT)",
        "Description": "",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Rhine-Guide from Mainz to Cologne",
        "Authors": "By Wolfgang Kootz",
        "Description": "",
        "Category": "",
        "Publisher": "Edm. von Konig-Verlag",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Big Field",
        "Authors": "By Lupica, Mike",
        "Description": "From the #1 New York Times bestselling author of Heat, Travel Team and Million-Dollar Throw.Playing shortstop is a way of life for Hutch—not only is his hero, Derek Jeter, a shortstop, but so was his father, a former local legend turned pro. Which is why having to play second base feels like demotion to second team. Yet that's where Hutch ends up after Darryl \"D-Will\" Williams, the best shortstop prospect since A-Rod, joins the team. But Hutch is nothing if not a team player, and he's cool with playing in D-Will's shadow—until, that is, the two shortstops in Hutch's life betray him in a way he never could have imagined. With the league championship on the line, just how far is Hutch willing to bend to be a good teammate?",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Catholic for a Reason: Scripture and the Mystery of the Family of God",
        "Authors": "By Hahn, Scott (EDT) and Suprenant, Leon J. (EDT)",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Emmaus Road Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Seeing Me Naked",
        "Authors": "By Palmer, Liza",
        "Description": "Elisabeth Page is the daughter of Ben Page, yes, that's right, THE world famous novelist. And yes, she's also the sister of Rascal Page, world famous novelist in his own right. So what does Elisabeth do? Much to her family's disappointment, Elisabeth is a pastry chef. And a pretty damn good one, at Beverly, the hottest restaurant in LA. The last relationship Elisabeth had was with Will, a man she grew up with and whose family ran in the same social circles as her family. But Will's constant jaunts around the world have left her lonely and brokenhearted in L.A. That is until Daniel Sullivan bids on one of Elisabeth's pastry tutorials at a charity auction. Daniel is everything her family is not: a basketball coach, a non-intellectual, his family doesn't summer on Martha's Vineyard, and the only metaphors he uses are about passing the ball and being a team player. But somehow they fit. Between her family, Will, and the new cooking show that Elisabeth is recruited to star in, Elisabeth's life is suddenly incredibly new and different--the question is, can she embrace being happy or has her family conditioned her to think she's just not good enough?Liza Palmer expertly depicts a woman trying to come to terms with professional success, personal success, and finally dealing with a family that might love her from the bottom of their heart but doesn't necessarily have her best interest always at heart.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "5 Spot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Geek Charming",
        "Authors": "By Palmer, Robin",
        "Description": "The ideal L.A. fairy tale for fans of Once Upon a Time and L.A. Candy!Inspiration for the Disney Channel TV movie, Geek Charming!Dylan Shoenfield is the princess of L.A.'s posh Castle Heights High. She has the coolest boyfriend, the most popular friends, and a brand-new 'it' bag that everyone covets. But when she accidentally tosses her bag into a fountain, this princess comes face-to-face with her own personal frog: self professed film geek Josh Rosen. In return for rescuing Dylan's bag, Josh convinces Dylan to let him film her for his documentary on high school popularity. Reluctantly, Dylan lets F-list Josh into her A-list world, and is shocked to realize that sometimes nerds can be pretty cool. But when Dylan's so-called prince charming of a boyfriend dumps her flat, her life--and her social status--comes to a crashing halt. Can Dylan--with Josh's help--pull the pieces together to create her own happily-ever-after?",
        "Category": " Young Adult Fiction , Romance , General",
        "Publisher": "Speak",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Poltergeist (Greywalker, Book 2)",
        "Authors": "By Richardson, Kat",
        "Description": "Harper Blaine is a Greywalker-walking the thin line between the living world and the paranormal realm. She's been hired by a university research group that's attempting to create an artificial poltergeist. But when one of the group's members is found killed, Harper must determine whether the killer is the ghost itself, or someone all too human...",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The Secret Garden (Classic Starts)",
        "Authors": "By Corvino, Lucy (ILT), Hailey, Martha, and Dubose, Martha Hailey",
        "Description": "Following Sterling's spectacularly successful launch of its children's classic novels (240,000 books in print to date),comes a dazzling new series: Classic Starts. The stories are abridged; the quality is complete. Classic Starts treats the world's beloved tales (and children) with the respect they deserve--all at an incomparable price.The discovery of a neglected garden transforms the life of a sullen and unloved little girl-and everyone around her, too. When the newly orphaned Mary Lennox leaves her native India and arrives at her uncle's mansion in Yorkshire, everything seems strange to her. Then Mary hears of a mysterious garden where no one has set foot in 10 years. With the help of some new friends, she plans to uncover its secrets...and make it blossom once again.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Even Brook Trout Get The Blues",
        "Authors": "By Gierach, John and Wolff, Glenn (ILT)",
        "Description": "Brilliant, witty, perceptive essays about fly-fishing, the natural world, and life in general by the acknowledged master of fishing writers.“Once an angler has become serious about the sport (and ‘serious’ is the word that’s used), he’ll never again have enough tackle or enough time to use it. And his nonangling friends and family may never again entirely recognize him, either.” In other words, he (or she) will have entered Gierach territory. And fishermen who choose to brave the crowds at the big hold, commune with the buddies at the “family pool,” or even wade into questionable waters in the dark of night are sure to recognize themselves in Even Brook Trout Get the Blues.Whether debating bamboo versus graphite rods, describing the pleasure of fishing in pocket waters or during a spring snow in the mountains, or recounting a trip in pursuit of the “fascinatingly ugly” longnose gar, Gierach understands that fly-fishing is more than a sport. It’s a way of life in which patience is (mostly) rewarded, the rhythms of the natural world are appreciated, and the search for the perfect rod or ideal stream is never ending. It is not a life without risks, for as Gierach warns: “This perspective on things can change you irreparably. If it comes to you early enough in life, it can save you from ever becoming what they call ‘normal.’” Even Brook Trout Get the Blues will convince you that “normal” is greatly overrated.",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Adventures of Tom Sawyer (Classic Starts)",
        "Authors": "By Twain, Mark, Corvino, Lucy (ILT), and Woodside, Martin",
        "Description": "Following Sterling's spectacularly successful launch of its children's classic novels (240,000 books in print to date),comes a dazzling new series: Classic Starts. The stories are abridged; the quality is complete. Classic Starts treats the world's beloved tales (and children) with the respect they deserve--all at an incomparable price.\"Tom Sawyer liked adventures, which means he was always getting in trouble.\" Searching for treasure, witnessing a murder, getting caught in a bat cave, tricking others into doing his work, running away with Huckleberry Finn--Tom Sawyer's antics and mischief-making are sheer, child-pleasing delight. Every boy and girl should experience the joy and fun of this classic tale.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Precious Treasure",
        "Authors": "By Matthews, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Emmaus Road Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "From Caterpillar to Butterfly  (Let's-Read-and-Find-Out Science, Stage 1)",
        "Authors": "By Heiligman, Deborah",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Beyond the Sky and the Earth: A Journey into Bhutan",
        "Authors": "By Zeppa, Jamie",
        "Description": "Jamie Zeppa was 24 when she left a stagnant life at home and signed a contract to teach for two years in the Buddhist hermit kingdom of Bhutan. Much more than just a travel memoir, Beyond the Sky and the Earth is the story of her time in a Himalayan village, immersed in Bhutanese culture and the wonders of new and lasting love. Whether you're travelling to Bhutan, looking for the best travel writing around, or wishing to be transported to a culture, mindset, and spiritual ethos wonderfully different from your own, Beyond the Sky and the Earth is a joyous and lush memoir that will transform the way you think of faith, Western life, and love.",
        "Category": " Travel , Asia , Southeast",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "9.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Writing Smart, 2nd Edition (Smart Guides)",
        "Authors": "By Lerner, Marcia",
        "Description": "Eventually, we all have to do it: Write a professional letter, a research paper, a proposal, a personal essay...  The list goes on and on and the tasks can often seem overwhelming, especially when one isn't sure how to approach them.Organizing one's thoughts on paper may seem daunting, but there is no reason to worry, Writing Smart will walk them through it -- from planning their work and writing the first few sentences to editing it and making the finishing touches.  Writing Smart will teach readers how to take the stress out of writing, whether they're writing a tricky business letter or a college application essay.Includes sections on:• Grammar• Getting ready to write• Words, Punctuation, Sentences, and Paragraphs• Editing• Personal Essays• Reviews, Articles, and Essay Tests• Research Papers• Professional Letters• Lab Reports• Project Proposals",
        "Category": " Reference , General",
        "Publisher": "Princeton Review",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Taylor's Pocket Guide to Perennials for Sun",
        "Authors": "By Oster, Maggie (EDT)",
        "Description": "Easy to grow, perennials are many gardeners' favorite class of plant. Peonies, irises, poppies, delphinium, and chrysanthemums are all featured. Tips for choosing plants, preparing the soil, and fertilizing are included.",
        "Category": " Gardening , Flowers , Perennials",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Taylor's Pocket Guide to Perennials for Shade",
        "Authors": "By Reilly, Ann (EDT)",
        "Description": "Offers expert advice on selecting, planting, and maintaining perennials that flourish in the shade, and provides tips for growing 79 perennials, including lupines, Virginia bluebells, primroses, and violets",
        "Category": " Gardening , Flowers , Perennials",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Children's Planet Earth Encyclopedia",
        "Authors": "By Green, Jen",
        "Description": "Presents general information about Earth such as its composition, geography, and how different types of severe weather can affect its make-up.",
        "Category": " Juvenile Nonfiction , Reference , Encyclopedias",
        "Publisher": "Parragon Books",
        "Price Starting With ($)": "5.73",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "New Classic Style: Mixing Modern and Traditional for a Fresh New Look (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books and Ingham, Vicki L. (EDT)",
        "Description": "Modern, the style of the late 1920s to the early 1960s, is enjoying a resurgence of popularity as people find comfort in pieces from the past. This book shows readers how to blend modern with other periods and styles to create a look that’s current, comfortable, and personal.Whole-house tours illustrate modern mixes:Fine antiques spiced with modern classics Clean-lined shapes for uncluttered interiorsComfortable combinations for family livingSpecial features make it easy to recognize good pieces and use them effectivelyIllustrated primer of modern and traditional shapes:What makes a modern mix workWho’s who in modern design Includes 14 whole-house toursIt’s the handbook on picking from the past to create the look of the future:Harmonies of shape and line Contrasts in textures and materials Using fabrics, textiles, and color",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Be Daring (Acts 13-28): Put Your Faith Where the Action Is (The BE Series Commentary)",
        "Authors": "By Wiersbe, Warren W.",
        "Description": "Why go through life as a spectator?  In this practical study of Acts 13-28, Dr. Wiersbe explains how God equips     and calls ordinary people to do extraordinary tasks. He answers such questions     as:      ? What is a call to service?      ? How does God equip His servants?      ? How can I determine His will for my life?      ? What is God's program for world outreach?   Don't just watch what's happening! Be a dynamic part of the excitement     and action of Christian service right where you are. Yes, it's time to BE DARING.  Dr. Warren W. Wiersbe is best known as an author, pastor, and radio Bible     teacher. He was for many years pastor of Chicago's Moody Memorial Church and     most recently served as General Director and Bible teacher for Back to the Bible.     He has authored over 100 books, including the New Testament \"Be\" series from     Victor Books.",
        "Category": " Religion , Biblical Commentary , New Testament",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "The Secret Circle: The Captive Part II and The Power",
        "Authors": "By Smith, L. J.",
        "Description": "With love, witchcraft, and spellbinding drama, the Secret Circle series is perfect for fans of The Vampire Diaries. This special paperback bind-up contains part two of the second book in the Secret Circle series, The Captive, and the final book in the series, The Power; from L.J. Smith, the New York Times bestselling author of The Vampire Diaries.Lured into the most powerful and deadly in-crowd imaginable, Cassie has learned that her power comes with a price—and it’s more dangerous than she knows. Torn between the dueling desires of the two most powerful members of The Secret Circle, she must ultimately choose between saving all of New Salem, and her own love for the bewitching Adam, which threatens to tear the circle apart. In the ultimate battle between good and evil, will Cassie’s supernatural powers be strong enough to lead the coven out of danger? Or will she fall prey to the dark forces within?",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2012"
        }
    },
    {
        "Title": "What's Happening to Me?: Girls Edition",
        "Authors": "By Chisholm, Jane (EDT), Meredith, Susan, and Leschnikoff, Nancy (ILT)",
        "Description": "A guide to puberty for girls covers the physical and emotional changes and describes the necessary hygiene routines.",
        "Category": " Juvenile Nonfiction , Health & Daily Living , Maturing",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "In Search Of The Dark Ages",
        "Authors": "By Wood, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Be Comforted (Isaiah): Feeling Secure in the Arms of God (The BE Series Commentary)",
        "Authors": "By Wiersbe, Warren W.",
        "Description": "Where Do You Turn for Comfort When . . . ? Circumstances frighten you?    ? Sin makes you feel guilty?    ? All your plans fall apart?    ? The future holds no hope?  \"Comfort, comfort My people!\" was the good news the Prophet Isaiah proclaimed     to God's people centuries ago, and his message still applies today. Isaiah not     only reveals God's prophetic plan for Israel, but also God's power and peace     for all who will trust Him. In this practical study, Warren Wiersbe shows you how God can help you: ? Find strength and comfort in times of trial    ? Conquer fear when your world is shaking    ? Enjoy a rich worship experience with God    ? Experience God's comfort and love \"As one whom his mother comforts, so I will comfort you\" is God's promise (Isaiah     66:13).",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Be Committed (Ruth, Esther): Doing God's Will Whatever the Cost (The BE Series Commentary)",
        "Authors": "By Wiersbe, Warren W.",
        "Description": "An Old Testament Study-Ruth and Esther    Be Committed - Doing God's Will Whatever the Cost        When You Are Tempted to Compromise or Quit...        Think of Ruth and Esther, two Old Testament heroines of the   faith. Singled out     as the only women to have Bible books named after them, Ruth   and Esther lived     in very different worlds, one a poor peasant and the other a   powerful queen.     Yet both dared to do the right thing when confronted with the   easy way out,     and God rewarded them for their courage and commitment.        As you study the Books of Ruth and Esther, you will appreciate   anew the tough     choices of faith these women made, and you will be encouraged   to do the same     as you rely on the God: who accomplishes His purposes through   people who trust     Him.",
        "Category": " Religion , Biblical Commentary , Old Testament",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Christianity where you live",
        "Authors": "By Underwood, Kenneth Wilson",
        "Description": "",
        "Category": "",
        "Publisher": "Friendship Press",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1945"
        }
    },
    {
        "Title": "Praying the Bible: A Parish Life Sourcebook (Parish life sourcebooks)",
        "Authors": "By Canham, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Cowley Pubns",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Furniture Projects (Better Homes and Gardens Wood Shop Library)",
        "Authors": "By Better Homes and Gardens Books (EDT) and Cavanaugh, Christopher (EDT)",
        "Description": "42 projects with step-by-step instructions.125 full-color photos, including one of each finished project, how-to photos, and easy-to-read diagrams to guide woodworkers.",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Eighth Grade Bites (Chronicles of Vladimir Tod, Book 1)",
        "Authors": "By Brewer, Heather",
        "Description": "Vlad has to keep his vampire urges under control while dealing with the pressures of middle school. Thirteen-year-old Vladimir Tod really hates junior high. Bullies harass him, the principal is dogging him, and the girl he likes prefers his best friend. Oh, and Vlad has a secret: His mother was human, but his father was a vampire. With no idea of the extent of his powers, Vlad struggles daily with his blood cravings and his enlarged fangs. When a substitute teacher begins to question him a little too closely, Vlad worries that his cover is about to be blown. But then he faces a much bigger problem: He’s being hunted by a vampire killer.Watch a QuickTime trailer for this book.",
        "Category": " Young Adult Fiction , Fantasy , Contemporary",
        "Publisher": "Speak",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Super Babies! (18) (Dora the Explorer)",
        "Authors": "By Miller, Victoria (ILT) and Inches, Alison",
        "Description": "Once upon a time there lived twin babies -- a boy and a girl. They were Super Babies! When Swiper swiped their Super Baby Banana Food, the babies -- along with their sister, Dora -- set off on a big adventure to get their food back!",
        "Category": " Juvenile Fiction , People & Places , United States , Hispanic & Latino",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Dancing Cinderella/Belle of the Ball (Disney Princess) (Pictureback(R))",
        "Authors": "By Posner-Sanchez, Andrea, Hammond, Katie, Storino, Sara (ILT), and Dare-Kast Studio (ILT)",
        "Description": "Two Disney Princess stories in one paperback storybook, with stickers! Dance along with Cinderella and Belle as they twirl and waltz their way through two  all-new stories about gowns and ballrooms. This full-color storybook stars the two  most popular Disney princesses and features four pages of stickers.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "A Guide to the Project Management Body of Knowledge (PMBOK Guide) -- 2000 Edition",
        "Authors": "By Project Management Institute",
        "Description": "An update from the 1996 first edition of the reference to generally accepted knowledge in the profession of project management. Among the changes are more emphasis on progressive elaboration, an acknowledgement of the role of the project office, and the expansion of the treatment of earned value management. The new edition will replace the old as the official reference for the Project Management Professional certification examination in 2002. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Management",
        "Publisher": "Project Management Institute",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Study Guide and Solutions Manual for Organic Chemistry, Third Edition",
        "Authors": "By Schore, Neil E.",
        "Description": "",
        "Category": " Science , Chemistry , General",
        "Publisher": "W. H. Freeman",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "In the Frame",
        "Authors": "By Dick Francis",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "Earthsong: How to Design a Truly Spectacular Natural Garden",
        "Authors": "By Revel, Chase",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Laservision Inc",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Celebrating President's Day: What Is a President? (Learn to Read Read to Learn Holiday Series)",
        "Authors": "By Lyon, Tammie (ILT), Kupperstein, Joel (EDT), Jordano, Kimberly, and Callella-Jones, Trisha",
        "Description": "Explains the meaning behind Presidents' Day and about the role of a president.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Political",
        "Publisher": "Creative Teaching Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Tippy Lemmey",
        "Authors": "By McKissack, Pat and Keeter, Susan (ILT)",
        "Description": "A New Dog in Town Tippy Lemmey is no ordinary dog. Not only is he the only dog Leandra, Paul, and Jeannie have ever met with a first and a last name, he's a living, breathing monster! When they ride their bikes, he chases them, snapping at their heels. When they run, he runs. If they cross the street, he follows. There's no getting away from him -- over him or under him. He's their number one enemy.Leandra, Paul, and Jeannie try to come up with a plan to stop Tippy Lemmey, but nothing works. But then Tippy does something totally unexpected, and the kids realize that maybe he's not their enemy after all.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Scoop! (A Vicky Hill Exclusive!)",
        "Authors": "By Dennison, Hannah",
        "Description": "Journalist Vicky Hill, an obituary writer, discovers, while attending the funeral of a champion hedge cutter, that foul play might have been involved in his death and, in her quest for the scoop, gets on the wrong side of a killer. Original.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Labrador Retrievers (Animal Planet® Pet Care Library)",
        "Authors": "By Moustaki, Nikki",
        "Description": "The Labrador Retriever is a strong and well-balanced companion. Learn the best methods for the proper care of this resilient breed, including which food choices are recommended for the active Lab. TFH Publications, Inc. has teamed up with Animal Planet, the only television network devoted to the unique bonds between humans and animals, to present an exciting new series of comprehensive guides to superior pet care. Each book in the Animal Planet Pet Care Library offers incredible value, featuring 112 pages of all-new, current information from pet care and animal experts—with a family-friendly design, over 60 full-color photographs, and helpful tip boxes. Also included is advice on feeding, housing, grooming, training, health care, and fun activities.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Temper Your Child's Tantrums (Pocket Guides)",
        "Authors": "By Dobson, James C.",
        "Description": "Does it sometimes feel like your child’s moods are controlling you? Have you ever been embarrassed in public by your kids’ behavior, but weren’t sure how to handle it? Do you long for a more calm and peaceful home, without yelling and fighting? This is the book for you! In Temper Your Child's Tantrums, parenting expert Dr. James Dobson offers the essential keys to correcting a child in a firm, loving, and understanding way.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Tyndale House Publishers, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "The Ghost Belonged to Me",
        "Authors": "By Peck, Richard",
        "Description": "Only Alexander knows why the barn is haunted—-and by what When Alexander notices an eerie light coming out of the barn,. He thinks his friend Blossom Culp is trying to spook him. But strange things really are happening there. Slimy footprints appear out of nowhere, and whimpering sounds float down from the hayloft. And when he ventures into the barn in the dark of night, his breath catches in his throat. Suddenly Blossom's words come back to him: \"You can make contact with the Unseen....\" Now there's a girl ghost standing right in front of him, telling him of great danger ahead. But is there time for Alexander to act on her warning? Blossom Culp #1 “Peck’s blending of mystery and humor makes an unusual and entertaining ghost story.” —Booklist, starred review",
        "Category": " Juvenile Fiction , Historical , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Slayride",
        "Authors": "By Dick Francis",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1980"
        }
    },
    {
        "Title": "H.I.V.E.: Higher Institute of Villainous Education (1)",
        "Authors": "By Walden, Mark",
        "Description": "HIGHER INSTITUTE OF VILLAINOUS EDUCATION   Otto Malpense may only be thirteen years old, but so far he has managed to run the orphanage where he lives, and he has come up with a plan clever enough to trick the most powerful man in the country. He is the perfect candidate to become the world's next supervillain.   That is why he ends up at H.I.V.E., handpicked to become a member of the incoming class. The students have been kidnapped and brought to a secluded island inside a seemingly active volcano, where the school has resided for decades. All the kids are elite; they are the most athletic, the most technically advanced, and the smartest in the country. Inside the cavernous marble rooms, floodlit hangars, and steel doors, the students are enrolled in Villainy Studies and Stealth and Evasion 101. But what Otto soon comes to realize is that this is a six-year program, and leaving is not an option.   With the help of his new friends: an athletic martial-arts expert; a world-famous, beautiful diamond thief; and a spunky computer genius -- the only other people who seem to want to leave -- can Otto achieve what has never been done before and break out of H.I.V.E.?",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Coming Together, Coming Apart: A Memoir of Heartbreak and Promise in Israel",
        "Authors": "By Gordis, Daniel",
        "Description": "Praise for Coming Together, Coming Apart\"\"Interesting conversation is Israel's most ingratiating commodity, and this is an especially interesting one. To read Coming Together, Coming Apart is to be engaged in an ongoing dialogue with one of Israel's most thoughtful observers--an American who made Israel his home, despite its imperfections and dangers. Gordis's conversational narrative is irresistible.\"\"--Alan dershowitz, author of The Case for Israel\"\"Whether describing a walk through Jerusalem in snow, a hike in the desert, or a farewell family drive to the Gaza settlements, Gordis manages to capture the essential details that tell us the larger meaning of our Israeli lives. There is much irony in this book, and also anger, especially against those who unfairly judge Israel in its most desperate and noble times. Most of all, though, this book is the chronicle of a love story--of an immigrant family in Jerusalem falling in love with Israel and, through that love, discovering the strength to cope with life on the front lines of a jihadist war. As a fellow Jerusalemite, I feel a profound debt to Gordis for explaining what it means to raise a family in the middle of a terror zone, and the courage that average Israelis instinctively display in maintaining the pretense of normal life. Those of us who share his passion are fortunate to be so well represented by this book.\"\"--Yossi Klein Halevi, Foreign Correspondent, The New Republic",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "You Must Be Joking!: Lots of Cool Jokes, Plus 17 1/2 Tips for Remembering, Telling, and Making Up Your Own Jokes",
        "Authors": "By Brewer, Paul and Krull, Kathleen (FRW)",
        "Description": "In addition to the jokes, cartoonist and artist Paul Brewer provides insights into what makes a joke funny, why we love to laugh and make others laugh, how to be more successful in doing that, and lots of great tips on how to remember jokes, how to tell them, and even how to invent your own. Each chapter ends with a half-joke, so that readers can test their growing skills by making up a punch line to fit the situation in the set-up of the joke. There?s no right answer, so kids can challenge themselves and each other to write the funniest joke.All of the classic joke formats are included, along with the author's suggestions for mastering each type. Sections are accompanied by full-page cartoons, and spot art throughout the book punctuates the jokes with visual humor. The 17 ½ tips at the end of the book offer lots of help to the reader in developing confidence and a personal style of telling jokes, as well as nuts-and-bolts guidelines for writing funny jokes. The last ?1/2 tip? is an illustration for which the reader can write a punch line.",
        "Category": " Juvenile Nonfiction , Language Arts , Composition & Creative Writing",
        "Publisher": "Cricket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Requiem: Collected Works and Tributes to the Grand Master",
        "Authors": "By Heinlein, Robert A. and Kondo, Yoji (EDT)",
        "Description": "Requiem is a compelling celebration of Robert A. Heinlein and his vision, containing many new and uncollected works by the Grand Master of science fiction, including two major novellas: Destination Moon, which was made into the famous George Pal film, and Tenderfoot in Space. There are contributions from such luminaries as Arthur C. Clarke, Robert Silverberg, Spider Robinson, and Gordon R. Dickson, as well as an introduction by Virginia Heinlein.Heinlein was the pre-eminent science fiction writer of the twentieth century. Requiem reveals the story of Heinlein's passion for space exploration-his glory and his dream.",
        "Category": "",
        "Publisher": "Tor Science Fiction",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Children's Play Yards",
        "Authors": "By Editors of Sunset Books",
        "Description": "Provides ideas and plans for building backyard playground equipment, from swings and slides to sandboxes and treehouses",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Templars: Knights of God (The Rise and Fall of the Knights Templars)",
        "Authors": "By Burman, Edward",
        "Description": "For nearly 200 years, until their suppression in 1312 on charges of heresy and magical practices, the Order of the Poor Knights of the Temple of Solomon--better known as the Templars--were the most formidable and feared fighting machine in Christendom. Besides their military prowess they also possessed immense wealth and political power, becoming bankers and credit brokers to medieval Europe and the allies of kings and popes. Drawing on contemporary chronicles and original texts, as well as the immense secondary literature, Edward Burman paints a vivid picture of this extraordinary organization of warrior monks and its passage into myth and legend.",
        "Category": " Body, Mind & Spirit , Mysticism",
        "Publisher": "Inner Traditions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Carmen:  The Song of the Toreador",
        "Authors": "By Bangs, John Kendrick",
        "Description": "",
        "Category": "",
        "Publisher": "Brentano's",
        "Price Starting With ($)": "6.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1891"
        }
    },
    {
        "Title": "I Can Has Cheezburger?: A LOLcat Colleckshun",
        "Authors": "By Professor Happycat and Icanhascheezburger. com",
        "Description": "The Internet has provided us with many wonders, from skateboarding dogs to Chuck Norris facts. Over the past year, though, one sensation has dominated the Web: LOLcats. Here’s how it works: First you find a picture of a cat online, and then you add a caption that reflects the cat’s point of view. Just remember that although cats can speak English, their spelling and grammar is not so hot. Once you’re done, you have a LOLcat (laugh out loud cat). Since its founding in January 2007, icanhascheezburger .com (named after the most famous LOLcat of all) has been the center of the LOLcat world. I Can Has Cheezburger? collects 200 LOLcats from the enormously popular site, some classic and some new, in glorious and glossy full color. The book also highlights legendary LOLcat forms recognizable to fans everywhere (including “Do Not Want,” “Monorail Cat,” and “Oh Noes!”), and offers a guide to the finer points of LOLspeak. Packed with witty and endearing images and published into a proven cat-egory, I Can Has Cheezburger? is sure to delight feline aficionados and Internet nerds alike.",
        "Category": " Pets , Cats , General",
        "Publisher": "Avery",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Switcharound",
        "Authors": "By Lowry, Lois",
        "Description": "Forced to spend a summer with their father and his \"new\" family, Caroline, age eleven, and J.P., age thirteen, are given unpleasant responsibilities for which they are determined to get revenge.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Jacqueline Kennedy Onassis",
        "Authors": "By Ladowsky, Ellen",
        "Description": "Traces the life of the former first lady who remained a popular celebrity until her death in 1994",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Park Lane Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Warriors for the West: Fighting Bureaucrats, Radical Groups, And Liberal Judges on America's Frontier",
        "Authors": "By Pendley, William Perry",
        "Description": "Why Do Americans, and Particularly Westerners, Fell Less Free?What Happened to Our Constitutional Liberties and the Rule of Law?Congress enacts ambiguous statutes demanded by radical groups; federal bureaucrats implement those laws as the groups demand; then, out-of-control activist judges, in lawsuits brought by those groups, interpret the laws as those groups insist.Meanwhile, others in Congress, the Executive, and the Judiciary do nothing!In Warriors for the West: Fighting Bureaucrats, Radical Groups, and Liberal Judges on America's Frontier, William Perry Pendley puts human faces on Westerners' historic and often precedent-setting fights against:Environmental laws\"Lying and cheating\" bureaucrats and their ethically challenged lawyersClinton's attacks on logging, mining, and energy explorationGovernment as a bullying bad neighborCriminalizing everything for \"environmental protection\"Seizure of \"private property\" for \"public use\" without \"just compensation\"An much, much moreNo one escapes Pendley's well-documented truth telling. All are held accountable: Congress, bureaucrats, extremist groups, and activist judges.",
        "Category": " Political Science , Public Policy , Environmental Policy",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "With a Twist (Wild Hart)",
        "Authors": "By Martin, Deirdre",
        "Description": "He's a tall order. She's a hot dish. Are they ready for the main course? Natalie Bocuse is a waitress at her sister's French bistro in Brooklyn, yet she dreams of managing a chic restaurant in Manhattan. Among the regulars is Quinn O'Brian, a reporter known for breaking stories-and hearts. When he offers Natalie a job at his parents' Irish pub in Manhattan, she jumps at the chance to be one step closer to her dream. But Quinn will need the luck of the Irish to charm Natalie and write a happy ending to his own love story.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Finding Our Way: Leadership for an Uncertain Time",
        "Authors": "By Wheatley, Margaret J.",
        "Description": "For years, Margaret Wheatley has written eloquently about humanizing our organizations and helping people to work together more effectively and compassionately. She has shown how breakthroughs in chaos theory and quantum physics can enable organizations to function more like responsive, self-organizing living systems, rather than cold mechanisms of control. And she has gradually expanded these ideas into the wider arena of human society.  In short, Margaret Wheatley is one of the most innovative and influential organizational thinkers of our time, and Finding Our Way brings together her shorter writings for the first time, touching on all the topics she has addressed throughout her career, showing how she has applied the ideas in her books s in many different situations. “The pieces presented here”, she writes,  “represent ten years of work, of how I took the ideas in my books and applied them in practice in many different situations. However, this is not a collection of articles. I updated, revised, or substantially added to the original content of each one. In this way, everything written here represents my current views on the subjects I write about.”  Provocative, challenging, at times poetic, and often deeply moving, Finding Our Way sums up Wheatley&apos;s thinking on  a diverse scope of topics from leadership and management to education and raising children in turbulent times; from societal commentary to specific organizational techniques and more.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Alzheimer's For Dummies",
        "Authors": "By Smith, Patricia B., Kenan, Mary, and Kunik, Mark Edwin",
        "Description": "An estimated 4 million people are living with Alzheimer’s Disease (AD) in America today, with approximately 370,000 new cases diagnosed every year. AD patients live anywhere from 5 to 20 years after their diagnosis; and their inability to care for themselves grows more dramatic as the disease progresses, creating profound implications for their families and healthcare providers. Its impact on families during the caregiving years is overwhelming.If you have a family member or close friend who’s suffering from Alzheimer’s Disease and you’re looking for current, useful information, then Alzheimer’s For Dummies is for you. This reference guide also is helpful if youNeed to know more about its diagnosis and treatmentWant to take care of yourself while taking care of your loved oneAre not the primary caregiver but want to know how to helpWant to know how Alzheimer’s Disease is going to affect you and your loved oneAlzheimer’s For Dummies takes a realistic look at Alzheimer’s Disease, what it is and what it isn’t. It offers pertinent, easy-to-understand advice for dealing with the myriad concerns and responsibilities that a primary caregiver must assume when managing an Alzheimer’s patient. Here’s a sampling of the information you’ll find in this valuable guide:Maneuvering through medical, legal, and financial tanglesDistinguishing AD from other brain diseases and medical conditionsHandling the fears that may accompany the diagnosisEvaluating current drug therapies; watching out for scams and quack treatmentsFinding the best doctors; dealing with attorneys and CPAsLooking at Medicare regulationsEvaluating the cost of careThe current state of research, diagnosis, and treatmentTelevision personality Leeza Gibbons, whose mother was stricken with AD, writes in the foreword of this book, “There is no upside to keeping your head in the sand. This book is a crucial step in your new fight. Arm yourself with the knowledge waiting for you in these pages. It will help you find answers and resources as you adjust to your new reality.”",
        "Category": " Health & Fitness , Diseases , Alzheimer's & Dementia",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Introduction to Interactive Programming on the Internet: Using HTML and JavaScript",
        "Authors": "By Knuckles, Craig",
        "Description": "A textbook for an introductory course in constructing web pages using HTML and programming on the web using JavaScript.  In addition to exploration of core programming fundamentals such as variables, decisions, loops, functions, and arrays, a natural introduction to objects using the document object model is presented. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Programming Languages , HTML",
        "Publisher": "Wiley",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "The Zen of CSS Design: Visual Enlightenment for the Web",
        "Authors": "By Holzschlag, Molly E. and Shea, Dave",
        "Description": "Proving once and for all that standards-compliant design does not equal dull design, this inspiring tome uses examples from the landmark CSS Zen Garden site as the foundation for discussions on how to create beautiful, progressive CSS-based Web sites. By using the Zen Garden sites as examples of how CSS design techniques and approaches can be applied to specific Web challenges, authors Dave Shea and Molly Holzschlag provide an eye-opening look at the range of design methods made possible by CSS (Cascading Style Sheets). By the time you've finished perusing the volume, you'll have a new understanding of the  graphically rich, fully accessible sites that CSS design facilitates. In sections on design, layout, imagery, typography, effects, and themes, Dave and Molly take you through every phase of the design process--from striking a sensible balance between text and graphics to creating eye-popping special effects (no scripting required).",
        "Category": " Computers , Web , Site Design",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Blood Sins (Bishop/Special Crimes Unit: Blood Trilogy)",
        "Authors": "By Hooper, Kay",
        "Description": "New York Times bestselling author Kay Hooper delivers once again with this chilling novel in which the Special Crimes Unit sends a Haven operative undercover to catch a charismatic killer who promises his victims heaven in exchange for more than their lives. . . Young, vulnerable, attractive, Tessa Gray looked like the perfect victim. Which was why Noah Bishop of the FBI’s Special Crimes Unit recruited the novice operative to use as bait for a killer hidden inside the Church of the Everlasting Sin–a fortified mountain compound where at least two women have already been murdered in ways that defy explanation. By entering the cult’s compound, Tessa will expose herself to the dark magnetism of its leader and his fanatically loyal followers. Once she’s inside, no one, not even Bishop or the town’s chief of police, can guarantee she’ll come out alive. And not even Tessa knows if she’s strong enough to resist the lure of a killer who is less than human.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Whitehall",
        "Authors": "By Hennessy, Peter",
        "Description": "An expert journalist's look inside the powerful, efficient, and intractable British Civil Service describes its evolution current structure, and notable personalities",
        "Category": " Political Science , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "23.51",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Vegetarian (Williams Sonoma Kitchen Library)",
        "Authors": "By Williams, Chuck (EDT), Rosenberg, Allan (PHT), and Weir, Joanne",
        "Description": "Offers recipes for soups, salads, main courses, and side dishes, and includes advice on equipment, preparation and cooking techniques, and ingredients",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "California Dreaming (An A-List Novel #10)",
        "Authors": "By Dean, Zoey",
        "Description": "The ninth novel, Beautiful Stranger, in the New York Times bestselling series takes readers behind the scenes of the intoxicating world of Hollywood glitterati. Anna decides to take an end-of-summer getaway-to get away from her drama-filled LA life. So she packs her Louis Vuitton, grabs her close friend Sam, and heads to the Big Apple. Between trips to the Met and shopping at Bendel's, the girls are living the A-List life on Anna's home turf. But their trip isn't exactly a vacation. Sam is here to spy on Eduardo and decode his recent strange ­behavior. Will what she discovers send her hopping on the next private jet back to Beverly Hills? And who is the ­beautiful stranger who appears on Anna's Upper East Side doorstep? Anna begins to wonder whether she wants to head back west again-especially since Ben seems to have moved on . . . with someone who isn't a stranger at all. When it comes to the A-List, there's drama coast to coast.The A-List #10: Title to Come plot description to come.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Poppy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Chopin In Paris: The Life And Times Of The Romantic Composer",
        "Authors": "By Szulc, Tad",
        "Description": "Born in Poland in 1810, Chopin emigrated to Vienna at age eighteen&#151;and then to Paris, where from 1831 to 1849 he would spend almost half of his brief and tumultuous life. In Paris his extraordinary powers would reach their height and he would shine among the immensely talented writers, painters, and musicians who were working there and defining their era. Chopin&#39;s other acquaintances ranged from Rothschild to Marx&#151;and it was here that he began his long and stormy relationship with the novelist George Sand. In Chopin in Paris&#151;a New York Times Notable Book&#151;Tad Szulc brings to life this complex, contradictory genius, and re-creates an unsurpassed epoch of European history, culture, and music.",
        "Category": " Music , Genres & Styles , Classical",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "What Grandmas Do Best What Grandpas Do Best",
        "Authors": "By Munsinger, Lynn (ILT) and Numeroff, Laura Joffe",
        "Description": "Grandmas can do lots of things, like paint with you, take you on a picnic, and teach you how to dance. But what do they do best? The answer is made perfectly clear in this Irresistible celebration of grandparents and the everyday things they do.  Grandpas can do lots of things, like play hide-and-seek, help you build a sand castle, and sing you a lullaby. But what do they do best? The answer is made perfectly clear In this irresistible celebration of grandparents and the everyday things they do.",
        "Category": " Juvenile Fiction , Family , Multigenerational",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The New American Heart Association Cookbook, 7th Edition",
        "Authors": "By American Heart Association",
        "Description": "Since the American Heart Association published its first cookbook in 1973, dozens of health and diet trends have come and gone. Throughout this time, the Association, the foremost authority on heart health, has set the standard for nutritious eating. With millions of copies already in print, the Association’s flagship cookbook, The New American Heart Association Cookbook, is back—and better than ever. In today’s climate of confusing and often contradictory dietary trends, the American Heart Association once again rises above the fray and presents credible, easy-to-understand information about maintaining a healthy heart—and delicious recipes that make it simple to follow that advice at every meal. The more than 600 recipes, including 150 new ones, follow the American Heart Association’s guidelines for healthy eating and make The New American Heart Association Cookbook, Seventh Edition a welcome addition to the cookbook world. Whether you crave classic family favorites, ethnic dishes, vegetarian entrées, or the most varied, cutting-edge recipes, you’ll find plenty of options. Orange Chicken Lettuce Wraps, Greek-Style Beef Skillet Supper, and Grilled Vegetable Pizza with Herbs and Cheese are just a few examples of the up-to-date, exciting, and flavorful choices inside.The New American Heart Association Cookbook, Seventh Edition can even help with menu planning, holiday cooking, and shopping for healthful ingredients. With the latest information about the connection between good food and good health, emphasizing variety, balance, and common sense, The New American Heart Association Cookbook, Seventh Edition is the ultimate healthy-heart cookbook.",
        "Category": " Cooking , Health & Healing , Heart",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "6.09",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Charleston, South Carolina, and Surrounding Barrier Islands",
        "Authors": "By Anon",
        "Description": "",
        "Category": "",
        "Publisher": "Charleston Post Card Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Ideals Grandparents - 1980",
        "Authors": "By ANAM",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Ultimate Audition Book for Teens: 111 One-Minute Monologues (Ultimate Monologue Book for Middle School Actors)",
        "Authors": "By Dabrowski, Kristen",
        "Description": "A collection of original monologues, each about one minute long, categorized by gender of performer and by drama or comedy, for use by teenage actors for auditions and other purposes.",
        "Category": " Young Adult Nonfiction , Performing Arts , Theater & Musicals",
        "Publisher": "Smith & Kraus",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "501 German Verbs (501 Verbs Series)",
        "Authors": "By Strutz, Henry",
        "Description": "From ?chzen (to groan) to ziehen (to pull), 501 of the most commonly used German verbs are presented alphabetically with translations. The arrangement is one verb per page in easy to comprehend table form. Each verb is listed with its principal parts and followed by complete conjugation in all tenses. Additional material includes tables of strong verbs arranged according to pattern of change, and a section on prefix verbs and model auxiliaries. An added feature in this edition is a set of 27 verb tests with answers explained. Language students will also find weather expressions as they are used with impersonal verbs, a selection of German idioms and proverbs, and a concise review of rules for verb tenses and moods. This book, with its emphasis on grammatical form, makes a fine classroom supplement for beginner, intermediate, and advanced courses in German.",
        "Category": " Foreign Language Study , German",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Silver Cow: A Welsh Tale",
        "Authors": "By Cooper, Susan and Hutton, Warwick (ILT)",
        "Description": "From Wales comes this tale of young Huw, whose lilting harp music enchants Tylwyth Teg, the magic people of Bearded Lake. From the depths of the black lake comes the gift of a beautiful silver cow; and the cow is magic, for its milk is three times as rich as the milk of an ordinary cow, and she gives three times as much. Huw's father is a selfish and greedy man, and his wealth makes him greedier than ever. Huw tries to make his father see the magic, but he scoffs at Tylwyth Teg...until they seek their revenge. Told with a rhythm that evokes the Welsh language, Susan Cooper has brought new life to this ancient tale. Warwick Hutton's evocative illustrations capture the magic of this fateful story.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The White House (American Symbols & Their Meanings)",
        "Authors": "By Marcovitz, Hal",
        "Description": "Discusses the history of the White House, including the story of its construction, interesting and important facts and statistics, and its importance as an American symbol.",
        "Category": " Juvenile Nonfiction , History , United States , 19th Century",
        "Publisher": "Mason Crest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Statue of Liberty (American Symbols & Their Meanings)",
        "Authors": "By Marcovitz, Hal",
        "Description": "Traces the history of the United States' symbol of freedom, the Statue of Liberty, from its conception and design, through the fund-raising and construction, to its dedication in 1886.",
        "Category": " Juvenile Nonfiction , History , United States , 19th Century",
        "Publisher": "Mason Crest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Hard Times (Signet Classics)",
        "Authors": "By Dickens, Charles",
        "Description": "In a savagely bitter novel about the evils of the Victorian industrial society, Dickens explores the terrible industries that imprisoned the helpless labor class and the equally malevolent institutions that shackled the development of their minds. Reissue.",
        "Category": " Fiction , Classics",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Conrad's Fate (A Chrestomanci Book)",
        "Authors": "By Jones, Diana Wynne",
        "Description": "Someone at Stallery Mansion is changing the world. At first, only small details, but the changes get bigger and bigger. It's up to Conrad, a twelve-year-old with terrible karma who's just joined the mansion's staff, to find out who is behind it.But he's not the only one snooping around. His fellow servant-in-training, Christopher Chant, is charming, confident, and from another world, with a mission of his own -- rescuing his friend, lost in an alternate Stallery Mansion. Can they save the day before Conrad's awful fate catches up with them?",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Drawing with Pen & Ink (Artist's Library series #06)",
        "Authors": "By Glassford, Carl",
        "Description": "",
        "Category": " Art , Techniques , Pen & Ink Drawing",
        "Publisher": "Walter Foster Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "God Thinks You're Wonderful!",
        "Authors": "By Max Lucado",
        "Description": "",
        "Category": "",
        "Publisher": "J. Countryman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Howling Stones (The Humanx Commonwealth)",
        "Authors": "By Foster, Alan Dean",
        "Description": "Enter another realm in the amazing world of the Humanx Commonwealth--the interstellar empire governed jointly by humans and aliens!The newly discovered planet of Senisran was a veritable paradise--a sprawling world of vast oceans dotted with thousands of lush islands and copious deposits of rare-earths and minerals. First-contact specialist Pulickel Tomochelor's mission to Senisran was straightforward: Secure mining rights for the Humanx Commonwealth before the vicious AAnn Empire beat them to the chase. With Senisran's Parramat clan resisting entreaty, negotiations could be difficult, but Pulickel was more comfortable with aliens than with his own species, and looked forward to a triumphant return to Earth.He hadn't counted on the incredible secret of Parramat, though: the strange, powerful green stones that the tribe used to manipulate the forces of nature. Within those stones lay an awesome technology the origin of which was lost in time--a technology that had to be kept from the AAnn at any cost . . .",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Emma's War: A True Story",
        "Authors": "By Scroggins, Deborah",
        "Description": "Tall, striking, and adventurous to a fault, young British relief worker Emma McCune came to Sudan determined to make a difference in a country decimated by the longest-running civil war in Africa.  She became a near legend in the bullet-scarred, famine-ridden country, but her eventual marriage to a rebel warlord made international headlines—and spelled disastrous consequences for her ideals. Enriched by Deborah Scroggins’s firsthand experience as an award-winning journalist in Sudan, this unforgettable account of Emma McCune’s tragically short life also provides an up-close look at the volatile politics in the region.  It’s a world where international aid fuels armies as well as the starving population, and where the northern-based Islamic government—with ties to Osama bin Laden—is locked in a war with the Christian and pagan south over religion, oil and slaves.  Tying together these vastly disparate forces as well as Emma’s own role in the problems of the region, Emma’s War is at once a disturbing love story and a fascinating exploration of the moral quandaries behind humanitarian aid.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Agincourt",
        "Authors": "By Cornwell, Bernard",
        "Description": "The New York Times bestseller, now available in paperback— the heroic tale of Agincourt.Bernard Cornwell, the New York Times bestselling “reigning king of historical fiction” (USA Today), tackles his most thrilling, rich, and enthralling subject yet—the heroic tale of Agincourt. The epic battle immortalized by William Shakespeare in his classic Henry V is the background for this breathtaking tale of heroism, love, devotion, and duty from the legendary author of the Richard Sharpe novels and the Saxon Tales. This extraordinary adventure will captivate from page one, proving once again and most powerfully, as author Lee Child attests, that “nobody in the world does this stuff better than Cornwell.”",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Harper-perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Fix-it and Forget-it 5-Ingredient Favorites: Comforting Slow Cooker Recipes",
        "Authors": "By Good, Phyllis Pellman",
        "Description": "So who has time to prepare food these days? We time-starved cooks need recipes that are guaranteed to be&#151; Quick to fix, Easy for anyone to make, whether you're a cook or not, Delicious and satisfying. The solution? Fix-It and Forget-It 5-Ingredient Favorites&#151;the latest member in the multi-million copy Fix-It and Forget-It cookbook series! This smart cookbook offers convenience and comfort to anyone faced with a too-full life and hungry people to feed. Gather five or fewer readily available ingredients + your slow cooker + Fix-It and Forget-It 5-Ingredient Favorites&#151;and you can have&#151; Apricot Chicken, Lazy Lasagna, Sweet and Savory Brisket,   Bacon Feta-Stuffed Chicken, Tortellini with Broccoli, Upside-Down Chocolate Pudding Cake, Brownies with Nuts.           Fix-It and Forget-It 5-Ingredient Favorites, with its more than 700 recipes, can be your new faithful companion. Turn to it for Main Dishes, Meats and Pastas, Vegetables, Soups, Breads, Breakfasts and Brunches, Desserts, Appetizers, Snacks, and Beverages. From New York Times best-selling author Phyllis Pellman Good, who believes that it is possible to do home-cooking and to enjoy the great satisfaction it brings to those who cook and to those who eat.Skyhorse Publishing, along with our Good Books and Arcade imprints, is proud to publish a broad range of cookbooks, including books on juicing, grilling, baking, frying, home brewing and winemaking, slow cookers, and cast iron cooking. We’ve been successful with books on gluten-free cooking, vegetarian and vegan cooking, paleo, raw foods, and more. Our list includes French cooking, Swedish cooking, Austrian and German cooking, Cajun cooking, as well as books on jerky, canning and preserving, peanut butter, meatballs, oil and vinegar, bone broth, and more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Good Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    }
]