[
    {
        "Title": "Mastering Social Psychology",
        "Authors": "By Baron, Robert A., Byrne, Donn, and Branscombe, Nyla R.",
        "Description": "Finally, a briefer version of one of the best-selling books in social psychology, for those who prefer less detail.  Baron and Byrne set the standard with their original book, and new co-author Nyla Branscombe has brought freshness and new insights with her expertise in topics such as prejudice, the self, gender and group processes. The briefer version retains all the hallmarks of the original: up-to-date coverage of the quickly evolving area of social psychology--balanced in its coverage of fundamentals with current research--and written in a lively, engaging style.",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Pearson",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Windows on the World Complete Wine Course: 2007 Edition",
        "Authors": "By Zraly, Kevin",
        "Description": "The Windows on the World Complete Wine Course is simply the bestselling wine book in the United States?it’s a classic. And this new edition contains an additional 16 wonderful pages, including a featured supplement about the olfactory system and how it deepens our enjoyment of wine. Written in a question-and-answer format, the section is coauthored with Wendy Dubit, an expert on the subject. Plus, this unequaled volume retains all the invaluable information, fabulous illustrations, and gorgeous styling of the 20th anniversary edition. Wine lovers will still thrill to Zraly’s inimitable, irreverent style. As always, he answers every question about wine; offers the most up-to-date recommendations; provides advice on buying wine in stores and on the Internet; takes you on a country-by-country, region-by-region ratings tour of the latest vintages; and starts you on your way to becoming a wine connoisseur. Abundant full-color labels and maps complete the enticing picture. More current, more informative, more concise and precise than ever, this remains the wine guide against which all others are judged.",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Sterling",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "That Amazing Ingredient: Mayonnaise! : Recipes in the Tradition of Hellmann's and Best Foods Mayonnaise",
        "Authors": "By Hellman's & Best Foods",
        "Description": "",
        "Category": "",
        "Publisher": "CPC International Inc.",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Challenge to Honor (The Masters at Arms, 1)",
        "Authors": "By Blake, Jennifer",
        "Description": "Hoping to save her brother's life after he challenges New Orleans's most notorious swordsman to a duel, Celina Vallier offers herself to Rio de Silva in exchange, and Rio, enchanted by Celina's courage and beauty and seeking revenge on her betrothed, sets out to save her from an unwanted marriage. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Secret Song (Song Novels)",
        "Authors": "By Coulter, Catherine",
        "Description": "Roland de Tournay, the handsome and roguish adventurer, must rescue Daria of Fortesque from a Welsh stronghold",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Onyx",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Echoes: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Against a vivid backdrop of history, Danielle Steel tells a compelling story of love and war, acts of faith and acts of betrayal…and of three generations of women as they journey though years of loss and survival, linked by an indomitable devotion that echoes across time.For the Wittgenstein family, the summer of 1915 was a time of both prosperity and unease, as the guns of war sound in the distance. But for eldest daughter Beata, it was also a summer of awakening. By the glimmering waters of Lake Geneva, the quiet Jewish beauty met a young French officer and fell in love. Knowing that her parents would never accept her marriage to a Catholic, Beata followed her heart anyway. And as the two built a new life together, Beata’s past would stay with her in ways she could never have predicted. For as the years pass, and Europe is once again engulfed in war, Beata must watch in horror as Hitler’s terror threatens her life and family—even her eighteen-year-old daughter Amadea, who has taken on the vows of a Carmelite nun.For Amadea, the convent is no refuge. As family and friends are swept away without a trace, Amadea is forced into hiding. Thus begins a harrowing journey of survival, as she escapes into the heart of the French Resistance.  Here Amadea will find a renewed sense of purpose, taking on the most daring missions behind enemy lines. And it is here, in the darkest moments of fear, that Amadea will feel her mother’s loving strength—and that of her mother’s mother before her–as the voices of lost loved ones echo powerfully in her heart. And here, amid the fires of war, Amadea will meet an extraordinary man, British secret agent Rupert Montgomery. In Colonel Montgomery, Amadea finds a man who will help her discover her place in an unbreakable chain between generations…and between her lost family and her dreams for the future—a future she is only just beginning to imagine: a future of hope rooted in the rich soil of the past.With the grace of a master storyteller, Danielle Steel breathes life into history, creating a bold, sweeping tale filled with unforgettable characters and breathtaking images—from the elegant rituals of Europe’s prewar aristocracy to the brutal desperation of Germany’s death camps. Drawing us into a vanished world, Echoes weaves an intricate tapestry of a mother’s love, a daughter’s courage…and the unwavering faith that sustained them—even in history’s darkest hour.From the Hardcover edition.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Loving: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Bettina Daniels lived a fairytale existence of  glamour, endless parties, and luxury among  America's top celebrities -- simply because she was the  beautiful daughter of famous American author Justin Daniels. Then, in one moment of tragedy, her  father was dead, and Bettina discovered the truth  -- he had spent every dime he'd ever earned and run up  millions in debt. At eighteen, penniless and  alone, she had lost everything except her father's  dearest friend, Ivo Stewart. A wealthy, handsome publisher  of sixty-two, he offered Bettina a  way out: marriage. But only for a time. What lay  ahead for Bettina was a life filled with shocks and  surprises -- and eventually a chance to become a  playwright, and a writer like her father. Having  learned her lessons dearly, Bettina blossoms into  her own person at last.",
        "Category": " Fiction , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Amazing Grace: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "On a warm May night in San Francisco, the Ritz-Carlton ballroom shimmers as a glittering,  celebrity-studded crowd gathers for a charity dinner dance. The evening is perfect—until,  just minutes before midnight, the room begins to sway….In the earthquake’s aftermath,  the lives of four strangers will converge.… Sarah Sloane, the wife of a financial  whiz, watches her perfect world fall to pieces…. Grammy-winning singer Melanie Free  comes to a turning point in her life and career…. Photographer Everett Carson finds  new purpose amid the carnage…and Sister Maggie Kent, a nun who works with the homeless,  searches through the rubble—and knows that there is much to be done….As the city  staggers back to life, a chain reaction of extraordinary events will touch each of  the survivors…. Sarah discovers a crime and a betrayal, then a strength she never  knew she had. Volunteering at a refugee camp opens new worlds of possibility for  Melanie. Everett will forge an unlikely relationship with Maggie, who helps him rebuild  his shattered life—and upends her own in the process. And as a year passes each discovers  the unexpected gifts in a tragedy’s wake…and the amazing grace of new beginnings.Throughout  these enthralling pages, Danielle Steel creates a stunning array of contrasts —from  the dazzle of a society benefit to the chaos of a makeshift hospital, from the pampered  lives of rock stars to the quiet heroism of emergency volunteers. It is her most  powerful and life-affirming novel to date.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Kaleidoscope: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "When a beautiful young Frenchwoman and a brilliant American  actor meet in wartime Paris, their love begins like a fairy tale but  ends in tragedy. Suddenly orphaned, their three  children are cruelly separated. Megan, the baby,  adopted by a family of comfortable means, becomes a  doctor in the rural Appalachia. Alexandra, raised in lavish  wealth, marries a powerful man whose pride is in  his pedigree and who assumes that Alexandra is her parents'  natural offspring. Neither of them has the remotest suspicion  that she is adopted, or what turbulent tragedy lurks in her past.   And Hilary, oldest of the Walker  children, remembers them all, and the grief that tore them   apart and cast them into separate lives. Feeling the loss  throughout her life, and unable to find her sisters, she builds an extraordinary  career and has no personal life.  When John Chapman, lawyer and prestigious private  investigator, is asked to find these three women, he wonders why.  Their parents' only friend, he did nothing to keep them together  as children and has been haunted by remorse all his life.  The investigator follows a trail that leads from  chic New York to Boston slums, from elegant  Parisian salons to the Appalachian hills, to the place where  the three sisters face each other and one more final, devastating  truth before they can move on.",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Raising Winners : A Parent's Guide to Helping Kids Succeed On and Off the Playing Field",
        "Authors": "By Kuchenbecker, Shari Young",
        "Description": "A sports psychologist offers advice on helping children develop through sports, discussing the right sport for a child, keeping kids motivated, handling competition, and maintaining a sense of balance in a young athlete's life.",
        "Category": " Family & Relationships , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Sew Many Bags, Sew Little Time: Over 30 Simply Stylish Bags and Accessories",
        "Authors": "By Southern, Sally",
        "Description": "Sew yourself a sassy collection of bags and accessories to carry you from day to night, and work to playSew stylish . . .Create fashion with function; pretty shoppers, smart satchels, cute cosmetics purses and more, plus must-have coordinating accessoriesSew special . . .Felt, denim, cotton, and even waterproof; fabrics new and old are mixed and embellished for one-of-a-kind creationsSew simple . . .No-fuss sewing techniques, from easy appliqué to simple seams, ensure the bags are quick and easy, leaving you with more time to enjoy them.",
        "Category": " Crafts & Hobbies , Beadwork",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Imperial 109",
        "Authors": "By Doyle, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "The Valhalla Testament",
        "Authors": "By Land, Jon",
        "Description": "The Valhalla Group orchestrates an international conspiracy to unleash an anti-matter weapon that can make anything implode, and the ensuing race against destruction runs from Nicaragua to the Australian outback to Washington, D.C.",
        "Category": " Fiction , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Simply Enchanting Crafts: Over 30 Delightfully Delicate Projects For You and Your Home",
        "Authors": "By Force, Lilas",
        "Description": "A World of Fairies offers an enchanting book filled with delicate treasures and over 30 charming fairy-themed craft projects. From cupcakes to jewelry, decorations to dolls, and clothing to beauty products, the projects are both creative and captivating throughout. Readers will be able to craft perfect gifts and embellishments for weddings, anniversaries, Christmas and any other occasion that requires that extra-special touch of ethereal magic. Step-by-step instructions accompanied by stunning photography and unique watercolor artwork are sure to inspire fairy-tale lovers and crafters everywhere.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "What Color Is Your Parachute for Teens: Discovering Yourself, Defining Your Future",
        "Authors": "By Bolles, Richard Nelson, Christen, Carol, and Blomquist, Jean M.",
        "Description": "More than 35 years ago, the world was introduced to the revolutionary career guide and job-hunting manual, WHAT COLOR IS YOUR PARACHUTE? Now, for the first time, Richard Nelson Bolles presents his career bible's central concepts for teen readers. With simpler, more direct language, the teen PARACHUTE teaches high school and college students to zero in on their  favorite skills and then to apply that knowledge to finding their perfect college major or job. A significant addition to the Parachute Library, this book will provide guidance and inspiration to a whole new generation of job seekers.Draws on the timeless principles of the best-selling career book to provide high school students with a focused manual for choosing a career.Includes exercises and worksheets throughout.Features concrete, easy-to-understand job-hunting tips.",
        "Category": " Young Adult Nonfiction , Careers",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "In My Dark Dreams",
        "Authors": "By Freedman, J.F.",
        "Description": "",
        "Category": "",
        "Publisher": "Madison Park Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Combat, Vol. 1",
        "Authors": "By Coonts, Stephen (EDT)",
        "Description": "An historic landmark work, depicting war as it is and soon will be-the shape of war to come.Featuring new short novels by:Larry Bond, who explores the wild frontier of space warfare, where American forces fight a tenacious enemy which threatens every free nation on Earth.Dale Brown, taking us into the seldom-seen world of the military review board, and shows us how the future career of an EB-52 Megafortress pilot can depend on a man he's never met.And David Hagberg, who brings us another Kirk McGarvey adventure, in which the C.I.A. director becomes entangled in the rising tensions between China and Taiwan. When a revolutionary leader is rescued from a Chinese prison, the Chinese government pushes the United States to the brink of war, and McGarvey has to make a choice with the fate of the world hanging in the balance.",
        "Category": " Fiction , War & Military",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Life Application Bible: New International Version",
        "Authors": "By",
        "Description": "",
        "Category": " Bibles , New International Version , General",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "6.71",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Black and White Photography in the Digital Age: Creative Camera, Darkroom and Printing Techniques for the Modern Photographer",
        "Authors": "By Worobiec, Tony and Spence, Ray",
        "Description": "Black and White Photography in the Digital Age shows you how to get the most from all of the new technology available, and achieve what was once impossible in the darkroom. Drawing on over thirty years of experience in traditional darkroom practice as well as digital techniques, Tony Worobiec and Ray Spence guide you through the digital process from dealing with RAW files or scanning from prints and transparencies, to producing the final print.Illustrated with their own award-winning work, Black and White Photography in the Digital Age shows that subtle and beautiful black and white photography no longer requires an expertise born of years of practise in the darkroom, but is within the reach of every avid photographer.",
        "Category": " Photography , Techniques , Digital",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Identifying Animal Tracks: Mammals, Birds, and Other Animals of the Eastern United States",
        "Authors": "By Headstrom, Richard",
        "Description": "\"The book shows lots of tracks in drawings to help you. Birds, insects and mammals are included in this highly informative book. Get a copy today.\" — Texas Kitchen and Garden and MoreYou can find them almost anywhere: crisscrossing a snowy meadow, etched in the mud of a stream bank or the wet sand of the sea breach, traced in the dust of a country road. Animal tracks are the signatures of the animals themselves and a fascinating part of nature study.Prints and tracks not only identify the animals that made them, but reveal much about animal anatomy, relationship to the environment, habits, and behavior. Animal tracks tell fascinating stories to those with the skills to decipher them.This book will give you those skills. It is a comprehensive guide to the prints and tracks of over 100 species of mammals, birds, frogs, toads, salamanders, snakes, lizards, turtles, insects, and other invertebrates — all common to the eastern United States. A special finding key will help you quickly identify the tracks of dozens of common birds and mammals. This key includes information on size of prints, type of gait, habitat, geographical range, and other distinguishing characteristics. In addition, the author has include dozens of his own drawings to aid in identification, and suggestions for making your own drawings, photographs and plaster casts of the tracks you find.For naturalists, campers, hikers, biologists, scouts — and nature lovers, this book is an ideal introduction to a relaxing, enjoyable pastime, and an opportunity to gain greater knowledge and understanding of the natural world.",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2011"
        }
    },
    {
        "Title": "PS, I Love You Movie Tie-In Edition",
        "Authors": "By Ahern, Cecelia",
        "Description": "A wonderfully warm and heartfelt debut from a stunning new talent. Everyone needs a guardian angel! Some people wait their whole lives to find their soul mates. But not Holly and Gerry. Childhood sweethearts, they could finish each other's sentences and even when they fought, they laughed. No one could imagine Holly and Gerry without each other. Until the unthinkable happens. Gerry's death devastates Holly. But as her 30th birthday looms, Gerry comes back to her. He's left her a bundle of notes, one for each of the months after his death, gently guiding Holly into her new life without him, each note signed 'PS, I Love You'. As the notes are gradually opened, and as the year unfolds, Holly is both cheered up and challenged. The man who knows her better than anyone sets out to teach her that life goes on. With some help from her friends, and her noisy and loving family, Holly finds herself laughing, crying, singing, dancing--and being braver than ever before. Life is for living, she realises--but it always helps if there's an angel watching over you.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "The Ultimate Game Guide To Your Life: Or, The Video Game As Existential Metaphor",
        "Authors": "By Monks, Christopher",
        "Description": "For anyone who has ever felt like life is like a video game comes this faux game guide for a fictional adventure video game titled ''Your Life.''Fans of videogames or anyone who has ever held a controller will love this romp through life's challenges from the formative Toddler Years all the way to the Retirement Home. Complete with navigation, instructions for which buttons to press on your gamepad, and secret codes for success, you'll find out all the tricks to win such challenges as ''Navigating the School Cafeteria on the First Day of High School'' and ''Temp Job Derby.'' Plus you'll learn the important skill of fending off giant robots. Gamepad not included.",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Christopher Monks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Tuscany for Beginners: A Novel",
        "Authors": "By Edwards-Jones, Imogen",
        "Description": "Oh, the dream of escaping to Italy–and the nightmare of reality. . . .Belinda Smith has found her very own Tuscan valley in the sun, having abandoned a dreary cheating husband and an even drearier English town. Running Casa Mia, her own too, too divine bed and breakfast, everything is coming up sunflowers and olive groves for La Contessa of the Valley. Life couldn’t be more perfecto! Until, that is, the arrival of Lauren–a beautiful, feisty Wall Street ball-breaker who has the gall to announce her plans to open a new B&B. A place just like Belinda’s–only much more glamorous. Even worse, Lauren, whose charmingly calculated smile Belinda recognizes as quite like her own, threatens Belinda’s existence as the epicenter of all things ex-patriot in the valley.  Have Belinda’s fabulous days of ruling supreme in this corner of the world come to an end? Will the carnivorous Lauren consume Belinda’s dreams al fresco? Will Lauren’s gorgeous son Kyle steal Belinda’s lovely, overworked daughter away from home and hearth (who will do the cleaning, for God’s sake?). War has come to lovely Tuscany–let the fur and focaccia fly!",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Passing by Samaria",
        "Authors": "By Foster, Sharon Ewell",
        "Description": "When the discovery of a schoolmate's lynched body puts her own life in jeopardy, Alena is sent by her parents from her beloved Mississippi home. With thousands of other African-Americans, Alena begins making her way north to the Promised Land of turn-of-the-century Chicago. On the way she meets two men who will dramatically impact her life: James, a young African-American believer determined to establish a newspaper in Chicago, and Pearl, a man with questionable intentions. A stirring novel by an exciting new writer, Passing by Samaria beautifully shows readers the path to truth, purpose, reconciliation, and joy.",
        "Category": " Comics & Graphic Novels , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Titian Committee (Art History Mystery)",
        "Authors": "By Pears, Iain",
        "Description": "Sent to Venice by Rome's Art Theft Squad to help local police solve a murder, Flavia di Stefano teams up with the local carabinieri to catch the killer of a member of the famed Titian research committee. Reprint.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "House Beautiful Kitchens (Great style series)",
        "Authors": "By Sheehan, Carol Sama",
        "Description": "Looks at three kitchen styles, and discusses functionalism, storage, finishes, and decorative touches",
        "Category": " House & Home , Decorating",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "USA Today : The Complete Four Sport Stadium Guide",
        "Authors": "By USA Today",
        "Description": "Covers ballparks, stadiums, and arenas",
        "Category": " Sports & Recreation , Reference",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Nothing Special",
        "Authors": "By Smith, Steve (EDT) and Beck, Charlotte Joko",
        "Description": "WHEN NOTHING IS SPECIAL, EVERYTHING CAN BEThe best-selling author of 'Everyday Zen' shows how to awaken to daily life and discover the ideal in the everyday, finding riches in our feelings, relationships, and work. 'Nothing Special' offers the rare and delightful experience of learning in the authentic Buddhist tradition with a wonderfully contemporary Western master.",
        "Category": " Religion , Buddhism , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "2000 What Color is Your Parachute",
        "Authors": "By Bolles, Richard Nelson",
        "Description": "A comprehensive job hunting guide offers sound advice to anyone contemplating a career change or fantasizing about a new job. Simultaneous.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "In Danger's Path (The Corps, Book 8)",
        "Authors": "By Griffin, W. E. B.",
        "Description": "Put in charge of the OSS's Pacific operations, General Fleming Pickering is faced with two covert missions in the Gobi Desert.  Called to duty is a Marine he doesn't expect...a scapegrace pilot named Malcolm, his son.  Together, they will venture incognito--and with luck they may even come out alive...",
        "Category": " Fiction , War & Military",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Stitch By Stitch Volume 1 (Volume 1)",
        "Authors": "By No Author",
        "Description": "",
        "Category": "",
        "Publisher": "TORSTAR BOOKS",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Bake Me I'm Yours... Cookie",
        "Authors": "By Smith, Lindy",
        "Description": "This indulgent array of exquisite colorful cookies brought to you from best-selling author and sugarcrafter Lindy Smith shows readers must how easy it is to bake a range of cookie recipes, then get creative with endless ideas for icing, decorating and presentation to gain irresistible results.Cookie lovers will be amazed at the variety, from simple single cookies to enjoy with coffee, to those transformed into wedding favors, decorations or even towering celebration displays. With mouthwatering photography, tempting tips and a wide range of easy-to-follow indulgent projects, no one will be able to resist this celebration of the world of cookies.",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Caribbean Cruising",
        "Authors": "By Hawthorne, Rachel",
        "Description": "The perfect summer story of a girl, several boys, and a cruise ship full of possibilities.Lindsay has never been on a cruise, but she knows exactly what she wants to do now that she is: climb a waterfall, snorkel, meet lots of cute guys, and look for one perfect guy for a summer fling.But her to-do list isn't going according to plan, especially when she discovers that it's impossible to have a fling-when you're actually falling in love.",
        "Category": " Young Adult Fiction , Social Themes , New Experience",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Into the Fire: A Novel (Troubleshooters)",
        "Authors": "By Brockmann, Suzanne",
        "Description": "Suspense doesn’t burn any brighter and desire doesn’t run any deeper than when Suzanne Brockmann takes the helm, opens the throttle, and takes readers along for a breathless ride as she breaks the thrill barrier–again and again. With Into the Fire, Brockmann lights the fuse on her most explosive story yet.Vinh Murphy–ex-Marine and onetime operative for the elite security firm Troubleshooters Incorporated–has been MIA ever since his wife, Angelina, was caught in a crossfire and killed during what should have been a routine bodyguard assignment. Overcome with grief, Murphy blames the neo-Nazi group known as the Freedom Network for her death. Now, years later, Freedom Network leader Tim Ebersole has been murdered–and the FBI suspects Murphy may have pulled the trigger. To prevent further bloodshed, Murphy’s friends at Troubleshooters scramble to find him and convince him to surrender peacefully.Murphy himself can’t be sure what he did or didn’t do during the years he spent mourning and lost in an alcohol-induced fog. He does know he occasionally sought solace from Hannah Whitfield, a former police officer and the very friend who’d introduced him to his beloved late wife.But Hannah, still grappling with the deafness that resulted from an injury sustained while on duty, was fighting her own battles. For years Hannah had feelings for Murphy, and one painful night their suffering brought them together in a way neither expected–and both regretted.Murphy is ready to rejoin the living. As always, he finds himself knocking on Hannah’s door, and as always, his longtime friend welcomes him back into her home. Yet even as Murphy slowly rebuilds his splintered life, he continues to fight his growing feelings for Hannah. Then he learns of Ebersole’s murder and comes to believe that the Freedom Network has targeted him–and Hannah–to avenge their leader’s death to violence. Now Murphy must face the terrifying prospect of losing another woman he loves. As the Troubleshooters desperately search for him, Murphy races toward a deadly confrontation with the Freedom Network and ultimate choice: surrender his life in hopes that Hannah will be spared, or risk everything to salvage whatever future they may have together.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Simply Perfect (Simply Quartet)",
        "Authors": "By Balogh, Mary",
        "Description": "Against the seductive backdrop of Regency England, New York Times bestselling author Mary Balogh sweeps us into the sensual, enthralling world of four teachers at an elite academy for young ladies. As headmistress of Miss Martin’s School for Girls in Bath, Claudia Martin long ago resigned herself to a life without love. Until Joseph, Marquess of Attingsborough, arrives unannounced and tempts her to toss away a lifetime of propriety for an affair that can only lead to ruin, embarking on a plan of seduction that leaves them both yearning for more. But Claudia knows she has no place in Joseph’s aristocratic world. And now that world is about to be rocked by scanda.…An arranged marriage, a secret that will shock the ton, and a man from Claudia’s past conspire to drive the lovers apart. But Joseph is determined to make Claudia his at any cost—even if that means breaking every rule for a love that is everything he has ever wanted.…",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Samantha's Craft Book: A Look at Crafts from the Past With Projects You Can Make Today (American Girls Pastimes Collection)",
        "Authors": "By Evert, Jodi (EDT), Bernstein, Rebecca Sample (EDT), Strigenz, Geri K. (ILT), and Salisbury, Mark (ILT)",
        "Description": "Presents turn-of-the-century crafts",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Expectations:Best Kept Secrets Every Mother Knows",
        "Authors": "By Weber, Jill (ILT), Weber, Jill, and Bilsky, Terry Lee",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Draw Flowers",
        "Authors": "By Kinnealy, Janice",
        "Description": "Shows how to draw tulips, daffodils, petunias, marigolds, violets, chrysanthemums, sunflowers, roses, pansies, daisies, foxgloves, dandelions, buttercups, strawberries, and prickly pears",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Watermill Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "New Inspirations in Wedding Florals",
        "Authors": "By Rye, Terry L.",
        "Description": "Make your wedding extraordinary with these inspired floral creations!For years to come, the colors and fragrances of your wedding flowers will be potent reminders of the big event. Now you can make those memories last forever with New Inspirations in Wedding Florals - a completely illustrated guide to making unique, innovative and exciting floral designs.Terry Rye provides step-by-step guidelines and expert advice for creating beautiful floral arrangements that reflect your taste and personality, look professional and are sure to make the big day unforgettable. It's like having your very own wedding floral consultant!You'll find 28 unique, beautiful projects with variations and clear instructions that will help make your wedding more special than you ever imagined.Projects include something for every aspect of your wedding:Bridal and bridesmaids' bouquetsCorsages, boutonnieres and flower girl accessoriesArrangements for the ceremony including pew decorationsTable centerpieces and wedding cake tops for the reception and more!Also included are planning tips, budgeting ideas and the best ways to choose a theme to create elegance and add a creative, personal touch.Bouquet projects include:Pearl and Ribbon BouquetGardenia Tassel BouquetIvy Collar Clutch BouquetVictorian Holiday BouquetCascade Nouveau BouquetExotic Calla Lily BouquetRosy Biedermeier BouquetAutumn Daisy BouquetTrailing Orchid BouquetGarden-Inspired Bouquet",
        "Category": " Crafts & Hobbies , Flower Arranging",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Angel Reluctant",
        "Authors": "By Yarina, Susan C.",
        "Description": "",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Jocelyn Hollow Romance",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Writer's Digest Guide To Query Letters",
        "Authors": "By Burt-Thomas, Wendy",
        "Description": "Make That Crucial, Positive First ImpressionAnyone who's researched the marketplace knows: The path to publication begins with your query letter. If your query is weak, unfocused, or uninspired, an editor or agent won't even bother to request your article, novel manuscript, or nonfiction book proposal. But a well-crafted, compelling query sent to the right editor or agent is an essential sales tool for fiction writers and the most effective way for nonfiction writers to pre-sell your idea.In this book, professional freelance writer and magazine editor Wendy Burt-Thomas shares practical advice on how to craft persuasive letters that connect with editors and agents and ultimately generate sales for you. You'll learn how to:Conduct targeted research to find suitable editors and agentsHook an editor with a tantalizing lead and shape a summary that compels editors to buySelect the strongest slant for your book or articleUse research and interview shortcuts that keep your query prep profitableMake your query rejection-proof by weeding out subtle mistakes that can sabotage your projectCommunicate your author platform and sell yourself as the best writer for the subjectComplete with dozens of sample queries&#150some that landed article assignments, agents, or book deals, and others that never stood a chance&#150this book offers you a comprehensive strategy for presenting your writing ideas in a way that will increase your chances of publication. Though the title may lead some to believe it's strictly to be shelved as a reference manual, The Writer's Digest Guide to Query Letters is a smooth read from cover to cover.",
        "Category": " Language Arts & Disciplines , Style Manuals",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Women in Love",
        "Authors": "By Lawrence, D. H.",
        "Description": "Lawrence explores the complex relationship between two couples in a novel set in a small, Midlands colliery town",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1976"
        }
    },
    {
        "Title": "3,500 Good Jokes for Speakers: A Treasury of Jokes, Puns, Quips, One Liners and Stories that Will Keep Anyone Laughing",
        "Authors": "By Lieberman, Jerry",
        "Description": "The ultimate compendium of wit and humor for all occasions from business meetings to sales presentations to professional conventions to political rallies to rehearsal dinners--all organized by topic and fully indexed by subject. A treasury of jokes, puns, quips, one-liners, and stories to start a speech off right, keep any audience chuckling, and add some welcome comic relief anywhere its required.",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "Crown Archetype",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1975"
        }
    },
    {
        "Title": "Improvisation Starters",
        "Authors": "By Bernardi, Philip",
        "Description": "Most beginning actors assume that rehearsing a play or scene involves taking home the script, memorizing lines, and rehearsing scenes over and over until everything&#151;timing, movement, facial expression&#151;is perfect. But that's only partially correct. One missing element in that approach is improvisation, an invaluable technique that can be used in acting classes and in rehearsals for school, amateur and professional productions.Most teachers and directors realize that value of improvisation as a regular part of their classes or rehearsals, but many find it difficult to come up with fresh ideas on a daily basis. The nine hundred improvisation ideas in this book should provide enough material to last for years.What the book includes can be applied to many theater situations. For example, there are many improvisation starters for character conflicts&#151;teen/parent, peer relationships, love relationships, co-workers, doctor/patient, brother/sister, and more; solo improvisations; physical positions (for one or two players); lines of dialogue; and reactions to environment. The author also has included a section suggesting a variety of improvisations for the production of Romeo and Juliet.",
        "Category": " Performing Arts , Theater , Stagecraft & Scenography",
        "Publisher": "Betterway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Ultimate Celebration Cards (Crafts Beautiful)",
        "Authors": "By Crosland, Sarah (EDT)",
        "Description": "The ultimate book in holiday cardmaking! Readers will be able to create stunning cards to celebrate special events throughout the year with this collection of over 200 beautiful cards from some of the top designers in the craft. Each section of the book features a selection of quick-to-make cards for each season, with full step-by-step instructions. A gallery of fast cards in seasonal colors provides further inspiration for readers. Novice papercrafters will enjoy learning new skills while experienced crafters will be inspired by the variety of techniques, including rubber stamping, embossing, die-cutting and quilling. With so many unique cards to choose from, every crafter will find this to be a valuable resource for every card occasion.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Quick Guide: Floors: Step-by-Step Remodeling Techniques",
        "Authors": "By Editors of Creative Homeowner",
        "Description": "Whether readers are installing, repairing or decorating their floor, this Quick Guide shows them how to do it as quickly and efficiently as a professional. The most essential information readers need to successfully handle each task is packed into this concise manual. Over 190 detailed drawings clearly illustrate the step-by-step instruction, which has been written with the do-it-yourselfer in mind. With the help of this Quick Guide, readers can add value to their home while enjoying the greatest possible savings in time, effort, and money.",
        "Category": " House & Home , General",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Distant Neighbors",
        "Authors": "By Riding, Alan",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "God Loves A Poet",
        "Authors": "By Huckleberry, Jim",
        "Description": "Heart and soul is who you are. The most critical element of a poem is truthfulness. Truth is not a popular choice so expect rejection. Be content to have your poem published. Many will share your deepest thoughts and inner feelings.",
        "Category": " Poetry , Inspirational & Religious",
        "Publisher": "Airleaf Publishing",
        "Price Starting With ($)": "10.49",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Conviction: A Novel (Christopher Paget)",
        "Authors": "By Patterson, Richard North",
        "Description": "When the body of nine-year old Thuy Sen is found in the San Francisco Bay, the police quickly charge Rennell and Payton Price with her grisly murder. A twelve-person jury, abetted by an incompetent defense lawyer, is nearly as quick to find the brothers guilty, and to sentence them both to die for their crimes.Fifteen years later, overworked pro bono laywer Teresa Peralta Paget, her husband Chris, and stepson Carlo, a recent Harvard law graduate, become convinced not only that Rennell didn't receive a fair trial but that he may well be innocent. Racing against the clock and facing enormous legal obstacles, Teresa, Chris, and Carlo desperately try to stay Rennell's execution, taking the case all the way to the Supreme Court, and to an enormously moving and powerful conclusion.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Fools Die",
        "Authors": "By Puzo, Mario",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Andersen's Fairy Tales (Wordsworth Children's Classics)",
        "Authors": "By Andersen, Hans Christian",
        "Description": "",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "101 Do-it-yourself Projects",
        "Authors": "By Reader's Digest Association",
        "Description": "Details, in step-by-step instructions, photographs, and drawings, more than one hundred functional and decorative home projects, stressing practical skills and techniques and enjoyment",
        "Category": " Technology & Engineering , General",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Dodge & Plymouth Neon (1995-1999) Haynes Repair Manual (USA)",
        "Authors": "By Scott, Ed",
        "Description": "Haynes offers the best coverage for cars, trucks, vans, SUVs and motorcycles on the market today. Each manual contains easy to follow step-by-step instructions linked to hundreds of photographs and illustrations. Included in every manual: troubleshooting section to help identify specific problems; tips that give valuable short cuts to make the job easier and eliminate the need for special tools; notes, cautions and warnings for the home mechanic; color spark plug diagnosis and an easy to use index.This repair manual covers all Dodge and Plymouth Neon models, 1995-1999.",
        "Category": " Transportation , Automotive , General",
        "Publisher": "Haynes Manuals N. America, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Wordplay: Ambigrams and Reflections on the Art of Ambigrams",
        "Authors": "By Langdon, John",
        "Description": "An insightful look at ambigrams--words that are unchanged when inverted or reflected--shows how the shape of the letters can lend meaning to the word. 20,000 first printing.",
        "Category": " Art , Techniques , Calligraphy",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Making Beaded Jewellery: Over 80 Beautiful Designs to Make and Wear",
        "Authors": "By Case, Barbara",
        "Description": "",
        "Category": " Crafts & Hobbies , Jewelry",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Digital Photography Beyond the Camera: Expert Photoshop and Digital Know-How for Top-Quality Images and Prints",
        "Authors": "By Farrell, Ian",
        "Description": "Step-by-step tutorials and clear, logical instruction on how to enhance digital images with the same finesse as the pros are provided in this illustrated guide that covers everything from retouching to working in black and white. Original.",
        "Category": " Photography , Techniques , Digital",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The A-Z Creative Digital Photography",
        "Authors": "By Frost, Lee",
        "Description": "Arranged in an easy-to-read A-Z format, a collection of techniques for taking digital photography to a new creative level for beginners and experienced digital photographers includes information on correcting and touching up photos, adding special effects, and much more. Original.",
        "Category": " Photography , Techniques , Digital",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Daily Writer: 366 Meditations to Cultivate a Productive and Meaningful Writing Life",
        "Authors": "By White, Fred",
        "Description": "Make Writing a Part of Your Daily RoutineIt isn't always easy to carve out time to devote meaningful thought and energy to your writing. Hectic schedules, distractions, and creative blocks all too often interrupt the dream - postpone it for another day.But with 366 provocative entries - each addressing a specific facet of the writing craft, and accompanied by an in-depth reflection and a stimulating exercise - The Daily Writer provides you with easy entry points into that elusive space where words matter most and helps you to embrace writing as a way of seeing the world.Whether you're looking for a way to better integrate writing into your life, get warmed up before you dive into a bigger work in progress, or overcome an old case of writer's block, The Daily Writer can help you establish and maintain an inspired devotion to the craft.",
        "Category": " Language Arts & Disciplines , Style Manuals",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Master Class: Scenes from a Fiction Workshop",
        "Authors": "By West, Paul",
        "Description": "Paul West, prolific novelist and writer of renown, is also a beloved and famous writing teacher. In Master Class, West re-creates his last writing seminar, filled with wonderful conversation, deep insight into the creative spirit, and terrific tips for good writing. Fifteen students-eager, talented, some new, and some old friends- come together twice a week to talk about great works, to discuss each others' writing, and to open their minds and hearts to the joy, peril, and discipline of striving to write good literature. West, who is dedicated to both great writing and to his students, has class members sleep with a page of Proust under their pillows. Then they begin-writing, talking, analyzing, and critiquing. Each class and each chapter of Master Class offers a heady mix of detailed advice and creative philosophy.Only a few fortunate students were accepted into this seminar. Now readers and writers all over the world can sit with master teacher Paul West, learning not only what makes a great opening sentence, but also how to expand their minds and imaginations.",
        "Category": " Language Arts & Disciplines , Writing , Authorship",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Another Almanac of Words at Play",
        "Authors": "By Willard R. Espy",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Night at the Museum: The Junior Novelization",
        "Authors": "By Goldman, Leslie",
        "Description": "Here is a novelized version of the new hit comedy film released by Fox Studios in December '06. It's an expanded version of Milan Trenc's picture storybook for children,  The Night at the Museum,  which was first published by Barron's several seasons ago. On his very first night at work, the night guard at New York's Museum of Natural History begins to see the museum's exhibits come to life. He tells his son about the many strange things he sees each night. At first reluctant to believe his father's fanciful tales, the son begins to see Dad in a new light when he, too, spends a night at the museum.  He discovers that his father's amazing world is real. The film's unusual and entertaining story, starring Ben Stiller, Robin Williams, Mickey Rooney, and Dick Van Dyke, is faithfully recreated in this funny and fanciful novelization for young readers.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "B.E.S.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "They Have A Word For It: A Lighthearted Lexicon of Untranslatable Words and Phrases",
        "Authors": "By Rheingold, Howard",
        "Description": "Examples taken from more than forty different languages demonstrate the ability of other languages to provide words for objects or thoughts that English lacks",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Lee's Lieutenants: A Study in Command, Vol. 2: Cedar Mountain to Chancellorsville",
        "Authors": "By Freeman, Douglas Southall",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "The Random House Guide to Good Writing",
        "Authors": "By Ivers, Mitchell",
        "Description": "Clear, concise, effective, THE RANDOM HOUSE GUIDE TO GOOD WRITING is for anyone who wishes to communicate well in writing. Mitchell Ivers shows us how to master the medium and the message with an array of features: Precise guidelines on word usage, grammar, and punctuation--and how to decide with \"rules\" you can discard to suit your purpose; How to choose the tone and style appropriate to your audience and subject; The essential components of plot in fiction and structure in nonfiction, and much more.An Alternate Selection of the Book-of-the-Month ClubA Main Selection of the Writer's Digest Book ClubFrom the Paperback edition.",
        "Category": " Reference , Writing Skills",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Grammar Smart Junior: Good Grammar Made Easy",
        "Authors": "By Princeton Review (COR) and Buffa, Liz",
        "Description": "A non-technical, enjoyable guide for fourth- to eighth-graders uses games and amusing stories to teach the rules of grammar and sentence structure. Original. 25,000 first printing.",
        "Category": "",
        "Publisher": "Princeton Review",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Sizzle and Burn (Arcane Society, Book 3)",
        "Authors": "By Krentz, Jayne Ann",
        "Description": "Lonely and reluctant psychic Raine Tallentyre is targeted for recruitment into the secret Arcane Society by fellow psychic Zack Jones, an effort that is complicated by Raine's painful memories of how the organization shattered her family through an act of betrayal. Reprint.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Craft of Research (Chicago Guides to Writing, Editing, and Publishing)",
        "Authors": "By Williams, Joseph M., Booth, Wayne C., and Colomb, Gregory G.",
        "Description": "Like its predecessor, this new edition reflects the way researchers actually work, in a complex circuit of thinking, writing, revising, and rethinking. It shows how each part of this process influences the others and how a successful research report is a carefully orchestrated conversation between researcher and reader. Among many topics, The Craft of Research explores how to build an argument that motivates readers to accept a claim; how to anticipate the reservations of thoughtful, yet critical readers and respond to them appropriately; and how to create introductions and conclusions that answer that most demanding question, \"So what?\"Celebrated by reviewers for its logic and clarity, this popular book retains its five-part structure. Part 1 provides an orientation to the research process and begins the discussion of what motivates researchers and their readers. Part 2 focuses on finding a topic, planning the project, and locating appropriate sources. This section is brought up to date with new information on the role of the Internet in research, including how to find and evaluate sources, avoid their misuse, and test their reliability.Part 3 explains the art of making an argument and supporting it. The authors have extensively revised this section to present the structure of an argument in clearer and more accessible terms then in the first edition. For example, new distinctions are made among reasons, evidence, and reports of evidence; and the concepts of qualifications and rebuttals, from the first edition, are here recast as acknowledgment and response. Part 4 covers drafting and revising, and offers new information on the visual representation of data. Part 5 concludes the book with an updated discussion of the ethics of research, as well as an expanded bibliography that includes many electronic sources.",
        "Category": " Language Arts & Disciplines , Reference",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Tears Of The Renegade",
        "Authors": "By Howard, Linda",
        "Description": "The return of Cord Blackstone, the vengeful family renegade and a cousin by marriage, brings fear, personal turmoil, passion, and love to Susan Blackstone as they take part in a battle for control of the family company. Reissue.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Modern Cost Management & Analysis (Barron's Business Library Series)",
        "Authors": "By Siegel, Joel G. and Shim, Jae K.",
        "Description": "",
        "Category": " Business & Economics , Reference",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Creature: A Novel",
        "Authors": "By Saul, John",
        "Description": "A powerful high-tech company. A postcard-pretty  company town. Families. Children. Sunshine.  Happiness. A high school football team that never-ever  loses. And something else. Something horrible ...  Now, there is a new family in town. A shy,  nature-loving teenager. A new hometown. A new set of  bullies. Maybe the team's sports clinic can help him.  Rebuild him. They won't hurt him again. They won't  dare.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Youth Ministry Cargo",
        "Authors": "By Schultz, Joani Lillevold",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Group Pub Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Four Pillars of a Man's Heart: Bringing Strength into Balance",
        "Authors": "By Weber, Stu",
        "Description": "Building upon the \"Four Pillars of Manhood\" model set forth in his bestseller Tender Warrior, author Stu Weber leads readers in an expanded, in-depth biblical exploration of what it means to be a king, warrior, mentor, and friend. Addressing key circumstances faced by men of all ages and backgrounds, Four Pillars of a Man's Heart focuses on areas of struggle and opportunity faced by husbands, fathers, and single men of all ages and backgrounds.",
        "Category": " Religion , Christian Ministry , Pastoral Resources",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Way to Paradise: A Novel",
        "Authors": "By Vargas Llosa, Mario and Wimmer, Natasha (TRN)",
        "Description": "The dramatic lives of two bold, independent adventurers--Paul Gaugin and his grandmother Flora Tristan, a trail-blazing women's suffragist--as imagined by \"one of the master storytellers of our time\" (Chicago Tribune Book World)In 1844, Flora Tristán embarked on a tour of France to campaign for workers' and women's rights. In 1891, her grandson Paul Gauguin set sail for Tahiti, determined to escape civilization and paint primitive masterpieces. Flora died before her grandson was born, but their travels and obsessions unfold side by side in this deft, utterly absorbing novel.Flora, the illegitimate child of a wealthy Peruvian father and French mother, grows up in poverty, and after fleeing a brutal husband, journeys to Peru to demand her inheritance. On her return, she makes her name as a popular writer and a champion of the downtrodden, setting herself the arduous task of touring the French countryside to recruit members for her Workers' Union. Paul, struggling painter and stubborn visionary, abandons his wife and five children for life in the South Seas, where his dreams of paradise are poisoned by syphilis, the stifling forces of French colonialism, and a chronic lack of funds, though he has his pick of teenage Tahitian lovers and paints some of his greatest works.Affectionate, astute, and quietly caustic, this double portrait is a rare study in passion and ambition, as well as the obstinate pursuit of greatness in the face of illness and death, from Mario Vargas Llosa, whose previous novels, The Feast of the Goat, \"pushed the boundaries of the traditional historic novel [in] a book of harrowing power and lasting resonance\" (The New York Times).",
        "Category": " Fiction , Literary",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Jimmy",
        "Authors": "By Whitlow, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Westbow Pr",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Shining Through",
        "Authors": "By Isaacs, Susan",
        "Description": "The ordinary life of legal secretary Linda Voss explodes into passion with her handsome boss and into danger as an OSS spy caught in the heart of Nazi Germany",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "8 Sandpiper Way (Cedar Cove, Book 8)",
        "Authors": "By Macomber, Debbie",
        "Description": "Olivia Lockhart-Griffin Cedar Cove, Washington Dear Reader,  I'm pretty shocked by something I've just heard. Emily Flemming is afraid that her husband, Dave, might be having an affair. She apparently found an earring in his pocket&#151;and it wasn't hers. And she says he's been coming home late and acting secretive. Not only that, some jewelry was recently stolen from an old woman, and Dave (in his capacity as pastor) used to visit her a lot&#133;. This is all so hard to believe! Dave's a good pastor and a good man. He and Emily appear to have the perfect life, with their children, Matthew and Mark, and their lovely home at 8 Sandpiper Way. But I guess things aren't always as they seem. Reader, I'd love to hear what you think, and so does Emily. I have some personal news, too&#151;it's turning out to be a challenging year. But there are also some interesting updates about our friends in Cedar Cove. Like Sheriff Troy Davis, to mention one. Guess what? His long-ago love, Faith Beckwith, has just moved back here! Hope you'll join Emily and me for a cup of tea soon. Olivia",
        "Category": " Fiction , Women",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Making Bread At Home: A Range of Simple and Delicious Recipes From Your Bread Machine",
        "Authors": "By Doeser, Linda",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The New Glucose Revolution Life Plan: Discover How to Make the Glycemic Index the Foundation for a Lifetime of Healthy Eating",
        "Authors": "By Burani, Johanna, Brand Miller, Janette, Foster-Powell, Kaye, Brand-Miller, Jennie, and Lintner, Lisa",
        "Description": "With each passing day, yet another health, diet, and nutrition expert or author gets on the glycemic index (GI) bandwagon. In 2003 The South Beach Diet joined New York Times best-selling books by Dr. Andrew Weil, Harvard's Dr. Walter Willett, Dr. Robert Atkins, Dr. Barry Sears, and many others in advocating taking into account the GI values of foods as a key element in a healthy, lifelong diet. But the authoritative source of information on the GI remains the Glucose Revolution series&#151;and The New Glucose Revolution Life Plan is the book that situates the GI within today's complete nutrition picture. Both an introduction to the benefits of low-GI foods and an essential source of new information for those already familiar with the concept, it charts a clear course through today's complicated nutrition maze&#151;and offers easy-to-follow guidelines for choosing the right diet. This new edition has been revised throughout in two-color with an 8-page photo insert featuring some of the fifty delicious, easy-to-prepare recipes offered in the book, as well as a complete, up-to-date table of GI and new glycemic load values for more than eight hundred foods and beverages.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Eat This, Not That! Thousands of Simple Food Swaps that Can Save You 10, 20, 30 Pounds--or More!",
        "Authors": "By Zinczenko, David and Goulding, Matt",
        "Description": "The original and best-selling installment of EAT THIS, NOT THAT! has helped literally thousands of people improve their lives by increasing their nutritional intakes while blasting away unwanted belly fat. The secret? The revolutionary concept that the battle of the bulge is won not through deprivation and discipline, but by making a series of simple food swaps that can save you hundreds – if not thousands – of calories a day. EAT THIS, NOT THAT! is the only book that holds the food industry accountable for the surreptitious loads of sugar, fat, and sodium stuffed into foods that were once reliable sources of lean nutrition. It arms you with the savvy tricks and insider information you need to eat well in today's dangerous food landscape. With EAT THIS, NOT THAT! you're the expert in every eating situation, from the frozen food aisle to your favorite fast food joint to your local sports bar. You control your food universe--and lose the pounds you want--because, unlike every other customer, you'll know the smart choices to make--instantly! Now get this: The pressure from EAT THIS, NOT THAT! is actually reshaping the food landscape to your benefit! Since it's original publication in 2007, here's how some restaurants have responded:· Baskin Robbins eliminated its 2,300-calorie Heath Bar Shake.· Outback Steakhouse downsized its Aussie Cheese Fries from 2,900 calories to 2,140 calories.· Macaroni Grill replaced the 1,120-calorie Kids' Double Mac ‘n' Cheese with a more reasonable 670-calorie version.· Restaurants such as Quiznos, Red Lobster, and Olive Garden began publishing nutritional information for the first time ever.· And that's just to name a few!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Battles And Leaders of the Civil War Vol. 3: The Tide Shifts",
        "Authors": "By Robert Underwood Johnson, Clarence Clough Buel",
        "Description": "",
        "Category": "",
        "Publisher": "Castle Books",
        "Price Starting With ($)": "6.02",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Civil War: A Narrative: Volume 1: Fort Sumter to Perryville (Vintage Civil War Library)",
        "Authors": "By FOOTE, SHELBY",
        "Description": "This first volume of Shelby Foote's classic narrative of the Civil War opens with Jefferson Davis’s farewell to the United Senate and ends on the bloody battlefields of Antietam and Perryville, as the full, horrible scope of America’s great war becomes clear. Exhaustively researched and masterfully written, Foote’s epic account of the Civil War unfolds like a classic novel.     Includes maps throughout.   \"Here, for a certainty, is one of the great historical narratives…a unique and brilliant achievement, one that must be firmly placed in the ranks of the masters.\"—Van Allen Bradley, Chicago Daily News \"A stunning book full of color, life, character and a new atmosphere of the Civil War, and at the same time a narrative of unflagging power. Eloquent proof that an historian should be a writer above all else.\" —Burke Davis \"To read this great narrative is to love the nation—to love it through the living knowledge of its mortal division. Whitman, who ultimately knew and loved the bravery and frailty of the soldiers, observed that the real Civil War would never be written and perhaps should not be. For me, Shelby Foote has written it.... This work was done to last forever.\" —James M. Cox, Southern Review",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Facing the Music",
        "Authors": "By Frith, Simon (EDT)",
        "Description": "",
        "Category": " Music , Genres & Styles , Pop Vocal",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Hill Tauk",
        "Authors": "By Ben Brouke",
        "Description": "",
        "Category": "",
        "Publisher": "Whispering Hope Publishing",
        "Price Starting With ($)": "6.86",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Heart of Fire (Heart Trilogy, Book 2)",
        "Authors": "By Martin, Kat",
        "Description": "As a viscount's daughter, vivacious Coralee Whitmore is perfectly placed to write about London's elite in the outspoken ladies' gazette, Heart to Heart. But beneath her fashionable exterior beats the heart of a serious journalist.So when her sister's death is dismissed as suicide, Corrie vows to uncover the truth, suspecting the notorious Earl of Tremaine was Laurel's lover and the father of her illegitimate child. Corrie infiltrates Castle Tremaine posing as a wide-eyed country relation whose charming figure? and reduced circumstances?make her irresistible to the confirmed scoundrel. But Corrie finds the earl is not all he seems?nor is she immune to his charms, however much she despises his caddish ways.Far from a society column, Corrie's life soon reads more like one of Mr. Dickens's serials. But the danger of her ruse is hardly fictional: someone is bent on ensuring Corrie's questions go unanswered?and unasked.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Highland Wolf",
        "Authors": "By Howell, Hannah",
        "Description": "New York Times BestsellerNew York Times bestselling author Hannah Howell returns to the breathtaking Scottish Highlands with the unforgettable Murray clan and the stunning Annora MacKay who cannot resist the desire an alluring stranger offers. . .Annora MacKay senses a disturbing evil in Dunncraig Keep, the estate acquired by her cousin, a cruel and ruthless man. Only her affection for the tiny girl he claims is his daughter stops her from fleeing. Then a mysterious woodcarver arrives at the castle, and she cannot stop thinking--or longing--for him. . . James Drummond, once a laird now an outcast, wants what was stolen from him--his good name, his lands, and his child. His disguise for getting into Dunncraig is step one of his plan, but the enticing raven-haired woman who cares for his daughter is an unwelcome surprise. For he has come seeking justice, not love. . . Praise for Hannah Howell and her Highland novels. . .\"Few authors portray the Scottish highlands as lovingly or colorfully as Hannah Howell.\" --Publishers Weekly\"Expert storyteller Howell pens another Highland winner.\" --Romantic Times",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Temptress",
        "Authors": "By Deveraux, Jude",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Creative Wedding Florals You Can Make",
        "Authors": "By Rye, Terry L.",
        "Description": "Imagine your vision of a beautiful wedding becoming reality!Create your very own floral arrangements for priceless wedding memories with a personal touch. Terry Rye, a professional florist with twenty years of experience, will teach you step-by-step how to design more than 20 stunning floral arrangements. You'll find something for every part of your wedding - from the bride's bouquet to boutonnieres, from pew decorations to table centerpieces and wedding cake toppers.Whether you are the bride-to-be, a member of the wedding party, a friend or an aspiring floral designer, this book is your guide to easily creating beautiful wedding florals with striking results.Plenty of tips and ideas make the experience rewarding and enjoyable, including:Wedding Flower Planning: Learn to select the flowers that will reflect your personal style, coordinate with your overall color scheme and stay within your budgetBasic Floral Arranging Techniques: Discover the best way to cut, arrange and preserve flowers, with suggestions for using alternate color schemes or silk flowersBow Making 101: Find out how to make the right bow to complement any bouquet",
        "Category": " Reference , Weddings",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Retreat With Honor (Battles & Leaders of the Civil War Vol.4)",
        "Authors": "By Johnson, Robert U.",
        "Description": "Battles and Leaders of the Civil War is recognized as the outstanding history of the War between the States to come out of the 19th century. THis series was originally conceived in 1883 by the editors of Century Company, who set out to provide an accurate, unbiased account of the war. It was authored by the commanders and their subordinates from both the Confederate and Union forces who actually fought, planned or were eyewitnesses to the events they describe therein.Volume 4 relates the events that led to the end of the war. It opens with a detailed description of the land and sea operations at the Battle of Charleston. Grant's Wilderness Campaign and Sherman's march to Atlanta are vividly portrayed. After mounting the final actions in Arkansas, Missouri and Tennessee, this volume depicts the closing naval operations, Sherman's march through the Confederacy and climaxes with Lee's surrender at Appomattox.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Castle Books",
        "Price Starting With ($)": "6.62",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Seasons of the Heart",
        "Authors": "By Freeman, Cynthia",
        "Description": "Ann Pollock's marriage to Marc Coulter, an aristocratic lawyer, seems a dream come true--until World War II combat defeats his vitality and returns a stranger who once was her loving husband",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Quick and Clever Instant Cards: Over 65 Time-Saving Designs",
        "Authors": "By Hickey, Julie",
        "Description": "Featuring more than 100 easy-to-make designs for popular holidays and celebrations, this colorful guide to the homemade card covers all the materials necessary to make beautiful hand-crafted cards. Original.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Messenger (Gabriel Allon)",
        "Authors": "By Silva, Daniel",
        "Description": "On the trail of a deadly al-Qaeda operative, Gabriel Allon returns in a spellbinding story of deception, power, and revenge by the #1 New York Times bestselling \"world-class practitioner of spy fiction\" (Washington Post).Gabriel Allon—art restorer and spy—is about to face the greatest challenge of his life. An al-Qaeda suspect is killed in London, and photographs are found on his computer—photographs that lead Israeli intelligence to suspect that al-Qaeda is planning one of its most audacious attacks ever, aimed straight at the heart of the Vatican. Allon and his colleagues soon find themselves in a deadly duel of wits against one of the most dangerous men in the world—a hunt that will take them across Europe to the Caribbean and back. But for them, there may not be enough of anything: enough time, enough facts, enough luck.All Allon can do is set his trap—and hope that he is not the one caught in it.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "The Investigators (Badge of Honor No. 7)",
        "Authors": "By Griffin, W. E. B.",
        "Description": "A brutal crime...A group of urban terrorists...An investigation of dirty cops...The leads in these supposedly unconnected cases have become tangled in some very ugly--and dangerous--knots. Now Special Operations detective Matt Payne and his colleagues find themselves fearing not only for their jobs, but also for their very lives...",
        "Category": " Fiction , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "One Step Closer: Why U2 Matters to Those Seeking God",
        "Authors": "By Scharen, Christian",
        "Description": "U2 is widely hailed as the greatest rock and roll band in the world, and lead singer Bono is often seen in the media touting humanitarian goals. Now Christian Scharen provides a thoughtful look at the driving force behind the band. Bono and other band members are marked by the Christian faith of their Irish backgrounds. Scharen reflects on how U2 \"fits within the longer Christian tradition of voices that point us to the cross, to Jesus, and to the power of God's ways in the world\" as he explores the music's honest spiritual questioning. Music lovers, pastors, and anyone on the path to God will value this book.",
        "Category": " Music , Genres & Styles , Rock",
        "Publisher": "Brazos Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Chicken A La King And The Buffalo Wing: Food Names And The People And Places That Inspired Them",
        "Authors": "By Gilbar, Steven",
        "Description": "Hungry for a little culinary trivia?We all know that the sandwich and eggs Benedict are named after people and that Dover sole and Irish stew are named after places. But how about the Granny Smith apple or the Bing cherry, the Bermuda onion or Anaheim chile?In Chicken a la King & the Buffalo Wing, you'll find bite-sized entertaining histories of how certain foods and beverages came to be named after people or places&#150complemented by more than forty-five scrumptious pull-out recipes. This fun and informative reference \"menu\" is perfect for foodies and language lovers alike. Bon appétit!",
        "Category": " Cooking , Essays & Narratives",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Word Mysteries & Histories: From Quiche to Humble Pie",
        "Authors": "By American Heritage Publishing Company",
        "Description": "Describes the meanings of hundreds of words and phrases, and traces the history of these items back to their origins",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "The Reading Group Book: The Comp Gd to Starting and Sustaining a Reading Group...",
        "Authors": "By Hughes, Holly and Laskin, David",
        "Description": "The complete guide to starting and sustaining a reading group, with annotated lists of 250 titles for provocative discussion. This lively, down-to-earth book, based on the experiences of groups across the country, is a complete guide to reading groups—from getting a new one going to sparking lively discussions to revitalizing a long-established group.    This one-stop handbook covers the history of reading groups, how to attract people who love good books and good conversation, and even what food to serve. Authors David Laskin and Holly Hughes provide wise advice on choosing the right people for the group; where, when, and how often to meet; whether or not to select a leader; and—most important—finding the right books to read. What makes this book especially inviting are the annotated lists of more than 250 books by category—southern writers, all-time favorites, memoirs, biographies, travel books, Nobelists, and dozens more.   Filled with funny and insightful stories from book group members, independent booksellers, and even a sociologist who has studied the phenomenon, this distinctive guide will inspire the start-up of new groups and provide existing groups with renewed inspiration and fresh ideas.",
        "Category": " Reference , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Painless Spelling (Painless Series)",
        "Authors": "By Elizabeth, Mary and Morehouse, Hank (ILT)",
        "Description": "The author points out ways in which recognizing sound and letter patterns makes spelling easier. Also important are recognition of diphthongs, silent letters, compound and abbreviated words, contractions, homophones, homographs, prefixes, suffixes, and base words. “Brain tickler” problems challenge students’ imaginations and test their learning progress.  Barron’s popular Painless Series  of study guides for middle school and high school students offer a lighthearted, often humorous approach to their subjects, transforming details that might once have seemed boring or difficult into a series of interesting and mentally challenging ideas. Most titles in the series feature many fun-to-solve “Brain Tickler” problems with answers at the end of each chapter.",
        "Category": " Language Arts & Disciplines , Spelling & Vocabulary",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Ribbons",
        "Authors": "By Niney, Lucie (ILT)",
        "Description": "",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "It's Not About the Truth: The Untold Story of the Duke Lacrosse Rape Case and the Lives It Shattered",
        "Authors": "By Yaeger, Don and Pressler, Mike",
        "Description": "Mike Pressler walked into the bottomfloor meeting room of the Murray Building and, as he had done hundreds of times over a sixteen-year career at Duke University, prepared to address his men's lacrosse team. Forty-six players sat in theater-style chairs, all eyes riveted forward.It was 4:35 P.M. on Wednesday, April 5, 2006. The program's darkest hour had arrived in an unexpected and explosive announcement.Pressler, a three-time ACC Coach of the Year, informed his team that its season was canceled and he had \"resigned,\" effective immediately. While his words reverberated off the walls, hysteria erupted. Players cried, confused over a course of events that had spun wildly out of control. What began as an off-campus team party with two hired strippers had accelerated into a rape investigation -- one that exposed prosecutorial misconduct, shoddy police work, an administration's rush to judgment, and the media's disregard for the facts -- dividing both a prestigious university and the city of Durham.Wiping away tears, Pressler demonstrated the steely resolve that helped him win more than two hundred games. For the next thirty minutes, Pressler put his personal situation aside and encouraged his players to stick together. He also made a bold promise: \"One day, we will get a chance to tell the world the truth. One day.\"This is that day.Pressler, who has not done an interview since the saga began, has handed his private diary from those three weeks to New York Times bestselling author Don Yaeger, exposing vivid details, including the day Pressler was fired, when the coach asked Athletic Director Joe Alleva why the school \"wasn't willing to wait for the truth\" to come out. \"It's not about the truth anymore,\" Alleva said to the coach in a signature moment that said it all. In addition to Pressler, Yaeger interviewed more than seventy-five key figures intimately involved in the case. The result is a tale that defies logic.\"It is tough to be one of fifty people who believed a story when fifty million people believed something else,\" Pressler said. \"This wasn't about the truth to many of the others involved. My story is all about the truth.\"",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Threshold Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Skateboard Book",
        "Authors": "By Ben Davidson",
        "Description": "",
        "Category": "",
        "Publisher": "Tempo",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    }
]