[
    {
        "Title": "Ruth Page's Gardening Journal",
        "Authors": "By Page, Ruth W.",
        "Description": "Covers garden planning, house plants, trees, compost, flowers, herbs, bulbs, vegetables, pest control, and common problems",
        "Category": " Gardening , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Perfect Mistake (Privilege)",
        "Authors": "By Brian, Kate",
        "Description": "MAKE NEW FRIENDS AND KILL THE OLD....  Ariana Osgood has everything she's ever wanted. A place at elite Atherton-Pryce boarding school. Fabulous friends. A new crush. And most importantly, a new identity. Now that she's officially become Briana Leigh Covington, Ariana's troubled past is dead and buried.   Or is it?   When the one person who knows her secret arrives on campus, Ariana decides it's time to say good-bye to her ex-best friend -- forever. From the author of the bestselling PRIVATE novels comes a series about the dark world of wealth, secrets, and PRIVILEGE.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The New Complete Book of Pasta: An Italian Cookbook",
        "Authors": "By Scott, Maria Luisa and Scott, Jack Denton",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Fieldbook of Nature Photography",
        "Authors": "By Maye, Patricia",
        "Description": "Identifies the basic types of cameras, film, and equipment and feaures information on exposure control, shooting landscapes, camera maintenance, underwater photography, and mounting prints",
        "Category": " Photography , General",
        "Publisher": "Random House, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "The Penguin Opera Guide",
        "Authors": "By Kenyon, Nicholas, Walsh, Stephen",
        "Description": "Spanning four centuries of operatic history and drawing on the expertise of more than fifty international contributors, The Penguin Opera Guide is an essential reference for opera enthusiasts and beginners alike. Each of the more than 150 composer entries - from Handel, Mozart, Beethoven, and Verdi to the most acclaimed contemporary composers - presents an outline of the artist's musical career and an overall assessment of his or her contributions to opera. There are entries on more than 450 operas, providing a discussion of the work's background, details of the cast of characters, a plot synopsis, and a musical analysis that directs the listener to highlights and points of interest. Covering both major and little-known composers and tracking the evolution of the operatic form, The Penguin Opera Guide (drawn from the acclaimed Viking Opera Guide) is the perfect companion for those seeking information before attending an opera, a commentary on the music while listening at home, or guidance on operas to see or to purchase on record.",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Easy French Reader",
        "Authors": "By De Roussy De Sales, R.",
        "Description": "The fun and easy way to quickly enhance your French reading skillsEasy French Reader is based on the premise that the best way to learn a language is to start reading it, immediately. Suitable for raw beginners to intermediate-level language learners, this popular title features engaging readings of progressive difficulty that allow you to rapidly build your comprehension.Find out what unfamiliar words and phrases mean with the book's helpful glossaryDiscover the nuances of French language and culture as well as the country's history through engaging textsGet a feel for authentic French society with readings from contemporary literature",
        "Category": " Foreign Language Study , French",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Fox Eyes",
        "Authors": "By Brown, Margaret Wise and Williams, Garth",
        "Description": "A fox causes consternation among the animals whose secrets he discovers. Little do they realize that because of the fox's secret, they have no cause for worry.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Pantheon Books",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "Psychology: A Modular Approach to Mind and Behavior (Available Titles CengageNOW)",
        "Authors": "By Coon, Dennis",
        "Description": "Over 2 million students have learned psychology from Dennis Coon. Serving as a guide and mentor to students, Coon uses humor and everyday analogies to make abstract concepts concrete, such as \"the cerebral cortex looks like a giant, wrinkled walnut.\" Using a consistent pedagogical structure, the author helps students learn psychology by using the tested principles of Survey, Question, Read, Recite and Review. In addition, he helps them to master psychology with a fourth \"R,\" Relate, which requires them to relate their new knowledge to their own experience, helping abstract ideas to become concrete. The book uses a \"chunking\" principle, asking students to read major sections, then review them, before they go on. As the new title of the book indicates, PSYCHOLOGY: A MODULAR APPROACH TO MIND AND BEHAVIOR (formerly called ESSENTIALS OF PSYCHOLOGY) is now modular, and is the medium-sized text in a three-book set authored by Dennis Coon. By separating the chapters into modules, this edition goes even further in \"chunking\" content for student mastery. This text covers the basic set of topics but differs by having two chapters on development, a separate chapter on \"Gender and Sexuality\" (Chapter 15), and a concluding chapter on \"Applied Psychology\" (Chapter 17). The book is frequently described as \"fun\" because it presents topics that are of interest and relevance to students, relates it to their lives, and provides many engaging applications that students can use in their own lives. For teachers who want a book that students will read, enjoy, and savor - Coon's text is the perfect choice.",
        "Category": " Psychology , Psychotherapy , General",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "7.7",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Three readers",
        "Authors": "By FADIMAN, Clifton",
        "Description": "",
        "Category": "",
        "Publisher": "Readers Club",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1943"
        }
    },
    {
        "Title": "Creative Techniques for Photographing Children",
        "Authors": "By Orenstein, Vik",
        "Description": "",
        "Category": " Photography , Techniques , General",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "To Desire a Wicked Duke (Courtship Wars, Book 6)",
        "Authors": "By Jordan, Nicole",
        "Description": "Passion ignites in Nicole Jordan’s delectable, dazzling conclusion to The Courtship Wars.  Two years after losing her beloved fiancé to war, Tess Blanchard feels ready to chance love again. Thus she’s aghast when a threatening scandal forces her to wed her longtime nemesis, Ian Sutherland, Duke of Rotham. The impossibly arrogant, irresistibly seductive nobleman is the last man Tess could ever imagine loving. Making matters worse, she discovers secrets in Rotham’s wicked past that send her fleeing London for his remote castle in Cornwall.Having long desired Tess, Ian is exasperated that the ton thinks he’s driven his reluctant new bride from their marriage bed and follows hard on her heels. Naturally, their spirited rivalry leads to glorious, pleasure-filled nights—complicated by a mysterious ghost who haunts Ian’s castle and Tess’s vexing insistence that he play matchmaker to her friends. But can blazing desire between two warring hearts turn into wedded bliss and timeless love?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Mistletoe and Mayhem (A Special Pennyfoot Hotel Myst)",
        "Authors": "By Kingsbury, Kate",
        "Description": "In this Pennyfoot Hotel Christmas mystery, guests and staff alike are coming together under the kissing bough—only to fall victim to a cold-blooded killer…   At the Pennyfoot Hotel, Cecily Sinclair Baxter and her staff are hustling and bustling more than ever. Cecily’s dear friend Madeline arrives with her new baby and adds a kissing bough to the festive decorations. Cecily gets in the spirit by kissing the precious baby beneath the bough, believing that the holiday couldn’t be getting off to a better start.   But after a footman and a new maid are seen kissing under the bough and turn up dead, the staff is convinced a serial killer is spending the holidays at the Pennyfoot. And when Madeline’s baby disappears, Cecily has her hands full desperately trying to find the child. If she doesn’t catch this killer in time, everyone’s cheer will quickly turn to fear…",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Quebec City (english ed.)",
        "Authors": "By Loverseed, Helga V.",
        "Description": "",
        "Category": "",
        "Publisher": "Irving Weisdorf & Company, Limited",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Curious George Christmas Countdown (CGTV Tabbed BB)",
        "Authors": "By Rabe, Tish",
        "Description": "Curious George is counting the days until Christmas! Join him as celebrates the holiday by picking out a tree, baking cookies, admiring the festive decorations, singing in the Christmas play, and sharing the magic of the season with his friends. Adapted from the TV Christmas special, Curious George Christmas Countdown is a delectable holiday treat for fans to enjoy one sweet poem at a time.The cover includes glittery soft flocking for holiday appeal.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Great Recipes Collection: Diabetic Meals",
        "Authors": "By Carrie Holcomb",
        "Description": "",
        "Category": "",
        "Publisher": "Mrrdth Crpfr Brnrs&Nblr Inc",
        "Price Starting With ($)": "5.28",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "My First Christmas",
        "Authors": "By dePaola, Tomie",
        "Description": "In My First Christmas, warm illustrations and easy-to-follow text celebrate the joys and traditions of this special holiday. From decorating the tree to putting cookies out for Santa, the Christmas spirit is beautifully captured by Tomie dePaola.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Jesus' Life, Teaching, and Ministry ((Great Themes of the Bible: Christ)",
        "Authors": "By Kiely, Harry",
        "Description": "The Bible presents great themes that are universally relevant for the faith formation of all human beings in all times and places.  As we reflect upon faith issues in our daily lives, we can engage these themes to learn more about God and what it means to live a life of faith.  Christ: Jesus' Life, Teaching, and Ministry draws from the gospels of Mark, Matthew, and Luke as guides for exploring Jesus' life, what he taught, and how he cared for others. In this study we learn more clearly what it means to live in God's kingdom now and in the future as Jesus understood and taught. The book offers the following sessions:Session 1, \"Power To Lead\" explores Jesus' baptism, temptation, and miracles and the implications for how God prepares us for leadership.(Mark 1:4-13; 2:1-12)Session 2, “The Prevailing Good” recounts the trials, crucifixion, and Resurrection of Jesus, and what these events teach us about the cost and rewards of faithfulness. (Mark 14:53-65; 15:1-5; and 16:1-8)Session 3, \"Experiencing True Joy\" how living our lives according to Jesus' teachings about the ways of God's kingdom will lead to true happiness and faithful living. (Matthew 5:1-16; Matthew 6:1-18)Session 4, \"Jesus as Storyteller\" shows how Jesus' use of parables can help us understand and practice God's ways in our daily lives. (Matthew 13:1-23; Matthew 18:21-35)Session 5, \"Living Our Faith\" explores how our lives are judged by our deeds of love and mercy.(Matthew 25:31-46)Session 6, \"A Ministry of Compassion\" examines ways Jesus demonstrated that the good neighbor is one who reaches across all boundaries to show mercy to others. (Luke 4:14-30; Luke 8:40-56; Luke 10:25-37)Session 7, \"Humility and Hospitality\" explores Jesus' teachings about humility and hospitality, key features of life lived according to the ways of God's kingdom. (Luke 14:7-24)To see another group study offered by Cokesbury, go to the Adult Bible Studies website.",
        "Category": " Religion , Biblical Commentary , New Testament",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Essential Computers: Digital Photography",
        "Authors": "By May, Alex",
        "Description": "Offers an overview of equipment, photographic techniques, and image manipulation, including storing images, using a flash, composing shots, working with sound and video, transferring data, and using Paint Shop Pro.",
        "Category": " Computers , Interactive & Multimedia",
        "Publisher": "DK",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The New Handbook of Prescription Drugs",
        "Authors": "By Richard Burack",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1977"
        }
    },
    {
        "Title": "About Allergy",
        "Authors": "By Hughes, Albert E.",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Distribution Services",
        "Price Starting With ($)": "5.33",
        "Publish Date": {
            "Month": "March",
            "Year": "1966"
        }
    },
    {
        "Title": "The Bias of Pluralism: An Atherton Controversy",
        "Authors": "By Connolly, William E., Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Atherton Press",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Constitution of the United States: With a Detailed Clause-by-Clause Analysis",
        "Authors": "By Philip Dorf",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford Book Company",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The Tip-Top Tree House",
        "Authors": "By Tucker, Daisy",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Tell-a-Tale Book-Raggedy Andy's Treasure Hunt",
        "Authors": "By Schwalje, Marjory",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Fat Girl",
        "Authors": "By Sachs, Marilyn",
        "Description": "Jeff Lyons canâ??t stand Ellen de Luca, the fat girl in his ceramics class. Sheâ??s huge, clumsy, canâ??t throw a pot to save her life, and stares at Jeff all the time. But heâ??s a \"nice guy\" and feels terrible when Ellen overhears his hurtful remarks about her. The \"crumbs of kindness\" he tosses her way soon turn into advice on weight loss, college, clothes, hair . . . and, to everyoneâ??s surprise, good-looking Jeff actually dumps his pretty girlfriend to be with the fat girl! Re-creating Ellen is a labor of love, Jeff thinks. But as her pounds melt away, Jeff resents the happy, independent young woman he has unleashed. Where is the gratitude for all heâ??s done for her? With this darkly ironic take on the classic Pygmalion tale, Marilyn Sachs offers young readers a candid portrayal of what happens when the intoxicating thrill of control is confused with love.",
        "Category": " Young Adult Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Flux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "What Makes a Man Feel Loved: Understanding What Your Husband Really Wants",
        "Authors": "By Barnes, Bob",
        "Description": "Bob Barnes, bestselling author and devoted husband to author Emilie Barnes, helps wives discover what men think about priorities, desires, and life in his popular book (more than 85,000 copies sold)-- now with a new cover. Drawing from his experience and the experiences of men he has ministered to over the years, Bob reveals:  why differences between men and women enrich marriage how a wife can fulfill the desires of her mate the importance of practicing spiritual submission how to affirm a husband's spiritual leadership  Bob's biblical \"Love in Action\" suggestions and principles remind a woman that her support builds a man's sense of being loved and creates a foundation for a lasting relationship.",
        "Category": " Social Science , Men's Studies",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "2 Minutes a Day Devotionals for Girls - Teens",
        "Authors": "By Family Christian Stores",
        "Description": "",
        "Category": "",
        "Publisher": "Family Christian Stores",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Empire Strikes Back (Step-up Movie Adventures)",
        "Authors": "By Weinberg, Larry (ADP), Brackett, Leigh, and Kasdan, Lawrence",
        "Description": "THE REBELS ARE on the run!  From the Battle of Hoth to the battle between Luke and Darth Vader, The Empire Strikes Back continues the story of Luke, Leia, Han, Chewie, and the others as they struggle to overthrow the evil Galactic Empire.",
        "Category": " Juvenile Fiction , Science Fiction",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "God Is Near: 30 Extraordinary Encounters",
        "Authors": "By",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Group Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Bible in Human Transformation: Towards a New Paradigm for Biblical Study",
        "Authors": "By Wink, Walter",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1973"
        }
    },
    {
        "Title": "A Rattling of Old Bones",
        "Authors": "By Ross, Jonathan",
        "Description": "Detective Superintendent George Rogers is called in to investigate a murder when the body of Judith Quint turns up after having been hidden away in a cupboard for five years",
        "Category": " Fiction , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "The Shy Little Kitten (A Little Golden Book)",
        "Authors": "By Cathleen Schurr",
        "Description": "",
        "Category": "",
        "Publisher": "Western Publishing Company, Inc.",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Cocktail Parties for Dummies",
        "Authors": "By Bee, Jaymz and Gregor, Jan",
        "Description": "Offers tips on throwing a cocktail party, with advice on location, guest list, themes, menus, and music, and includes recipes for snacks and drinks",
        "Category": " House & Home , General",
        "Publisher": "IDG Books Worldwide",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "From Hitler Youth to American Soldier",
        "Authors": "By Herb Flemming, Timothy King",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Morning Publishing",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "The Last Dance but Not the Last Song: My Story",
        "Authors": "By Bondi, Renee and Curtis, Nancy",
        "Description": "",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Ntc's Easy Spanish & English Dictionary",
        "Authors": "By Qualls, Regina M. and Sanchez, L.",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Ntc Pub Group",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Smart Cooking the Costco Way: Delicious Recipes Using Costco Products",
        "Authors": "By Costco",
        "Description": "",
        "Category": "",
        "Publisher": "Costco Wholesale Corporation",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "To Tame a Renegade",
        "Authors": "By Mason, Connie",
        "Description": "While on the trail of a clever bank robber, bounty hunter Chad Delaney finds himself sidetracked by Sarah Temple, a woman shrouded in scandal who needs his help, and her adorable five-tear-old son.  Reprint.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Out of my life and thought,: An autobiography;",
        "Authors": "By Schweitzer, Albert",
        "Description": "",
        "Category": "",
        "Publisher": "H. Holt",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "High Wire: The Precarious Financial Lives of American Families",
        "Authors": "By Gosselin, Peter",
        "Description": "The U.S. economy is wrapping up twenty-five years of some of the strongest, smoothest growth in its history-a performance so sweet economists have given it a name: ?the Great Moderation.” So why have so many of us, even those making hundreds of thousands of dollars, arrived at the new century with a gnawing sense that events are moving against our families and ourselves? The easy answer is that we’re suffering a case of needless anxiety. But the easy answer is wrong. Drawing on interviews with hundreds of Americans and new statistics he developed, Peter Gosselin traces a quarter-century shift of economic risk from the broad shoulders of business and government to the backs of working people. It is a shift that has shaken the pillars of most families’ lives-stable jobs, solid benefits, government protections. The change doesn’t mean one can’t prosper. But it does mean the benefits of growth come at greater peril and your financial fall will be steeper if you stumble. This threat to working Americans’ security-and what to do about it-is a pressing concern to economists, policy-makers, and everyone who works for a living.",
        "Category": " Political Science , Public Policy , Economic Policy",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Forty to Life",
        "Authors": "By Jackson, Dave",
        "Description": "",
        "Category": " Fiction , Christian , General",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Embarking on Murder ((A Beanie and Cruiser Mystery))",
        "Authors": "By Sue Owens Wright",
        "Description": "",
        "Category": "",
        "Publisher": "Worldwide Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Callaghan's Bride",
        "Authors": "By Diana Palmer",
        "Description": "",
        "Category": "",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Wonderful Names of Our Wonderful Lord",
        "Authors": "By Charles E. Hurlburt and T.C. Horton",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Relief For Hurting Parents: How To Fight For The Lives Of Teenagers: How To Prepare Younger Children For Less Dangerous Journeys Through Teenage Years",
        "Authors": "By Scott, Buddy",
        "Description": "",
        "Category": " Family & Relationships , Life Stages , Teenagers",
        "Publisher": "Allon Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Once more around Jericho: The story of the U.S. Center for World Mission",
        "Authors": "By Winter, Roberta H.",
        "Description": "",
        "Category": "",
        "Publisher": "William Carey Library",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Heather, Belle Of The Ball (Magic Attic Club)",
        "Authors": "By Lauter, Richard (ILT), Grote, Rich (ILT), Sinykin, Sheri Cooper, and Tadiello, Ed (ILT)",
        "Description": "A visit to the magic attic transports Heather to another time and place where she learns to value her loyal friends who like her for who she is",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Magic Attic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Complete Directory to Prime Time Network TV Shows 1946-Present",
        "Authors": "By Brooks, Tim",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Southwest USA & Las Vegas (Eyewitness Travel Guides)",
        "Authors": "By DK Publishing",
        "Description": "Offers a portrait of the Southwest along with information on national parks, accommodations, restaurants, shopping, and activities.",
        "Category": " Travel , United States , South , West South Central (AR, LA, OK, TX)",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Connect: 12 Vital Ties That Open Your Heart, Lengthen Your Life, and Deepen Your Soul (New York)",
        "Authors": "By Hallowell, Edward M.",
        "Description": "That last raise may be fattening your bank account, but it did nothing for your soul. The talk you had with your boss about your kids' schools, however, did. Although our culture is focused on achievement, it is not our accomplishments that sustain us. It is the connections we make along the way.  What are these connections? They are the feelings of being part of something that matters, something larger than ourselves, whether it is a friendship, marriage, team, company, or even a set of ideals. They can enrich your life, and their absence can shorten it. They are the key to what counts in life, and they are becoming harder and harder to make.  Now a noted psychiatrist outlines the steps we can take to make or reaffirm the connections that nourish the hungry heart. Through his own life experiences and those who have shared their stories with him, we learn of the great joy and peace that come from connecting, and the consequences of remaining detached. And we learn how to nurture that part of us which is so often neglected, and so very crucial to our emotional, psychological, and physical well-being -- our connections.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Protectionism (Ohlin Lectures)",
        "Authors": "By Bhagwati, Jagdish N.",
        "Description": "A leading international economist looks at many of the key issues of trade policy now confronting the United States and the world in this timely book. Clear, informative, and witty, Jagdish Bhagwati provides the best available analysis of the protection debate and offers a prescription for reform in this turbulent area of trade policy. Bhagwati identifies new and powerful interests and ideologies that are likely to dominate the outcome of the debate. He argues that opposing tendencies can be identified in trade-related ideologies and in the national and sectional interests that lobby on trade policy in pluralistic societies. He offers the prognosis that the forces favoring freer trade are more robust and more fundamental than the forces of protectionism, and that pro trade forces are likely to triumph in the end but only if we adapt appropriately the institutions within which these ideologies and interests must function. Through an appealing combination of text, quotations, cartoons, tables, charts, and graphs, Bhagwati provides a masterly and entertaining look at the forces for and against protection.Protectionism is based on the inaugural series of Ohlin Lectures, which he delivered at the Stockholm School of Economics in October of 1987.",
        "Category": " Business & Economics , International , Economics",
        "Publisher": "Mit Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Brighter Than Gold",
        "Authors": "By Wright, Cynthia",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Perfect Greek (Perfect Cooking)",
        "Authors": "By Not Available (NA)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Greek",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Doll, New Shorter Edition",
        "Authors": "By Carl Fox",
        "Description": "",
        "Category": "",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Fourth Victim (The Chapman Files, 4)",
        "Authors": "By Quinn, Tara Taylor",
        "Description": "Kelly Chapman, psychologist and expert witness. She's unattached, but 100 percent committed to her clients, her foster child, her friends.Clay Thatcher, FBI special agent: Missing Persons. A loner and, like Kelly, he too is unattached but 100 percent committed to his job&#151;and only his job.That's why he's in Chandler, Ohio. Kelly Chapman has disappeared. Is it because she testified against someone who now wants revenge? Or is she the fourth victim of a killer responsible for three recent deaths?Searching for her, Clay has to work against the clock. And Kelly soon becomes more than just another case to him&#133;.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Systems of Psychotherapy: A Transtheoretical Analysis",
        "Authors": "By Prochaska, James O. and Norcross, John C.",
        "Description": "Systematic, comprehensive, and balanced, this stimulating book helps readers understand a wide variety of therapies, including psychoanalytic, Adlerian, existential, person-centered, gestalt, interpersonal, exposure, behavioral, cognitive, systemic, integrative. The book provides an integrative framework that embraces both the essential similarities and the fundamental differences among the psychotherapies.  The authors explore each system's theory of personality, theory of psychopathology, resulting therapeutic process and relationship. By doing so, Prochaska and Norcross demonstrate how much psychotherapy systems agree on the processes producing change while disagreeing on the content that needs to be changed. The limitations, practicalities, and outcome research of each psychotherapy are also presented to bring both the similarities and differences to life, the authors demonstrate how the same complex psychotherapy case (Mrs. C) is formulated and treated by each system.",
        "Category": " Psychology , Psychotherapy , General",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "6.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Snakes (Wildlife)",
        "Authors": "By Badger, David P. and Netherton, John",
        "Description": "A beautifully-illustrated book that begins by addressing humans' mostly irrational, long-standing fear of snakes. Topics include physical characteristics and behavior; families and species (over half of which are North American); conservation; and photography. Literary quotations, trivia, and bits of snake lore are interspersed throughout. For reptile fans, nature fans, and pet snake owners. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Nature , Animals , Reptiles & Amphibians",
        "Publisher": "Voyageur Press",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "I.S. at Your Service: Knowing and Keeping Your Clients",
        "Authors": "By Ouellette, L. Paul",
        "Description": "",
        "Category": " Business & Economics , Reference",
        "Publisher": "Kendall Hunt Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Returning from the Light: Using Past Lives to Understand the Present and Shape the Future",
        "Authors": "By Steiger, Brad",
        "Description": "Recounts the stories of individuals who have resolved personal problems by identifying the source of their problems in previous lives, including a successful film animator who broke free of his phobias by witnessing his own past-life deaths. Original.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Brain Bafflers (Official Mensa Puzzle Book)",
        "Authors": "By Mensa",
        "Description": "",
        "Category": " Games & Activities , Puzzles",
        "Publisher": "Puzzlewright",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Spoiled Rotten (Hyperion Chapters)",
        "Authors": "By Plecas, Jennifer (ILT) and DeClements, Barthe",
        "Description": "When his neighbor and friend, Andy, continually misbehaves in class, Scott fears that Andy will be sent back to the first grade and launches a campaign to straighten out his friend's act. Simultaneous.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Recipes for Arthritis Health (The Johns Hopkins Cookbook Library)",
        "Authors": "By Wilder, Lora Brown (EDT) and Flynn, John A., M.D. (EDT)",
        "Description": "",
        "Category": " Medical , Diseases",
        "Publisher": "Medletter Assoc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "A+ Certification Core Hardware",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Element K Press LLC",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "THE BOOK OF KEY FACTS",
        "Authors": "By Queensbury Group.",
        "Description": "Chronological tables pinpoint key events and facts pertaining to world political, social, and intellectual history from the last Ice Age to the present",
        "Category": " Reference , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "Shaped by the Bible",
        "Authors": "By Willimon, William H.",
        "Description": "William H. Willimon's text about Biblical interpretation was originally published in 1991.",
        "Category": " Religion , Education",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Improving the Quality of Long-Term Care",
        "Authors": "By Institute of Medicine (U. S.) Committee on Improving Quality in Long-te (COR), Kohler, Peter O., and Wunderlich, Gooloo S.",
        "Description": "The quality of care and quality of life in long-term care settings is examined in this study that looks at long-term care for frail older persons and others with chronic conditions and functional limitations in nursing homes, home health agencies, residential care facilities, family homes, and other settings. The study describes the state of long-term care, identifying problem areas and offering recommendations for federal and state policy makers on areas such as enforcing standards, strengthening the workforce, and reimbursement issues. Kohler is president of Oregon Health Sciences University. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "National Academies Press",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Pure Style",
        "Authors": "By Cumberbatch, Jane, Bourne, Henry (PHT), and Bourne, Henry",
        "Description": "Describes how to use color, texture, fabrics, furniture, and decorative objects in the home",
        "Category": " House & Home , Decorating",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Washington D.C.: Souvenir Book",
        "Authors": "By",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "L B Prince Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "A Small Personal Voice",
        "Authors": "By Lessing, Doris May",
        "Description": "Collected works spanning a period of seventeen years reveal the contemporary writer's thoughts on her craft, various writers, her life, and Africa",
        "Category": " Fiction , General",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1974"
        }
    },
    {
        "Title": "Kneeling in Jerusalem",
        "Authors": "By Weems, Ann",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Westminster John Knox Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Kama Sutra",
        "Authors": "By Hooper, Anne",
        "Description": "Get ready to enjoy the most erotic sexual experiences of your life with this gorgeous visual guide. From the author of the Great Sex Guide, celebrated sex therapist Anne Hooper joins contemporary techniques with ancient sexual wisdom. Kama Sutra blends the spice of age-old eroticism with stunning photography and the straightforward instruction of a contemporary sex guide. Based on the classic \"Ananga Ranga\" and \"Perfumed Garden\" positions, Hooper draws aside the veil of myth and mystery surrounding tantric sex and shows how to combine sensuality and sex for a loving, fulfilling relationship.  This book contains exquisitely photographed images of each position, along with vivid, easily approachable instructions. Interspersed between the techniques are sensuous nuggets of wisdom from Vātsyāyana, who wrote the fabled manuscript thousands of years ago, along with expert modern commentary. With over 100 positions, countless variations, and eye-popping photography, Hooper’s ultimate guide to pleasure is sure to satisfy modern lovers, from shy beginners to experienced adventurers, and everybody in between.",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Chicken Soup for the Soul: The Cancer Book: 101 Stories of Courage, Support & Love",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Tabatsky, David (COM), and Bayer, Elizabeth (CON)",
        "Description": "1. People turn to Chicken Soup at stressful times in their lives.  Last general CS cancer book sold 700,000 copies and is twelve years old, so time for new one 2. David Tabatsky was Consulting Editor for the very successful Marlo Thomas book, The Right Words at the Right Times 2 3. After the full length Chicken Soup book (101 stories) is bound in a free memoir from a cancer patient with intimate details of her disease and powerful advice and wisdom 4. Book includes resources section as well, with helpful medical and support resources for patients and familiesA support group you can hold in your hand, this loving and inspirational collection of intimate stories,by cancer patients and their loved ones, medical professionals, clergy and friends, is a must-read for anyone affected by cancer. Writers shsre all their experiences-from the diagnosis, to breaking the news to loved ones, to discussing the effect on home, school and work, from securing a medical team to living through an ever changing self-image, from the embarrassment of losing hair to discovering a new spirituality. A bonus book, a no-holds-barred memoir by cancer patient Elizabeth Bayer,is bound into this volume, after the full-length Chicken Soup for the Soul book.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Chicken Soup for the Soul",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Everything You Always Wanted to Know About Nutrition",
        "Authors": "By Reuben, David R.",
        "Description": "Calorie counting, vitamin supplements, the consumption of meat and sugar, and the truth about fluoride in toothpaste are among the topics considered as Dr. Reuben answers commonly asked questions about diet and health",
        "Category": " Medical , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1979"
        }
    },
    {
        "Title": "Pat Smith's Doll Values, Sixth Edition",
        "Authors": "By Smith, Patricia R.",
        "Description": "Illustrates, describes, and lists the value of a variety of dolls by type and by manufacturer",
        "Category": "",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Power Prayers for Women: Gift Edition",
        "Authors": "By Johnson, Jackie M.",
        "Description": "Prayer changes things-and this practical gift book offers solid biblical reasons to pray and specific prayer starters in 21 key areas of your life. This beautiful new gift book will help you pray, by offering solid biblical reasons to talk to God and specific prayer starters for 21 key areas of life. Topics such as \"My Emotions,\" \"My Home,\" \"My Health,\" \"My Finances,\" \"My Job,\" \"My Fears,\" and \"My Future\" are addressed through scripture and the life experiences of women both historic and contemporary. Concise and quick to read, yet packed with spiritual punch, Power Prayers for Women makes a perfect gift for Mother's Day, birthdays, or other gift-giving occasions. It's priced right at under $15!",
        "Category": " Religion , Christian Living , Women's Interests",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Big Book of $5.00 Gift Crafts",
        "Authors": "By Kim Brittain Plagge",
        "Description": "",
        "Category": "",
        "Publisher": "House of White Birches",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Faith that goes further: Facing the contradictions of life",
        "Authors": "By Dayton, Edward R.",
        "Description": "",
        "Category": "",
        "Publisher": "Multnomah Press",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Stirring the Waters: Writing to Find Your Spirit",
        "Authors": "By Moon, Janell",
        "Description": "Whether you're a seasoned writer or just write an occasional journal entry, Stirring the Waters will enrich your life. With a poet's insight and deft touch, author Janell Moon leads you along a path that helps you to know yourself and thrive spiritually. She provides nine weeks of exercises that will guide you to answer the essential but sometimes impenetrable questions, \"Who am I, and what am I doing here?\"Moon's innovative methods will encourage you to develop a new perspective. \"Streaming,\" one of the many exercises included inStirring the Waters, involves brainstorming, even doodling, across the page. Another exercise, \"clustering,\" shows you how to discover the hidden ideas related to a theme. Moon also introduces other unique thought-provoking techniques such as \"gazing into the waters\" and \"dialoguing\" to help you develop a wise new spirit.As you read and write you way through the exercises of Stirring the Waters, you will discover a clarified vision of yourself, and find the way to the you you you were meant to be.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Tuttle Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "These Too Were Here: Louise Homer And Willa Cather",
        "Authors": "By Elizabeth Moorhead",
        "Description": "",
        "Category": "",
        "Publisher": "University of Pittsburgh Press",
        "Price Starting With ($)": "5.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Parashat Hashavua: Reading Genesis",
        "Authors": "By Baum, Roberta Osser",
        "Description": "",
        "Category": " Foreign Language Study , Hebrew",
        "Publisher": "Behrman House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "A little order: A selection from his journalism",
        "Authors": "By Waugh, Evelyn",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Islamic Threat : Myth or Reality? (Third Edition)",
        "Authors": "By Esposito, John L.",
        "Description": "Are Islam and the West on a collision course? From the Ayatollah Khomeini to Saddam Hussein, the image of Islam as a militant, expansionist, and rabidly anti-American religion has gripped the minds of Western governments and media. But these perceptions, John L. Esposito writes, stem from a long history of mutual distrust, criticism, and condemnation, and are far too simplistic to help us understand one of the most important political issues of our time. In this new edition of The Islamic Threat: Myth or Reality?, Esposito places the challenge of Islam in critical perspective. Exploring the vitality of this religion as a global force and the history of its relations with the West, Esposito demonstrates the diversity of the Islamic resurgence--and the mistakes our analysts make in assuming a hostile, monolithic Islam. This third edition has been expanded to include new material on current affairs in Turkey, Afghanistan, Palestine, and Southeast Asia, as well as a discussion of international terrorism.",
        "Category": " Religion , Islam , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Grave Justice",
        "Authors": "By Ebisch, Glen",
        "Description": "",
        "Category": "",
        "Publisher": "Worldwide",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Shut Up, America!: The End of Free Speech",
        "Authors": "By O'Leary, Brad",
        "Description": "Can you be trusted with free speech? Many politicians in Washington don't think so. They see your right to free speech as a threat to their seat in power. In this hard-hitting book, bestselling author Brad O'Leary exposes the frightening movement afoot that would eviscerate the First Amendment. With his trademark, take-no-prisoners approach, O'Leary shows you how censorship is on the march. From the Orwellian Fairness Doctrine to so-called campaign finance reform, you will learn the real threats, who the enemies of Ben Franklin and Thomas Paine are (including names of senators, congressmen, and Obama administration officials), what they're up to, and how you can fight back and save your freedom. Over two decades ago, Ronald Reagan gave birth to a flourishing, free exchange of ideas when his Federal Communications Commission removed the shackles of the misnamed Fairness Doctrine and restored the First Amendment. However, what was a boon to honest debate has proven to be a nightmare for left-wing politicians. Now these censorship proponents have the upper hand and the First Amendment in their sights.",
        "Category": " Political Science , American Government , National",
        "Publisher": "WND Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "10th Anniversary (Women's Murder Club, 10)",
        "Authors": "By Patterson, James and Paetro, Maxine",
        "Description": "Secrets. Lies. Murder. In this pulse-pounding Women's Murder Club novel, mysteries and lives unravel.Detective  Lindsay Boxer's long-awaited wedding celebration becomes a distant  memory when she is called to investigate a horrendous crime: a badly injured teenage  girl is left for dead, and her newborn baby has been kidnapped without a  trace. As her marriage begins to suffer from the pressures of work and  her new boss watches her every move, Lindsay discovers that the victim  may be keeping secrets as well.At the same time, Assistant  District Attorney Yuki Castellano is prosecuting the biggest case of her  life-a woman who has been accused of murdering her husband in front of  her two young children. Yuki's career rests on a guilty verdict, so when  Lindsay finds evidence that could save the defendant, she is forced to choose. Should she trust her best friend or follow her instinct?With James Patterson's white-hot speed and unquenchable action, 10th Anniversary is the most deliciously chilling Women's Murder Club book ever.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "109.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Recommended Bed & Breakfasts New England (Recommended Bed & Breakfasts Series)",
        "Authors": "By Berman, Eleanor",
        "Description": "",
        "Category": " Travel , United States , Northeast , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Preschool Can You Find Picture Book (Tuffy Tall Search Board Book)",
        "Authors": "By Tallarico, Tony",
        "Description": "Readers search a zoo, a snowy hill, a house, a school room, a beach, and a meadow for various objects and animals",
        "Category": "",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Why a Son Needs a Dad: 100 Reasons",
        "Authors": "By Lang, Gregory E. and Lankford-Moran, Janet (PHT)",
        "Description": "Offers reflections on the father-son relationship, accompanied by black and white photographs of fathers and sons of all ages.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Cumberland House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Blind Corral",
        "Authors": "By Beer, Ralph",
        "Description": "Jackson Heckethorne is drawn to, and must reconcile himself with, the Montana land that has broken his grandfather, his father, and his brother, but has given them all that they value",
        "Category": " Fiction , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "6.08",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "The Adobe Photoshop Lightroom 2 Book: The Complete Guide for Photographers",
        "Authors": "By Evening, Martin",
        "Description": "While Adobe Photoshop has long been their choice for editing digital photographs, many photographers want a more focused tool. That’s where Adobe Photoshop Lightroom comes in. Designed from the ground up with digital photographers in mind, Photoshop Lightroom offers powerful editing features in a streamlined interface that lets photographers import, sort, and organize images. This completely updated and expanded bestseller, The Adobe Photoshop Lightroom 2 Book, was also written with photographers in mind. Author Martin Evening describes features in Photoshop Lightroom 2 in detail from a photographer’s perspective. As an established commercial and fashion photographer, Martin knows first-hand what photographers need for an efficient workflow. He has also been working with Lightroom from the beginning, monitoring the product’s development and providing feedback on the public beta. As a result, Martin knows the software inside and out, from image selection to image editing to image management.  The Adobe Photoshop Lightroom 2 Book contains 624 pages of comprehensive and detailed coverage of all aspects of Lightroom. In this book you’ll learn how to: • Work efficiently with images shot in the raw or JPEG format• Import photographs with ease and sort them according to your workflow• Create and manage a personal image library• Apply tonal adjustments to multiple images quickly• Integrate Photoshop Lightroom with Adobe Photoshop• Export images for print or Web as digital contact sheets or personal portfolios The book structure has been organized to match a typical Lightroom workflow. The introductory chapter provides an overview of all the main Lightroom features, showing how Lightroom 2 was used on a studio photo shoot that was specially shot to illustrate the book. The following chapters cover all the essentials, such as importing photos, working with the Library module, and managing the catalog database. The biggest section of the book is devoted to working with the Develop module and provides some unique insights into working with new features such as the localized adjustment tools. There is also a whole chapter devoted to image sharpening and another on integrating Lightroom and Photoshop, where you will learn how to devise the best workflow methods for working between these two programs. This is followed by a chapter on printing and a presentation chapter on the Slideshow and Web modules. Lastly, there are two appendix chapters. One offers a complete overview of the Lightroom 2 preference settings, while the other provides some in-depth explanations and background reading on how the Lightroom program works. The book is richly illustrated, mostly using the author’s own photographs, and one of the nice features of this book is the way enlarged panel views are used throughout, making it easier for readers to follow the settings used in the various step-by-step examples. There are also lots of tips that will help you take your Lightroom techniques to an advanced level. If you are looking for the most comprehensive coverage of Lightroom, written by an author who is closely involved with the development of the program, this is the book to get. About the AuthorMartin Evening is a London-based advertising and fashion photographer and noted expert in both photography and digital imaging. In addition to being a bestselling author, Martin is sought after for speaking and lecturing. He also works with the Photoshop and Lightroom engineering teams, consulting on new feature development and alpha and beta testing. He is one of the founding members of PixelGenius, a software design company producing automated production and creative plug-ins for Photoshop.",
        "Category": " Computers , Computer Graphics",
        "Publisher": "Adobe Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Twentieth Century World: An International History",
        "Authors": "By Keylor, William R.",
        "Description": "The third edition of this highly successful narrative account of international history in the 20th century has been substantially revised and updated to cover such recent events as the disintegration of the Soviet Union and the emergence of the non-Russion successor states, the civil war in Bosnia, the advent of Israeli-Palestinian peace negotiations, the progress of European integration since Maastricht, and the progress toward the North American free-trade system (NAFTA). All the additional material is integrated into Keylor's distinctive analytical framework of the relations among the major nations of the world. Extensive treatment is also devoted to Africa, Asia, Latin America, and the Middle East. Eighteen new maps and several new tables have been added, along with an updated bibliographic essay.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Learning In U.s. And Soviet Foreign Policy",
        "Authors": "By Breslauer, George W. and Tetlock, Philip E. (EDT)",
        "Description": "",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Westview Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Executive Intent (Patrick McLanahan)",
        "Authors": "By Brown, Dale",
        "Description": "“For fictional thrill rides on the printed page, get on board with the novels of Dale Brown.”—New York Newsday The incomparable Dale Brown (“The best military writer in the country” —Clive Cussler) roars back at full throttle with Executive Intent. The perennial New York Times bestselling master delivers another action-packed tale of international intrigue and technological weaponry that pits the world’s superpowers in a terrifying contest for dominance of outer space and the Earth’s oceans. Vince Flynn and Brad Thor fans will flock to the man whose electrifying visions of near-future warfare remain the gold standard of the techno-thriller genre. Executive Intent is Dale Brown at his best.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "High Crimes: A Novel",
        "Authors": "By Finder, Joseph",
        "Description": "Meet Claire Heller Chapman. A criminal defense attorney who's made a name for herself by taking on—and winning—the toughest cases, Claire still manages to have a relatively calm life as a Harvard Law School professor, devoted wife, and proud mother to six-year-old Annie. Until one night, when the family is out having dinner, a team of government agents bursts onto the scene…heading straight for Claire's husband.Tom Chapman has been arrested for an atrocious crime he swears he did not commit. Claire is desperate to believe him—and prove his innocence—even when she learns that Tom once had a different name. And a different face. Now, in a top-secret court-martial conducted by the Pentagon, Claire will put everything on the line to defend the man she loves. But as the evidence keeps piling up, the less she knows who her husband really is…and the more he appears to be a cold-blooded murderer...in Joseph Finder's High Crimes.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Abraham Lincoln, The War Years Vol. II (The War Years, Vol. II)",
        "Authors": "By Carl Sandburg",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace* Co",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1939"
        }
    },
    {
        "Title": "I Still Have It . . . I Just Can't Remember Where I Put It: Confessions of a Fiftysomething",
        "Authors": "By Rudner, Rita",
        "Description": "While there are people who actually embrace getting older (although we confess not to know any) most try to deny it. Rita Rudner is no exception. When she reached 50, she couldn't even bear to admit it: \"It was more comfortable getting a laugh and telling people I was filthy than having to say the word fffiffffty,\" she writes. In her hysterically dead-on bookI Still Have It...I Just Can't Remember Where I Put It, she relates her absurd adventures as a woman of a certain age navigating the strange and terrifyingly funny world of \"near-sighted insights.\"In chapters such as \"Artificially Hip\"; \"Older Than Springtime, Younger Than Angela Lansbury\"; \"I Won't Blog, Don't Ask Me\"; and \"The Advantage of Vintage,\" Rudner tackles body issues, style, and technology, and looks at the wonders and surprises of life on the dark side of 50. So put on your bifocals and get ready to laugh. Just don’t blame Rita if your laugh lines become visibly deeper.\"Sexy deadpan is comedian Rita Rudner's trademark style, never more in evidence than inI Still Have It ... I Just Can't Remember Where I Put It ... Pure vaudeville, a kick at any age.\"—O, The Oprah Magazine",
        "Category": " Humor , Form , Anecdotes & Quotations",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Emotional Problems of Early Childhood",
        "Authors": "By Editor and Caplan, Gerald",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "11.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "The Art of the Party: Design Ideas for Successful Entertaining",
        "Authors": "By Reynolds, Renny",
        "Description": "Shows how to use lighting, color, texture, progression, and scale to develop creative designs for a wide variety of parties",
        "Category": " Cooking , Methods , General",
        "Publisher": "Avery",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Charlie All Night (Hqn)",
        "Authors": "By Crusie, Jennifer",
        "Description": "Dumped by her boyfriend and demoted from WBBB's prime-time spot, radio producer Allie McGuffey has nowhere to go but up. She plans to make her comeback by turning temporary DJ Charlie Tenniel into a household name. And if he's willing to help cure her breakup blues with a rebound fling, that's an added bonus.Charlie just wants to kick back, play good tunes and eat Chinese food. He's not interested in becoming famous. But he is interested in Allie. And after all, what harm is a little chemistry between friends?But suddenly their one-night stand has become a four-week addiction. Night after night on the airwaves, his voice seduces her&#133;and all the other women in town. He's a hit. It looks as if Charlie's solved all Allie's problems&#133;except one. What is she going to do when he leaves?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "The practical woodworker: a comprehensive step-by-step course in working with wood",
        "Authors": "By Corbett, Stephen",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    }
]