[
    {
        "Title": "A Heart Like His: The Shaping of Character in the Choices of Life",
        "Authors": "By Pippert, Rebecca Manley",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Crossroad Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Blowing My Cover",
        "Authors": "By Moran, Lindsay",
        "Description": "Call me naive, but when I was a girl - watching James Bond movies and devouring Harriet the Spy - all I wanted was to grow up to be a spy. Unlike most kids, I didn't lose my secret-agent aspirations when I became an adult. So as a bright-eyed, idealistic college grad, I sent my resume to the CIA. My dad - who I secretly suspected was a spy himself - told me I wasn't their type. That only made me more determined.Getting into the CIA was a story in itself. I peed in more cups than you could imagine, and was nearly condemned as a sexual deviant by the staff psychologist. I passed a lie-detector test in which a previous applicant allegedly admitted that he'd dismembered his wife and buried her in the basement. Meanwhile, my roommates were getting freaked out by government background investigators lurking around, asking questions about my past.Finally I made it: I was in training to be a CIA case officer. A spy. They taught me to crash cars into barriers at sixty miles per hour. Jump out of airplanes with cargo attached to my body. Survive interrogation, travel in alias, lose a tail.One thing they didn't teach us was how to date a guy while lying to him about what you do for a living, where you live, and your entire identity. That I had to figure out for myself.But I passed it all (except the dating part) with flying colors, much to my father's amazement. Then I was posted overseas. And that's when the real fun began...and when I began to truly understand that being a spy was nothing at all like I'd expected.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Silly 1 2 3s",
        "Authors": "By Gallup, Joan",
        "Description": "This wonderfully engaging book asks young children to locate and count an assortment of objects placed in scenes with silly animals. It presents reproductions of eleven spectacular double-spread oil paintings framed with Joan Gallup's unique sculpted clay borders, along with plenty of her charming characters and creations. This beautiful gift edition is designed to become a childhood favorite!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Under the Mountain Wall: A Chronicle of Two Seasons in Stone Age New Guinea",
        "Authors": "By Matthiessen, Peter",
        "Description": "The author recounts his experiences in New Guinea in 1961 and shares his observations on the Kurelu tribe and their everyday life",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Fully human, fully alive: A new life through a new vision",
        "Authors": "By Powell, John, Powell S.J., John",
        "Description": "",
        "Category": "",
        "Publisher": "Argus Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Creating Fantastic Vases: 50 Fun & Fabulous Ideas & Projects",
        "Authors": "By Tourtillott, Suzanne J. E. (EDT)",
        "Description": "More than 140 photos and drawings show just how beautiful a vase can be. Ten talented designers demonstrate that they can be simple to make too: they’ve created 50 bold, playful, and striking designs that even a beginning crafter can handle. Wrap sheer lace over glass, découpage a skeletonized leaf onto ceramic, or add crimped sheet metal to a galvanized garden container. The results are fantastic.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Life",
        "Authors": "By Beck, William S.",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Harpercollins College Div",
        "Price Starting With ($)": "12.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Vineyard Summer",
        "Authors": "By Shaw, Alison (PHT)",
        "Description": "",
        "Category": " Photography , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Siberian Light",
        "Authors": "By White, Robin A.",
        "Description": "A savage triple murder sets the scene for a novel that is at once a heart-pounding thriller, a breathtaking love story, and a journey into the world's last great wilderness.  In the tradition of Smilla's Sense of Snow and Gorky Park, Siberian Light captures a time and a place as it hurtles us from the stifling heat of a murder scene into the deep cold of the Siberian taiga.Siberia, land of hope and desperation.  A place of unimaginable wealth, and unimaginable greed.  Against this backdrop, Gregori Nowek, the mayor of the small river town of Markovo, is ordered to investigate the killing of three men.  Two of them are members of his own militia.  The third is Andrei Ryzkhov, a man who has made a fortune from an American-financed oil exploration deal.  The investigation leads Nowek into a labyrinth of deception and ends with a terrible discovery: an old horror, long thought dead, has reemerged amid the frozen wastes of Siberia.Gregori Nowek, amateur violinist, former oil geologist, is a man of reason.  He believes in law, even in a lawless nation.  And he still holds fast to a flicker of hope; hope for the future, and hope for himself.  It remains hidden, waiting to be ignited by Anna Vereskaya, an American ecologist and savior to the endangered Siberian tiger.When Anna is named the prime suspect in Ryzkhov's murder, Nowek wants to believe she is innocent.  Anna has come to Siberia to study and save the great Siberian tiger.  Instead, she has found the dangerous edge of a brutal conspiracy that draws them both into a hunt for the truth, and a desperate race for survival.Siberian Light captures the agonies of a nation catapulted into the twenty-first century from the deep sleep of communism.  From the intricate workings of a Siberian oil field to the bitter resolve of a gulag survivor, Robin White's magnificent novel pulses with unforgettable characters and astonishing detail.  As it careens toward a wild, violent chase across the frozen taiga, Siberian Light builds to an exhilarating climax--a staggering surprise--spellbinding until the final, unforgettable scene.",
        "Category": " Fiction , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Some other aspects of Judaism",
        "Authors": "By Chernoff, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Vantage Press",
        "Price Starting With ($)": "15.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Always Outnumbered, Always Outgunned",
        "Authors": "By Mosley, Walter",
        "Description": "After serving twenty-seven years in an Indiana prison for killing two people in a drunken rage, tough, brooding ex-convict Socrates Fortlow lives in a tiny apartment in an abandoned building in Watts, struggling to make sense of the anarchic violence in the world--and in himself. 100,000 first printing. Tour.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "W. W. Norton and Company",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Pugs (Complete Pet Owner's Manuals)",
        "Authors": "By Maggitti, Phil",
        "Description": "The Pug is an ancient breed that originated in China. It is well known as an alert, loyal, and obedient household pet. This volume tells new and prospective Pug owners virtually everything they need to know about caring for their pet. Books in the Complete Pet Owner's Manuals series present basic information about pets for new or soon-to-be owners. Advice and instruction covers feeding, housing, health care, training, grooming, protection against hazards, and much more. Texts emphasize pet care basics and are easy for all readers to understand, but most titles in this series also present facts that even experienced pet owners and breeders will find new and useful. All books in this series are filled with high quality full-color photos and instructive line drawings.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Coffins",
        "Authors": "By Philbrick, W. R.",
        "Description": "Physician Davis Bentwood, making a lengthy housecall at the Coffin family mansion on the coast of Maine, finds the newborn grandson of Captain Cash Coffin, stiff and cold as a block of ice, in a cradle not ten feet from a roaring fire. Young Davis can find no medical explanation for the baby's death.After a mysterious accident at the family shipyard caused the simultaneous death of his twin sons, Cash Coffin locked himself in study, and threatened to shoot anyone who approached. Cash's youngest son, the dwarf Jebediah, has asked his old friend Davis to try to help the old man. Another Coffin son, an experienced ship's master, dies at sea in a freak accident that defies a natural explanation. And on a moonless night, Davis Bentwood is awakened by an eerie light that leads him to the Coffin family's darkest secret. Cash Coffin traded in slaves.Davis Bentwood's blood-chilling discovery holds the key to the family's destruction. Can the ancient evil being visited upon the Coffins be stopped?",
        "Category": " Fiction , Literary",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Snow Blind",
        "Authors": "By Tracy, P. J.",
        "Description": "With the holiday's over and the long cold winter looming, January can be a bleak month in Minneapolis. So what better way to bring a little cheer to the good people of the city than sponsoring an old-fashioned snowman-building contest? In a matter of hours, a local park is filled with the innocent laughter of children and their frosty creations. But things take an awful turn when the dead bodies of police officers are discovered inside two of the snowmen - sending the entire department and Detectives Magozzi and Rolseth on high alert.The next day, Iris Rikker, the newly minted sheriff of rural Dundas County, comes across another body in another snowman. Fearing that Rikker's inexperience will hamper the investigation, Magozzi and Rolseth head north, in a blizzard, to hunt for clues. As Grace MacBride and her crack computer jocks at Monkeewrench comb the Web for connections, a terrifying link emerges, among the dead cops, Magozzi and Rolseth, and Monkeewrench - a link that must be broken before it's too late.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Antarctica",
        "Authors": "By Robinson, Kim Stanley",
        "Description": "When the treaty protecting Antarctica from profiteers is about to dissolve--sending politicians and corporations scrambling to plunder its resources--a radical environmental group embarks on a campaign of sabotage to protect the land's pristine beauty",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Introducing Chomsky, 2nd Edition",
        "Authors": "By Appignanesi, Richard, Groves, Judy, and Maher, John C.",
        "Description": "",
        "Category": " Language Arts & Disciplines , Linguistics , General",
        "Publisher": "Icon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Active Wellness Feel Good for Life",
        "Authors": "By Reichler, Gayle",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Raggedy Ann Stories: The Very First Raggedy Ann Stories",
        "Authors": "By Gruelle, Johnny",
        "Description": "Raggedy Ann has been entertaining and charming young readers ever since the first book created by Johnny Gruelle in 1918 chronicled the adventures of the mischievous rag doll and her delightful toy friends.  Gruelle's inspiration was a real doll—a doll made for his mother by his grandmother and then much loved by his daughter Marcella.  Raggedy Ann Stories, Gruelle's first collection of tales, was soon followed by books that introduced Raggedy Andy and the fairyland called the Deep, Deep Woods.In this edition of The Raggedy Ann Stories, which contains the best original tales and artwork, you'll meet the rag doll's toy friends, as well as Fido the dog and Marcella, the little girl in whose house there is a special room where Raggedy Ann and all the other dolls live.  Often, by the end of a story, after an exciting adventure or, perhaps, a wonderful journey, Raggedy Ann and her friends have learned a small but valuable lesson of life.From the days of her discovery by the real Marcella, the little rag doll with the red-yarn hair has inspired timeless tales and colorful pictures and has stirred the imaginations of millions of young readers all over the world.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Derrydale",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Jenny Lind's America",
        "Authors": "By Frances Cavanah",
        "Description": "",
        "Category": "",
        "Publisher": "Chilton Book Company",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Fay (HYPERION)",
        "Authors": "By Wegman, William",
        "Description": "Chronicles of Wegman's sometimes perilous adventures with Fay Ray, the beloved canine successor to Man Ray, including family photographs, video and film stills, and studio photographs never before published. 150,000 first printing.",
        "Category": " Art , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Evidence Dismissed",
        "Authors": "By Lange, Tom, Moldea, Dan E., and Vannatter, Phillip",
        "Description": "Summarizes and defends the police investigation and its evidence",
        "Category": " Law , Criminal Procedure",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Armored Cav (Tom Clancy's Military Reference)",
        "Authors": "By Clancy, Tom",
        "Description": "A penetrating look inside an armored cavalry regiment -- the technology, the strategies, and the people . . . profiled by Tom Clancy.His first non-fiction book, Submarine, captured the reality of life aboard a nuclear warship. Now, the #1 bestselling author of Clear and Present Danger and Without Remorse portrays today's military as only army personnel can know it. With the same compelling, you-are-there immediacy of his acclaimed fiction, Tom Clancy provides detailed descriptions of tanks, helicopters, artillery, and more -- the brilliant technology behind the U. S. Army. He captures military life -- from the drama of combat to the daily routine -- with total accuracy, and reveals the roles and missions that have in recent years distinguished our fighting forces. Armored Cav includes:Descriptions of the M1A2 Main Battle Tank, the AH-64A Apache Attack Helicopter, and moreAn interview with General Frederick FranksStrategies behind the Desert Storm accountExclusive photograph, illustrations and diagramsPLUS: From West Point cadet to Desert Storm commander . . . an interview with a combat cavalry officer on the rise.",
        "Category": " History , Military , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Another Homecoming",
        "Authors": "By Oke, Janette and Bunn, T. Davis",
        "Description": "In the wake of her husband's presumed death, a young war bride makes a desperate choice to give her baby a better life. However, her choice will have unforeseen ramifications for more lives than she ever expected.The baby girl, named Kyle by her adoptive parents, grows up with no knowledge of her humble beginnings. When a heartbreaking loss pits Kyle against her high society mother, secrets from Kyle's past come to light. Suddenly, she finds herself searching for the family she never knew and a faith she's only beginning to understand. With all that has come before, will Kyle ever be able to find home?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Behind the Wall: A Journey Through China",
        "Authors": "By THUBRON, Colin",
        "Description": "The author's vivid chronicle of his tour of China recalls travels from the Burmese frontier to the Gobi desert, from the Yellow Sea to the edge of Tibet",
        "Category": " Travel , Asia , China",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Tunnel Vision (V.I. Warshawski Novels)",
        "Authors": "By Paretsky, Sara",
        "Description": "Her office building is falling down, the unpaid bills are mounting up. V. I. Warshawski needs a lucrative case and needs it fast. Instead, her most important client demands that she find a community service job to keep his computer-hacking son out of jail.At the same time, V.I. is worried about a homeless family she found in the basement of her office building. Her search for emergency shelter sends her to Home Free, a charitable organization for the homeless headed by an old college flame. She's puzzled by Home Free's cold response, and even more troubled when they start giving the runaround to a group of tradeswomen she knows.Hard up for money, V.I. resists investigating Home Free until one of its board members is murdered in the detective's own office. The track she follows leads her to the trail of tormented runaways, abused spouses, and a cynical financial fraud that stretches from Chicago's banks to the halls of Congress.As she nears the dramatic climax of her punishing case, with her emotional and physical resources taxed to the limit, V.I. finds she must choose between her private happiness and her sense of justice...and learns that the hardest questions she must answer are the ones she asks herself.Tunnel Vision marks the eighth appearance of V. I. Warshawski, who's been called \"the most engaging woman in detective fiction since Dorothy Sayers's Harriet Vane\" (Newsweek), \"the detective mystery fans have been waiting for\" (Time), and \"a gumshoe for modern times\" (People).",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Plutonium Murders: An Alex Seacourt Thriller",
        "Authors": "By Davis, Robert Charles",
        "Description": "Dr. Alex Seacourt, a mild-mannered internist, bumps into a harried man on a busy New York street and unknowingly hurls himself into an evil plot to hold the world hostage through the threat of plutonium poisoning. Seacourt becomes poisoned and - with time running out - races around the world to Russia, Belize, and Las Vegas in an attempt to find an antidote to save himself and the world.Plutonium Murders is a fast-paced thriller with more twists and turns than a rollercoaster. Enemies and friends move among the shadows of frozen Moscow and the jungles of Belize as Dr. Seacourt stumbles through an intriguing maze of secret formulas, sadists and political self-interest.The CIA, the KGB and one of the greatest villains since Hannibal Lechter move in and out of Dr. Seacourt's life as he dodges bullets and sharks in a race against time.Clues and help from some influential - and mysterious - friends guide Seacourt back to the familiar streets of Las Vegas where he tangles with hotel security as well as Zigfried and Roy's famous white tigers before finding himself high atop Hoover Dam.The climactic scene on the dam involves police cars, assassins, helicopters and bothersome television reporters and a final surprise twist will leave you breathless.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Horizon Press",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "A Boy at War: A Novel of Pearl Harbor",
        "Authors": "By Mazer, Harry",
        "Description": "December 7, 1941: A morning like any other, but the events of this day would leave no one untouched.  For Adam, living near Honolulu, this Sunday morning is one he has been looking forward to -- fishing with friends, away from the ever-watchful eyes of his father, a navy lieutenant. Then, right before his eyes, Adam watches Japanese planes fly overhead and attack the U.S. Navy. All he can think is that it's just like in the movies. But as he sees his father's ship, the Arizona, sink beneath the water, he realizes this isn't make-believe. It's real.  Over the next few days, Adam searches for answers -- about his friends, the war, and especially, his father. But Adam soon learns sometimes there are no answers.",
        "Category": " Juvenile Nonfiction , Adventure & Adventurers",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Iced Tea: 50 Recipes for Refreshing Tisanes, Infusions, Coolers, and Spiked Teas (50 Series)",
        "Authors": "By Thompson, Fred",
        "Description": "Since its introduction at the 1904 World’s Fair in St. Louis, iced tea has been a favorite American beverage showing up at every family gathering, backyard barbecue, 4th of July picnic, and on every restaurant menu.  In fact, each day, 120 million Americans reach for a frosty glass of iced tea.  Fred Thompson shows us how easy it is to make a wide variety of iced teas right at home: from classics (Southern Style Ice Tea, Solar Tea) to infusions (Iced Mango Tea, Berry Spice Iced Tea), from spritzers (Green Tea Passion Fruit Spritzer) to offbeat and cocktail teas (Tea Smoothie, Beach Bourbon Slush).  Thompson discusses basic methods for brewing tea, the types of teas and tea blends that are best iced, as well as a vast array of flavors and flavorful combinations that can be mixed with iced tea to create refreshing new drinks.  These 50 recipes make iced tea a truly exciting anytime beverage while still maintaining the pure flavor and goodness that has ensured its place in American tradition.  Thompson shares his years of experience brewing, tasting, and enjoying iced tea the way it was meant to be made—at home with your own two hands.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Low-Carb Bible",
        "Authors": "By Ward, Elizabeth M. (EDT)",
        "Description": "Discusses the pros and cons of different low-carbohydrate diets, offers advice on personalizing a diet and incorporating exercise, and includes over 150 low-carb recipes.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Christmas With Martha Stewart Living",
        "Authors": "By Stewart, Martha",
        "Description": "Suggests holiday recipes and ideas for making gifts and decorations.",
        "Category": " Cooking , Seasonal",
        "Publisher": "Leisure Arts@ Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Spirit of Christmas Cookbook, Vol. 2",
        "Authors": "By Leisure Arts",
        "Description": "Features holiday recipes for brunch, traditional family feasts, desserts, cookies, and beverages, as well as homemade gift-giving ideas",
        "Category": " Cooking , Holiday",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Black Ice",
        "Authors": "By Cary, Lorene",
        "Description": "In 1972 Lorene Cary, a bright, ambitious black teenager from Philadelphia, was transplanted into the formerly all-white, all-male environs of the elite St. Paul's School in New Hampshire, where she became a scholarship student in a \"boot camp\" for future American leaders.  Like any good student, she was determined to succeed.  But Cary was also determined to succeed without selling out.  This wonderfully frank and perceptive memoir describes the perils and ambiguities of that double role, in which failing calculus and winning a student election could both be interpreted as betrayals of one's skin.  Black Ice is also a universally recognizable document of a woman's adolescence; it is, as Houston Baker says, \"a journey into selfhood that resonates with sober reflection, intellignet passion, and joyous love.\"",
        "Category": " Biography & Autobiography , Cultural, Ethnic & Regional , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "I'm Terrific",
        "Authors": "By Sharmat, Marjorie Weinman",
        "Description": "Jason Bear thinks he's terrific and even awards himself gold stars for superior performance in his chores. His friends don't like to be around him.",
        "Category": "",
        "Publisher": "Holiday House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1977"
        }
    },
    {
        "Title": "Submission of Recorded Presidential Conversations To the Committee on the Judiciary of the House of Representatives by President Richard Nixon April 30,1974",
        "Authors": "By Richard Nixon",
        "Description": "",
        "Category": "",
        "Publisher": "Superintendent of Documents, U.S. Government Printing Office",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Darkening Valley: A Biblical Perspective on Nuclear War",
        "Authors": "By Aukerman, Dale",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Seabury Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "In the Spirit of Business: A Guide to Resolving Fears and Creating Harmony in Your Worklife",
        "Authors": "By Roskind, Robert",
        "Description": "Suggests how the principles of \"A Course in Miracles\" may be put to work in the business world",
        "Category": " Business & Economics , General",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Diana: Story of a Princess",
        "Authors": "By Clayton, Tim and Craig, Phil",
        "Description": "The life story of Diana, Princess of Wales, at last is told in full. Here is the first complete, honest, and objective biography that shows all facets of this fascinating and enigmatic woman: her magic, her manipulations, her dazzling public persona, and her role inside the world's most exposed marriage. Drawn from years of research and dozens of interviews with friends and associates speaking on the record for the first time, and based on the groundbreaking four-hour ITV/The Learning Channel documentary series, Diana contains never-before-revealed detailed accounts and stunning insights, including   Diana's closest friends and colleagues as they refute the suggestion that she was \"unbalanced\" before she met her future husband confirmation by a family member that Diana wanted to withdraw from the wedding only weeks before, as she learned more of her husband-to-be's secret relationships with other women the loaded implications of Diana's pre-wedding lunch with Camilla Parker Bowles, held, ironically, at the Ménage à Trois restaurant new witnesses to the traumatic early years of Charles and Diana's marriage, and the loneliness that lay behind Diana's spectacular public success interviews with senior royal officials, men and women who have never before shared their unique and objective views on the failure of the marriage the truth, at last, about the allegation that Diana suffered from borderline personality disorderthe shocking story of a smear campaign a world-exclusive interview with both James Hewitt and his mother, Shirley, including touching accounts of Hewitt's affair with Diana -- and why his family believed that the romance was considered \"authorized\" never-before-told details about Diana's \"alternative family life\" during the late 1980s -- the weekends she spent with the Hewitts even when James was away, and heartwarming stories of the close friendship she established with her surrogate mother-in-law, Shirley Hewitt completely new details of the \"arrangement,\" widely accepted inside the royal household, between two couples -- Charles and Camilla, James and Diana -- and their week-on, week-off sharing of their country home the gruesome tactics of the paparazzi -- and the Palace's refusal to bar the \"paps\" from royal functions confirmation from her closest confidantes that Diana made nuisance phone calls to a married art dealer surprising revelations from those closely involved with Diana's charity work about how vindictive and spiteful she could be in her final years -- contrasted with a powerful account of her land mine crusade and her tender ministrations to victims the real reason the royal family remained at Balmoral after Diana's death -- and how the fear of angry mobs may have prompted a warning from Scotland Yard: their safety in London could not be guaranteed.   Featuring thirty-two rare and unfamiliar photographsincluding seven never before published -- Diana not only captures the princess as she was, but also places her story in the context of twenty years of frantic social and economic change. It will stand as the ultimate, and ultimately most enlightening, telling of Diana's extraordinary life.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Study of Human Nature: Readings",
        "Authors": "By Stevenson, Leslie Forster",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Steinbrenner",
        "Authors": "By Schaap, Dick",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "The New Columbia encyclopedia",
        "Authors": "By William H. Harris~Judith Levey",
        "Description": "",
        "Category": "",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "38.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Night Before Christmas, Classic Edition",
        "Authors": "By Moore, Clement Clarke and Birmingham, Christian (ILT)",
        "Description": "This beautiful edition of an American holiday classic features full-color, original artwork, including a panorama of Santa and his flying reindeer! The large-format size is perfect for reading aloud on Christmas Eve. Christian Birmingham's illustrations capture all the spirit and wonder of the holiday, and bring a new sparkle to Moore's wonderful poem.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Walt Disney's Sleeping Beauty",
        "Authors": "By Findlay, Lisa",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Dog Training (Quick & Easy)",
        "Authors": "By Anderson, Teoti",
        "Description": "",
        "Category": " Pets , Reference",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Mars and Venus on a Date: A Guide for Navigating the 5 Stages of Dating to Create a Loving and Lasting Relationship",
        "Authors": "By Gray, John",
        "Description": "Will I Ever Find My Soul Mate?Whether you are recently separated, divorced, or you have been in the singles scene for longer than you want, this insightful guide will help you navigate the dating maze and find that special person you've been waiting for.By discussing the differences between men and women, Mars and Venus on a Date provides singles with:A thorough understanding of the five stages of dating -- attraction, uncertainty, exclusivity, intimacy, and engagementHow to know what kind of person is right for youAnswers to burning questions such as why don't men call, or why do some women stay single?The best places to meet your soul mateAnd advice on creating a loving and mutually fulfilling relationshipFilled with practical guidelines, inventive techniques, and witty insight, Mars and Venus on a Date will help single men and women explore the world of dating, understand how to make good choices, and discover the secret to finding a soul mate.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Government Role in Civilian Technology: Building a New Alliance",
        "Authors": "By Panel on the Government Role in Civilian Technology and Committee on Scien",
        "Description": "Makes specific suggestions about policy and organizational changes that would allow government and industry to work together to respond to the increasing competition of the global marketplace. Cites past efforts to argue that government support of research and development is good for the economy. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "National Academies Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "To the Stars: Eight Stories of Science Fiction",
        "Authors": "By Robert (editor) Silverberg",
        "Description": "",
        "Category": "",
        "Publisher": "hawthorne",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Television Production Handbook (Wadsworth series in mass communication) by Herbert Zettl (1984-01-31)",
        "Authors": "By Zettl, Herbert",
        "Description": "Discusses the major tools of present-day color television production and their use under normal circumstances and gives some attention to monochrome equipment and its operation",
        "Category": "",
        "Publisher": "Wadsworth Pub. Co",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Rebel Hart",
        "Authors": "By Hemingway, Edith Morris and Shields, Jacqueline C.",
        "Description": "A farm girl from the mountains of what would become West Virginia leaves home to join a group of rebel raiders who strike Federal Army encampments during the Civil War.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "White Mane Pub",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Klee (20th Century Masters)",
        "Authors": "By Jaffe, H.L.C.",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1972"
        }
    },
    {
        "Title": "Welcome to Multimedia",
        "Authors": "By Tway, Linda E.",
        "Description": "Introduces the terms, concepts, hardware, and software used in creating a PC collage of graphics, animation, sounds, photographs, text, and more.",
        "Category": " Computers , General",
        "Publisher": "Mis Pr",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Mystery",
        "Authors": "By Straub, Peter",
        "Description": "A near-fatal traffic accident and a resulting obsession with death drive Tom Pasmore to join his neighbor, famous retired detective Lamont von Heilitz, in investigating two very different murders",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "E. P. Dutton",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Final Adventures of Sherlock Holmes",
        "Authors": "By Coyle, Sir Arthur C.",
        "Description": "Includes parodies, plays, commentaries, and stories about Holmes, and provides the historical background of each item",
        "Category": "",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "Somebody Else's Mama",
        "Authors": "By Haynes, David",
        "Description": "The lives of Paula and Al Johnson and their twin sons in a small, almost exclusively African-American town in northern Missouri appear stable enough. Paula and Al have grown up in affluence: Al as the son of the town's most successful citizen, its mayor and newspaper owner; Paula as the pampered daughter of an entrepreneurial mother in St. Louis, part of a set of well-to-do black families whose children go to the best schools, attend dancing classes together, and socialize with one another. When we meet them, Al is reluctantly running for mayor, the twins are feuding, and Paula is hanging on.Then Paula's cantankerous mother-in-law, Miss Xenobia Kezee, sick and old, arrives from St. Paul, where she has lived since the death of her beloved second husband. Miss Kezee is independent. She is blunt, tough, and opinionated. She wants to go home, away from memories of her first husband, Al's father, and she openly resents Paula's well-intended caregiving.As Paula struggles to move from antagonism to common ground with Miss Kezee, she faces the substantial issues in her life: her own mother's lonely death, which still haunts her; and her husband's minimal engagement with the emotional life of his family. In Somebody Else's Mama, David Haynes beautifully unfolds a story of the yearning for a significant family life.",
        "Category": " Family & Relationships , Activities",
        "Publisher": "Milkweed Editions",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Joy of Reflexology: Healing Techniques for the Hands and Feet to Reduce Stress and Reclaim Life",
        "Authors": "By Gillanders, Ann",
        "Description": "The ancient Chinese technique of reflexology is growing rapidly in popularity around the world. Author Ann Gillanders, one of the foremost leaders of the reflexology movement, presents a clear, step-by-step guide to this classic art of healing. Illustrated in full color throughout, The Joy of Reflexology shows how to relax, tone, stimulate, and strengthen the whole mind-body system.Ann Gillanders demonstrates how \"reflex\" zones on the hands and feet mirror the body's health. By applying finger pressure on the hands and feet, anyone can learn to counter stress, relieve pain, and combat ailments. Reflexology is an ideal therapy, as it is safe, requires no equipment, and can be done anytime, anyplace. In this practical, hands-on guide you'll find: complete healing sessions using hand and foot reflexology, with point-by-point illustrations and captions; effective ways to overcome tension and stress; techniques for relieving back pain; treatments for digestive problems; methods to reduce stiffness in joints; feet relaxation exercises; detailed color maps of the reflex zones and reflex points on the hands and feet; and a chart of reflexology points for treating common ailments.",
        "Category": " Health & Fitness , Food Content Guides",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Mystery Book of Days",
        "Authors": "By Malloy, William",
        "Description": "Lists information about mystery writers, fictional detectives, important books, films, and television programs, and events in the history of crime associated with each day of the year",
        "Category": " Literary Criticism , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Stretch And Relax",
        "Authors": "By Stewart, Mary and Tobias, Maxine",
        "Description": "Demonstrates a variety of stretches designed to relieve stress, stiffness, and backaches, improve posture, and increase flexibility, and includes stretches to be done during pregnancy",
        "Category": " Health & Fitness , General",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Algeny, A New Word--A New World",
        "Authors": "By Rifkin, Jeremy",
        "Description": "Examines the background, transformations, and present and future implications of genetic engineering and the biological revolution and argues that we are on the verge of a shift more profound than the Industrial Revolution",
        "Category": " Social Science , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Investing for the Future",
        "Authors": "By Burkett, Larry",
        "Description": "Explains the different options investors have to build for the future, and looks at the ethical practices of certain corporations as a consideration when investing",
        "Category": " Business & Economics , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Child's Treasury of Beatrix Potter",
        "Authors": "By Potter, Beatrix",
        "Description": "",
        "Category": "",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Bush in Babylon: The Recolinisation of Iraq",
        "Authors": "By Ali, Tariq",
        "Description": "The assault and capture of Iraq — and the resistance it has provoked — will shape the politics of the twenty-first century. In this passionate and provocative book, Tariq Ali provides a history of Iraqi resistance against empires old and new, and argues against the view that sees imperialist occupation as the only viable solution to bring about regime-change in corrupt and dictatorial states. Like the author’s previous work, The Clash of Fundamentalisms, this book presents a magnificent cultural history.Detailing the longstanding imperial ambitions of key figures in the Bush administration and how war profiteers close to Bush are cashing in, Bush in Babylon is unique in moving beyond the corporate looting by the US military government to offer the reader an expert and in-depth analysis of the extent of resistance to the US occupation in Iraq.On 15 February 2003, eight million people marched on the streets of five continents against a war that had not yet begun. A historically unprecedented number of people rejected official justifications for war that the secular Ba'ath Party of Iraq was connected to al-Qaeda or that “weapons of mass destruction” existed in the region, outside of Israel.More people than ever are convinced that the greatest threat to peace comes from the center of the American empire and its satrapies, with Blair and Sharon as lieutenants to the Commander-in-Chief. Examining how countries from Japan to France eventually rushed to support US aims, as well as the futile UN resistance, Tariq Ali proposes a re-founding of Mark Twain's mammoth American Anti-Imperialist League (which included William James, W.E.B. DuBois, William Dean Howells, and John Dewey) to carry forward the antiwar movement. Meanwhile, as Iraqis show unexpected hostility and independence, rather than gratitude, for “liberation,” Ali is unique is uncovering the depth of the resistance now occurring inside occupied Iraq.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Verso",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "All Venice",
        "Authors": "By Serra, Vittorio",
        "Description": "",
        "Category": "",
        "Publisher": "Bonechi Edizioni 'Il Turismo' s.r.l.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Witch Hunt: A Novel",
        "Authors": "By Rankin, Ian",
        "Description": "Pursued by three nearly obsessed detectives from some of the world's most elite police agencies, an ingenious assassin known as Witch undertakes an assignment with global ramifications that forces those who are investigating her to follow leads within the highest ranks of international law and finance. By the author of Resurrection Man.  40,000 first printing.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Way to Glory",
        "Authors": "By Drake, David",
        "Description": "Lieutenant Leary and Adele Mundy are Back in This Blazing Sequel to The Far Side of the Stars.Violence racks Cinnabar. The fleets of the tyrannical Alliance are on the move, and at home class riots threaten to rip apart not only society but the Republic of Cinnabar Navy. Lt. Daniel Leary has earned promotion, but the needs of the Republic and the RCN require that he serve under an officer whose paranoia has already led him to execute crewmen out of hand. Signals Officer Adele Mundy has repeatedly proved her skills and loyalty as Cinnabar's most accomplished intelligence agent, but now elements within the Republic want to draw her into a conspiracy like the one that led to her parent's massacre. Leary and Mundy battle their way from riot-torn streets to spies in an outlying base and an anarchic planet where violence is the only law, but if they succeed at every stage, one test still remains: a space battle against an overwhelming Alliance force. Even for Daniel Leary it will be a difficult fight to win-and almost impossible to survive.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "American Aspects.",
        "Authors": "By Brogen, D.W.",
        "Description": "",
        "Category": "",
        "Publisher": "Hamish Hamilton (1964)",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Science and Technology",
        "Authors": "By National Academy of Sciences",
        "Description": "",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "Classical music",
        "Authors": "By Stanley, John",
        "Description": "Quite an attractive, thoughtfully prepared, useful reference which begins with an introduction to instruments, orchestras, and the voice, a glossary of musical terms, and lists and commentary on master recordings. Each classical music era, from the Middle Ages to the 20th century is covered, with overviews of the political, social, scientific, artistic, and literary developments of the period, as well as biographies of major composers. For fledgling collectors, each composer's entry recommends specific works and recordings, based on ratings by  Gramophone Magazine . The numerous well-chosen color photos are varied works of art and architecture representative of the periods, portraits, stage designs and nicely printed. The text is informative and well written. 9.25x11.75\" Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Music , Genres & Styles , Classical",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "7.27",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Road to Omaha",
        "Authors": "By Ludlum, Robert",
        "Description": "The outrageous characters from The Road to Gandolfo continue their madcap adventures in a romp around Nebraska that is spurred by the discovery of a secret 1878 treaty with an obscure Indian tribe. 650,000 first printing. $650,000 ad/promo. Tour.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "A World of Art",
        "Authors": "By Sayre, Henry M.",
        "Description": "New edition of a particularly attractive and accessible introduction to art.  Arrangement is in thematic divisions discussing art appreciation; the formal elements and their design e.g. line, space, light and color; the various fine arts media; and architecture and design in everyday life. An illustrated historical timeline of art occupies about one-quarter of the book.  Throughout, the volume is abundantly illustrated with intelligently chosen examples.  This edition has been revised to accompany a PBS television series and telecourse for teaching art appreciation titled \"A World of Art; Works in Progress.\" Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Art , History , General",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Distributed Systems: Concepts and Design (International Computer Science Series)",
        "Authors": "By Coulouris, George, Dollimore, Jean, and Kindberg, Tim",
        "Description": "This second edition is updated to reflect recent advances in the field.  Emphasizes design approaches such as openness, scalability, transparency, reliability, and security, and introduces new technologies including ATM networking, internetworks, multicast protocols, and distributed memory sharing.  Includes case studies of networking and interprocess communication, distributed file systems, name services, and replication. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , Management Information Systems",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Heart of Thoreau's Journals",
        "Authors": "By Thoreau, Henry David",
        "Description": "The conflict between scientific observation and poetry, reflections on abolition, transcendental philosophy, other concerns are explored in this superb general selection from Thoreau's voluminous Journal. Here are \"...the choicest fruits of Thoreau...\" — Nation.",
        "Category": " Nature , Ecosystems & Habitats , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1961"
        }
    },
    {
        "Title": "Disney Princess Belle Getting to Know You (Disney Princess, 9)",
        "Authors": "By Lisa Ann Marsoli",
        "Description": "",
        "Category": "",
        "Publisher": "Advance",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Ballet Shoes",
        "Authors": "By Goode, Diane (ILT) and Streatfeild, Noel",
        "Description": "Three orphan girls. A pair of pink slippers. A lifetime in the spotlight. Read the classic that has captivated generations! Pauline, Petrova, and Posy love their quiet life together. They are orphans who have been raised as sisters, and when their new family needs money, the girls want to help. They decide to join the Children's Academy of Dancing and Stage Training to earn their keep. Each girl works hard following her dream. Pauline is destined for the movies. Posy is a born dancer. And Petrova? She finds she'd rather be a pilot than perform a pirouette.This beautiful children's classic is perfect for girls who love to dream about ballet, friendship, and finding their own special talents. Adult readers may remember them as the \"Shoes\" books from You've Got Mail!",
        "Category": " Juvenile Fiction , Family , Orphans & Foster Homes",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Money and Politics (New Democracy Forum)",
        "Authors": "By Donnelly, David and Cohen, Joshua (EDT)",
        "Description": "Why we need true reform and how it can finally be achieved\"American politics has become an arms race, with money doing the work of missiles. One side escalates and the other follows suit. As the spiral grows it is undermining the soul of democracy. But here's the good news: the majority of Americans want a new system of campaign finance. Every time voters have had a chance to choose a different way, they have spoken loud and clear. Clean money initiatives are proving the citizens' response to the corruption that has turned our elections into auctions. This book is the blueprint to returning democracy to politics.\" —Bill Moyers As we approach our next presidential election, few issues loom larger than campaign finance reform. While the Senate has agreed to vote on a sweeping bill for reform at the federal level, state voters have passed, or are about to vote on, ballots that limit the amount of private money flooding into campaign war chests. Money and Politics argues that only the full public funding of elections, as enacted with the adoption in Maine of the Clean Elections Act, can solve our campaign financing crisis. Their evaluation of its pros and cons is particularly timely as parts of the Maine option are being considered in competing congressional reform bills. Many of the contributors to this volume have worked closely on campaign finance reform, including Senator Russell Feingold, coauthor of the landmark McCain-Feingold Act.Persuasive, accessible, and controversial, this book makes an important contribution to our debate about the most democratic way to elect the politicians who represent us.NEW DEMOCRACY FORUM A series of short paperback originals exploring creative solutions to our most urgent national concerns. The series editors (for Boston Review), Joshua Cohen and Joel Rogers, aim to foster politically engaged, intellectually honest, and morally serious debate about fundamental issues—both on and off the agenda of conventional politics.",
        "Category": " Political Science , Political Economy",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Parties And Projects For The Holidays (Christmas With Martha Stewart Living)",
        "Authors": "By Stewart, Martha",
        "Description": "",
        "Category": "",
        "Publisher": "Martha Stewart Living Omnimedia - Oxmoor House",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Cybernetic Walrus (The Wonderland Gambit, Book 1)",
        "Authors": "By Chalker, Jack L.",
        "Description": "Everything you think you know is wrong . . . That was the strange message left on Cory Maddox’s e-mail—just at the moment when years of work on a revolutionary subspace computer system was about to pay off. Nothing would be the same for Cory again. Suddenly his life was thrown into chaos when the company that controlled his patent was sold out from under him, and instead of imminent wealth, Cory was facing immediate poverty. Then along came Alan Stark, who wanted to recruit Cory for a special research project on virtual reality.Stark was reviving the secret NSA work of the legendary Matthew Brand, who had disappeared under mysterious circumstances years before. Cory had always idolized Brand, so he was initially thrilled to be involved. But he quickly discovered that there was nothing virtual about the realities he was working on. Instead, he found that Stark was on the verge of controlling the very fabric of reality itself.Cory was unsure of Stark’s ultimate goal, until he began to recall pieces of another life and found himself in the middle of a battle between two groups of people who could use “rabbit holes” in space and time to jump between different realities, personalities, and lives. Whoever had control of the power to shape reality would have the power to become a god—or a devil. But before Cory could combat Stark and his minions, he first had to remember which side he was on . . .",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Great Destinations the Sarasota, Sanibel Island & Naples Book",
        "Authors": "By Walton, Chelle Koster",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "Berkshire House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Stop Dieting and Lose Weight: The Easiest Way to a Slimmer You",
        "Authors": "By Ragone, Regina and Egan, Anne",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Yoga Book: A Practical Guide to Self-Realization",
        "Authors": "By Sturgess, Stephen and Kriyananda, Swami (FRW)",
        "Description": "This title explains the true meaning of yoga and demonstrates the practices and postures of Ashtanga Yoga that should enable the reader to achieve mastery over the mind and body and can eventually lead to self-realization.",
        "Category": " Health & Fitness , Yoga",
        "Publisher": "Watkins Publishing Limited",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Hammer of Eden",
        "Authors": "By Follett, Ken",
        "Description": "Young FBI agent Judy Maddox and maverick seismologist Michael Quercus race against time to stop an enigmatic terrorist group, called Stop Now, threatening to generate a deliberately engineered earthquake that will level San Francisco. 400,000 first printing.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Great Rubber Stamping: Ideas, Tips and Techniques",
        "Authors": "By Ritchie, Judy, Kilmartin, Jamie",
        "Description": "",
        "Category": "",
        "Publisher": "Hugn Lauter Levine Associates",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Thanksgiving",
        "Authors": "By Dibdin, Michael",
        "Description": "Anthony is a British journalist whose American wife, Lucy, has suddenly died. Grieving and haunted, he becomes obsessed with her youth and the years before he met her. To find out more, he travels to a remote part of the Nevada desert to meet Lucy's first husband. Their bizarre encounter, with its violent climax, marks the beginning of a journey that takes him across the world, to the edge of madness and into the darkest corners of the human heart. It is a journey in which he is hunted, haunted, never at peace, and never far from the woman he still loves.",
        "Category": " Fiction , Literary",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Last Knight: The Twilight of the Middle Ages and the Birth of the Modern Era",
        "Authors": "By Cantor, Norman F. and Cantor, Judy",
        "Description": "There may be no more fascinating historical period than the  late fourteenth century in Europe. The Hundred Years' War ravaged  the continent, yet gallantry, chivalry, and literary brilliance  flourished in the courts of England and elsewhere. Chaucer wrote  brilliant satire, lords and ladies invented courtly rituals of  love and romance, yet the vast bulk of Europe's population  struggled with plague, economic uncertainty, and violence. It was  a world in transition, soon to be replaced by the Renaissance and  the Age of Exploration -- and John of Gaunt was its central  figure. Norman F. Cantor, the best known and most popular  historian of the Middle Ages, brings Gaunt to life brilliantly in  his newest work, The Last Knight.   John of Gaunt was the richest man in Europe, apart from its  monarchs, and he epitomized and surpassed the ideals of the late  Middle Ages. From chivalry -- he was taught at a young age to  fight on horseback like the knights of old -- to courtly love --  his three marriages included two romantic love-matches -- he was  an ideal leader. He created lavish courts, sponsoring Chaucer and  proto-Protestant religious thinkers, and he survived the dramatic  Peasants' Revolt, during which his sumptuous London residence was  burned to the ground. As the head of the Lancastrian Branch of  the Plantagenet family, he was the unknowing father of the War of  the Roses, for his son Henry Bolingbroke usurped the crown from  Gaunt's nephew, Richard II, after Gaunt had died. He passed away  just as one great era gave way to the next: His grandson Henry  the Navigator launched the Age of Exploration. Gaunt's adventures  represent the culture and mores of the Middle Ages as few others'  do, and his death is portrayed by Cantor as the end of that  fascinating period.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "If I knew what I was doing",
        "Authors": "By Goldstein, Arthur D.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Juiceman's Power of Juicing",
        "Authors": "By Kordich, Jay",
        "Description": "Known as \"the Juiceman\" to the millions who have seen him on television, Jay Kordich has at last written a book detailing his revolutionary program for staying healthy, looking young, getting trim, and feeling great -- all by taking advantage of the natural healing power of fresh fruit and vegetable juices.The Juiceman's Power of Juicing shows how you can use delectable fresh juice combinations to help lower your cholesterol, overcome fatigue, lose weight, reduce your risk of many serious diseases, and relieve scores of common ailments, including headaches, insomnia, upset stomach ... and even acne!Jay Kordich has devoted the last five decades to traveling the country promoting the healing power of juicing. In The Juiceman's Power of Juicing, he has written the complete guide, for beginners and for avid juicers, to the health revolution that will give you more energy and have you feeling and looking better than you ever dreamed possible. It's easy and delicious. Don't delay ... start juicing!",
        "Category": " Cooking , Reference",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Credit When Credit Is Due",
        "Authors": "By Paul Strassels",
        "Description": "",
        "Category": "",
        "Publisher": "Consumer Credit Counseling Ser",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Algebra and Trigonometry",
        "Authors": "By Mark McCombs, Michael Sullivan",
        "Description": "",
        "Category": "",
        "Publisher": "Ingram",
        "Price Starting With ($)": "8.05",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Believe Not 30",
        "Authors": "By Ripley",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "Yellowstone: The Story Behind the Scenery",
        "Authors": "By Crandall, Hugh",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Kc Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "A Photographic and Comprehensive Guide to Yellowstone National Park",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "National Parks Division of World-Wide Research & Pub.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Guardian (Sparks, Nicholas)",
        "Authors": "By Sparks, Nicholas",
        "Description": "Julie Barenson's young husband left her two unexpected gifts before he died - a puppy named Singer and the promise that he would always be watching over her. Now, four years later, twenty-nine-year-old Julie is far too young to have given up on love. She may be ready to risk caring for someone again. But who?Should it be Richard Franklin, the sophisticated, handsome engineer who treats her like a queen? Or Mike Harris, the down-to-earth nice guy who was her husband's best friend? Choosing one of them should bring her more happiness than she's had in years. Instead, Julie is soon fighting for her life in a nightmare spawned by a chilling deception and jealousy so poisonous that it has become a murderous desire.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Golden Ring: A Touching Christmas Story",
        "Authors": "By Snyder, John",
        "Description": "During the Christmas season of 1918, nine-year-old Anna and her father come to a deeper understanding of the goodness of giving as each follows the guidance of their dreams of Jesus.",
        "Category": "",
        "Publisher": "Mountain Breeze Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Illuminate: Living With Candles",
        "Authors": "By Hammond, Amanda, Manning, Tiffany, Noyes, Nigel (PHT), and Noyes, Nigel",
        "Description": "",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Laurel Glen",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Serge Art",
        "Authors": "By Bossom, Diane",
        "Description": "",
        "Category": " Antiques & Collectibles , Textiles & Costume",
        "Publisher": "Krause Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Last Intellectuals The",
        "Authors": "By Jacoby, Russell",
        "Description": "This provocative book chronicles the disappearance of the \"public intellectual\" in America. For over thirty years, the cultural landscape has been dominated by the generation of Irving Howe, Daniel Bell, and John Kenneth Galbraith; no younger group has arisen to succeed them. Unlike earlier intellectuals who lived in urban bohemias and wrote for the educated public, today's thinkers have flocked to the universities, where the politics of tenure loom larger than the politics of culture. In an incisive and passionate polemic, Russell Jacoby examines how gentrification, suburbanization, and academic careerism have sapped the vitality of American intellectual life.",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Practical Parenting Tips For The First Five Years: Revised And Updated Edition",
        "Authors": "By Lansky, Vicki",
        "Description": "Here are just a few of the ideas in this book that parents have actually used to make life with young children easier:  Childproofing  Keep a rubber band around the toilet tissue roll to prevent waste and clogged toilets due to \"flushing fascination.\" Drape a towel over the top of the bathroom door to keep children from shutting it tightly and locking themselves in.   Tantrums  Listen. Acknowledge the source of frustration.  Whisper in your child's ear. The screaming may stop or turn into a giggle. Disappear into another room. You'll feel better and the tantrum will lose steam.   Hair Care  Sit your child in a high chair to prevent \"wandering.\" Spread a newspaper underneath.  Remove gum from hair with peanut butter. Work it into the hair and then comb out both gum and peanut butter.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Meadowbrook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Witch Doctors",
        "Authors": "By Micklethwait, John and Wooldridge, Adrian",
        "Description": "Management gurus - high-powered consulting firms, business school professors, motivational speakers who never graduated from high school - are latterday witch doctors, each promising the cure for what ails corporate America. These men and women are the sales reps for an industry that exists exclusively to peddle freshly laid management advice to petrified executives. According to one recent study, 72 percent of managers believe that the right management tools can help ensure business success, even though 70 percent also say most of the tools promise more than they deliver. Often, the results are thousands of people losing their jobs or having their work lives irrevocably altered. But thousands of companies continue to grasp at the newest concept du jour - until the next sure thing comes along.The irony is that some of the gurus' ideas and prescriptions really can rescue or renovate your company. But until you have read The Witch Doctors, your chances of figuring out which ideas belong in your hot file and which in your circular file are slim indeed.Micklethwait and Wooldridge have organized The Witch Doctors around the management problems that plague today's corporations. They examine the promise and the problems of reengineering, and analyze what - and who - is driving the current boom in the management industry. The authors profile Peter Drucker and Tom Peters, helping you decide what the uber-gurus can teach you and what they can't. They proceed to look deeply into the social and corporate implications of every major conundrum managers and workers face today. Through unbiased, often contrarian investigations of knowledge, learning, and innovation, strategy and vision, the future of the workplace, shareholder versus stakeholder capitalism, globalization, and Japanese management, Micklethwait and Wooldridge tell you what works, what fails, and what the future may hold for those who act and those who wait. Two groundbreaking chapters examine the inroads management theory is making in the public sector, and the unexpected paths Asian managers are blazing through the world economy.",
        "Category": " Business & Economics , General",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Millionaire Mind",
        "Authors": "By Stanley, Thomas J.",
        "Description": "In his first best-seller, Dr. Thomas J. Stanley shattered one of contemporary America's most firmly held myths: That wealthy individuals belong to an elite group of the highly educated and exceedingly lucky who often inherit their money and spend it on lavish purchases and pampered lifestyles. In fact, a significant number of America's wealthy are far more likely to work hard, save diligently, and live well below their means. As the title of  Stanley's 1996 best-selling book stated, they are The Millionaire Next Door. Now, Dr. Stanley takes us even further with a new, ground-breaking study of America's wealthy. In THE MILLIONAIRE MIND he targets a different segment of the population and those who have accumulated substantial wealth and live in ways that openly demonstrate their affluence. Exploring the ideas, beliefs and behaviors that enabled these millionaires to build and maintain their fortunes, Dr. Stanley provides a fascinating look at who America's financial elite are and how they got there. What were their school days like? How did they respond to negative criticism? What are the characteristics of the millionaire's spouse? Is religion an important part of their lives? The author uncovers the surprising answers to these and similar questions, showing readers through concrete examples just what it is that makes the wealthy prosper when others would turn away dejected or beaten. The Millionaire Mind promises to be as transformational as Dr. Stanley's previous best- seller. This book answers universal questions with solid statistical evidence in an approachable, and anecdotal style. The number of copies sold of this soon-to-be-classic will surely be inæthe millions.",
        "Category": " Psychology , Personality",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Almost home (Images of America series)",
        "Authors": "By Cavagnaro, David",
        "Description": "",
        "Category": "",
        "Publisher": "American West Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "American Building: The Historical Forces that Shaped It",
        "Authors": "By Fitch, James Marston:",
        "Description": "",
        "Category": "",
        "Publisher": "Schocken",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Omega-3 Miracle",
        "Authors": "By Gordon, Garry, M.D. and Joiner-Bey, Herb",
        "Description": "",
        "Category": " Health & Fitness , Alternative Therapies",
        "Publisher": "Freedom Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2015"
        }
    }
]