[
    {
        "Title": "Did You See What I Saw?: Poems About School (Picture Puffins)",
        "Authors": "By Weston, Martha (ILT) and Winters, Kay",
        "Description": "This energetic collection of twenty-four poems brings the excitement of a child's first few years at school  to life. From opening a box of squeaky new crayons and swinging way up high on the playground swings to getting caught passing a note and bidding farewell to a beloved class pet, the highlights and the lowlights of classroom life are captured here.\"The rhymes and sounds and wordplay are part of the fun.\"-Booklist",
        "Category": " Juvenile Nonfiction , Poetry , Humorous",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Kate Greenaway's Mother Goose Coloring Book (Dover Coloring Books)",
        "Authors": "By Greenaway, Kate",
        "Description": "Little Jack Horner … Daffy-down-dilly … Jack Sprat … Cross Patch … Jack and Jill … Bo-peep … Little Tom Tucker … Mary, Mary, quite contrary … Little Boy Blue … Little Miss Muffet … Tom, Tom, the piper's son … and 36 other Mother Goose personalities anxiously await your crayons, watercolors, inks, and other drawing materials. Kate Greenaway has made all of the characters seem like childhood friends. Nancy Perkins has made the illustrations even more colorable. Some are easy enough for the youngest to color; others are challenging enough for parents and grandparents. The rhymes — familiar and unfamiliar — are, of course, always a delight.",
        "Category": " Juvenile Fiction , Activity Books",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2013"
        }
    },
    {
        "Title": "Great Danes: Everything About Purchase, Care, Nutrition, Breeding, Behavior, and Training With 46 Color Photos",
        "Authors": "By Earle-Bridges, Michele (ILT), Vriends, Matthew M., and Stahlkuppe, Joe",
        "Description": "Traces the history of the breed, discusses a Great Dane's care requirements, and includes information on training and common health concerns",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Bliss Factor",
        "Authors": "By Mccall, Penny",
        "Description": "When one of her parents' colleagues Connor Larkin, an undercover FBI agent posing as a blacksmith, loses his memory after being attacked and actually believes he is a medieval armorist, straight-laced accountant Rae Blissfield, who grew up in a traveling Renaissance faire, must save him from himself. (Romantic suspense). Original.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Writing Ethnographic Fieldnotes (Chicago Guides to Writing, Editing, and Publishing)",
        "Authors": "By Emerson, Robert M., Fretz, Rachel I., and Shaw, Linda L.",
        "Description": "In this companion volume John van Maanen's Tales of the Field, three scholars reveal how the ethnographer turns direct experience and observation into written fieldnotes upon which an ethnography is based.Drawing on years of teaching and field research experience, the authors develop a series of guidelines, suggestions, and practical advice about how to write useful fieldnotes in a variety of settings, both cultural and institutional. Using actual unfinished, \"working\" notes as examples, they illustrate options for composing, reviewing, and working fieldnotes into finished texts. They discuss different organizational and descriptive strategies, including evocation of sensory detail, synthesis of complete scenes, the value of partial versus omniscient perspectives, and of first person versus third person accounts. Of particular interest is the author's discussion of notetaking as a mindset. They show how transforming direct observations into vivid descriptions results not simply from good memory but more crucially from learning to envision scenes as written. A good ethnographer, they demonstrate, must learn to remember dialogue and movement like an actor, to see colors and shapes like a painter, and to sense moods and rhythms like a poet.The authors also emphasize the ethnographer's core interest in presenting the perceptions and meanings which the people studied attach to their own actions. They demonstrate the subtle ways that writers can make the voices of people heard in the texts they produce. Finally, they analyze the \"processing\" of fieldnotes--the practice of coding notes to identify themes and methods for selecting and weaving together fieldnote excerpts to write a polished ethnography.This book, however, is more than a \"how-to\" manual. The authors examine writing fieldnotes as an interactive and interpretive process in which the researcher's own commitments and relationships with those in the field inevitably shape the character and content of those fieldnotes. They explore the conscious and unconscious writing choices that produce fieldnote accounts. And they show how the character and content of these fieldnotes inevitably influence the arguments and analyses the ethnographer can make in the final ethnographic tale.This book shows that note-taking is a craft that can be taught. Along with Tales of the Field and George Marcus and Michael Fisher's Anthropology as Cultural Criticism, Writing Ethnographic Fieldnotes is an essential tool for students and social scientists alike.",
        "Category": " Language Arts & Disciplines , Rhetoric",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Dilbert Future: Thriving on Stupidity in the 21st Century",
        "Authors": "By Adams, Scott",
        "Description": "In The Dilbert Principle and current bestseller Dogbert&#39;s Top Secret Management Handbook, Scott Adams skewers the absurdities of today&#39;s corporate world. Now he takes the next step, turning his keen analytical focus on how human greed, stupidity and horniness will shape the future.   With this book, Adams follows in the footsteps of other great futurists, i.e., sitting at home making stuff up that can&#39;t be proven wrong for many years. Featuring the same mix of essays and cartoons that made The Dilbert Principle so uniquely entertaining, The Dilbert Future offers predictions on business, technology, society and government. Nobody is spared this time. Some predictions:  Children: They are our future, so we&#39;re pretty much hosed. Tip: Grab what you can while they&#39;re still too little to stop us.   Human Potential: We&#39;ll finally learn to use the 90 percent of the brain we don&#39;t use today, and find out that there wasn&#39;t anything in that part.   Longevity: We&#39;ll all live to 140. The Olympics will expand to include new events such as Complaining and Slow Driving.   Computers: Technology and homeliness will combine to form a powerful type of birth control.",
        "Category": " Humor , General",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "A load of trouble: \"Bread gained by deceit is sweet to a man ; but afterwards his mouth shall be filled with gravel\", Proverbs 20:17 (Christopher Churchmouse classics)",
        "Authors": "By Davoll, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "ChariotVictor Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Skintight (Hqn)",
        "Authors": "By Andersen, Susan",
        "Description": "Professional poker player Jax Gallagher should have known better than to wager a World Series baseball that wasn't his to lose. Now the man who won the collectible is demanding his prize…or else. Trouble is, the ball is owned by his estranged father's widow—a flamboyant Las Vegas showgirl. Jax will do whatever it takes to get it back.Yet Treena McCall is anything but the ruthless gold digger Jax expects. She's built a life for herself filled with good friends and hard work. And she's got enough on her plate trying to hang on to her job as a dancer without being wined, dined and seduced by sexy Jax Gallagher….",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Enjoying Hummingbirds More",
        "Authors": "By Thompson, William Hepworth (EDT) and Bowers, Mary Beacam",
        "Description": "",
        "Category": " Nature , General",
        "Publisher": "Bird Watchers Digest Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Mig the Pig",
        "Authors": "By Hawkins, Colin",
        "Description": "",
        "Category": " Juvenile Fiction , Nursery Rhymes",
        "Publisher": "Dorling Kindersley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "My Very First Peter Pan Storybook",
        "Authors": "By Rochelle Larkin",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore Inc Publishers?",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Garfield and the Beast in the Basement (Planet Reader, Chapter Book)",
        "Authors": "By Davis, Jim, Kraft, Jim, and Fentz, Mike (ILT)",
        "Description": "When two frightened mice tell Garfield there's a beast living in the house, Garfield warily sets out to investigate",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Treasures of the Bible",
        "Authors": "By Smithmark Publishing",
        "Description": "Featuring more than five hundred illustrations, a compilation of thousands of colorful stories, poems, and anecdotes from the Good Book, including a glossary of Biblical figures and themes, is written at a basic reading level for adults and children to share.",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The New Strong's Exhaustive Concordance of the Bible: With Main Concordance, Appendix to the Main Concordance, Key Verse Comparison Chart, Dictionary ... Bible, Dictionary of the Greek Testament",
        "Authors": "By James Strong LL.D. S.T.D.",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "6.52",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Handbook of Abusable Drugs",
        "Authors": "By Blum, Kenneth",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Amereon Ltd",
        "Price Starting With ($)": "8.19",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "The Master's men (John MacArthur's Bible studies)",
        "Authors": "By MacArthur, John F.",
        "Description": "",
        "Category": "",
        "Publisher": "Word of Grace Communications",
        "Price Starting With ($)": "6.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Meet the Honeybears (Modern picture book)",
        "Authors": "By David Vincent",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Pub",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Controlling Stress and Tension (7th Edition)",
        "Authors": "By Girdano, Daniel A., Everly, George S., Jr., and Dusek, Dorothy E.",
        "Description": "Controlling Stress and Tension, 8/e,   takes a multifaceted, holistic approach to stress management. The first part of the book discusses the stress problem and our potential for achieving solutions to it. The next chapters examine potential stress-producing elements in everyday life. The remainder of the book offers techniques for alleviating stress and tension. Personal journal activities and self-assessments placed throughout the book encourage readers to apply the concepts they have learned to themselves. KEY TPICS: Stress, Stressors and Stress Management, Systems That Control Stress Arousal, The Body’s Response to Stress, The Human Spirit,  Stressful Emotions, Thoughts, and Beliefs, Patterns of Behavior, Demands and Expectations, Stress and the Human Environment Interaction, Stress in Relationships, The Stress of Terrorism and Trauma,  Stress in the Workplace, Breathing and Relaxation,  Muscle Relaxation,  Autogenics and Visual Imagery,  Yoga and Stretch-Relaxation,  Meditation, Stress Reduction through Physical Activity, Your Personal Stress Management Plan.  Intended for those interested in learning the basics of stress management.",
        "Category": " Psychology , General",
        "Publisher": "Benjamin Cummings",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Christmas Quilt",
        "Authors": "By Davis, Thomas J.",
        "Description": "A book of love, hope, and warmth, The Christmas Quilt is about home,about roots, and about \"one small snowflake following another, settling onthe ground soft like a kiss from heaven, covering Smoky Hollow like a blanket ofgrace that shines white with goodness.\"Reminiscent of Lee Smith's Oral History or of Cold Sassy Treeby Olive Ann Burns for its intimate portrayal of mountain life in an earlierday,The Christmas Quilt is a compelling and tender account of sevenmonths in the lives of the members of a family in the mountains of northGeorgia. It will endear you not only to its storyline, but to the pictures itpaints of Sunday dinners, of picking blackberries, of running train tracks, of arevival meeting, and of Granny creating a quilt for her long-absent son.",
        "Category": " Fiction , General",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Berlin indictment",
        "Authors": "By Fischer, Erwin",
        "Description": "",
        "Category": "",
        "Publisher": "World Pub. Co",
        "Price Starting With ($)": "9.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Secrets of Self-Healing: Harness Nature's Power to Heal Common Ailments, Boost Vitality, and Achieve Optimum Wellness",
        "Authors": "By Ni, Maoshing",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Owl and the Pussy-Cat and Calico Pie (Rand McNally Elf Book)",
        "Authors": "By Lear, Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Checkerboard Press",
        "Price Starting With ($)": "16.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "The golden guide to American antiques (A Golden Handbook)",
        "Authors": "By Cole, Ann Kilborn",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Speak with confidence: A practical guide",
        "Authors": "By Vasile, Albert J., Mintz, Harold K.",
        "Description": "",
        "Category": "",
        "Publisher": "Winthrop Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Emeril's New New Orleans Cooking",
        "Authors": "By Lagasse, Emeril and Tirsch, Jessie",
        "Description": "Emeril Lagasse fuses the rich traditions of Creole cookery with the best of America&#39;s regional cuisines and adds a vibrant new palette of tastes, ingredients, and styles. The heavy sauces, the long-cooked roux, and the smothered foods that were the heart of old-style New Orleans cooking have been replaced by simple fresh ingredients and easy cooking techniques with a light touch. Emeril serves up a masterpiece in his first cookbook, Emeril&#39;s New New Orleans Cooking.Emeril offers not only hundred of easy-to-prepare recipes, but plenty of professional tips, shortcuts, and useful information about stocking your own New Orleans pantry and making your own seasonings.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Creative Window Boxes (Practical Gardening Library)",
        "Authors": "By Donaldson, Stephanie",
        "Description": "This book provides easy-to-follow instruction for creating beautiful window boxes of all shapes, sizes, and styles.",
        "Category": " Gardening , Container",
        "Publisher": "Anness",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "John James Audubon: American Art Series",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Medicine: An Illustrated History",
        "Authors": "By Lyons, Albert S. and Petrucelli, R. Joseph",
        "Description": "Traces the history of medicine from prehistoric times to the 20th century and examines the growth of the healing professions",
        "Category": " Health & Fitness , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "12.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Athenian adventure; With alarums and excursions",
        "Authors": "By C. P. Lee",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "A Fair to Remember (Camp Confidential, No. 13)",
        "Authors": "By Morgan, Melissa J.",
        "Description": "Jenna is psyched to have all of her friends up to her lake house! Greenwood Lake is so much fun, especially on Memorial Day weekend, when they have an annual county picnic and an old-fashioned carnival. The weekend is off to a perfect start . . . until Jenna’s brother invites David, her old crush and Sarah’s current boyfriend! Jenna handles the situation by trying to ignore David. But when the picnic rolls around and she and David are partnered up for the three-legged race, the sparks that fly between them are way too electric to ignore!",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Wish You Weren't Here #8 (Camp Confidential)",
        "Authors": "By Morgan, Melissa J.",
        "Description": "Athletic, quiet Sarah loves Camp Lakeview and is psyched to be back for another summer in the sun. She gets along with everyone and never makes waves. But when Sarah meets the girls of bunk 4C, she’s in for a huge surprise: Phoebe, a classmate of hers from back home, has come to camp this summer! Phoebe’s friendly, sure, but . . . well, she’s from Sarah’s other life, her \"real\" life, the one she leaves behind when she heads off for Lakeview. And if Sarah isn’t careful, Phoebe could spill her secrets to the rest of the campers. Sarah could never live that down . . .",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Bad Girl: Confessions Of A Teenage Delinquent",
        "Authors": "By Vona, Abigail",
        "Description": "With adolescent swagger, BAD GIRL tells the unnerving story of an outlaw young life that must  be broken, reshaped and finally redeemed. At fifteen Abigail Vona was Involved with boys, booze, drugs and stealing anything and everything she could lay her hands on.  She  was spiraling out of control.  Helpless to control his daughter, Mr. Vona committed Abigail to Peninusla Village, a controversial treatment facility for “behavior modification” in Louisville, Tennessee. No sooner did she walk through the door she was  put on suicide watch which lasted for 3 months.  She was not allowed to dress in more than a hospital gown until she graduated to “level-three lockdown” and “wilderness boot camp”  where she stayed for nearly a year.  And though it all started as a nightmare, it eventually became her salvation.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Rugged Land",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Twilight Companion: The Unauthorized Guide to the Series",
        "Authors": "By Gresh, Lois H.",
        "Description": "Everyone's in love with vampires, and if his name happens to be Edward Cullen, then readers of the wildly popular Twilight series by Stephenie Meyer can't help but be crazy about him. For all those who adore Bella Swan, Edward, and the rest of the Cullen family and can't get enough, this companion guide is a must-read and a terrific gift.  The series follows an unlikely couple: Bella, a teenager, and her boyfriend Edward, a vampire that has sworn off human blood. But their love is ill-fated--being a vampire, Edward must keep his passion in check, lest he is driven to suck Bella's blood. With legends, lore, and myths about everything from vampires to werewolves to immortality, a bio of the author, and a ton of insight into the four-book series, this companion guide will give millions of readers the information that they've been waiting for since book one.",
        "Category": " Young Adult Nonfiction , Reference",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Alphabears: An ABC Book",
        "Authors": "By Hague, Michael (ILT) and Hague, Kathleen",
        "Description": "In Alphabears, twenty six huggable teddies help teach children the letters of the alphabet:A is for Amanda, a good teddy bearWho carries sweet apples everywhere. Michael Hague's warm, detailed paintings complement Kathleen Hague's happy, rhyming texts. Even the youngest of readers will treasure and learn from these two charming concept books",
        "Category": " Juvenile Fiction , Concepts , Alphabet",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Pleasure and Purpose",
        "Authors": "By Hart, Megan",
        "Description": "Introducing the women of the Order of Solace?three new novellas from the national bestselling master of erotic romance. The handmaidens of the Order of Solace are each named for the exquisite service that best reflects their true calling. Their greatest delight is giving pleasure?devoted as they are to fulfilling the desires of the mind, the needs of the soul, and the cravings of the body.  Meet Stillness, called upon to soothe the conscience of a man in need of redemption after a shocking act from his sexual past. Then there?s Honesty, whose vow of Solace is to a prince looking for a submissive handmaiden. Instead, he gets the unexpected. And finally, Determination, a handmaiden confronted with a client lost in a haze of random sex and drugs. She has just the plan to literally whip her man into shape.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Eat That Frog! 21 Great Ways to Stop Procrastinating and Get More Done in Less Time",
        "Authors": "By Tracy, Brian",
        "Description": "Stop Procrastinating  Get More of the Important Things Done—Today!  There just isn’t enough time for everything on our to-do list—and there never will be. Successful people don’t try to do everything. They learn to focus on the most important tasks and make sure those get done. They eat their frogs. There’s an old saying that if the first thing you do each morning is eat a live frog, you’ll have the satisfaction of knowing you’re done with the worst thing you’ll have to do all day. For Tracy, eating a frog is a metaphor for tackling your most challenging task—but also the one that can have the greatest positive impact on your life. Eat That Frog! shows you how to organize each day so you can zero in on these critical tasks and accomplish them efficiently and effectively. In this fully revised and updated edition, Tracy adds two new chapters. The first explains how you can use technology to remind yourself of what is most important and protect yourself from what is least important. The second offers advice for maintaining focus in our era of constant distractions, electronic and otherwise.  But one thing remains unchanged: Brian Tracy cuts to the core of what is vital to effective time management: decision, discipline, and determination. This life-changing book will ensure that you get more of your important tasks done—today!",
        "Category": " Business & Economics , Time Management",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Oil Painting Techniques: Learn How to Master Oil Painting Working Techniques to Create your Own Successful Paintings (ARTIST'S PAINTING LIBRARY)",
        "Authors": "By Lewis, David (EDT)",
        "Description": "Do you want to become more confident handling an oil brush? How about developing your skill in manipulating and mixing oil colors? This volume, filled with the experience and techniques of ten of today's finest oil painters, shows you how to discover and paint your own successful paintings, covering everything from the importance of brush selection to capturing the color nuances of a collapsing wave.Together these artists offer a treasury of instruction in oil technique: Charles Reid shows you how to handle an oil brush with dexterity and how to make handling and mixing color simple. Wendon Blake, George Cherepov, Paul Strisik, and Richard Schmid teach you how to capture the magnificence of a full landscape, and the more subtle characteristics of the countryside; Foster Caddell shows you how to overcome elementary errors in composition, balance of values and especially how to handle color in the landscape; E. John Robinson demonstrates how to capture the color and awesome power in the sea and shore; Ken Davies teaches you how to render sharp focus still lifes in oil; and John Howard Sanden, Charles Pfahl and Jane Corsellis show you how to paint the human portrait and figure, perhaps the most intriguing painting subject of all. The book is divided into seven sections: oil Brushwork, handling color, landscapes, color in landscapes, seascapes, sharp focus, and figures and portraits. Each section's full-color step-by-step demonstrations clearly illustrate how the artists achieve their striking results, and how you can too.Profusely illustrated and entirely in color, Oil Painting Techniques is required reading for the amateur or intermediate oil painter who wants to develop his skill in this medium.",
        "Category": " Art , Techniques , General",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "The Tenth City (Land of Elyon)",
        "Authors": "By Carman, Patrick",
        "Description": "",
        "Category": "",
        "Publisher": "Orchard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Best Friends: Witty Meaningful Quotes on Friendship",
        "Authors": "By Anne Howard",
        "Description": "",
        "Category": "",
        "Publisher": "Axis Publishing Limited",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Totally Picnic Cookbook (Totally Cookbooks)",
        "Authors": "By Siegel, Helene and Vibbert, Carolyn (ILT)",
        "Description": "Are you ready to get out of the kitchen and into the great outdoors? Make some Citrus-Marinated Game Hens, a Couscous Salad with Roasted Peppers, and Ginger Peanut Butter Cookies for a day at the lake or Cool Watercress Soup, Mustard Chicken, and Berry Cheesecake Brownies for a summer afternoon at the park. With menus for snacks, sandwiches, salads, meats, and desserts ready for picnics anywhere from the beach to your backyard, the weekend-ready recipes in this handy pocket-size cookbook are designed to satisfy hungry picnickers on any occasion.",
        "Category": " Cooking , Methods , Outdoor",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Eloise's What I Absolutely Love Love Love",
        "Authors": "By Knight, Hilary and Thompson, Kay",
        "Description": "What does Eloise absolutely love love love?  Well, she just adores lots of things -- The Plaza Hotel, Room Service of course, taking walks with Nanny, and Weenie's whiskers (which are wonderful). But there's one more thing that Eloise is rawther fond of...",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "English Architecture: A Concise History (World of Art)",
        "Authors": "By Watkin, David",
        "Description": "",
        "Category": " Architecture , History , General",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Bach, Beethoven and the Boys - Tenth Anniversary Edition!: Music History As It Ought To Be Taught",
        "Authors": "By Barber, David W. and Donald, Dave (ILT)",
        "Description": "Bach, Beethoven and the Boys chronicles the lives of the great (and not-so-great) composers as you've never read them before - exploring their sex lives, exposing their foibles and expanding our knowledge of these remarkable but also human creatures.",
        "Category": " Music , Instruction & Study , Composition",
        "Publisher": "Sound And Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Color of Love: An Artist's Book of Poetry and Passion",
        "Authors": "By Bancou, Marielle",
        "Description": "“Marielle Bancou’s hand-painted books are works of art that are also physically irresistible—when you see them, you need to touch them.”–House & GardenWhat began as an exquisite, handmade work of art is now a lavish gift for lovers everywhere. First created a decade ago in an extremely limited, silk-screened edition by renowned bookmaker Marielle Bancou, The Color of Love is one of the most accessible and wide-ranging collections of writings on love ever assembled. On glorious, hand-lettered pages —each a work of art in itself —it brings together beloved haiku, sonnets, and odes, as well as many unexpected gems by a stellar lineup of luminaries: from Wang Wei to Solomon, Sophocles to John Donne, Rumi to Shakespeare, James Joyce to Cole Porter. “Marielle Bancou’s hand-painted books are works of art that are also physically irresistible—when you see them, you need to touch them.”–House & GardenWhat began as an exquisite, handmade work of art is now a lavish gift for lovers everywhere. First created a decade ago in an extremely limited, silk-screened edition by renowned bookmaker Marielle Bancou, The Color of Love is one of the most accessible and wide-ranging collections of writings on love ever assembled. On glorious, hand-lettered pages —each a work of art in itself —it brings together beloved haiku, sonnets, and odes, as well as many unexpected gems by a stellar lineup of luminaries: from Wang Wei to Solomon, Sophocles to John Donne, Rumi to Shakespeare, James Joyce to Cole Porter.",
        "Category": " Poetry , General",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "26.96",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "High Above London (World from the Air)",
        "Authors": "By Roveda, Barbara, Hawkes, Jason (PHT), and McConnel, Nathan (PHT)",
        "Description": "Allowing us to travel mid-air through London, these photographs lead us to a new appreciation of a city that has always been foremost in people's imagination. These aerial photographs show us a complex city of contrasts that is also home to Europe's most ethnically diverse population.",
        "Category": " Photography , Subjects & Themes , Landscapes",
        "Publisher": "White Star Publishers",
        "Price Starting With ($)": "32.04",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Rothenburg Ob Der Tauber: Guide with 144 color prints",
        "Authors": "By Kraichgau - Verlag",
        "Description": "",
        "Category": "",
        "Publisher": "Kraichgau Verlag",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Home Masonry Repairs & Projects (Black & Decker Home Improvement Library)",
        "Authors": "By Black & Decker",
        "Description": "Shows how to work with and repair concrete, brick, and block, and includes project instructions",
        "Category": " House & Home , Do-It-Yourself , Masonry",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Self-Defense for Girls; a Secondary School & College Manual",
        "Authors": "By Bruce Tegner",
        "Description": "",
        "Category": "",
        "Publisher": "Thor Pub. Co",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Wealth: How to Get It : How to Keep It : The H.D. Vest System for Achieving Financial Security",
        "Authors": "By Vest, Herb D. and Niedermeier, Lynn R.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Amacom Books",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Triathlete's Training Bible: A Complete Training Guide for the Competitive Multisport Athlete",
        "Authors": "By Friel, Joe",
        "Description": "This intensive guide covers the specialized training needs of triatheletes, who must stretch, strengthen, and tone the muscles used in three different sports. It includes the latest research on nutrition; covers racing, rest, and recovery; and outlines the best techniques for increasing endurance without overtraining. Appendices include training-plan worksheets and suggested workouts.",
        "Category": " Sports & Recreation , Track & Field",
        "Publisher": "Velo Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Art of Flower Arranging",
        "Authors": "By Hall, Jan",
        "Description": "A step-by-step guide to arranging flowers shows how to create a variety of imaginative floral designs using a wide range of fresh, dried, and pressed flowers",
        "Category": " Gardening , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Hindenburg at Home: An Intimate Biography",
        "Authors": "By Hindenburg, Helen Nostitz Von",
        "Description": "",
        "Category": "",
        "Publisher": "Duffield & Green",
        "Price Starting With ($)": "9.84",
        "Publish Date": {
            "Month": "January",
            "Year": "1931"
        }
    },
    {
        "Title": "When the Rivers Run Dry: Water--The Defining Crisis of the Twenty-first Century",
        "Authors": "By Pearce, Fred",
        "Description": "In this groundbreaking book, veteran science correspondent Fred Pearce travels to more than thirty countries to examine the current state of crucial water sources. Deftly weaving together the complicated scientific, economic, and historic dimensions of the world water crisis, he provides our most complete portrait yet of this growing danger and its ramifications for us all. Named as one of the Top 50 Sustainability Books by University of Cambridges Programme for Sustainability Leadership and Greenleaf Publishing.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Fantastic Cutaway: Speed (Copper Beach Series)",
        "Authors": "By Richards, Jon and Pang, Alex",
        "Description": "Captioned illustrations provide information about some of the world's fastest vehicles on land, sea, and in the air and describes recent record-setting attempts",
        "Category": " Juvenile Nonfiction , Transportation , General",
        "Publisher": "Copper Beech",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Military Customs and Traditions",
        "Authors": "By Major Mark M. Boatner III",
        "Description": "",
        "Category": "",
        "Publisher": "D. McKay Co",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "A Workable Plan of Evangelism",
        "Authors": "By Dawson C. Bryan",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon-Cokesbury Press",
        "Price Starting With ($)": "9.2",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "The Ultimate Field Guide to the US Economy: A Compact and Irreverent Guide to Economic Life in America, New Updated Edition",
        "Authors": "By Heintz, James (EDT) and Folbre, Nancy (EDT)",
        "Description": "The Ultimate Field Guide to the U.S. Economy is the latest version of “the best and . . . least solemn guide to the dismal science you are likely soon to encounter” (John Kenneth Galbraith), revised and expanded with the most recent data. The book brings key policy issues to life, reflecting the collective wit and wisdom of the best economic literacy activists in the country. The Ultimate Field Guide tells you what you need to know about owners, workers, welfare and education, government spending, health, environment, macroeconomics, and the global economy. New charts on the increasing inequality of income and the deterioration of the natural environment point to problems facing the twenty-first century. Lively illustrations and wry cartoons make this book easy to read and hard to put down.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "The New Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "I Love You More",
        "Authors": "By Duksta, Laura and Keesler, Karen (ILT)",
        "Description": "In back-to-back stories, a boy and his mother express the height, sweetness, length, depth, and strength of their love for each other.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "I Shine Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "A Kitten Tale",
        "Authors": "By Rohmann, Eric",
        "Description": "Once there were four kittens who had never seen snow. The first three kittens are wary—snow is cold, it’s wet, it covers everything. As the seasons pass and winter begins to loom, the three skittish kittens worry. But the fourth kitten is getting excited. Snow will cover everything! “I can’t wait!”",
        "Category": " Juvenile Fiction , Concepts , Seasons",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Jupiter's Daughter",
        "Authors": "By Hyman, Tom",
        "Description": "With the explosive shock of Michael Crichton's Jurassic Park and Stephen King's Carrie, Jupiter's Daughter introduces an unforgettable young heroine, the first human whose entire genetic character is programmed before birth. The result of a unique combination of scientific ambition and financial greed, this super baby is born into a world not quite ready for her.When venture capitalist Dalton Stewart meets up with Nobel Prize-winning Harold Goth and his controversial experiments with human genes, a risky plan is born: to develop and exploit a computer program that will create a markedly superior child. Dalton's own wife, Anne, is chosen - without her knowledge - to be the mother of the first genetically engineered improvement of the human species.The night Genevieve Stewart is born - at midnight, on January 1, 2000 - her creator dies and his laboratory is destroyed. And the world's most dangerous human experiment begins.Anne is both enchanted and frightened by her daughter's precocity. Genny's health is perfect, her intelligence and physical strength way above average, and her senses supernaturally keen. And as she matures, she begins to demonstrate mysterious mental and physical powers.This extraordinary child - and the program that created her - become the focus of a deadly international competition involving a sadistic German baroness and the governments of the United States and Japan. How Genny and her mother ultimately outwit and defeat those who conspire to exploit the child forms the story's central narrative and its stunning conclusion.The all-too-possible secret of Genny's genetic programming takes us to the dark heart of the controversial science of genetics and raises profoundly disturbing ethical questions.",
        "Category": " Fiction , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Fireproof",
        "Authors": "By Wilson, Eric, Kendrick, Alex (CON), and Kendrick, Stephen (CON)",
        "Description": "INSIDE BURNING BUILDINGS, Captain Caleb Holt lives by the firefighter's adage: NEVER LEAVE YOUR PARTNER.Yet at home, in the cooling embers of his marriage, he lives by his own rules.Growing up, his wife Catherine always dreamed of marrying a loving, brave firefighter . . . just like her father. Now, after seven years of marriage, she wonders when she stopped being \"good enough.\" Countless arguments and anger have them wanting to move on to something with more sparks.As they prepare for divorce, Caleb's father challenges him to commit to a 40-day experiment: \"The Love Dare.\" Wondering if it's even worth the effort, Caleb reluctantly agrees, not realizing how it will change his world forever.Surprised by what he discovers about the meaning of love, Caleb begins to see his wife and marriage as worth fighting for. But is it too late? His job is to rescue others. Now Captain Holt must face his toughest job ever . . . rescuing his wife's heart.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Beyond the Picket Fence and Other Short Stories",
        "Authors": "By Lori Wick",
        "Description": "",
        "Category": "",
        "Publisher": "Sweet River Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Great Depression Ahead: How to Prosper in the Crash Following the Greatest Boom in History",
        "Authors": "By Dent, Harry S.",
        "Description": "The first and last economic depression that you will experience in your lifetime is just ahead. The year 2009 will be the beginning of the next long-term winter season and the initial end of prosperity in almost every market, ushering in a downturn like most of us have not experienced before. Are you aware that we have seen long-term peaks in our stock market and economy very close to every 40 years due to generational spending trends: as in 1929, 1968, and next around 2009? Are you aware that oil and commodity prices have peaked nearly every 30 years, as in 1920, 1951, 1980 -- and next likely around late 2009 to mid-2010? The three massive bubbles that have been booming for the last few decades -- stocks, real estate, and commodities -- have all reached their peak and are deflating simultaneously.Bestselling author and renowned economic forecaster Harry S. Dent, Jr., has observed these trends for decades. As he first demonstrated in his bestselling The Great Boom Ahead, he has developed analytical techniques that allow him to predict the impact they will have. The Great Depression Ahead explains \"The Perfect Storm\" as peak oil prices collide with peaking generational spending trends by 2010, leading to a more severe downtrend for the global economy and individual investors alike.He predicts the following:? The economy appears to recover from the subprime crisis and minor recession by mid-2009 -- \"the calm before the real storm.\"? Stock prices start to crash again between mid- and late 2009 into late 2010, and likely finally bottom around mid-2012 -- between Dow 3,800 and 7,200.? The economy enters a deeper depression between mid-2010 and early 2011, likely extending off and on into late 2012 or mid-2013.? Asian markets may bottom by late 2010, along with health care, and be the first great buy opportunities in stocks.? Gold and precious metals will appear to be a hedge at first, but will ultimately collapse as well after mid- to late 2010.? A first major stock rally, likely between mid-2012 and mid-2017, will be followed by a final setdback around late 2019/early 2020.? The next broad-based global bull market will be from 2020-2023 into 2035-2036.Conventional investment wisdom will no longer apply, and investors on every level -- from billion-dollar firms to the individual trader -- must drastically reevaluate their policies in order to survive. But despite the dire news and dark predictions, there are real opportunities to come from the greatest fire sale on financial assets since the early 1930s. Dent outlines the critical issues that will face our government and other major institutions, offering long- and short-term tactics for weathering the storm. He offers recommendations that will allow families, businesses, investors, and individuals to manage their assets correctly and come out on top. With the right knowledge and preparation, you can take advantage of new wealth opportunities rather than get caught in a downward spiral. Your life is about to change for reasons outside of your control. You can't change the direction of the winds, but you can reset your sails!",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Reading Reminders: Tools, Tips, and Techniques (Great Source Professional Development)",
        "Authors": "By Burke, Jim and Bird, Lois Bridges",
        "Description": "Do you have a minute? That's how quickly this book will help you improve your students' reading skills. Designed to be read on the run and make every minute count in your classroom, Reading Reminders features Jim Burke's one hundred best techniques for teaching reading, complete with tools and tips on how to implement them.  Jim wrote this book to help teachers like himself whose often large and always diverse classrooms contain a wide range of reading abilities and needs. All of the strategies have been tested and tested again with his students, and each one has achieved significant gains in student performance, confidence, and engagement. Together, the reminders will challenge your best students and support struggling ones. This book will help you:  teach students to read a variety of types of texts, including websites, tests, literature, and textbooks use a wide range of teaching and reading strategies based on current reading research anchor your teaching in state and national reading standards establish and maintain a comprehensive reading program that includes Sustained Silent Reading and direct instruction plan your lessons, select your texts, and assess students' learning with tools and techniques specifically designed for those purposes improve your students' ability to discuss and understand what they read develop a community of reflective readers within your classroom increase the amount of writing your students do.",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "Heinemann",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Rescue Your Love Life: Changing Those Dumb Attitudes & Behaviors That Will Sink Your Marriage",
        "Authors": "By Cloud, Henry and Townsend, John",
        "Description": "The best-selling author duo of Dr. Henry Cloud & Dr. John Townsend come to the aid of readers who are drowning in a sea of good intentions and misplaced priorities with Rescue Your Love Life, a simultaneous trade book and workbook release. Sure to top the charts of the Relationship/Marriage category, this title shows couples how to ignite their marriage with fifty irresistible attitudes and behaviors. Beginning with self-examination and setting realistic expectations, the authors explore how couples can nurture and master healthy communication, build trust and enhance the romance in their marriage. As in their other best-selling literary endeavors, Cloud & Townsend take it a step further as they help couples solve destructive conflicts and offer strategies for avoiding temptation that can destroy God’s plan for marriage.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Integrity Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Leading Church Thru Change (Creative leadership series)",
        "Authors": "By Walrath, Douglas Alan",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "15 Minutes Alone with God for Men",
        "Authors": "By Barnes, Bob",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Real Stew: 300 Recipes for Authentic Home-Cooked Cassoulet, Gumbo, Chili, Curry, Minestrone, Bouillabaise, Stroganoff, Goulash, Chowder, and Much More (Non)",
        "Authors": "By Wright, Clifford A.",
        "Description": "In this book, the author takes cooks on a culinary voyage around the world to discover the favorite comfort foods of nearly 50 countries.",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Harvard Common Pr",
        "Price Starting With ($)": "5.91",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Cook's Illustrated Complete Book of Poultry",
        "Authors": "By Cook's Illustrated Magazine and Love, Judith Dufour (EDT)",
        "Description": "Vast and authoritative, with 38 chapters containing nearly 500 recipes and 300 illustrations, The Cook's Illustrated Complete Book of Poultry offers readers the very best methods for preparing chicken, turkey, duck, goose, quail, squab, and pheasant.Nowhere can you find the volume of testing and research that you do in Cook's Illustrated. Forty turkeys roasted to find the best Thanksgiving bird. Duck prepared ten different ways to ensure the crispiest skin and moistest meat. Countless chickens basted and turned to determine that preheating the roasting pan is the secret to the tastiest one. No other cookbook has taken this approach to the subject, and no other book has broken such new ground in the kitchen.Master recipes provide all the basics to prepare poultry in particular styles--from fried chicken to braised quail, sautéed turkey cutlets to roasted Cornish game hens.The variations follow: an exhaustive listing that will yield fresh recipes for years to come. These include delights like Sautéed Chicken Cutlets with Marsala, Chicken and Herb Dumplings with Spring Vegetables, and Cincinnati-Style Turkey Chili. There are even recipes specially designed to make use of leftovers. For grill enthusiasts, sidebars cover such topics as finding the best charcoal and setting up the grill for indirect cooking. Recipes range from easy grilled chicken wings to a show-stopping grill-roasted whole turkey guaranteed to be the best you've ever tasted. Step-by-step illustrations guide the reader through every technique. Informative sidebars rate everything from roaster racks to canned chicken broth. Enlightening, instructive, and invaluable, this is a book that any cook interested in poultry--and in learning the best way to prepare any bird--can't afford to be without.",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "What The Heart Can'T Hide",
        "Authors": "By Major, Ann, Howard, Linda, and Mallory, Susan",
        "Description": "What The Heart Can't Hide by Linda Howard\\Ann Major\\Susan Mallery released on Sep 23, 2003 is available now for purchase.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Talking Leadership: Conversations with Powerful Women",
        "Authors": "By Hartman, Mary S. (EDT)",
        "Description": "Interviews with 13 women, in areas ranging from philanthropy to politics and from business to academia, present a thought-provoking look at differences and commonalities in the lives and leadership approaches of women committed to social change. Beyond personal details and anecdotes, conversations capture a variety of experiences and insights reflecting what it's like to be a woman and a major leader in America at the close of the 20th century. Hartman is a professor and director for the Institute of Women's Leadership at Douglass College, Rutgers University. Lacks a subject index. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Rutgers University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The creative Christian home,",
        "Authors": "By Sparks, Merla Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Book House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Caterpillow Fight (Giggle Club)",
        "Authors": "By McBratney, Sam and Barton, Jill (ILT)",
        "Description": "\"There were caterpillow thumps and caterpillow whacks on caterpillar tummies and on caterpillar backs.\"All the little caterpillars have gone to bed, with their caterpillows for their little heads. But in the middle of the night, one caterpillar decides to wake all the others for a thumping, whumping caterpillow fight! With fresh, exuberant illustrations by Jill Barton, Sam McBratney's delightfully tongue-tangling tale will have lap-sitters giggling and wiggling and ready for a romp.",
        "Category": " Juvenile Fiction , Animals , Insects, Spiders, etc.",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Alfred's Basic Piano Course: Lesson Book - Level 3",
        "Authors": "By Palmer, Willard A., Manus, Morton, and Lethco, Amanda Vick",
        "Description": "This easy step-by-step method emphasizes correct playing habits and note reading through interval recognition. Lesson Book 3 introduces \"overlapping pedal\"; new time signatures 3/8 and 6/8; and the primary triads in Major and Minor keys. Concepts include: passing one under two and one under three; playing major scales in contrary motion; the chromatic scale; the minor scale. For reinforcement of each principle as it is introduced, supplementary material is carefully coordinated, page for page, at each level of instruction. Coordinating supplemental books for Level 3 include: Classic Themes * Composition * Duet * Ear Training * Ensemble * Fun * Hymn * Merry Christmas * Merry Christmas Ensemble * Musical Concepts * Notespeller * Patriotic Solo * Recital * Repertoire * Sight Reading * Technic * Theory and Top Hits! Solo, Christmas and Duet Book. Songs Include: Alpine Melody * Casey Jones * A Day in Vienna * Enchanted City * Fandango * Festive March * Go Down, Moses * Goodbye, Old Paint * Greensleeves * Hunting Song * Intermezzo * Light and Blue * The Major and the Minor * Make Up Your Mind! * On Top of Old Smoky * Prelude in 18th Century Style * Raisins and Almonds * La Raspa * Roman Holiday * Scarborough Fair * Scherzo * Village Dance * Waltz Pantomime",
        "Category": " Music , Instruction & Study , General",
        "Publisher": "Alfred Music",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "American Western Cooking from the Roaring Fork",
        "Authors": "By McGrath, Robert",
        "Description": "Presents a compilation of recipes that can be prepared with ease. Each recipe is explained clearly and provides a section detailing how to perform essential basics, such as smoke roasting, smoking, and grilling meat, preparing stocks, cooking dried beans, and cooking with chile peppers. Cookery, American-Western style.",
        "Category": " Cooking , Regional & Ethnic , American , Western States",
        "Publisher": "Gulf Publishing",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Art of Adaptation: Turning Fact And Fiction Into Film (Owl Books)",
        "Authors": "By Seger, Linda",
        "Description": "Adaptations have long been a mainstay of Hollywood and the television networks. Indeed, most Academy Award- and Emmy Award-winning films have been adaptations of novels, plays, or true-life stories. Linda Seger, author of two acclaimed books on scriptwriting, now offers a comprehensive handbook for screenwriters, producers, and directors who want to successfully transform fictional or factual material into film. Seger tells how to analyze source material to understand why some of it resists adaptation. She then gives practical methods for translating story, characters, themes, and style into film. A final section details essential information on how to adapt material and how to protect oneself legally",
        "Category": " Performing Arts , Television , Screenwriting",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Director's and Officer's Complete Letter Book",
        "Authors": "By Purcell, L.Edward",
        "Description": "Contains a selection of sample letters and phrases as well as information on letter writing to assist directors and officers in improving their correspondence and saving time in writing",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "National Statuary Hall in the Nation's Capitol",
        "Authors": "By Murdock, Myrtle M. Cheney",
        "Description": "",
        "Category": "",
        "Publisher": "Monumental Press",
        "Price Starting With ($)": "5.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Get Healthy Now! With Gary Null",
        "Authors": "By Gary Null",
        "Description": "",
        "Category": "",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "U. S. Navy SEALs in Action",
        "Authors": "By Halberstadt, Hans",
        "Description": "Trained to infiltrate and attack by air, land, and sea, the US Navys SEALs are one of the worlds premier special-operations units. Shot on location in San Diego, this large-format, close-up photo collection fully details SEALs training, maneuvers, tactics, practice techniques, camouflage and uniforms, equipment and more. Get inside the fast-paced world of todays elite Navy SEALs.",
        "Category": " History , Military , Aviation",
        "Publisher": "Zenith Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "WP34 - Musicianship for the Older Beginner: Level 1",
        "Authors": "By Bastien, Jane",
        "Description": "",
        "Category": " Music , Instruction & Study , Appreciation",
        "Publisher": "Kjos Music Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1977"
        }
    },
    {
        "Title": "The World's Great Artillery: From the Middle Ages to the Present Day",
        "Authors": "By Hans Halberstadt",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble, 2002.",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Problems In American Civilization ~ The Declaration of Independence and the Constitution ~ 1949 Paperback Edition ~",
        "Authors": "By Amherst College",
        "Description": "",
        "Category": "",
        "Publisher": "D.C. Heath and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "The Chase: A Hunt Country Suspense Novel",
        "Authors": "By Neuharth, Jan",
        "Description": "Set in the elite foxhunting community of Middleburg, Virginia, this fast-paced mystery, packed with scandal, envy, vengeance, and love, unfolds when Doug Cummings, an attractive and driven lawyer and horseman, realizes that someone is out to kill him when he barely escapes a suspicious accident. With his only known enemy—twisted psychopath Zeb McGraw—behind bars, Doug is forced to ask himself Could someone on the outside be helping McGraw? and Could the culprit be the mysterious cowboy who, almost too miraculously, helped save my horse? Caught in the middle is alluring horsewoman Kendall Waters, recently divorced and battling the demons of her past. As the chilling plot unfolds, Doug struggles to hunt down the would-be killer and end the nightmare, no matter the cost.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Paper Chase Farms Publishing Group",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The White House: The History of an American Idea",
        "Authors": "By Seale, William",
        "Description": "For two centuries the White House has served not only as the official residence of the president of the United States, but as the symbolic home of its owners, the American people. The White House: The History of an American Idea celebrates the mansion's 200 years in a readable, richly illustrated volume that brings together, for the first time, the story of the architecture of the White House and the story of the first families and designers who shaped it.Highlighted by little known details about official and domestic life, The White House reveals the numerous changes the building has undergone and the paradox of its survival. Designed by Irish-born architect James Hoban, the house required preservation efforts fewer than 25 years after its construction. Burned to a smoke-blackened shell by the British in 1814, the house was rebuilt, later to be threatened with replacement but retained, condemned to destruction but made new. Many of the resident presidents hired architects and made changes, small and large. This volume offers rare glimpses of long-vanished interiors and the discarded contributions of such giants of American architecture and design as Benjamin Latrobe, Thomas U. Walter, Louis Comfort Tiffany, and Charles McKim. Illustrations include drawings and photographs from the Historic American Buildings Survey as well as a large selection of historical plans, prints, and photographs, many never before brought together in one volume.Although built in the experimental years of the new nation and altered over its 200-year history, the White House remains the natural symbol of the American presidency and perhaps the best-known residence in the world. The White House tells the story of constant change-architectural, social, and political. The history of the house is a story of survival and growth that parallels that of the nation it has come to symbolize.",
        "Category": " History , United States , General",
        "Publisher": "Aia Pr",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Championship No Limit & Pot Limit Hold 'Em (Championship Series)",
        "Authors": "By McEvoy, Tom and Cloutier, T. J.",
        "Description": "Written by World Champion players T. J. Cloutier and Tom McEvoy (8 titles between them), this is the definitive guide to winning at two of the world's most exciting poker games! All the answers to players most important questions are here: How do you get inside your opponents' heads and learn how to beat them at their own game? How can you tell how much to bet, raise, and reraise in no-limit hold'em? When can you bluff? How do you set up your opponents in pot-limit hold'em so that you can win a monster pot? What are the best strategies for winning no-limit and pot-limit tournaments, satellites, and supersatellites? Rock-solid and inspired advice from two of the most recognizable figures in poker.",
        "Category": " Games , Card Games , Poker",
        "Publisher": "Cardoza",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Better Homes and Gardens Fish and Seafood (Great Cooking Made Easy Series)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Gives advice on preparing seafood for cooking, shares recipes for salads, sandwiches, fish loaves, chowders, and stews, and demonstrates the techniques of grilling, frying, broiling, baking, and poaching",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "A Place in the Country: Country Home Collection",
        "Authors": "By Country Home",
        "Description": "Shows and describes a variety of homes decorated in the country style, and shares the comments of each home's owners",
        "Category": " Art , General",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Bringing Out the Best in People: How to Apply the Astonishing Power of Positive Reinforcement",
        "Authors": "By Daniels, Aubrey C.",
        "Description": "Forget \"re-engineering,\" \"self-directed teams,\" \"cultural change,\" and all the rest of today's trendy management fads - fads that seem to come and go as fast as new car models or the latest clothing fashions. If you're looking for the management system with genuine staying power and that can produce dramatic and measurable results over both the short and long term, this revealing guide by one of the nation's leading behavioral psychologists describes the most important management strategy you will ever implement in your company.The system? \"It's the same as it's always been,\" explains Dr. Aubrey C. Daniels, \"the precise application of the laws that govern human behavior.\" By identifying what reinforces the people in your company and skillfully managing those reinforcers, you can attain the kind of individual performance that adds up to great organizational performance. The step-by-step methods you'll learn from this book are applicable to all people and all organizations all of the time! Use Dr. Daniels' tested performance management system to define reinforcers that work - and tailor them to meet individual employees' needs; set fair performance measurement standards - implement and maintain them with minimal cost and effort; provide constant feedback and reinforcement - the most powerful tools for enabling employees to improve and maintain their own performance; build effective reinforcers into every area of your organization - from compensation and incentive packages... to work rules... to office machinery that's employee-friendly; and eliminate those management practices which have been shown not to bring out the best in people - including slogans, exhortations, and numerical goals and quotas.Backed by performance management case studies at 3M, Xerox, Hewlett Packard, and other major firms, Bringing Out the Best in People gives you not only the tools you need to permanently revitalize productivity, but also a powerful reinforcement system for transforming your employees' work into something they're ready, willing - and yes, eager - to do.",
        "Category": " Business & Economics , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Complete Book of Bedroom Elegance",
        "Authors": "By Wrey, Caroline",
        "Description": "",
        "Category": " Design , General",
        "Publisher": "Overlook Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Tinker Bell and the Lost Treasure (Disney Fairies) (Read-Aloud Storybook)",
        "Authors": "By Brown, Adrienne (ILT), Shimabukuro, Denise (ILT), Marsoli, Lisa (ADP), Clark, Jeff (ILT), and Clingen, Merry (ILT)",
        "Description": "Return to Pixie Hollow for a brand-new movie adventure with Tinker Bell!In Tinker Bell and the Lost Treasure, Tink must travel north of Never Land to find the magical Mirror of Incanta. If she fails, she won’t be able to fix the autumn scepter in time for the changing of the seasons! This exciting full-color Read-Aloud Storybook is based on the new direct-to-DVD movie.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The stenciled house: An inspirational and practical guide to transforming your home",
        "Authors": "By Le Grice, Lyn",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "A Treasury of Adoption Miracles: True Stories of God's Presence Today (Miracle Books Collection)",
        "Authors": "By Kingsbury, Karen",
        "Description": "#1 New York Times bestselling author Karen Kingsbury delivers a collection of powerful stories which explore adoption from the perspectives of those who have experienced it from all sides. Inspiring and comforting, the greatest gift of these stories is in the encouragement they offer--through true accounts of adoption blessings--to anyone considering taking on the special role of an adoptive parent.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Miss Pollys Animal School",
        "Authors": "By Elting, Mary",
        "Description": "",
        "Category": "",
        "Publisher": "Wonder",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Courtyards & Patios: Designing and Landscaping Elegant Outdoor Spaces",
        "Authors": "By Crandall, Chuck and Crandall, Barbara",
        "Description": "",
        "Category": " Gardening , Garden Design",
        "Publisher": "Friedman/Fairfax Pub",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "The Unified Software Development Process",
        "Authors": "By Booch, Grady, Jacobson, Ivar, and Rumbaugh, James",
        "Description": "This guide overviews the Unified Process for software development, with a focus on modeling using the Unified Modeling Language (UML). It demonstrates how the notation and process complement on another, using UML models to illustrate the new process in action.  The authors describe semantics and notation of the different higher-level constructs used on the models.  Constructs such as use cases, actors, subsystems, classes, interfaces, active classes, processes, threads, nodes, and most relations are described in the context of a model. ^^^^ Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Programming , Object Oriented",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Garfield The Pirate",
        "Authors": "By Davis, Jim and Fentz, Mike (ILT)",
        "Description": "Garfield and Jon, rival pirates in Garfield's dream, cooperate in order to find a buried treasure",
        "Category": "",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Turbulence in World Politics",
        "Authors": "By Rosenau, James N.",
        "Description": "In this ambitious work a leading scholar undertakes a full-scale reconceptualization of international relations. Turbulence in World Politics is an entirely new formulation that accounts for the persistent turmoil of today's world, even as it also probes the impact of the microelectronic revolution, the postindustrial order, and the many other fundamental political, economic, and social changes under way since World War II. To develop this formulation, James N. Rosenau digs deep into the workings of communities and the orientations of individuals that culminate in collective action on the world stage. His concern is less with questions of epistemology and methodology and more with the development of a comprehensive theoryone that is different from other paradigms in the field by virtue of its focus on the tumult in contemporary international relations. The book depicts a bifurcation of global politics in which an autonomous multi-centric world has emerged as a competitor of the long established state-centric world. A central theme is that the analytic skills of people everywhere are expanding and thereby altering the context in which international processes unfold. Rosenau shows how the macro structures of global politics have undergone transformations linked to those at the micro level: long-standing structures of authority weaken, collectivities fragment, subgroups become more powerful at the expense of states and governments, national loyalties are redirected, and new issues crowd onto the global agenda. These turbulent dynamics foster the simultaneous centralizing and decentralizing tendencies that are now bifurcating global structures. \"Rosenau's new work is an imaginative leap into world politics in the twenty-first century. There is much here to challenge traditional thought of every persuasion.\" --Michael Brecher, McGill University",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Stolen Secrets (Red Rock Mysteries, No. 2)",
        "Authors": "By Jenkins, Jerry B. and Fabry, Chris",
        "Description": "Bryce and Ashley Timberline wonder what their stepdad is hiding. As they discover more about his past, the twins fear all is not as it seems.What isn’t their stepdad telling them?Watch out! The Timberline twins are on the loose. Bryce and Ashley are ATV-riding tweens from Colorado who unearth action-packed mystery and adventure wherever they go. From clearing the name of a local miscreant to thwarting a gold-stealing heist, the twins’ growing faith and the strong example of their parents guide them through even the most life-threatening situations. With the trademark page-turner style used by Jerry Jenkins and Chris Fabry in the Left Behind: The Kids series, these fast-paced books will keep even reluctant readers on the edge of their seats. Readers will definitely be hooked! Perfect for ages 8-12.",
        "Category": " Young Adult Fiction , Art",
        "Publisher": "Tyndale Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Second Thief",
        "Authors": "By Thrasher, Travis",
        "Description": "When Tom stepped onto the plane, he knew he was making a choice that would  change his life. But he had no idea how much. Author Travis Thrasher says,  \"The Second Thief is a story about a man who survives a plane accident  and has a second chance at life. As he runs from his present mistakes while making  amends for past ones, he comes to grips with his own lack of faith.\" This  fast-moving, unpredictable story asks the question, \"Is it ever too late to  redeem past mistakes?\" Its central character, Tom, realistically represents  the skepticism and doubt of many people today who simply don't buy into Christianity.  Faced with a new opportunity and a chance to change, what will be his decision?  Readers of all ages will enjoy the suspense of Tom's journey and its unexpected,  dramatic conclusion.",
        "Category": " Fiction , Christian , Suspense",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    }
]