[
    {
        "Title": "Lifespan Development of Human Memory",
        "Authors": "By Graf, Peter and Ohta, Nobuo (EDT)",
        "Description": "An original approach to memory development that views memory as a continuous process of growth and loss over the human lifespan rather than as a series of separate periods.Until recently, the vast majority of memory research used only university students and other young adults as subjects. Although such research successfully introduced new methodologies and theoretical concepts, it created a bias in our understanding of the lifespan development of memory. This book signals a departure from young-adult-centered research. It views the lifespan development of memory as a continuous process of growth and loss, where each phase of development raises unique questions favoring distinct research methods and theoretical approaches. Drawing on a broad range of investigative strategies, the book lays the foundation for a comprehensive understanding of the lifespan development of human memory.Topics include the childhood and adulthood development of working memory, episodic and autobiographical memory, and prospective memory, as well as the breakdown of memory functions in Alzheimer's disease. Of particular interest is the rich diversity of approaches, methods, and theories. The book takes an interdisciplinary perspective, drawing on work from psychology, psychiatry, gerontology, and biochemistry.",
        "Category": " Psychology , Cognitive Psychology & Cognition",
        "Publisher": "A Bradford Book",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "A Short History of Medicine",
        "Authors": "By Ackerknecht, Erwin Heinz",
        "Description": "Since it was first published in 1955, \"A Short History of Medicine• has beenhailed as the best available book of its kind: a concise and readableintroduction to the history of medicine, written for students and professionalsalike. This revised edition of Erwin H. Ackerknecht's classic volume is nowavailable in paperback, making the book especially suitable for classroom use.",
        "Category": " Medical , History",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "In The Palaces Of Memory: How we Build the Worlds Inside Our Heads",
        "Authors": "By Johnson, George",
        "Description": "Explores how the human mind transforms experience into stored memory",
        "Category": " Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Gulliver's Travels: An Authoritative Text, the Correspondence of Swift, Pope's Verses on Gulliver's Travels and Critical Essays (A Norton Critical)",
        "Authors": "By Swift, Jonathan",
        "Description": "15 critical essays and extracts from Swift's correspondence accompany the text of Gulliver's travels",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1971"
        }
    },
    {
        "Title": "Great Jewish Quotes: Five Thousand Years of Truth and Humor from the Bible to George Burns",
        "Authors": "By Benshea, Noah (EDT)",
        "Description": "\"A verbal agreement isn't worth the paper it's printed on,\" said movie mogul Sam Goldwyn. But this wise and funny book is worth its weight in gold. It gives you a hundred sparkling nuggets of wit, wisdom, and home truth, mined from a wealth of different sources by poet-philosopher-writer Noah benShea.GREAT JEWISH QUOTES imparts the wisdom of folk sayings, the Talmud, and the Old Testament, side by side with the sagacity and smarts of famous men and women from our own century -- Albert Einstein, Golda Meir, Woody Allen, and dozens more. These insightful and quotable short takes may just make it possible for you to fix what's fixable in your life . . . and give you a chance to laugh about the rest.",
        "Category": " Reference , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Facing Death and the Life After",
        "Authors": "By Graham, Billy",
        "Description": "Examines the nature of death, offers advice on how to cope with the death of a loved one, and discusses death as part of God's plan",
        "Category": "",
        "Publisher": "Grason",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Psychology, Fourth Edition",
        "Authors": "By Kassin, Saul M.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "HGTV Before & After Decorating",
        "Authors": "By Hgtv (EDT)",
        "Description": "Before-and-after photos of amazing room transformations in various styles inspire readers to take action.Ideas for all ranges of skill levels, time commitment, and budget—from simple furniture rearrangement strategies to more dramatic changes in room surface treatments (floors, walls, counters, and more).Each room makeover includes a section on multiple alternatives to one aspect of the redesign—such as wall finishes. These sections give readers more options for applying what they learn from the book to their own rooms.Makeover projects make the book as practical as it is inspiring—what readers expect from HGTV.",
        "Category": " House & Home , Decorating",
        "Publisher": "HGTV",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Awakening Arthur: His Return in Our Time",
        "Authors": "By Bryant, Page",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Bag the Elephant!: How to Win and Keep Big Customers",
        "Authors": "By Kaplan, Steve",
        "Description": "Bag the Elephant! is more than a strategy book; it's packed with proven guidelines, tools, and techniques. Throughout the book you'll find stories, derived from the author's real-world experience, that show you how to put the strategy to work.",
        "Category": " Business & Economics , Strategic Planning",
        "Publisher": "Bard Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Red Sky at Morning: America and the Crisis of the Global Environment",
        "Authors": "By Speth, James Gustave",
        "Description": "This book will change the way we understand the future of our planet. It is both alarming and hopeful. James Gustave Speth, renowned as a visionary environmentalist leader, warns that in spite of all the international negotiations and agreements of the past two decades, efforts to protect Earth’s environment are not succeeding. Still, he says, the challenges are not insurmountable. He offers comprehensive, viable new strategies for dealing with environmental threats around the world.The author explains why current approaches to critical global environmental problemsclimate change, biodiversity loss, deterioration of marine environments, deforestation, water shortages, and othersdon’t work. He offers intriguing insights into why we have been able to address domestic environmental threats with some success while largely failing at the international level. Setting forth eight specific steps to a sustainable future, Speth convincingly argues that dramatically different government and citizen action are now urgent. If ever a book could be described as essential,” this is it.",
        "Category": " Science , Environmental Science",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Financial Accounting: Tools for Business Decision Making with Annual Report, 2nd Edition",
        "Authors": "By Kimmel, Paul D., Weygandt, Jerry J., and Kieso, Donald E.",
        "Description": "This exciting, practical introduction arms readers with a practical set of tools, and the confidence to use those tools effectively in making business decisions. It begins with a macro view of accounting information by presenting real financial statements. The authors clearly establish how a financial statement communicates the financing, operating, and investing activities of a business.",
        "Category": " Business & Economics , Accounting , Financial",
        "Publisher": "Wiley",
        "Price Starting With ($)": "8.98",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Mr. Food's Old World Cooking Made Easy (The Mr. Food Series)",
        "Authors": "By Ginsburg, Art",
        "Description": "TV's Mr. Food offers a fun collection of simplified recipes from Europe, including such beloved family favorites as Mediterranean Potatoes, Chicken Cordon Bleu, Polish Pierogi, and Greek Pasta Casserole. 100,000 first printing. Tour.",
        "Category": " Cooking , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "To Open Minds: Chinese Clues to the Dilemma of Contemporary Education",
        "Authors": "By Gardner, Howard",
        "Description": "In this unique attempt to address the dilemma in contemporary education, the noted cognitive scientist weaves the lessons garnered from three vantage points: his own traditional education as an American child, his years of research on creativity at Harvard, and what he saw in modern Chinese classrooms—into a program that draws on the best of both modes, traditional and progressive.",
        "Category": " Education , History",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Power Plays: Win or Lose--How History's Great Political Leaders Play the Game",
        "Authors": "By Morris, Dick",
        "Description": "Dick Morris is the frankest and most outspoken political analyst in America today. His commentary on the Clinton White House, the 2000 election, and the rise of George W. Bush has been marked by the sharpeyed political savvy only an insider can bring to bear.Now, in Power Plays, Morris provides a revealing context for the machinations of contemporary politics. Casting an eye across the annals of history, Morris investigates 20 of the most dramatic political moves of all time -- from the wildly effective to the disastrous. From Abraham Lincoln splitting the opposition over slavery, to Winston Churchill's emergence from obscurity to lead Britain through WWII; from Ronald Reagan and his conservative doctrine taking over the country, to George W. Bush co-opting Democratic issues under the banner of \"compassionate conservatism\" -- Morris illuminates these and many other gambits through his uniquely insightful perspective. Equally compelling on successes and failures of the past-including the real reason A] Gore lost in 2000.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Treasury of Christmas Quilting",
        "Authors": "By Sandra L. Hatch",
        "Description": "",
        "Category": "",
        "Publisher": "House Of White Birches",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Beyond Machiavelli : Tools for Coping With Conflict",
        "Authors": "By Fisher, Roger, Kopelman, Elizabeth, Schneider, Andrea Kupfer, and Borgwardt, Elizabeth",
        "Description": "Conflict is a growth industry, as a glance at the daily paper or the nightly news tells us. Trade wars, global warming, ethnic strife, refugee crises--as the world draws closer together on a thousand fronts, trouble erupts, clashes occur, and new problems arise. What's wrong, and what can be done about it? This cogent book offers a clear approach for dealing with conflicting interests of any kind.Roger Fisher, the world-renowned master of negotiation, with two of his leading colleagues--Elizabeth Kopelman and Andrea Kupfer Schneider--provides a step-by-step process for dealing with the persistent and complex disputes that mark our changing, often dangerous world. Instead of simply asking why things work--or don't--the authors ask: how can we affect the way things work? They break conflicts into manageable components and advance a process for problemsolving. Arguing that we need to move beyond oneshot \"solutions\" toward a constructive way of dealing with differences, they lay out tools for conflict analysis and practical applications for those tools in the international arena.The authors also show that tactics which successfully influence an adversary are equally applicable to the task of persuading an employer, a community official, or a business associate. Originally drafted as a handbook for the diplomats and senior officials advised by Fisher and his colleagues, this succinct, lucid, and effective book is the primer about the new paradigm in conflict management.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "A Year Full of Flowers: Fresh Ideas to Bring Flowers Into Your Life Everyday",
        "Authors": "By Niles, Bo, McCann, Jim, and Mulligan, Julie Mccann",
        "Description": "Let Jim McCann and Julie McCann-Mulligan - the creative team from the nation's #1 distributor of fresh flowers at 1-800-Flowers - show you fabulous, innovative ways to add nature's beauty to your home. Flower arranging has never been this easy-or this much fun!A sunny, fresh bouquet of daffodils enchants with the promise of spring. A sprig of tiny blush pink roses tucked into a silver bud vase makes a quiet statement of love and romance. Throughout the year, nothing speaks to the beauty of life's everyday joys and special occasions like flowers. With the inspiration of this gorgeous full-color book from the nation's leading source of fresh-cut and seasonal flowers, anyone can learn how to have fun with flowers in novel and delightful ways. Here you will find: - Flower arranging basics-equipment you need to get started; tips on cleaning, cutting, and conditioning stems; guidance on design principles of color and texture, balance and proportion- A glorious celebration of the seasons-with such choices as dogwood, tulips, and lilacs in spring; zinnias, sweet peas, and peonies in summer; sunflowers, chrysanthemums, and decorative gourds in autumn; poinsettias, holly, evergreen boughs, and pine cones in winter - Dozens of original presentations, both elegant and whimsical-from a fresh vegetable vase made of beautiful green asparagus to a stylish place setting and napkin ring of lemon leaves and fragrant seeded eucalyptusWith step-by-step instructions and sidebars sprinkled throughout providing insider secrets, shortcuts, creative solutions to commonly asked questions, and some advanced techniques, A Year Full of Flowers will turn any flower lover into an inventive flower arranger.",
        "Category": " Crafts & Hobbies , Flower Arranging",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "How to Do Just About Anything With Your Digital Photos",
        "Authors": "By Davis, Graham",
        "Description": "More than four hundred photographs and illustrations highlight a complete guide to working with digital photographs, offering step-by-step instructions on how to enhance, organize, share, store, and show off one's digital photographs; how to use image manipulation software; how to create a digital scrapbook; and more. 10,000 first printing.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Commit to Quality",
        "Authors": "By Townsend, Patrick L. and Gebhardt, Joan E.",
        "Description": "An exhaustive look at the quality team process, this book deals exclusively with implementing a quality program in a service business. Discusses implementation, development, value analysis, and the differences between quality team and quality circle concepts. Examines in detail the successful quality program used at the Paul Revere Insurance Companies, explaining both how and why the program worked.",
        "Category": " Business & Economics , Quality Control",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "How to Talk So People Will Listen",
        "Authors": "By Brown, Stephen W.",
        "Description": "A step-by-step, practical explanation of how to talk  so people listen, whether in church, with family, at work, or with friends.",
        "Category": " Language Arts & Disciplines , Communication Studies",
        "Publisher": "Baker Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "I Keep Falling in Love With You: A Blue Mountain Arts Collection",
        "Authors": "By Schutz, Susan Polis",
        "Description": "Poems and selected writings by a variety of authors express their feelings toward their loved ones",
        "Category": " Family & Relationships , Reference",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Arms and the Man (Dover Thrift Editions)",
        "Authors": "By Shaw, Bernard",
        "Description": "In the opening scene of Arms and the Man, which establishes the play's embattled Balkan setting, young Raina learns of her suitor's heroic exploits in combat. She rhapsodizes that it is \"a glorious world for women who can see its glory and men who can act its romance!\" Soon, however, such romantic falsifications of love and warfare are brilliantly and at times hilariously unmasked in a comedy that reveals George Bernard Shaw at his best as an acute social observer and witty provocateur. First produced on the London stage in 1894, Arms and the Man continues to be among the most performed of Shaw’s plays around the world. The play is reprinted in its entirety here from an authoritative British edition, and is complete with Shaw's stimulating preface to Volume II of Plays: Pleasant and Unpleasant.",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "The festivals in Halachah: An analysis of the development of the festival laws = [ha-Moʻadim ba-halakah] (ArtScroll Judaica classics)",
        "Authors": "By Zevin, Shelomoh Yosef",
        "Description": "",
        "Category": "",
        "Publisher": "Hillel Press",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Eleanor Roosevelt: A Life of Discovery (Clarion Nonfiction)",
        "Authors": "By Freedman, Russell",
        "Description": "The intriguing story of Eleanor Roosevelt traces the life of the former First Lady from her early childhood through the tumultuous years in the White House to her active role in the founding of the United Nations after World War II.  A Newberry Honor Book.",
        "Category": " Young Adult Nonfiction , Biography & Autobiography , Political",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Management: Tasks, Responsibilities, Practices (Harper & Row management library)",
        "Authors": "By Drucker, Peter Ferdinand",
        "Description": "An analysis of managerial performance, skills, organization, and strategies based primarily on the author's experience as a consultant for American businesses",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Second Tree: Stem Cells, Clones, Chimeras, and Quests for Immortality",
        "Authors": "By Dewar, Elaine",
        "Description": "In the past century and a half, the evolution of biology has outstripped that of any of its subjects. Since Darwin’s monumentally influential but rudimentary discoveries, biologists have advanced their knowledge of genetics and genomics with such astonishing speed as to be able not just to understand life processes but also to control them. While expanding our therapeutic and reproductive capabilities, these innovations also serve to obscure the very notion of life and its sanctity. In The Second Tree, award-winning journalist Elaine Dewar seriously reexamines our identity, rights, and responsibilities in a world where scientists can invent new creatures at their whim. She also turns her journalistic eye to the culture of acquisitiveness and secrecy at the highest levels of biological research, revealing the scientific community as one in which greed has replaced intellectual curiosity as the primary motivation of advancement, and in which the race for near-omnipotence is veiled by a supposed desire to do good. This is a powerful and fascinating book about an elite group of researchers who see mortality itself as just another disorder that they intend to cure—and the moral ramifications of their work.",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Carroll & Graf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "SEEDS OF CHANGE: Five Hundred Years Since Columbus",
        "Authors": "By Viola, Herman J. (EDT) and Margolis, Carolyn (EDT)",
        "Description": "Describes the exchanges of animal, agricultural, and cultural products between the Old World and the New World during the five hundred years since Columbus's expeditions, assessing the damage and benefits to populations on both sides of the Atlantic.",
        "Category": "",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Direct Social Work Practice: Theory and Skills",
        "Authors": "By Larsen, Jo Ann and Hepworth, Dean H.",
        "Description": "By delineating discrete, practical skills and providing both skill-development exercises and modeled responses adapted from actual clinical situations, Hepworth and Larsen prepare students effectively for delivering social work services to individuals, couples, families, and other groups. Written from an eclectic perspective, the authors integrate knowledge and skills from diverse practice models within an ecological systems framework, emphasizing those models that are empirically grounded and focusing on the multiple roles involved in both generalist and direct practice.",
        "Category": " Social Science , Social Work",
        "Publisher": "Brooks Cole",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "The Art of Collage",
        "Authors": "By Marah Johnson, Pam Lambie, Tracy Niehues",
        "Description": "",
        "Category": "",
        "Publisher": "Pinecone Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Elements of Crisis Intervention: Crises and How to Respond to Them",
        "Authors": "By Greenstone, James L. and Leviton, Sharon C.",
        "Description": "Brief, handy, and affordable, this primer for crisis workers distills the practice of crisis intervention into its basic elements. Invaluable as a tool for easy reference, this handbook offers straightforward guidelines appropriate for experienced professional and the novice helper alike. The authors emphasize the how to of crisis intervention and offer techniques for a wide variety of crisis situations, including specific guidelines for specialists within the field, such as police, hot line personnel, those who give disaster aid, and many others. The authors cover not only the usual crisis situations (such as suicide prevention, counseling after a disaster, etc.), they also point out that during the course of therapy, a client may enter a crisis situation and consequently, therapists/counselors need special skills.",
        "Category": " Education , Counseling , Crisis Management",
        "Publisher": "Brooks Cole",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Welcome Home",
        "Authors": "By Barnes, Emilie and Buchanan, Anne Christian",
        "Description": "",
        "Category": " House & Home , Decorating",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Beads (Keepsake Crafts)",
        "Authors": "By Moody, Jo",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Feminist Chronicles: 1953-1993",
        "Authors": "By Carabillo, Toni, Meuli, Judith, and Csida, June Bundy",
        "Description": "Published by Women's Graphics, 1126 Hi Point Street, Los Angeles, CA 90035. A chronology of the feminist movement over 40 years. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Social Science , General",
        "Publisher": "Womens Graphics",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Do-It-Yourself Advertising and Promotion: How to Produce Great Ads, Brochures, Catalogs, Direct Mail, Web Sites, and More! (Wiley Small Business Edition)",
        "Authors": "By Hahn, Fred E. and Mangun, Kenneth G.",
        "Description": "",
        "Category": " Business & Economics , Small Business",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The ABCs of Bridge: Clear, Up-to-Date Instruction on Standard Bidding, Play and Defense for Beginners and Those Who Want to Take a Fresh Look at the World's Most Popular Ca",
        "Authors": "By Root, William S. and Magnus, Patricia L.",
        "Description": "William S. Root, winner of many national bridge championships, premier bridge teacher, author of classic bridge books, and recently elected to the Bridge Hall of Fame, is one of America's foremost bridge personalities.         As a player, Bill Root has won all three of the most important American trophies (the Vanderbilt, the Spingold, and the Reisinger) a total of thirteen times. He has represented the United States in the Bridge Olympiad; in the Bermuda Bowl; and on exhibition tours to South Africa, Australia, and New Zealand. He is rated a World Master by the World Bridge Federation.        As a bridge teacher, Bill is considered to be one of the best of all time and has helped tens of thousands to enjoy the world's most popular card game. He has been the director for the National Intercollegiate Bridge Tournament and has served as Card Games Authority for the Association of American Playing Card Manufacturers, making him the modern-day Hoyle for the 120 million card players in America.         His many best-selling bridge books include Commonsense Bidding, How to Play a Bridge Hand, and How to Defend a Bridge Hand (all of which won the Book of the Year title awarded by the American Bridge Teachers' Association.) He also coauthored the popular Modern Bridge Conventions with Richard Pavlicek.",
        "Category": " Games & Activities , Card Games , Bridge",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Honest to God? Becoming an Authentic Christian",
        "Authors": "By Hybels, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Patiently Alice",
        "Authors": "By Naylor, Phyllis Reynolds",
        "Description": "Now that she's finished freshman year of high school and survived her first breakup, Alice is pretty sure that she's finally got a handle on life. Dad and Sylvia are going to live happily ever after, Pamela can always be counted on to do something outrageous, Lester will always be there when she needs him, and Alice is way over Patrick. But when she heads off to be a camp counselor for three weeks with Elizabeth, Pamela, and Gwen, Alice is shocked to come home and find that everything has changed -- and not necessarily for the better! Patrick surprises Alice by turning to her for help, Pamela's mother (who ran away with the NordicTrack instructor) is contemplating coming home, Lester's been offered a deal he can't refuse, and what's worse, Dad and Sylvia's happy future seems to have encountered some unforeseen complications. Finally, Elizabeth, who once felt that kissing was too much, goes further with a boy than any of them have yet! As Alice tries to cope with her changing world, she learns that life is never totally what you expect it to be and that even people you've known your entire life can still sometimes surprise you. Phyllis Reynolds Naylor does it again, proving that she understands what real girls think and feel, with the newest book in the beloved Alice series.",
        "Category": " Young Adult Fiction , Family , Parents",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Too Hot to Handle (Matt Christopher Sports Classics)",
        "Authors": "By Christopher, Matt and Wassink, Wendy (ILT)",
        "Description": "A young baseball player has trouble living up to his family's reputation on a baseball diamond.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Northern Borders",
        "Authors": "By Mosher, Howard Frank",
        "Description": "The Wall Street Journal called Howard Frank Mosher \"a writer of power and originality\"; the Boston Herald called his writings \"lovingly forged, understated, and laden with images that surprise and haunt.\" In Northern Borders, the author of A Stranger in the Kingdom and Where the Rivers Flow North returns with a novel full of the warmth, wisdom, and wry humor that have won him a devoted following among readers, writers, and critics alike.",
        "Category": " Fiction , Literary",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "How a Book Is Made (Reading Rainbow Book)",
        "Authors": "By Aliki",
        "Description": "Who made this book?(We all did!)Author-Artist (Illustrator)EditorPublisherDesignerCopyeditor-ProofreaderProduction DirectorColor SeparatorPrinterPublicity and Promotion DirectorSalesperson",
        "Category": " Juvenile Nonfiction , Art , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "To Engineer Is Human: The Role of Failure in Successful Design",
        "Authors": "By Petroski, Henry",
        "Description": "How did a simple design error cause one of the great disasters of the 1980s - the collapse of the walkways at the Kansas City Hyatt Regency Hotel? What made the graceful and innovative Tacoma Narrows Bridge twist apart in a mild wind in 1940? How did an oversized waterlily inspire the magnificent Crystal Palace, the crowning achievement of Victorian architecture and engineering? These are some of the failures and successes that Henry Petroski, author of the acclaimed \"The Pencil,\" examines in this engaging, wonderfully literate book. More than a series of fascinating case studies, \"To Engineer is Human\" is a work that looks at our deepest notions of progress and perfection, tracing the fine connection between the quantifiable realm of science and the chaotic realities of everyday life.",
        "Category": " Technology & Engineering , Civil , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Women in the World: An International Atlas",
        "Authors": "By Seager, Joni and Olson, Ann",
        "Description": "Maps and charts provide information on the status of women around the world",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "The Head Men (The Destroyer, No. 31)",
        "Authors": "By Warren Murphy, Richard Sapir",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Alexander Hamilton: A Life",
        "Authors": "By Randall, Willard Sterne",
        "Description": "From his less than auspicious start in 1755 on the Caribbean Island of Nevis to his untimely death in a duel with his old enemy Aaron Burr in 1804, Alexander Hamilton, despite his short life, left a huge legacy. Orphaned at thirteen and apprenticed in a counting house, Hamilton learned principles of business that helped him create the American financial system and invent the modern corporation. But first the staunch, intrepid Hamilton served in the American Revolution, acting as General Washington’s spymaster. Forging a successful legal career, Hamilton coauthored the Federalist Papers and plunged into politics. Irresistibly attractive, he was a man of many gifts, but he could be arrogant and at times a poor judge of character. In this meticulously researched, illuminating, and lively account, Willard Sterne Randall explores Hamilton’s life—his illegitimate birth, little-known military activities, political and diplomatic intrigues, and scandalous affairs—and its indelible impact on modern America.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Harper Perennial Modern Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2014"
        }
    },
    {
        "Title": "The Arthritis Foundation's Tips for Good Living With Arthritis",
        "Authors": "By Arthritis Foundation (EDT)",
        "Description": "",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The European Challenge (American Indians)",
        "Authors": "By Time-Life Books",
        "Description": "Looks at the impact of encounters with white settlers on the Indians in each region of North America",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Berlitz Japanese Phrase Book & Dictionary",
        "Authors": "By Berlitz Guides",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "Berlitz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Right Words At the Right Time",
        "Authors": "By Thomas, Marlo (EDT)",
        "Description": "For everyone who needs a hero or loves a good story, here is an inspiring collection of personal revelations from more than 100 remarkable men and women who share a moment when words changed their lives.Award-winning actress and bestselling author Marlo Thomas is joined by such luminaries as Muhammad Ali, Tom Brokaw, Cal Ripken Jr., Steven Spielberg, Venus Williams, Rudy Giuliani, Toni Morrison, Jack Nicholson, Mel Brooks, Laura Bush, Billy Crystal, Tom Wolfe and Katie Couric, who each tell a story of a crucial turning point in their lives brought about by the right words at the right time. These first-person accounts of challenges and victories can provide guidance to all of us as we come to life's crossroads.Al Pacino and Gwyneth Paltrow were instructed by words they heard during a crisis.  Billy Crystal and Chris Rock used their humor to guide them.  Ruth Bader Ginsburg received advice from her mother-in-law on her wedding day that continues to help her on the Supreme Court. These original stories encompass life's struggles and adventures and demonstrate how people we admire found hope and inspiration through words delivered by family or friends, heard in a movie or play, sung on the radio, told in a joke or even drawn in a cartoon.The Right Words at the Right Time gathers the wit and wisdom of more than 100 innovators, thinkers and cultural icons and puts them into one collectible book.",
        "Category": " Philosophy , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "When God Whispers Your Name",
        "Authors": "By Lucado, Max",
        "Description": "Are you ready to hope again? Are you ready to let go of doubt and sorrow? Just listen carefully. God is whispering your name.Somewhere, between the pages of this book and the pages of your heart, God is speaking. And He is calling you by name.Maybe that's hard to believe. Maybe you just can't imagine that the One who made it all thinks of you that personally -- that He keeps your name on His heart and lips.But it's true. In the Bible and in the circumstances of your life, He whispers your name lovingly. Tenderly. Patiently but persistently. Let these stories remind you of the God who knows your name.Some of the stories are from the Bible. Some are drawn from everyday life. Most are about people who are lost ... or weary ... or discouraged -- just like you may be. If you let them, they will tell the story of your life. And the story of a God who speaks into your situation.So listen closely as you turn these pages. Listen for the Father's gentle whisper that can erase your doubt, your sorrow, your weariness, your despair.It really is your name that you hear, and the Voice that calls is more loving that your ever dared dream. Listen. And learn to hope again.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Rebel With A Cause",
        "Authors": "By Graham, Franklin",
        "Description": "In his autobiography, Franklin Graham tells his story of how God has taken his life and turned it into His Glory. Elizabeth Dole says, \"Franklin has provided a very thoughtful and provocative account of how a young man develops and matures in his faith as the son of one of the world's most respected and admired spiritual leaders.\"",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Rat Run",
        "Authors": "By Seymour, Gerald",
        "Description": "By the author who \"isn't just abreast of the headlines, [but] ahead of them\" (The Washington Post), this is a novel at once international and personal --and altogether riveting. Malachy Kitchen is an intelligence officer in Iraq. accused of cowardice, he becomes a recluse in a drug-infested housing project back home. But the mugging of an elderly widow draws him into the fight --his target is the network of substance dealers, and at their head is Ricky Capel. untouchable up to now, Capel will have to confront an enemy more driven than any he has so far outwitted.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "The Overlook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Clues to American Dress (Clues to American Arts)",
        "Authors": "By Hartley, E. F. and Sofian, Jonel Becker (ILT)",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Starrhill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Meet Kaya, Book 1",
        "Authors": "By Shaw, Janet Beeler, Farnsworth, Bill (ILT), and McAliley, Susan (ILT)",
        "Description": "In 1764, when Kaya and her family reunite with other Nez Perce Indians to fish for the red salmon, she learns that bragging, even about her swift horse, can lead to trouble. Simultaneous.",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "American Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Addy Learns A Lesson (American Girl Collection)",
        "Authors": "By Porter, Connie and Rosales, Melodye (ILT)",
        "Description": "After their escape from North Carolina to Philadelphia in the summer of 1864, Addy and her mother begin their new life as free people as her mother gets a paying job and Addy goes to school and learns a lesson in true friendship.",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Pleasant Company",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "How to Study Your Bible",
        "Authors": "By Arthur, Kay",
        "Description": "",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Geography: Realms, Regions and Concepts",
        "Authors": "By De Blij, Harm J. and Muller, Peter O.",
        "Description": "Physical geography is presented more consistently from chapter to chapter with major revisions to several chapters.* A foldout map of the world in 1900 is included so that comparisons can be made from the beginning to the end of the 20th century.* Website highlights approximately 13 Virtual Field Trips which provide the opportunity for readers to travel (virtually) to other areas of the world, while also developing analytical skills.",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Wiley",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Joan Baez Songbook",
        "Authors": "By Christa Landon, Jack Lothrop Maynard Solomon~Eric",
        "Description": "",
        "Category": "",
        "Publisher": "Ryerson Music",
        "Price Starting With ($)": "48.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The Bird Feeder Book: Attracting, Identifying, Understanding Feeder Birds",
        "Authors": "By Stokes, Donald and Stokes, Lillian",
        "Description": "Copiously illustrated with maps, line drawings, and full-color photographs, this large format paperback book contains the essential information that backyard nature enthusiasts want and need -- to select feeders and understand the basics of birdfeeding.",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Grace for the Moment: Inspirational Thoughts for Each Day of the Year",
        "Authors": "By Gibbs, Terri A.",
        "Description": "For such a small book, Grace for the Moment© has had a major impact on countless lives. With more than 2,500,000 copies sold, this devotional continues to touch lives as it emphasizes the help and hope of God in everyday moments. Each daily reading features devotional writings from Max Lucado's numerous bestsellers as well as a Scripture verse selected especially for that day's reading. This new classic is available in hardcover as well as in both green and burgundy eurobond leather.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "8.9",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Image Formation and Psychotherapy (Image Formation & Psychotherap CL)",
        "Authors": "By Horowitz, Mardi Jon",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Jason Aronson, Inc.",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "Woman in the Mists: The Story of Dian Fossey and the Mountain Gorillas of Africa",
        "Authors": "By Mowat, Farley",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Guts",
        "Authors": "By Paulsen, Gary",
        "Description": "Guess what -- Gary Paulsen was being kind to Brian. In Guts, Gary tells the real stories behind the Brian books, the stories of the adventures that inspired him to write Brian Robeson's story: working as an emergency volunteer; the death that inspired the pilot's death in Hatchet; plane crashes he has seen and near-misses of his own. He describes how he made his own bows and arrows, and takes readers on his first hunting trips, showing the wonder and solace of nature along with his hilarious mishaps and mistakes. He shares special memories, such as the night he attracted every mosquito in the county, or how he met the moose with a sense of humor, and the moose who made it personal. There's a handy chapter on \"Eating Eyeballs and Guts or Starving: The Fine Art of Wilderness Nutrition.\" Recipes included. Readers may wonder how Gary Paulsen survived to write all of his books -- well, it took guts.From the Hardcover edition.",
        "Category": " Young Adult Nonfiction , Biography & Autobiography , General",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Pompeii: A Novel",
        "Authors": "By Harris, Robert",
        "Description": "All along the Mediterranean coast, the Roman empire’s richest citizens are relaxing in their luxurious villas, enjoying the last days of summer. The world’s largest navy lies peacefully at anchor in Misenum. The tourists are spending their money in the seaside resorts of Baiae, Herculaneum, and Pompeii.But the carefree lifestyle and gorgeous weather belie an impending cataclysm, and only one man is worried. The young engineer Marcus Attilius Primus has just taken charge of the Aqua Augusta, the enormous aqueduct that brings fresh water to a quarter of a million people in nine towns around the Bay of Naples. His predecessor has disappeared. Springs are failing for the ?rst time in generations. And now there is a crisis on the Augusta’s sixty-mile main line—somewhere to the north of Pompeii, on the slopes of Mount Vesuvius.Attilius—decent, practical, and incorruptible—promises Pliny, the famous scholar who commands the navy, that he can repair the aqueduct before the reservoir runs dry. His plan is to travel to Pompeii and put together an expedition, then head out to the place where he believes the fault lies. But Pompeii proves to be a corrupt and violent town, and Attilius soon discovers that there are powerful forces at work—both natural and man-made—threatening to destroy him.With his trademark elegance and intelligence, Robert Harris, bestselling author of Archangel and Fatherland, re-creates a world on the brink of disaster.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Dead Aim",
        "Authors": "By Johansen, Iris",
        "Description": "The #1 New York Times bestselling author Iris Johansen returns with an electrifying and all-too-plausible thriller that pushes the level of suspense to the maximum and never lets up. From the tense opening scene to the final explosive page, Johansen delivers a knockout novel, as an unlikely pair of allies must expose a team of killers hiding behind an unspeakable act of terror--and risk ending up their next target.She witnesses death through the eye of her camera. Now a relentless killer is focused on her. A celebrated photojournalist, Alex Graham has seen it all--but her latest assignment has forced her across a dangerous line. What happens when a reporter does more than just report? She has recorded some of the most tragic and heartbreaking of catastrophes, everything from natural disasters to infamous acts of terror. Her experiences have left her forever marked with the human side of tragedy. So when a dam breaks in Arapahoe Junction, Colorado, Alex is once more at the site doing more than just snapping pictures--she is in the mud with a shovel digging for survivors. What happens when the reporter becomes the story? Alex finds more than she bargained for. In one terrible instant, she is witness to a conspiracy that will stun a nation. The official story is just a cover-up for a truth so frightening, so unthinkable, anyone who threatens to reveal it must be silenced. Forever. And now that someone is Alex Graham.The first attempt on her life is swift and brutal. Only barely escaping, she finds an ally in an improbable source. Billionaire financier John Logan has his own reasons for protecting Alex, and these reasons alone are likely to get her killed. Using his vast connections and influences, Logan assigns a bodyguard to protect her. Judd Morgan is the best covert commando in the business, and if anyone can keep Alex safe, it’s this quietly dangerous man. The problem is, Alex doesn’t want to be kept safe by Judd, whose checkered past has made him the target of an unseen assassin who dogs his every step.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Dog Is My Co-Pilot: Great Writers on the World's Oldest Friendship",
        "Authors": "By Bark Editors",
        "Description": "Dogs have been our muses, our mentors, and our playful and noble co-pilots. They’ve had a profound influence on us as healers and spiritual guides, and also as co-workers, helping to guide, hunt, herd, search, and rescue. Our bond with dogs is deep and unbreakable, and there’s no better source a reader can turn to for a richer understanding of that complex and wonderful relationship than The Bark. The Bark began as a newsletter in Berkeley, California, that advocated for an off-leash area where dogs could cavort and play. Within a few years it had become a full-fledged, award-winning glossy magazine that published work by some of the best writers in America today. And as it grew, the magazine embraced a much larger canvas: to cover the emerging phenomenon of “dog culture” that has been developing over the past decade, as dogs have moved out of the backyard and into our homes, communities, and, indeed, the very center of our lives. As editor Claudia Kawczynska writes, “The implications of integrating another species into society’s daily fabric go well beyond how we nurture our dogs. It calls for a revamping of the standard etiquette—respecting the concerns and interests of society at large. This new relationship, along with an appreciation for our rich and unbounded future, comprises what we call dog culture. This is what The Bark set out to chronicle.” Dog Is My Co-Pilot is an anthology of essays, short stories, and expert commentaries that explores every aspect of our life with dogs. Fifty percent of the material here has never been published before. The book is divided into four sections: Beginnings explores that first meeting, “the initial murmurings when a dog-human relationship is formed.” Pack investigates the theme of “togetherness” and pays tribute to the dynamic of multiple personalities in the canine-human relationship. Lessons examines what dogs teach us, from love to enlightenment. The final section, Passages, reflects on the themes of true friendship, transformation, and loss. Included are pieces by Lynda Barry, Rick Bass, Maeve Brennan, Margaret Cho, Carolyn Chute, Alice Elliott Dark, Lama Surya Das, Pam Houston, Erica Jong, Tom Junod, Caroline Knapp, Donald McCaig, Nasdijj, Ann Patchett, Michael Paterniti, Charles Siebert, Alexandra Styron, Elizabeth Marshall Thomas, and Alice Walker. In selections that are humorous, poignant, truthful, sometimes surprising, and frequently uplifting, Dog Is My Co-Pilot embraces the full experience of the world’s oldest friendship. For people who love great writing and, yes, great dogs, it’s a book to be both shared and treasured.From the Trade Paperback edition.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Non Campus Mentis: World History According to College Students",
        "Authors": "By Henriksson, Anders",
        "Description": "Mangled Moments of Western Civilization from Term Papers & Blue Book Exams Did You Know:Cesar was assassinated on the Yikes of March when he is reported to have said, \"Me too, Brutus!\"Stalin, Roosevelt, Churchill, and Truman were known as the \"Big Three\"Rasputin was a pheasant by birthJudyism had one big God named YahooWestward expansion ended at Custard's Last StandMarie Curie won the Noel Prize for inventing the radiatorThe Civil Rights movement turned the corner with Martin Luther Junior's famous \"If I Had a Hammer\" speech",
        "Category": " Humor , Form , Essays",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Big Book of New American Humor: The Best of the Past 25 Years",
        "Authors": "By Novak, William and Waldoks, Moshe",
        "Description": "An anthology of the very funniest jokes, stories, scripts, cartoons, and parodies from Americas's top humorists, comedians, cartoonists, and entertainers of the past twenty-five years on every subject from politics to sex",
        "Category": "",
        "Publisher": "Harper, Row & Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Mostly Ghostly",
        "Authors": "By Bradley, John (ILT) and Zorn, Steven",
        "Description": "Abridged versions of classic chillers by Arthur Conan Doyle, Ambrose Bierce, Edith Nesbit, Washington Irving, and others",
        "Category": "",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Ugo Foscolo: Poet of Exile (Princeton Legacy Library)",
        "Authors": "By Cambon, Glauco",
        "Description": "Contemporary with the Romantic generation, peer of Keats, Holderlin, and Goethe, and forerunner of Valéry and Pound, Ugo Foscolo is nevertheless little known outside Italy. In an endeavor to \"discover\" this exemplary European poet for English-speaking readers, and to \"rediscover\" him for Italian readers, Glauco Cambon examines both textually and contextually Foscolo's major works and their inextricable connection with his life, his philosophy, and his aesthetic principles.Originally published in 1980.The Princeton Legacy Library uses the latest print-on-demand technology to again make available previously out-of-print books from the distinguished backlist of Princeton University Press. These editions preserve the original texts of these important books while presenting them in durable paperback and hardcover editions. The goal of the Princeton Legacy Library is to vastly increase access to the rich scholarly heritage found in the thousands of books published by Princeton University Press since its founding in 1905.",
        "Category": " Literary Criticism , European , Italian",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "50.1",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "Power of Rome in the Twentieth Century: The Vatican in the Age of Liberal Democracies, 1870-1922",
        "Authors": "By Rhodes, Anthony",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Olympic Marketing Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "The New Paint Effects Project Book: Learn 100 Decorative Painting Techniques, with Practical Examples and Step-by-Step Projects to Transform Your Home",
        "Authors": "By Sacha Cohen, Maggie Philo",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Actualizations: You Don't Have to Rehearse to Be Yourself",
        "Authors": "By Emery, Stewart",
        "Description": "Stewart Emery was one of the first people to lead EST training, and one of the founders of Actualizations, a supportive and loving workshop that helps people establish joyful relationships in their lives. The purpose of this book is to provide the groundwork for a complete transformation of its reader’s relationships—into sources of joy, satisfaction, and exhilarating personal growth. The philosophy described here will allow you to deepen not only your connection with others, but your understanding of yourself. Emery’s Actualizations will allow you to live life to its fullest—no reservation, or rehearsal, required!",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1978"
        }
    },
    {
        "Title": "Crash Profits: Make Money When Stocks Sink and Soar!",
        "Authors": "By Weiss, Martin D.",
        "Description": "Smart investing strategies from bestselling author and America's consumer advocate for financial safetyFilled with against-the-grain attitude and seasoned market wisdom, Crash Profits explains not only how to survive, but how to make money before, during, and after a crash. Using real examples fresh from the financial pages, Weiss delineates the full range of risks facing the average American. He shows readers how to see through the lies that Wall Street tells and how to find safer alternatives to stock investing, as well as what to sell, how to sell, and when to sell (and when not to sell). Here's the unvarnished truth about investing today, coupled with the strategies every American can use to turn windfall profits while others are losing their shirts.Martin D. Weiss, PhD (Palm Beach, FL), is Chairman of Weiss Research in Palm Beach, Florida. His previous book, The Ultimate Safe Money Guide (0-471-15202-1), was a Wall Street Journal, BusinessWeek, and New York Times business bestseller",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Precious Moments Put on a Happy Face! (Little Golden Book)",
        "Authors": "By Debbie Wiersma",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Picasso: Creator and Destroyer",
        "Authors": "By Huffington, Arianna",
        "Description": "Through numerous interviews with Picasso's intimates, the author penetrates the barriers of the Picasso myth to reveal the struggle between his power to create and his passion to destroy",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "The Big Over Easy: A Nursery Crime",
        "Authors": "By Fforde, Jasper",
        "Description": "It’s Easter in Reading—a bad time for eggs—and no one can remember the last sunny day. Ovoid D-class nursery celebrity Humpty Stuyvesant Van Dumpty III, minor baronet, ex-convict, and former millionaire philanthropist, is found shattered to death beneath a wall in a shabby area of town. All the evidence points to his ex-wife, who has conveniently shot herself.  But Detective Inspector Jack Spratt and his assistant Mary Mary remain unconvinced, a sentiment not shared with their superiors at the Reading Police Department, who are still smarting over their failure to convict the Three Pigs of murdering Mr. Wolff. Before long Jack and Mary find themselves grappling with a sinister plot involving cross-border money laundering, bullion smuggling, problems with beanstalks, titans seeking asylum, and the cut and thrust world of international chiropody.  And on top of all that, the JellyMan is coming to town . . .",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Circle of Stones: Woman's Journey to Herself (Circle of Stone Series)",
        "Authors": "By Duerk, Judith",
        "Description": "",
        "Category": " Body, Mind & Spirit , Parapsychology , General",
        "Publisher": "Innisfree Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Simon & Schuster's Guide to Orchids (Nature Guide Series)",
        "Authors": "By Schuler, Stanley, Fanfani, Alberto, and Rossi, Walter",
        "Description": "Brimming with intriguing and practical details and illustrated with 250 beautiful color photos, Simon & Schuster's Guide to Orchids provides everything the enthusiast needs to know about this most colorful and elegant blossom.An informative introduction gives such useful information as morphology of the flower, ecology, classification, and cultivation. The individual entries that follow describe over 160 cultivated species and offer visual symbols for the temperature and light necessary for optimum growth, as well as whether a particular species has a scent. Simon & Schuster's Guide to Orchids is a spectacular and authoritative reference to this exotic and fascinating flower.",
        "Category": " Nature , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Country Life Book of the Royal Wedding",
        "Authors": "By Leete-Hodge, Lornie",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn Publ Group Ltd",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Baby Animals on the Farm (Sesame Street)",
        "Authors": "By Alexander, Liza",
        "Description": "As Grover searches all over the farm for a missing kitten, he meets many animals with their new babies.",
        "Category": "",
        "Publisher": "Western Pub. Co., in conjunction with Children's Television Workshop",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "I Can Do It Myself: Featuring Jim Henson's Sesame Street Muppets",
        "Authors": "By Emily Perl Kingsley",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. Co./Children's Televison Workshop",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Amadeus (Penguin Plays)",
        "Authors": "By Shaffer, Peter",
        "Description": "This play takes the probable legend that Mozart was poisoned by a rival composer, Antonio Salieri, a relatively moral and highly-regarded court musician and teacher who could not live with the fact that God had given him the power to appreciate music but had chosen Mozart as his instrument.",
        "Category": " Drama , General",
        "Publisher": "Penguin Uk",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Men's Health Guide To Peak Conditioning",
        "Authors": "By Men's Health Books (COR), Laliberte, Richard, and George, Stephen C.",
        "Description": "* Hundreds of exercises for head-to-toe strength and energy* Conditioning programs for more than 40 lifestyles and interests* Buyers' guides for home equipment, health clubs, workout gear* Easy ways to integrate workouts into your busy day* Sleep, nutrition and time-management tips for peak powerAchieve your perfect body!Finally-- a workout book for your body, your lifestyle, your goals. The Men's Health Guide to Peak Conditioning is the first exercise book to let you put together a customized workout for exactly your needs. Play golf? Want a flatter belly? Got arthritis? Live in the country? Just turn 40? Rebounding from the flu? Have a job that leaves you without time or energy for exercise? No problem-- The Men's Health Guide to Peak Conditioning has workouts for each of these cases and dozens of others.We start you with seven weight lifts, seven stretches and an aerobic program that cover the essential needs of most any man today. From there we show you how to customize a workout for:* Shaping your body (page 126)* Bicycling stronger, longer (page 176)* Living in the city (page 257) or country (page 261)* Ridding fat (page 134)* Improving your golf game (page 210)* Bolstering your immune system (page 304)* Exercising while traveling (page 151)* Squeezing in exercise at lunch (page 143)* Improving your sexual performance (page 169)And dozens more goals, lifestyles and preferences!But The Men's Health Guide to Peak Conditioning doesn't just detail perfect workout routines. You'll also discover the definitive guide to integrating exercise into your busy life. Inside you'll find:* How to carve out all the time you need for exercise (page 16)* Surprising eating (page 9), sleeping (page 13) and attitude tips (page 19) for maximum qlfitness* Buyers' guides to gear (page 312), gyms (page 317), shoes (page 320)* Proper-technique tips for stair-climbers, treadmills, stationary bicycles and all the most popular indoor aerobic equipment (page 40)* How to give and get a perfect massage (page 299)Written in the funny, conversational tine that has made Men's Health magazine the definitive voice of men today, and featuring more than 400 photos, The Men's Health Guide to Peak Conditioning is the ultimate tool for achieving health, strength and vitality.",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Echoes from the Summit: Writings and Photographs (The Wilderness Experience)",
        "Authors": "By Schullery, Paul (EDT)",
        "Description": "Echoes from the Summit is an extraordinary collection of essays that detail our intimate encounters with that most mystical outpost of alpine wilderness, the summit. This is the place where eagles and snows fall in echoing silence; where ripping winds roar and tear and bite the soul; where awe and admiration are regularly inspired. Noted naturalists and wilderness seekers recount their tales of stamina, courage, and wonder in a place of brutal and unforgiving beauty, a place of solitude and discovery, a place of secrets.These outstanding essays, selected by editor Paul Schullery, take the reader into some of America's most breathtaking mountain wilderness areas. Richly illustrated with fifty-three spectacular full-color photographs by America's top nature photographers, Echoes from the Summit is a satisfying trek for every reader eager to see the view from the top.",
        "Category": " Science , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Stop Heartburn: Simple Ways to Heal Heartburn and Acid Reflux",
        "Authors": "By Adamec, Christine A. and Minocha, Anil",
        "Description": "Relief at Last for the Millions of Chronic Heartburn SufferersWritten by an internationally recognized expert on digestive diseases, this much-needed book brings relief to the tens of millions who suffer from the pain of severe heartburn almost daily. If you find yourself dependent on antacids, losing sleep, missing work, or canceling plans because of heartburn discomfort, you may be among those who struggle with gastroesophageal reflux disorder, or GERD. The good news is that your condition is treatable----especially in its early stages. Drawing from his extensive experience diagnosing and treating patients, as well as the latest research from around the globe, Dr. Anil Minocha explains the causes of heartburn----and the potentially serious consequences of leaving it untreated. In addition to providing an overview of the problem, Dr. Minocha offers invaluable information on:* The latest treatment options-from nutrition and simple lifestyle changes to drugs, surgery, and alternative remedies* How your diet and weight may be affecting your GERD* The relationship between stress and heartburn* Dealing with GERD during pregnancy, and in infants, children, and the elderly\"\"An in-depth analysis of how to heal heartburn and acid reflux, a problem that afflicts humans across the lifespan, from infancy to old age. . . . A valuable home reference.\"\"-Elizabeth D. Tate, F.N.P., M.N., coauthor of Unforgettable Faces: Through the Eyes of a Nurse Practitioner\"\"Priceless and practical. . . . Easy to read. . . . A must-buy book for all heartburn sufferers.\"\"-Joel E. Richter, M.D., F.A.C.P., F.A.C.G., Chairman, Department of Gastroenterology, The Cleveland Clinic Foundation",
        "Category": " Medical , Gastroenterology",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Enjoyment of Music: An Introduction to Perceptive Listening",
        "Authors": "By Machlis, Joseph and Forney, Kristine",
        "Description": "With nearly three million copies sold over eight editions, The Enjoyment of Music is the best-selling music appreciation text of all time. Spanning the Middle Ages through the twenty-first century, the text offers a thorough introduction to the elements of music, a broad overview of the history of musical styles, and fascinating cultural contexts and perspectives. The Ninth Edition of this classic text features a stunning new design, exciting new repertory, and an unmatched ancillary and media package.",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Saint Joan: A Chronicle Play in Six Scenes and an Epilogue, Definitive Text",
        "Authors": "By Bernard Shaw",
        "Description": "With Saint Joan, Shaw reached the height of his fame as a dramatist. In this play he distilled many of the ideas he had been trying to express in earlier works on the sublects of politics, religion and creative evolution. Fascinated by the story of Joan of Arc, but unhappy with the way she had traditionally been depicted, Shaw wanted to remove 'the whitewash which disfigures her beyond recognition'. He presents a realistic Joan: proud, intolerant, naive, foolhardy, always brave - a rebel who challenged the conventions and values of her day.",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "If Your Adolescent Has an Eating Disorder: An Essential Resource for Parents (Adolescent Mental Health Initiative)",
        "Authors": "By Walsh, B. Timothy and Cameron, V. L.",
        "Description": "This is an authoritative guide to understanding and helping a teenager with anorexia nervosa or bulimia nervosa. It is designed for parents of teens who have recently been diagnosed with an eating disorder, or who are at risk of developing one, and for other adults, such as teachers and guidance counselors, who are regularly in contact with at-risk adolescents. The book combines the latest scientific expertise available--including the newest treatments and most up-to-date research findings on eating disorders--with the practical wisdom of parents who have raised teenagers with anorexia or bulimia.  In clear and accessible language, Dr. B. Timothy Walsh and V. L. Cameron explain exactly what eating disorders are and describe their characteristics, as well as signs and symptoms. They outline the right way to go about getting a diagnosis if you suspect your child may have an eating disorder, about when and where to get treatment, and about how to navigate the healthcare system. There is also advice on how to handle everyday life--both at home and at school--once your child is diagnosed, and on how to communicate with your teen. Complete with red flags to look out for and warnings on the dangers of doing nothing, this book will help parents and other adults face and deal effectively with adolescent eating disorders before they become life-threatening.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "A Boomer's Guide to Grandparenting",
        "Authors": "By Zullo, Allan and Zullo, Kathryn",
        "Description": "A Boomer's Guide to Grandparenting welcomes baby boomers to the grandparenting game. The Zullos have tapped fellow boomer grandparents and leaders in the child care and grandparenting fields to share their expertise and help recent grandparents find success and enjoyment in their new relationships with their children and grandchildren.     We are your typical boomer nana and papa,\" say authors Kathryn and Allan Zullo, \"younger, healthier, wealthier, and better educated than our grandparents. We are more active and less formal than our own parents were at our age. We no longer fit the traditional image of our elderly kin.\" That description signals the need for a new kind of grandparenting, a role that The Boomer's Guide to Grandparenting fills to perfection.       The experts and grandparents cited throughout the book tailor their guidance and recommendations to fit the boomer sensibility, covering topics such as:       * Defining your role and image as a grandparent   * Understanding the latest trends in child care   * Achieving harmony with your children and their spouses   * Engaging in high-tech grandparenting   * Coping with stepgrandparenting   * Dealing with grandchildren in nontraditional households   * Caring for great-grandchildren       Filled with expert advice, A Boomer's Guide to Grandparenting provides a smooth transition into grandparenting and sets the stage for successful relationships and experiences for the entire family.",
        "Category": " Humor , Topic , Men, Women & Relationships",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Cat Muses",
        "Authors": "By Miles, Julia H.",
        "Description": "",
        "Category": "",
        "Publisher": "Cattails Publishing",
        "Price Starting With ($)": "12.08",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Art of the Infinite: The Pleasures of Mathematics",
        "Authors": "By Kaplan, Robert and Kaplan, Ellen",
        "Description": "Robert Kaplan's The Nothing That Is: A Natural History of Zero was an international best-seller, translated into eight languages. The Times called it \"elegant, discursive, and littered with quotes and allusions from Aquinas via Gershwin to Woolf\" and The Philadelphia Inquirer praised it as \"absolutely scintillating.\"      In this delightful new book, Robert Kaplan, writing together with his wife Ellen Kaplan, once again takes us on a witty, literate, and accessible tour of the world of mathematics. Where The Nothing That Is looked at math through the lens of zero, The Art of the Infinite takes infinity, in its countless guises, as a touchstone for understanding mathematical thinking. Tracing a path from Pythagoras, whose great Theorem led inexorably to a discovery that his followers tried in vain to keep secret (the existence of irrational numbers); through Descartes and Leibniz; to the brilliant, haunted Georg Cantor, who proved that infinity can come in different sizes, the Kaplans show how the attempt to grasp the ungraspable embodies the essence of mathematics. The Kaplans guide us through the \"Republic of Numbers,\" where we meet both its upstanding citizens and more shadowy dwellers; and we travel across the plane of geometry into the unlikely realm where parallel lines meet. Along the way, deft character studies of great mathematicians (and equally colorful lesser ones) illustrate the opposed yet intertwined modes of mathematical thinking: the intutionist notion that we discover mathematical truth as it exists, and the formalist belief that math is true because we invent consistent rules for it.       \"Less than All,\" wrote William Blake, \"cannot satisfy Man.\" The Art of the Infinite shows us some of the ways that Man has grappled with All, and reveals mathematics as one of the most exhilarating expressions of the human imagination.",
        "Category": " Mathematics , Infinity",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Reunion: A Novel",
        "Authors": "By Lightman, Alan",
        "Description": "Charles is a middle-aged professor at a minor liberal-arts college, a once promising poet, admiring of passion but without passion himself. Without knowing why, he decides to attend his thirtieth college reunion. And there, he magically witnesses a replay of his senior year.Drawn back into his memories, Charles watches his tender and romantic twenty-two-year-old self embark on an all-consuming love affair with a beautiful dancer. As the two young people struggle to find themselves amidst the social and political chaos of the late 1960s, the older Charles recalls contradictory versions of his past, ultimately confronting for the second time a series of devastating events that would forever change his life.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Van Gogh in Saint-Remy and Auvers",
        "Authors": "By Pickvance, Ronald",
        "Description": "",
        "Category": "",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "7.61",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "The Way We Cook: Recipes from the New American Kitchen",
        "Authors": "By Julian, Sheryl, Riven, Julie, and Wise, Karen (PHT)",
        "Description": "For the past twenty years, in their wildly popular newspaper and cooking columns, Sheryl Julian and Julie Riven have been providing hundreds of thousands of cooks with recipes they can depend on. Now, in this long-awaited cookbook which is an essential reference for anyone who wants to get the most out of time in the kitchen, they present 250 of their favorites. From Roast Side of Salmon to Creamy Chocolate Tart, each dish is straightforward, contemporary, and elegant: home cooking at its best. Julian and Riven have an unerring sense of what busy people need: appetite-provoking nibbles that won't set back dinner preparations; easy meals for the time of day when the cook is most exhausted; impressive but relaxed dinners for company; simple side dishes; slow-cooked suppers served straight from the pot; weekend breakfasts that leave plenty of time for reading the paper; desserts anyone can master.It's all here in The Way We Cook: Appetizers: Spicy Pecans * Honey-Roasted Chicken Wings * Marinated Shrimp in White Wine Vinaigrette Salads: Eggless Caesar Salad * Wilted Spinach Salad * Cucumber and Red Onion Salad When You're in a Rush: Ten-Minute Bolognese * Pork Tenderloins with Caramelized Onions * Chicken Roasted on a Bed of Apples Dishes We Make All the Time: Chicken and Corn Chili * Yankee Pot Roast with Caramelized Vegetables * Old-Fashioned Vegetable Soup New Classics: Succotash with Seared Scallops * Chicken Pot Pie Good Enough for Company: Herb-Roasted Flattened Chicken * Ossobuco * Orange-Marinated Turkey Breast Simmering Pots: Spring Garden Stew * Portuguese Chicken Stew Sides: Asparagus Cooked for Two Minutes * Potato Crisps with Fresh Herbs * Casserole-Roasted Fall Vegetables Rise and Dine: Sour Cream Coffee Cake * Leek and Egg Frittata If You Love to Bake: Lemon Pudding Cake * Free-Form Apple Tart * Double-Chocolate Refrigerator Cookies",
        "Category": " Cooking , Regional & Ethnic , American , New England",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Collector's Compass: 20th Century Dinnerware",
        "Authors": "By Collector's Compass (EDT)",
        "Description": "",
        "Category": " Antiques & Collectibles , Kitchenware",
        "Publisher": "Martingale & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "I Am My Mother's Daughter: Making Peace With Mom -- Before It's Too Late",
        "Authors": "By Krasnow, Iris",
        "Description": "Iris Krasnow-mother, daughter, and bestselling journalist-tackles the toughest relationship in the lives of many grown women: the mother-daughter bond. With women&#39;s life expectancy inching up past 80, you may be embroiled with your mother well past the time your own hair turns white. The good news: Living longer means more time to make peace-and this book shows you how. Drawing on her own experience with her colorful 85-year-old mother and the collective wisdom of more than 100 other adult daughters, Krasnow offers a fresh perspective on how to overcome the anger, guilt, and resentment that can destroy a family. The time to repair the bond is now, she reminds us: You can&#39;t kiss and make up at her funeral. The key is to let go of the fantasy mom and embrace the flesh-and-blood woman, with all her flaws.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Passion Of The Ages",
        "Authors": "By White, Ellen Gould Harmon",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Homeward Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Terrifying Tales of the Beaches and Bays",
        "Authors": "By Okonowicz, Ed",
        "Description": "",
        "Category": " Nature , General",
        "Publisher": "Washington Book Distributors",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Message New Testament Psalms and Proverbs in Contemporary Language",
        "Authors": "By Peterson, Eugene H. (EDT)",
        "Description": "The Message Meets You Where You Are.The Message awakens Bible readers from their sleepy routines, renewing their desire to hear God’s voice. Now come and delight in the unexpected passion and personality that fill God’s Word!The Message is a reading Bible translated from the original Greek and Hebrew Scriptures by pastor Eugene Peterson. Thoroughly reviewed and approved by twenty biblical scholars, The Message combines the authority of God’s Word with the cadence and energy of conversational English.What makes The Message the best reading Bible? Discover for yourself!Feel the impact of a Bible translated into conversational EnglishEnjoy reading the one-column design, like books you’re used toRelax with the easy-to-read font size",
        "Category": " Bibles , The Message , New Testament & Portions",
        "Publisher": "Message",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    }
]