[
    {
        "Title": "Legacy of the Puppy: The Ultimate Illustrated Guide",
        "Authors": "By Ueki, Hiroyuki (PHT), Fukuda, Toyofumi (PHT), Nakano, Hiromi, and Imaizumi, Tadaaki (EDT)",
        "Description": "Nipping at the heels of the best-selling Legacy of the Dog, Legacy of the Puppy presents page after page, paw after paw, and ooh after ah of adorable full-color photographs of over 100 breeds in all their puppy splendor. From everybody's favorites to rare varieties, each breed portrait includes in-depth information on breed standards and history, temperament, coat care, special talents, and favorite sports to help prospective owners choose which puppy is the right fit. Legacy of the Puppy also gives extensive advice on training and raising puppies and addresses any health concerns new owners might have. The perfect book for breeders, new puppy parents, or puppy parents-to-be, Legacy of the Puppy is both a solid resource and an utterly charming collection of puppies.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Death March: The Complete Software Developer's Guide to Surviving \"Mission Impossible\" Projects (Yourdon Computing Series)",
        "Authors": "By Yourdon, Edward",
        "Description": "",
        "Category": " Computers , Programming , Object Oriented",
        "Publisher": "Prentice Hall Ptr",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Alton Brown's Gear for Your Kitchen",
        "Authors": "By Brown, Alton",
        "Description": "The popular host of Food Network's Good Eats presents an offbeat look at kitchen gadgets and equipment that explains how to select the best--and simplest tool for the job and offers practical advice on what is needed, what is not, what works, and what does not, along with twenty-five recipes that use the featured tools. 150,000 first printing.",
        "Category": " Cooking , Reference",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Blood and Iron: A Novel of the Promethean Age",
        "Authors": "By Bear, Elizabeth",
        "Description": "She is known as Seeker. Spellbound by the Faerie Queen, she has abducted human children for her mistress’s pleasure for what seems like an eternity, unable to free herself from servitude and reclaim her own humanity.Seeker’s latest prey is a Merlin. Named after the legendary wizard of Camelot, Merlins are not simply those who wield magic––they are magic. Now, with the Prometheus Club’s agents and rivals from Faerie both vying for the favor of this being of limitless magic to tip the balance of power, Seeker must persuade the Merlin to join her cause—or else risk losing something even more precious and more important to her than the fate of humankind.…",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Wraith (Zoe Martinique, Book 1)",
        "Authors": "By Weldon, Phaedra",
        "Description": "Zoe Martinique was just your average, single female, past 25, looking for love and/or exciting job opportunities. Until life handed her the dubious ability to travel outside of her body at will - which she turned into a career, hiring herself out as a literal spook. Industrial espionage, domestic surveillance, you name it - when she's traveling she can see but can't be seen.Then one night things get out of hand while she is out-of-body: Zoe witnesses a murder. What's worse, the killer is also a Traveler - and he most definitely not only sees her, but tries to pursue her.To save herself, Zoe must somehow guide the very handsome detective assigned to the case to the truth without revealing herself. And with the help of her semi-psychic mom, a pair of gay ghosts, and her best friend (a Goth techno witch), she also has to figure out exactly who - and what - the murderer is, before he finds her and puts an end to her traveling - permanently.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Lowfat Cooking For Dummies",
        "Authors": "By Fischer, Lynn",
        "Description": "If a skimpy salad doused with a tasteless dressing is your idea of lowfat dining, hold on to your calorie counter. Lowfat cooking has come a long way. In fact, many of your high-calorie food favorites have an enticing, healthier equivalent in a lowfat version. Think chili. Potato pancakes. Or even cheesecake. It’s true. If done right, bite for bite, lowfat cooking can be as generous in flavor as its high-fat counterpart. And once you (and your body) have begun to sample the benefits of a lowfat menu, chances are you’ll turn lowfat cooking into a permanent lifestyle change.With the help of Lynn Fischer, celebrated host of two TV cooking shows, Lowfat Cooking For Dummies helps you prepare meals worthy of a high-class health spa. In practically no time, you’ll see how simple and fun it is to slenderize your kitchen pantry and get your cooking regimen in gear. From finding hidden fats to reading labels, the book gives you the skinny on:Cholesterol, saturated fats, trans fatty acids—what they are and where they come fromWhat “lowfat,” “fat-free,” and “reduced fat” really meanTips on stocking a lowfat pantry—including what canned and packaged foods to keep (including pretzels, popcorn, chips, and cookies!)What oils, condiments, and flavorings to use—including a table of oils indicating saturated fat content and a comprehensive list of herbs and their usesMeat, poultry, fish, and eggs—tips on finding sources of lowfat red meat, what lean really means, and telling “good” eggs from “bad”Plus Lowfat Cooking For Dummies brings you quickly up to speed on the joys of lowfat cooking—making your transition into a lowfat menu as delicious as it is painless. You’ll reexperience old favorites like French Toast or a BLT or Oatmeal Raisin Cookies and discover how cutting calories in no way impairs taste. And you’ll get a fresh reinvigorating take on traditionally healthy salads, as well as a host of entrees:One-pot Soups and Casseroles—including Chicken Soup with Vegetables, Lentil Soup, Chili, and Pork and Garbanzo Bean StewFish and shellfish—including Cod with Ginger-Orange Sauce, Herbed Mahi Mahi, and Shrimp and Crab GumboMeat and poultry—including Meat Loaf, Sweet and Sour Pork, and Roast ChickenSandwiches—including Chicken Salad, Deviled Ham, Egg Salad, Feta Cheese Hamburgers, and Grilled CheeseThe book is chockfull of hints on how to turn usually high-fat fare like Hollandaise Sauce and White Sauce into something light and tasty. Desserts such as Strawberry Cheesecake and Peach and Blackberry Tart can, at last, be enjoyed as a guilt-free pleasure. Brimming with suggestions for healthy, lowfat eating on every page.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Joe Dimaggio (Baseball Legends)",
        "Authors": "By Appel, Martin",
        "Description": "A biography of the baseball legend who hit safely in fifty-six games during the 1941 season",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Sports & Recreation",
        "Publisher": "Chelsea House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Vitamin A: everyone's basic bodyguard",
        "Authors": "By Rodale Press",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "9.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The First Zoo (3252)",
        "Authors": "By Gambill, Henrietta G.",
        "Description": "",
        "Category": "",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "A Connecticut Yankee in King Arthur's Court (Norton Critical Editions)",
        "Authors": "By Twain, Mark and Ensor, Allison R. (EDT)",
        "Description": "\"Backgrounds and Sources\" includes selections on King Arthur from the Oxford Companion to English Literature; on the total eclipse from The Life and Voyages of Christopher Columbus by Washington Irving; and on the \"king's touch,\" the ascetic saints, and the financing of the Mansion House by W. E. H. Lecky. Selections from Clemens's letters, notebooks, autobiography, and other writings and newspaper reports of his 1886 manuscript reading at Governor's Island show how the novel developed. A section of the Beard illustrations includes material by Beard, Clemens, and Henry Nash Smith. The English edition is discussed by Dennis Welland.Early critical views are by Sylvester Baxter, William Dean Howells, Andrew Lang, Rudyard Kipling, Charles Whibley, Albert Bigelow Paine, John B. Hoben, and anonymous reviewers in the London Daily Telegraph and the Boston Literary World. The later critical essays are by Howard G. Baetzhold, James D. Williams, Kenneth S. Lynn, James M. Cox, Louis J. Budd, Henry Nash Smith, David Ketterer, and Everett Carter.A Selected Bibliography is also included.",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "The Grass Crown",
        "Authors": "By McCullough, Colleen",
        "Description": "The lives of ancient Rome's men--general Gaius Marius and his rival Lucius Cornelius Sulla--unfold amid Republican Rome's struggle in a world of treachery and barbarism",
        "Category": " Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Better Safe Than Sued: Keeping Out of Trouble in Youth Ministry",
        "Authors": "By Crabtree, Jack",
        "Description": "",
        "Category": " Religion , Christian Ministry , Youth",
        "Publisher": "Group Pub Inc",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Deadly Kisses (A Francesca Cahill Novel)",
        "Authors": "By Joyce, Brenda",
        "Description": "Seventh in the author's Deadly romance series is set in New York City, 1902. \"Called to the home of her fiancâe Calder Hart's former mistress late one night, amateur sleuth Francesca Cahill's curiosity is piqued. But upon arrival, she is shocked to find Daisy Jones' bloodied body-- and even more devastated when the evidence points to one suspect: Calder.\"--Cover.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Movie Book of Answers",
        "Authors": "By Bolt, Carol",
        "Description": "Designed to help solve some of life's most vexing problems, a collection of answers to life's most burning questions draws on the words of wisdom from some of Hollywood's most popular films, including The Terminator, Chariots of Fire, and Some Like It Hot. 50,000 first printing.",
        "Category": " Reference , Quotations",
        "Publisher": "HYPERION",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Death Comes for the Fat Man (Dalziel and Pascoe Mysteries)",
        "Authors": "By Hill, Reginald",
        "Description": "There was no sign of life. But not for a second did Pascoe admit the possibility of death. Dalziel was indestructible. Dalziel is, and was, and forever shall be, world without end, amen. Everybody knew that. Therein lay half his power. Chief constables might come and chief constables might go, but Fat Andy went on forever. Caught in the blast of a huge explosion, Detective Superintendent Andy Dalziel lies on a hospital bed, with only a life support system and his indomitable will between him and the Great Beyond. Meanwhile, his colleague, Chief Inspector Peter Pascoe, is determined to find those responsible. Ignoring his own injuries, the advice of his friends, and the pleas of his wife, Pascoe follows a winding trail to the Templars, a mysterious group that believes the only way to fight terrorism is through terror. Where the arm of the law cannot reach, their work begins. Soon Pascoe comes to suspect that they may have support and sympathy in high places, from men ready to accept the death of a policeman or of any other innocent bystander as regrettable but unavoidable collateral damage. From the streets of Manchester to the Yorkshire countryside, Pascoe searches for the truth. And above it all, like a huge zeppelin threatening to break from its moorings, hovers the disembodied spirit of Andy Dalziel.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Mom to Mom: Confessions of a \"Mother Inferior\"",
        "Authors": "By Morgan, Elisa",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan Publ Hse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Mom, My Tummy's Nervous",
        "Authors": "By Roper, Gayle G.",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Celebrating the Inner Beauty of Women",
        "Authors": "By Oke, Janette",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Virginia Women: The First 200 Years (The Foundations of America Series)",
        "Authors": "By Scott, Anne Firor",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Colonial Williamsburg Foundation",
        "Price Starting With ($)": "22.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Road Of Ages",
        "Authors": "By Nathan, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "19.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1935"
        }
    },
    {
        "Title": "The Dead Hour: A Novel",
        "Authors": "By Mina, Denise",
        "Description": "Paddy Meehan thought she'd be farther along in her career as an investigative journalist by now. But three years after breaking a big story, she's still on perpetual night shift, chasing police calls for a story that will promote her out of a twilight existence that makes candy bars and coffee a medical necessity. With her father and brothers unemployed and her family perilously short of money, she needs the work.The domestic dispute at a house in a wealthy suburb seems like nothing unusual - at first. The elegant blonde in the shadows bleeding from a head injury doesn't want any help; and the well-dressed, ingratiating man at the front door tells Paddy everything's fine and that she should leave.And then he asks her to make sure nothing appears in the paper, slipping cash into her hand before he closes the door.The next morning Paddy sees the lead TV news story: the blond woman had been tortured, beaten, and left to die. The untraceable man was neither her boyfriend nor her husband, and Paddy can't understand why the victim passed up the chance to walk through the door and live. Far from the spoiled trophy wife Paddy assumed her to be, the victim was a prosecution lawyer with a social conscience that clashed with her privileged background. Soon Paddy begins to make connections no one else has seen, and after she witnesses the body of a suicide being pulled from the river, she finds surprising links between the two deaths.It's the story Paddy's dreamed of, but she'll lose all credibility if word gets out about the bribe. The police who attended the call are twisting the evidence for reasons of their own, and her boss at the newspaper is impatient with Paddy's unproven hunches. Only Paddy care enough to pursue a dark and brutal truth that could make her career - or kill her.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Trap Door (Home Repair Is Homicide Mysteries)",
        "Authors": "By Graves, Sarah",
        "Description": "When Jacobia \"Jake\" Tiptree left behind her high-powered, high-risk career on Wall Street for the charming town of Eastport, Maine, she expected a quiet life spent fixing up her 1823 Federal-style house. But there are skeletons in her closet that may prove beyond repair ... Suddenly the perils of the stock market pale in comparison to the murder, mayhem, and mystery of remodeling.Summer is slowly coming to Eastport, and Jake has a new project in the works: building a dock at her lakeside cottage. Loaded down with tools and supplies, she and her best friend, Ellie White, are on their way to start the job when they run into one of Jake's old New York City pals.Wiseguy Jemmy Wechsler once took Jake under his wing - and now it's time for Jake to return the favor. There's a hit out on Jemmy, and the man on his tail isn't merely your run-of-the-mill hired killer. He's the East Coast's most feared professional. And he just happens to live in Eastport ...Jemmy wants to end his ordeal once and for all ... even it means confronting the killer on his own turf. And Jake's cottage is the perfect hideout while he plans his next move. But the body Jake and Ellie find dangling at the end of a rope in the hit man's barn throws a wrench into all their plans - big time.Accused of stalking the hired killer's daughter, the victim apparently committed suicide. Only Jake believes otherwise. Her remodeling instincts may fail her now and then, but as a former money manager to the mob, she knows how the bad guys think. There's more to this story than anyone's telling, and she's about to risk her life exposing the truth. Only, she'd better do it fast, before a smart, ruthless killer ensnares her in a trap she can't escape.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Mastering Microwave Cookery",
        "Authors": "By Cone, Marcia and Snyder, Thelma",
        "Description": "Showing how to create fine cuisine with a microwave, this illustrated cookbook features more than eight hundred recipes and offers instruction in basic microwave cooking methods as well as variations for more exotic dishes",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "The Emigrants and Other Stories",
        "Authors": "By Anonymous",
        "Description": "",
        "Category": "",
        "Publisher": "NEW YORK: LEAVITT & ALLEN",
        "Price Starting With ($)": "5.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1853"
        }
    },
    {
        "Title": "Donvier Ice Cream: More Than 80 Recipes for Sorbets, Parfaits, and Frozen Drinks, with Light Variations",
        "Authors": "By Chalmers, Irena",
        "Description": "Written specifically for use with the Donvier Ice Cream Maker, this cookbook features eighty-three recipes--each including a reduced-calorie version",
        "Category": " Cooking , General",
        "Publisher": "Studio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Half Full: Meditations on Hope, Optimism and the Things that Matter",
        "Authors": "By Parker, Mina and Talbott, Daniel (PHT)",
        "Description": "Half Full is an invitation to take a pause. To sit still for a minute, put your feet up, and drink in the words and pictures that can replenish your soul and help you to recognize your many blessings.With 42 photographs of everyday objects looked at from different angles, plus quirky, original meditations about looking on the lighter side. These mini essays are based on quotations from wise teachers throughout history such as Helen Keller, Dolly Parton, Mark Twain, Winston Churchill, Emily Dickinson, Katharine Hepburn, and the author's greatgrandmother. And each and every one includes a tidbit of food for thought, a piece of advice, or something to do, such as 'Look for an opportunity in a difficulty that's been dogging you.'Isn't it time to give up that halfempty glass?",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "PARKER'S WINE BUYER'S GUIDE, 4TH EDITION: Fourth Edition",
        "Authors": "By Parker, Robert M., Jr.",
        "Description": "Describes and rates wines from around the world, including France, Italy, Germany, the United States, Spain, and Australia",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Confessions: The Making of a Postdenominational Priest",
        "Authors": "By Fox, Matthew",
        "Description": "Visionary, activist, and one of the most important religious thinkers and teachers of our time, Matthew Fox has devoted his career to unleashing the suppressed mystical and life-affirming traditions within Christianity. His theology of \"Creation Spirituality\" - notably the belief that we are born in \"original blessing\" - has reinvigorated the faith of countless Christians and earned him the headline-making censure of the Vatican, who officially \"silenced\" Fox in 1989 and precipitated his dismissal by the Dominican Order in 1993.In this always compelling memoir, Fox, now an Episcopal priest, traces the roots of his radical theology, from his 195Os childhood in Madison, Wisconsin, through formative years spent training in a late-sixties Paris rocked by revolutionary fervor, to taking on the Vatican (which he likens to standing in front of a train), to his most recent experiences as a leader of \"rave masses\" for urban young people. Written with his characteristic candor and insight, Confessions details Fox's spiritual, intellectual, political, and cultural evolution as an envelope-pushing member of a generation \"bold enough to question many things and to seek spirituality over religion.\"Fox's story mirrors the questions and concerns of those millions of contemporary seekers with a \"passion for holiness\"; a yearning for a Christian spirituality committed to social justice, feminism, and environmentalism; and a desire for ritual that heals, celebrates, and honors the gifts of being in each of us. Always relentlessly ahead of his time, Fox embraces his role as a \"post-denominational priest,\" passionately exploring the present and future role of faith, church, and a spirituality grounded in the emphatic belief that finding God is still possible.",
        "Category": " Religion , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Ticket to Ride: A Rail Journey Around Australia",
        "Authors": "By Dennis, Anthony and Rayner, Michael",
        "Description": "The authors recount their rail odyssey through Australia and their encounters with the colorful inhabitants of each region",
        "Category": " Travel , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The Timetables of Technology: A Chronology of the Most Important People and Events in the History of Technology",
        "Authors": "By Bunch, Bryan H. and Hellemans, Alexander (EDT)",
        "Description": "Traces the history of technology from the invention of the wheel through the latest scientific and technological advances",
        "Category": " Technology & Engineering , General",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Rediscovering America: Thirty-five years of the National Endowment for the Humanities",
        "Authors": "By National Endowment for the Humanities",
        "Description": "",
        "Category": "",
        "Publisher": "For sale by the Supt. of Docs., U.S. G.P.O",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "American Portraits: Biographies in United States History, Volume II",
        "Authors": "By Hartford, William F. and Weisner, Stephen G. (EDT)",
        "Description": "American Portraits is a two-volume collection of biographical profiles designed to supplement American History survey texts. Biography personalizes history in a unique and profound way for students, lending a sense of immediacy to the study of the past. All of the essays selected for this anthology profile the life of a given individual and explore how that person influenced and was influenced by broader historical forces. Introductions begin each \"unit\", placing the biographies in topical and chronological perspective. Supporting documents, headnotes, and discussion questions help students place the biographies in context.",
        "Category": " History , United States , General",
        "Publisher": "Mcgraw-Hill College",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Politics 1964",
        "Authors": "By Carney, Francis M. & H. Frank Way, Jr.",
        "Description": "",
        "Category": "",
        "Publisher": "Belmont Wadsworth",
        "Price Starting With ($)": "9.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "The Best of People: The First Decade",
        "Authors": "By People Magazine (New York, N. Y.)",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Fawcett Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Soldiers of Fortune (Epic of Flight)",
        "Authors": "By Seagrave, Sterling",
        "Description": "Vividly depicts the experiences of mercenary fighter pilots in wars ranging from the Spanish Civil War to the Vietnam War",
        "Category": " Political Science , General",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "The Aeronauts (The Epic of Flight)",
        "Authors": "By Jackson, Donald Dale",
        "Description": "Chronicles the history of ballooning from the eighteenth through the twentieth centuries, describing the principles of balloon flight and looking at the uses of balloons for travel, warfare, and recreation",
        "Category": " Technology & Engineering , General",
        "Publisher": "Time Life+ Books Inc",
        "Price Starting With ($)": "10.5",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "Icons of the Century",
        "Authors": "By Taborelli, Giorgio",
        "Description": "Profiles one noteworthy person for each year of the century, highlighting the personalities, the ideas, and the history-making acts that formed the twentieth-century world",
        "Category": " History , Modern , 20th Century",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "7.69",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Mary Shelley's Frankenstein: A Classic Tale of Terror Reborn on Film (Newmarket Pictorial Moviebook)",
        "Authors": "By Branagh, Kenneth, Darabont, Frank, and Lady, Steph",
        "Description": "Includes the complete script; stunning production stills; an exclusvie introduction and special chapter on the making of the film written by Branagh; behind-the-scene details on special effects, makeup, production design, casting, a bio of Mary Shelley and essay about the horror genre in literature and film by scholar Leonard Wolf. 185 illustrations, 80 in color.The Newmarket Pictorial Moviebooks, official companions to films, large format (8 3/8 x 10 7/8), heavily illustrated throughout, with color photographs, details on the making of the film, background on the filmmakers and cast.",
        "Category": " Performing Arts , Film , General",
        "Publisher": "Newmarket Press",
        "Price Starting With ($)": "5.62",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Guerrilla Marketing in 30 Days",
        "Authors": "By Levinson, Jay Conrad and Lautenslager, Al",
        "Description": "A Blueprint for Great Marketing!In Guerrilla Marketing in 30 Days, co-authors Jay Conrad Levinson and Al Lautenslager take the best selling marketing series in history, Guerrilla Marketing, and boil it down into one dynamic package of the most up-to-date guerrilla tactics.Whether your goal is to develop a complete marketing plan or to focus on improving a specific component, this is the book for you.  From competition and research to execution and expansion, you get 30 action plans via guerrilla marketing tips, methods, ideas and values—where the major ingredients are time, energy and imagination, not hard-earned profits.  And on each and every day you’ll have developed plans to improve and re-engineer a piece of your overall marketing blueprint to maximize profits and increase customers.",
        "Category": " Business & Economics , Small Business",
        "Publisher": "Entrepreneur Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Politics, Culture, and Class in the French Revolution (Studies on the History of Society and Culture)",
        "Authors": "By Hunt, Lynn",
        "Description": "",
        "Category": " History , Europe , France",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Dead Certainties: Unwarranted Speculations",
        "Authors": "By Schama, Simon",
        "Description": "Like his The Embarrassment of Riches and the bestselling Citizens, Simon Schama's latest book is both history and literature of immense stylishness and ambition. But Dead Certainties goes beyond these more conventional histories to address the deeper enigmas that confront a student of the past. In order to do so, Schama reconstructs -- and at times reinvents -- two ambiguous deaths: the first, that of General James Wolfe at the battle of Quebec in 1759; the second, in 1849, that of George Parkman, an eccentric Boston brahmin whose murder by an impecunious Harvard professor in 1849 was a grisly reproach to the moral sanctity of his society. Out of these stories -- with all of their bizarre coincidences and contradictions -- Schama creates a dazzling and supremely vital work of historical imagination.",
        "Category": " Social Science , Death & Dying",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Film Viewers Guide",
        "Authors": "By Bordwell, David",
        "Description": "",
        "Category": " Performing Arts , Film & Video , Guides & Reviews",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Beyond Words: The Story of Sensitivity Training and the Encounter Movement ( A Pelican Book)",
        "Authors": "By Back, Kurt W.",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1973"
        }
    },
    {
        "Title": "Current psychotherapies",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "F.E. Peacock Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "TRIAD POWER",
        "Authors": "By Ohmae, Kenichi",
        "Description": "During the last year renowned business strategist Kenichi Ohmae's pathbreaking ideas on the globalization of industries and products have made headlines in leading financial newspapers and business publications on three continents. Now, in this eagerly awaited book, Ohmae integrates and expands his much discussed concepts -- to demonstrate why corporations hoping to compete in the global arena must become \"insiders\" in what he calls the Triad: Europe, Japan, and the United States.  Ohmae explains that becoming an insider means nothing less than full membership in the indigenous business communities at each corner of the Triad. Why? In such high-tech industries as computers, consumer electronics, and communications, the rapid pace of product innovation and development no longer allows firms the luxury of testing the home market before probing abroad. Moreover, because consumer preferences vary subtly by culture and are in constant flux, companies must intimately understand local tastes -- and react instantly to changing market trends and prices. Political considerations play a part as well: Ohmae's insiders possess greater immunity to protectionism than do outsiders. Finally, capturing markets in all three parts of the Triad is often the only way to achieve the economies of scale world-class automated plants demand in order to pay for themselves.  Which is the best path to insider status? Pointing out that only a handful of corporations have the resources -- or the product lines -- to dominate any one Triad market, Ohmae shows how joint ventures and international consortia have already given a range of firms (for example, Mazda, Ford, Renault in cars, Mitsubishi, Westinghouse, and Olivetti in robots) the local manufacturing, distribution, research, and marketing talent they need to be successful Triad competitors. He warns, too, that if destructive trade wars are to be avoided or their effects blunted, more such cooperative efforts must be made -- and soon.  In a world where the growing parity among American multinationals and their European and Japanese counterparts has made technological and marketing advantages increasingly difficult to acquire or sustain, Triad Power offers a pragmatic alternative: cross-cultural alliances that accept a future in which change is inevitable -- and where only risks bring rewards. Required reading for senior and general managers and for corporate planners and financial analysts, it is a challenging, thought-provoking, cosmopolitan look at the new rules of global competition.",
        "Category": " Business & Economics , International , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Stories for a Teen's Heart: Over One Hundred Stories to Encourage a Teen's Soul. Book 1",
        "Authors": "By Gray, Alice (COM)",
        "Description": "Alice Gray has compiled 110 inspirational stories that are sure to touch the hearts of teens in this title in the bestselling Stories for the Heart series. Through an even blend of humorous, often poignant tales, teens will be encouraged in life's journey and reassured that they are not alone on the road to becoming adults. Many popular CBA authors offer valuable insights into the human condition in a manner that is warm and uplifting. Stories for a Teen's Heart will revitalize the spirits of young people.",
        "Category": " Young Adult Nonfiction , Religion , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "I Spy a Candy Cane (Scholastic Reader, Level 1)",
        "Authors": "By Marzollo, Jean and Wick, Walter (ILT)",
        "Description": "A Level 1 reader with picture clue riddles and search-and-find fun!All new, easy-to-read riddles by Jean Marzollo are paired with fun photographs culled from previously published I Spy books to create an I Spy easy reader. With rhythm, rhyme, and picture clues, this book is written to support the newest reader!",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Israel Guide: Your Passport to Great Travel! (Open Road's Israel Guide)",
        "Authors": "By Gold, Stephanie",
        "Description": "",
        "Category": " Travel , Middle East , Israel",
        "Publisher": "Not Applicable",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "For the President's Eyes Only: Secret Intelligence and the American Presidency from Washington to Bush",
        "Authors": "By Andrew, Christopher",
        "Description": "From the co-author of KGB: The Inside Story and an acknowledged authority on the subject comes \"the most important book ever written about American intelligence.\"--David Kahn, author of The Codebreakers and Hitler&#39;s Spies",
        "Category": " History , United States , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "World of the Golden Compass: The Otherworldly Ride Continues [Paperback]",
        "Authors": "By Westerfeld, Scott",
        "Description": "",
        "Category": "",
        "Publisher": "Borders Group, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "LB Brief",
        "Authors": "By Aaron, Jane E.",
        "Description": "LB Brief   offers the authority and currency of its best-selling parent,  The Little, Brown Handbook, in two briefer, spiral-bound formats (one with tabs and one without tabs) at affordable prices.      As in its previous edition, LB Brief provides students of varying skills and interests with clear, reliable, and accessible explanations of handbook basics—the writing process, grammar and usage, and research writing. The Fourth Edition builds on the handbook’s usefulness with four main emphases: (1) reading and writing across the curriculum, including an expanded chapter on academic writing, showing students how to write in response to texts, and more coverage of argument, with information on how to handle opposing views and strengthen an ethical appeal; (2) research writing, including expanded discussions on how to find and evaluate print and Web sources,  and a new research-paper-in-progress; (3) up-to-date documentation guidelines, including the most recent revisions to MLA and APA documentation styles, with numerous models of new media in each style and new annotated sample sources; (4) more writing process instruction, including a new student work-in-progress and new discussions of voice in writing.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Longman",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Under My Skin: A Hannah Wolfe Mystery (Hannah Wolfe Crime Novels (Paperback))",
        "Authors": "By Dunant, Sarah",
        "Description": "A decade before her dazzling breakthrough novel, The Birth of Venus, Silver Dagger Award-winning author Sarah Dunant won critical acclaim for her Hannah Wolfe crime novels.  In Under My Skin, private investigator Hannah Wolfe's cushy new assignment takes her to the sumptuous Castle Dean health spa. While being plucked, crimped, steamed, and oiled, Hannah is ideally placed to probe some reported cases of sabotage -- fish in the Jacuzzi and steel nails in the massage heads. But spa owner Olivia Marchant has other problems besides sabotage. Someone is threatening her husband, Maurice, one of London's leading cosmetic surgeons and the man responsible for reconstructing many of the world's rich and famous. In a culture where no one wants to grow old and everyone seems to believe in the power of the knife, Hannah feels like an alien visitor. People will do anything in the name of beauty -- perhaps even commit murder.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Virtues of Aging (Library of Contemporary Thought)",
        "Authors": "By Carter, Jimmy",
        "Description": "\"We are not alone in our worry about both the physical aspect of aging and the prejudice that exists toward the elderly, which is similar to racism or sexism. What makes it different is that the prejudice also exists among those of us who are either within this group or rapidly approaching it. When I have mentioned the title of this book to a few people, most of them responded, 'Virtues? What could possibly be good about growing old?' The most obvious answer, of course, is to consider the alternative to aging. But there are plenty of other good answers--many based on our personal experiences and observations. \"--from THE VIRTUES OF AGING",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Random House Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "I Am a Woman Finding My Voice: Celebrating The Extraordinary Blessings Of Being A Woman",
        "Authors": "By Quinn, Janet F.",
        "Description": "This celebration of womanhood, with a foreword by Dr. Joan Borysenko, delights in the joy of the feminine soul. In a time when it might not be politically correct to speak of such a uniquely feminine soul, Quinn takes the position that finding one's own authentic voice is imperative if we are to value a universal livelihood of love and community.",
        "Category": " Self-help , Affirmations",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Arizona traveler's handbook (Moon Handbooks Arizona)",
        "Authors": "By Weir, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Moon Publications Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Hey, Kids! Come Craft with ME",
        "Authors": "By Dahlstrom, Carol Field and Engelbreit, Mary",
        "Description": "The warm, nostalgic motifs of Mary Engelbreit, now American classics, tuck neatly into the lives of today’s kids. They’ll eagerly work on every craft project, which is sure to spark their imagination and self-expression.More than 30 children’s crafting projects inspired by Mary Engelbreit’s motifs and sentiments.The only children’s crafting book from Mary Engelbreit.Research shows that Mary Engelbreit crafts rate very high among crafters and that her designs are popular among kids.Step-by-step photographs and instructions.Full-color photos, including some showing children using the projects.Designed for children 6 to 14.Easier crafts for younger children.Shows variety of techniques.",
        "Category": " Crafts & Hobbies , Crafts for Children",
        "Publisher": "Mary Engelbreit",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Divided America: The Ferocious Power Struggle in American Politics",
        "Authors": "By Black, Earl and Black, Merle",
        "Description": "Divided America tells the biggest story in American politics today. It's the story behind the emergence of a ferocious power struggle between conservative Republicans and liberal Democrats that is tearing the country's politics apart.Drawing on extensive polling data and close analyses of presidential, senatorial, and congressional elections over the past fifty years, two eminent political scientists show, for the first time, how partisan warfare has reduced both major parties to minority status and locked them into fierce power struggles in each election cycle, thereby making America less stable and more difficult to govern.Because the two major parties are now evenly balanced in the national electorate, control of the White House and Congress can shift dramatically with each election. Neither Republicans nor Democrats operate with any \"lock\" on the presidency, House of Representatives, or Senate, as demonstrated by the 2006 congressional elections. Earl Black and Merle Black examine the party battles as they've played themselves out in the nation's five principal geographic areas. Each party has developed two important regional strongholds, as exemplified in the 2004 elections, when Republicans won all the electoral votes and sizable majorities of House and Senate seats in the South and Mountain/Plains states while the Democrats won almost all the electoral votes and large majorities in the Northeast and the Pacific Rim states. The Midwest is the perennial swing region.The authors describe the enormous changes that have occurred in the electorates of each region over the past fifty years -- with emphasis on how the size and partisan affiliations of key groups have changed -- and show how these transformations have generated today's unstable two-party battles. Although the relentlessly competitive nature of modern American politics is generally appreciated, the regional causes underlying this new state of affairs are not well understood. Because neither Democrats nor Republicans can produce national majorities simply by sweeping their regional strongholds, they are locked in a fierce power struggle in each election. Divided America tells the story of these remarkable developments in clear, vigorous prose and provides a pragmatic understanding of the strengths and weaknesses of each party.For the foreseeable future, each party will be within striking distance of winning -- or losing -- political power in every national institution. Understanding the party battles in America's regions is vital to understanding how today's losers can become tomorrow's winners",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Applebee's America: How Successful Political, Business, and Religious Leaders Connect with the New American Community",
        "Authors": "By Sosnik, Doug, Dowd, Matthew J., and Fournier, Ron",
        "Description": "Draws on new capabilities in polling, communications, and marketing to reveal how political, business, and religious groups can adapt to a fast-changing American society while learning from one another, explaining how the nation's leaders can earn public loyalty and support by supporting key values. 75,000 first printing.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Priscilla Hauser's Book of Decorative Painting",
        "Authors": "By Hauser, Priscilla",
        "Description": "Best known for her graceful roses and loved by thousands of student painters for her clear and enthusiastic style of teaching,Priscilla Hauser has earned a reputation as \"America's First Lady of Decorative Painting.\"In this complete guide, Priscilla shows you how to paint your own beautiful roses - along with daises, lilacs, violets, poppies, irises, tulips and other lovely flowers.You'll find everything you need to get started:Supplies. A handy guide to all the supplies you'll need for a decorative painting in oils and acrylics, including which brushes to use and how to care for them.Surface Preparations and Finishes. Learn how to properly prepare wood, metal, fabric and other surfaces for your decorative painting. Plus, you'll find easy techniques for creating fabulous finishes such as antiquing and crackling.The Basics. Practice these fundamental skills - from basic brushstrokes to blending - and you'll be painting flowers in no time!Watch your brushstrokes bloom in 22 flower painting projects! Starting with simple patterns and techniques and progressing to more challenging ones, these projects will show you how to paint an assortment of leaves and flowers. Priscilla includes paint-along worksheets for practice; patterns for you to copy; step-by-step photos and instructions; photos of the finishes pieces' and lots of ideas for using your painted flowers to decorate an endless variety of surfaces.Whether you're a total beginner or an experienced painting, Priscilla's techniques and patters will help you fill your home (and friends' homes!) with the ever-fresh beauty of painted flowers.",
        "Category": " Crafts & Hobbies , Painting",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Country Sampler's Christmas Gatherings: An American Celebration",
        "Authors": "By Lowery, Joanne (EDT) and Anton, Debra (EDT)",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Sampler Pubns",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Anthropological Lens: Harsh Light, Soft Focus",
        "Authors": "By Peacock, James L.",
        "Description": "Anthropology is a complex, wide-ranging, and ever changing field. Yet, despite its diversity, certain major themes do occur in the understandings of the world that anthropologists have offered. In this clear, coherent, and well-crafted book, James L. Peacock spells out the central concepts, distinctive methodologies, and philosophical as well as practical issues of cultural anthropology. Designed to supplement standard textbooks and monographs, the book focuses on the premises that underlie the facts that the former kinds of works generally present. Free from unnecessarily abstract theoretical language and based on compelling concrete anecdote and engaging illustration, it is written in terms understandable to the anthropological novice, as well as being of value to the professional. The book's three main concerns are the substance, method, and significance of anthropology. In his discussion of substance, method, and significance of anthropology, such as the concept of culture, as well as holism. In writing about method, he explores the distinctive character of ethnographic fieldwork and raises questions of interpretation and comparison. Finally, he considers the relevance of anthropology with respect to both its practical application and what it contributes to understanding of human affairs. Using the photographic metaphors of 'harsh light' and 'soft focus', Peacock characterizes the anthropological worldview as consisting of two elements: on the one hand, a concern with the basic reality of the human condition, free of cultural influence; on the other, a broadly based holism that attempts to grasp all aspects of that condition, including its relation to the anthropologist. His book will appeal widely to readers interested in anthropology, at all levels.",
        "Category": " Social Science , Anthropology , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Seeds of Hope - A Faith Journey",
        "Authors": "By Grout, Phil",
        "Description": "",
        "Category": " Photography , General",
        "Publisher": "Brethren Press",
        "Price Starting With ($)": "10.78",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Microwave Meat & Poultry (Microwave Kitchen Library)",
        "Authors": "By Ferguson, Judith",
        "Description": "Provides recipes for lamb, pork and ham, beef, poultry, and game that are specially adapted for preparation using a microwave oven",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.45",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Betty Crocker's Eat & Lose Weight",
        "Authors": "By Crocker, Betty",
        "Description": "You can omit the word idieti from your vocabulary, because a healthy eating plan is about making choices you can stick with for life, not an awkward regimentation that keeps you from enjoying food. Think that to lose weight and be healthy you have to give up your favorites? Think again--Betty Crocker's Eat & Lose Weight, proves that healthy eating need not be exclusive of enjoying meals. And best of all, Betty Crocker shows that a healthy and delicious eating plan is not just possible, it can be simple, too.For starters, this book is full of solid information to help you understand your body type, and to set reasonable and healthy weight loss goals. From understanding the facts about various diet plans to making long-term smart food choices, this handy introduction to eating right can help anyone who wants to get in shape. And then there are the recipes--150 delicious recipes from the Betty Crocker test kitchens that put this knowledge into action, showing that healthy eating and slimming down can go with delicious meals with no problem. Plus 60 full-color food photographs that feature these dazzling recipes.From Cinnamon-Raisin French Toast for breakfast to Italian Roasted Pork Tenderloin for dinner, you'll quickly learn that nothing is off the menu. Because losing weight through healthy eating is not about abstention--it's about balance and setting realistic goals for yourself, and Betty Crocker's Eat & Lose Weight shows you how to make it happen!",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Betty Crocker",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Cours Superieur De Francais (R 126P)",
        "Authors": "By Blume, Eli",
        "Description": "",
        "Category": " Foreign Language Study , French",
        "Publisher": "Amsco School Pubns Inc",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "The Commoner: A Novel",
        "Authors": "By Schwartz, John Burnham",
        "Description": "It is 1959 when Haruko, a young woman of good family, marries the Crown Prince of Japan, the heir to the Chrysanthemum Throne. She is the first non-aristocratic woman to enter the longest-running, almost hermetically sealed, and mysterious monarchy in the world. Met with cruelty and suspicion by the Empress and her minions, Haruko is controlled at every turn. The only interest the court has in her is her ability to produce an heir. After finally giving birth to a son, Haruko suffers a nervous breakdown and loses her voice. However, determined not to be crushed by the imperial bureaucrats, she perseveres. Thirty years later, now Empress herself, she plays a crucial role in persuading another young woman—a rising star in the foreign ministry—to accept the marriage proposal of her son, the Crown Prince. The consequences are tragic and dramatic. Told in the voice of Haruko, meticulously researched and superbly imagined, The Commoner is the mesmerizing, moving, and surprising story of a brutally rarified and controlled existence at once hidden and exposed, and of a complex relationship between two isolated women who, despite being visible to all, are truly understood only by each other. With the unerring skill of a master storyteller, John Burnham Schwartz has written his finest novel yet.",
        "Category": " Fiction , Literary",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "A Democracy at War: America's Fight at Home and Abroad in World War II",
        "Authors": "By O'Neill, William L",
        "Description": "As America fought to defend democratic ideals in Europe and Asia during World War II, our own democratic politics at home paradoxically created a far less than efficient war effort on both civilian and military fronts. While America's glorious triumphs in World War II are well known, the story of our country's failure to swiftly and effectively mobilize and energize our war machine is yet to be fully told. Now, in a broad-ranged domestic, military, and diplomatic history, William O'Neill tells the story of America's strengths and its weaknesses in fighting the Good War.The United States won its victory in World War II not, as legend has it, because of superior numbers and material predominance. Reluctant even to enter the war, the American government proceeded by costly half-measures even after committing to fight. Official reticence and bureaucratic bungling led to inferior and defective weapons, too few infantrymen, the squandering of GI's lives in strategically useless attacks, and other tragic mistakes. The Sherman tank was a deathtrap and the torpedoes of American submarines routinely malfunctioned. Afraid to alarm voters, Congress failed to act on many issues, such as the decision to increase military spending before the war, which could have brought the conflict to a faster end, with less bloodshed. O'Neill traces much of the official bungling to domestic politics and paradoxically to the democratic process itself, which limited Roosevelt's flexibility in wartime.Yet, despite these obstacles, the blood and valor of the men who fought and the strength and struggles of those who remained at home made up for an overly cautious and ambivalent democratic leadership. William O'Neill brings this war generation to life to tell the story of the country which had long seemed willing to ignore the world but ultimately roused itself to defend it.",
        "Category": " History , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Sammy Keyes and the Curse of Moustache Mary",
        "Authors": "By Van Draanen, Wendelin",
        "Description": "The normally unflappable Sammy Keyes is reeling--not from her encounters with a corpse, an arsonist, or an irate policeman, these she can handle. No, what completely unbalances her is the teen-scene at a New Year's Eve party. Caught up in this adolescent ambush, Sammy begins to doubt herself. And if she can't trust her own instincts, how can she possibly figure out who burned down a pioneer-era cabin, how a 200-pound pig has disappeared , or why Casey might want to hold her hand?In this fifth Sammy Keyes mystery, Wendelin Van Draanen gives us her most ambitious work to date. While her prose is as comic as ever, there's a very serious undercurrent here--Sammy is tossed and torn, both literally and figuratively, as she shoots the rapids of this plot. But in puzzling out whodunit and how and why, she manages not only to turn the culprits over to the police, but also to reclaim a belief in her own strength.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "An Age of Conflict",
        "Authors": "By Derfler, Leslie",
        "Description": "",
        "Category": " History , World",
        "Publisher": "Harcourt College Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Taking Sides: Clashing Views on Controversial Issues in American History, Vol. I",
        "Authors": "By Madaras, Larry (EDT) and Sorelle, James M. (EDT)",
        "Description": "This debate-style reader is designed to introduce students to controversies in American history through readings that reflect a variety of viewpoints. Issues raised include: Is America exceptional? Did slaves practice religious autonomy? Was the Mexican War an exercise in American imperalism? Taking Sides is supported by our student Web site, Dushkin Online (www.dushkin.com/online/).",
        "Category": " History , United States , General",
        "Publisher": "Mcgraw-Hill College",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "How College Affects Students: Findings and Insights from Twenty Years of Research (The Jossey-Bass Higher and Adult Education Series)",
        "Authors": "By Pascarella, Ernest T. and Terenzini, Patrick T.",
        "Description": "Foreword by Kenneth A. Feldman  Not since Feldman and Newcomb's 1969 landmark book, TheImpact of College on Students has there been such acomprehensive resource available on what is known about the effectof college on students. In this book, Pascarella and Terenzini takeup where Feldman and Newcomb left off, synthesizing twenty moreyears of empirical research and over 2,600 studies, distilling whatis known about how students change and benefit as a consequence ofattending college.",
        "Category": " Education , Administration , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Explorer: A Pop-Up Book",
        "Authors": "By Ballard, Robert",
        "Description": "Accompanies the author as he dives for the remains of the Titanic and other sunken ships, explores the Mid-Atlantic Ridge and the Cayman Trough, discovers unknown creatures in the ocean depths, and travels in the world's smallest submarine.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "We Drink from Our Own Wells: The Spiritual Journey of a People",
        "Authors": "By Gutierrez, Gustavo",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Orbis Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Extended Prelude to Programming: Concepts and Design (2nd Edition)",
        "Authors": "By Venit, Stewart",
        "Description": "",
        "Category": " Computers , Programming , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "William Clark and the Shaping of the West",
        "Authors": "By Jones, Landon Y.",
        "Description": "Between 1803 and 1806 Meriwether Lewis and William Clark co-captained the fabled expedition across the North American continent.  But while Lewis ended his life just three years later, Clark, as the highest ranking Ferderal official in the West, spent three decades overseeing its consequences: Indian removal and the destruction of Native America.  In a rare combination of storytelling and scholarship, best-selling author Landon Y. Jones presents for the first time Clark's remarkable life and influential career in their full complexity.Like every colonial family living on Virginia's violent frontier, the Clarks killed Indians and acquired land; acting on behalf of the United States, William would prove the most successful at it.  Clark's life was spent fighting in America's fifty-year running war with the Indians (and their European allies) over the western borderlands.  The struggle began with his famed brother George Roger's western campaigns during the American Revolution, continued through the vicious western battles of the War of 1812, and ended with the Black Hawk War in the 1830s.  In vividly depicting Clark's life, Jones memorably captures the dark and bloody ground of America's early West.  Newly discovered documents also shed light on Clark's relationship with Lewis, the extent to which the latter relied on Clark, and how the famed expedition itself was of a piece with the espionage, intrigue, and warfare that realized America's grander enterprise: the shaping of the West.  No one played a larger part in that accomplishment that William Clark.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Hill and Wang",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Kingdom Come",
        "Authors": "By Green, Tim",
        "Description": "For Thane Coder, a shot at running one of the richest, most influential corporations in America was an opportunity he couldn't pass up. And with his seductive, savvy wife, Jessica, showing him the way, his fate was decided.All it took was a back door, a snowy night, and an old hunting knife to unlock more money than Thane could ever imagine.After he murders his boss, mentor, and friend James King, Thane and Jessica leap into a life of corporate jets and tropical hideaways - a world of infinite luxury and privilege. But when King's son surfaces with suspicion and revenge on his mind, the Coders' empire begins to crumble.Once an everyday American couple with a mortgage and weekend soccer games, they're now entering a twisted maze filled with federal agents, the Mafia, a son hell-bent on vengeance, and a relentless, old-fashioned tracker willing to follow this husband and wife to the ends of the earth to take them down.In Kingdom Come, boardrooms become hunting grounds, handshakes become blood oaths, and even the people you hold closest to you - your family - become suspect.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "How to Select and Use Nikon SLR Cameras",
        "Authors": "By Shipman, Carl",
        "Description": "",
        "Category": "",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Songs Without Words",
        "Authors": "By Packer, Ann",
        "Description": "Ann Packer’s debut novel, The Dive from Clausen’s Pier, was a nationwide best seller that established her as one of our most gifted chroniclers of the interior lives of women. Now, in her long-awaited second novel, she takes us on a journey into a lifelong friendship pushed to the breaking point. Expertly, with the keen introspection and psychological nuance that are her hallmarks, she explores what happens when there are inequities between friends and when the hard-won balances of a long relationship are disturbed, perhaps irreparably, by a harrowing crisis.Liz and Sarabeth were childhood neighbors in the suburbs of northern California, brought as close as sisters by the suicide of Sarabeth’s mother when the girls were just sixteen. In the decades that followed—through Liz’s marriage and the birth of her children, through Sarabeth’s attempts to make a happy life for herself despite the shadow cast by her mother’s act—their relationship remained a source of continuity and strength. But when Liz’s adolescent daughter enters dangerous waters that threaten to engulf the family, the fault lines in the women’s friendship are revealed, and both Liz and Sarabeth are forced to reexamine their most deeply held beliefs about their connection. Songs Without Words is about the sometimes confining roles we take on in our closest relationships, about the familial myths that shape us both as children and as parents, and about the limits—and the power—of the friendships we create when we are young. Once again, Ann Packer has written a novel of singular force and complexity: thoughtful, moving, and absolutely gripping, it more than confirms her prodigious literary gifts.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "An Eye for Beauty: Photographs of Evelyn Lauder",
        "Authors": "By Lauder, Evelyn H. and Spindler, Amy (INT)",
        "Description": "",
        "Category": " Photography , Individual Photographers , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "6.5",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Quotes for Kids: Today's Interpretations of Timeless Quotes Designed to Nurture the Young Spirit",
        "Authors": "By Meyer, Lisa and Holt, Dan (ILT)",
        "Description": "Gathers and explains quotations about attitude, beauty, character, communications, determination, forgiveness, happiness, learning, problem solving, and respect",
        "Category": " Reference , Quotations",
        "Publisher": "Reach Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Truman and the Steel Seizure Case: The Limits of Presidential Power (Contemporary American history series)",
        "Authors": "By Marcus, Maeva",
        "Description": "",
        "Category": " Political Science , American Government , General",
        "Publisher": "Columbia Univ Pr",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1977"
        }
    },
    {
        "Title": "Santa Fe Dead (Ed Eagle Novel)",
        "Authors": "By Woods, Stuart",
        "Description": "In this thriller featuring the colorful Santa Fe trial lawyer, Ed Eagle finds the tables turned when he testifies as a witness for the prosecution in the trial of his ex-wife, Barbara Eagle, who has been a very, very bad girl. The trial ends in a way Ed had not anticipated, and Barbara is still in a position to make his life, and that of others, a living hell.With private detectives, hit men, double crosses, and billion-dollar-bank accounts involved, Ed calls in every favor and follows every lead, no matter where they take him. From the posh resorts of desert California and the lush wine country of Napa, to the New Mexico high country and the seedy hotels of Tijuana, Ed Eagle won't rest until he's discovered the truth about what Barbara is up to - and settled the score.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Lady Killer",
        "Authors": "By Scottoline, Lisa",
        "Description": "Mary DiNunzio is a trademark Lisa Scottoline heroine—she's strong, she's smart, and she's got plenty of attitude. In recent years, she's become a big-time business-getter at Rosato & Associates, but the last person she expects to walk into her office one morning—in mile-high stilettos—is super sexy Trish Gambone, her high school rival. Back then, while Mary was becoming the straight-A president of the Latin Club and Most Likely to Achieve Sainthood, Trish was the head Mean Girl, who flunked religion and excelled at smoking in the bathroom. As it turns out, however, Trish's life has taken a horrifying turn. She's terrified of her live-in boyfriend, who's an abusive, gun-toting drug dealer for the South Philly mob. There's only one problem—Mary remembers the guy from high school too. Unbeknownst to Trish, Mary had a major crush on him. Then Trish vanishes, a dead body turns up in an alley, and Mary is plunged into a nightmare, one that threatens her job, her family, and even her life. She goes on a one-woman crusade to unmask the killer, and on the way, finds new love in a very unexpected place.But before the novel's shocking surprise ending, Mary is forced to confront some very uncomfortable truths about her own past, and the profound effects of lifelong love—and hate.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "A Little Treasury of Love Poems",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Avenel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Once",
        "Authors": "By Walker, Alice",
        "Description": "This first volume of poetry established Walker as a poet of unusual sensitivity and power. All of the poems in this collection were written either in East Africa, where Walker spent the summer of 1965, or during her senior year at Sarah Lawrence College. “Brief slashing poems-young and in the sun” (Muriel Rukeyser).",
        "Category": " Poetry , American , General",
        "Publisher": "Harvest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1976"
        }
    },
    {
        "Title": "The Case of the Rock Star's Secret (New Adventures of Mary-Kate & Ashley, No. 16)",
        "Authors": "By Metz, Melinda, Olsen, Mary-Kate, and Olson, Ashley",
        "Description": "Crank it up! Ashley and I were in a rock band! We were practicing for our first concert--and we were jammin'! We couldn't wait to blow the crowd away! But then weird stuff started happening.  Someone replaced our singer's shampoo with black hair dye. A huge explosion went off outside our dress rehearsal. And all our instruments disappeared--right before the concert! Who was trying to stop the music? We had to find out--fast!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperEntertainment",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Awakening and Selected Stories of Kate Chopin (Signet Classics)",
        "Authors": "By Chopin, Kate and Solomon, Barbara H.",
        "Description": "“Perhaps it is better to wake up after all, even to suffer, rather than to remain a dupe to illusions all one’s life.” Kate Chopin was enjoying wide popularity as a writer, mainly of short stories, when her second novel, The Awakening, was published to widespread criticism of its immorality. A wake-up call to women all over the country, this landmark novel of early American feminism tells of a Louisiana wife who discovers the strength of her own sexuality and tries to wrench it from the hands of a patriarchal society. And just as Edna Pontellier is ostracized for trying to master her own sexual fate, so did Chopin’s reputation suffer after she wrote this book. Today The Awakening is considered a masterpiece and, along with Chopin’s short stories, has set a standard for younger generations of women who have learned to value their independence and authenticity.Edited and with an Introduction by Barbara H. Solomon and with a New Afterword by Roxane Gay.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "April",
            "Year": "1976"
        }
    },
    {
        "Title": "The Sun Also Rises (Scribner Classics)",
        "Authors": "By Hemingway, Ernest",
        "Description": "In the socially dislocated period after World War I, an American expatriate and a British peeress conduct a hopeless love affair",
        "Category": " Fiction , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "The Portrait of a Lady (Penguin Classics)",
        "Authors": "By James, Henry and Moore, Geoffrey",
        "Description": "Follows the story of American heiress Isabel as she visits Europe to find her own destiny, is pursued by suitors, and ultimately must make a tragic choice",
        "Category": " Fiction , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Mable Hoffman's Chocolate Cookery",
        "Authors": "By Hoffman, Mable",
        "Description": "Special decorating tips accompany recipes for creating chocolate pastries, puddings, candies, cookies, frostings, fillings, souffles, pies, cakes, and beverages",
        "Category": "",
        "Publisher": "HP Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1978"
        }
    },
    {
        "Title": "New Dimensions in Women's Health, Third Edition",
        "Authors": "By Alexander, Linda Lewis, Larosa, Judith H., Bader, Helaine, Garfield, Susan, and Alexander, Linda Lewis (EDT)",
        "Description": "",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Jones and Bartlett Publishers, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Abe Lincoln: The Young Years (Easy Biographies)",
        "Authors": "By Brandt, Keith and Lawn, John (ILT)",
        "Description": "The hardships he faced as a child and his early love of reading helped Lincoln on his way to becoming a sensitive lawyer and politician",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Troll Associates",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Sand Castle Contest",
        "Authors": "By Munsch, Robert N. and Martchenko, Michael (ILT)",
        "Description": "Bestselling team Robert Munsch and Michael Martchenko create another wacky adventure about a boy named Matthew who makes a sandcastle so real, that everyWhile on vacation. Matthew is excited to take part in the local sandcastle contest. The winner gets a bathtub filled with ice cream!But Matthew is just too good at building sand castles. The judges all think the house he builds, complete with sand chairs, a sand refrigerator, and sand food is real! He has to prove that it's all just a big pile of sand so he can win that ice cream!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Conversation Piece Recipes",
        "Authors": "By Neumann, Ruth Vendley",
        "Description": "",
        "Category": "",
        "Publisher": "Reilly & Lee Co.",
        "Price Starting With ($)": "24.26",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Donald Joins the Mounties",
        "Authors": "By Disney, Walt",
        "Description": "",
        "Category": "",
        "Publisher": "Stoddart+publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Major Problems in American Foreign Relations: Since 1914 : Documents and Essays (Major Problems in American History)",
        "Authors": "By Paterson, Thomas G. and Merrill, Dennis (EDT)",
        "Description": "",
        "Category": " Political Science , International Relations , General",
        "Publisher": "D.C. Heath",
        "Price Starting With ($)": "6.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Russia: Broken Idols, Solemn Dreams; Revised Edition",
        "Authors": "By Shipler, David K.",
        "Description": "An American journalist discusses life in modern Russia and shares the viewpoints of common citizens about their government, the U.S. and the quality of life in the Soviet Union",
        "Category": " History , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "With Heroic Truth: The Life of Edward R. Murrow",
        "Authors": "By Finkelstein, Norman H.",
        "Description": "Hired by the Columbia Broadcasting System in 1935 and promoted to director of CBS's European bureau on the eve of World War II, Murrow's innovative radio programming and straight forward, on-the-scene reporting style completely reshaped American coverage of European political events.",
        "Category": " Young Adult Nonfiction , Social Science , Sociology",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Christian Apologetics in a World Community",
        "Authors": "By Dryness, William A.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "The Intimate Journey: God in the Daily Adventure",
        "Authors": "By Warne, Joel",
        "Description": "",
        "Category": "",
        "Publisher": "Wellspring, Plymouth",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    }
]