[
    {
        "Title": "Treasury of Easter Celebrations",
        "Authors": "By Hogan, Julie (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Pharaoh - Volume II of Kleopatra",
        "Authors": "By Essex, Karen",
        "Description": "Journeying to Rome where her infant son can be officially recognized as Caesar's rightful heir, Kleopatra forms an intimate bond with Caesar's second-in-command, Antony, who wages war against Caesar's murderous nephew, Octavian, who would usurp the throne. By the author of Kleopatra. 30,000 first printing.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "French Lessons: A Novel",
        "Authors": "By Sussman, Ellen",
        "Description": "A single day in Paris changes the lives of three Americans as they each set off to explore the city with a French tutor, learning about language, love, and loss as their lives intersect in surprising ways.Josie, Riley, and Jeremy have come to the City of Light for different reasons: Josie, a young high school teacher, arrives in hopes of healing a broken heart. Riley, a spirited but lonely expat housewife, struggles to feel connected to her husband and her new country. And Jeremy, the reserved husband of a renowned actress, is accompanying his wife on a film shoot, yet he feels distant from her world. As they meet with their tutors—Josie with Nico, a sensitive poet; Riley with Phillippe, a shameless flirt; and Jeremy with the consummately beautiful Chantal—each succumbs to unexpected passion and unpredictable adventures. Yet as they traverse Paris’s grand boulevards and intimate, winding streets, they uncover surprising secrets about one another—and come to understand long-buried truths about themselves.",
        "Category": " Fiction , Women",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "The Gap Year",
        "Authors": "By Bird, Sarah",
        "Description": "From the widely praised author of The Yokota Officers Club and The Flamenco Academy, a novel as hilarious as it is heartbreaking about a single mom and her seventeen-year-old daughter learning how to let go in that precarious moment before college empties the nest. In The Gap Year, told with perfect pitch from both points of view, we meet Cam Lightsey, lactation consultant extraordinaire, a divorcée still secretly carrying a torch for the ex who dumped her, a suburban misfit who’s given up her rebel dreams so her only child can get a good education. We also learn the secrets of Aubrey Lightsey, tired of being the dutiful, grade-grubbing band geek, ready to explode from wanting her “real” life to begin, trying to figure out love with boys weaned on Internet porn.When Aubrey meets Tyler Moldenhauer, football idol–sex god with a dangerous past, the fuse is lit. Late-bloomer Aubrey metastasizes into Cam’s worst silent, sullen teen nightmare, a girl with zero interest in college. Worse, on the sly Aubrey’s in touch with her father, who left when she was two to join a celebrity-ridden nutball cult.As the novel unfolds—with humor, edge-of-your-seat suspense, and penetrating insights about love in the twenty-first century—the dreams of daughter, mother, and father chart an inevitable, but perhaps not fatal, collision . . .",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "The Silent Girl (Rizzoli & Isles)",
        "Authors": "By Gerritsen, Tess",
        "Description": "Lorraine Bracco loves The Silent Girl, saying \"She  did it to me again!  I can't get anything done when Tess puts out a new  book and this one caught me as I was starting work on Season 2 of  \"Rizzoli & Isles.\"  So instead of memorizing my lines, I was sucked  up into Boston's Chinatown with Jane, Maura, and company and could not  put this one down. Just like the other books. Every time.  And to top it off, now I have to wait for the NEXT one to come out--you're killing me, Tess!  So good...\"No one takes readers to the dark side and back with more razor-sharp jolts and sheer suspense than the storytelling master behind Ice Cold and The Keepsake. When New York Times bestselling author Tess Gerritsen has a tale to tell, put yourself in her expert hands—and prepare for the shocks and thrills that are certain to follow.Every crime scene tells a story. Some keep you awake at night. Others haunt your dreams. The grisly display homicide cop Jane Rizzoli finds in Boston’s Chinatown will do both.In the murky shadows of an alley lies a female’s severed hand. On the tenement rooftop above is the corpse belonging to that hand, a red-haired woman dressed all in black, her head nearly severed. Two strands of silver hair—not human—cling to her body. They are Rizzoli’s only clues, but they’re enough for her and medical examiner Maura Isles to make the startling discovery: that this violent death had a chilling prequel.Nineteen years earlier, a horrifying murder-suicide in a Chinatown restaurant left five people dead. But one woman connected to that massacre is still alive: a mysterious martial arts master who knows a secret she dares not tell, a secret that lives and breathes in the shadows of Chinatown. A secret that may not even be human. Now she’s the target of someone, or something, deeply and relentlessly evil.Cracking a crime resonating with bone-chilling echoes of an ancient Chinese legend, Rizzoli and Isles must outwit an unseen enemy with centuries of cunning—and a swift, avenging blade.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Sew & Quilt Japanese Quilt Decor",
        "Authors": "By Boerens, Trice",
        "Description": "Author and professional designer Trice Boerens unleashes the tranquil elegance of the East, in Japanese Quilt D?cor. Contemporary sewers are encouraged to devour a taste of the Orient?adding a touch of Japanese flair to their home d?cor?incorporating the luxurious distinctive look of these geometric designs in quilts, pillows, wall hangings, and scrolls.   Keeping the ease and versatility of Western techniques, these 17 projects challenge the conventional ideas of an art form born in the imperial courts?the art of coordinating patterns. Familiar building blocks such as the log cabin square and the four patch square combine with dramatic cottons and silk blends to create stunning quilts and accent pieces. Using traditional patchwork and hand appliqu? techniques, kimonos, cranes, and fans are pieced together for stunning simplistic compositions.",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Krause Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Swamplandia! (Vintage Contemporaries)",
        "Authors": "By Russell, Karen",
        "Description": "Thirteen-year-old Ava Bigtree has lived her entire life at Swamplandia!, her family’s island home and gator-wrestling theme park in the Florida Everglades. But when illness fells Ava’s mother, the park’s indomitable headliner, the family is plunged into chaos; her father withdraws, her sister falls in love with a spooky character known as the Dredgeman, and her brilliant big brother, Kiwi, defects to a rival park called The World of Darkness. As Ava sets out on a mission through the magical swamps to save them all, we are drawn into a lush and bravely imagined debut that takes us to the shimmering edge of reality.",
        "Category": " Fiction , Women",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Northwest Corner: A Novel",
        "Authors": "By Schwartz, John Burnham",
        "Description": "The New York Times Book Review called Reservation Road “a triumph,” and the novel was universally acclaimed. Now, in a brilliant literary performance by one of our most compelling and compassionate writers, John Burnham Schwartz reintroduces us to Reservation Road’s unforgettable characters in a superb new work of fiction that stands magnificently on its own. Northwest Corner is a riveting story about the complex, fierce, ultimately inspiring resilience of families in the face of life’s most difficult and unexpected challenges.Twelve years after a tragic accident and a cover-up that led to prison time, Dwight Arno, now fifty, is a man who has started over without exactly moving on. Living alone in California, haunted yet keeping his head down, Dwight manages a sporting goods store and dates a woman to whom he hasn’t revealed the truth about his past. Then an unexpected arrival throws his carefully neutralized life into turmoil and exposes all that he’s hidden.Sam, Dwight’s estranged college-age son, has shown up without warning, fleeing a devastating incident in his own life. In its way, Sam’s sense of guilt is as crushing as his father’s. As the two men are forced to confront their similar natures and their half-buried hopes for connection, they must also search for redemption and love. In turn, they dramatically transform the lives of the women around them: the ex-wives, mothers, and lovers they have turned to in their desperate attempts to somehow rewrite, outrun, or eradicate the past.Told in the resonant voices of everyday people gripped in the emotional riptide of lived life, Northwest Corner is at once tough and heart-lifting, an urgent, powerful story about family bonds that can never be broken and the wayward roads that lead us back to those we love.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.25",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Playing with Fire: Pakistan at War with Itself",
        "Authors": "By Constable, Pamela",
        "Description": "A volatile nation at the heart of major cultural, political, and religious conflicts in the world today, Pakistan commands our attention. Yet more than six decades after the country’s founding as a Muslim democracy, it continues to struggle over its basic identity, alliances, and direction. In Playing with Fire, acclaimed journalist Pamela Constable peels back layers of contradiction and confusion to reveal the true face of modern Pakistan.In this richly reported and movingly written chronicle, Constable takes us on a panoramic tour of contemporary Pakistan, exploring the fears and frustrations, dreams and beliefs, that animate the lives of ordinary citizens in this nuclear-armed nation of 170 million. From the opulent, insular salons of the elite to the brick quarries where soot-covered workers sell their kidneys to get out of debt, this is a haunting portrait of a society riven by inequality and corruption, and increasingly divided by competing versions of Islam.Beneath the façade of democracy in Pakistan, Constable reveals the formidable hold of its business, bureaucratic, and military elites—including the country’s powerful spy agency, the ISI. This is a society where the majority of the population feels powerless, and radical Islamist groups stoke popular resentment to recruit shock troops for global jihad. Writing with an uncommon ear for the nuances of this conflicted culture, Constable explores the extent to which faith permeates every level of Pakistani society—and the ambivalence many Muslims feel about the role it should play in the life of the nation.Both an empathic and alarming look inside one of the world’s most violent and vexing countries, Playing with Fire is essential reading for anyone wishing to understand modern Pakistan and its momentous role on today’s global stage.",
        "Category": " History , Asia , India & South Asia",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Then They Came for Me: A Family's Story of Love, Captivity, and Survival",
        "Authors": "By Bahari, Maziar and Molloy, Aimee (CON)",
        "Description": "THE BASIS FOR THE MAJOR MOTION PICTURE ROSEWATER, DIRECTED BY JON STEWARTWhen Maziar Bahari left London in June 2009 to cover Iran’s presidential election, he assured his pregnant fiancée, Paola, that he’d be back in just a few days, a week at most. Little did he know, as he kissed her good-bye, that he would spend the next three months in Iran’s most notorious prison, enduring brutal interrogation sessions at the hands of a man he knew only by his smell: Rosewater.For the Bahari family, wars, coups, and revolutions are not distant concepts but intimate realities they have suffered for generations: Maziar’s father was imprisoned by the shah in the 1950s, and his sister by Ayatollah Khomeini in the 1980s. Alone in his cell at Evin Prison, fearing the worst, Maziar draws strength from his memories of the courage of his father and sister in the face of torture, and hears their voices speaking to him across the years. He dreams of being with Paola in London, and imagines all that she and his rambunctious, resilient eighty-four-year-old mother must be doing to campaign for his release. During the worst of his encounters with Rosewater, he silently repeats the names of his loved ones, calling on their strength and love to protect him and praying he will be released in time for the birth of his first child.A riveting, heart-wrenching memoir, Then They Came for Me offers insight into the past seventy years of regime change in Iran, as well as the future of a country where the democratic impulses of the youth continually clash with a government that becomes more totalitarian with each passing day. An intimate and fascinating account of contemporary Iran, it is also the moving and wonderfully written story of one family’s extraordinary courage in the face of repression.Praise for Then They Came for Me“I really connected to Maziar’s story. It’s a personal story but one with universal appeal about what it means to be free.”—Jon Stewart“An important and elegant book . . . a prison memoir enlarged into a family history.”—The New Republic“Clear and compelling . . . engaging and informative—a gripping tribute to human dedication and a cogent indictment of a corrupt regime.”—Washington Independent Review of Books“Then They Came for Me is not only a fascinating, human exploration into Bahari’s personal experience . . . it also provides insight into the shared experience of those affected by repressive governments everywhere.”—Mother Jones“A damning account . . . Then They Came For Me turns a lens not only on Iran’s surreal justice system but on the history and culture that helped produce it.”—The Washington Post“Then They Came for Me is a unique achievement. It is a story not just of political cruelty (a subject Bahari treats movingly), but also about the two poles of Iranian political culture, bent together in upheaval.”—The Guardian(UK)“A beautifully written account of life in Iran, filled with insights not only into the power struggles and political machinations but into the personal, emotional lives of the people living in that complicated country. Maziar Bahari is a brave man and a wonderful storyteller.”—Fareed Zakaria",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Beachcombers: A Novel (Random House Reader's Circle)",
        "Authors": "By Thayer, Nancy",
        "Description": "Abbie Fox hasn’t seen her father or two younger sisters in almost two years. But now Lily, the baby of the family, is sending Abbie urgent emails begging her to return home. Their middle sister, Emma, has taken to her bed, devastated after losing her high-powered job and breaking up with her fiancé. Also, Lily is worried that the beautiful, enigmatic woman renting their guesthouse has set her sights on their widowed father. The Fox sisters closed ranks years ago after the haunting, untimely death of their mother, but seeing their dad move on with his life forces each of them to take stock.Over the course of the summer, the sisters’ lives grow as turbulent as the unpredictable currents off the New England coast: Abbie breaks her own rules in the name of love, type-A Emma learns a new definition of success, and strong-minded Lily must reconcile her dreams with reality. At summer’s end, these unforgettable women will face profound choices—and undergo personal transformations that will surprise even themselves.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "What Color Is Your Parachute? Guide to Job-Hunting Online, Sixth Edition: Blogging, Career Sites, Gateways, Getting Interviews, Job Boards, Job Search ... Resumes, Research Sites, Social Networking",
        "Authors": "By Bolles, Richard Nelson and Bolles, Mark Emery",
        "Description": "Before you start your Internet job-hunt, there are some things that you must know, like:   •   Why are job sites like Monster and CareerBuilder so stunningly ineffective?•   What can you do to make sure your resumes survive the elimination process? •   How do you find the information that search engines like Google can’t? •   How can you tell the difference between a genuinely helpful job board, and a website designed only to collect resumes?•   When are hobby forums more helpful than business networking sites?•   When is the Internet not helpful when job-hunting?•   What is the fatal flaw of all social networking sites? The Guide to Job-Hunting Online, 6th Edition, not only answers these questions and many more, but shows you how to comprehensively and effectively use the Internet for all aspects of your job-hunt. This companion to What Color Is Your Parachute?, the best-selling job-hunting book in the world, has been completely rewritten for our changing times and includes hundreds of updated website recommendations and descriptions. The Guide to Job-Hunting Online shows you how to quickly find the data that will be most helpful to you, how to identify and research the places where you will most enjoy working, how to leverage the power of social networking sites, and how to use your Internet time most effectively, avoiding the common pitfalls and setting you up for success.",
        "Category": " Computers , Online Services",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "The Jefferson Key: A Novel",
        "Authors": "By Berry, Steve",
        "Description": "Four United States presidents have been assassinated—in 1865, 1881, 1901, and 1963—each murder seemingly unrelated and separated by time.  But what if those presidents were all killed for the same reason: a clause in the United States Constitution—contained within Article 1, Section 8—that would shock Americans?    This question is what faces former Justice Department operative Cotton Malone in his latest adventure.  When a bold assassination attempt is made against President Danny Daniels in the heart of Manhattan, Malone risks his life to foil the killing—only to find himself at dangerous odds with the Commonwealth, a secret society of pirates first assembled during the American Revolution. In their most perilous exploit yet, Malone and Cassiopeia Vitt race across the nation and take to the high seas. Along the way they break a secret cipher originally possessed by Thomas Jefferson, unravel a mystery concocted by Andrew Jackson, and unearth a centuries-old document forged by the Founding Fathers themselves, one powerful enough—thanks to that clause in the Constitution—to make the Commonwealth unstoppable.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Conquistadora",
        "Authors": "By Santiago, Esmeralda",
        "Description": "An epic novel of love, discovery, and adventure by the author of the best-selling memoir When I Was Puerto Rican.As a young girl growing up in Spain, Ana Larragoity Cubillas is powerfully drawn to Puerto Rico by the diaries of an ancestor who traveled there with Ponce de León. And in handsome twin brothers Ramón and Inocente—both in love with Ana—she finds a way to get there. She marries Ramón, and in 1844, just eighteen, she travels across the ocean to a remote sugar plantation the brothers have inherited on the island. Ana faces unrelenting heat, disease and isolation, and the dangers of the untamed countryside even as she relishes the challenge of running Hacienda los Gemelos. But when the Civil War breaks out in the United States, Ana finds her livelihood, and perhaps even her life, threatened by the very people on whose backs her wealth has been built: the hacienda’s slaves, whose richly drawn stories unfold alongside her own. And when at last Ana falls for a man who may be her destiny—a once-forbidden love—she will sacrifice nearly everything to keep hold of the land that has become her true home.This is a sensual, riveting tale, set in a place where human passions and cruelties collide: thrilling history that has never before been brought so vividly and unforgettably to life.",
        "Category": " Fiction , Cultural Heritage",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "The Profession: A Thriller",
        "Authors": "By Pressfield, Steven",
        "Description": "The “master storyteller” (Publishers Weekly) and bestselling author of Gates of Fire, The Afghan Campaign, and Killing Rommel returns with a stunning, chillingly plausible near-future thriller about the rise of a privately financed and global military industrial complex. The year is 2032. The third Iran-Iraq war is over; the 11/11 dirty bomb attack on the port of Long Beach, California is receding into memory; Saudi Arabia has recently quelled a coup; Russians and Turks are clashing in the Caspian Basin; Iranian armored units, supported by the satellite and drone power of their Chinese allies, have emerged from their enclaves in Tehran and are sweeping south attempting to recapture the resource rich territory that had been stolen from them, in their view, by Lukoil, BP, and ExxonMobil and their privately-funded armies. Everywhere military force is for hire.  Oil companies, multi-national corporations and banks employ powerful, cutting-edge mercenary armies to control global chaos and protect their riches.  Even nation states enlist mercenary forces to suppress internal insurrections, hunt terrorists, and do the black bag jobs necessary to maintain the new New World Order.  Force Insertion is the world's merc monopoly. Its leader is the disgraced former United States Marine General James Salter, stripped of his command by the president for nuclear saber-rattling with the Chinese and banished to the Far East.  A grandmaster military and political strategist, Salter deftly seizes huge oil and gas fields, ultimately making himself the most powerful man in the world.  Salter's endgame is to take vengeance on those responsible for his exile and then come home...as Commander in Chief. The only man who can stop him is the novel's narrator, Gilbert \"Gent\" Gentilhomme, Salter's most loyal foot soldier and as close to him as the son Salter lost. As this action-jammed, lightning fast, and brutally realistic novel builds to its heart-stopping climax Gent launches his personally and professionally most desperate mission: to take out his mentor and save the United States from self destruction. Infused by a staggering breadth of research in military tactics and steeped in the timeless themes of the honor and valor of men at war that distinguish all of Pressfield’s fiction, The Profession is that rare novel that informs and challenges the reader almost as much as it entertains.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "An Introduction to Painting in Watercolor",
        "Authors": "By Harrison, Hazel",
        "Description": "Teaches the principles and techniques of watercolor painting, and applies them to the painting of landscapes, portraits, still lifes, nature, and buildings",
        "Category": " Art , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Before I Go to Sleep: A Novel",
        "Authors": "By Watson, S. J.",
        "Description": "“Thebest debut novel I’ve ever read.”—Tess Gerritsen,bestselling author of the Rizzoli & Isles series“Anexceptional thriller. It left my nerves jangling for hours after I finished thelast page.” —Dennis Lehane, New York Times bestselling author of Moonlight MileS. J. Watson makes his powerful debutwith this  compelling, fast-paced  psychological thriller,reminiscent of Shutter Island and Memento, in which an amnesiac who,following a mysterious accident, cannot remember her past or form newmemories, desperately tries to uncover the truth about who she is—and whoshe can trust.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Demonic: How the Liberal Mob Is Endangering America",
        "Authors": "By Coulter, Ann H.",
        "Description": "The demon is a mob, and the mob is demonic. The Democratic Party activates mobs, depends on mobs, coddles mobs, publicizes and celebrates mobs—it is the mob. Sweeping in its scope and relentless in its argument, Demonic explains the peculiarities of liberals as standard groupthink behavior. To understand mobs is to understand liberals.   In her most provocative book to date, Ann Coulter argues that liberals exhibit all the psychological characteristics of a mob, for instance:   Liberal Groupthink: “The same mob mentality that leads otherwise law-abiding people to hurl rocks at cops also leads otherwise intelligent people to refuse to believe anything they haven’t heard on NPR.”  Liberal Schemes: “No matter how mad the plan is—Fraternité, the ‘New Soviet Man,’ the Master Race, the Great Leap Forward, the Cultural Revolution, Building a New Society, ObamaCare—a mob will believe it.”  Liberal Enemies: “Instead of ‘counterrevolutionaries,’ liberals’ opponents are called ‘haters,’ ‘those who seek to divide us,’ ‘tea baggers,’ and ‘right-wing hate groups.’ Meanwhile, conservatives call liberals ‘liberals’—and that makes them testy.”  Liberal Justice: “In the world of the liberal, as in the world of Robespierre, there are no crimes, only criminals.”  Liberal Violence: “If Charles Manson’s followers hadn’t killed Roman Polanski’s wife, Sharon Tate, Clinton would have pardoned him, too, and he’d probably be teaching at Northwestern University.”   Citing the father of mob psychology, Gustave Le Bon, Coulter catalogs the Left’s mob behaviors: the creation of messiahs, the fear of scientific innovation, the mythmaking, the preference for images over words, the lack of morals, and the casual embrace of contradictory ideas.  Coulter traces the history of the liberal mob to the French Revolution and Robespierre’s revolutionaries (delineating a clear distinction from America’s founding fathers), who simply proclaimed that they were exercising the “general will” before slaughtering their fellow citizens “for the good of mankind.”  Similarly, as Coulter demonstrates, liberal mobs, from student radicals to white-trash racists to anti-war and pro-ObamaCare fanatics today, have consistently used violence to implement their idea of the “general will.”  This is not the American tradition; it is the tradition of Stalin, of Hitler, of the guillotine—and the tradition of the American Left.  As the heirs of the French Revolution, Democrats have a history that consists of pandering to mobs, time and again, while Republicans, heirs to the American Revolution, have regularly stood for peaceable order.  Hoping to muddy this horrifying truth, liberals slanderously accuse conservatives of their own crimes—assassination plots, conspiracy theorizing, political violence, embrace of the Ku Klux Klan. Coulter shows that the truth is the opposite: Political violence—mob violence—is always a Democratic affair. Surveying two centuries of mob movements, Coulter demonstrates that the mob is always destructive. And yet, she argues, beginning with the civil rights movement in the sixties, Americans have lost their natural, inherited aversion to mobs. Indeed, most Americans have no idea what they are even dealing with.              Only by recognizing the mobs and their demonic nature can America begin to defend itself.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Crown Forum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "The Nobodies Album",
        "Authors": "By Parkhurst, Carolyn",
        "Description": "Bestselling novelist Octavia Frost has just completed her latest book, a revolutionary novel in which she has rewritten the last chapters of all her previous books and removed clues about her personal life concealed within, especially the horrific tragedy that once befell her family.  But on her way to deliver the manuscript to her editor, Octavia learns that her estranged son, Milo, a famous musician, has been arrested for the murder of his girlfriend. Did she drive her son to violence? Did Milo murder anyone at all? And what exactly happened all those years ago? As the novel builds to a stunning reveal, Octavia must consider how this story will come to a close.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "The One That I Want: A Novel",
        "Authors": "By Scotch, Allison Winn",
        "Description": "When Tilly's seemingly perfect life starts changing around her, she must decide which is the life she wants-- the one she's carefully tended for decades or the one she never considered possible?Tilly Farmer is thirty-two years old and has the life she always dreamed of married to her high school sweetheart, working as a guidance counselor in her hometown and trying for a baby. Perfect. On the surface you might never know how tough things used to be. At seventeen, Tilly lost her mother to cancer, and while her father drowned his grief in alcohol, she was left to play parent to her two younger sisters rather than be a kid herself. Still Tilly never let tragedy overtake her belief that hard work and good cheer could solve any problem. Of course she’s also spent a lifetime plastering a smile on her face and putting everyone else’s problems ahead of her own. But that relentless happiness has served her well—her sisters are grown and content, her dad is ten years sober, and she’s helping her students achieve all their dreams while she and her husband, Tyler, start a family. A perfect life indeed.One sweltering afternoon at the local fair, everything changes when Tilly wanders into the fortune teller’s tent and is greeted by an old childhood friend, now a psychic. “I’m giving you the gift of clarity,” her friend says. “It’s what I always thought you needed.” Soon Tilly starts seeing things-- her father relapsing, staggering out of a bar and Tyler uprooting their happy, stable life, a packed U-Haul in the driveway. Even more disturbing, these visions start coming true. Suddenly Tilly’s perfect life, so meticulously mapped out, seems to be crumbling around her. And she’s not sure what’s more frightening: that she’s begun to see the future or what the future holds.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "The Ghost of Greenwich Village: A Novel",
        "Authors": "By Graham, Lorna",
        "Description": "In this charming fiction debut, a young woman moves to Manhattan in search of romance and excitement—only to find that her apartment is haunted by the ghost of a cantankerous Beat Generation writer in need of a rather huge favor.For Eve Weldon, moving to Greenwich Village is a dream come true. She’s following in the bohemian footsteps of her mother, who lived there during the early sixties among a lively community of Beat artists and writers. But when Eve arrives, the only scribe she meets is a grumpy ghost named Donald, and the only writing she manages to do is for chirpy segments on a morning news program, Smell the Coffee. The hypercompetitive network environment is a far cry from the genial camaraderie of her mother’s literary scene, and Eve begins to wonder if the world she sought has faded from existence. But as she struggles to balance her new job, demands from Donald to help him complete his life’s work, a budding friendship with a legendary fashion designer, and a search for clues to her mother’s past, Eve begins to realize that community comes in many forms—and that the true magic of the Village is very much alive, though it may reveal itself in surprising ways.",
        "Category": " Fiction , Women",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "I Still Dream About You: A Novel",
        "Authors": "By Flagg, Fannie",
        "Description": "NEW YORK TIMES BESTSELLERThe beloved Fannie Flagg is at her irresistible and hilarious best in I Still Dream About You, a comic mystery romp through the streets of Birmingham, Alabama, past, present, and future.Meet Maggie Fortenberry, a still beautiful former Miss Alabama. To others, Maggie’s life seems practically perfect—she’s lovely, charming, and a successful agent at Red Mountain Realty. Still, Maggie can’t help but wonder how she wound up living a life so different from the one she dreamed of as a child. But just when things seem completely hopeless, and the secrets of Maggie’s past drive her to a radical plan to solve it all, Maggie discovers, quite by accident, that everybody, it seems, has at least one little secret.I Still Dream About You is a wonderful novel that is equal parts southern charm, murder mystery, and that perfect combination of comedy and old-fashioned wisdom that can be served up only by America’s own remarkable Fannie Flagg.",
        "Category": " Fiction , Women",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Betty Crocker's Cake Decorating with Cake Recipes for Every occasion",
        "Authors": "By Crocker, Betty",
        "Description": "Detailed decorating instructions and step-by-step photos and sketches highlight these 125 diverse recipes for occasions including weddings, anniversaries, holidays, gifts, entertaining, birthdays, and showers",
        "Category": " Cooking , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Brothel: Mustang Ranch and Its Women",
        "Authors": "By Albert, Alexa",
        "Description": "A female doctor chronicles her observations of and eye-opening interviews with the women living and working as legal prostitutes at Mustang Ranch, the nation's largest brothel. 30,000 first printing.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Dog Who Came in from the Cold (Corduroy Mansions Series)",
        "Authors": "By McCall Smith, Alexander and McIntosh, Iain (ILT)",
        "Description": "CORDUROY MANSIONS - Book 2In the Corduroy Mansions series of novels, set in London’s hip Pimlico neighborhood, we meet a cast of charming eccentrics, including perhaps the world’s most clever terrier, who make their home in a handsome, though slightly dilapidated, apartment block.The heartwarming and hilarious new installment in the Corduroy Mansions series presents the further adventures of Alexander McCall Smith’s newest beloved character: the Pimlico terrier Freddie de la Hay.In the elegantly crumbling mansion block in Pimlico called Corduroy Mansions, the comings and goings of the wonderfully motley crew of residents continue apace. A pair of New Age operators has determined that Terence Moongrove’s estate is the cosmologically correct place for their center for cosmological studies. Literary agent Barbara Ragg has decided to represent Autobiography of a Yeti, purportedly dictated to the author by the Abominable Snowman himself. And our small, furry, endlessly surprising canine hero Freddie de la Hay—belonging to failed oenophile William French—has been recruited by MI6 to infiltrate a Russian spy ring. Needless to say, the other denizens of Corduroy Mansions have issues of their own. But all of them will be addressed with the wit and insight into the foibles of the human condition that have become the hallmark of this peerless storyteller.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Corduroy Mansions (Corduroy Mansions Series)",
        "Authors": "By McCall Smith, Alexander and McIntosh, Iain (ILT)",
        "Description": "CORDUROY MANSIONS - Book 1 In the Corduroy Mansions series of novels, set in London’s hip Pimlico neighborhood, we meet a cast of charming eccentrics, including perhaps the world’s most clever terrier, who make their home in a handsome, though slightly dilapidated, apartment block. Corduroy Mansions is the affectionate nickname given to a genteel, crumbling mansion block in London’s vibrant Pimlico neighborhood and the home turf of a captivating collection of quirky and altogether McCall-Smithian characters. There’s the middle-aged wine merchant William, who’s trying to convince his reluctant twenty-four-year-old son, Eddie, to leave the nest; and Marcia, the boutique caterer who has her sights set on William. There’s also the (justifiably) much-loathed Member of Parliament Oedipus Snark; his mother, Berthea, who’s writing his biography and hating every minute of it; and his long-suffering girlfriend, Barbara, a literary agent who would like to be his wife (but, then, she’d like to be almost anyone’s wife). There’s the vitamin evangelist, the psychoanalyst, the art student with a puzzling boyfriend and Freddie de la Hay, the Pimlico terrier who insists on wearing a seat belt and is almost certainly the only avowed vegetarian canine in London. Filled with the ins and outs of neighborliness in all its unexpected variations, Corduroy Mansions showcases the life, laughter and humanity that have become the hallmarks of Alexander McCall Smith’s work.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Smokin' Seventeen (Stephanie Plum)",
        "Authors": "By Evanovich, Janet",
        "Description": "Where there’s smoke there’s fire, and no one knows this better than New Jersey bounty hunter Stephanie Plum.  Dead bodies are showing up in shallow graves on the empty construction lot of Vincent Plum Bail Bonds. No one is sure who the killer is, or why the victims have been offed, but what is clear is that Stephanie’s name is on the killer’s list.Short on time to find evidence proving the killer’s identity, Stephanie faces further complications when her family and friends decide that it’s time for her to choose between her longtime off-again-on-again boyfriend, Trenton cop Joe Morelli, and the bad boy in her life, security expert Ranger. Stephanie’s mom is encouraging Stephanie to dump them both and choose a former high school football star who’s just returned to town. Stephanie’s sidekick, Lula, is encouraging Stephanie to have a red-hot boudoir “bake-off.” And Grandma Bella, Morelli’s old-world grandmother, is encouraging Stephanie to move to a new state when she puts “the eye” on Stephanie.With a cold-blooded killer after her, a handful of hot men, and a capture list that includes a dancing bear and a senior citizen vampire, Stephanie’s life looks like it’s about to go up in smoke.The hardcover edition of Smokin’ Seventeen contains two smokin’ hot stickers inside!",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Dreams of Joy: A Novel (Shanghai Girls)",
        "Authors": "By See, Lisa",
        "Description": "In her beloved New York Times bestsellers Snow Flower and the Secret Fan, Peony in Love, and, most recently, Shanghai Girls, Lisa See has brilliantly illuminated the potent bonds of mother love, romantic love, and love of country. Now, in her most powerful novel yet, she returns to these timeless themes, continuing the story of sisters Pearl and May from Shanghai Girls, and Pearl’s strong-willed nineteen-year-old daughter, Joy.Reeling from newly uncovered family secrets, and anger at her mother and aunt for keeping them from her, Joy runs away to Shanghai in early 1957 to find her birth father—the artist Z.G. Li, with whom both May and Pearl were once in love. Dazzled by him, and blinded by idealism and defiance, Joy throws herself into the New Society of Red China, heedless of the dangers in the communist regime. Devastated by Joy’s flight and terrified for her safety, Pearl is determined to save her daughter, no matter the personal cost. From the crowded city to remote villages, Pearl confronts old demons and almost insurmountable challenges as she follows Joy, hoping for reconciliation. Yet even as Joy’s and Pearl’s separate journeys converge, one of the most tragic episodes in China’s history threatens their very lives.Acclaimed for her richly drawn characters and vivid storytelling, Lisa See once again renders a family challenged by tragedy and time, yet ultimately united by the resilience of love.",
        "Category": " Fiction , Cultural Heritage",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "The Devil Colony: A Sigma Force Novel (Sigma Force Novels, 6)",
        "Authors": "By Rollins, James",
        "Description": "“Every James Rollins delivers mach-speed mayhem; throat-clutching suspense; high-style adventure; and a terrific story told terrifically. He makes the rest us look bad.”—Steve Berry, author of The Emperor’s Tomb“This guy doesn’t write novels—he builds roller coasters.”—BooklistNew York Times bestselling thrill-master James Rollins is back with The Devil Colony, another electrifying combination of suspense, history, science, action, and ingenious speculation. In The Devil Colony, Sigma Force stalwarts Painter Crowe and Commander Grayson Pierce must investigate a gruesome massacre in the Rocky Mountains and root out a secret cabal that has been manipulating momentous events since the time of the original thirteen colonies. Once again, Rollins delivers a spine-tingler that will leave fans of Michael Crichton, The Da Vinci Code, and Indiana Jones breathless—as he exposes the dark truth behind the founding of America.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Conspiracy : History's Greatest Plots, Conclusions And Cover-ups",
        "Authors": "By Charlotte Grieg",
        "Description": "",
        "Category": "",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Animal Behavior (UNDERSTANDING SCIENCE AND NATURE)",
        "Authors": "By",
        "Description": "Presents in question and answer format information about the behavior of a wide variety of creatures, ranging from the paramecium to the chimpanzee",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Time-Life for Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Call To Home: African-Americans Reclaim The Rural South",
        "Authors": "By Stack, Carol B.",
        "Description": "The long-awaited new book by the author of the bestselling All Our Kin is a poignant saga of a reverse exodus: the return of half a million black Americans to the rural South.There have been many books focusing on the black migration out of the South into Northern cities. But few people are aware that over the past 20 years the trend has been in the other direction, with African-Americans moving back south, to some of the least promising places in all of America&#151;places the Department of Agriculture calls &#147;Persistent Poverty Counties.” Carol Stack brings their stories to life in this captivating book. Interweaving a powerful human story with a larger economic and social analysis of migration, poverty, and the urban underclass, Call to Home offers a rare glimpse of African-American families pulling together and trying to make it in today&#39;s America.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "The Ten Commandments #8016",
        "Authors": "By Jones, Mary Alice (Ed. )",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally and CO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Creative Serging: The Complete Handbook for Decorative Overlock Sewing, Book 2",
        "Authors": "By Palmer, Pati, Brown, Gail, and Green, Sue",
        "Description": "",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Palmer Pletsch Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "The Shaker Cookbook",
        "Authors": "By Piercy, Caroline B.",
        "Description": "Over 240 recipes representing the best of Shaker cooking, which focuses on using America's natural bounty.  With black and white illustrations throughout as well as stories of Shaker life and history, this is a unique book that celebrates easy, natural, American cooking.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Thy Gold to Refine (Work and the Glory, Volume 4)",
        "Authors": "By Lund, Gerald N.",
        "Description": "",
        "Category": " Fiction , Sagas",
        "Publisher": "Bookcraft Pubs",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Gary R. Gruber's Inside Strategies for the New Sat 1",
        "Authors": "By Gruber, Gary R.",
        "Description": "",
        "Category": " Study Aids , SAT",
        "Publisher": "Educational Design",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Kate and the Spies: The American Revolution (1775) (Sisters in Time #6)",
        "Authors": "By Grote, Joann A.",
        "Description": "Time Period:  1775  When Kate Milton and her cousin happen across the Boston Tea Party, they unwittingly step into the midst of the American Revolution. The eleven-year-old girl finds herself pulled deeper into the conflict by members of her own family-by those who support the Patriot's revolutionary cause and those who believe the colonies should submit to the King in England. When her cousin begins to spy for the Patriots, what should she do? Kate and the Spies uses actual historical events to tell a compelling fictional story-of a girl who must determine the right course of action in a confused and difficult time.",
        "Category": " Juvenile Fiction , Historical , United States , Colonial & Revolutionary Periods",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Billy Bully",
        "Authors": "By Galan, Ana, Galan, Alvaro, and Simpson, Steve (ILT)",
        "Description": "In this funny counting book, Billy Bully learns what it means to be a good friend.\"When Billy Bully comes to playhe always takes the fun away.\"As Billy Bully does one rotten thing after another, his friends dwindle to zero.  With a little effort, Billy Bully realizes that a real friend doesn't think only of himself.  Kids will love to count down--and most importantly--back up, as Billy Bully makes it up to his friends and gets the whole gang back together!",
        "Category": " Juvenile Fiction , Social Themes , Bullying",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The Book of Mormon: An Account Written By The Hand of Mormon Upon Plates Taken F",
        "Authors": "By Joseph Smith, Jr. (Translator)",
        "Description": "",
        "Category": "",
        "Publisher": "Church of Jesus Christ of Latter Day Saints, Salt Lake City, Utah",
        "Price Starting With ($)": "6.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Walking the Big Wild: From Yellowstone to the Yukon on the Grizzle Bears' Trail",
        "Authors": "By Heuer, Karsten",
        "Description": "A wildlife biologist and park warden describes his eventful eighteen-month journey with a remarkable border collie named Webster from Yellowstone National Park in Wyoming to the Canadian Yukon by hiking, skiing, and paddling across mountains, forests, and rivers. Original.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Braided River",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Heiress of Water: A Novel",
        "Authors": "By Barron, Sandra Rodriguez",
        "Description": "When young Monica Winters Borrero loses her luminous mother in an accident at sea, she is exiled from the tropical paradise that was her home. Grieving and cut off from a life among El Salvador's elite, Monica and her American father move to Connecticut, vowing never to look back.Years later, an intriguing stranger, who has endured a terrible loss of his own, enters Monica's life, bearing an unusual request. Monica is propelled back to her lost world, retracing the shadowy last days of her mother, a marine scientist who had been on the brink of understanding the therapeutic applications of a rare, venomous sea creature. Now, her research is being corrupted by a secret clinic that claims the power to restore consciousness to the comatose.What Monica discovers will shatter the family's delicate truce with the past, and compel everyone involved to challenge their deepest notions of what it means to be alive. Atmospheric, thought-provoking, and timely. The Heiress of Water is a stunning parable of paradise lost and found.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "TeacherLaughs: A Jollytologist Book: Quips, Quotes, and Anecdotes about the Classroom",
        "Authors": "By Klein, Allen (EDT)",
        "Description": "TeacherLaughs is filled with hilarious and witty anecdotes about teaching and learning from the preschool classroom to the college lecture hall. These selections from comedians and notable personalities including Milton Berle, Ellen Degeneres, and Robin Williams, as well as less well-known teachers and students, tackle subjects like forgotten homework, students who misbehave, and the dreaded parent-teacher conference.Award-winning professional speaker and therapeutic humor expert “Mr. Jollytologist” Allen Klein has carefully selected these lighthearted quips, quotes, and anecdotes to keep teachers, parents, and students laughing through it all. This wonderful volume will help teachers maintain patience, compassion, and, most important, a sense of humor, day in and day out, through rewarding moments and less rewarding ones, from homeroom until the dismissal bell.College professor–someone who talks in other people’s sleep.Bergen Evans  Stand firm in your refusal to remain conscious during algebra. In real life, I assure you, there is no such thing as algebra.Fran Lebowitz When a teacher calls a boy by his entire name, it means trouble.Mark Twain",
        "Category": " Humor , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Brain Jack",
        "Authors": "By Falkner, Brian",
        "Description": "Another terrifying sci-fi page-turner from the author of The Tomorrow Code!Las Vegas is gone—destroyed in a terrorist attack. Black Hawk helicopters patrol the skies over New York City. And immersive online gaming is the most dangerous street drug around. In this dystopic near-future, technology has leapt forward once again, and neuro-headsets have replaced computer keyboards. Just slip on a headset, and it’s the Internet at the speed of thought.For teen hacker Sam Wilson, a headset is a must. But as he becomes familiar with the new technology, he has a terrifying realization. If anything on his computer is vulnerable to a hack, what happens when his mind is linked to the system? Could consciousness itself be hijacked? Before he realizes what’s happened, Sam’s incursion against the world’s largest telecommunications company leads him to the heart of the nation’s cyberdefense network and brings him face to face with a terrifying and unforeseen threat.Brian Falkner, author of The Tomorrow Code, has created an action-packed and thought-provoking science fiction adventure in which a brilliant young computer hacker fights to prevent the human race from being deleted.Fans of Cory Doctorow’s Little Brother and M. T. Anderson’s Feed will love this high-octane techno thriller.",
        "Category": " Young Adult Fiction , Science Fiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Hurricanes, tornadoes, and blizzards",
        "Authors": "By Hitte, Kathryn",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Biggest Book of Slow Cooker Recipes (Better Homes and Gardens Cooking)",
        "Authors": "By Better Homes and Gardens Books, Smothermon, Chuck (EDT), and Holcomb, Carrie (EDT)",
        "Description": "Great value—hundreds of tested and perfected recipes, informative tips, plus two bonus chapters—all-in-one economical resource for time-crunched cooks from the brand they know and trust.More than 400 recipes for appetizers, beverages, soups, stews, main dishes, and desserts.Bonus chapters offer 5-Ingredient Recipes and One-Dish Meals.Plenty of timesaving tips and advice for smoother meal prep.Easy-to-follow format.",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Meredith Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Sweetsmoke",
        "Authors": "By Fuller, David",
        "Description": "\"David Fuller vividly and movingly describes the life of Cassius, a slave on a Virginia tobacco plantation. Meticulously researched and beautifully written, Sweetsmoke resonates with unforgettable characters and is a gripping story of loss and survival.\"--Robert Hicks, author of The Widow of the South\"Sweetsmoke is a fascinating and gripping novel about the Civil War. The slave, Cassius Howard, is a great fictional character, and his story is part mystery, part love story, and a harrowing portrait of slavery that reads with the immense power of the slave narratives. A tour de force for David Fuller.\"--Pat Conroy, author of Beach Music and South of Broad\"With Sweetsmoke, David Fuller gives an extraordinarily nuanced, privileged, and convincing view of the world of slavery during the American Civil War, and of the hearts and minds of the men and women who had to live in that world.\"--Madison Smartt Bell, author of All Souls' Rising and Toussaint LouvertureThe year is 1862, and the Civil War rages through the South. On a Virginia tobacco plantation, another kind of battle soon begins. There, Cassius Howard, a skilled carpenter and slave, risks everything--punishment, sale to a cotton plantation, even his life--to learn the truth concerning the murder of Emoline, a freed black woman, a woman who secretly taught him to read and once saved his life. It is clear that no one cares about her death in the midst of a brutal and hellish war. No one but Cassius, who braves horrific dangers to escape the plantation and avenge her loss.As Cassius seeks answers about Emoline's murder, he finds an unexpected friend and ally in Quashee, a new woman brought over from another plantation; and a formidable adversary in Hoke Howard, the master he has always obeyed.With subtlety and beauty, Sweetsmoke captures the daily indignities and harrowing losses suffered by slaves, the turmoil of a country waging countless wars within its own borders, and the lives of those people fighting for identity, for salvation, and for freedom.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Zac Attack: An Unauthorized Biography",
        "Authors": "By Norwich, Grace",
        "Description": "A biography of the American actor known for portraying Cameron Bale in the Warner Brothers series \"Summerland.\"",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Fishes and how they live (Golden library of knowledge)",
        "Authors": "By George S. Fichter",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Mrs Mouses Vacation and Other Stories",
        "Authors": "By Parr, Dempsey",
        "Description": "",
        "Category": "",
        "Publisher": "Dempsey Parr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Aerospace Power a Pictoral Guide",
        "Authors": "By Coombs, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Ireland Since the Famine",
        "Authors": "By Lyons, F. S. L",
        "Description": "",
        "Category": " History , Europe , Great Britain",
        "Publisher": "Harpercollins Pub Ltd",
        "Price Starting With ($)": "5.11",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Enriching Children, Enriching the Nation: Public Investment in High-Quality Prekindergarten",
        "Authors": "By Lynch, Robert G.",
        "Description": "Lynch (Washington College) analyzes the governmental costs and benefits of public investment in a targeted pre-kindergarten education program serving the poorest 25% of children versus a universal pre-kindergarten education program available to all toddlers. The study estimates yearly expenditures and revenue impacts through 2050 as well as the earnings and crime implications for individuals and society. No index is provided. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Preschool & Kindergarten",
        "Publisher": "Economic Policy Institute",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Code Z",
        "Authors": "By Swerdlow, Joel",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "6.33",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Bulpington of Blup",
        "Authors": "By H G Wells",
        "Description": "",
        "Category": "",
        "Publisher": "MacMillan Company",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1933"
        }
    },
    {
        "Title": "Principles of Macroeconomics",
        "Authors": "By Taylor, John B.",
        "Description": "",
        "Category": " Business & Economics , Economics , Macroeconomics",
        "Publisher": "Houghton Mifflin College Div",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The All-American Quote Book",
        "Authors": "By Phillips, Bob and Reagan, Michael",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Southern Living: Our Readers Top-Rated Recipes",
        "Authors": "By Gentry, Jane E. (EDT)",
        "Description": "Representing a wide array of favorite recipes, selected by readers and home cooks from the pages of Southern Living magazine, a taste-tempting cookbook features more than four hundred winning recipes for every occasion, accompanied by reader reviews and a list of Top 10 all-time winners. 80,000 first printing.",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "More Strange Tales of the Civil War",
        "Authors": "By Sanders, Michael",
        "Description": "More Strange Tales of the Civil War presents readers with more predictions, coincidences, medical oddities, and other bizarre events of the Civil War: Wounded soldiers fight off hungry hogs on the Wheatfield at Gettysburg.After participating in Sherman’s famous March to the Sea, a soldier witnesses a murder in a dream months before it happens.During the Battle of Antietam the position of a gun saves Lee and Longstreet and changes the course of history. Two opposing generals never meet in battle but by strange coincidence finally meet years later at a Shiloh cyclorama.A future Pennsylvania governor and president of Pennsylvania State University is saved in battle by a pencil.While walking the field after the Battle at Gettysburg, a reverend observes a contrast in the condition of Union and Confederate soldiers’ corpses.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Burd Street Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "God Is Never Late; He's Seldom Early; He's Always Right On Time",
        "Authors": "By Toler, Stan",
        "Description": "",
        "Category": " Religion , Christian Ministry , Evangelism",
        "Publisher": "Beacon Hill Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "States of Grace",
        "Authors": "By Francis Steegmuller",
        "Description": "",
        "Category": "",
        "Publisher": "Reynal & Hitchcock",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "Mothers and Other Liars",
        "Authors": "By Bourret, Amy",
        "Description": "How far will a mother go to save her child? Ten years ago, Ruby Leander was a drifting nineteen-year-old who made a split-second decision at an Oklahoma rest stop. Fast forward nine years: Ruby and her daughter Lark live in New Mexico. Lark is a precocious, animal loving imp, and Ruby has built a family for them with a wonderful community of friends and her boyfriend of three years. Life is good. Until the day Ruby reads a magazine article about parents searching for an infant kidnapped by car-jackers. Then Ruby faces a choice no mother should have to make. A choice that will change both her and Lark's lives forever.",
        "Category": " Fiction , Family Life",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "The Miracles of Jesus (Discovery Channel)",
        "Authors": "By Roberts, Michael Symmons",
        "Description": "Recounts the miracles of Jesus on first-century believers in order to explain the hidden meanings within those acts and how they are still significant today.",
        "Category": " Religion , Christianity , History",
        "Publisher": "Baker Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Understanding the Presidency",
        "Authors": "By Davidson, Roger H., Pfiffner, James P, Pfiffner, James P. (EDT), and Davidson, Roger H. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Longman Pub Group",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Where Is Baby's Christmas Present?: A Lift-the-Flap Book (Karen Katz Lift-the-Flap Books)",
        "Authors": "By Katz, Karen",
        "Description": "Baby is looking everywhere for the Christmas present—but where can it be? Little ones will love lifting the large, sturdy flaps to reveal special, holiday surprises: Christmas cookies, candy canes, ornaments, and more! Babies are sure to love this Christmas treat!6 5/8 X 7 3/8 board book has rounded corners. Includes 6 large, sturdy flaps.",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Church Growth Handbook: Includes Complete Ministry Audit",
        "Authors": "By Easum, William M.",
        "Description": "Here are twenty tested church-growth strategies that have been implemented by church consultant William Easum with more than 4,000 church leaders across the United States and Canada.The Church Growth Handbook provides diagnostic tools, which now can be used withThe Complete Ministry Audit, also by Easum.",
        "Category": " Religion , Christian Church , Administration",
        "Publisher": "Abingdon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Uncommon Uses for Common Household Products",
        "Authors": "By Publishing, FC& A",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Great American Convertibles",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Speaker's Book of Quotations",
        "Authors": "By Dormann, Henry O. (EDT)",
        "Description": "Gathers quotations and brief anecdotes concerning age, art, business, children, education, food, friendship, the law, men, women, money, war, peace, retirement, television, and wealth",
        "Category": " Reference , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Blissful Brownies",
        "Authors": "By Love Food",
        "Description": "",
        "Category": " Cooking , Methods , Baking",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Y'all Come Eat",
        "Authors": "By Deen, Jamie, Deen, Bobby, Clark, Melissa, and Deen, Paula H. (FRW)",
        "Description": "This one-of-a-kind cookbook features simple, yet irresistible recipes for weeknight meals, laid-back gatherings, potlucks, picnics, tailgating parties and more from the Deen brothers.  • Chapters spotlight the Deen brothers' specialties—from Bobby's all-time favorite goulash to Jamie's amazing cheeseburger pies. • Fresh and upbeat, it's spiced up with lively Deen brothers' tidbits and stories giving you an inside look at their lives. • Deen family photos and recent photos of the brothers shaking it up in the kitchen with family and friends add a special touch.",
        "Category": " Cooking , General",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Little Book of Mother Teresa",
        "Authors": "By Sangeet Duchane",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Child Analyst at Work",
        "Authors": "By Geleerd, Elisabeth R.",
        "Description": "",
        "Category": " Psychology , Movements , Psychoanalysis",
        "Publisher": "Intl Universities Pr Inc",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "December",
            "Year": "1967"
        }
    },
    {
        "Title": "Research in Psychotherapy.",
        "Authors": "By Meltzoff, Julian & Kornreich, Melvin",
        "Description": "",
        "Category": "",
        "Publisher": "Atherton Press",
        "Price Starting With ($)": "13.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Politics Moves Online: Campaigning and the Internet (Century Foundation Report)",
        "Authors": "By Cornfield, Michael",
        "Description": "The popularization of the Internet has shepherded a revolution in business and personal communication. But how has online technology been used in mainstream American politics? In Politics Moves Online, Michael Cornfield provides a comprehensive guide to how the Internet has been used in political campaigns. He shows, for example, how candidates such as George Bush and John McCain in 2000&#151;as well as political action committees and the media&#151;struggled to figure out how to fit the Internet into their ongoing operations. Through a series of insightful cases, he examines how candidates use the Web as a campaign tool and as a fund-raising mechanism, and how voters use the Internet to gather information and become more knowledgeable voters. He finds that while many political pundits have argued that the Internet can be a revolutionary force in politics, citizens and politicians alike have yet to find innovative uses that go beyond conventional political operations.",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "The Century Foundation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Book of Days: A Novel",
        "Authors": "By Rubart, James L.",
        "Description": "\"… in Your book all my days were recorded, even those which were purposed before they had come into being.\" —Psalm 139:16 Young Cameron Vaux’s mind is slipping. Memories of his wife, killed two years earlier in a car accident, are vanishing just as his dad predicted they would. Memories he knows he has to remember. His father tells Cameron that to save his mind he must find \"the book with all days in it\" —the past and future record of every soul on earth. When an obscure clue leads Cameron to a small central Oregon town, he meets enigmatic Taylor Stone, a possible guide to finding the book who seems to carry secrets far deeper than anyone imagines. Local hotshot TV personality Ann Bannister thinks the legend of the book is a farce, but she has her reasons to join Cameron’s search anyway. Finally, there is fanatical New Age guru Jason Judah, who will stop at nothing to find the book of days before Cameron does.Acclaim for Book of Days:\"I devoured Book of Days in one sitting. It is an exciting but poignant novel about how truly important our memories and choices are to who we become. It's still resonating in my heart.\"Colleen Coble, best-selling author of The Lightkeeper's Bride\"Book of Days is actually better than Rubart's best-selling debut, Rooms . . . a terrific story that is equal parts fast-paced thriller, thought-provoking allegory, and moving drama.\"Rick Acker, author of When the Devil Whistles\"James L. Rubart is officially now one of my favorite writers. Book of Days is a great read, why people buy novels.\"Dan Walsh, award-winning author of The Unfinished Gift\"Rubart has created a page-turner.\"Publishers Weekly\"Well crafted and full of plot twists and turns. It will appeal to fans of Ted Dekker.\"Library Journal\"Rubart is one of my favorite new authors . . . a master storyteller with his second release as good as or better than Rooms, his debut release.\"Examiner.com (Seattle)\"Rubart is one of my favorite new authors. His writing is poignant, his characterizations skillful, and his plotting incredible.\"The Suspense Zone",
        "Category": " Fiction , Christian , Suspense",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Recipes for Fat Free Living Cookbook: Fat Free Desserts : Every Recipe Under 1 Gram of Fat Per Serving",
        "Authors": "By Steinback, Jyl",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Fat Free Living Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Kid's Cookbook: A Great Book for Kids Who Love to Cook!",
        "Authors": "By Williams, Chuck (EDT), Dodge, Abigail Johnson, Beisch, Leigh (PHT), and Beisch, Leigh (ILT)",
        "Description": "Provides more than fifty easy-to-follow recipes for menus that cover breakfast and lunch, dinner, side dishes, snacks, and desserts.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Homeowner's Guide To Energy Independence Alternative Power Sources for the Average American",
        "Authors": "By Christine Woodside",
        "Description": "",
        "Category": "",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Technology And Change In East-west Relations (East-West Monograph Series, No 6)",
        "Authors": "By Larrabee, F. Stephen (EDT)",
        "Description": "",
        "Category": " Business & Economics , International , Economics",
        "Publisher": "Westview Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Europe and the British Health Service",
        "Authors": "By Donald William Wade",
        "Description": "",
        "Category": "",
        "Publisher": "Bedford Square Press of the National Council of Social Service : distributed by Research Publications Services",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Ephesians: Wholeness for a Broken World (A Lifeguide Bible Study)",
        "Authors": "By Le Peau, Phyllis J. and Le Peau, Andrew T.",
        "Description": "",
        "Category": " Religion , Biblical Studies , New Testament",
        "Publisher": "Intervarsity Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Naked at the Window: A Harpur & Iles Mystery",
        "Authors": "By James, Bill",
        "Description": "Big drug dealer Ralph Ember stumbles on a ghastly surprise when he and sidekick Beau Derek arrive  at the house of yachtsman Barney Coss, his bulk  supplier: Barney and his two women have been  savagely murdered—and the murderers, three drug  rivals from London, are still in the house. Beau dies quickly at their hands; they let Ralph  go—for the moment—but he's a marked man because of what he's seen. When Melanie, Beau's  alluring, ruthless girlfriend, learns what has  happened, she is bent on revenge and wants Ralph as her partner—all the way.Bill James's latest Harpur & Iles police procedural ratchets up  the tension as the cops (the brilliant Detective Chief Superintendent Colin Harpur and his  ungovernable, half-cracked superior, Assistant  Chief Constable Desmond Iles) fight the drug  barons for control of the city. As a body washes up, and one of the London creeps meets a violent  end, the wily Ralph finds himself starting a  new, very risky career—and Harpur sorts out  what's going on just in time.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "High School Bites: The Lucy Chronicles",
        "Authors": "By Conrad, Liza",
        "Description": "Lucy Hellenberg is not your typical Pacific Cedar High student. Because in between hanging out with her friends, hating her hair and her math teacher, and trying to decide whether she should dump her on-again off-again boyfriend, she has to deal with a father who refuses to go outside and a house that bears way too much resemblance to the set of The Munsters.  And that's not all. Lucy has just discovered that she's a descendent of the lovely Lucy in Bram Stoker's Dracula-and that vampires really do exist (right here at Pacific Cedar High!). Now, she has to accessorize her homecoming dress with a necklace of garlic and learn how to drive while driving away vampires-without becoming their next victim.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Learn to Draw; Apprendre A Dessiner; Aprender A Dibujar",
        "Authors": "By Gnagy, Jon",
        "Description": "",
        "Category": "",
        "Publisher": "Martin F Weber Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Teddy Bear Cut & Use Stencils: 76 Full-Size Stencils Printed on Durable Stencil Paper",
        "Authors": "By Menten, Ted",
        "Description": "76 black-and-white stencils celebrate teddy's 80th birthday. Illustrations include images of teddy at a birthday party, ice-skating, playing baseball, hanging a holly wreath, working in the kitchen, and much more. Includes male and female teddies as well as a sprinkling of Koalas and Pandas. Several sizes. Complete stencil instruction. Introduction.",
        "Category": " Crafts & Hobbies , Stenciling",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "The Story of Scotland",
        "Authors": "By Tranter, Nigel G.",
        "Description": "",
        "Category": " History , Europe , Great Britain",
        "Publisher": "Neil Wilson Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2012"
        }
    },
    {
        "Title": "Checklist For Life For Moms",
        "Authors": "By Checklist for Life",
        "Description": "Checklist for Life is the ultimate handbook for living a successful, joy-filled life.Checklist for Life for Moms offers insight into issues that are specific to the challenges moms face every day. In addition to a brief narrative, each chapter of this interactive handbook features:An \"I Will\" checklist of heart and attitude reinforcements. A \"Things to Do\" checklist of action points.A \"Things to Remember\" section of Scripture verses and applicable quotes from famous and not-so-famous peopleTopics addressed include time management, sibling rivalry, career decisions, and family rules, to name a few. In all, there are insightful narratives, Scriptures, quotations, and checklists on 66 topics. The practical, inspirational content plus the attractive two-color text design and unique cover make this a book moms will want to own and give as a gift.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Circus mouse (Merrigold Press tell-a-tale books)",
        "Authors": "By McGuire, Leslie",
        "Description": "",
        "Category": "",
        "Publisher": "Merrigold Press",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "One Hundred Hungry Ants",
        "Authors": "By Pinczes, Elinor J., MacKain, Bonnie (ILT), and Kain, Bonnie Mac (ILT)",
        "Description": "An entertaining introduction to math follows one hundred famished ants as they head towards a picnic to get yummies for their tummies, but when they stop to change their line formation, showing children different divisions of one hundred, they lose both time and food. Reprint.",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "A Baby Called John (Lion Story Bible)",
        "Authors": "By Frank, Penny and Haysom, John (ILT)",
        "Description": "Recounts the New Testament story of the birth of John the Baptist, Jesus's cousin who prepared the people for His teachings.",
        "Category": " Juvenile Nonfiction , Religion , General",
        "Publisher": "Chariot Victor Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Divine Comedies: Contains Here Comes the Sun and Odds and Gods",
        "Authors": "By Holt, Tom",
        "Description": "'Uniquely twisted ... cracking gags' - Rob Grant'Frantically wacky and wilfully confusing ... gratifyingly clever and very amusing' - Mail On SundayHERE COMES THE SUNThe sun rises late, dirty and so badly in need of a service it's a wonder it gets up at all. The moon's going to be scrapped soon and a new one commissioned - but they've been saying that for years ... All is not well with the universe, and it's because the mortals are running the show. It's time for a Higher Power to take charge ...ODDS AND GODSIt's a god's life at the Sunnyvoyde Residential Home for retired deities. Everlasting life can be a real drag when all you've got to look forward to is cauliflower cheese on Wednesdays. But things are about to change, because those almighty duffers Thor, Odin and Frey have restored a thousand-year-old traction engine ... and the thing actually works. Then there's Osiris, preparing to set out on a quest that will test his wheelchair to the very limits. Only one thing might save the world. Dentures.Two fantastic comic fantasies - HERE COMES THE SUN and ODDS AND GODS - reissued with brilliant new cover style.Books by Tom Holt: Walled Orchard Series Goatsong The Walled Orchard J.W. Wells & Co. Series The Portable Door In Your Dreams Earth, Air, Fire and Custard You Don't Have to Be Evil to Work Here, But It Helps The Better Mousetrap May Contain Traces of Magic Life, Liberty and the Pursuit of Sausages YouSpace Series Doughnut When It's A Jar The Outsorcerer's Apprentice The Good, the Bad and the Smug Novels Expecting Someone Taller Who's Afraid of Beowulf Flying Dutch Ye Gods! Overtime Here Comes the Sun Grailblazers Faust Among Equals Odds and Gods Djinn Rummy My Hero Paint your Dragon Open Sesame Wish you Were Here Alexander at World's End Only Human Snow White and the Seven Samurai Olympiad Valhalla Nothing But Blue Skies Falling SidewaysLittle PeopleSong for NeroMeadowlandBarkingBlonde BombshellThe Management Style of the Supreme BeingsAn Orc on the Wild Side",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Orbit",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Discourse on Method and Meditations on First Philosophy",
        "Authors": "By Descartes, Rene",
        "Description": "",
        "Category": " Philosophy , General",
        "Publisher": "BN Publishing",
        "Price Starting With ($)": "10.95",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Good Cookie: Over 250 Delicious Recipes from Simple to Sublime",
        "Authors": "By Boyle, Tish",
        "Description": "A delicious collection of cookie recipes of all kinds—now in paperbackHere's the book that no self-respecting cookie lover can resist. The Good Cookie shares a fresh and tantalizing selection of more than 250 recipes from around the globe—complete with expert instructions on how to bake them. From rugged Cranberry Orange Nut Bars and irresistible Bittersweet Chocolate Biscotti to sophisticated Chocolate-Filled Almond Hearts, you'll find recipes of every type and stripe.The book features basic drop cookies, beautiful hand-formed cookies, delectable sandwich cookies, complex decorator cookies, and more. Plus, there's plenty of interesting and fun information on the cookie's history, technique, ingredients, and other tidbits of information.Combines a treasure-trove of classic and contemporary cookie recipes with expert baking advice in one handy volumeWritten by the food editor and test kitchen director of Chocolatier and Pastry Art & Design magazinesOffers definitive advice on freezing, storing, packaging, and shipping cookiesFor home bakers who love to bake cookies, whether they're novice bakers or experienced kitchen hands, The Good Cookie is an irresistibly delicious resource.",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Wild Washington Amazing Wildlife in and around Our Nation's Capital",
        "Authors": "By Don Chernoff",
        "Description": "",
        "Category": "",
        "Publisher": "Dcwild",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Paintings and Sculpture from the Samuel H. Kress Collection",
        "Authors": "By National Gallery Of Art (U. S)",
        "Description": "",
        "Category": "",
        "Publisher": "Smithsonian Institution",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Conversational Spanish: A Complete Course in Everyday Spanish (Living Language Series)",
        "Authors": "By Ralph William Weiman, O. A. Succar",
        "Description": "",
        "Category": "",
        "Publisher": "Living Language",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Seeds That Grew and Grew: Matthew 13:1-9; 18-23 (Arch Books)",
        "Authors": "By Sharp, Chris (ILT) and Burkart, Jeffery E.",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religious , Christian , General",
        "Publisher": "Concordia Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Baby Jesus Is Born - Arch Books",
        "Authors": "By Gloria Truitt",
        "Description": "",
        "Category": "",
        "Publisher": "Concordia Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Cooking With Beer: For Premium Quality Food Prepared With Beer (Shaped Cookbook)",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    }
]