[
    {
        "Title": "The Joy of Being 50 Plus",
        "Authors": "By Zobel-Nolan, Allia and Chast, Roz (ILT)",
        "Description": "The baby boomers are turning 50 - one by one, at the alarming rate of every seven seconds for the next 16 years. And just how many will be happily looking forward to blowing out a galaxy of candles and admitting to the world that they're half a century old? Very few, in Allia Zobel's opinion. But that's because they're not looking on the bright side.In a new collaboration after The Joy of Being Single (138,000 copies in print), Ms. Zobel and New Yorker cartoonist Roz Chast take on another seemingly sore subject - being 50 in society that worships youth - and find excellent reasons to celebrate. Such as: -You can get a tattoo and chalk it up to hormone imbalance. -You can brag to your friends if a construction worker whistles at you. -You can have complaining contests about your bunions. -You look divine in hats and sunglasses. -You're old enough to be a grouch. -You can speak from experience. -You now know the things you wish you'd known back when, and still have time to do something about it. And while neither Ms. Zobel nor Ms. Chast is anywhere near the magic five-oh (it's the fluorescent lighting), they speak with authority as they advise all 50-year-olds to blow their own horn (if they have enough wind) and beat their own drum (arthritis permitting).",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Baby Einstein: Neighborhood Numbers",
        "Authors": "By Zaidi, Nadeem (ILT) and Aigner-Clark, Julie",
        "Description": "Designed to introduce youngsters to the world of numbersand to assist in the understanding of the significance of numeracy in theireveryday world.  With beautifulillustrations of familiar objects, youngsters will learn the world of numbersright outside and inside their door!",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Seventh Sinner",
        "Authors": "By Peters, Elizabeth",
        "Description": "For vibrant, lovely Jean Suttman, the fellowship to study in Rome was the culmination of all her dreams--until she undertook an innocent expedition to the ancient Temple of Mithra and became involved in a murder investigation! \"This author never fails to entertain\".--Cleveland Plain Dealer.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "The Mystery at Disney World (11) (Real Kids Real Places)",
        "Authors": "By Marsh, Carole",
        "Description": "Four children take a vacation to Disney World, but when some of them disappear, the others search for clues of their whereabouts.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Carole Marsh Mysteries",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Hello, School Bus! (Scholastic Readers)",
        "Authors": "By Parker, Marjorie Blain and Kolar, Bob (ILT)",
        "Description": "In this first book in a series of three Scholastic Reader titles about vehicles, comes a simple Level 1 rhyme about riding on the school bus!We wave. We meet.We watch and wait.Yes--here it comes!We won't be late.Hello, school bus!This is the first book in a series of three new Scholastic Reader titles about vehicles. Hello, School Bus! is a simple rhyming story for Level 1 readers about the experience of riding on a school bus. Fun colorful illustrations add energy and excitement to this transportation book.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Government of the Soviet Union",
        "Authors": "By Harper, Samuel N",
        "Description": "",
        "Category": "",
        "Publisher": "D. Van Nostrand Company, Inc.",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "Start and Run a Money-Making Bar",
        "Authors": "By Fier, Bruce",
        "Description": "Written by an owner and consultant, this book provides a step-by-step course in bar business ownership, management, and operation. It explains how to research the market and location, get a loan, design the space, purchase, keep the books, advertise, and hire and train. It also talks about food service, entertainment, regulations, ownership structures, how to promote and advertise the business, and other topics.",
        "Category": " Business & Economics , Entrepreneurship",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Friendship: A Bouquet Of Quotes (RP Minis)",
        "Authors": "By Running Press",
        "Description": "",
        "Category": " Family & Relationships , Friendship",
        "Publisher": "RP Minis",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Islam: A Primer",
        "Authors": "By Sabini, John",
        "Description": "An introduction to Islam, including its basic beliefs and laws, origins and spread, varieties, and relationship to Judaism and Christianity.",
        "Category": " Religion , Islam , General",
        "Publisher": "AMIDEAST Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "History of All Saints' Parish Frederick County, Maryland",
        "Authors": "By Helfenstein, Ernest",
        "Description": "",
        "Category": "",
        "Publisher": "All Saints' Parish",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Natural Relief for Your Child's  Asthma: A Guide to Controlling Symptoms & Reducing Your Child's Dependence on Drugs",
        "Authors": "By Bock, Steven J., M.D., Bock, Kenneth, and Bruning, Nancy Pauline",
        "Description": "Tells how to reduce asthma attacks by dealing with the causes, limit drugs to emergency situations, and identify foods that trigger attacks",
        "Category": " Medical , Alternative Medicine",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "High Times/ Low Times-The Many Faces of Adolescent Depression",
        "Authors": "By John E. Meeks, M.D.",
        "Description": "",
        "Category": "",
        "Publisher": "The Pia Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Bitty Twins Learn to Share (American Girl)",
        "Authors": "By Jennifer Hirsch",
        "Description": "",
        "Category": "",
        "Publisher": "American Girl Publishing Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Fear the Worst: A Novel",
        "Authors": "By Barclay, Linwood",
        "Description": "Your daughter doesn’t come home one night from her summer job. You go there looking for her. No one’s seen here. But it’s worse than that. No one’s ever seen her. So where has she been going every day? And where is she now?In Linwood Barclay’s riveting new thriller, an ordinary man’s desperate search for his daughter leads him into a dark world of corruption, exploitation, and murder. Tim Blake is about to learn that the people you think you know best are the ones harboring the biggest secrets.Tim is an average guy. He sells cars. He has an ex-wife. She’s moved in with a man whose moody son spends more time online than he should. His girlfriend is turning out to be a bit of a flake. It’s not a life without hassles, but nothing will prepare Tim for the nightmare that’s about to begin.Sydney vanishes into thin air. At the hotel where she supposedly worked, no one has ever heard of her. Even her closest friends seem to be at a loss. Now, as the days pass without word, Tim must face the fact that not only is Sydney missing, but that the daughter he’s loved and thought he knew is a virtual stranger.As he retraces Sydney’s steps, Tim discovers that the suburban Connecticut town he always thought of as idyllic is anything but. What he doesn’t know is that his every move is being watched. There are others who want to find Syd as much as Tim does. But they’re not planning a Welcome Home party.The closer Tim comes to the truth, the closer he comes to every parent’s worst nightmare—and the kind of evil only a parent’s love has a chance in hell of stopping.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Liberating the Adult Within: Moving from Childlike Responses to Authentic Adulthood",
        "Authors": "By Kramer, Helen",
        "Description": "Life's not perfect? Things don't always go your way? Feeling completely out of control of your life? Don't lose hope. There is good news!Psychotherapist Helen Kramer has developed a pioneering method that provides long-term solutions for people who generally function well, but have difficulty ridding their behavior of unpredictable childlike responses such as rigidity, blame, impatience, and melodrama.Helen Kramer has invented the phrase \"emotional dyslexia\" to cover those times when you didn't behave the way you would have liked. Think of it this way: if people who have trouble learning have dyslexia, then people who have trouble learning to be authentic adults have emotional dyslexia.Kramer uses an educational process that goes beyond that of traditional psychotherapy to focus on what you can do to change unwanted behavior - without years of analysis. So if, after all the Twelve Step programs and the endless years on the couch you still feel insecure, fearful or less comfortable in the world than you would wish, Liberating the Adult Within: Moving from Childish Responses to Authentic Adulthood is the book for you.Helen Kramer identifies different childlike states such as dependency and fear and gives examples of typical ways of reacting to different situations while in these states. By supplementing examples of each behavior with anecdotes, very specific dialogues, and key words and phrases, such as \"I'm too fat,\" \"It's my fault,\" or \"Nobody loves me,\" she enables you to identify which childlike state you may be in, recognize its adult counterpart, and move on to change your behavior. The approach is nonjudgmental, and each chapter includes exercises and an inspirational message to help motivate you.Whether the stress factor is created by your boss, spouse, or parent, Liberating the Adult Within will teach you how to deal with any situation without feeling threatened or confined. You'll learn to accept differences in others, forgive your parents for past mistakes, and become a better parent to your children. You will finally become the adult that you've always been, but were unable to free.",
        "Category": " Psychology , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "One-Hundred-and-One African-American Read-Aloud Stories",
        "Authors": "By Kantor, Susan (EDT)",
        "Description": "The newest volume in the popular Read-Aloud series, this engaging collection features the best African-American short stories and excerpts to read to children in under ten minutes. The diverse tales, selected for their rich histories, spiritual writings and adventurous characters, offer the perfect bed-time--or any other time--activities for parents, grandparents, siblings or babysitters. The book includes 50 beautiful drawings that capture the spirit of these tales, legends, lore and fables. The narratives are faithful adaptations of the oral and written stories passed down through the centuries. They include Langston Hughes, Frederick Douglass, Booker T. Washington and Paula Fox.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Gargoyles' Christmas",
        "Authors": "By Campbell, Louisa and Taylor, Bridget Starr (ILT)",
        "Description": "Soured on Christmas, three New York City gargoyles begin to change their mind about the holiday after Santa Claus helps them out of a mess of their own making.",
        "Category": "",
        "Publisher": "Gibbs Smith",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Stopping Inflammation: Relieving the Cause of Degenerative Diseases",
        "Authors": "By Appleton, Nancy, Ph.D. and Jacobs, G. N.",
        "Description": "Most of us think of inflammation as a symptom associated with an infection or injury. Dr. Nancy Appleton, however, has discovered that it might be more than just a simple reaction to a health disorder. When the body’s tissues are disturbed in some manner, a series of complex reactions takes place, resulting in inflammation. In most cases, when the disorder stops, the tissue returns to its normal healthy state. Sometimes, though, the tissue remains chronically inflamed. Dr. Appleton’s research demonstrates that this condition might be more harmful than ever suspected.Drawing on the latest medical research, Stopping Inflammation begins with a full explanation of inflammation and its causes. It then looks at inflammation’s role in various health disorders, from obesity to cancer. Finally, the book provides a number of nondrug treatments aimed not at controlling the problem, but at removing its cause. Here are safe and credible solutions for restoring good health.",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Square One",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "At Peace with All Their Neighbors: Catholics and Catholicism in the National Capital, 1787-1860 (Not In A Series)",
        "Authors": "By Warner, William W.",
        "Description": "In 1790, two events marked important points in the development of two young American institutions -- Congress decided that the new nation's seat of government would be on the banks of the Potomac, and John Carroll of Maryland was consecrated as America's first Catholic bishop. This coincidence of events signalled the unexpectedly important role that Maryland's Catholics, many of them by then fifth- and sixth-generation Americans, were to play in the growth and early government of the national capital. In this book, William W. Warner explores how Maryland's Catholics drew upon their long-standing traditions -- advocacy of separation of church and state, a sense of civic duty, and a determination \"to live at peace with all their neighbors,\" in Bishop Carroll's phrase -- to take a leading role in the early government, financing, and building of the new capital.Beginning with brief histories of the area's first Catholic churches and the establishment of Georgetown College,At Peace with All Their Neighbors explains the many reasons behind the Protestant majority's acceptance of Catholicism in the national capital in an age often marked by religious intolerance. Shortly after the capital moved from Philadelphia in 1800, Catholics held the principal positions in the city government and were also major landowners, property investors, and bankers. In the decade before the 1844 riots over religious education erupted in Philadelphia, the municipal government of Georgetown gave public funds for a Catholic school and Congress granted land in Washington for a Catholic orphanage.The book closes with a remarkable account of how the Washington community, Protestants and Catholics alike, withstood the concentrated efforts of the virulently anti-immigrant and anti-Catholic American nativists and the Know-Nothing Party in the last two decades before the Civil War.This chronicle of Washington's Catholic community and its major contributions to the growth of the nations's capital will be of value for everyone interested in the history of Washington, D.C., Catholic history, and the history of religious toleration in America.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Georgetown University Press",
        "Price Starting With ($)": "5.95",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Chicken Soup for the Soul: True Love: 101 Heartwarming and Humorous Stories about Dating, Romance, Love, and Marriage",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Newmark, Amy (COM), Yamaguchi, Kristi (FRW), and Hedican, Bret (FRW)",
        "Description": "CSS True Love will warm the heart and uplift the spirit of any reader who is looking for, or has found, his or her soulmate. Stories of dating, romance, love, and marriage, with all their ups and downs, will encourage, inspire, and amuse readers.Everyone loves a good love story.  And we all love stories about how the love started and blossomed.  This fun new book about dating, romance, love, and marriage, will make you laugh and make you cry, and is guaranteed to inspire you to renew that search for your soul mate or open your heart a little more to the one you already have.  Read about how couples met, when \"they knew\", good and bad dates, proposals, maintaining the relationship, second chances, and all the other ups and downs of love, romance and marriage.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Chicken Soup for the Soul",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "A Book of Gladness",
        "Authors": "By Seton Press",
        "Description": "",
        "Category": "",
        "Publisher": "Seton Press",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Invention of Solitude",
        "Authors": "By Auster, Paul",
        "Description": "This book's first section is a moving personal meditation on the life and sudden death of the author's father; the second section reveals a narrator's separation from his young son while nursing his dying grandfather",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Penguin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Healing Power of the Christian Mind, The",
        "Authors": "By Backus, William",
        "Description": "A remarkable study that shows how dwelling on God's Word enhances your immune system and provides a crucial link to good health.",
        "Category": " Religion , General",
        "Publisher": "Baker Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "A Short Guide to Writing About Literature",
        "Authors": "By Sylvan Barnet",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Harcourt School Publishers Collections: Student Edition : Welcome Home Grade 1/4 2000",
        "Authors": "By HARCOURT SCHOOL PUBLISHERS",
        "Description": "",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "HARCOURT SCHOOL PUBLISHERS",
        "Price Starting With ($)": "5.75",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "TO ME IT'S WONDERFUL.Intro by Eugenia Price and Joyce Blackburn",
        "Authors": "By Waters,Ethel",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "8.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Rainbow Fish: Spike and the Substitute (Festival Readers)",
        "Authors": "By Goldman, Leslie and Huang, Benrei (ILT)",
        "Description": "When their beloved teacher, Miss Cuttle, enforces a rule Spike feels is unfair, he decides that he doesn't like her anymore, but when she doesn't come to school one day, Spike soon realizes just how much she is missed.  Original.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "I Like Myself!",
        "Authors": "By Catrow, David (ILT) and Beaumont, Karen",
        "Description": "High on energy and imagination, this ode to self-esteem encourages kids to appreciate everything about themselves--inside and out. Messy hair? Beaver breath? So what! Here's a little girl who knows what really matters.At once silly and serious, Karen Beaumont's joyous rhyming text and David Catrow's wild illustrations unite in a book that is sassy, soulful--and straight from the heart.",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Dying To Meet You (43 Old Cemetery Road)",
        "Authors": "By Klise, Kate and Klise, M. Sarah (ILT)",
        "Description": "Ignatius B. Grumply moves into the Victorian mansion at 43 Old Cemetery Road hoping to find some peace and quiet so he can crack a wicked case of writer’s block. But 43 Old Cemetery Road is already occupied by eleven-year-old Seymour, his cat Shadow, and an irritable ghost named Olive. It’s hard to say who is more outraged. But a grumpy old ghost just might inspire this grumpy old man—and the abandoned kid? Well, let&#39;s just say his last name&#39;s Hope.Sisters Kate and M. Sarah Klise, the creators of the award-winning Regarding the . . . series, offer up this volume in a clever epistolary series told in letters, drawings, newspaper articles, a work-in-progress manuscript, and even an occasional tombstone engraving.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Closed for the Season",
        "Authors": "By Hahn, Mary Downing",
        "Description": "A contemporary thriller by the bestselling author of The Old Willis Place.Two 13-year-old boys, Arthur and Logan, set out to solve the mystery of a murder that took place some years ago in the old house Logan's family has just moved into. The boys' quest takes them to the highest and lowest levels of society in their small Maryland town, and eventually to a derelict amusement park that is supposedly closed for the season.",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Napping House padded board book",
        "Authors": "By Wood, Audrey and Wood, Don (ILT)",
        "Description": "A padded board book edition of the classic cumulative tale that&#39;s perfect for bedtime, naptime...anytime! In the napping house is a cozy bed piled high with a snoring granny, a dreaming child, a dozing dog, a snoozing cat, and a slumbering mouse. All is at peace until the appearance of an unexpected visitor and before you know it no one is sleeping! The padded covers, rounded corners, and sturdy board book pages make this book a great gift for little ones.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Wall-E (A Little Golden Book)",
        "Authors": "By Tilley, Scott (ILT), Orpinas, Jean-Paul (ILT), and Vick-e (ADP)",
        "Description": "WHEN A LOVABLE, lonely robot named WALL•E falls in love with a sophisticated female robot named EVE, he follows his heart all the way into outer space! Young fans will enjoy this Little Golden Book retelling of Disney/Pixar’s WALL•E.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Peking Man Is Missing",
        "Authors": "By Taschdjian, Claire",
        "Description": "In the 1920s, on a hill near Peking (now Beijing), a team of scientists discovered a huge cache of human bones, some more than half a million years old. Collectively dubbed ?Peking Man,? they were one of the most important finds in the history of paleontology. And in 1941, in the chaos of World War II they disappeared. No one knows what happened, but there are plenty of theories, many with political implications. Claire Taschdjian?s speculation as to what might have become of the priceless fossils could represent just another theory, but for one intriguing fact: Claire Taschdjian was one of the last people in the world known to have seen Peking Man. (With newly-commissioned material on the true story of the Peking Man.)",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Felony & Mayhem",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "How Can I Be Sure I'm a Christian?: What the Bible Says About Assurance of Salvation",
        "Authors": "By Whitney, Donald S.",
        "Description": "Author Donald S. Whitney explores the issue of assurance and outlines how Christians can experience a satisfying certainty of eternal life. Includes discussion questions.",
        "Category": " Religion , Christian Theology , Soteriology",
        "Publisher": "NavPress",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Dogs Do the Silliest Things",
        "Authors": "By Ortolja-Baird, Alexandra",
        "Description": "Here come the canines at their comical best! Dogs are wonderfully photogenic, whether they’re pedigreed or ordinary mongrels ... whether they’re as large as a St. Bernard or as tiny as a Chihuahua. This attractive little book presents an often charming, always hilarious collection of dog photos, each accompanied by a witty adage or a clever observation by a well-known personality. With funny photos on every two-page spread, here is a wonderful gift book, an interlude for smiles for every reader who owns a dog or wishes he could have one.",
        "Category": " Pets , Dogs , General",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Illustrated Picture Atlas of the World (World Atlas)",
        "Authors": "By unknown",
        "Description": "JACKET PRICE 6.99, RETAIL PRICE 2.99.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Hinkler / Orpheus",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "American Country (Architecture and Design Library)",
        "Authors": "By Lisa Skolnik",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes&Noble Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Vision Of The Buddha",
        "Authors": "By Tom Lowenstein",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books, New York:",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Underwear: What We Wear Under There",
        "Authors": "By O'Brien, John (ILT) and Swain, Ruth Freeman",
        "Description": "Traces the history of underwear from ancient times to the twenty-first century.",
        "Category": " Juvenile Nonfiction , History , General",
        "Publisher": "Holiday House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Souled Out: Reclaiming Faith and Politics after the Religious Right",
        "Authors": "By Dionne, E. J., Jr.",
        "Description": "The religious and political winds are changing. Tens of millions of religious Americans are reclaiming faith from those who would abuse it for narrow, partisan, and ideological purposes. And more and more secular Americans are discovering common ground with believers on the great issues of social justice, peace, and the environment. In Souled Out, award-winning journalist and commentator E. J. Dionne explains why the era of the Religious Right--and the crude exploitation of faith for political advantage--is over.  Based on years of research and writing, Souled Out shows that the end of the Religious Right doesn't signal the decline of evangelical Christianity but rather its disentanglement from a political machine that sold it out to a narrow electoral agenda of such causes as opposition to gay marriage and abortion. With insightful portraits of leading contemporary religious figures from Rick Warren and Richard Cizik to John Paul II and Benedict XVI, Dionne shows that our great religions have always preached a broad message of hope for more just human arrangements and refused to be mere props for the powers that be. Dionne also argues that the new atheist writers should be seen as a gift to believers, a demand that they live up to their proclaimed values and embrace scientific and philosophical inquiry in a spirit of \"intellectual solidarity.\"  Written in the tradition of Reinhold and H. Richard Niebuhr, Souled Out will help change how we think and talk about religion and politics in the post-Bush era.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Jetsons On The Move",
        "Authors": "By Gave, Marc",
        "Description": "George Jetson is kidnapped by aliens who are trying to close down the Spacely Sprockets factory, because it is destroying their homes",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Fireproof Your Marriage: Participant's Guide",
        "Authors": "By Dion, Jennifer",
        "Description": "",
        "Category": "",
        "Publisher": "Outreach Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Bradbury Report: A Novel",
        "Authors": "By Polansky, Steven",
        "Description": "Destined to take its place beside such classics of speculative fiction as 1984, Brave New World, and The Handmaid’s Tale, this astonishing first novel is a beautifully written and riveting meditation on what it means to be human, what it means to live, and love, wholeheartedly. The year is 2071. In the United States, the only nation in the world where human cloning is legal, a government-run cloning program is in place as the lynchpin of the health care delivery system. Almost every U.S. citizen has a “Copy” living in a sequestered area called The Clearances. When an “Original” is sick or injured and requires surgery, whatever he needs is taken from his clone. In the two decades since the program’s inception, no person has ever seen his Copy, and no clone has ever successfully escaped. Until now. A widower in his sixties, and an unlikely candidate for adventure, Ray gets a call from a woman he has not seen or spoken to since their days together as students. Anna is now a member of an underground abolitionist group, and she asks Ray’s help in hiding an escaped clone. Ray is unwilling, until he learns the clone is his.The Bradbury Report is Ray’s account of the journey he, Anna, and his clone – a perfect replica of himself at twenty-one – undertake on the run from the authorities. It is an epic journey, and an exploration of one of the most pressing ethical dilemmas of the twenty-first century. A provocative vision of the American future, and a haunting story of love and friendship and self-discovery, The Bradbury Report will stay with you long after reading.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Weinstein Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Deal With It!: You Cannot Conquer What You Will Not Confront",
        "Authors": "By White, Paula",
        "Description": "Nobody understands the issues women face better than dynamic Bible teacher and national speaker Paula White, host of a national television program, who crosses multiracial and gender lines with her messages. Many of these listeners are women who identify with Paula's straight-forward and candid approach as she shares from what she has experienced in life. Her openness, integrity, and honesty are what draw men and women to her. In this book, Paula highlights 10 women in the Bible and shows how God transformed their lives and can transform anyone's life who is seeking Him and the answers he provides throughout Scripture.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Great Art Scandal : Solve the Crime, Save the Show!",
        "Authors": "By Nilsen, Anna",
        "Description": "Find the rogue painting and save the exhibition and the City Gallery! Children will have hours of fun exercising their powers of observation as they spot the clues that reveal which artist painted each picture. While they have fun solving the mystery, they'll be enjoying an inspiring introduction to thirty-two of the world's greatest modern artists.The split pages make this book a fun, interactive experience, rich with fascinating facts about the paintings and the painters and their techniques--all the ingredients needed to inspire a lifelong interest in modern art. Also included is a glossary of art terms.",
        "Category": " Juvenile Nonfiction , Art , Painting",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Book of Fresh Flowers: A Complete Guide to Selecting and Arranging",
        "Authors": "By Hillier, Malcolm",
        "Description": "Filled with hundreds of breathtaking arrangements for many indoor settings and special occasions. The Book of Fresh Flowers is a celebration of the beauty of flowers, foliage, and fruits and an inspiration to anyone interested in arranging fresh flowers.  Malcolm Hillier, coauthor of the best-selling Book of Dried Flowers, once again delights the eye with his stunning and imaginative arrangements. He shares many of the secrets of his success and reveals some tricks of the trade. As Hillier explains the principles and techniques essential to aesthetic, natural-looking floral arrangements, he guides you step by step toward making your own fresh flower creations.  Lavishly illustrated throughout. The Book of Fresh Flowers highlights the glorious abundance and diversity of plant materials available -- whether store-bought or homegrown -- in an extensive, season-by-season photographic guide to the flowers and foliage that lend themselves well to use in arrangements. Using some of the plant materials illustrated, Malcolm Hillier reveals the widely differing styles of arrangement that can be employed during every season and emphasizes the importance of following nature and developing your own flair when displaying flowers.  For everyone, from the gardener who grows and picks flowers for the home to the expert creating arrangements for a wedding. The Book of Fresh Flowers will prove an invaluable sourcebook of practical advice and inspirational design ideas.  Malcolm Hillier, coauthor of the best-selling Book of Dried Flowers and author of Arranging Dried Flowers, has long had an obsession with gardens and flowers. In 1970, together with Colin Hilton, he started a garden design practice in London and later a retail flower shop, both of which enjoy an international reputation. He has created both fresh and dried flower arrangements in a highly distinctive style and has designed conservatories for interior designers, films, television, and private clients.",
        "Category": " Gardening , Flowers , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Music (Eyewitness Books)",
        "Authors": "By Ardley, Neil",
        "Description": "Full-color photos. \"Ardley introduces types of musical instruments in a scintillating blend that spans ancient to modern. Interesting historical asides and highlights about famous musicians contrast with the precisely labeled parts of the numerous illustrated instruments. The double-page spreads display an array of full-color photos, sketches, and explanatory text. Holds wide appeal for research and browsing.\"--(starred) Booklist.",
        "Category": "",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Costume (Eyewitness Books)",
        "Authors": "By Rowland-Warne, L.",
        "Description": "Full-color photos. Live models display loincloths and togas, powdered wigs and \"steeple\" headdresses, buckskins and bloomers, shoes, wedding dresses, children's clothes, and bathing suits in this guide to clothing throughout the ages.",
        "Category": "",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Bird (Eyewitness Books)",
        "Authors": "By Burnie, David",
        "Description": "Full-color photos. \"Each spread is composed of full-color photos, sketches, and explanatory text covering the anatomy, behavior, and adaptations of birds and presented in a visually appealing manner that compels further page turning. The author leads us through all that is fascinating in our study of birds at a level of writing suitable for younger readers. A fine addition to school libraries at all levels.\"--(starred) Science Books & Films.",
        "Category": "",
        "Publisher": "Alfred A. Knopf Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Healing the Wounded Heart: Removing Obstacles to Intimacy with God",
        "Authors": "By Gardner, Thom",
        "Description": "Healing the Wounded Heart exposes negative emotions such as fear,  rejection, worthlessness, shame, insecurity, defilement, and  hopelessness that prevent us from living in the grace and peace God  intends for us. Uncover the lies embedded in emotional wounds and  discover peace and truth in the presence of the Living Christ.",
        "Category": " Self-help , Spiritual",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The True Woman: The Beauty and Strength of a Godly Woman",
        "Authors": "By Hunt, Susan",
        "Description": "This exhortation to biblical womanhood will instruct and excite women about the unique opportunity they have to reflect Christ and make an impact for eternity by way of their God-given purpose.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Crossway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Exploring the Essentials (Thinking Through Discipleship Series)",
        "Authors": "By Lee-Thorp, Karen",
        "Description": "",
        "Category": "",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Take back America",
        "Authors": "By Staver, Mathew D",
        "Description": "",
        "Category": "",
        "Publisher": "Liberty Counsel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "a Second Touch",
        "Authors": "By Miller, Keith",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "New American Bible, St. Joseph Medium Size Edition",
        "Authors": "By National Conference of Catholic Bishops",
        "Description": "",
        "Category": " Bibles , New American Bible , General",
        "Publisher": "Catholic Book Publishing",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "Tricky Dick and the Pink Lady : Richard Nixon vs Helen Gahagan Douglas-Sexual Politics and the Red Scare, 1950",
        "Authors": "By Mitchell, Greg",
        "Description": "Follows one of America's dirtiest campaigns, Richard Nixon's bid to become a senator in 1950, documenting Nixon's use of Red-baiting tactics to discredit his Democratic opponent, actress Helen Gahagan Douglas, whom he dubbed \"The Pink Lady.\" 20,000 first printing. Tour.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Homeowner's Guide to Renewable Energy: Achieving Energy Independence from Wind, Solar, Biomass and Hydropower (Mother Earth News Wiser Living Series (3))",
        "Authors": "By Chiras, Daniel D.",
        "Description": "The coming energy crisis caused by a peak in global oil and natural gas production will profoundly affect the lives of all North Americans. As the price of these vital fuels rises, homeowners will scramble to cut their fuel bills. Two options for meeting the upcoming challenge are dramatic improvements in home energy efficiency and efforts to tap into clean, affordable, renewable energy resources to heat and cool homes, to provide hot water and electricity, and even to cook. These measures can result in huge savings and a level of energy independence.The Homeowner’s Guide to Renewable Energy tells you how. It starts by outlining the likely impacts of fossil fuel shortages and some basic facts about energy. It then discusses energy conservation to slash energy bills and prepare for renewable energy options. Focusing carefully on specific strategies needed to replace specific fuels, the book then examines each practical energy option available to homeowners:• Solar hot water, cooking, and water purification • Space heat: passive and active solar retrofits • Wood heat • Passive cooling • Solar electricity • Wind-generated electricity • Electricity from microhydropower sources • Emerging technologies—hydrogen, fuel cells, methane digesters, and biodieselThe Homeowner’s Guide to Renewable Energy gives readers sufficient knowledge to hire and communicate effectively with contractors and, for those wanting do installations themselves, it recommends more detailed manuals. With a complete resource listing, this well-illustrated and accessible guide is a perfect companion for illuminating the coming dark age.Dan Chiras has studied renewable energy and energy efficiency for three decades and has installed several renewable energy systems. He lives in a self-designed passive solar/solar electric home. An award-winning author of over 20 books, he is a sustainability design consultant who teaches courses on renewable energy, green building, and sustainability at Colorado College.",
        "Category": " House & Home , Reference",
        "Publisher": "New Society Publishers",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Great words of our time - Memorable thoughts of famous men and women of the 20th century",
        "Authors": "By Dee Danner Barwick",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "PILGRIM'S PROGRESS",
        "Authors": "By Laurel & DEKONTY, John (Editor) HICKS",
        "Description": "",
        "Category": "",
        "Publisher": "A Beka Book",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Crusader hymns and hymn stories",
        "Authors": "By Barrows, Cliff",
        "Description": "",
        "Category": "",
        "Publisher": "Billy Graham Evangelistic Association",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Never Enough of Nature",
        "Authors": "By Lawrence Kilham",
        "Description": "",
        "Category": "",
        "Publisher": "Droll Yankees inc",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Towards Zero",
        "Authors": "By Christie, Agatha",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Yankee Salesman. The Story of Ross Edgar (Dinty) Moore and the Development of Our Technical Assistance Programs Abroad",
        "Authors": "By Moore, Adele R.",
        "Description": "",
        "Category": "",
        "Publisher": "Vantage Press",
        "Price Starting With ($)": "8.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "In His Steps, What Would Jesus Do?",
        "Authors": "By charles m. sheldon",
        "Description": "",
        "Category": "",
        "Publisher": "Permabooks",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "Discovering Maryland Wineries",
        "Authors": "By Atticks, Kevin M.",
        "Description": "",
        "Category": "",
        "Publisher": "Resonant Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Amazing Book of Useless Information: More Things You Didn't Need to Know But Are About to Find Out",
        "Authors": "By Botham, Noel",
        "Description": "From the creators of the #1 New York Times bestseller The Book of Useless Information comes another fun, foolhardy and completely frivolous, fact-filled book.The Useless Information Society's latest collection, The Amazing Book of Useless Information, will answer questions readers never even knew they had. From space travel to the history of jelly beans, this wideranging, brain-teasing, and altogether useless book will give readers information to out-trivialize even their cleverest of companions.Features such fascinating facts as:- There is a town in West Virginia called Looneyville- Women can talk with less effort than men- Lemons have more sugar than oranges And answers to these life-changing questions:- What was the Ancient Roman cure for a stomachache\"- What is a \"buckle bunny??- Where is the coldest place in the universe?",
        "Category": " Humor , General",
        "Publisher": "Perigee Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Mary's Easter Story: The Story of Easter : Matthew 21:1-11 and John 18:1-20:31",
        "Authors": "By Bohnet, Eric C. and Swisher, Elizabeth (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Concordia Pub House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Toddler Adoption: The Weaver's Craft",
        "Authors": "By Hopkins-Best, Mary",
        "Description": "",
        "Category": "",
        "Publisher": "Perspectives Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Intercultural Communication: A Discourse Approach",
        "Authors": "By Scollon, Ronald and Scollon, Suzanne B. K.",
        "Description": "This newly revised volume is both a lively introduction and practical guide to the main concepts and problems of intercultural communication. Viewed from within the framework of interactive sociolinguistics associated with Tannen, Gumperz, and others, the authors focus in particular on the discourse of westerners and of Asians, the discourse of men and women, corporate discourse and the discourse of professional organizations, and intergenerational discourse. Views intercultural communication from within the framework of interactive sociolinguistics, with an emphasis on discourse analysisNumerous examples demonstrate the relationship between culture and communicationOutlines the methodology of ethnography, and shows how it is used for new research in intercultural communication Illustrates the value of ethnographic research for conducting training and consultation programs.",
        "Category": " Language Arts & Disciplines , Linguistics , General",
        "Publisher": "Wiley-Blackwell",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Warman's Americana and Collectibles, Fourth Edition",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Wallace-Homestead Book Company",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Is Your Glass Laugh Full? Some Thoughts on Seeing the Humor in Life",
        "Authors": "By Culberson, Ronald P.",
        "Description": "",
        "Category": "",
        "Publisher": "Gilbert Belle Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Scrapbook Favorites",
        "Authors": "By Tonn, Maryjane Hooper",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Night of Four Hundred Rabbits",
        "Authors": "By Peters, Elizabeth",
        "Description": "Returning from a Mexico City vacation, Carol Farley remembers the breathtaking pyramids she visited and is shocked when she receives a newspaper clipping that tells her that her missing father is still alive. Reissue.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "The Baseball Clinic: Skills and Drills for Better Baseball--A Handbook for Players and Coaches",
        "Authors": "By Stewart, John",
        "Description": "Provides tips on hitting, pitching, first and third base play, middle infield play, outfielding, and baserunning for the little league level player",
        "Category": " Sports & Recreation , Coaching , Baseball",
        "Publisher": "Burford Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "My Life as a Skysurfing Skateboarder (The Incredible Worlds of Wally McDoogle #21)",
        "Authors": "By Myers, Bill",
        "Description": "Through a series of incredible mis-adventures (so what else is new), our boy blunder finds himself participating in the Skateboard Championship of the Universe. (It would be \"of the World\" except for the one kid who claims to be from Jupiter-a likely story, in spite of his two heads and seven arms.) It's a tough crowd where anything goes as long as you win. Amidst the incredible chaotic chaos by incurably corrupt competitors (say that five times fast), Wally learns there is more to life (or in his case, near-death) than winning.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Lizzie McGuire Mysteries: Case of the Missing She-Geek - Book #3: Junior Novel",
        "Authors": "By Banim, Lisa",
        "Description": "",
        "Category": "",
        "Publisher": "Volo",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The One Year Devotions for Couples: 365 Inspirational Readings",
        "Authors": "By Ferguson, David and Ferguson, Teresa",
        "Description": "Whether you have been married a few months or a few years, it’s likely that your level of intimacy could be better. You know the problems stem from the ways you relate. But how can you change?The One Year Devotions for Couples will help you give and receive love in a whole new way. Through the proven principles in this devotional, you will find fresh strength and new inspiration to meet your spouse’s relational needs. David and Teresa Ferguson, cofounders of Intimate Life Ministries, are seasoned counselors who can guide you toward better relational health. You can—and you will—improve your marriage and grow spiritually as a couple.Whether your marriage is shaky or solid, this devotional will give you health, hope, and healing for your relationship. Discover true spiritual and marital intimacy through the practical and biblical principles found in this popular couples’ devotional.",
        "Category": " Religion , Devotional",
        "Publisher": "Tyndale Momentum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Secrets of the Richest Man Who Ever Lived",
        "Authors": "By Murdoch, Mike",
        "Description": "",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Deborah Murdock Johnson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Dawn's Big Date (Baby-sitters Club)",
        "Authors": "By Martin, Ann M.",
        "Description": "Nervous about her blind date with Logan's cousin, Dawn tries to create a new image with new clothes, a new hairstyle, lots of makeup, and a new attitude",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Apple",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Book of Calm : Relaxing Ways to Manage Stress",
        "Authors": "By Warner Books",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Chicken Soup for the Christian Soul II: Stories of Faith, Hope and Healing (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Thieman, Leann (COM)",
        "Description": "Like a favorite passage from Scripture, these brand new stories offer hope, support and inspiration to Christians   of all denominations.   The themes of forgiveness, faith, hope, charity and love in Chicken Soup for the Christian Soul 2 will lift your spirits and warm your hearts.   Each story is a reminder of the daily miracles you can discover when you've welcomed Christ into your life. As you read these powerful stories, you will deepen your compassion for others, be inspired to greater acts of charity, remember to forgive others and yourself.  Most of all, you'll be reminded that you are never alone or without hope, for He is always walking by your side.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "HCI",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Fired to Hired: Bouncing Back from Job Loss to Get to Work Right Now",
        "Authors": "By Johnson, Tory",
        "Description": "If you want to get hired today, you must be a great candidate and an exceptional job seeker. Tory Johnson's New York Times bestseller, Will Work from Home, was comprehensive and inspiring. Now, the Women For Hire CEO and Good Morning America workplace contributor returns with advice and real-life stories for finding the right job after being let go. Tory knows what it takes to get noticed and hired, and helps you create a concrete action plan--one that will help you come out stronger and more successful than ever.  Giving up is not an option. Now's the time to get the lay of the land, sharpen your skills, and energize your search. Here you'll learn how to: *Get over the sting of being unemployed  *Develop a digital identity and dive into online social networking *Ensure your resume does not get lost in a big black hole  *Build and leverage your \"I Rock\" file to master essential self-promotion  *Pitch and secure an effective externship and make volunteer experience count  *Launch a valuable job club that will yield strong support, job leads, and career success",
        "Category": " Business & Economics , Home-Based Businesses",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Dump Trucks and Dogsleds #16: I'm on My Way, Mom! (Hank Zipzer)",
        "Authors": "By Winkler, Henry and Oliver, Lin",
        "Description": "When Hank first heard that his mom was having a baby boy, he wasn't so thrilled. And when he finds out that the baby will be sharing his room, Hank is positively outraged! To make things easier, Dad suggests he take Hank and Emily away for some bonding. But on the first day of their trip, a freak snowstorm arrives. And then they get a call that the baby is coming early! Hank, Dad, and Emily know they have to get home - and fast! They hop on a train, hitch a ride on a dump truck, jump on a snowmobile, and climb into a dogsled, all in a desperate attempt to get home in time for Baby Zipzer's birth.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Camping Catastrophe! (Ready, Freddy #14)",
        "Authors": "By Klein, Abby and McKinley, John (ILT)",
        "Description": "Max, the biggest bully in first grade, just can't believe that Freddy Thresher and his best friend, Robbie, are going on a camping trip this weekend. Worse yet, Freddy's sister, Suzie, has bet him a full week's worth of chores that he'll be too much of a scaredy-cat to spend the whole night in the wild! And, even though Freddy is a little bit worried, he sure isn't going to let Suzie win a bet that involves cleaning the basement! Shark head flashlight, sleeping back, tent, and S'more supplies in tow, Freddy, Robbie, and Mr. Thresher head off to the camp grounds for a weekend of campfire fun. But, when Freddy and Robbie stray from their firewood collecting and come across a busy beehive, the trip takes an adventurous and hilarious turn! A high-speed bee chase, a disastrous fishing contest, two spooky ghost stories, and one midnight bear visit later, Freddy will have plenty to tell Mrs. Wushy's class on Monday!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "The Blue Sky Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Twelve Bells for Santa",
        "Authors": "By Bonsall, Crosby Newell",
        "Description": "When the real Santa shows up at the Best Santa contest and then dashes off, Bee, Wilma, and Norman must journey to the North Pole to give him his prize",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1977"
        }
    },
    {
        "Title": "Glorious Intruder God's Presence in Life's Chaos",
        "Authors": "By Joni Eareckson Tada",
        "Description": "",
        "Category": "",
        "Publisher": "Family Christian Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "I'm Going to Read® (Level 1): Who Spilled the Milk? (I'm Going to Read® Series)",
        "Authors": "By Ziefert, Harriet, Linn, Margo, and Gradisher, Martha (ILT)",
        "Description": "Who spilled the milk? \"I don't know,\" says the child. Maybe the cat did it? A monster? A robber? And--most important: who will clean up the mess? Every parent and child will smile with recognition at this very, very familiar situation.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Stress and Health",
        "Authors": "By Rice, Phillip L.",
        "Description": "Rice offers the most comprehensive, research-based introduction to stress management and personal health programming available, addressing the theoretical aspects of stress and stress management. With clear, non-technical language packed with lively examples, he helps readers to identify personally with content and process. He includes the information, techniques, and skills needed to deal effectively with both physical and psychological stress and for readers to become informed consumers of personal health planning information. The book offers up-to-date coverage of theories and research in stress management; definitions and examples of physical and psychological stress; personal, family, social, and work-related stress management methods; and stress reduction techniques, including relaxation, autogenics; anxiety management, meditation, biofeedback, time management, nutrition, and exercise.",
        "Category": " Psychology , Clinical Psychology",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "5.81",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Too Blessed to Be Stressed Words of Wisdom for Women on the Move",
        "Authors": "By Johnson Cook, Suzan D.",
        "Description": "In Too Blessed to Be Stressed Dr. Suzan Johnson Cook shares her testament of faith and is living proof that stress doesn't have to stress you out. Dr. Cook uses her platform as the first female American Baptist pastor, a wife, a mother, as well as an appointee to President Clinton's Initiative on Race and Reconciliation to point out that many changes in life will happen - both good and bad. There is one constant that we can count on in this change-the unchanging and constant nature of God. Dr. Cook provides stories and hymns to show that God has blessings prepared for each and every women in their season of life.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Biscuit's Pet & Play Easter: A Touch & Feel Book",
        "Authors": "By Capucilli, Alyssa Satin and Berlin, Rose Mary (ILT)",
        "Description": "Cozy up for Easter fun with Biscuit, everyone's favorite little yellow puppy!Pet the fuzzy yellow chick and hunt for shiny Easter eggs as you join Biscuit in this Easter touch-and-feel adventure! The sturdy board book pages and simple text are just right for babies and toddlers. This Easter touch-and-feel book is a sweet way to share the holiday spirit with little ones. Woof, woof!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Count Karlstein",
        "Authors": "By Pullman, Philip and Bryan, Diana (ILT)",
        "Description": "Can you hear the distant howling of hounds and the thunder of ghostly hooves? It's All Souls' Eve and Zamiel the Demon Huntsman has come to claim his prey! He's headed straight for Castle Karlstein, where the evil count has hatched an evil plan; he'll sacrifice his two young nieces to save himself. Can Lucy and Charlotte outwit their uncle and his oily henchmen to escape their dreadful fate? From the award-winning author of The Golden Compass and The Subtle Knife comes a spooky, funny thriller just right for those middle-grade readers looking for horror--and humor.",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Everything Starts from Prayer: Mother Teresa's Meditations on Spiritual Life for People of All Faiths",
        "Authors": "By Stern, Anthony, M.D. (EDT)",
        "Description": "At the Home for the Dying in Calcutta, Mother Teresa often cared for the residents as they approached the end. As she was ministering to one illness-ravaged man, a visitor overheard her whisper a few words to him. \"You say a prayer in your religion, and I will say a prayer as I know it,\" she said. \"Together we will say this prayer and it will be something beautiful for God.\" These gentle words of solace and care provide us with a glimpse of a Mother Teresa often overlooked ? the universal teacher of prayer. With this deeply profound collection of her writings on prayer, Mother Teresa offers guidance and inspiration for people of all faiths seeking to walk a spiritual path. The first and only book devoted to Mother Teresa's teachings on prayer, it is interfaith in orientation and appeals equally to Catholics, Protestants, disenchanted Christians, people of non-Christian faith traditions, and unaffiliated spiritual seekers.",
        "Category": " Religion , Inspirational",
        "Publisher": "White Cloud Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "My Friends Call Me Monster (Goosebumps Horrorland #7)",
        "Authors": "By Stine, R. L.",
        "Description": "It's a whole new ride from master of fright and bestselling author R.L. Stine--with a story so fiendish that it can't be contained in just one book!Before joining the other kids trapped in HorrorLand, Michael Munroe will learn a few new lessons in FEAR: Never trust a teacher who calls everybody \"Little Monsters.\" Be careful if that teacher invites you to lunch at her house.  And never EVER trust a teacher with a giant monster egg in her own attic--especially if it's about to hatch!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Rice Krispies Treats Cookbook",
        "Authors": "By Kellogg's",
        "Description": "",
        "Category": "",
        "Publisher": "Fog City Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Saving Juliet",
        "Authors": "By Selfors, Suzanne",
        "Description": "Mimi Wallingford is a teen actress from a famous Broadway family. Unfortunately, she wants no part of a life in theatre, nor can she stand Troy, the teen pop idol who is cast to play Romeo opposite her as Juliet. When she and Troy are suddenly thrust back into Shakespeare's Verona, Mimi meets and befriends Juliet, seeing that they have more in common than just Shakespeare. With Troy's help, she saves Juliet and her Romeo from their tragic destiny, bringing both pairs of star-crossed lovers a happy ending.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Bloomsbury Children's Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Mama Dearest",
        "Authors": "By Harris, E. Lynn",
        "Description": "E. Lynn Harris has wowed millions of readers with his signature blend of complex drama and undeniable heart that permeates his novels. Recently included on Ebony ’s “Most Intriguing Blacks” list, and Savoy ’s “100 Leaders and Heroes in Black America,” the award-winning Harris returns with another sure-fire winner in Mama Dearest —an irresistible tale featuring the incomparable heroine who first appeared in Not a Day Goes By and Any Way the Wind Blows , two of Harris’s most popular and bestselling novels.Ambitious singer, actress, and Broadway bombshell Yancey Harrington Braxton is on top of the world when the sudden reappearance of a long-lost daughter turns her world upside down. But when Yancey learns that her daughter wishes to follow in her mother’s dramatic footsteps, she begins to make peace with the past she’s struggled to keep hidden. A sweeping novel about mothers and daughters, secrets and lies, Mama Dearest will capture and enchant audiences everywhere.?",
        "Category": " Fiction , African American , Contemporary Women",
        "Publisher": "Gallery Books/Karen Hunter Publishing",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Rare Treasures from Grimm: Fifteen Little-Known Tales",
        "Authors": "By Grimm, Wilhelm and Grimm, Jacob",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Too Big to Save? How to Fix the U.S. Financial System",
        "Authors": "By Pozen, Robert",
        "Description": "Industry luminary Robert Pozen offers his insights on the future of U.S. financeThe recent credit crisis and the resulting bailout program are unprecedented events in the financial industry. While it's important to understand what got us here, it's even more important to consider how we should get out. While there is little question that immediate action was required to stabilize the situation, it is now time to look for a long-term plan to reform the United States financial industry.That is where Bob Pozen comes in. Perhaps more than anyone in the industry, Pozen commands the respect and attention of the public and private sector. In this timely guide, he outlines his vision for the new financial future and provides actionable advice along the way. To Pozen, there are four high-priority problems that must be addressed, and this book puts them in perspectiveAnalyzes alternative models for government stakes in banksRecommends a new board structure for large financial institutionsExamines the importance of broader Fed jurisdiction over systemic risksProposes a way to revive the securitization of loansWith Too Big to Save, you'll learn the likely future of the finance industry and understand why changes have to be made.",
        "Category": " Business & Economics , Economic Conditions",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.65",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Ending Slavery: How We Free Today’s Slaves",
        "Authors": "By Bales, Kevin",
        "Description": "\"None of us is truly free while others remain enslaved. The continuing existence of slavery is one of the greatest tragedies facing our global humanity. Today we finally have the means and increasingly the conviction to end this scourge and to bring millions of slaves to freedom. Read Kevin Bales's practical and inspiring book, and you will discover how our world can be free at last.\"--Desmond Tutu\"Ever since the Emancipation Proclamation, Americans have congratulated themselves on ending slavery once and for all. But did we? Kevin Bales is a powerful and effective voice in pointing out the appalling degree to which servitude, forced labor and outright slavery still exist in today's world, even here. This book is a valuable primer on the persistence of these evils, their intricate links to poverty, corruption and globalization--and what we can do to combat them. He's a modern-day William Lloyd Garrison.\"--Adam Hochschild, author of Bury the Chains: Prophets and Rebels in the Fight to Free an Empire's Slaves\"I know modern slavery from the inside, and since coming to freedom I am committed to end it forever. This book shows us how to make a world where no more childhoods will be stolen and sold as mine was.\"--Given Kachepa, former U.S. slave, recipient of the Yoshiyama Award\"Kevin Bales does not just pontificate from behind a desk. From the charcoal pits of Brazil to the brothels of Thailand, he has seen the victims of modern day slavery. In Ending Slavery, Bales gives us an update on what's happening (and not happening), and a controversial plan to abolish slavery in the 21st century. This is a must read for anyone who wants to learn about the great human rights issue of our times.\"--Ambassador John Miller, former director of the U.S. State Department's Office to Monitor and Combat Trafficking in Persons",
        "Category": " Political Science , Globalization",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "A Rumpole Christmas: Stories",
        "Authors": "By Mortimer, John",
        "Description": "Horace Rumpole isn't particularly fond of Christmas Day - he finds it has a horrible habit of dragging on as he and She Who Must Be Obeyed go through the usual rituals in Froxbury Mansions. After the exchange of presents (lavender water for her, a tie for him), they settle down to a supermarket turkey with all the trimmings, followed by a glass of port. The only excitement comes in deciding whether to stand for the national anthem after the Queen's speech.But at least the criminal fraternity rarely takes a holiday, so over the years Rumpole has found his festive celebrations disturbed in most welcome ways. Whether it's a Father Christmas who behaves suspiciously at Equity Court's Christmas party, or a high-profile murder trial that comes up at the Bailey just before the holiday season or a body discovered at the health spa where Rumpole is gloomily trying to survive a not-so-festive Christmas diet of yak's milk and spinach - there's always something wonderfully unlawful to liven up the dull holiday plans.When Sir John Mortimer died in January 2009, it was widely agreed that Horace Rumpole was his greatest fictional creation. In these delightful Christmas stories, never before published in book form, the great barrister lives on.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    }
]