[
    {
        "Title": "Moses: A Man of Selfless Dedication (Great Lives from God's Word, Volume 4)",
        "Authors": "By Swindoll, Charles R.",
        "Description": "Charles Swindoll presents the Bible's real Moses-the Moses who tried to decline his assignment from God; the Moses who dazzled Pharoh; the Moses who received the Ten Commandments; the Moses who was disobedient and weak; the Moses who was the greatest leader of God's people in all of history. Through his faith and selfless dedication, Moses continually chose to follow God's will through difficult and seemingly impossible situations. This is the fourth volume of Swindoll's \"Great Lives\" series.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Discover Your God-Given Gifts",
        "Authors": "By Fortune, Don and Fortune, Katie",
        "Description": "Learn how spiritual gifts affect thinking, actions, and relationships and how to best use those gifts in ministry. Workbook format.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Chosen Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "The E-Myth Manager: Why Management Doesn't Work - and What to Do About It",
        "Authors": "By Gerber, Michael E.",
        "Description": "More than ten years after his first bestselling book, The E-Myth, changed the lives of hundreds of thousands of small business owners, Michael Gerber椮trepreneur, author, and speaker extraordinaire楩res the next salvo in his highly successful E-Myth Revolution. Drawing on lessons learned from working with more than 15,000 small, medium-sized, and very large organisations, Gerber has discovered the truth behind why management doesn′t work and what to do about it. Unearthing the arbitrary origins of commonly held doctrines such as the omniscience of leader (Emperor) and the most widely embraced myth of all擨e E-Myth Manager offers a fresh, provocative alternative to management as we know it. It explores why every manager must take charge of his own life, reconcile his own personal vision with that of the organisation, and develop an entrepreneurial mind-set to achieve true success.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "100 Great Soup, Stew & Chili Recipes",
        "Authors": "By Prager, Carol",
        "Description": "Recipes for hot and cold soups, borscht, bouillabaise, burgoo, chowder, gumbo, ragout, gazpacho, stews, and chilis are accompanied by nutritional analyses",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "U.S. Constitution and You, The",
        "Authors": "By Sobel, Syl and Gilgannon, Denise (ILT)",
        "Description": "All elementary school students learn about the history of the U.S. Constitution when they first begin social studies. This book is different. It tells boys and girls about the great American document itself--explaining exactly what the Constitution does, as well as how it affects and protects people today. Kids discover how the Constitution provides for the federal government's three branches--legislative, executive, and judicial. Then they see how it gives all citizens many rights, including the right to vote, to enjoy freedom of speech and the press, to worship--or not worship--according to one's religious beliefs, to disagree openly with government policy, and to defend oneself in courts of law when accused of crimes or civil wrongs. Kids also see how, according to the Constitution, many rights are kept beyond control of the federal government, and are reserved for the separate states, communities, and individuals. This book's language is clear and simple. It cites many examples that relate directly to each student's own experiences.",
        "Category": " Juvenile Nonfiction , Social Science , Politics & Government",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Yoga Journal's Yoga Basics: The Essential Beginner's Guide to Yoga For a Lifetime of Health and Fitness",
        "Authors": "By Carrico, Mara and Yoga Journal (EDT)",
        "Description": "Welcome to the world of yoga.Yoga Journal's Yoga Basics offers the first truly comprehensive introduction to the practice of this popular ancient healing art. Produced by a teacher of yoga for over 25 years and the editors ofYoga Journal, it offers all the inspiration and instruction you'll need to develop your own at-home yoga practice. Beginning with an exploration of the roots of yoga, the book goes on to describe a variety of hatha yoga styles-- Iyengar, Ashtanga, Kundalini, and others-- so you can choose the method that's appropriate for you. Featuring easy-to-follow instructions and 140 black-and-white photographs to illustrate the postures,Yoga Basics provides a thorough understanding not only of the mechanics of technique but of all the important elements that make yoga so much more than a fitness regime. In this unique book you'll find:* Tips on the use of the breath in yoga practice and breath awareness exercises* Guidelines for regular practice, including health and safety considerations* Dozens of illustrated postures-- standing, seated, supine, and prone-- with their benefits described* Sample Yoga routines that can be done in as little as 15 minutes per day* Instruction on the practice and power of meditation",
        "Category": " Health & Fitness , Yoga",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Arco 1001 Ideas For Science Projects Environment: Third Edition",
        "Authors": "By Brisk, Marion A.",
        "Description": "Presents ideas for projects and reports in astronomy, biology, chemistry, physics, and other scientific fields, and includes tips on choosing and researching a topic and a key to the difficulty level and special requirements of each project",
        "Category": " Study Aids , General",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Thank You, Dr. Martin Luther King, Jr.",
        "Authors": "By Tate, Eleanora E.",
        "Description": "Reluctant to participate in the Black history portion of her school play, Mary Elouise begins changing her mind when a Black storyteller visits her classroom and intrigues her with tales of Africa",
        "Category": "",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Rubbish!: The Archaeology of Garbage",
        "Authors": "By Murphy, Cullen and Rathje, William L.",
        "Description": "For the past 20 years the U. of Arizona's Garbage Project has sifted, sorted, and classified a quarter of a million pounds of garbage. Rathje, the director of the Garbage Project, and Murphy, managing editor of  The Atlantic monthly , tell us what our garbage tells about us. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Social Science , Archaeology",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The Flavors of Bon Appetit 2000",
        "Authors": "By Bon Appetit (EDT)",
        "Description": "The food magazine's annual roundup of great recipes includes instructions for preparing paella with chicken, shrimp, and sausage; grilled trout with lemon-sage butter; poached pears, and much more.",
        "Category": " Cooking , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Irish Love (Nuala Anne McGrail Novels)",
        "Authors": "By Greeley, Andrew M.",
        "Description": "Continuing the enchanting chronicles of the fabulous Nuala Anne McGrail and her spear-carrying husband Dermot, bestselling author Andrew M. Greeley takes them once again to Ireland for another thrill-packed adventure.Back on the Emerald Isle, Nuala and Dermot soon get the feeling that someone is out to get them. They find themselves dodging multiple explosions, and someone starts shooting at Nuala while she is water-skiing in the cold Atlantic. Meanwhile, the handsome parish priest, Father Jack, has given Dermot the diary of a young Chicago newspaperman. Written in the year 1882, the diary tells in horrendous detail an intriguing story of a mass murder and a trumped-up trial in which one of Ireland's greatest heroes was accused of the murders without a shred of evidence. These two stories, ancient and modern, soon get mixed up, and they make for an utterly fascinating tale of murder, betrayal, and redemption with Nuala and her magical powers at the center of it all. Andrew Greeley not only tells us a riveting tale of adventure and derring-do, he gives us a picture of modern-day prosperous Ireland and the engaging and, of course, sometimes villainous people who live there.",
        "Category": " Fiction , Literary",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Four Blind Mice (Alex Cross #8)",
        "Authors": "By Patterson, James",
        "Description": "In this #1 New York Times bestseller, Alex Cross is ready to resign-but when his partner shows up with a case he can't refuse, he goes up against the most bone-chilling killers of his entire career.Detective Alex Cross is on his way to resign from the Washington, D.C., Police Force when his partner's oldest friend-a Vietnam veteran-is arrested for murder. He is subject to the iron hand of the United States Army, and the evidence against him is strong enough to send him to the gas chamber.Sampson is certain his friend has been framed, and Alex's investigation turns up evidence overlooked-or concealed-by the military authorities. Drawing on their years of street training and an almost telepathic mutual trust, Cross and Sampson go deep behind military lines to confront the most terrifying-and deadly-killers they have ever encountered. Behind these three highly skilled killing machines there appears to be an even more threatening controller. Discovering the identity of this lethal genius will prove to be Cross's most terrifying challenge ever.On his visits home, Alex must confront another, more harrowing mystery: what's the matter with Nana Mama? As he explores the possibility of a new relationship with a woman who offers him new hope, Alex must also confront the fact that his beloved grandmother is only human.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "A Caress of Twilight (Meredith Gentry, Book 2)",
        "Authors": "By Hamilton, Laurell K.",
        "Description": "I am Princess Meredith, heir to a throne–if I can stay alive long enough to claim it. My cousin, Prince Cel, is determined to see that I don’t. As long as we both live, we are in a race for the crown: Whichever one of us reproduces first gets the throne. So now the men of my royal guard– frightening warriors skilled with blade, spell, and gun–have become my lovers, auditioning with pleasure for the role of future king and father of my child. And they must still protect me from assassination attempts–for unlike most of the fey, I am part human, and very mortal. All this royal back-stabbing makes it very difficult for me to pursue my living as a private investigator in Los Angeles, especially since the media made sure the whole world knows the Faerie princess is alive and well in sunny California.Now, in the City of Angels, people are dying in mysterious, frightening ways. What the human police don’t realize is that the killer is hunting the fey as well. Havoc lies on the horizon: the very existence of the place known as Faerie is at grave risk. So now, while I enjoy the greatest pleasures of my life with my guardians, I must fend off an ancient evil that could destroy the very fabric of reality. And that’s just my day job. . . .From the darkling throng to the glittering court, this is a world of magic and delights, greed and grotesque ambitions. Laurell K. Hamilton has created a mythos of extreme power and pure beauty that is a delight to behold.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Pop Goes the Weasel (Alex Cross, 5)",
        "Authors": "By Patterson, James",
        "Description": "Detective Alex Cross is in love, but in Washington D. C. he must face a villain he will never forget.Alex Cross is happy, but his happiness is threatened by a series of chilling murders-murders with a pattern so twisted, it leaves investigators reeling. Cross's ingenious pursuit of the killer produces a suspect: a British diplomat named Geoffrey Shafer. But proving that Shafer is the murderer becomes a potentially deadly task. As the diplomat engages in a brilliant series of surprising countermoves, in and out of the courtroom, Alex and his fiancée become hopelessly entangled with the most memorable nemesis Alex Cross has ever faced.Pop Goes the Weasel reveals James Patterson at the peak of his power. Here is a chilling villain no reader will forget, a love story of great tenderness, and a plot of relentless suspense and heart-pounding pace. To read Pop Goes the Weasel is to discover why James Patterson is one of the world's greatest suspense writers.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Way of an Eagle",
        "Authors": "By Darden, Bob and Richardson, P. J.",
        "Description": "",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Black Light",
        "Authors": "By Hand, Elizabeth",
        "Description": "Like her friends in upstate Kamensic, Charlotte, \"Lit\", Moylan is a child of privilege. Blessed with a famous father (Uncle Cosmo on \"Tales of the Bar Sinister\") and a notorious mother (soap queen Livia Prentiss), Lit is ready to enjoy one last, wild fling before college and adulthood.She is far from alone. In fact, the whole town is ready to party. Alex Kern is coming back to Kamensic. The legendary film director, who made his way to Hollywood via Warhol's \"black light\" scene, is going to reopen his fabulous mansion, Bolerium, for a party. But not just any party. The Halloween party of the decade... of the century.But other, more disturbing guests are arriving daily. They are seen at the edges of the forest, at the margins of the night: a great stag, extinct for two millennia; a horned man robed in blood; a forgotten god, lusting to tell a young girl what she desperately wants to hear. For Kern's connections extend far beyond Hollywood, beyond even the modern age... and in Bolerium's echoing halls a fearsome confrontation is gathering, between the ancient powers of the Malandanti and the immortals sworn to stop them at any cost, no matter what the sacrifice.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Harper Prism",
        "Price Starting With ($)": "25.73",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Grant Comes East",
        "Authors": "By Gingrich, Newt, Forstchen, William R., and Hanser, Albert S.",
        "Description": "Grant Comes East, the second book in the bestselling series by Newt Gingrich and William R. Forstchen, continues the story of a Confederate victory at Gettysburg. The first book examined the great \"what if\" of American history: Could Lee have won the Battle of Gettysburg? A Confederate victory, however, would not necessarily mean that the Southern cause has gained its final triumph and a lasting peace. It is from this departure point that the story continues in Grant Comes East, as General Robert E. Lee marches on Washington, DC, and launches an assault against one of the largest fortifications in the world.Across 140 years, nearly all historians have agreed that after the defeat of the Army of the Potomac at Gettysburg, the taking of Washington, DC, would end the war. But was it possible?Lee knows that a frontal assault against such fortifications could devastate his army, but it is a price he fears must be paid for final victory. Beyond a military victory in the field, Lee must also overcome the defiant stand of President Abraham Lincoln, who vows that regardless of the defeat at Gettysburg, his solemn pledge to preserve the Union will be honored. Lincoln will mobilize the garrison of Washington to hold on no matter what the costs.At the same time, Lincoln has appointed General Ulysses S. Grant as commander of all Union forces. Grant, fresh from his triumph at Vicksburg, races east, bringing with him his hardened veterans from Mississippi to confront Lee.What ensues across the next six weeks is a titanic struggle as the surviving Union forces inside the fortifications of Washington fight to hang on, while Grant prepares his counterblow. The defeated Army of the Potomac, staggered by the debacle dealt at Gettysburg, is not yet completely out of the fight, and is slowly reorganizing. Its rogue commander, General Dan Sickles, is thirsting for revenge against Lee, the restoration of the honor of his army, and the fulfillment of his own ambitions, which reach all the way to the White House. All these factors will come together in a climatic struggle spanning the ground from Washington, through Baltimore, to the banks of the Susquehanna River.Once again, Newt Gingrich and William R. Forstchen create a brilliant story of how the Civil War could have unfolded. In Grant Comes East, they use their years of research and expertise to take readers on an incredible journey.",
        "Category": " Fiction , Historical",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Business law; principles and cases",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "R. D. Irwin",
        "Price Starting With ($)": "8.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Elmo's World: Animals! (Sesame Street) (Sesame Street(R) Elmos World(TM))",
        "Authors": "By Barrett, John E. (ILT), Barrett, John E. (PHT), and Nelson, Mary Beth (ILT)",
        "Description": "Toddlers will love lifting the flaps and discovering all different kinds of animals and the things they do, in a colorful board book which features the lovable Sesame Street muppets.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Working Hard With the Rescue Helicopter (Tonka Truck Storybooks)",
        "Authors": "By Petruccio, Steven James (ILT), Benjamin, Cynthia, and Tonka Corporation (COR)",
        "Description": "A rescue helicopter pilot spends his day saving people caught in dangerous situations such as fires, floods, and hurricanes before returning home for his daughter's birthday party.",
        "Category": " Juvenile Fiction , Transportation , General",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Spot Sleeps Over",
        "Authors": "By Hill, Eric",
        "Description": "Forgetting his teddy bear when he is invited to spend the night at Steve's house, a frantic Spot is very much relieved when his understanding mother saves the day.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "What to Do, Blue? (Blue's Clues)",
        "Authors": "By Kessler, Todd, Santomero, Angela C., Craig, Karen (ILT), and Johnson, Traci Paige (ILT)",
        "Description": "Hmm...Blue doesn't know what to do. All her friends are busy. But watching her friends gives Blue an idea -- and she soon comes up with something fun to do, all by herself!",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Hide and Seek! (The Little Engine That Could)",
        "Authors": "By Wendy Cheyette Lewison",
        "Description": "",
        "Category": "",
        "Publisher": "8420635",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Changeling Bride",
        "Authors": "By Cach, Lisa",
        "Description": "Fairies and romance combine in an enchanting tale of the English Earl of Alsbrook who finds a perfect soul-mate in Wilhelmina March, a modern woman whom fairies magically transported back to his Georgian time period. Original.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Last Time I Saw Paris",
        "Authors": "By Adler, Elizabeth",
        "Description": "Angry when her husband backs out of their second honeymoon in Paris, Lara, a fortysomething woman whose marriage to a busy surgeon is falling apart, asks the thirty-two-year-old construction worker repairing her deck to accompany her on the trip, embarking on a madcap, romantic adventure that transforms her life. By the author of Before and After. 35,000 first printing.",
        "Category": " Fiction , Romance , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Ghost Walk (Harrison Investigation)",
        "Authors": "By Graham, Heather",
        "Description": "The manager of a New Orleans haunted-tour company, Nikki DuMonde finds herself in the middle of this suspenseful tale of paranormal visitations, nightmares, and murder. Original.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Wife for Hire",
        "Authors": "By Evanovich, Janet",
        "Description": "Hank Mallone knows he's in trouble when Maggie Toone agrees to pretend to be his wife in order to improve his rogue's reputation. Will his harebrained scheme to get a bank loan for his business backfire once Maggie arrives in his small Vermont town and lets the gossips take a look?Maggie never expected her employer to be drop-dead handsome, but she's too intrigued by his offer to say no . . . and too eager to escape a life that made her feel trapped. The deal is strictly business, both agree, until Hank turns out to be every fantasy she ever had.",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Navy Husband (Bestselling Author Collection)",
        "Authors": "By Macomber, Debbie",
        "Description": "I, Shana Berrie, am my sister's official navy \"parenting plan.\" That means I'm in charge of adorable Jazmine until my sis returns. But&#151;surprise!&#151;nine-year-olds have lots of opinions, including ones on my love life (or lack thereof ). Now she's trying to set me up with our family friend, Adam Kennedy. Excuse me&#151;Lieutenant Commander Adam Kennedy. So he's great looking and very helpful (if dictatorial), but I am not in the market for a navy husband.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin Bestselling Author Collection",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Friends Forever: Happy Feet",
        "Authors": "By Ciminera, Siobhan",
        "Description": "Even though they are very different in some ways, two emperor penguins named Mumble and Gloria have been best friends since they were hatched, and know they will remain so for the rest of their lives. Original.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Elmo's World: Love! (Sesame Street) (Sesame Street(R) Elmos World(TM))",
        "Authors": "By McMahon, Kara and Nelson, Mary Beth (ILT)",
        "Description": "Elmo tells toddlers all about all there is to love, including family, friends, pets, and favorite things.   This warm and fuzzy lift-the-flap book offers both the serious explanations and the   humor that are the hallmark of the Elmo’s World series on Sesame Street. A perfect read   for Valentine’s Day!",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Elmo's World: Opposites! (Sesame Street) (Sesame Street(R) Elmos World(TM))",
        "Authors": "By McMahon, Kara",
        "Description": "Elmo introduces young readers to the concept of opposites—from large and small to in and out, up and down. Elmo shows one word on a page and then the young reader can guess the opposite and flip the flap in the spread to see the answer. This is fun-filled interactive learning at its best!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Pretties (Uglies Trilogy, Book 2)",
        "Authors": "By Westerfeld, Scott",
        "Description": "Gorgeous. Popular.Perfect. Perfectly wrong.Tally has finally become pretty. Now her looks are beyond perfect, her clothes are awesome, her boyfriend is totally hot, and she's completely popular. It's everything she's ever wanted.But beneath all the fun -- the nonstop parties, the high-tech luxury, the total freedom -- is a nagging sense that something's wrong. Something important. Then a message from Tally's ugly past arrives. Reading it, Tally remembers what's wrong with pretty life, and the fun stops cold.Now she has to choose between fighting to forget what she knows and fighting for her life -- because the authorities don't intend to let anyone with this information survive.",
        "Category": " Young Adult Fiction , Science Fiction , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Mealtime Memories: Sharing the Warmth of Family Traditions",
        "Authors": "By Kinkade, Thomas",
        "Description": "In this unique family book, each classic Thomas Kinkade painting-those of lamp-lit homes, serene cottages, and beautiful mountain streams-is paired with full meal menu to match the scene portrayed. In addition to satisfying, simple recipes, each chapter includes a mealtime devotional also tied to the theme of the painting. Special prayers of thanks and Scripture celebrating the importance of family round out this distinctive devotional. As an added treat, scattered throughout the book are stories of significant Kinkade family traditions as well as a few favorite family recipes.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Garden of Friendship: Celebrating the Blessings of Loved Ones",
        "Authors": "By Kinkade, Thomas",
        "Description": "\"A friend may well be reckoned the masterpiece of nature,\" said Ralph Waldo Emerson. Thomas Kinkade celebrates the joys of friendship with this new full-color book. Featuring quotes on friendship and thoughts on walking together through life with others,The Garden of Friendship offers a beautiful way for readers to share how much a friendship means. Peaceful garden scenes that inspire quiet reflection, as well as Scriptures and thoughts on friendship from wise men and women, make this a book to treasure like a favorite companion. Thomas Kinkade says, \"I intentionally seek out companions who enjoy good conversation and positive activities; people who, like me, believe that life still offers a lot to be hopeful about and that many of the problems in the world are fixable.\" The Garden of Friendship reminds us all of that rare gift: a good friend.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Tapas: The Essential Kitchen series",
        "Authors": "By Tapper, Richard",
        "Description": "In taverns from Madrid to Barcelona you'll find Spaniards passing the early evening hours drinking crisp dry sherry and snacking on a variety of snacks—or tapas. Everything from a simple plate of olives and chorizo sausage with a loaf of good bread to feasts that include Spanish omelets, shrimp with garlic and stuffed tomatoes. While this style of eating is wonderful for warm Mediterranean evenings, it is also perfect for entertaining and quick meals.Now, with this practical cookbook, you can make your own tapas at home, using Tapas' step-by-step instructions and photographs to show you how to make a variety of dishes. The recipes are easy to follow and are suitable for both beginners and experienced cooks. Filled with elegant photographs, this beautifully designed volume is a great addition to any cookbook collection. Recipes include:Chorizo and Olive EmpanadasSpicy Shrimp OmeletCheese Marinated in Tarragon and GarlicLamb Brochettes with RosemaryMussels Steamed in Spicy Tomato SauceStuffed Lobster Tails",
        "Category": " Cooking , Regional & Ethnic , General",
        "Publisher": "Periplus Editions",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Best Revenge",
        "Authors": "By White, Stephen",
        "Description": "Psychologist Alan Gregory is living through a season of discontent. With a new daughter, a wonderful wife, and a prospering career, he has little to complain about and lots of regrets: past cases that won't let him go, patients who don't get better, and a growing unease with keeping secrets. But Gregory has two new patients who will drag him out of his introspection - and dare him to enter a storm of injustice and revenge.FBI special agent Kelda James is a hero, a woman who as a rookie agent made a choice, drew her gun, and saved a life, taking another. Now Kelda is hiding from the world a secret pain that is gradually crippling her body - and she has turned to Alan Gregory to help free her from the prison of her pain. Then Kelda refers a patient to Gregory, who is terrifyingly dangerous to them both.Tom Clone served thirteen years on Colorado's death row for a crime he claimed he didn't commit - until an FBI agent dug up evidence that set him free. The agent's name: Kelda James. With both Kelda and Clone telling him their innermost secrets, Alan Gregory becomes the one person who can piece together an extraordinary puzzle - of two unsolved violent deaths of vulnerable women, of a man who may be innocent or may be very lucky, and of the strange, fatal attraction between two people trapped in a horrific plot to get revenge - at any price.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Words of Silk",
        "Authors": "By Brown, Sandra",
        "Description": "Laney McLeod's chance encounter in a Manhattan elevator leads to a one-night stand with a wealthy playboy -- but a few months later he's back with shocking news, as irresistible as ever.Laney's life changes the minute she gets stuck in an elevator in Manhattan -- and relies on a handsome stranger named Deke Sargent to help her fight her claustrophobia. When the power comes back on, the two find themselves in a passionate embrace that leads to a single night together. Shocked by her own recklessness, Laney disappears the next morning.  Months later, she receives an even greater shock: Deke shows up with an astounding announcement. Unable to forget the chemistry between them, but afraid that she's just another notch on this wealthy playboy's bedpost, Laney must face an even deeper fear . . . or forever lose the one man she can't resist.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Laced (Regan Reilly Mysteries, No. 10)",
        "Authors": "By Clark, Carol Higgins",
        "Description": "A haunted Irish castle, international jewel thieves, and a hotel fire -- New York Times bestselling author Carol Higgins Clark has sent Regan and Jack Reilly on a honeymoon like no other!    Private Investigator Regan Reilly and her new husband, Jack, head of the NYPD Major Case Squad, are off to Ireland. But their very first night at romantic Hennessy Castle is interrupted by a fire alarm that distracts hotel employees from the theft of a valuable antique lace tablecloth out of the castle's memorabilia room. A taunting note is left for Jack by the culprits -- a notorious pair of jewel thieves whom he has been pursuing for over a year. Disguised as an elderly couple, they had checked out in the midst of the mayhem. Regan's cousin Gerard Reilly, a Galway resident, is eager to help with the hunt, but their search takes as many twists and turns as the winding country roads of the Emerald Isle.   With Carol Higgins Clark's unique talent for creating quirky characters, this is a classic caper that will keep you laughing, turning pages, and maybe even believing in ghosts.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Little, Brown Essential Handbook, The (5th Edition)",
        "Authors": "By Aaron, Jane E.",
        "Description": "This handy book answers questions about usage, grammar, punctuation, mechanics, research writing, and documentation. With minimal terminology and clear explanations and examples, Jane E. Aaron covers the essentials for writers in and out of school. This second edition offers special sections on nonsexist language, document design, job applications, E-mail, ESL pointers for nonnative speakers, and citing sources (including electronic sources) across the curriculum.",
        "Category": " Technology & Engineering , Technical Writing",
        "Publisher": "Longman",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Living La Dolce Vita: Italian Secrets to Living a Happy, Passionate, and Well-Balanced Life",
        "Authors": "By Mautner, Raeleen D'Agostino, Ph.D.",
        "Description": "Rejuvenate your life with these zesty Italian principles.America's yearning for living life with passion and serenity is answered in simple, concrete steps and examples of how to adopt the Mediterranean dolce vita, or \"sweet life.\"Living La Dolce Vita will help you channel \"the sweet life\" through:--The power of family--The art of friendship--The unabashed joy of romance--Meals that nourish both body and soul",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Wonder Years: Helping Your Baby and Young Child Successfully Negotiate The Major Developmental Milestones",
        "Authors": "By American Academy of Pediatrics (COR) and Remer Altmann, Tanya (EDT)",
        "Description": "From America’s most trusted pediatric authority comes an indispensable, easy-to-use guide to helping your baby and young child flourish in the first five years of life—physically, mentally, and emotionally.The first five years of a child’s life are filled with major developmental and behavioral milestones. During this period your infant becomes an individual who has mastered a range of skills—from walking to making conversation–that prepares him or her to enter the world beyond home and family. For parents, this wondrous time provides an opportunity to help children fulfill their potential. The Wonder Years shows you how to make the most of it. Written in the same warm and accessible language that has endeared the Academy’s bestselling Caring for Your Baby and Young Child: Birth to Age 5 to millions of parents for over fifteen years, this doctor-approved resource features a variety of fun-filled activities, tips, and hints, and offers the most dependable, authoritative, up-to-date information on child development, including:• Ideal patterns of growth at every stage—and normal variances • Parent-child activities that help you monitor and promote your   child’s development• Easy ways to create an enriching home environment • A “behind-the-scenes” look at what’s going on in your   child’s developing brain• Information on aiding children with special needs–from ADHD, autism,   and learning disabilities to those who are gifted• Advice on consulting specialists, including nutritionists, occupational therapists, and counselors• Tips on safety and injury prevention • How factors like birth order and gender impact developmentWith five hundred full-color photographs and illustrations, developmental time lines, charts, and graphs, this family-friendly book is the definitive guide no parent or caregiver can afford to be without.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "History of Art",
        "Authors": "By Bradbury, Kirsten et al",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing (UK), 2002",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "At Risk (Win Garano)",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "A Massachusetts state investigator is called home from Knoxville, Tennessee, where he is completing a course at the National Forensic Academy. His boss, the district attorney, attractive but hard-charging, is planning to run for governor, and as a showcase she's planning to use a new crime initiative called At Risk-its motto: \"Any crime, any time.\" In particular, she's been looking for a way to employ cutting-edge DNA technology, and she thinks she's found the perfect subject in an unsolved twenty-year-old murder-in Tennessee. If her office solves the case, it ought to make them all look pretty good, right?Her investigator is not so sure-not sure about anything to do with this woman, really-but before he can open his mouth, a shocking piece of violence intervenes, an act that shakes up not only both their lives but the lives of everyone around them. It's not a random event. Is it personal? Is it professional? Whatever it is, the implications are very, very bad indeed . . . and they're about to get much worse.Sparks fly, traps spring, twists abound-this is the master working at the top of her game.View the trailer for \"Patricia Cornwell's At Risk\", premiering on Lifetime on April 10, 2010.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Fireside (The Lakeshore Chronicles, 5)",
        "Authors": "By Wiggs, Susan",
        "Description": "Baseball hopeful Bo Crutcher is about to get his shot at the majors. That is, until life throws him a curveball. When AJ, the son he's never met, lands on his doorstep, Bo's life becomes a whole new ball game. He needs help&#151;fast.Enter Kimberly van Dorn. Hired to smooth Bo's rough exterior for the media, she expects the kind of shallow pro athlete she's used to handling. But Bo is willing to sacrifice everything for his vulnerable son. Kim can train him to hit a home run with the press, but over a breathtaking winter on frozen Willow Lake, she realizes he has far more to teach her about the game of life&#133;and putting love first.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Sky Is Falling",
        "Authors": "By Sheldon, Sidney",
        "Description": "The Winthrops are America's royal family, and its Prince Charming is the sexy, charismatic Gary Winthrop. Now the man on his way to becoming the Senate's brightest new star is found murdered in his home-the latest in a series of incidents that have killed five members of the family in a single year. One of the last people to see Gary Winthrop alive is Washington anchorwoman Dana Evans. She makes it her mission to investigate these seemingly random tragedies, little realizing that her search will sweep her across several continents, place her and her young son in grave danger, and lead her to a truth that will astound the world.",
        "Category": " Fiction , Thrillers",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "12 Steps to Raw Foods: How to End Your Addiction to Cooked Food",
        "Authors": "By Boutenko, Victoria and Cousens, Gabriel (FRW)",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Natural Foods",
        "Publisher": "Raw Family Publishing",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Delicious Whole Nectar Power Smoothies",
        "Authors": "By Bob Mulligan, Wendy Mulligan",
        "Description": "",
        "Category": "",
        "Publisher": "Whole Nectar Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Lawrence Sanders McNally's Folly (Archy McNally Novels)",
        "Authors": "By Sanders, Lawrence and Lardo, Vincent",
        "Description": "As a local theater group prepares its production of Arsenic and Old Lace, a tense off-stage drama threatens to bury the play before opening night., and it is up to suave sleuth Archy McNally to uncover the culprit. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "How It All Vegan!: Irresistible Recipes for an Animal-Free Diet",
        "Authors": "By Kramer, Sarah and Barnard, Tanya",
        "Description": "Vegan food is fabulous food, full of flavor and all the nutrients you need. With fun illustrations and a cool, punky sensibility, How It All Vegan! will tempt you to join the Vegan Empire. \"Written with sass, style, and a sense of humor. More than just a cookbook. . . .\"—BUST",
        "Category": " Cooking , Vegan",
        "Publisher": "Arsenal Pulp Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Food, Fitness and Health",
        "Authors": "By Tatchell, Judy and Fraser, Kate",
        "Description": "Provides information about nutrition, vitamins, minerals, fiber, eating habits, foods, digestion, vegetarianism, health foods, weight control, physical fitness, stamina, suppleness, hygiene, smoking, alcohol, and drugs.",
        "Category": " Juvenile Nonfiction , Health & Daily Living , Fitness & Exercise",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Diabetes Type 2: Complete Food Management Program",
        "Authors": "By Shafer, Sherri",
        "Description": "Now You Can Keep Diabetes Under ControlIt's simple: If you have type 2 diabetes, the only way to ward off serious symptoms is to keep your blood sugar within acceptable levels. So how can you do it? Through proper nutrition, the master key to controlling blood sugar. You need to understand which foods to eat, when to eat them, and in what amounts, and at the same time, establish regular exercise habits to optimize your health.Inside is everthing you need to know about managing type 2 diabetes through proper nutrition. From how to handle the initial diagnosis to discussions on every major dietary component, you'll uncover the science behind treating diabetes the right way.Inside, everything you need to know about nutrition and diabetes, including: ·How can exercise and weight management improve my blood sugar control? ·What can I do to lower my cholesterol and blood pressure? ·How can I lose weight and keep it off? ·Should I count carbohydrates? ·Can I eat sugar, and are artificial sweeteners safe? ·How much protein should I eat? ·Is it okay to consume alcohol? ·Do I need supplements? ·How can I read and understand food labels? ·What's the best way to treat low blood sugar? \"A timely and comprehensive roadmap to improving blood glucose control and reducing diabetes complications through simple modifications of diet and lifestyle.\"—Susan Carter, M.S., R.D., C.D.E., Stanford University Hospital\"An excellent book! Sherri Shafer draws on her extensive personal experience in nutritional management to make the dietary approach a very practical one. She doesn't emphasize the complete alteration of diet, but instead, how diet can be modified within the framework of an individual's personal preferences.\"—Raghu Mirmira, M.D., Ph.D., assistant professor, University of Virginia Diabetes Center",
        "Category": " Health & Fitness , Diseases , Diabetes",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Vegetables: Artichokes to Zucchini",
        "Authors": "By Famularo, Joe and Imperiale, Louise",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "On the Trail of Colorado Critters: Wildlife-Watching for Kids",
        "Authors": "By Shattil, Wendy (PHT), Rozinski, Bob (PHT), Rozinski, Bob (ILT), and Shattil, Wendy (ILT)",
        "Description": "A guidebook explaining how to look at the amazing array of creatures living in Colorado, including coyotes, elk, mountain lions, eagles, and owls.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Westcliffe Pub",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Worlds Greatest Dice Games (The #1 fun book for dice)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Compass Labs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Lord of Falcon Ridge",
        "Authors": "By Coulter, Catherine",
        "Description": "A classic Viking novel from the #1 New York Times bestselling author. When Chessa, the princess of Ireland, is kidnapped, Cleve rescues her to hand her over to her rightful groom, William of Normandy. But Chessa refuses to marry anyone but Cleve.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "This Side of Brightness: A Novel",
        "Authors": "By McCann, Colum",
        "Description": "Hailed for its \"shining prose\" (The Philadelphia Inquirer) and \"gripping realism\" (Newsday), This Side of Brightness is a powerful bl of imagination and history set in underground Manhattan. At the turn of the century, New York's sandhogs burrowed beneath the East River, digging the tunnels that would link Brooklyn to Manhattan; many decades later, those same tunnels offer refuge to the desperate and homeless. Spanning seventy years, Colum McCann's acclaimed novel tells the story of three generations bound to the tunnels by ill-fated loves, uninted crimes, and social taboos. Haunting and lyrical, This Side of Brightness delivers a tale of family, race, and redemption as bold and fabulous as New York City itself.",
        "Category": " Fiction , Historical",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "In Dark Water (Ballantine Reader's Circle)",
        "Authors": "By Blakeslee, Mermer",
        "Description": "1. The author has stated that ultimately Eudora's story is one of initiation, not victimhood. In what ways do you think Eudora was 'initiated'? As human beings, do you think that extreme, often painful, experiences are necessary for putting us in touch with the deeper, more remote places of our psyche? 2 'He, he doesn't ever yell at me. He just takes care of me. He never talks or asks me things like she used to, but he takes care of me,' Eudora says about her father after she returns from hiding in the woods. How do you interpret this comment? Is this a statement of acceptance or discontent regarding her father's parenting? 3. Why do you think the author included the scene where Eudora and Pepper are caught naked by Pepper's father? In what ways does this scene contribute to the novel? Do we learn more about certain characters through this disturbing situation? 4. When Popsy gives Eudora a cap to wear to school, he says to her, 'Now when you wear this cap, boy, you keep a mind where this bill's headin', hear?' From that time on, Eudora keeps careful track of every direction she takes. What do you think Popsy was trying to say to Eudora? What effect did her constant mental 'logging' of her whereabouts have on her? 5. Why do you think Eudora related so well to Popsy? Do you think Popsy was, in some aspect, a reflection of Eudora? 6. Why do you think Eudora became such a vehement target for Florence's rage after the death of her son? Were you ultimately able to forgive Florence for her abusive treatment of Eudora? Do you believe that Florence was redeemed in the end? Why or why not? 7. Following the gynecological exam at her boarding school, Eudora mentally collapses, going into a near catatonic state. Since Eudora's emotional life is so intricately tied to her physicality, do you think it was this frightening physical intrusion that finally put her over the edge? Or do you think that the breakdown was inevitable and not necessarily provoked by this event? Has an intense physical experience ever led you to an emotional awakening or collapse? 8. When Eudora leaves for boarding school, she takes Beulah's unwashed coffee cup along with her. What symbolic significance does this cup contain? 9. Which character did you most closely identify with? Why? Were there any characters that you had difficulty empathizing with? If so, why? 10. The author has said that it was a great challenge to present Eudora's voice in a way that made room for her child-like immediacy without alienating the reader's desire and ability to see beyond her, 'to guess at a larger truth than Dorrie's telling.' As an adult, what was it like to hear the bulk of a story through the voice of an eleven-year-old child? How did this shape your reading experience? 11. Author Sandra Scofield says that in this novel 'there is a great deal of pain, but there are no villains.' Do you agree with this? Why or why not? 1 2. Eudora is unable to control the smile that emerges during emotionally charged situations. What does the smile convey to you? How do Beulah and Florence interpret the smile? Is either more accurate than the other? What do you think the smile means to Eudora? 1 3. Do you feel that Mary's decision to let Eudora witness the shooting of her horse was appropriate, or was this too violent a scene for a child's eyes? Why or why not? Have you ever had a child express her curiosity about death to you? If so, how did you handle the situation? 1 4. Regarding Florence's mental deterioration, do you think that she was, to some degree, a victim of an inadequate mental health system? Do you think that the author implies this in any way? How might her condition have been handled differently today? 1 5. Why do you think Four Eyes' snakes held such intrigue for Eudora? Why do you think it was so important to her to touch the snake's yellow ring? 1 6. Eudora had a vivid dream one night in her boarding school about a horse being lifted out of the water by a rope: 'They were going to take him out of the water, lift him up. They were going to save him. I knew that if they lifted him into the air going seven thousand miles an hour, all his bones would snap. I knew and they didn't. I needed to tell them right away.' What was the significance of this dream? Who--or what--do you think the horse represented to Eudora? 1 7. Why do you think Eudora thrives so wonderfully at the Tappens? Aside from their love for her, are there other aspects of her life on the farm that beckon her frightened soul out of hiding? 1 8. In your opinion, what is the driving theme of this novel?",
        "Category": " Fiction , Classics",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Adventures of Huckleberry Finn (Modern Library Classics)",
        "Authors": "By Twain, Mark and Saunders, George (INT)",
        "Description": "﻿Introduction by George Saunders Commentary by Thomas Perry Sergeant, Bernard DeVoto, Clifton Fadiman, T. S. Eliot, and Leo Marx   ﻿“All modern American literature comes from one book by Mark Twain called Huckleberry Finn,” Ernest Hemingway wrote. “It’s the best book we’ve had.” A complex masterpiece that spawned controversy right from the start (it was banished from the Concord library shelves in 1885), it is at heart a compelling adventure story. Huck, in flight from his murderous father, and Jim, in flight from slavery, pilot their raft through treacherous waters, surviving a crash with a steamboat and betrayal by rogues. As Norman Mailer has said, “The mark of how good Huckleberry Finn has to be is that one can compare it to a number of our best modern American novels and it stands up page for page.”",
        "Category": " Fiction , Classics",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "White Fang: Illustrated Classics",
        "Authors": "By London, Jack",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "After the Crusade: American Foreign Policy for the Post-Superpower Age",
        "Authors": "By Clarke, Jonathan and Clad, James",
        "Description": "In this book, Clarke and Clad challenge the established foreign policy elite to rethink old ways of approaching policy making. Believing that America should remain a strong world leader, Clarke and Clad convincingly argue for restraint in foreign policy decisions. Ever since George Bush proclaimed his vision of a \"new world order,\" most foreign policy thinking has worked on the premise that we have moved into a new era for which we must invent new rationales and agendas for action. Against this, the authors argue that, in Warren Harding's words, America's need today is not for \"heroics, but healing; not nostrums but normalcy.\"",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Madison Books",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "A Hero for Dry Creek",
        "Authors": "By Tronstad, Janet",
        "Description": "A Hero For Dry Creek by Janet Tronstad released on Oct 24, 2003 is available now for purchase.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Steeple Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Cooking Light Holiday Cookbook: Complete Holiday Guide: Recipes, Menus, and Entertaining Ideas",
        "Authors": "By Averett, Heather (EDT)",
        "Description": "Provides recipes for low-fat but tasty and elegant holiday fare, and includes menus for Thanksgiving, Christmas, Kwanzaa, and New Year's entertaining.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Black and Blue (Oprah's Book Club)",
        "Authors": "By Quindlen, Anna",
        "Description": "With daring and compassion, Anna Quindlen weaves a forceful, harrowing portrait of a woman and a marriage, capturing the profound intricacies of love and rage, passion and violence. At once heartbreaking and utterly riveting, BLACK AND BLUE is an extraordinary work of fiction and a brilliant achievement.For eighteen years, Fran Benedetto kept her secret, hid her bruises, and stayed with Bobby because she wanted her son to have a father and because, in spite of everything, she loved him. Then one night, when she saw the look on her ten-year-old son's face, Fran finally made a choice--and ran for both their lives.With the repackaging of BLACK AND BLUE and One True Thing, Anna Quindlen takes her place alongside Dell's Alice McDermott and Rosellen Brown bringing their beloved, acclaimed contemporary classics to a whole new audience of trade paperback readers in Delta editions.",
        "Category": " Fiction , Psychological",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Awesome Real-Life Bible Devotions for Kids",
        "Authors": "By Harmon, Jeannie",
        "Description": "A devotion book containing Bible readings, art, prayers, questions, and space for personal journal entries.",
        "Category": "",
        "Publisher": "Chariot Family Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Dakota Born (Dakota Series #1)",
        "Authors": "By Macomber, Debbie",
        "Description": "Buffalo Valley, North Dakota. Like so many small Midwesttowns, it's dying. Stores are boarded up, sidewalks cracked,houses need a coat of paint. But despite all that, there's a spiritof hope here, of defiance. The people still living in Buffalo Valleyare fighting for their town.Lyndsay Snyder is a newcomer. She's an outsider, even though shespent childhood vacations here. Now she returns to see the familyhouse again, to explore family secrets and to reevaluate her life.To her own astonishment, she decides to stay, to accept thevacant position of teacher. Her decision marks a new beginningfor Buffalo Valley and for Lyndsay, who discovers in this brokenlittle town the love and purpose she's been seeking.",
        "Category": " Fiction , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "New Recipes from Moosewood Restaurant",
        "Authors": "By Moosewood Collective",
        "Description": "Includes recipes for vegetarian dishes developed at Moosewood Restaurant in Ithaca, N.Y",
        "Category": " Cooking , Reference",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Handbook of Nursing Diagnosis",
        "Authors": "By Carpenito, Lynda Juall",
        "Description": "This handbook is a market-leading, quick reference to nursing diagnosis and can be used as a supplement for any nursing diagnosis text. Section I contains all nursing diagnoses, including definitions, characteristics, related factors, outcomes and interventions. Section II contains Diagnostic Clusters with a collaborative focus. Features include Author's Notes, key concepts, interventions with rationale, focus assessment and outcome criteria.",
        "Category": " Medical , Nursing , Assessment & Diagnosis",
        "Publisher": "Lippincott Williams & Wilkins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Midnight Munchies: More Than 60 Quick-Fix Snacks",
        "Authors": "By Morgan, Diane, Medilek, Peter (PHT), and Medilek, Peter",
        "Description": "You know the feeling: it's midnight, you're starving, and the prospect of another bowl of cereal makes you want to snap, crackle, and pop. Midnight Munchies contains snacks to satisfy every pang, every craving, without fussing over time or ingredients. Herb-Poppin' Parmesan Popcorn is popped to perfection for family movie night. Popeye's Stay-Awake Spinach and Eggs provides the brain food for that late-night cram. For foodies and beauties, Double Duty Cucumber Dip (it's also a refreshing face mask) is a smooth and crunchy munchy for an impromptu spa-night get-together. Mistress of munchies Diane Morgan also knows her party stuff, so there are plenty of ideas for entertaining fellow late-night revelers. It's instant gratification - all in one smart package.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Better Homes and Gardens New Cook Book",
        "Authors": "By",
        "Description": "Offers detailed recipes for a wide range of appetizers, breads, seafood, meats, desserts, and othe foods and explains how to maintain a nutritionally balanced diet",
        "Category": "",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Asian Appetizers: Easy, Exotic First Courses to Dress Up Any Meal",
        "Authors": "By Jue, Joyce",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Harlow & Ratner",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Guinea Pig Handbook (Barron's Pet Handbooks)",
        "Authors": "By Vanderlip, Sharon",
        "Description": "Barron's Pet Handbooks are written, designed, and illustrated in much the same attractive style as Barron's best selling Complete Pet Owner's Manuals. However, Handbooks have a larger page-count and with it, more extensive and detailed coverage of each title's subject pet. This brand new handbook for guinea pig owners provides a wealth of information on the animal's anatomy and life cycle, plus advice on caging, feeding, breeding, and health care.",
        "Category": " Pets , General",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "30 Days to Taming Your Tongue: What You Say (and Don't Say) Will Improve Your Relationships",
        "Authors": "By Pegues, Deborah Smith",
        "Description": "Certified behavioral consultant Deborah Pegues knows how easily a slip of the tongue can cause problems in personal and business relationships. This is why she wrote the popular 30 Days to Taming Your Tongue (850,000 copies sold). Now in trade size, Pegues's 30-day devotional will help each reader not only tame their tongue but make it productive rather than destructive.With humor and a bit of refreshing sass, Deborah devotes chapters to learning how to overcome theRetaliating TongueKnow-It-All TongueBelittling TongueHasty TongueGossiping Tongue25 More!Short stories, anecdotes, soul-searching questions, and scripturally based personal affirmations combine to make each applicable and life changing.Rerelease in trade edition",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "CliffsNotes on Science Fiction: An Introduction",
        "Authors": "By Allen, L. David (EDT)",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.In CliffsNotes on Science Fiction: an Introduction, you'll gain insight into the differing styles of science fiction, discover how true science shapes the genre, and see how science fiction serves as an important historical marker for society. You'll dive into works by some of the great masters of science fiction, including Jules Verne, Isaac Asimov, Arthur C. Clarke, Robert Heinlein, Ursula LeGuin, Frank Herbert, and more.This study guide carries you along on incredible journeys by providing detailed summaries and critical analyses on some of the most popular science fiction stories. You'll find analyses of20,000 Leagues Under the SeaThe Time MachineI, RobotThe Left Hand of DarknessChildhood's EndRite of PassageAnd moreClassic literature or modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Literary Criticism , General",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "December",
            "Year": "1973"
        }
    },
    {
        "Title": "True to Form: A Novel",
        "Authors": "By Berg, Elizabeth",
        "Description": "Katie Nash -- the beloved heroine of Elizabeth Berg's previous novels Durable Goods and Joy School -- is thirteen years old in 1961, and she's facing a summer full of conflict. Her father has enlisted her in two care-taking jobs -- baby-sitting for the rambunctious Wexler boys and, equally challenging, looking after Mrs. Randolph, her elderly, bedridden neighbor. To make matters worse, Katie has been forcibly inducted into the \"loser\" Girl Scout troop, compliments of her only new friend Cynthia's controlling mother. Her only saving grace is a trip to her childhood hometown in Texas, to visit her best friend Cherylanne. But people and places change -- and Cherylanne is no exception. When an act of betrayal leaves Katie wondering just what friends are really for, she learns to rely on the only one left she can trust: herself.  Full of the joys, anguish, and innocence of American adolescence, True to Form is a story sure to make readers remember and reflect on their own moments of discovery and self-definition.",
        "Category": " Fiction , Literary",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Starting Over",
        "Authors": "By Pilcher, Robin",
        "Description": "Robin Pilcher, bestselling author of An Ocean Apart returns readers to contemporary Scotland, where the \"simple\" life has grown somewhat more complicated, but the shortest distance between lonely hearts will always be love...Sometimes The Hardest Thing In Life...Liz Dewhurst has witnessed quite a bit in her thirty-seven years: the birth of her son, the death of her mother, the waxing and waning days on the farm where she was raised...the sight of her husband in another woman's arms. Suddenly, she's feeling worn down and used up by the very lifestyle upon which she once thrived. Bitterness at her broken marriage has distanced her from her son, Alex-even as she's poured all her remaining energy into battling the development company that wants to purchase her family's land to build a golf course....Is To Live ItNow Liz must confront a few things, including the fate of the farm, her feelings for her ex-husband, and a trip to Spain that rekindles a fire in her she had forgotten existed. The Liz who returns to Balmuir is a different woman. Now, in the wake of a near-tragedy, she must draw on her newfound strength to make a difficult choice. To look at her life in a different way, standing tall, and...Starting Over",
        "Category": " Fiction , Women",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Conflict Management: The Courage to Confront",
        "Authors": "By Mayer, Richard J.",
        "Description": "",
        "Category": "",
        "Publisher": "Sagamore Pub Llc",
        "Price Starting With ($)": "6.56",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Rainbow Cadenza: A Novel in Vistata Form",
        "Authors": "By Schulman, J. Neil",
        "Description": "Two hundred years from now, in a world of exploitation and brutality, a young woman of remarkable strength and intelligence fights for her mother's life, her own freedom, and possession of her own body and soul",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Thank You (Main Street Editions Gift Books)",
        "Authors": "By Engelbreit, Mary and Engelbreit, Mary (ILT)",
        "Description": "Text and illustrations show ways of saying thank-you",
        "Category": " Family & Relationships , Friendship",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "BITCHfest: Ten Years of Cultural Criticism from the Pages of Bitch Magazine",
        "Authors": "By Miya-Jervis, Lisa (EDT) and Zeisler, Andi (EDT)",
        "Description": "In the wake of Sassy and as an alternative to the more staid reporting ofMs., Bitch was launched in the mid-nineties as a Xerox-and-staple zine covering the landscape of popular culture from a feminist perspective. Both unabashed in its love for the guilty pleasures of consumer culture and deeply thoughtful about the way the pop landscape reflects and impacts women's lives, Bitch grew to be a popular, full-scale magazine with a readership that stretched worldwide. Today it stands as a touchstone of hip, young feminist thought, looking with both wit and irreverence at the way pop culture informs feminism--and vice versa--and encouraging readers to think critically about the messages lurking behind our favorite television shows, movies, music, books, blogs, and the like.BITCHFest offers an assortment of the most provocative essays, reporting, rants, and raves from the magazine's first ten years, along with new pieces written especially for the collection. Smart, nuanced, cranky, outrageous, and clear-eyed, the anthology covers everything from a 1996 celebration of pre-scandal Martha Stewart to a more recent critical look at the \"gayby boom\"; from a time line of black women on sitcoms to an analysis of fat suits as the new blackface; from an attempt to fashion a feminist vulgarity to a reclamation of female virginity. It's a recent history of feminist pop-culture critique and an arrow toward feminism's future.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "High-Spirited Women of the West",
        "Authors": "By Seagraves, Anne",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Wesanne Publications",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Pennsylvania Breweries: 2nd Edition (Breweries Series)",
        "Authors": "By Bryson, Lew",
        "Description": "A revised look at fifty-three breweries and brewpubs throughout the state of Pennsylvania introduces several new facilities, furnishing updated information on others, discussing the history of brewing in the region, and offering information on tours, food served, nearby accommodations and attractions, and the types of beers brewed. Original.",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Sermon on the mount Study Book",
        "Authors": "By Shinn, Roger",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Split Second (Maggie O'Dell Novels)",
        "Authors": "By Kava, Alex",
        "Description": "After Albert Stucky, a brutal and clever serial killer known as \"The Collector,\" escapes from prison, he forces FBI profiler Maggie O'Dell, the agent who originally captured him, to play a deadly game when he targets her and everyone associated with her, pushing her to the very edge of sanity. Reprint.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Third Twin",
        "Authors": "By Follett, Ken",
        "Description": "NEW YORK TIMES BESTSELLERUsing a restricted FBI database, genetic researcher Jeanie Ferrami has located identical twins born to different mothers. Frightened by her bizarre discovery, she is determined to discover the truth at any cost—until she finds herself at the center of a scandal that could ruin her career.   To extricate herself, Jeannie plunges into a maze of hidden evidence. With growing horror, she uncovers a cynical, far-reaching conspiracy involving disturbing genetic experiments and some of the most powerful men in America—men who will kill to keep their secrets concealed.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Summerhouse",
        "Authors": "By Deveraux, Jude",
        "Description": "Jude Deveraux's marvelous New York Times bestseller is a touching and delightful exploration of the longings that live deep inside every woman's heart, featuring three friends who get a once-in-a-lifetime chance to find out what might have been...Have you ever wanted to rewrite your past?  Three best friends, all with the same birthday, are about to turn forty. Celebrating at a summerhouse in Maine, Leslie Headrick, Madison Appleby, and Ellie Abbott are taking stock of their lives and loves, their wishes and choices. But none of them expect the gift that awaits them at the summerhouse: the chance for each of them to turn their \"what-might-have-beens\" into reality...  Leslie, a suburban wife and mother, follows the career of a boy who pursued her in college wonders: what if she had chosen differently? Madison dropped a modeling career to help her high school boyfriend recover from an accident, even though he'd jilted her. But what if she had said \"no\" when her old boyfriend had called? Ellie became a famous novelist, but a bitter divorce wiped out her earnings -- and shattered her belief in herself. Why had the \"justice\" system failed her? And could she prevent its happening the second time around?  Now, a mysterious \"Madame Zoya,\" offers each of them a chance to relive any three weeks from the past. Will the road not taken prove a better path? Each woman will have to decide for herself as she follows the dream that got away...and each must choose the life that will truly satisfy the heart's deepest longings.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Face: A Novel",
        "Authors": "By Koontz, Dean R.",
        "Description": "Acknowledged as “America’s most popular suspense novelist”(Rolling Stone ) and as one of today’s most celebrated and successful writers, Dean Koontz has earned the devotion of millions of readers around the world and the praise of critics everywhere for tales of character, mystery, and adventure that strike to the core of what it means to be human. Now he delivers the page-turner of the season, an unforgettable journey to the heart of darkness and to the pinnacle of grace, at once chilling and wickedly funny, a brilliantly observed chronicle of good and evil in our time, of illusion and everlasting truth. He’s Hollywood’s most dazzling star, whose flawless countenance inspires the worship of  millions and fires the hatred of one twisted soul. His perfectly ordered existence is under siege as a series of terrifying, enigmatic “messages” breaches the exquisitely calibrated security systems of his  legendary Bel Air estate.The boxes arrive mysteriously, one by one, at Channing Manheim’s fortified compound. The threat implicit in their bizarre, disturbing contents seems to escalate with each new delivery. Manheim’s security chief, ex-cop Ethan Truman, is used to looking beneath the surface of things. But until he entered the orbit of a Hollywood icon, he had no idea just how slippery reality could be. Now this good man is all that stands in the way of an insidious killer—and forces that eclipse the most fevered fantasies of a city where dreams and nightmares are the stuff of daily life. As a seemingly endless and ominous rain falls over southern California, Ethan will test the limits of perception and endurance in a world where the truth is as thin as celluloid and answers can be found only in the illusory intersection of shadow and light.Enter a world of marvelous invention, enchantment, and implacable intent, populated by murderous actors and the walking dead, hit men and heroes, long-buried dreams and never-dying hope. Here a magnificent mansion is presided over by a Scottish force of nature known as Mrs. McBee, before whom all men tremble. A mad French chef concocts feasts for the mighty and the malicious. Ming du Lac, spiritual adviser to the stars, has a direct line to the dead. An aptly named cop called Hazard will become Ethan’s ally, an anarchist will sow discord and despair, and a young boy named Fric, imprisoned by celebrity and loneliness, will hear a voice telling him of the approach of something unimaginably evil. Traversing this extraordinary landscape, Ethan will face the secrets of his own tragic past and the unmistakable premonition of his impending violent death as he races against time to solve the macabre riddles of a modern-day beast.A riveting tour de force of suspense, mystery, and miraculous revelation, The Face is that rare novel that entertains, provokes, and uplifts at the same time. It will make you laugh. It will give you chills. It will fill you with hope.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The First Billion: A Novel",
        "Authors": "By Reich, Christopher",
        "Description": "Christopher Reich electrified readers with Numbered Account and The Runner, his first two international thrillers. Now the New York Times bestselling author whose work has been called “gripping” (Chicago Tribune), “chilling” (The Denver Post), “wonderful” (The New York Times Book Review), ratchets up the stakes in an ingeniously plotted story of nerve-jangling intrigue and hot-wired suspense. Using today’s cutthroat global economy as a backdrop, The First Billion explodes into a breakneck tale of betrayal, revenge, and redemption...John “Jett” Gavallan is a former fighter pilot, now the high-flying CEO of Black Jet Securities, an investment firm that earned its first billion before the techno dream crashed and burned. Poised for an offering crucial to his company’s survival, Gavallan is banking on the riskiest gamble of his dazzling career. In exactly six days, he will take Mercury Broadband, Russia’s leading media company, public on the New York Stock Exchange. But rumors of fraud have suddenly surfaced that could send the deal south. Gavallan makes a preemptive strike by dispatching his number-two man--fellow Desert Storm fighter pilot Grafton Byrnes--to Moscow to penetrate the shadowy Russian multinational. When Byrnes fails to return, Gavallan fears the worst. But the truth is even more diabolical than he can imagine.Plunging into a desperate search for his best friend, the renegade top gun is suddenly fighting a different kind of war, where there is no safe harbor and no one he can trust. Not Konstantin Kirov, the elusive head of Mercury Broadband who may not be what he seems. Not the bankers and traders Gavallan does business with every day. Not the exotic beauty who has told him all her deepest secrets--except one. Suddenly Jett finds himself trapped in a conspiracy that could shatter the delicate balance between nations--and plunge the global economy into chaos. Hunted by the F.B.I. and a band of elite killers, Jett races from Palm Beach to Zurich to Moscow in a desperate search for answers. But for this brave ex-commando haunted by visions of war, the truth comes at a terrible price. With Mercury rising and the hours ticking down, he is moving closer to a place where murder and revenge are the currency of choice...and where the first billion is the ultimate insider secret--and the deadliest obsession of all.With breakneck plotting, stunning realism, and a sense of danger that keeps the heart racing, The First Billion is a knockout of a novel that will linger long after the final shocking twist is revealed.From the Hardcover edition.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Bear and the Dragon (A Jack Ryan Novel)",
        "Authors": "By Clancy, Tom",
        "Description": "President Jack Ryan faces a world crisis unlike any he has ever known in Tom Clancy's extraordinary #1 New York Times bestseller.A high-level assassination attempt in Russia has the newly elected Ryan sending his most trusted eyes and ears—including antiterrorism specialist John Clark—to Moscow, for he fears the worst is yet to come. And he’s right. The attempt has left the already unstable Russia vulnerable to ambitious forces in China eager to fulfill their destiny—and change the face of the world as we know it...",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Sensational Page Ideas for Scrapbooks",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "Memory Makers Books",
        "Price Starting With ($)": "7.93",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Good Housekeeping Household Encyclopedia",
        "Authors": "By Forte, Carolyn E. (EDT)",
        "Description": "Offering hundreds of illustrations, charts, and diagrams, a definitive guide to household maintenance presents a home-management handbook, a design and repair manual, and a comprehensive household reference. 50,000 first printing. $35,000 ad/promo.",
        "Category": "",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Passenger",
        "Authors": "By Davis, Patrick A.",
        "Description": "Assigned to the Pentagon after being injured in action in the Middle East, Colonel John Quinn is called in to investigate the crash of a military Learjet carrying the president's brother and discovers that too many people have a stake in the outcome of his probe. By the author of The General. Reprint.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Therapy (Alex Delaware)",
        "Authors": "By Kellerman, Jonathan",
        "Description": "Jonathan Kellerman has made the psychological thriller his own gripping province with his bestselling series of Alex Delaware novels. Now, Delaware’s new adventure leads the sleuthing psychologist on a harrowing exploration into the realm he knows best: the human psyche, in all its complexity, mystery, and terrifying propensity for darkness.“Been a while since I had me a nice little whodunit,” homicide detective Milo Sturgis tells Alex Delaware. But there’s definitely nothing nice about the brutal tableau behind the yellow crime-scene tape. On a lonely lover’s lane in the hills of Los Angeles, a young couple lies murdered in a car. Each bears a single gunshot wound to the head. The female victim has also been impaled by a metal spike. And that savage stroke of psychopathic fury tells Milo this case will call for more than standard police procedure. As he explains to Delaware, “Now we’re veering into your territory.”It is dark territory, indeed. The dead woman remains unidentified and seemingly unknown to everyone. But her companion has a name: Gavin Quick—and his troubled past eventually landed him on a therapist’s couch. It’s there, on familiar turf, that Delaware hopes to find vital clues. And that means going head-to-head with Dr. Mary Lou Koppel, a popular celebrity psychologist who fiercely guards the privacy of her clients . . . dead or alive. But when there’s another gruesomely familiar murder, Delaware surmises that his investigation has struck a nerve. As he trolls the twisted wreckage of Quick’s tormented last days, what he finds isn’t madness, but the cold-blooded method behind it. And as he follows a chain of greed, corruption, and betrayal snaking hideously through the profession he thought he knew, he’ll discover territory where even he never dreamed of treading.As provocative as it is suspenseful, Therapy is premier Kellerman that finds the award-winning author firing on all creative cylinders—and carrying readers on an electrifying ride to a place only he can take them, for an experience they won’t soon forget.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Encyclopedia of Roses: An Organic Guide to Growing and Enjoying America's Favorite Flower",
        "Authors": "By McKeon, Judith C.",
        "Description": "The most comprehensive, current, and easy-to-use manual available includes step-by-step instructions, along with striking full-color photographs, for growing and caring for more than two hundred species of roses, without the use of chemicals. Organic Gardening Main.",
        "Category": " Gardening , Flowers , Roses",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "All That Remains (Kay Scarpetta Mysteries)",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "#1 New York Times bestselling author Patricia Cornwell's heart-stopping thriller featuring gutsy medical examiner Kay ScarpettaIn Richmond, Virginia, young lovers are dying. So far, four couples in the area have disappeared, only to be found months later as mutilated corpses. When the daughter of the president's newest drug czar vanishes along with her boyfriend, Dr. Kay Scarpetta knows time is short. Following a macabre trail of evidence that ties the present homicides to a grisly crime in the past, Kay must draw upon her own personal resources to track down a murderer who is as skilled at eliminating clues as Kay is at finding them....",
        "Category": " Fiction , General",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Divine Comedy: Volume 1: The Inferno",
        "Authors": "By Dante Alighieri and Ciardi, John",
        "Description": "In the first part of Dante's epic poem about the three realms of the Christian afterlife, Virgil leads a spiritual pilgrim through the nine circles of hell",
        "Category": " Fiction , Classics",
        "Publisher": "Signet",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1954"
        }
    },
    {
        "Title": "Italian Drawings in the Art Institute of Chicago",
        "Authors": "By Joachim, Harold",
        "Description": "",
        "Category": "",
        "Publisher": "Univ of Chicago Pr",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Pennsylvania Dutch American Folk Art",
        "Authors": "By HENRY J. KAUFFMAN",
        "Description": "",
        "Category": "",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "June",
            "Year": "1969"
        }
    },
    {
        "Title": "American Primitive Painting",
        "Authors": "By Lipman, Jean",
        "Description": "Reproduces works which illustrate the unique traditions and unpretentious quality of nineteenth-century primitive painting",
        "Category": " Art , General",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "Memory: A Contribution to Experimental Psychology",
        "Authors": "By Ebbinghaus, Hermann",
        "Description": "",
        "Category": "",
        "Publisher": "Dover Publications, Inc.",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Beauty and the Beast: One Magical Christmas",
        "Authors": "By Disney Christmas",
        "Description": "",
        "Category": " Holiday Music",
        "Publisher": "Walt Disney Records",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    }
]