[
    {
        "Title": "Terrorism and Homeland Security: An Introduction",
        "Authors": "By White, Jonathan R.",
        "Description": "White's TERRORISM: AN INTRODUCTION, a perennial best-seller, is recognized as the most objective terrorism book in the market. In the latest edition, White has rewritten and incorporated parts of his two books DEFENDING THE HOMELAND and TERRORISM to create one new comprehensive text. To reflect this change, the title has been updated to TERRORISM AND HOMELAND SECURITY: AN INTRODUCTION, Fifth Edition.  TERRORISM AND HOMELAND SECURITY: AN INTRODUCTION, Fifth Edition strives to discuss the most sophisticated theories by the best terrorist analysts in the world, while still focusing on the domestic and international threats of terrorism and the basic security issues that surround terrorism today. The student-oriented writing style is complemented by rich pedagogy, and there is an adequate amount of research and theoretical discussion to make this the ideal text for both the undergraduate- and graduate-level courses.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Apocalypse 2012 (Aztec)",
        "Authors": "By Jennings, Gary, Podrug, Junius, and Gleason, Robert",
        "Description": "In ancient Mexico, the “End-Time Codex”--prophesizing the world’s end in 2012--is entombed. A young Aztec-Mayan slave tells us its story.  Gifted in math and astronomy, Coyotl rises to king’s counselor in Tula, a golden city of milk and honey ruled by the brilliant god-king, Quetzalcoatl, the Feathered Serpent of lore.  Gathering artists, scientists and craftsmen, this legendary ruler builds a city that will awe humanity for one thousand years.  But he also faces war, catastrophic drought, betrayal and the rise of an evil death-cult religion.  Instituting the infamous “Blood Covenant,” its priests drag thousands of people a year atop temple-pyramids and rip their hearts beating from their chests.  To stop them Quetzalcoatl must defy the flames of bloody civil war.A thousand years later scientists discover the End-Time Codex.  While struggling to decipher it, they realize their own age mirrors Tula’s.  Can they crack the 2012 code and save their world from Tula’s deadly fate?",
        "Category": " Fiction , Mystery & Detective , Historical",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Message: The New Testament Psalms and Proverbs",
        "Authors": "By Peterson, Eugene H. (EDT)",
        "Description": "Like having a conversation with a dear friend, The Message New Testament with Psalms and Proverbs is presents God's Word in the language and rhythms of today.",
        "Category": " Bibles , The Message , New Testament & Portions",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "P. S. I Loathe You",
        "Authors": "By Harrison, Lisi",
        "Description": "Massie Block: When the Pretty Committee deems its boy-fast null and void, boy fever sweeps through BOCD. What better way to backhandspring into new crush Dempsey's heart-and make old crush Derrington jealous-than cheer for him on the soccer field? And just like that, Massie forms BOCD's first-ever cheerleading squad. But will Massie still have something to cheer about when Dempsey starts spending ah lot of time with LBR Layne Abeley? Give me an \"E\" for Ehmagawd!Kristen Gregory: With Massie and her SBFF (secret best friend forever) Layne vying for the same boy, Kristen has to make a choice: A) the Pretty Committee, or B) the Witty Committee. And if she doesn't choose fast, she'll end up C) Committeeless.Dylan Marvil: Is hiding something, and it's not just those peanut butter Luna bars stashed under her mattress. She's got a secret crush on Derrington-and it's no secret that he likes burpilicious redheads. . . .Alicia Rivera: Prefers pliés to pom-poms, especially when Massie orders her to the bottom of the cheer-pyramid. Can Alicia accept her beta status, or is it time to become alpha of her own squad?Claire Lyons: Now that she's back with Cam, Claire finally has her love life in order. But her friends are trading crushes like styling tips. Will the Pretty Committee survive the boy-swap intact, or is the Clique about to come apart at the seams?",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Poppy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Boredom Busters",
        "Authors": "By Hansen, Cindy S.",
        "Description": "",
        "Category": " Games , General",
        "Publisher": "Group Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Leadership: The Journey Inward",
        "Authors": "By Ambrose, Delorese",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Kendall Hunt Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Sex on the Beach and Other Wild Drinks!",
        "Authors": "By Soman, Kathryn Knox (EDT) and Filosa, Craig (PHT)",
        "Description": "The hippest, hottest, most happening bar guide for generation X-ers and anyone young at heart.  Its colorful, MTV-type design makes this the perfect party bar guide—a great gift!  From an Alabama Slammer to a Surfer on Acid, here are 50 fun and delicious mixed drinks, shots and shooters conveniently arranged in alphabetical order for easy access.  4-color photographs throughout.  96 pages.",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "Gramercy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Dictionary of Common Philosophical Terms",
        "Authors": "By Pence, Gregory",
        "Description": "",
        "Category": " Philosophy , Reference",
        "Publisher": "McGraw-Hill College",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "6-Minute Messages For Children: 52 Children's Devotions for Any Occasion",
        "Authors": "By Hinchey, Donald",
        "Description": "Bring children closer to God—with a whole year's worth of Bible-based sermons just for them...You'll use creative activities to get kids involved. And you'll teach unforgettable lessons about...    God's love    Living in God's family    Serving others    Faith    Stewardship    Forgiveness...and dozens of other topics. Each talk uses simple, meaningful words even very young children understand. You'll teach as Jesus did—using common, everyday objects to help children...    Know God,    Follow Christ,    And love one another....as they learn to apply the Bible to their daily lives.Each of these fun, active-learning messages takes only minutes to prepare. Use them to create unforgettable children's moments in Sunday worship...or at camps, retreats, and other special events.",
        "Category": " Religion , Christian Ministry , Children",
        "Publisher": "Group Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Disney's Aladdin: Monkey Business (Golden Books)",
        "Authors": "By Bazaldua, Barbara and Williams, Don (ILT)",
        "Description": "Aladdin is lonely living by himself on the street until he meets a friendly, but mischievous, monkey",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Door Through Darkness; John of The Cross and Mysticism in Everyday Life",
        "Authors": "By Sister Eileen Lyddon",
        "Description": "",
        "Category": "",
        "Publisher": "New City Press",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Light & Easy: In the Kitchen With Bob (Bob Bowersox Cookbooks)",
        "Authors": "By Bowersox, Bob",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Qvc Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "On Her Own: Brides of Webster County, Book 2 (Truly Yours Romance Club #17)",
        "Authors": "By Brunstetter, Wanda E.",
        "Description": "Barbara Zook was devastated when her husband David was killed. Will she be able to raise their four young boys and manage her beloved David's harness store on her own? When harness maker Paul Hilty arrives in Webster County, Missouri, he finds himself agreeing to help run Barbara's shop. Things are going fairly well until widower Bishop John Frey comes a-courting Barbara, and Paul's jealousy takes everyone by surprise. Will Paul try to beat out the competition or end up hightailing it back to Pennsylvania? Will Barbara marry for love or be forced to enter into a marriage of convenience? On Her Own is book 2 in The Brides of Webster County series. Other books in the series include Going Home: Book 1, Dear to Me: Book 3, Allison's Journey: Book 4.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Scholastic Reader Level 1: I Spy Lightning in the Sky",
        "Authors": "By Marzollo, Jean and Wick, Walter (ILT)",
        "Description": "A Level 1 reader with picture clue riddles and search-and-find fun!I spy a brand-new reader all about a treasure hunt!All-new, easy-to-read riddles by Jean Marzollo are paired with fun photographs culled from the bestselling I SPY TREASURE HUNT to create the fifth I Spy reader in the Scholastic Reader series. With rhythm, rhyme, and picture clues, this book is written to support the newest reader.The first three I Spy Readers have combined sales of more than 200,000 copies!!",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Cellular System Design and Optimization",
        "Authors": "By Smith, Clint and Gervelis, Curt",
        "Description": "Get a Powerhouse Cellular System Up and Running in Record Time! Plus--Priceless On-the-Job Tips for Optimizing and Expanding Any System! Stay on top of today's cutting-edge cellular technology; Save time and effort with step-by-step design guidelines; Exploit proven methods for keeping your system operating at peak efficiency; And much more.",
        "Category": " Technology & Engineering , Electrical",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "How To Be The Funniest Kid in the Whole Wide World(or just in your class)",
        "Authors": "By Jay Leno",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1793"
        }
    },
    {
        "Title": "Wellspring of Magic (Creative Girls Club Adventure, Book 1)",
        "Authors": "By Jan Fields",
        "Description": "",
        "Category": "",
        "Publisher": "Annie's Attic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2012"
        }
    },
    {
        "Title": "The Scary States of America",
        "Authors": "By Teitelbaum, Michael",
        "Description": "Aliens, ghosts, and monsters haunt the pages of this eerie trip around the Scary States of America. With Jason Specter—the nation's unofficial collector of all things paranormalÑas your guide meet the girl in Illinois who can start fires with her mind, the Skunk Ape of Florida that knocks victims flat with its stench, the mischievous Shadow People of Arkansas, the Jersey Devil, the extraterrestrials who take human organs as a souvenir of their trip to Washington, and the wailing ghost of a teenage girl trapped forever in an Oregon lighthouse. Some of these visitors from other worlds don't mean to hurt anyone . . . and some of them do.Warning: All of these stories are based on true events. Are you ready to face the terror in your state?",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Ask Suze ...About Stocks and Bonds",
        "Authors": "By Suze Orman",
        "Description": "",
        "Category": "",
        "Publisher": "RIVERHEAD PUB.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Alice's Adventures in Wonderland and Through the Looking Glass (Barnes & Noble Classics)",
        "Authors": "By Carroll, Lewis and Lin, Tan Anthony",
        "Description": "&&LDIV&&R&&LDIV&&R&&LDIV&&R&&LI&&RAlice's Adventures in Wonderland and Through the Looking Glass&&L/I&&R, by &&LSTRONG&&RLewis Carroll&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RFirst published in 1865, &&LSTRONG&&RLewis Carroll&&L/B&&R’s &&LI&&RAlice’s Adventures in Wonderland&&L/I&&R was an immediate success, as was its sequel, &&LI&&RThrough the Looking-Glass&&L/I&&R. Carroll’s sense of the absurd and his amazing gift for games of logic and language have secured for the Alice books an enduring spot in the hearts of both adults and children.&&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RAlice begins her adventures when she follows the frantically delayed White Rabbit down a hole into the magical world of Wonderland, where she meets a variety of wonderful creatures, including Tweedledee and Tweedledum, the Cheshire Cat, the hookah-smoking Caterpillar, the Mad Hatter, and the Queen of Hearts—who, with the help of her enchanted deck of playing cards, tricks Alice into playing a bizarre game of croquet.  Alice continues her adventures in Through the Looking-Glass, which is loosely based on a game of chess and includes Carroll’s famous poem “Jabberwocky.”&&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&RThroughout her fantastic journeys, Alice retains her reason, humor, and sense of justice. She has become one of the great characters of imaginative literature, as immortal as Don Quixote, Huckleberry Finn, Captain Ahab, Sherlock Holmes, and Dorothy Gale of Kansas.&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&R&&LDIV&&R&&LB&&RTan Lin&&L/B&&R is a writer, artist, and critic. He is the author of two books of poetry, &&LI&&RLotion Bullwhip Giraffe&&L/I&&R and &&LI&&RIDM&&L/I&&R.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Miss Manners' Basic Training: Communication",
        "Authors": "By Martin, Judith",
        "Description": "Though we may think that technology has overtaken human behavior, Miss Manners is here to rescue us from the tyranny of telephones, faxes and E-mail. In her famously arch and witty style, Miss Manners tells us everything we need to know about communicating with others in the technological age, from phone tag to flaming.",
        "Category": " Social Science , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Taking Care of Mom (Little Critter)",
        "Authors": "By Mayer, Gina and Mayer, Mercer",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Western Forests (Audubon Society Nature Guides)",
        "Authors": "By Whitney, Stephen",
        "Description": "Describes the characteristics of the various plants and animals of the forests of the Western areas of the United States and Canada",
        "Category": " Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "How To Win A Local Election, Revised: A Complete Step-by-Step Guide",
        "Authors": "By Grey, Lawrence",
        "Description": "This is the most practical, most detailed handbook ever published on the techniques and approaches you need to run a successful campaign for any local office.More of a \"must-do\" book than a how-to book, How to Win a Local Election guides readers through the campaign process detailing what they need to accomplish along the way in order to be victorious.",
        "Category": " Political Science , Public Affairs & Administration",
        "Publisher": "M. Evans and Company, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Hubris: The Inside Story of Spin, Scandal, and the Selling of the Iraq War",
        "Authors": "By Corn, David and Isikoff, Michael",
        "Description": "The real story behind the investigation of Iraq, and the basis for the MSNBC documentary of the same name hosted by Rachel MaddowFilled with news-making revelations that made it a New York Times bestseller, Hubris takes us behind the scenes at the White House, CIA, Pentagon, State  Department, and Congress to show how George W. Bush came to invade Iraq--and how his administration struggled with the devastating fallout.Hubris connects the dots between Bush's expletive-laden outbursts at Saddam  Hussein, the bitter battles between the CIA and the White House, the  fights within the intelligence community over Saddam's supposed weapons  of mass destruction, the outing of an undercover CIA officer, and the  Bush administration's misleading sales campaign for war. Written by  veteran reporters Michael Isikoff and David Corn, this is  an inside look at how a president took the nation to war using faulty  and fraudulent intelligence. It's a dramatic page-turner and an  intriguing account of conspiracy, backstabbing, bureaucratic ineptitude,  journalistic malfeasance, and arrogance.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "There is Nothing Like a Dane!",
        "Authors": "By Shakespeare, William and Francis, Clive (EDT)",
        "Description": "",
        "Category": " Drama , American , General",
        "Publisher": "Nick Hern Books",
        "Price Starting With ($)": "9.38",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Gut Busters: The 15-Minute-A-Day, 12-Week Plan",
        "Authors": "By Vedral, Joyce L.",
        "Description": "Joyce Vedral, a nationally acclaimed bodybuilder, is an amazing force in fitness today. She has authored seven books on fitness, including the super-selling Fat-Burning Workout, which has more than 200,000 copies in print. Now Vedral shows men everywhere how to beat their #1 fitness problems--abdominal fat and flab--with a proven, no-nonsense plan. Fully illustrated.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The War for Muslim Minds: Islam and the West",
        "Authors": "By Kepel, Gilles",
        "Description": "The events of September 11, 2001, forever changed the world as we knew it. In their wake, the quest for international order has prompted a reshuffling of global aims and priorities. In a fresh approach, Gilles Kepel focuses on the Middle East as a nexus of international disorder and decodes the complex language of war, propaganda, and terrorism that holds the region in its thrall.The breakdown of the Israeli-Palestinian peace process in 2000 was the first turn in a downward spiral of violence and retribution. Meanwhile, a neo-conservative revolution in Washington unsettled U.S. Mideast policy, which traditionally rested on the twin pillars of Israeli security and access to Gulf oil. In Saudi Arabia and Afghanistan, a transformation of the radical Islamist doctrine of Bin Laden and Zawahiri relocated the arena of terrorist action from Muslim lands to the West; Islamist radicals proclaimed jihad against their enemies worldwide.Kepel examines the impact of global terrorism and the ensuing military operations to stem its tide. He questions the United States' ability to address the Middle East challenge with Cold War rhetoric, while revealing the fault lines in terrorist ideology and tactics. Finally, he proposes the way out of the Middle East quagmire that triangulates the interests of Islamists, the West, and the Arab and Muslim ruling elites. Kepel delineates the conditions for the acceptance of Israel, for the democratization of Islamist and Arab societies, and for winning the minds and hearts of Muslims in the West.",
        "Category": " History , Middle East , General",
        "Publisher": "Belknap Press of Harvard University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Oxford Dictionary of Word Histories",
        "Authors": "By Chantrell, Glynnis (EDT)",
        "Description": "The Oxford Dictionary of Word Histories describes the origins and sense development of thousands of words of the English language; dates are given where recorded evidence of use has been found, sourced by the ongoing research for the Oxford English Dictionary.A large number of well-known idioms are included, with dates of original use and details of how and when they came about, such as happy as a sandboy, say it with flowers. Colourful popular beliefs are explored about words such as posh and snob, while insights are given into our social history: discover, for example, the connection in a Roman soldier's mind of salary with salt. Additional word histories outside this core group are included for words with a particularly interesting story to tell; boxed entries highlight links between words.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The iPod Book: Doing Cool Stuff With the iPod And the iTunes Music Store",
        "Authors": "By Kelby, Scott",
        "Description": "There are basically two kinds of iPod books: (1) The \"tell me all about it\" kind, which includes in-depth discussions on compression algorithms, debates about analog vs. digital equalizers; and tutorials on how to export your playlist in Unicode format. (2) There's this book. It's not a \"tell me all about it\" book, it’s a \"show me how to do it\" book.      Award-winning author Scott Kelby shows you step-by-step how it's all done, using the same casual, plain-English style that has made him one of the world's best-selling technology authors. You'll learn how to do only the most important, most requested, and just plain cool things you're going to want to do with your iPod–so you can start having fun with it today. Right now!      Each page covers just one topic, complete with full color photos, making it easy to find just what you're looking for fast. Plus, it shows you how to get the most from the iTunes Music Store, how to integrate your iPod into your car, which iPod accessories are hot, how to use photos with your iPod, and everything you need to know about the latest addition to the iPod family, the new iPod Nano! It's all here–in the only book of its kind–and you're gonna love it!",
        "Category": " Music , Recording & Reproduction",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Washington, D.C.: A Scrapbook",
        "Authors": "By Benson, Laura Lee and Van Rynbach, Iris (ILT)",
        "Description": "You won‘t need a permission slip for this trip to our nation's capitol. Join Danny and his friends on their class field trip and find out many fascinating facts about Washington D.C. and its history.Washington, D.C: A Scrapbook introduces readers of all ages to our exciting capitol city and all that it has to offer. History, culture, fun. . . . You arrive by Amtrak train at Union Station, see the U.S. Capitol, the White House, and the Lincoln Monument. Go to the National Zoo where you can watch Hsing Hsing, the panda, play. Ride the Metro all over the city. This book is the perfect travel companion for kids visiting the city for the first time, or for those who would like to. Instructions and tips for making your own scrapbook are provided in addition to a birds-eye map of the Mall, a timeline of Washington D.C. history, and a travel guide to important sites to see.With illustrations by Iris Van Rynbach, photos, Danny's journal entries, and oodles of mementos, this won't be a trip you will soon forget. Washington D.C.'s beautiful architecture, pristine parks and monuments, and rich history are finely detailed and fun to discover.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "Charlesbridge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "7 Paths to God: The Ways of the Mystic",
        "Authors": "By Borysenko, Joan",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Hay House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Brown Sunshine of Sawdust Valley",
        "Authors": "By Henry, Marguerite and Shields, Bonnie (ILT)",
        "Description": "Molly is delighted when the seemingly worn-out mare on her family's farm produces a beautiful new baby mule, which she names Brown Sunshine and which brings many other wonderful surprises. Reprint.",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Shopaholic & Baby: A Novel, Book Cover May Vary",
        "Authors": "By Kinsella, Sophie",
        "Description": "#1 NEW YORK TIMES BESTSELLER   Becky Brandon's life is blooming. She's working at London's newest big store, The Look, house-hunting with husband Luke (her secret wish is a Shoe Room) . . . and she's pregnant. She couldn't be more overjoyed'especially after discovering that shopping cures morning sickness. Everything has to be perfect for her baby: from the designer nursery and the latest stroller to top-of-the-line medical care.   But when the must-have celebrity obstetrician Becky's been so desperate to see turns out to be Luke's glamorous, intellectual ex-girlfriend, Becky's perfect world starts to crumble. She's shopping for two . . . but are there three in her marriage?   Praise for Sophie Kinsella and Shopaholic & Baby   'From sonograms to the hottest baby strollers to tricked-out birthing rooms . . . Kinsella's ode to baby blues is both sly and slapstick.''Publishers Weekly   'Faster than a swiping Visa, more powerful than a two-for-one coupon, able to buy complete wardrobes in a single sprint through the mall'it's Shopaholic!''The Washington Post   'Kinsella's heroine is blessed with the resilience of ten women, and her damage-limitation brain waves are always good for a giggle.''Glamour (U.K.)   'As fun as a shopping spree.''Entertainment Weekly",
        "Category": " Fiction , Women",
        "Publisher": "Dial Press Trade Paperback",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Unless",
        "Authors": "By Shields, Carol",
        "Description": "“Unless you’re lucky, unless you’re healthy, fertile, unless you’re loved and fed, unless you’re offered what others are offered, you go down in the darkness, down to despair.”Reta Winters has many reasons to be happy: Her three almost grown daughters. Her twenty-year relationship with their father. Her work translating the larger-than-life French intellectual and feminist Danielle Westerman. Her modest success with a novel of her own, and the clamour of her American publisher for a sequel. Then in the spring of her forty-fourth year, all the quiet satisfactions of her well-lived life disappear in a moment: her eldest daughter Norah suddenly runs from the family and ends up mute and begging on a Toronto street corner, with a hand-lettered sign reading GOODNESS around her neck.GOODNESS. With the inconceivable loss of her daughter like a lump in her throat, Reta tackles the mystery of this message. What in this world has broken Norah, and what could bring her back to the provisional safety of home? Reta’s wit is the weapon she most often brandishes as she kicks against the pricks that have brought her daughter down: Carol Shields brings us Reta’s voice in all its poignancy, outrage and droll humour.Piercing and sad, astute and evocative, full of tenderness and laughter, Unless will stand with The Stone Diaries in the canon of Carol Shields’s fiction.",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "David and Goliath (People of the Bible Series)",
        "Authors": "By Molan, Chris (ILT) and Storr, Catherine",
        "Description": "During a war between the Israelites and the Philistines, David, a young shepherd agrees to represent his people in single combat against Goliath, a giant Philistine warrior",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Heinemann/Raintree",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Art and the Intellect / Moral Values and the Experience of Art",
        "Authors": "By Taylor, Harold",
        "Description": "",
        "Category": "",
        "Publisher": "THE MUSEUM OF MODERN ART",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Zondervan Pictorial Bible Dictionary",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Solar System",
        "Authors": "By Alexander Gordon Smith",
        "Description": "",
        "Category": "",
        "Publisher": "Bookmart",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Jeb Stuart: The Last Cavalier",
        "Authors": "By Davis, Burke",
        "Description": "From the author of They Called Him Stonewall.  Definitive biography of the dashing Confederate general is history at its best: fascinating, colorful, provocative.  Includes portraits of Stuart's early life, training at West Point, the fateful decision to side with the South and action-packed battle scenes.  7 maps.  8 pages of photos.  470 pages.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The First Christmas (Enid Blyton, Religious Stories)",
        "Authors": "By Blyton, Enid and Hudson, Rosalind (ILT)",
        "Description": "A poignant retelling of the first Christmas presents the awe and joy surrounding the miraculous birth of Jesus.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Element Books Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Ordinary to Extraordinary: Terrific Treatments for Garment Sewing",
        "Authors": "By Lyla J. Messinger",
        "Description": "",
        "Category": "",
        "Publisher": "L. J. Designs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Advertising in America: The First Two Hundred Years",
        "Authors": "By Goodrum, Charles A and Dalrymple, Helen",
        "Description": "Traces the history of advertising in the United States from the earliest print ads for Ivory Soap to the cryptic Calvin Klein perfume ads of today",
        "Category": "",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "8.19",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Dinosaurs (Cool Facts)",
        "Authors": "By Dan Abnett, Nik Vincent",
        "Description": "",
        "Category": "",
        "Publisher": "Dempsey Parr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Desert Animals: Over 100 Questions and Answers to Things You Want To Know",
        "Authors": "By Green, Jen",
        "Description": "",
        "Category": "",
        "Publisher": "Dempsey Parr Book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "U.S. Army Counterintelligence Handbook",
        "Authors": "By Department of the Army",
        "Description": "The CIA is at the top of a cosmology of government and private concerns known collectively as the intelligence community. One of the most important components of this community is the U.S. Army Intelligence Center. Its mission is to provide information to commanders at all levels in the U.S. Army so that they are able to determine the capabilities of a foreign foe or act quickly on accurate, up-to-date intelligence. Now for the first time ever, the recently declassified U.S. Army Counterintelligence Handbook provides a rare look into the specialized and secretive world of military intelligence and counterintelligence procedure.Counterintelligence comprises efforts to determine what the enemy knows, efforts to keep friendly intelligence secret, and efforts to hamper the enemy's ability to collect and use intelligence. In this manual, the first four chapters provide counterintelligence information to the commander and his staff, while the remaining chapters cover the nuts-and-bolts of counterintelligence operations.The book covers everything from conducting background investigations to using field artillery to destroy stations. There is general information, for instance, on evaluating assassination threats, contacting members of friendly resistance organizations, and how best to handle moles. There is advice on checking and keeping files, conducting searches, and the administration of lie detector tests. Also covered are the ethics, legalities, and practical concerns of placing bugs, tapping telephones, and setting up listening posts for wireless intercepts, as well as the use of cameras and recorders. There is also information on tracking and connecting members of groups or cells, with advice on creating diagrams to illustrate the relationship among targets.The U.S. Army Counterintelligence Handbook is a must-read for anyone with an interest in today's difficult military intelligence questions, and provides answers right from the source.",
        "Category": " Reference , General",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "In the Kitchen: the Costco Way",
        "Authors": "By Talevich, Tim",
        "Description": "",
        "Category": "",
        "Publisher": "Costco Wholesale",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Cognitive Science: An Introduction",
        "Authors": "By Stillings, Neil A. (CON)",
        "Description": "",
        "Category": "",
        "Publisher": "Bradford Books",
        "Price Starting With ($)": "6.69",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Molly's Craft Book: A Look at Crafts from the Past With Projects You Can Make Today (AMERICAN GIRLS PASTIMES)",
        "Authors": "By Evert, Jodi (EDT), Bernstein, Rebecca Sample (EDT), Salisbury, Mark (ILT), and Bourget, Geri Strigenz (ILT)",
        "Description": "Presents crafts from World War II",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "International Business with Online Learning Center access card",
        "Authors": "By Hill, Charles W. L.",
        "Description": "Market-defining since it was first introduced, International Business 6e by Charles W. L. Hill, continues to set the standard for international business textbooks.  In writing the book, Charles Hill draws on his experience in teaching, writing, and global consulting to create the most thorough, up-to-date, and thought-provoking text on the market. Because many issues in international business are complex, the text explores the pros and cons of economic theories, government policies, business strategies, organizational structures, etc. Hill’s: International Business is known for its strong emphasis on strategy, and for maintaining a tight integrated flow between chapters. Hill’s book is practical in nature, focusing on the managerial implications of each topic on the actual practice of international business. The author’s passion and enthusiasm for the international business arena is apparent on every page as he strives to make important theories interesting, informative, and accessible to all students.",
        "Category": " Business & Economics , International , General",
        "Publisher": "McGraw-Hill/Irwin",
        "Price Starting With ($)": "8.09",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Ultimate LEGO Book",
        "Authors": "By DK Publishing",
        "Description": "Stunning photography introduces young LEGO fans to the wonderful world of model making with LEGOs, featuring life-size sculptures of dinosaurs, monuments, buildings, and more. 50,000 first printing.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , General",
        "Publisher": "DK Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Fun House!",
        "Authors": "By Harper, Benjamin and Stewart, Scott (ILT)",
        "Description": "When Peter Parker is at an amusement park to take pictures of a fashion show starring Mary Jane, Sandman wreaks havoc and captures Mary Jane in an effort to trap Spider-Man.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Marvel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "First Kids (Step into Reading)",
        "Authors": "By Comport, Sally Wern (ILT) and Davis, Kathryn Gibbs",
        "Description": "Kids will be kids—even when they live in the White House! Discover the stories of our presidents' children in this leveled reader perfect for President's Day!From Tad Lincoln (secretly   called a “tyrant” ) to the Roosevelt gang (who kept a pet badger, a rat, dogs, snakes,   horses, parrots, and a one-legged chicken!) to the Kennedys (who used the oval office   as a playground) to Chelsea Clinton (who transformed herself from an awkward teen   into an accomplished scholar), the children featured in First Kids shared a unique   experience and role in American history.",
        "Category": " Juvenile Nonfiction , Readers , Intermediate",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Crossroads 2: Student Book (Four-Level ESL Series)",
        "Authors": "By Stevick, Earl W., Frankel, Irene, Brod, Shirley, and Spring Institute for International Studi (CON)",
        "Description": "Crossroads follows a carefully integrated syllabus based on competencies and grammatical objectives.",
        "Category": " Literary Criticism , Semiotics & Theory",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "The New Smart Approach to Bath Design",
        "Authors": "By Maney, Susan",
        "Description": "The New Smart Approach® to Bath Design explains everything a homeowner needs to know to design and decorate a bathroom. Helping readers to think like a professional, this book provides advice for designing a master bath, family bath, kids' bath, and powder room, hiring design and construction professionals, shopping for materials, fixtures, and fittings, space planning, lighting, storage, safety, and decorating with style.",
        "Category": " House & Home , Decorating",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Reservation Blues",
        "Authors": "By Alexie, Sherman",
        "Description": "The miraculous appearance of blues legend Robert Johnson inspires Spokane Indian Thomas Builds-the-Fire to form an all-Indian Catholic band, and they embark on a magical tour across the nation and deep within their own souls. Reprint.",
        "Category": " Fiction , Literary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Introduction to Comparative Politics",
        "Authors": "By Krieger, Joel (EDT), Kesselman, Mark (EDT), and Joseph, William A. (EDT)",
        "Description": "Written by a distinguished group of comparativists, this innovative and accessible introductory text surveys 12 key countries organized according to their level of political development: established democracies, transitional democracies, and non-democracies. The country studies illuminate four comparative themes in a global context: the world of states, examining the interaction of states within the international order; governing the economy, covering the role of the state in economic management; the democratic idea, discussing the pressure for more democracy and the challenges of democratization; and the politics of collective identities, studying the political impact of diverse attachments and sources of group identity.All 12 country studies, as well as two additional studies, are available in an online database. Instructors may choose from among these chapters (a minimum of 7) to create a customized text.",
        "Category": " Political Science , Comparative Politics",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Introduction to Comparative Politics: Political Challenges and Changing Agendas",
        "Authors": "By Krieger, Joel (EDT), Kesselman, Mark (EDT), and Joseph, William A. (EDT)",
        "Description": "",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "A Manual of Style: A Guide to the Basics of Good Writing",
        "Authors": "By U. s. Government Printing Office (COR)",
        "Description": "A perfect gift for a student or anyone looking to improve writing skills, this volume offers easy-to-understand instructions for creating clear, concise documents.",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "What Baby Needs (Sears Children's Library)",
        "Authors": "By Sears, Martha, Sears, William, Kelly, Christie Watts, and Williams-Andriani, Renee (ILT)",
        "Description": "When a family brings a new baby home, there are many changes. Older siblings may find it hard to understand the needs of the new baby, as well as the demands placed on mom and dad. Based on the attachment-parenting theories of the foremost authorities on parenting and childcare, William Sears, M.D., and Martha Sears, R.N., this book clearly explains baby's needs. The text emphasizes how siblings can be helpers to both baby and parents, while forging their own relationships with \"their baby,\" and outlines the positive aspects of being an older girl or boy. Here is a warm, insightful book that will help the whole family joyously and lovingly welcome the newest member into their lives.",
        "Category": " Juvenile Nonfiction , Family , Siblings",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Official eBay Guide to Buying, Selling, and Collecting Just About Anything",
        "Authors": "By Kaiser, Laura Fisher and Kaiser, Michael B.",
        "Description": "HAPPY HUNTING&#153; ON eBay  Aunt Fannie's cameo pin collection...the cartoon-character lunch boxes you had in third grade...that cast-iron doorstop you bought for $2 but is really worth $200....Whether you're a busy buyer, an avid seller, or just a fun-loving browser, you'll find countless collectibles like these on eBay, the world's largest person-to-person online trading community.  Now -- in this official primer from the popular Internet site that has revolutionized the collecting world -- the experts at eBay unlock the secrets of successful online buying and selling, for everyone from the enthusiastic beginner to the seasoned pro. Featuring an introduction by Pierre Omidyar, eBay's founder and chairman, and packed with tips and stories from \"eBaysians\" all over the country, The Official eBay&#153; Guide is the only authorized book that shows you how to  * BUY SMART -- unraveling the mystery of value, bidding to win, and learning how to spot the really good stuff * BE A SAVVY SELLER -- from writing the perfect item listing to collecting payments from your happy customers * LEARN FROM THE EXPERTS -- top eBaysians, Ambassadors, Power Sellers, and eBay employees lend advice and share secrets for success * FIND THE GREAT STUFF -- how to work garage sales, flea markets, tag sales, estate sales, and even the other kind of auction  Packed with invaluable resources, information, and practical tips, The Official eBay&#153; Guide also features entertaining stories about the millions of people who make up the eBay community. It's your must-have companion for mastering the art of buying and selling an astounding range of collectibles and items, from the practical to the whimsical.",
        "Category": " Antiques & Collectibles , Reference",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Dramacon, Volume 2",
        "Authors": "By Chmakova, Svetlana (CRT)",
        "Description": "It's Christie's second year at the Lakeside Anime Convention and the drama picks up right where it left off in Dramacon volume one! With her new partner-in-crime, a.k.a. artiste extraordinaire Bethany, she is promoting her latest comic. Matt is also back, but to Christie's shock, he now has a girlfriend!",
        "Category": " Young Adult Fiction , Comics & Graphic Novels , Manga",
        "Publisher": "TOKYOPOP Classics",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Day It Rained Money",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Weight Watchers Annual Recipes for Success 2008",
        "Authors": "By Editor-Terri Laschober Robertson",
        "Description": "",
        "Category": "",
        "Publisher": "Weight Watchers",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Oracle: Forms Developer's Companion",
        "Authors": "By Muench, Steve, Adams, Brian, and Yang, Andrew",
        "Description": "",
        "Category": "",
        "Publisher": "Maverick Publications (CA)",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Harvard Business Review on Corporate Strategy (Harvard Business Review Paperback Series)",
        "Authors": "By Prahalad, C. K., Campbell, Andrew, Collis, David J., Montgomery, Cynthia A., Lieberthal, Kenneth, Goold, Michael, and Hart, Stuart L.",
        "Description": "For readers who need to stay up-to-date on the new rules and evolving ideas that are shaping today's corporate strategies, this reference is essential. The Harvard Business Review Paperback Series is designed to bring today's managers and professionals the fundamental information they need to stay competitive in a fast-moving world. Here are the landmark ideas that have established the Harvard Business Review as required reading for ambitious businesspeople in organizations around the globe. Articles include: Creating Corporate Advantage by David J. Collis and Cynthia A. Montgomery; Competing on Resources: Strategy in the 1990s by David J. Collis and Cynthia A. Montgomery; Desperately Seeking Synergy by Michael Goold and Andrew Campbell; The End of Corporate Imperialism by C.K. Prahalad and Kenneth Lieberthal; Beyond Greening: Strategies for a Sustainable World by Stuart L. Hart and Jeffrey F. Rayport; Why Focused Strategies May be Wrong for Emerging Markets by Tarun Khanna and Krishna G. Palepu; Competing on Capabilities: The New Rules of Corporate Strategy by George Stalk, Jr., Philip Evans, and Lawrence E. Shulman; and Corporate Strategy: The Quest for Parenting Advantage by Andrew Campbell, Michael Goold, and Marcus Alexander.",
        "Category": " Business & Economics , Decision-Making & Problem Solving",
        "Publisher": "Harvard Business Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "How to Have a Fabulous, Romantic Honeymoon on a Budget",
        "Authors": "By Warner, Diane",
        "Description": "Offers advice on gathering information about honeymoon travel, finding the best bargains in honeymoon travel, dining on a budget, getting an affordable rental car, and other information. Original.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Betterway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "A Treasury of Folk Songs Revised Edition",
        "Authors": "By Sylvia and John Kolb",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "The Final Cut (Allstar Sportstory)",
        "Authors": "By Bowen, Fred and Barrow, Ann (ILT)",
        "Description": "Decidedly unenthusiastic about spending part of her summer vacation with her grandparents, twelve-year-old Samantha is particularly upset by her prickly grandfather's secretive behavior and decides to find out what he is hiding. Sam's discovery of his secret helps strengthen their relationship and discover hidden talents of her own.",
        "Category": " Juvenile Fiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "Peacehaven Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "4 Ingredient Recipes for 30 Minute Meals: 100 Menus with Recipes, Short Cuts, Grocery Lists",
        "Authors": "By Barbara C. Jones",
        "Description": "",
        "Category": "",
        "Publisher": "Cookbook Resources, LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Egyptology Handbook: A Course in the Wonders of Egypt (Ologies)",
        "Authors": "By Sands, Emily",
        "Description": "Inside this indispensable and beautifully illustrated workbook is everything you need to know to become an esteemed Egyptologist.As readers of the fascinating EGYPTOLOGY are all too aware, the feisty explorer Emily Sands mysteriously vanished on an expedition up the Nile in 1927. But in a remarkable turn of fortune for Miss Sands's many fans, detectives have uncovered a second volume penned in her own hand — a course book on ancient Egyptian history and culture intended for the voyager's beloved niece and nephew. Now available to budding Egyptologists everywhere, this comprehensive volume — illustrated by the same artists who lent their talents to EGYPTOLOGY — is brimming with facts on ancient Egyptian culture and history, followed by intriguing assignments and fill-in opportunities on everything from archaeological finds to theories on how the pyramids were built. Among the book's delightful novelty elements are: — An envelope containing Miss Emily Sands's Top Ten Things to See in Egypt — Flaps to lift, revealing hidden treasure in desert sands— A four-page foldout section full of stickers featuring treasures from King Tut's tomb and other ancient Egyptian artifacts.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "'Til We Meet Again: 'Til We Meet Again/Eliza/Precious Jewels/Thanks to a Lonely Heart (Heaven Sent Heartbeat)",
        "Authors": "By Pamela Griffin, Mildred Colvin, Nancy J. Farrier, Kasandra Elaine",
        "Description": "",
        "Category": "",
        "Publisher": "Crossings Book Club",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Courtesan's Secret (The Courtesan Series)",
        "Authors": "By Dain, Claudia",
        "Description": "Second in the ?cleverly orchestrated,?( Library Journal) Regencyset series featuring the matchmaking schemes of an infamous ex-courtesan. On the night of her debut two years ago, Lady Louisa Kirkland fell for the devilish Marquis of Dutton. It?s high time, she?s decided, that he realized he loves her. Also, there is the matter of Louisa?s family pearls, which are in his possession. For both problems, Louisa will need the help of Lady Sophia, an ex-courtesan more clever than all the other ton matrons combined?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Household hints and handy tips",
        "Authors": "By Reader's Digest Association and French, Sally (EDT)",
        "Description": "A comprehensive guide featuring more than four thousand practical tips, shortcuts, and how-to suggestions for the home encompasses topics ranging from money management to etiquette, plumbing and home repairs to emergency first aid. Reprint. 30,000 first printing.",
        "Category": " House & Home , Repair",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Rebel Agent",
        "Authors": "By Lawrence, James",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "The Adventures and the Memoirs of Sherlock Holmes (Sterling Unabridged Classics)",
        "Authors": "By Doyle, Arthur Conan, Sir and McKowen, Scott",
        "Description": "The illustrations for this series were created by Scott McKowen, who, with his wife Christina Poddubiuk, operates Punch & Judy Inc., a company specializing in design and illustration for theater and performing arts. Their projects often involve research into the visual aspects of historical settings and characters. Christina is a theater set and costume designer and contributed advice on the period clothing for the illustrations.Scott created these drawings in scratchboard ­ an engraving medium which evokes the look of popular art from the period of these stories. Scratchboard is an illustration board with a specifically prepared surface of hard white chalk. A thin layer of black ink is rolled over the surface, and lines are drawn by hand with a sharp knife by scraping through the ink layer to expose the white surface underneath. The finished drawings are then scanned and the color is added digitally.It’s elementary—there’s no more intriguing detective than Sherlock Holmes, with his unequalled powers of deduction, and no better mysteries than the tricky ones that only he can solve. Here are some of the finest Holmes stories, recounted by his trusty friend and assistant, Dr. Watson.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Historic Baltimore  Twelve Walking Tours of Downtown, Fells Point, Locust Point, Federal Hill & Mount Clare",
        "Authors": "By Priscilla L. Miles",
        "Description": "",
        "Category": "",
        "Publisher": "Historic Baltimore Tours",
        "Price Starting With ($)": "9.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Sunday's Silence",
        "Authors": "By Gina Barkhordar Nahai",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Miss Honey's Busy Day (Richard Scarry's Busy Day Storybooks)",
        "Authors": "By Richard Scarry",
        "Description": "",
        "Category": "",
        "Publisher": "J. B. Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Campfire Sleepover (Pony)",
        "Authors": "By Sharon Siamon",
        "Description": "",
        "Category": "",
        "Publisher": "Stabenfeldt Inc",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Ten Best Things About My Dad",
        "Authors": "By Urbanovic, Jackie (ILT) and Loomis, Christine",
        "Description": "A child relates the things he likes best about his father--and the best thing of all? It's that \"my dad is extra special, just because he's mine!\" A perfect book for Father's Day!There are lots of wonderful things about Dad, as told by a young narrator in this rhyming 8 x 8 paperback. The father plays games, gives hugs, teaches right from wrong, cheers on his child, goes for rides in the car, reads bedtime stories over and over, scares monsters away, listens to problems, and tells jokes.But here's what is the best of all,even better than the other nine.My dad is extra special--just because he's mine!",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Get Hired Fast! Tap the Hidden Job Market in 15 Days",
        "Authors": "By Graham, Brian",
        "Description": "The Job Search Technique Most Recommended by Top Career CounselorsYou lost your job six months ago. You've emailed 90 resumes. You've scoured the job boards and the help wanted ads. You've called recruiters, old bosses, former coworkers...but nothing. You're scared. You're beginning to think there are no jobs out there. But there ARE jobs. And you can get one of them--if you're willing to try the job search technique that most people are too timid to try.If you're one of 9 million Americans looking for a job, you don't want to go 12 to 24 months without a job offer (as many do). The trick is to tap into the hidden job market--where 90 percent of the jobs really are!Get Hired FAST! shows you how to use a direct-calling strategy that will generate at least three interviews in three weeks. It gives you a 15-day Action Plan, complete with charts, scripts, and other tools that will enable you to use the direct-calling technique like a professional.This no-holds-barred book also includes insider advice on how to ace the interview once your calling strategy pays off, negotiate the best offer, and keep the job once you get it.Get Hired FAST! shows you where and how to identify key contacts in target companies, how to uncover crucial data about target companies, how to script calls to hiring managers in advance--and handle any scenario, from voicemail to conversations with contacts' staffers.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Sharing Makes Me Happy",
        "Authors": "By Cachiaras, Dot",
        "Description": "",
        "Category": "",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Betty Crocker's Fix-It-Fast Family Favorites: More Than 400 Great-Tasting Ways to Get Dinner on the Table",
        "Authors": "By Crocker, Betty",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "General Mills Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Dora's Storytime Collection (Dora the Explorer)",
        "Authors": "By Various",
        "Description": "Dora and her best friend, Boots, go on more adventures than you can count. Now Dora fans can enjoy many of their favorite Dora stories all in one book! This best-selling collection includes:  Dora's Backpack Little Star Happy Birthday, Mami! Meet Diego!  Dora Saves the Prince Dora's Treasure Hunt Good Night, Dora!",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "American Dream Horses",
        "Authors": "By Imago, Studio and Bishop, Ann",
        "Description": "",
        "Category": "",
        "Publisher": "Pony Club, Stabenfedlt A/S, Eurolitho S.p.A.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Creative Weddings",
        "Authors": "By Van Der Meer, Antonia",
        "Description": "You're no idiot, of course.  You're not afraid to express your ideas or to stray from the tired and true.  And you are known among your friends and loved ones for your great personal style. But when it comes to veering from the traditional nuptial path, you are starting to feel like eloping is the only answer.  Don't book Elvis's Chapel of Love just yet!  The Complete Idiot's Guide to Creative Weddings is here to help you make your wedding day more than just a cookie-cutter celebration.  In this book, you'll learn how to plan the perfect creative wedding by hatching your own new traditions that express your personal style.  You'll blend in the family rituals that you treasure and still make it to the altar in one piece.  In this Complete Idiot's Guide, you'll get:",
        "Category": " Social Science , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Family Passions",
        "Authors": "By Gerritsen, Tess, Krentz, Jayne Ann, and Delinsky, Barbara",
        "Description": "Three complete novels in one touching volume include Jayne Ann Krentz's The Family Way in which pregnant Pru Kenyon decides to walk away from Case McCord, the man that she loves, because she is unwilling to force her commitment-shy lover into marriage, as well as Barbara Delinsky's The Stud and Presumed Guilty by Tess Gerritsen. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Where Angels Go: Shirley, Goodness & Mercy are Back",
        "Authors": "By Macomber, Debbie",
        "Description": "Christmas is a time for angel.Shirley, Goodness and Mercy are back! These three irresistible angels love their assignments on Earth. They especially love helping people who send prayer requests to Heaven (even though the Archangel Gabriel, their boss, knows they're going to break his rules)!This Christmas, Mercy is assigned to bring peace of mind to an elderly man&#151; who discovers an unexpected answer to his prayer.Goodness is sent to oversee the love life of a young woman afraid to risk commitment a second time.  And Shirley has the task of granting a little boy's fondest Christmas wish.Shirley, Goodness and Mercy go wherever they're needed. These three charming angels often find themselves in trouble, but somehow things always work out for the best&#151;especially at Christmas.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Lions (All About Animals)",
        "Authors": "By reader-s-digest",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Buster's Day",
        "Authors": "By Campbell, Rod",
        "Description": "",
        "Category": "",
        "Publisher": "Campbell Blackie Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Three Mrs. Parkers",
        "Authors": "By Medlicott, Joan A.",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Coffee with Oscar Wilde (Coffee with...Series)",
        "Authors": "By Holland, Merlin and Callow, Simon (FRW)",
        "Description": "Oscar Wilde’s own grandson, with the help of actor and author Simon Callow?who has performed Wilde’s work on stage?capture the essence of this wittiest of all playwrights. Set in Paris, where he fled after the scandalous trial that revealed his homosexuality, Wilde chats about language, his mother (an esteemed Irish folklorist), transforming his life into a work of art (?My great tragedy is that I put my genius into my life?and only my talent into my work”), his time in prison, his concept of morality, and why he thinks ?in life, style, not sincerity, is the essential.”",
        "Category": " Fiction , Biographical",
        "Publisher": "Duncan Baird",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Coffee with Groucho (Coffee with...Series)",
        "Authors": "By Louvish, Simon and Ferrante, Frank (FRW)",
        "Description": "With a foreword by the actor, director, and playwright described as ?the greatest living exponent of Groucho Marx’s material” by The New York Times, and text by the author of Monkey Business, a biography of the Marx Brothers, this bio brings the wisecracking, cigar-chomping, eyebrow-raising comedian to life on the page. Groucho discusses such issues as the film Duck Soup, the rules of comedy, the directors he worked with, and his talented brothers Harpo and Chico (?You know, of course, those two aren’t really acting when they play those scenes. They’re just being themselves.”).",
        "Category": " Fiction , Biographical",
        "Publisher": "Duncan Baird",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Holistic Aromatherapy: Balance the Body and the Soul With Essential Oils",
        "Authors": "By Berwick, Ann",
        "Description": "Have you ever wanted to help people heal? Perhaps you would like to help people with spiritual and mental problems as well as physical ailments. You may think that to do this would require years of study, but the truth is you can quickly learn how to use scents to enhance healing with Aromatherapy: A Holistic Guide by Ann Berwick.Trained at the London School of Aromatherapy, Ms. Berwick clearly shows you everything you need to know to add the science of healing with aromatics to your life. This book reveals:- Where the life force of the plant exists - How essential oils are extracted from a plant - What to look for when buying essential oils (and what to avoid!) - Methods of using essential oils in aromatherapy - How to interview a client who wants to use aromatherapy in healing - The twenty-four essential oils you must have, including when to use them, how to blend them with other oils, and how to administer them in a treatment.For example, you'll learn that cypress is good as a deodorant, to restore the nervous system and more. It is good for any condition involving excess body fluids such as excessive perspiration and bleeding gums. It blends well with juniper, lavender, pine and sandalwood. If you are treating a circulatory system problem, use it in baths and massage. For respiratory problems use it in chest rubs, inhalations, and compresses.With comprehensive information on twenty-four essential oils, and step-by-step instructions on how to mix and use them, this book can become your personal guide to alternative healing.No matter what spiritual system you practice, you will find that aromatherapy is a safe and powerful addition to other healing techniques.",
        "Category": " Health & Fitness , Aromatherapy",
        "Publisher": "Llewellyn Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "100 Successful College Application Essays (Second Edition)",
        "Authors": "By The Harvard Independent",
        "Description": "The largest collection of successful college application essays available in one volume.    These are the essays that helped their authors gain admission to Harvard, Yale, Brown, Columbia, Wellesley, Colby, and other outstanding schools—followed by invaluable comments by experts in admissions, placement, and college counseling at some of the best learning institutions around the country. This helpful guide includes:      100 complete essays with professional commentary    Examples of essays on common topics (family background, athletics, work experience), as well as the more offbeat    Essays on the immigrant experience by foreign-born students    A section of drawing and cartoon essays    Insider advice from a Princeton dean of admissions    A “What Not to Do” chapter from a top college counselor    And more    Compiled by members from The Harvard Independent, the weekly newsmagazine of Harvard University, this is an invaluable resource for students who want to write the best possible essay—and improve their chances of admission to the best possible school.",
        "Category": " Study Aids , College Guides",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Sharper Your Knife, the Less You Cry: Love, Laughter, and Tears in Paris at the World's Most Famous Cooking School",
        "Authors": "By Flinn, Kathleen",
        "Description": "Kathleen Flinn's unforgettable, New York Times Bestselling account of her French culinary adventures Kathleen Flinn was a thirty-six-year-old middle manager trapped on the corporate ladder - until her boss eliminated her job. Instead of sulking, she took the opportunity to check out of the rat race for good - cashing in her savings, moving to Paris, and landing a spot at the venerable Le Cordon Blue cooking school. The Sharper Your Knife, the Less You Cry is the funny and inspiring account of her struggle in a stew of hot-tempered, chefs, competitive classmates, her own \"wretchedly inadequate\" French - and how she mastered the basics of French cuisine. Filled with rich, sensual details of her time in the kitchen - the ingredients, cooking techniques, wine, and more than two dozen recipes - and the vibrant sights and sounds of the markets, shops, and avenues of Paris, it is also a journey of self-discovery, transformation, and, ultimately, love.",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Murder Most Irish",
        "Authors": "By Ed Gorman",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Pasta Classica",
        "Authors": "By Della Croce, Julia",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Coffee Book: Featuring a Section on Teas (Nitty Gritty Cookbooks)",
        "Authors": "By Katona, Christie and Katona, Thomas",
        "Description": "",
        "Category": " Cooking , Beverages , Coffee & Tea",
        "Publisher": "Bristol Publishing Enterprises",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    }
]