[
    {
        "Title": "Politically Correct Guns",
        "Authors": "By Gottlieb, Alan M.",
        "Description": "Politically Correct Guns is a take-no-prisoners invasion of the Gun Control crowd&#39;s territory, lobbing humor grenades at their hypocrisy, bombing their misplaced zeal with clever vignettes, and surrounding their anti-gun rhetoric with such pointed parody that even Gun-Banner Bill Clinton will have to laugh at himself. Alan Gottlieb has done it again with Politically Correct Guns, defending our gun rights with wit and facts-and this time, with some really strange but true stories. Like the section on Goofy Gun Laws, which tell of a town that makes it illegal for a woman to shoot in the direction of a police officer with the intention of shooting off his neck tie! And the Drug Enforcement Agency officer who shot a topless bar owner for putting a cover charge on his bachelor party! And Teddy Kennedy&#39;s armed bodyguard who got arrested in a Senate Office Building while trying to check his weapons before escorting his anti-gun boss on a big trip! This is a must reading for every gun owner- and every gun control advocate, too!",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Merril Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Argentina: A City and a Nation (Latin American Histories)",
        "Authors": "By Scobie, James R.",
        "Description": "The present state of economic crisis and political upheaval in Argentina is analyzed against its social, industrial and political background",
        "Category": " History , Latin America , South America",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1971"
        }
    },
    {
        "Title": "together: a story of shared vision",
        "Authors": "By Sullivan, Tom with White, Betty",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Rules of Civility for the 21st Century from Cub and Boy Scouts across America",
        "Authors": "By Wallner, John C. (ILT) and Wheelwright, Henry C. (EDT)",
        "Description": "",
        "Category": " Social Science , Customs & Traditions",
        "Publisher": "Stone Wall Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "The Gospel According to the Son: A Novel",
        "Authors": "By Mailer, Norman",
        "Description": "Norman Mailer fused fact and fiction to create indelible portraits of such figures as Marilyn Monroe, Gary Gilmore, and Lee Harvey Oswald. In The Gospel According to the Son, Mailer reimagines, as no other modern author has, the key character of Western history. Here is Jesus Christ’s story in his own words: the discovery of his divinity and the painful, powerful journey to accepting and expressing it, “as if I were a man enclosing another man within.” In its brevity and piercing simplicity, it may be Mailer’s most accessible, direct, and heartfelt work.   Praise for The Gospel According to the Son   “Quietly penetrating . . . [Norman Mailer’s] gospel is written in a direct, rather relaxed English that yet has an eerie, neo-Biblical dignity.”—John Updike, The New Yorker   “A book of considerable intellectual force . . . The writer’s powerful mind works in a specialized way, not by theological argumentation but by telling or retelling a story.”—The New York Review of Books   “Challenges readers on the religious right and the atheist left with equally rich interpretive tasks.”—The Dallas Morning News   “An informed and believable work of fiction . . . of what may have been going through the mind of Jesus during his epic ministry.”—San Francisco Chronicle   Praise for Norman Mailer   “[Norman Mailer] loomed over American letters longer and larger than any other writer of his generation.”—The New York Times   “A writer of the greatest and most reckless talent.”—The New Yorker   “Mailer is indispensable, an American treasure.”—The Washington Post   “A devastatingly alive and original creative mind.”—Life   “Mailer is fierce, courageous, and reckless and nearly everything he writes has sections of headlong brilliance.”—The New York Review of Books   “The largest mind and imagination [in modern] American literature . . . Unlike just about every American writer since Henry James, Mailer has managed to grow and become richer in wisdom with each new book.”—Chicago Tribune   “Mailer is a master of his craft. His language carries you through the story like a leaf on a stream.”—The Cincinnati Post",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Reptiles & Amphibians (My First Pocket Guide)",
        "Authors": "By Craig, Claire and Kirshner, David (ILT)",
        "Description": "Discusses the differences between reptiles and amphibians, and gives examples of both, including size, color, appearance, behavior, and where to find them.",
        "Category": " Juvenile Nonfiction , Animals , Reptiles & Amphibians",
        "Publisher": "Natl Geographic Soc Childrens books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Learning Web Design: A Beginner's Guide to HTML, Graphics, and Beyond",
        "Authors": "By Niederst, Jennifer",
        "Description": "In Learning Web Design, author Jennifer Niederst shares the knowledge she's gained from years of web design experience, both as a designer and a teacher.  This book starts from the beginning-- defining the Internet, the Web, browsers, and URLs -- so you don't need to have any previous knowledge about how the Web works.  After reading this book, you'll have a solid foundation in HTML, graphics, and design principles that you can immediately put to use in creating effective web pages.In the second edition, Jennifer has updated the book to cover style sheets and reflect current web standards.  She has also added exercises that help you to learn various techniques and short quizzes that make sure you're up to speed with key concepts.  The companion CD-ROM contains material for all the exercises in the book, as well as trial versions of Fireworks® MX, and HomeSite™ 5; Adobe ® Photoshop® 7, ImageReady® 7, and BBEdit 7.Learning Web Design, 2nd Edition:Covers the nuts and bolts of basic HTML and style sheets, with detailed examples of formatting text, adding graphic elements, making links, creating tables and frames, and using color on the Web.Explains whether to use GIFs or JPEGs for different types of images, and includes important tips on optimizing graphics for web delivery.Provides dozens of web design do and don'ts, to help you make good web design decisions and avoid common beginner traps.Contains hands-on exercises throughout the book that allow you to try out new techniques along the way.Unlike other beginner books, Learning Web Design leaves no holes in your education.  It gives you everything you need to create basic web sites and will prepare you for more advanced web work.  If you are interested in web design, this book is the place to start.  After finishing it, you'll be ready for the author's bestselling companion reference, Web Design in a Nutshell. Fireworks and HomeSite are trademarks or registered trademarks of Macromedia, Inc. in the United States and/or other countries. Adobe, ImageReady, and Photoshop are either registered trademarks or trademarks of Adobe Systems Incorporated in the United States and/or other countries.",
        "Category": " Computers , Web , Design",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "6.37",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Football Double Threat (Matt Christopher Sports Classics)",
        "Authors": "By Christopher, Matt and Peters, Stephanie",
        "Description": "Rocky Fletcher is being stretched to his limit. Until recently, he'd only played wide receiver for the Pythons. Now his coaches want him to learn the safety position, too-a position that opened up when Bobby, Rocky's best friend, broke his leg. Even though he believes he is to blame for Bobby's injury, Rocky eagerly takes on the challenge of becoming a two-way player. After all, the only other player available is Jared, a sullen boy who switched from soccer to football this season. Yet as time goes on, it's Jared who excels at the position because, thanks to Bobby, Rocky keeps missing practices! What's going on between Rocky and Bobby-and why is Jared on the team when he clearly dislikes football so much? Football Double Threat combines the action and excitement of football with relatable issues about envy, loyalty, and friendship.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Insight Compact Guide Hawaii-Maui (Insight Compact Guides)",
        "Authors": "By Rutherford, Scott",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Insight Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Bathtime Peekaboo!: Touch-and-Feel and Lift-the-Flap",
        "Authors": "By Sirett, Dawn and Hester, Elizabeth",
        "Description": "We all know how much babies love to play peekaboo—they can’t get enough of it! DK's Peekaboo books combine fun and learning with this interactive book that infants 8 months old and up will adore.  Play along with your child as they develop new memory and sensory skills.    Includes: •Exciting touch-and-feel pages to explore. •Liftable flaps to discover new things.   It’s endless bathtime fun for babies and their parents!",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Shots",
        "Authors": "By Lingwood, William (PHT) and Reed, Ben",
        "Description": "",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "Ryland Peters & Small",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Gossie (Gossie & Friends)",
        "Authors": "By Dunrea, Olivier",
        "Description": "Meet Gossie, a small yellow gosling who loves to wear bright red boots—every day. One morning Gossie can’t find her beloved boots. She looks everywhere for them: under the bed, over the wall, even in the barn. Preschoolers will enjoy helping Gossie find her red boots and delight in where Gossie finally finds them.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The First Horse I See",
        "Authors": "By Keehn, Sally M.",
        "Description": "Before she died, Willo’s mother made her father promise that Willo could finally have a horse. Her grandfather warns her: don’t fall in love with the first horse that you see. But Willo does—with Tess, a feisty ex-racehorse who has been mistreated by her former owners. Despite her father’s doubts, Willo is convinces she can tame her. She has her trainer, Diana, and Diana’s handsome and horse-smart son wants to help. But in the end, it comes down to Willo. . . . Can she handle the wild Tess alone?   “Fast-moving and complex. Willo is a resilient and believable heroine with whom readers will empathize.”—SLJ, starred review",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Improving Schools Through Action Research: A Comprehensive Guide for Educators",
        "Authors": "By Hendricks, Cher",
        "Description": "This text emphasizes the reflective processes used in planning and conducting action research studies, data analysis techniques (quantitative and qualitative), and displaying and explaining results. It provides specific information needed to complete each step of the action research cycle with chapter activities that help the student/reader conduct projects focused on school improvement. Each activity includes a research paper component that helps students create a research paper as they complete the activities.",
        "Category": " Education , Leadership",
        "Publisher": "Pearson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Working with Students: Discipline Strategies for the Classroom;",
        "Authors": "By Ruby K. Payne",
        "Description": "",
        "Category": "",
        "Publisher": "aha! Process, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Workforce 2020 : Work and Workers in the 21st Century",
        "Authors": "By Judy, Richard W., D'Amico, Carol, and Geipel, Gary L.",
        "Description": "Ten years ago Hudson Institute's landmark study Workforce 2000 set the agenda for a new understanding of workforce issues. Described by the New York Times as \"one of the most influential studies ever produced by a think tank,\" this groundbreaking report set the terms for much of the policy discussion at the government and corporate levels on these issues. It was the first to call attention to the changing demographics of the American workforce and the growing gap between the skills likely to be required for entry-level jobs in the future and those likely to be possessed by new entrants into the labor force.Now Hudson releases its long-awaited follow-up: Workforce 2020. Like its predecessor, the new book examines the trends that shape the economy and workforce, and combines them into a unique and fresh body of analysis. The authors set the record straight on the demographic makeup of the workforce in the years 2000 to 2020 and challenge the conventional wisdom on trends affecting American workers and employers. Analyzing important emerging issues, they detail the coming demographic changes in the workforce--and their potentially serious effects on the job market and the economy as a whole.The book also considers the effects of globalization on U.S. business and the American worker, the impact of rapid technological change, the \"skills gap\" identified in the earlier report, and the need for a new model of education, training, and employment services to prepare workers for the jobs of the next century.Workforce 2020 is an indispensable guide to the next decade of workforce issues.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Hudson Inst",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Clean Tech Revolution: The Next Big Growth and Investment Opportunity",
        "Authors": "By Pernick, Ron and Wilder, Clint",
        "Description": "When industry giants such as GE, Toyota, and Sharp and investment firms such as Goldman Sachs are making multibillion-dollar investments in clean technology, the message is clear. Developing clean technologies is no longer a social issue championed by environmentalists; it's a moneymaking enterprise moving solidly into the business mainstream. In fact, as the economy faces unprecedented challenges from high energy prices, resource shortages, and global environmental and security threats, clean tech—technologies designed to provide superior performance at a lower cost while creating significantly less waste than conventional offerings—promises to be the next engine of economic growth.In The Clean Tech Revolution, authors Ron Pernick and Clint Wilder identify the major forces that have pushed clean tech from back-to-the-earth utopian dream to its current revolution among the inner circles of corporate boardrooms, on Wall Street trading floors, and in government offices around the globe. By highlighting eight major clean-tech sectors—solar energy, wind power, biofuels and biomaterials, green buildings, personal transportation, the smart grid, mobile applications, and water filtration—they uncover how investors, entrepreneurs, and individuals can profit from this next wave of technological innovation. Pernick and Wilder shine the spotlight on the winners among technologies, companies, and regions that are likely to reap the greatest benefits from clean tech—and they show you why the time to act is now.Groundbreaking and authoritative, The Clean Tech Revolution is the must-read book to understand and profit from the clean technologies that are reshaping our fast-changing world.",
        "Category": " Business & Economics , General",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Shooting in the Dark (Felony & Mayhem Mysteries)",
        "Authors": "By Hougan, Carolyn",
        "Description": "America is reeling from the Iran hostage crisis, which is threatening to topple the Carter presidency, and Claire Brooks is reeling from the collapse of her marriage. Frantic to escape the wreckage, she hops a plane to Amsterdam, which turns out to be packed with visitors, some noisily celebrating the new queen's coronation, and some quietly plotting a response to Iran. Claire couldn't find Iran on a map, but a reckless one-night stand with a reporter lands her in the thick of the intrigue, where even tulips can pack a threat. She's already learned she cannot trust her husband, and now she's stumbled into a world where everybody's loyalty is up for grabs.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Felony & Mayhem Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Successful Remodeling",
        "Authors": "By Ahlstrand, Alan (EDT)",
        "Description": "Explains how to plan remodeling jobs and offers do-it-yourself guidelines and tips for working with contractors",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Recipe Club: A Novel About Food and Friendship",
        "Authors": "By Israel, Andrea, Garfinkel, Nancy, and Clark, Melissa (COL)",
        "Description": "“A look at the difficulties of sustaining childhood bonds, it’s also a satisfying meditation on how nourishment for the body can replenish the soul.”—People A novel that combines the moving story of a friendship told in letters with more than 80 delicious recipes, The Recipe Club by Andrea Israel (Taking Tea) and Nancy Garfinkel (The Wine Lover’s Guide to Wine Country) is a wonderful literary banquet. A celebration of female bonding and excellent cooking—with scrumptious dishes developed by New York Times food columnist Melissa Clark—The Recipe Club will satisfy readers who previously devoured The Friday Night Knitting Club, The Guernsey Literary and Potato Peel Society, and The Sisterhood of the Traveling Pants.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Food & Wine 2009 Annual Cookbook",
        "Authors": "By Food & Wine (COR)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "American Express Publishing Corporation",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Complete Diabetic Cookbook: Healthy, Delicious Recipes the Whole Family Can Enjoy",
        "Authors": "By Finsand, Mary Jane, Cadwell, Karin, and White, Edith",
        "Description": "For the millions of Americans living with diabetes, the Complete Diabetic Cookbook offers 2,000 low-sugar, high-flavor recipes, including over 1,000 desserts, that everyone in the family will love.For a diabetic, dietary restrictions are a constant challenge. Author Mary Jane Finsand had been cooking two meals every night -- one for her family and one for a special meal for her diabetic husband -- when she decided there had to be a better solution. She began adapting her favorite recipes for a diabetic diet, and the result is this extraordinarily comprehensive cookbook of more than 2,000 recipes for every type of food imaginable.  The 2,000 recipes'which range from Hungarian Goulash to Cheese Lasagna to Chocolate Almond Tart and Butterscotch Brownies'are healthy, high in fiber, and low in cholesterol, as well as being easy to prepare. Every recipe is accompanied by the exchange list values from the American Diabetes Association and the American Dietetic Association, meticulously calculated to be accurate for the diabetic. Additional nutritional values are also included, such as calories, fat, carbohydrates, protein, sodium, and cholesterol. Perfect for the whole family!",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "9.3",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Recipe for Disaster",
        "Authors": "By Driscoll, Laura and Egan, Caroline LaVelle (ILT)",
        "Description": "What does a rat do when he is just not satisfied with eating garbage? He becomes a fine French chef, of course! Join Remy, the culinary rodent sensation, as he cooks his way into the hearts of readers in this actionpacked chapter book based on the Disney / Pixar film Ratatouille.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Nothin' But Net (Matt Christopher Sports Classics)",
        "Authors": "By Mantell, Paul and Christopher, Matt",
        "Description": "When thirteen-year-old Tim Daniels gets a chance to go to basketball camp, he is faced with trying to be accepted by the popular players and remaining true to his friend who has become the butt of practical jokes. Simultaneous.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Conure Handbook (Barron's Pet Handbooks)",
        "Authors": "By Watkins, Anne C.",
        "Description": "Conures, which belong to the parrot family, come in several species, and are available in many sizes and colors. This book advises on selecting, feeding, caging, health care, and understanding the conure's body and vocal language. Written by breeders, trainers, and veterinarians Barron's Pet Handbooks present expert advice on feeding, health care, housing, breeding, and all other important aspects of pet care. They are filled with vivid color photos and instructive line art.",
        "Category": " Pets , Birds",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Goddess",
        "Authors": "By Husain, Shahrukh",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life",
        "Price Starting With ($)": "8.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Jogging Aerobics and Diet",
        "Authors": "By Ald, Roy",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1968"
        }
    },
    {
        "Title": "Impressionist to Early Modern Paintings from The USSR",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Occidental Petroleum Corporation",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Ministry of the Word",
        "Authors": "By Browne, Robert Eric Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Augsburg Fortress Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "Favorite Poems for Children Coloring Book (Dover Classic Stories Coloring Book)",
        "Authors": "By Gaber, Susan",
        "Description": "Many first encounters with great poems could be made even more satisfying and memorable given the chance to add original color to the poetic event. Here is the chance — 17 classic poems by 11 distinguished poets, suggestively embellished for coloring by Susan Gaber. A total of 40 drawings complement poems by Christina Rossetti, Emily Dickinson, Lewis Carroll, Gelett Burgess, H. W. Longfellow, Edward Lear, Leigh Hunt, Eugene Field, Hughes Mearns, and two anonymous bards. Few children early exposed to them ever forget Who Has Seen the Wind or Wynken, Blynken and Nod; all can now gild and preserve their memories in almost any coloring medium, in this handsome, durable coloring book.",
        "Category": " Juvenile Fiction , Activity Books",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Snug Bug (Penguin Young Readers, Level 2)",
        "Authors": "By Dubowski, Cathy East and Dubowski, Mark (ILT)",
        "Description": "A young bug takes a buggy bath, collects his teddy bug, gets a buggy hug from Mama Bug, and snuggles into his tissue-box bed, but is startled by the appearance of a big moving creature that turns out to be a boy. Simultaneous.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Horrible Harry and the Drop of Doom",
        "Authors": "By Kline, Suzy and Remkiewicz, Frank (ILT)",
        "Description": "While at Song Lee's party to celebrate the last day of the second grade, Harry has apprehensions about going on the biggest ride at the amusement park, yet he is sure that if he doesn't do it, he will be teased by his classmate, Sidney, for the whole of his third grade year. Reprint.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Intermediate Algebra and Analytic Geometry Made Simple",
        "Authors": "By Gondin, William R., Ph.D. and Sohmer, Bernard",
        "Description": "",
        "Category": " Mathematics , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1959"
        }
    },
    {
        "Title": "Arches: The Story Behind the Scenery",
        "Authors": "By Johnson, David William",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "KC Publications, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Addition Wipe-Off Fun",
        "Authors": "By Watermill Press",
        "Description": "",
        "Category": "",
        "Publisher": "Watermill Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Three Complete Novels (Strangers / The Voice of the Night / The Mask)",
        "Authors": "By Koontz, Dean R.",
        "Description": "The author's early classic of adolescent evil, The Voice of the Night, unites with The Mask (appearing in hardcover for the first time) and Strangers for a hair-raising collection of thrillers.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "7.98",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Making of a Market Guru: Forbes Presents 25 Years of Ken Fisher",
        "Authors": "By Anderson, Aaron (EDT)",
        "Description": "Ken Fisher is founder and CEO of Fisher Investments, an independent money management firm managing over $35 billion (as of Dec. 31/09) for individuals and institutions. And, Fisher has written the monthly \"Portfolio Strategy\" column for Forbes magazine for the last twenty-five years—since 1984—making him, so far, the fourth longest-running columnist in the magazine’s history. During this time, he’s seen everything from the stock market crash of 1987 and the great bull markets of the 1980s and 1990s to the Tech bubble of 2000 and the global market meltdown of 2008.Now, with The Making of a Market Guru, you’ll gain an insightful look at Fisher’s prolific career over the years and discover the high-profile market calls he’s made so far in these monthly columns. At times engaging and timely, at others revealing and informative, this book is a sweeping look at a recent and eventful slice of stock market history. You’ll read about what’s changed, but you’ll be more amazed by what hasn’t. And you’ll see investing wisdom that still applies, now and for the foreseeable future, from a quarter-century of Fisher’s concise and witty market wisdom.Preceding Fisher’s columns for each year are a few pages of commentary—putting them in historic context, pointing out areas that are still salient, and others where Fisher’s perspective has changed over the years—highlighting key points that deserve extra attention.Chapter by chapter, this book offers practical investment advice from a leading market voice, while:Looking at Fisher’s market analysis over the years and providing an industry insider’s view of major, and not-so-major, market eventsExamining how Fisher called three of the last four bear marketsShowing that what many commonly think impacts markets doesn’t—and some very surprising things that do impact markets that few are aware of.And much moreThe more things change, the more they stay the same—at least when it comes to investing. And seeing history through the eyes of a market guru can help improve your overall investment endeavors today. If you take the time to read this unique, historic compilation, you’ll be taking your first steps to understanding how to become your own market guru.",
        "Category": " Business & Economics , Corporate & Business History",
        "Publisher": "Wiley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "The Complete Works of William Shakespeare. The Cambridge Edition Text, as edited by William Aldis Wright Including the Temple Notes. Illustrated by Rockwell Kent With a Preface by Christopher Morley.",
        "Authors": "By Shakespeare, William. (Rockwell Kent, Illustrator).n",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "19.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1937"
        }
    },
    {
        "Title": "My Christmas Treasury",
        "Authors": "By Peale, Norman Vincent",
        "Description": "",
        "Category": "",
        "Publisher": "Bbs Pub Corp",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Live Right! Beating Stress in College and Beyond",
        "Authors": "By Atkinson, Debra",
        "Description": "Live Right! gives students useful tips for coping with a variety of life’s challenges both during college and for the rest of their lives. Topics include sleep, managing finances, time management, coping with academic pressure, relationships, and a closer look at advertised products that promise to make our lives better. This booklet can be packaged at no additional charge with the main text.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Pearson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "28 Days to a Better Body: A Food and Fitness Plan for Health",
        "Authors": "By Thomson, Janet",
        "Description": "Provides a program on how to lose weight, tone your body, unlock the fat cells, and exercise for energy, and offers diet recipes",
        "Category": " Medical , General",
        "Publisher": "Peoples Medical Society",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "What Do You Do With a Tail Like This? (Caldecott Honor Book)",
        "Authors": "By Jenkins, Steve, Page, Robin",
        "Description": "",
        "Category": "",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "To the best of my ability: The presidency and the Constitution",
        "Authors": "By Donald L. Robinson",
        "Description": "Describes the constitutional foundations of the presidency, identifies common problems the President faces, and suggests constitutional reforms",
        "Category": "",
        "Publisher": "W.W. Norton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Monster Book of Question and Answers",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "Egmont Childrens Books",
        "Price Starting With ($)": "7.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Fun of It: Stories from The Talk of the Town (Modern Library (Paperback))",
        "Authors": "By Ross, Lillian (EDT)",
        "Description": "William Shawn once called The Talk of the Town the soul of the magazine. The section began in the first issue, in 1925. But it wasn't until a couple of years later, when E. B. White and James Thurber arrived, that the Talk of the Town story became what it is today: a precise piece of journalism that always gets the story and has a little fun along the way.The Fun of It is the first anthology of Talk pieces that spans the magazine's life. Edited by Lillian Ross, the longtime Talk reporter and New Yorker staff writer, the book brings together pieces by the section's most original writers. Only in a collection of Talk stories will you find E. B. White visiting a potter's field; James Thurber following Gertrude Stein at Brentano's; Geoffrey Hellman with Cole Porter at the Waldorf Towers; A. J. Liebling on a book tour with Albert Camus; Maeve Brennan ventriloquizing the long-winded lady; John Updike navigating the passageways of midtown; Calvin Trillin marching on Washington in 1963; Jacqueline Onassis chatting with Cornell Capa; Ian Frazier at the Monster Truck and Mud Bog Fall Nationals; John McPhee in virgin forest; Mark Singer with sixth-graders adopting Hudson River striped bass; Adam Gopnik in Flatbush visiting the ìgrandest theatre devoted exclusively to the movies; Hendrik Hertzberg pinning down a Sulzberger on how the Times got colorized; George Plimpton on the tennis court with Boris Yeltsin; and Lillian Ross reporting good little stories for more than forty-five years. They and dozens of other Talk contributors provide an entertaining tour of the most famous section of the most famous magazine in the world.",
        "Category": " Literary Criticism , Reference",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "5.6",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Driving Over Lemons",
        "Authors": "By Stewart, Chris",
        "Description": "",
        "Category": "",
        "Publisher": "Pantheon Books - Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "A Journey Through Grief: Gentle, Specific Help to Get You Through the Most Difficult Stages of Grieving",
        "Authors": "By Bozarth, Alla Renee",
        "Description": "For those of us working through the heartbreak of grief, author Bozarth offers wise and comforting advice.For those of us working through the heartbreak of grief, author Bozarth offers wise and comforting advice.",
        "Category": " Self-help , Death, Grief, Bereavement",
        "Publisher": "Hazelden Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "In Business with Mallory",
        "Authors": "By Pollak, Barbara (ILT) and Friedman, Laurie B.",
        "Description": "Mallory McDonald has her eye on the perfect purse, but it’s too expensive and Mallory’s mom is not buying! So Mallory comes up with the perfect plan to get the perfect purse. She’ll just start a business! Yet starting a business isn’t as easy as it seems. Mallory finally earns enough to buy what she wants. But if her business is such as success, why does Mallory feel like such a failure?",
        "Category": " Juvenile Fiction , Business, Careers, Occupations",
        "Publisher": "Darby Creek ™",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Pastoral Counseling",
        "Authors": "By Oates, Wayne E.",
        "Description": "",
        "Category": "",
        "Publisher": "Westminster Press",
        "Price Starting With ($)": "41.75",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Heart to Heart with Mallory",
        "Authors": "By Pollak, Barbara (ILT) and Friedman, Laurie B.",
        "Description": "Valentine's Day is approaching and everyone seems to be crazed with love—except for Mallory. She's been invited to a Valentine's party next door and rumor has it that her next-door neighbor's dad is going to propose to her best friend's mom. What will it mean if her two best friends become brother and sister? Where will she fit in? And to make matters even more confusing, Mallory is receiving presents from a secret admirer. Who could it be? Mallory feels like everything is changing and she has lots of questions about life, love, and friendship. Since her two best friends are preoccupied, Mallory turns to her diary to find the answers.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Darby Creek ™",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Mallory on Board",
        "Authors": "By Pollak, Barbara (ILT) and Friedman, Laurie B.",
        "Description": "Bon Voyage! Mallory and her family and friends are setting sail on a cruise. But poor Mallory feels like she's sunk and she hasn't even set sail yet. Her two best friends' parents are getting married and even though Mallory is trying her best to be happy for Mary Ann and Joey, she can't help feeling left out. Can Mallory find a way to be happy for her friends and not feel like a third wheel?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Darby Creek ™",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Chrissa Stands Strong (American Girl Today)",
        "Authors": "By Jones, Richard (ILT), Casanova, Mary, and England, Tamara (EDT)",
        "Description": "As Chrissa and her friends practice so they can try out for the swim team in the fall, someone starts sending them mean text messages and emails, and then Chrissa's brother Tyler has a terrible accident.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "American Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Amazon Outfitters New Testament ABC Edition NIV",
        "Authors": "By God and Jesus",
        "Description": "",
        "Category": "",
        "Publisher": "Publisher Unknown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Bravo, Mia! (American Girl)",
        "Authors": "By Yep, Laurence",
        "Description": "Mia St. Clair can't wait for Regionals. Or can she? Mia has been training all year to master the moves she needs to compete at the Regional Figure Skating Competition. It's her first time competing at that level, and Mia is eager for and worried about Regionals all at the same time. Is she a good enough skater? Does she have what it takes to survive in the world of competitive figure skating--and still be a good sport? When a family crisis threatens Mia's chances of going to Regionals, Mia is heartbroken. But she knows that being a good sport means accepting challenges--even big losses--with determination and grace.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "American Girl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Meet Rebecca (American Girl Collection)",
        "Authors": "By Hunt, Robert (ILT), Greene, Jacqueline Dembar, and McAliley, Susan (CON)",
        "Description": "In 1914 New York City, nine-year-old Rebecca is determined to show her family that she is old enough to light the Shabbos candles and go to the movies.",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "American Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The Quickening: A Novel",
        "Authors": "By Hoover, Michelle",
        "Description": "A July 2010 Indie Next PickEnidina Current and Mary Morrow live on neighboring farms in the flat, hard country of the upper Midwest during the early 1900s. This hardscrabble life comes easily to some, like Eddie, who has never wanted more than the land she works and the animals she raises on it with her husband, Frank. But for the deeply religious Mary, farming is an awkward living and at odds with her more cosmopolitan inclinations. Still, Mary creates a clean and orderly home life for her stormy husband, Jack, and her sons, while she adapts to the isolation of a rural town through the inspiration of a local preacher. She is the first to befriend Eddie in a relationship that will prove as rugged as the ground they walk on.  Despite having little in common, Eddie and Mary need one another for survival and companionship. But as the Great Depression threatens, the delicate balance of their reliance on one another tips, pitting neighbor against neighbor, exposing the dark secrets they hide from one another, and triggering a series of disquieting events that threaten to unravel not only their friendship but their families as well.   In this luminous and unforgettable debut, Michelle Hoover explores the polarization of the human soul in times of hardship and the instinctual drive for self-preservation by whatever means necessary. The Quickening stands as a novel of lyrical precision and historical consequence, reflecting the resilience and sacrifices required even now in our modern troubled times.For information, tour dates, and reading group resources, visit www.michellehoover.net.",
        "Category": " Fiction , Literary",
        "Publisher": "Other Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "The Crazy Makers: How the Food Industry Is Destroying Our Brains and Harming Our Children",
        "Authors": "By Simontacchi, Carol",
        "Description": "A nutritionist reveals how brand-name food producers may be putting items on the market that redefine what we commonly think of as \"food,\" from infant formulas to \"health-conscious\" packaged meals, that may be causing chemical levels in the brain to rise to alarming heights.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Cholesterol Control 3-Week Plan Handbook and Cookbook",
        "Authors": "By Krimmel, Edward A. and Krimmel, Patricia T.",
        "Description": "The first section of this guide discusses every aspect of lipids (fats) and how to control blood cholesterol levels. A simple three-week plan offers strategies for initial cholesterol control, along with suggestions for food shopping, meal planning, and food preparation. The second half puts that discussion into practice with delicious, easily prepared low-fat recipes. This updated and expanded guide to understanding and reducing cholesterol also includes a new chapter on the cholesterol concerns of children and adolescents and 33 black-and-white illustrations and charts.",
        "Category": " Health & Fitness , Food Content Guides",
        "Publisher": "Franklin Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Countdown to Christmas (Through the Magic Window)",
        "Authors": "By Boddy, Joe",
        "Description": "",
        "Category": "",
        "Publisher": "THE UNICORN PUBLISHING HOUSE, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Richard III",
        "Authors": "By Shakespeare, William",
        "Description": "The acclaimed Pelican Shakespeare series edition of Richard III edited by A. R. Braunmuller and Stephen Orgel. Coming to PBS in a Great Performances production starring Benedict Cumberbatch and Dame Judi Dench in December 2016.    The legendary Pelican Shakespeare series features authoritative and meticulously researched texts paired with scholarship by renowned Shakespeareans. Each book includes an essay on the theatrical world of Shakespeare’s time, an introduction to the individual play, and a detailed note on the text used. Updated by general editors Stephen Orgel and A. R. Braunmuller, these easy-to-read editions incorporate over thirty years of Shakespeare scholarship undertaken since the original series, edited by Alfred Harbage, appeared between 1956 and 1967. With definitive texts and illuminating essays, the Pelican Shakespeare will remain a valued resource for students, teachers, and theater professionals for many years to come.   For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "An Act of Congress",
        "Authors": "By Eidenberg, Eugene. Morey, Roy D.,",
        "Description": "",
        "Category": "",
        "Publisher": "Norton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "A Spirituality Named Compassion: And the Healing of the Global Village, Humpty Dumpty and Us",
        "Authors": "By Fox, Matthew",
        "Description": "Fox unites mystical awareness with social justice to establish a spirituality of compassion as the framework for an ecofeminisim that promises personal, social, and global healing.",
        "Category": " Religion , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Minnesota Moonlight (Romancing America)",
        "Authors": "By Melby, Becky and Wienke, Cathy",
        "Description": "How will three modern Minnesota women cope when asked to concede their doubts and learn to trust? Is love strong enough for Sydney to forgive the past of an ex-con? Can the man April blames for her sister’s death help her fulfill a dream list? When Sara’s ex-husband returns with lofty promises, will she open her heart? Find out in this three-book collection by an acclaimed author team.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Beyond This Place",
        "Authors": "By Cronin, A. J.",
        "Description": "Paul Mathry struggles to free his father from Stoneheath where he has been unjustly imprisoned for a murder he did not commit",
        "Category": " Fiction , Legal",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Healthy for Life: Developing Healthy Lifestyles That Have a Side Effect of Permanent Fat Loss",
        "Authors": "By Strand, Ray D. and Wallace, Donna K.",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Real Life Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Power of Mindful Learning",
        "Authors": "By Langer, Ellen J.",
        "Description": "Radical in its implications, this original and important work may change forever the views we hold about the nature of learning. In The Power of Mindful Learning, Ellen Langer uses her innovative theory of mindulness, introduced in her influential earlier book, to dramatically enhance the way we learn. In business, sports, laboratories, or at home, our learning is hobbled by certain antiquated and pervasive misconceptions. In this pithy, liberating, and delightful book she gives us a fresh, new view of learning in the broadest sense. Such familiar notions as delayed gratification, ”the basics”, or even ”right answers”, are all incapacitating myths which Langer explodes one by one. She replaces them with her concept of mindful or conditional learning which she demonstrates, with fascinating examples from her research, to be extraordinarily effective. Mindful learning takes place with an awareness of context and of the ever-changing nature of information. Learning without this awareness, as Langer shows convincingly, has severely limited uses and often sets on up for failure.With stunning applications to skills as diverse as paying attention, CPR, investment analysis, psychotherapy, or playing a musical instrument, The Power of Mindful Learning is for all who are curious and intellectually adventurous.",
        "Category": " Psychology , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Black Hills Blessing (Romancing America: South Dakota)",
        "Authors": "By Connealy, Mary",
        "Description": "Enter the world of compelling, contemporary romance with award-winning author Mary Connealy’s spellbinding three-in-one collection. Ride the range with Buffy Lange, a woman bent on seeing majestic buffalo reclaim their territory, no matter how hostile local cattleman Wyatt Shaw becomes. Meet rancher Emily Johannson who would leave her derelict neighbor Jake Hanson alone if she didn’t feel duty bound to keep saving his hide. Take a stand with Jeanie Davidson, a single-again woman who’s finally gotten her life together, only to have her ex-husband Michael walk right back in, determined to make amends. Can love redeem these hearts and lives?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Two-Minute Drill (Comeback Kids)",
        "Authors": "By Lupica, Mike",
        "Description": "From #1 New York Times bestseller Mike Lupica!Chris Conlan is the coolest kid in sixth grade?the golden-armed quarterback of the football team and the boy all the others look up to. Scott Parry is the new kid, the boy with the huge brain, but with feet that trip over themselves. These two boys may seem like an odd couple, but each has a secret that draws them together, and proves that the will to succeed is even more important than raw talent.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Henry V (Barnes & Noble Shakespeare)",
        "Authors": "By Shakespeare, William and Robinson, Benedict S. (EDT)",
        "Description": "Henry V, by William Shakespeare, is part of the Barnes & Noble Shakespeare series.  This unique series features newly edited texts prepared by leading scholars from America and Great Britain, in collaboration with one of the world’s foremost Shakespeare authorities, David Scott Kastan of Columbia University. Together they have produced texts as faithful as possible to those that Shakespeare wrote. Each volume in the Barnes & Noble Shakespeare includes:New Scholarship – Premiere scholars introduce each play with contemporary scholarship. An essay on editing the text provides an in-depth look at the quartos and folios used in the edition. Contextualizing Essays – Essays on Shakespeare’s England, language, and life, along with essays on performing Shakespeare and significant performances frame the play in both historical and theatrical context for readers. A look at the lasting influence of the play on music, art, film, and dance creates an interdisciplinary framework with which to approach the play. Better Notes – Through one-word margin definitions, facing-page glosses, and longer end notes after the play, our innovative approach to notes pulls readers away from the text fewer times while providing them with more information and comprehensive analysis. Further Reading – An annotated bibliography of titles, hand-selected by the introduction author, takes readers beyond the edition for further reading.The story of England's greatest warrior king, Henry V offers a compelling demonstration of the moral costs of heroic action. The editor Ben Robinson, clarifies a host of contemporary terms and references in the play, offering a dramatically clearer version of the play than has been seen before.",
        "Category": " Literary Collections , General",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Waking Up In Time: Finding Inner Peace In Times of Accelerating Change",
        "Authors": "By Russell, Peter",
        "Description": "In this tenth anniversary, new edition of an award-winning, bestselling classic, Russell updates his brilliant manifesto for awakening to the mounting planetary crisis while deepening our connection to inner peace and transformation. Amid visions of doom in the wake of ecological catastrophe, this book by renowned visionary scientist Peter Russell stands out for its sanity, hopefulness, and relevance.",
        "Category": " Body, Mind & Spirit , Spiritualism",
        "Publisher": "Origin Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Frommer's Puerto Rico (Frommer's Complete Guides)",
        "Authors": "By Marino, John",
        "Description": "America's #1 bestselling travel seriesWritten by more than 175 outspoken travelers around the globe, Frommer’s Complete Guides help travelers experience places the way locals do.More annually updated guides than any other series16-page color section and foldout map in all annual guidesOutspoken opinions, exact prices, and suggested itinerariesDozens of detailed maps in an easy-to-read, two-color designMuch more detailed and complete than its major competitors, Frommer's Puerto Rico, 9th Edition gives you in-depth, honest reviews of lavish honeymoon resorts, intimate inns, family-friendly condos, and dirt cheap hostels. Written by a travel writer and city news reporter based in San Juan, this edition has its finger on the pulse of the island, with updates on the latest openings and selections in every price category. We'll point you to a gorgeous white-sand beach that only locals know about, give you the scoop on both upscale dining and roadside nosh pits, and we list the best places for snorkeling, hiking, golf, sailing, deep-sea fishing -- even the best town to see a cockfight.You'll also get a complete shopper's guide, and up-to-date coverage of the newest nightlife in the region, from casinos to salsa clubs to lowkey beach bars. Look for tips on finding the best package deals, plus a color fold-out map.",
        "Category": " Travel , Caribbean & West Indies",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Christmas Love at Lake Tahoe: No Thank You/The Christmas Miracle/Shelter in Seattle/Dating Unaware (Romancing America: Nevada)",
        "Authors": "By Odell, Jeri, Dooley, Lena Nelson, Cash, Jeanie Smith, and Kincaid, Jean",
        "Description": "Reserve time for romance in this inspirational Christmas collection where four college grads major in love at a Lake Tahoe lodge. After meeting a handsome paramedic, registered nurse Bethany Stillman discovers there are some wounds only God can heal. A cautious Scarlett McKaye is reluctant to risk her heart to a handsome daredevil who won’t take no for an answer. Stephanie St. John is determined to spurn the advances of a manipulative businessman. Michaela Christiansen’s resolve for a male-free existence is threatened by a widowed forest ranger. Will love lodge in the hearts of these career-minded women?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "America in Vietnam: A Documentary",
        "Authors": "By LaFeber, Walter, Gardner, Lloyd, Williams, William Appleman (EDT), and Appleman",
        "Description": "Draws together diverse original sources on American involvement in Vietnam, including the private papers of presidents and other government and military officials, public speeches, debates, and articles",
        "Category": " History , Military , Vietnam War",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "Napoleon and the Awakening of Europe",
        "Authors": "By Markham, Felix M.",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Paradise Valley (The Daughters of Caleb Bender)",
        "Authors": "By Cramer, W. Dale",
        "Description": "An Amish settlement in Ohio has run afoul of a law requiring their children to attend public school. Caleb Bender and his neighbors are arrested for neglect, with the state ordering the children be placed in an institution. Among them are Caleb's teenage daughter, Rachel, and the boy she has her eye on, Jake Weaver. Romance blooms between the two when Rachel helps Jake escape the children's home. Searching for a place to relocate his family where no such laws apply, Caleb learns there's inexpensive land for sale in Mexico, a place called Paradise Valley. Despite rumors of instability in the wake of the Mexican revolution, the Amish community decides this is their answer. And since it was Caleb's idea, he and his family will be the pioneers. They will send for the others once he's established a foothold and assessed the situation.Caleb's daughters are thrown into turmoil. Rachel doesn't want to leave Jake. Her sister, Emma, who has been courting Levi Mullet, fears her dreams of marriage will be dashed. Miriam has never had a beau and is acutely aware there will be no prospects in Mexico.Once there, they meet Domingo, a young man and guide who takes a liking to Miriam, something her father would never approve. While Paradise Valley is everything they'd hoped it would be, it isn't long before the bandits start giving them trouble, threatening to upset the fledgling Amish settlement, even putting their lives in danger. Thankfully no one has been harmed so far, anyway.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Anne Hooper's Great Sex Guide",
        "Authors": "By Hooper, Anne",
        "Description": "Tasteful full-color photography combines with authoritative advice in a complete guide to human sexuality, which draws on both Eastern and Western traditions and encompasses exercises, meditations, and activities that emphasize the mental and spiritual dimensions of sex, rather than just the physical.",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Spring's Renewal: Seasons of Sugarcreek, Book Two (Seasons of Sugarcreek, 2)",
        "Authors": "By Gray, Shelley Shepard",
        "Description": "Shelley Shepard Gray, the beloved author of the Sisters of the Heart series (Hidden, Wanted, and Forgiven) returns with the second novel in her Seasons at Sugarcreek series, Spring’s Renewal. A moving tale of love and faith set among the Amish community, it tells a story of courage and sacrifice that fans of Beverly Lewis, Wanda Brunstetter, and Cindy Woodsmall will take deeply into their hearts.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "To Thine Own Self Be True",
        "Authors": "By Clemens, Judy",
        "Description": "Stella Crown rarely takes a break from managing her Pennsylvania dairy farm unless it's to take a spin on her Harley, but in the midst of the Christmas season she treats herself to a new tattoo. Halfway through the sitting at Wolf Ink, her tattoo artist and his wife, Mandy, disappear into the back room. Stella, whipped, dozes off and, when she awakes and they've not come back, she drives home. Before long, the police arrive to inform her that Mandy has been discovered dead behind the tattoo parlor, while Wolf is nowhere to be found.Angry and guilt-stricken that she hasn't protected her friends, Stella--something of a suspect herself--sets out to assist the cops and rescue the missing Wolf. And to ask, where is their young son, also missing?With the help of another tattoo artist and an old flame who's arrived at the farm, Stella dives into the world of tattooing, where she finds not only a close-knit and knowledgeable community, but also an underworld of back alley hacks, stolen designs, and violent patrons, plus some looming and controversial state legislation.Stella, stymied by more suspects than answers, is dragged yet again into a realm full of greed and danger when all she wants is to be left alone to run her farm and figure out the rest of her life. But first she must do everything in her power to get Wolf back where he belongs.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Poisoned Pen Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "A Gift of Grace: A Novel (Kauffman Amish Bakery Series)",
        "Authors": "By Clipston, Amy",
        "Description": "Take a trip to Bird-in-Hand, Pennsylvania, where you’ll meet the women of the Kauffman Amish Bakery in Lancaster County. As each woman’s story unfolds, you will share in her heartaches, trials, joys, dreams … and secrets. You’ll discover how the simplicity of the Amish lifestyle can clash with the “English” way of life—and the decisions and consequences that follow. Most importantly, you will be encouraged by the hope and faith of these women, and the importance they place on their families. Rebecca Kauffman’s tranquil Old Order Amish life is transformed when she suddenly has custody of her two teenage nieces after her \"English\" sister and brother-in-law are killed in an automobile accident. Instant motherhood, after years of unsuccessful attempts to conceive a child of her own, is both a joy and a heartache. Rebecca struggles to give the teenage girls the guidance they need as well as fulfill her duties to Daniel as an Amish wife. Rebellious Jessica is resistant to Amish ways and constantly in trouble with the community. Younger sister Lindsay is caught in the middle, and the strain between Rebecca and Daniel mounts as Jessica’s rebellion escalates. Instead of the beautiful family life she dreamed of creating for her nieces, Rebecca feels as if her world is being torn apart by two different cultures, leaving her to question her place in the Amish community, her marriage, and her faith in God.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Random House Webster's Build Your Power Vocabulary (Random House Newer Words Faster)",
        "Authors": "By Random House",
        "Description": "An innovative guide that shows how words work and how to make them work for you!Read, write, and speak more clearly and confidently with this compact, concise, all-in-one vocabulary-building guide.  In school and in business, in public speaking and in private conversation, knowing just the right words to use can make a world of difference.  Now, here's a book that puts a world of word power right at your fingertips.  It includes: Chapters on word roots, the history of interesting words, and up-to-date vocabulary  A thorough pronunciation guide with an extensive list of words that are often mispronounced Sections on spelling and on the differences between American and British English Information on how to use prefixes and suffixes to dramatically increase your vocabulary An invaluable glossary of usage to ensure that you choose the right words and put them in their proper place Plus, numerous vocabulary tests and exercises, as well as a section of entertaining word puzzles",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Wall of Fire (The Appomattox Saga, Book 7)",
        "Authors": "By Morris, Gilbert",
        "Description": "As Mark Rocklin lies dying, his one hope is to be reunited with his estranged daughter, Allyn.",
        "Category": " Fiction , Christian , Historical",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Bethlehem Road Murder: A Michael Ohayon Mystery (Michael Ohayon Series, 5)",
        "Authors": "By Gur, Batya and Eden, Vivian (TRN)",
        "Description": "The body of a young Yemeni woman is discovered in the attic of a Bethlehem Road house, in a Jerusalem neighborhood famous for its impenetrability to outsiders. The victim, once a beauty, is no longer lovely -- her face has been brutally smashed.More than the usual horror greets Chief Superintendent Michael Ohayon in the closed and inscrutable Baka, for an old love and an unfinished romance await him there as well. But much more is concealed beneath the surface of this gruesome homicide -- as tensions between Ashkenazim and Mizrahim, hostility between Arabs and Jews, the half-century-old business of kidnapped Yemenite children, and the al Aqsa Intifada of 2000 add fuel to a terrible fire that might never be contained.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2020"
        }
    },
    {
        "Title": "How to Make Love with your Clothes On - Wife",
        "Authors": "By Frahm, David J. and Frahm, Anne",
        "Description": "Little things mean the world to women--but if you can't think of anything beyond chocolates, roses and candlelight dinners, you're in big trouble! At last, help is at hand! Here are a hundred and one exciting new ideas guaranteed to melt her heart, put the sparkle back into her eyes, and--yes--sweep her off her feet! Keep this lifetime supply of romantic hints and marriage-sparking advice at hand and you'll keep your love as hot (or hotter!) than it was way back at your first kiss",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Games Girls Play",
        "Authors": "By Smith, Shelley and Silby, Caroline, Ph.D.",
        "Description": "A Reviving Ophelia for soccer moms: Games Girls Play gives parents advice for encouraging their daughters to participate in sports and making sure their experiences as athletes are empowering.  Sports psychologist and former nationally ranked figure skater Caroline Silby teaches parents how to find the right sport for their young daughters and helps them tackle hurdles that affect older atletes.  Using real-life examples, Silby prepares parents for the obstacles that female athletes face and offers solutions for handling everything from the stresses of competition, to motivation problems, to self-esteem issues, to difficult coaches, to eating disorders, to sexual harassment.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "A Love to Last Forever",
        "Authors": "By Peterson, Tracie",
        "Description": "All Beth Gallatin has really wanted out of life is to settle down in one town, with one man, and raise a family. But with her father's roaming ways, she's always been denied that dream; instead, she found solace in reading romantic books. With her father's passing, she can, for the first time, dare to claim the rugged Montana frontier as her home. Nick Lassiter has loved Beth since she first came to town, but she's always seemed to think of him more as a brother. Just when he finally gets Beth to consider him, however, a challenger threatens the affection growing between them. But neither Nick nor Beth is prepared when they must face the consequences of Nick's complicated past. As a past fraught with unwise choices and guilt invades their world, can Nick and Beth find a love that will last forever?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Frommer's Irreverent Guide to Washington, D.C. (Irreverent Guides)",
        "Authors": "By Bourbeau, Heather and Eiss, Camille",
        "Description": "Looking for a travel guide that goes where other guides fear to tread? One that rides roughshod over ad-copy puffery to smartly deliver the real scoop on a destination's sites and attractions? One that dares to be honest, hip, and fun? Look no more. Frommer's Irreverent Travel Guides are wickedly irreverent, unabashedly honest, and downright hilarious, and provide an insider's perspective on which attractions are overrated tourist traps and which are the secret gems that locals love. You'll get the lowdown on restaurants, lodging, and shopping, and even find out what the locals think of you. \"Like being taken around by a savvy local,\" said the New York Times. \"Hipper and savvier than other guides,\" concurred Diversion magazine. Never shy about confronting the issues, the Irreverents are guides to real travel in the real world.The nation's capital is laid bare in Frommer's Irreverent Guide to Washington, D.C. Find out where the power elite meet for drinks, what the president is up to that day, which tours are overrated (the White House, because of what you don't see) and which are world-class powerful (the U.S. Holocaust Memorial Museum). Discover the city's great multinational eateries and the best spots for a rollicking Sunday brunch. Learn that D.C. is as much a college town as it is a political town--and has the passion for local sports teams to prove it. Frommer's Irreverent Guide to Washington, D.C. delivers all the insights and invaluable travel tips you'll need to enjoy your trip to the capital, a city that's as comfortable in its small-town gentility as its urban irascibility.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Who's Who in the Ancient World: A Handbook to the Survivors of the Greek and Roman Classics (Reference)",
        "Authors": "By Radice, Betty",
        "Description": "Literature, films, drama, opera, painting, psychology, even terms in our everyday language (such as thespian, odyssey, narcissism, nemesis and xenophobia) frequently refer back to the myths, legends and historical figures of ancient Greece and Rome. Whatever our interest in modern culture, we can greatly enrich our enjoyment by getting to know the personalities and characters of the classical world. Covering everyone from Achilles to Zeus, this is an invaluable, stimulating guide for anyone who wishes to enhance their classical literacy, and one which brings the people of the ancient world to life.",
        "Category": " Political Science , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1973"
        }
    },
    {
        "Title": "My Spiritual Alphabet Book",
        "Authors": "By Bea, Holly and Howard, Kim (ILT)",
        "Description": "Four youngsters lead the way in a lively, colorful romp through the letters of the alphabet. Lighthearted rhyming verse and joyful illustrations combine to teach children the alphabet and introduce them to their spiritual world. With an emphasis on positive interaction with all creatures and the natural environment, this book will invite discussion and inspire the imaginations of children of all faiths.",
        "Category": " Juvenile Nonfiction , Religion , Christianity",
        "Publisher": "HJ Kramer",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Greatest Christmas Ever: A Treasury of Inspirational Ideas and Insights for an Unforgettable Christmas",
        "Authors": "By Honor Books",
        "Description": "",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Calories and Carbohydrates",
        "Authors": "By Barbara Kraus",
        "Description": "",
        "Category": "",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "March",
            "Year": "1973"
        }
    },
    {
        "Title": "Free Yourself from Depression",
        "Authors": "By Yapko, Michael D.",
        "Description": "Tells how to get rid of guilt and blame, think more positively, improve self-esteem, aleviate worry, be more assertive, and avoid feeling helpless",
        "Category": " Health & Fitness , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Murder Never Forgets",
        "Authors": "By O'Hehir, Diana",
        "Description": "Green Beach Manor, set on the jagged cliffs of the California coast, calls itself \"A Colony for Independently Functioning Adults.\" It costs a pretty penny - and Carla Day is confident that her affectionate-but-confused elderly father is getting the best care there. Formerly an accomplished Egyptologist, he now lives in a fusion of past and present. The staff hasn't a clue what he's ranting about - and they're ready to send him to what they privately call No Hope House.Then a string of suspicious events unravels. A fire starts inexplicably in the beauty parlor, and some drugs go missing. Carla, hoping to keep a close eye on her dad, lands a job as an aide at the Manor. But management has one condition: Spy for us, figure out who's doing this - and you and your father can stay...Soon, a guest swallows glass hidden in her food. An employee dies an eerie death. And Carla's father begins rambling not only about Egyptian pyramids, but also about a dead woman on the nearby beach. The answer may lie an ancient Egyptian tomb. Or maybe it's somewhere further - in the deep recesses of a brilliant old man's memory.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Contrarian Investing",
        "Authors": "By Gallea, Anthony M. and Patalon, William",
        "Description": "Explains how independent thinking can lead to potential profits in the market, including advice on the best percentage of a portfolio to place in each stock, the single best buy signal, and rules for knowing when to sell",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Prentice Hall Pr",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Holy Spirit: Activating God's Power in Your Life [Paperback]",
        "Authors": "By Billy Graham",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Law Among Nations an Introduction to Public International Law Second Edition",
        "Authors": "By Glahn, Gerhard von",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Disney's Pooh Says Boo!",
        "Authors": "By Parent, Nancy",
        "Description": "In a lift-the-flap board book with one flap per spread, Pooh and his friends from the Hundred-Acre Wood get ready to trick or treat on Halloween, but Piglet is too scared to join them.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Mouse Works",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Winterthur's Culinary Collection",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Francis du Pont Winterthur Museum",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Annual Review of Behavior Therapy Theory & Practice",
        "Authors": "By Cyril M. and Wilson, G. Terence Franks",
        "Description": "",
        "Category": "",
        "Publisher": "Brunner/Mazel Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Empress",
        "Authors": "By Hunter, Adriana (TRN) and Sa, Shan",
        "Description": "Such is the voice of Shan Sa's unforgettable heroine in her latest literary masterpiece, Empress. Empress Wu, one of China's most controversial figures, was its first and only female emperor, who emerged in the seventh century during the great Tang Dynasty and ushered in a golden age. Throughout history, her name has been defamed and her story distorted by those taking vengeance on a woman who dared to become emperor. But now, for the first time in thirteen centuries, Empress Wu (or Heavenlight, as we come to know her) flings open the gates of the Forbidden City and tells her own astonishing tale—revealing a fascinating, complex figure who in many ways remains modern to this day.Writing with epic assurance, poetry, and vivid historic detail, Shan Sa plumbs the psychological and philosophical depths of what it means to be a striving mortal in a tumultuous, power-hungry world. Empress is a great literary feat and a revelation for the ages.",
        "Category": " Fiction , Literary",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Presidential Pets",
        "Authors": "By Driscoll, Laura and Slade, Christian (ILT)",
        "Description": "Many of our presidents have had extraordinary pets including an alligator, tiger cubs, elephants, bald eagles, a hippo, a bear, a zebra, and a coyote. This easy reader, with photos and illustrations, will have stories about many of these animals - including the Obama's dog, which according to a recent interview with Michelle Obama, will likely be a rescued Portuguese Water Dog.",
        "Category": " Juvenile Nonfiction , Animals , Pets",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    }
]