[
    {
        "Title": "Famous Mugs: Arresting Photos and Felonious Facts for Hundreds of Stars Behind Bars",
        "Authors": "By Cader Books",
        "Description": "Presents details--including original mug shots, arrest reports, and other documentation--about hundreds of celebrity felons and miscreants, from Kelsey Grammer and Leona Helmsley to Sophia Loren and David Letterman. Original. 50,000 first printing.",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Brass Verdict",
        "Authors": "By Connelly, Michael",
        "Description": "Things are finally looking up for defense attorney Mickey Haller. After two years of wrong turns, Haller is back in the courtroom. When Hollywood lawyer Jerry Vincent is murdered, Haller inherits his biggest case yet: the defense of Walter Elliott, a prominent studio executive accused of murdering his wife and her lover. But as Haller prepares for the case that could launch him into the big time, he learns that Vincent's killer may be coming for him next.Enter Harry Bosch. Determined to find Vincent's killer, he is not opposed to using Haller as bait. But as danger mounts and the stakes rise, these two loners realize their only choice is to work together.Bringing together Michael Connelly's two most popular characters, The Brass Verdict is sure to be his biggest book yet.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "501 Golf Jokes",
        "Authors": "By FRANKLIN [ED.] DOHANYOS",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Hershey's 1934 Cookbook",
        "Authors": "By Author Not Indicated",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Publishing",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "A Guide for the Advanced Soul: A Book of Insight",
        "Authors": "By Hayward, Susan",
        "Description": "A Guide for the Advanced Soul is a book of insight to consulted in times of indecision and crises to help you understand your questions, and give guidance. Hold a problem in your mind...open this book to any page and there will be your answer.",
        "Category": " Religion , Inspirational",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Are You There, Vodka? It's Me, Chelsea",
        "Authors": "By Handler, Chelsea",
        "Description": "THE EAGERLY AWAITED COLLECTION OF PERSONAL ESSAYS FROM THE BESTSELLING AUTHOR OF MY HORIZONTAL LIFEWhen Chelsea Handler needs to get a few things off her chest, she appeals to a higher power -- vodka. You would too if you found out that your boyfriend was having an affair with a Peekapoo or if you had to pretend to be honeymooning with your father in order to upgrade to first class. Welcome to Chelsea's world -- a place where absurdity reigns supreme and a quick wit is the best line of defense. In this hilarious, deliciously skewed collection, Chelsea mines her past for stories about her family, relationships, and career that are at once singular and ridiculous. Whether she's convincing her third-grade class that she has been tapped to play Goldie Hawn's daughter in the sequel to Private Benjamin, deciding to be more egalitarian by dating a redhead, or looking out for a foulmouthed, rum-swilling little person who looks just like her...only smaller, Chelsea has a knack for getting herself into the most outrageous situations. Are You There, Vodka? It's Me, Chelsea showcases the candor and irresistible turns of phrase that have made her one of the freshest voices in comedy today.",
        "Category": " Humor , Topic , Men, Women & Relationships",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Kid's Question & Answer Book (Discovery Toys Book)",
        "Authors": "By Owl Magazine editors",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Scarpetta",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "Leaving behind her private forensic pathology practice in Charleston, South Carolina, Kay Scarpetta accepts an assignment in New York City, where the NYPD has asked her to examine an injured man on Bellevue Hospital's psychiatric prison ward. The handcuffed and chained patient, Oscar Bane, has specifically asked for her, and when she literally has her gloved hands on him, he begins to talk - and the story he has to tell turns out to be one of the most bizarre she has ever heard.The injuries, he says, were sustained in the course of a murder...that he did not commit. Is Bane a criminally insane stalker who has fixed on Scarpetta? Or is his paranoid tale true, and it is he who is being spied on, followed and stalked by the actual killer? The one thing Scarpetta knows for certain is that a woman has been tortured and murdered - and more violent deaths will follow. Gradually, an inexplicable and horrifying truth emerges: Whoever is committing the crimes knows where his prey is at all times. Is it a person, a government? And what is the connection between the victims?In the days that follow, Scarpetta; her forensic psychologist husband, Benton Wesley; and her niece, Lucy, who has recently formed her own forensic computer investigation firm in New York, will undertake a harrowing chase through cyberspace and the all-too-real streets of the city - an odyssey that will take them at once to places they never knew, and much, much too close to home.Throughout, Cornwell delivers shocking twists and turns, and the kind of cutting-edge technology that only she can provide. Once again, she proves her exceptional ability to entertain and enthrall.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "20.98",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Cancer Survival Cookbook: 200 Quick & Easy Recipes with the Nutrients You Need",
        "Authors": "By Weihofen, Donna L. and Marino, Christina",
        "Description": "Presents recipes using fruits, vegetables, protein foods, and soy products created to help cancer patients fight the disease",
        "Category": " Health & Fitness , Nutrition",
        "Publisher": "Chronimed Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Treating and Preventing Adolescent Mental Health Disorders: What We Know and What We Don't Know: A Research Agenda for Improving the Mental Health of Our Youth",
        "Authors": "By Evans, Dwight L. (EDT), Foa, Edna B. (EDT), Gur, Raquel E. (EDT), Hendin, Herbert (EDT), O'Brien, Charles P. (EDT), Seligman, Martin E. P. (EDT), and Walsh, B. Timothy (EDT)",
        "Description": "Following on the heels of the widely acclaimed A Guide to Treatments That Work (OUP, 2002) by Nathan and Gorman, Treating and Preventing Adolescent Mental Health Disorders brings together a distinguished group of psychiatrists and clinical psychologists to provide a groundbreaking, evidence-based survey of treatments and preventions for adolescents with mental health disorders.The book, the very first to disseminate the findings of the Adolescent Mental Health Initiative sponsored by the Annenberg Foundation Trust at Sunnylands and the Annenberg Public Policy Center (APPC) of the University of Pennsylvania, addresses the current state of our knowledge about various mental health disorders in the teenage years, a developmental period when behavior and the brain are still \"plastic.\" Here, six commissions established by the Sunnylands Trust and APPC pool their expertise on adolescent anxiety, schizophrenia, substance use disorders, depression and bipolar disorders, eating disorders, and suicide in sections that thoroughly define each disorder, outline and assess available treatments, discuss prevention strategies, and suggest a research agenda based on what we know and don't yet know about these various conditions. As a meaningful counterpoint to its primary focus on mental illness, the volume also incorporates the latest research from a seventh commission-on positive youth development--which addresses how we can fully prepare young people to be happy and successful throughout their lives. Concluding chapters discuss other critical issues of particular relevance: the stigma of mental illness, the role of primary-care doctors and school-based mental health professionals in the detection and treatment of adolescent mental health problems, and the research, policy, and practice context for the delivery of evidence-based treatments. Integrating the work of eminent scholars in both psychology and psychiatry, this work will be an essential volume for academics and practicing clinicians and will serve as a wake-up call to mental health professionals and policy makers alike about the state of our nation's response to the needs of adolescents with mental disorders.The Association of American Publishers' 2005 Award Winner for Excellence in Professional and Scholarly Publishing--Clinical Medicine",
        "Category": " Psychology , Clinical Psychology",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "8.8",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Newfoundlands (Kw-174)",
        "Authors": "By Drury, Kitty and Linn, Bill",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "The Shirley Temple Story",
        "Authors": "By David, Lester",
        "Description": "An incisive biography of Shirley Temple discusses her life as a child actress and Hollywood idol, her growth to maturity, and her political career",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Putnam Pub Group (T)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Acheron (Dark-Hunter, Book 12)",
        "Authors": "By Kenyon, Sherrilyn",
        "Description": "The most anticipated story in the blockbuster Dark-Hunter series. The never-before-revealed story of the Dark-Hunter leader, Acheron. He was made human in order to escape death, but in death he was reborn a god. . .Eleven thousand years ago a god was born. Cursed into the body of a human, Acheron spent a lifetime of shame. However, his human death unleashed an unspeakable horror that almost destroyed the earth. Then, brought back against his will, Acheron became the sole defender of mankind. Only it was never that simple. For centuries, he has fought for our survival and hidden a past he'll do anything to keep concealed. Until a lone woman who refuses to be intimidated by him threatens his very existence.Now his survival, and ours, hinges on hers and old enemies reawaken and unite to kill them both.War has never been more deadly... or more fun.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "In Schools We Trust: Creating Communities of Learning in an Era of Testing and Standardization",
        "Authors": "By Meier, Deborah",
        "Description": "We are in an era of radical distrust of public education. Increasingly, we turn to standardized tests and standardized curricula—now adopted by all fifty states—as our national surrogates for trust.Legendary school founder and reformer Deborah Meier believes fiercely that schools have to win our faith by showing they can do their job. But she argues just as fiercely that standardized testing is precisely the wrong way to that end. The tests themselves, she argues, cannot give the results they claim. And in the meantime, they undermine the kind of education we actually want.In this multilayered exploration of trust and schools, Meier critiques the ideology of testing and puts forward a different vision, forged in the success stories of small public schools she and her colleagues have created in Boston and New York. These nationally acclaimed schools are built, famously, around trusting teachers—and students and parents—to use their own judgment.Meier traces the enormous educational value of trust; the crucial and complicated trust between parents and teachers; how teachers need to become better judges of each others' work; how race and class complicate trust at all levels; and how we can begin to \"scale up\" from the kinds of successes she has created.",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Trial, Tribulation & Triumph: Before, During, and After Antichrist",
        "Authors": "By Birch, Desmond A.",
        "Description": "",
        "Category": " Religion , Christian Theology , Eschatology",
        "Publisher": "Queenship Pub Co",
        "Price Starting With ($)": "42.06",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Leadership Challenge, 4th Edition",
        "Authors": "By Kouzes, James M. and Posner, Barry Z.",
        "Description": "The most trusted resource on becoming a leader is now updated and revised for a new generation.This leadership classic continues to be a bestseller after three editions and twenty years in print. It is the gold standard for research-based leadership, and the premier resource on becoming a leader. This new edition, with streamlined text, more international and business examples, and a graphic redesign, is more readable and accessible than ever before. The Leadership Challenge, Fourth Edition, has been extensively updated with the latest research and case studies, and offers inspiring new stories of real people achieving extraordinary results. The authors' central theme remains the same and is more relevant today than ever: \"Leadership is Everyone?s Business.\" Their \"five practices\" and \"ten commitments\" have been proven by hundreds of thousands of dedicated, successful leaders. This edition, with almost one-third new material, emphasizes the global community and refocuses on business leaders.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Pilgrim Fellowship of Faith: The Church as Communion",
        "Authors": "By Benedict XVI, Pope, Ratzinger, Joseph Cardinal, Taylor, Henry (TRN), Horn, Stephan Otto, and Pfnur, Vinzenz",
        "Description": "A collection of past writings of the newly-elected Pope on topics such as the ministry of priests, eucharistic theology, non-Christian religions, and the role of the Catholic Church in a secular world.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Ignatius Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Coal Black Horse",
        "Authors": "By Olmstead, Robert",
        "Description": "When Robey Childs's mother has a premonition about her husband, a soldier fighting in the Civil War, she does the unthinkable: she sends her only child to find his father on the battlefield and bring him home. At fourteen, wearing the coat his mother sewed to ensure his safety—blue on one side, gray on the other— Robey thinks he's off on a great adventure. But not far from home, his horse falters and he realizes the enormity of his task. It takes the gift of a powerful and noble coal black horse to show him how to undertake the most important journey of his life: with boldness, bravery, and self-posession.Coal Black Horse joins the pantheon of great war novels—All Quiet on the Western Front, The Red Badge of Courage, The Naked and the Dead.",
        "Category": " Fiction , Historical",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Poetry of Pope John Paul II Roman Triptych Meditations",
        "Authors": "By John Paul II, Pope and Peterkiewicz, Jerzy",
        "Description": "",
        "Category": " Poetry , General",
        "Publisher": "USCCB Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Complete Juggler",
        "Authors": "By Finnigan, Dave",
        "Description": "Shows how to learn to juggle, describes a variety of routines using scarves, balls, hats, rings, devil sticks, clubs, and diabolos, and includes advice on balancing tricks",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "The Da Vinci Hoax: Exposing the Errors in the Da Vinci Code",
        "Authors": "By Olson, Carl E. and Miesel, Sandra",
        "Description": "The Da Vinci Code, Dan Brown's best selling novel, purports to be more than fiction: it claims to be based on fact and scholarly research. Brown wants his readers to believe that he is revealing the long-concealed truth about Jesus, Mary Magdalene, and early Christianity, a truth that he says has been suppressed by the malevolent and conspiratorial forces of the Catholic Church. The novel alleges that there has been throughout history a secret group of true followers of a Gnostic Jesus and his wife, Mary Magdalene, the true \"Holy Grail\". Almost everything most Christians and non-Christians think they know about Jesus, according to Dan Brown, is completely wrong, the result of Catholic propaganda designed to hide the truth from the world.But are The Da Vinci Code's claims fact or just plain fiction? Is the novel well-researched as claimed? What is the truth about Jesus, Mary Magdalene, and the early Church? Has the Catholic Church distorted the real Jesus? Why is the novel so popular? What about the anti-Catholic, anti-Christian agenda behind the novel?Best selling author Carl Olson and journalist Sandra Miesel answer these and other important questions. Their painstaking research intoThe Da Vinci Code and its sources reveals some surprising truths. No one who has read or heard about The Da Vinci Code should miss this provocative and illuminating book.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Ignatius Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Nothing But the Truth",
        "Authors": "By Keating, Karl",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Catholic Answers Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Alma Mater",
        "Authors": "By Brown, Rita Mae",
        "Description": "Sex makes monkeys out of all of us. If you don’t give in to it, you wind up a cold, unfeeling bastard. If you do, you spend the rest of your life picking up the pieces. . . .At the start of senior year at William & Mary, the six-foot-tall, raven-haired beauty Victoria “Vic” Savedge finds her future mapped out in detail. She will marry Charly Harrison, the son of one of Virginia’s most prominent families. Though branded by a fiery streak of independence, Vic hasn’t really considered any other options. Until she meets a woman named Chris. A transfer from Vermont, Chris is new to Southern mores and attitudes. Though instantly captivated by Vic, she is also drawn to the entire quirky but charming Savedge family. But the young women’s friendship is not your basic college-girl variety. For neither can resist their mutual attraction–an attraction that erupts into a passion that will forever change the course of both their lives.",
        "Category": " Fiction , LGBT , Gay",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Artistic Touch (Artistic Touch Series)",
        "Authors": "By Unwin, Christine M.",
        "Description": "The Fine Art work of 65 artists are presented in The Artistic Touch which is the 1st book in the Artistic Touch series. Each of the artists describe their inspirations and the techniques that are employed. The Watercolor Medium is used by most of the artists is but there also oil, acrylic and pastel techniques presented. An example of the quality of work which makes up the Artistic Touch series is a review in the American Artistic magazine, where it was stated:American Artist Magazine Book Review of The Artistic TouchRECOMMENDED BOOKSThis lavishly illustrated volume would be worth its price even without the text. It's fun reading because of the variety of works, which are broken up into such categories as abstractions, animals, machines, the sky, travel, and landscapes. There are sixty-five watercolorists represented, including Nita Engle, Judi Betts, Frank Webb, Janet Fish, Pat Deadman, and Jeanne Dobie. Under most of the paintings reproduced here, the artists describe their inspiration for the work and offer various tidbits of technical information.",
        "Category": " Art , Techniques , General",
        "Publisher": "Creative Art Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "All  Gaul is divided...",
        "Authors": "By Anonymous",
        "Description": "",
        "Category": "",
        "Publisher": "Greystone Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1941"
        }
    },
    {
        "Title": "Death Is Forever",
        "Authors": "By Gardner, John",
        "Description": "The end of the Cold War spawns a fierce new villain, in John Gardner's eleventh addition to the classic, best-selling James Bond series.Now that the two Germanys have united, a joint British-American intelligence network in the old Eastern Bloc has disintegrated, to the dismay of SIS and the CIA. But their efforts to make renewed contact with the network, codenamed CABAL, fail when the two original case officers are killed under very suspicious circumstances before contacting their undercover agents.Enter James Bond and his American counterpart, Easy St. John. Following leads left by the dead case officers, Bond and the aggressive Easy track down one of the agents, who dies on his way to a rendezvous with 007. Certain now that the entire network is marked for death, Bond and Easy race across Europe, hoping to save the others from the unknown killer, only to find that they too have become the targets of CABAL's old enemy: Wolfgang Weisen, the shadowy onetime director of East Germany's Security Service.On the run since the destruction of the Berlin Wall, Weisen still maintains a following of loyal, highly trained security officers with access to a wide range of sophisticated weaponry. By setting a trap for Bond, Weisen plans to \"neutralize\" the secret agent before undertaking his true mission; the destabilization of Western Europe through a single, savage act.Packed with harrowing chases, magnificent settings, and a dynamite finale, Death Is Forever is a rousing read by a master storyteller.",
        "Category": " Fiction , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "What's Cooking Indian",
        "Authors": "By Husain, Shehzad",
        "Description": "Provides recipes for entrees with meat and fish, vegetables, side dishes, breads, snacks, and desserts",
        "Category": " Cooking , Regional & Ethnic , Indian & South Asian",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Breaking Ranks II: Strategies for Leading High School Reform",
        "Authors": "By Theodore R. Sizer",
        "Description": "",
        "Category": "",
        "Publisher": "The Education Alliance",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Not Quite Kosher: An Abe Lieberman Mystery",
        "Authors": "By Kaminsky, Stuart M.",
        "Description": "An Abe Lieberman mysteryAbe Lieberman is a strong, sympathetic character, an Everyman whose love for his family is only matched by his quiet, zealous commitment to justice. \"A figure out of Talmudic lore-endearing, wise in his crotchets, weary with his wisdom,\" says The Washington Post. He loves what he does, but it takes its toll as his commitment to what is right is sorely tested every day on the mean streets of Chicago. As a moral man, he is sometimes faced with some uncomfortable ethical choices in order to see that justice-rather than the letter of the law-is meted out. And in Not Quite Kosher, the latest Abe Lieberman mystery by veteran Edgar Award-winning Stuart Kaminsky, our hangdog sleuth is up to his eyeballs in tsurris, the kind of trouble that will drive a man to madness. From tracking a pair of low-rent thieves who stumble into a heist way over their heads to finding out what happened to a man who predicted his own death in a bizarre twist of fate, not to mention planning for a grandson's bar mitzvah that threatens to send him to the poorhouse, Lieberman will do much to find a way to make everything right, even if it takes years off his life.And his Irish partner, Bill Hanrahn, the Priest to Lieberman's Rabbi, is in trouble of his own making. For the woman he loves is the object of affection of one of the kingpins of the Asian crime syndicate in Chicago and the notion of this woman marrying anyone from a different culture is anathema. How far will he go to win the woman he loves? And at what cost?Just another day in the lives of a pair of Chicago's most amiably odd detective team . . .",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Eyewitness Travel Guide to Florida (Eyewitness Travel Guides)",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "Describes Florida's major sights and attractions and provides information on hotels, shops, restaurants, entertainment venues, museums, and theme parks.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Montague of Virginia: the Making of a Southern Progressive",
        "Authors": "By Larsen, William",
        "Description": "",
        "Category": "",
        "Publisher": "Louisiana State University Press",
        "Price Starting With ($)": "30.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "T'ai-Chi: The Supreme Ultimate Exercise for Health, Sport, and Self-Defense",
        "Authors": "By Smith, Robert W. and Cheng, Man-Ching",
        "Description": "\"Tai chi helps reduce stress and anxiety. And it also helps increase flexibility and balance. If you are looking for a way to reduce stress, consider tai chi. Originally developed for self-defense, tai chi has evolved into a graceful form of exercise that's now used for stress reduction and a variety of other health conditions. Often described as meditation in motion, tai chi promotes serenity through gentle, flowing movements.\"—Mayo ClinicDo the Chinese have a secret for youthfulness, health, long life and peace of mind? If they do, an important part of it lies in T'ai-chi, the exercise that millions have been practicing for centuries. To young and old, male and female, weak and strong, T'ai-chi is a wonderful source of relaxation and well-being. In fact, the Chinese consider its purpose to be nothing less than rejuvenation and prolongation of life.T'ai-chi is an effortless and rhythmical art that stresses slow breathing, balanced and relaxed postures, and absolute calmness of mind. It requires no special equipment or place to practice, and takes no more than ten minutes a day.This book, from renowned Tai Chi master, Cheng Man-Ch'ing, introduces T'ai-chi as a means to a healthier life, as a sport and as a method of self defense. It is a complete step-by-step manual for the beginner. With conscientious practice, readers will master the sequence of thirty-seven postures that will make up the T'ai-chi solo exercise. Students will learn how to progress from exercise to sport to self defense with maximum efficiency. The instructions are clear and easy to follow, and more than 275 photographs and 122 foot-weighting diagrams guarantee an understanding of the correct form.A history of T'ai-chi, including thumbnail sketches of famous masters, and the first English translation of the basic T'ai-chi document, known as the T'ai-chi Ch'uan Classics, are also included.",
        "Category": " Sports & Recreation , Martial Arts & Self-Defense",
        "Publisher": "Tuttle Pub",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Sense and Sensibility",
        "Authors": "By Austen, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday Book & Music Clubs",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Dragons (A Studio book)",
        "Authors": "By Hogarth, Peter J.",
        "Description": "This liberally illustrated history of the fantastic winged and scaly serpent blends fact and fiction in its study of the mythological creature in art, fairy tales, and folklore",
        "Category": " Social Science , General",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1979"
        }
    },
    {
        "Title": "Round Ireland with a Fridge",
        "Authors": "By Hawks, Tony",
        "Description": "Have you ever made a drunken bet? Worse, still, have you eveer tried to win one? In attempting to hitchhike round Ireland wich a fridge, Tony Hawks did both, and his foolhardiness led him to one of the best experiences of his life. Joined by his trusty traveling companion-cum-domestic appliance, he made his way from Dublin to Donegal, from Sligo through Mayo, Galway, Clare, Kerry, Cork, Wexford, Wicklow--and back again to Dublin. In their month of madness, Tony and his fridge met a real prince, a bogus king, and the fridge got christened. They surfed together, entered a bachelor festival, and one of them had sex without the other knowing. And unexpectedly, the fridge itself became a momentary focus for the people of Ireland.An international bestseller, Round Ireland with a Fridge is a classic travel adventure in the tradition of Bill Bryson with a dash of Dave Barry.",
        "Category": " Travel , Europe , Ireland",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Combat Service Support Guide: 2nd Edition",
        "Authors": "By Edwards, John E.",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "the secret River",
        "Authors": "By Grenville, Kate",
        "Description": "William Thornhill is a waterman on the River Thames. Life is tough but bearable until William makes a mistake, for which he and his family are made to pay dearly. His sentence: to be transported to New South Wales for the term of his natural life. They arrive in this harsh land that they cannot understand and which feels like a death sentence.",
        "Category": " Fiction , General",
        "Publisher": "Canongate Books Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Handbook for Today's Catholic: Beliefs, Practices, Prayers (A Redemptorist Pastoral Publication)",
        "Authors": "By A Redemptorist Pastoral Publication",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Liguori Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "The Barbed Rose (The One Rose)",
        "Authors": "By Dayton, Gail",
        "Description": "As demon hordes threaten the Kingdom, launching full-scale magical attacks, military mage Kallista, separated from her new family, must journey to the four directions of the world to find the \"Godmarked\"--the only ones who can help her defeat the demon invaders. Original.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Luna",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Blue Day Book for Kids: A Lesson in Cheering Yourself Up",
        "Authors": "By Bradley Greive",
        "Description": "",
        "Category": "",
        "Publisher": "Andrew McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Covenant with Black America",
        "Authors": "By Smiley, Tavis (EDT)",
        "Description": "Six years' worth of symposiums come together in this collection of essays that plot a course for African Americans, explaining how individuals and households can make changes that will immediately improve their circumstances in areas ranging from health and education to crime reduction and financial well-being. Addressing these pressing concerns are contributors Dr. David Satcher, former U.S. surgeon general; Wade Henderson, executive director of the Leadership Conference on Civil Rights; Angela Glover Blackwell, founder of the research think tank PolicyLink; and Cornel West, professor of religion at Princeton University. Each chapter outlines one key issue and provides a list of resources, suggestions for action, and a checklist for what concerned citizens can do to keep their communities progressing socially, politically, and economically. This celebration of possibility, hope, and strength will help leaders and citizens keep Black America moving forward.--From publisher description.Discusses social and political issues affecting African Americans today, including health, housing, crime, criminal justice, education, and economic parity.",
        "Category": " Political Science , Political Ideologies , Nationalism & Patriotism",
        "Publisher": "Third World Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Cheetah Cubs (Penguin Young Readers, Level 3)",
        "Authors": "By Clarke, Ginjer L. and Washburn, Lucia (ILT)",
        "Description": "With the help of realistic illustrations, a veteran science book author seamlessly intertwines a narrative about a cheetah mother and her cubs with facts and figures about these fascinating animals. Original.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Teams That Click (The Results-Driven Manager Series)",
        "Authors": "By HARVARD BUSINESS SCHOOL",
        "Description": "This book offers managers advice on building teams, making the most of diverse skills, avoiding common problems, managing conflict, generating fresh ideas, boosting productivity, communication, and reward systems. There is no index. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Workplace Culture",
        "Publisher": "Harvard Business Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Many Children Left Behind: How the No Child Left Behind Act Is Damaging Our Children and Our Schools",
        "Authors": "By Meier, Deborah (EDT) and Wood, George H. (EDT)",
        "Description": "Signed into law in 2002, the federal No Child Left Behind Act (NCLB) promised to revolutionize American public education. Originally supported by a bipartisan coalition, it purports to improve public schools by enforcing a system of standards and accountability through high-stakes testing. Many people supported it originally, despite doubts, because of its promise especially to improve the way schools serve poor children. By making federal funding contingent on accepting a system of tests and sanctions, it is radically affecting the life of schools around the country.But, argue the authors of this citizen's guide to the most important political issue in education, far from improving public schools and increasing the ability of the system to serve poor and minority children, the law is doing exactly the opposite. Here some of our most prominent, respected voices in education-including school innovator Deborah Meier, education activist Alfie Kohn, and founder of the Coalition of Essential Schools Theodore R. Sizer-come together to show us how, point by point, NCLB undermines the things it claims to improve:* How NCLB punishes rather than helps poor and minority kids and their schools * How NCLB helps further an agenda of privatization and an attack on public schools * How the focus on testing and test preparation dumbs down classrooms * And they put forward a richly articulated vision of alternatives.Educators and parents around the country are feeling the harshly counterproductive effects of NCLB. This book is an essential guide to understanding what's wrong and where we should go from here.",
        "Category": " Education , General",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "A Deeper Joy",
        "Authors": "By Evans, Colleen Townsend",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "Mentoring Teachers Toward Excellence: Supporting and Developing Highly Qualified Teachers",
        "Authors": "By Shulman, Judith H. (EDT) and Sato, Mistilina (EDT)",
        "Description": "Every year, more than 15,000 teachers vie for the chance to become certified by the National Board for Professional Teaching Standards. Although the process is voluntary, National Board Certification is a widely recognized mark of distinction and is increasingly tied to leadership opportunities for teachers, salary increases, and improved student learning in classrooms. Mentors provide supportive services for teachers during their candidacy, offering strategies for standards-based analysis of practice, constructive criticism, advice, and moral support. These mentor groups have grown from informal groups to organized networks of expert teachers in every region of the country. Mentoring Teachers Toward Excellence is the first book to document the common challenges facing these \"support providers,\" presenting a variety of brief cases of typical mentoring dilemmas in both one-on-one and group settings.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Ronald Reagan : Biography",
        "Authors": "By Walsh, Kenneth T.",
        "Description": "Looks at the life and career of the famous actor who became governor of California in the 1960s, and then U.S. President in the 1980s",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Great Controversy Ended",
        "Authors": "By White, Ellen G.",
        "Description": "",
        "Category": "",
        "Publisher": "Pacific Press Publishing Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Wheat-Free, Worry-Free: The Art of Happy, Healthy Gluten Free Living",
        "Authors": "By Korn, Danna",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , General",
        "Publisher": "Hay House",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Body: The Complete Human How It Grows, How It Works, And How To Keep It Healthy And Strong",
        "Authors": "By Daniels, Patricia and Restak, Richard, M.D. (FRW)",
        "Description": "Ideal for families, students, and anyone who's interested in maintaining good health, Body engagingly reveals the complex and fascinating systems of the human machine;from head to toe, cells to skin, inner workings to outward appearance. Organized by body system, the chapters offer a balanced combination of basic anatomical and physiological information. Noted science writers Lisa Stein, Trisha Gura, and Patricia Daniels provide descriptions that are clear, accurate, and accessible to readers on every level. Colorful diagrams, amazing photographs, and miraculous 3- and 4-dimensional imagery;generated by cutting-edge tools;complement the text. The drawings of visionaries such as Leonardo Da Vinci illustrate historic advances in medical science. Special-topic sidebars address today's most relevant concerns: Keeping Healthy, What Can Go Wrong, Medical Breakthroughs, and more. Fact boxes feature eye-catching items that appeal to readers' curiosity: how Botox works, what \"blue blood\" means, why Joe Namath's knees are famous.For easy reference, each chapter includes its own glossary of terms. Valuable cross-referencing tools guide readers to related information throughout. An appendix offers a full glossary, timeline of medical discoveries, and biographies of key pioneers in the field.Enhancing this book's authority are a foreword by acclaimed neurologist Richard Restak, bestselling author of 18 books on the brain; and the guidance of advisers from prestigious medical establishments.Comprehensive, reliable, impeccably researched, and a pleasure to read, Body is the essential health resource for every home and library.",
        "Category": " Medical , Pathophysiology",
        "Publisher": "National Geographic Society",
        "Price Starting With ($)": "8.4",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Fitness for Seniors: Amazing Body Breakthroughs for Super Health",
        "Authors": "By Frank W. Cawood and Associates",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Chemistry Experiments for Children (Dover Children's Science Books)",
        "Authors": "By Mullin, Virginia L.",
        "Description": "What better way is there to learn than by doing? This unusual book enables children to carry out more than 40 experiments and demonstrations, carefully planned to illustrate important principles of modern science. Clear step-by-step instructions, frequent diagrams, and clear statements of conclusions all enable the young student to carry through these experiments with minimal supervision, yet full success.Before embarking on the world of discovery, the reader is introduced to the language of chemistry, including a list of the most common elements and their symbols. A chapter on setting up a laboratory, with a list of equipment and chemicals is also very helpful, as is a discussion of laboratory techniques.The experiments focus on the chemicals in the air; the chemistry of water; solutions, diffusion, and osmosis; crystals; fire; acids, bases and salts; photography, and everyday things. The experiments included demonstrate how to grow a crystal garden, make oxygen five different ways, measure the proportion of oxygen in air, bleach cloth, and make soap and toothpaste. No special equipment is needed: apparatus can for the most part be made at home, and the materials are readily available, inexpensive household items, or are easily found at the pharmacy.This volume offers upper grade school, junior high school, and high school students a very entertaining way to enrich their background in science and its applications. It is also a very valuable aid to parents, teachers, and others who wish to make clear, forceful demonstrations to children.",
        "Category": " Young Adult Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1968"
        }
    },
    {
        "Title": "Missing Persons (Dr. Alan Gregory Novels)",
        "Authors": "By White, Stephen",
        "Description": "The stakes have just been raised for psychologist Alan Gregory: His friend and fellow therapist Hannah Grant has died at the office, mysteriously and suddenly. The police are baffled, leaving another apparent homicide unsolved in Boulder, Colorado. Only Alan has the means to decipher Hannah's clues, a quest that will take him to Las Vegas and lead him to question the integrity of those closest to him.The clock is ticking as Alan tracks one of Hanna's most elusive patients; has she been kidnapped, or is she a runaway? The answers to both cases may be locked in the mind of a patient he has been treating for a schizoid personality disorder.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Jokes for the Head",
        "Authors": "By none",
        "Description": "",
        "Category": "",
        "Publisher": "Kanrom",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Lost Boys",
        "Authors": "By Card, Orson Scott",
        "Description": "In Lost Boys, an acknowledged master storyteller weaves a powerful, uplifting tale of loss and redemption around an ordinary American family's bittersweet triumph over a welter of dark forces, both natural and supernatural.Step Fletcher, his wife, DeAnne, and their three children move to Steuben, North Carolina, thinking - hoping - it might be just the right place for them. Its traditional values coincide with theirs, and Step has the promise of a good job at a hot software company. But Steuben is definitely not right for their oldest child, eight-year-old Stevie. Introspective even in the most comfortable surroundings, Stevie becomes progressively more withdrawn from this alien place. Soon he is animated only by computer games and a troop of fictitious playmates. The Fletchers' concern for Stevie turns to terror when they discover that other young boys have disappeared from Steuben - and someone seems to be stalking Stevie.As they struggle to keep their son from joining the \"lost boys,\" the Fletchers battle a bevy of more conventional torments as well. Their new house is an insect-ridden matchbox dependent on the attentions of an eccentric old handyman. Step seems to be the only sane man at his snake pit of a job. DeAnne must acclimate herself and the three children to a new world while she is hugely pregnant with a fourth. A woman at their church believes God has given her an insight into Stevie's best interests that his parents lack. Evil hides in myriad mundane corners, threatening the Fletchers and their children. One of these threats, or maybe all of them, or maybe something else besides, may take Stevie away. But, though evil is all around them, goodness is within them, and that goodness will bind them together with a strength no force can break.Orson Scott Card's forthright, moving prose, his remarkable gift for chronicling everyday tragedies and triumphs, and his uncanny ability to conjure up emotions - his characters' and his readers' - all blend together in a poignant, masterful novel.",
        "Category": " Fiction , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "A Man Called Lucy, 1939-1945",
        "Authors": "By Accoce, Pierre",
        "Description": "",
        "Category": "",
        "Publisher": "Coward-McCann",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The Talking Eggs",
        "Authors": "By San Souci, Robert D. and Pinkney, Jerry (ILT)",
        "Description": "The author of such delights as The Christmas Ark and The Enchanted Tapestry joins forces with illustrator Pinkney to resurrect a colorful folktale that captures the unique flavor of the American South. A 1989 Caldecott Honor Book.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Dial Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The CIA and American Democracy",
        "Authors": "By Jeffreys-Jones, Rhodri",
        "Description": "This comprehensive history of the Central Intelligence Agency offers a probing account of the CIA's shifting relationships with the American public, Congress, and presidents and explores its operation in the context of the American political system",
        "Category": " History , United States , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "An Autumn of War: What America Learned from September 11 and the War on Terrorism",
        "Authors": "By Hanson, Victor Davis",
        "Description": "On September 11, 2001, hours after the terrorist attacks on New York and Washington, the eminent military historian Victor Davis Hanson wrote an article in which he asserted that the United States, like it or not, was now at war and had the moral right to respond with force. An Autumn of War, which opens with that first essay, will stimulate readers across the political spectrum to think more deeply about the attacks, the war, and their lessons for all of us.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Domers: A Year at Notre Dame",
        "Authors": "By Coyne, Kevin",
        "Description": "What is it about Notre Dame that has, since its founding 150 years ago, made it such a mythic place in the American imagination? To find out, Kevin Coyne spent a year there, going to all the football games but staying for all the other days too - from freshmen orientation to graduation. In between he attended classes, masses, pep rallies, and parties; hung out with virtually every group of students on campus - from pre-meds to ardent pro-life activists to varsity football players to budding philosophers.Coyne was also a fly on the wall as the faculty debated \"whither Notre Dame?\" and its academic future; he sat in on the previously sacrosanct trustee meetings, to which no outsider had ever been admitted; and he spent time with the university's president debating how Notre Dame can uphold, in these cynical times, its belief that a \"true education integrates faith and reason.\"",
        "Category": " Education , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Imperial Temptation: The New World Order and America's Purpose",
        "Authors": "By Hendrickson, David C. and Tucker, Robert W.",
        "Description": "\"The peril is not preeminently to the nation's purse; it is to its soul.  The danger is not so much that we will fail to protect our interests, it is that we will betray our historic ideals . . . . . There is no assumption made here that the nation has always lived up to its deals; it did, however, always look up to them.  We believe that it needs to do so again.\"&#151;from the Introduction In The Imperial Temptation, two eminent foreign policy experts warn that America has made a Faustian bargain in its quest for the leadership of a new world order.  In its attempts to address the challenges posed by new global realities, the Bush administration, so argues The Imperial Temptation, has betrayed the fundamental ideals on which this country was founded. Criticizing the all-out military assault on Iraq as a disproportionate and inhumane response to the crisis, Tucker and Hendrickson argue that President Bush seized on the Iraqi invasion of Kuwait to crystallize its vision of a new world order that would reclaim America's position of world leadership.  But, in choosing to wage war against Iraq when another alternative was available, the authors write, Bush made the use of force the centerpiece of his vision of world order.  As a result, America has fastened on a formula that allows us to go to war with far greater precipitancy that we otherwise might while simultaneously allowing us to walk away from the ruin we create without feeling a commensurate sense of responsibility.  By leaving Iraq in chaos, America has succumbed to an imperial temptation without discharging the classic duties of imperial rule. The Imperial Temptation makes an important&#151;and what is sure to be viewed as controversial&#151;contribution to the national debate over the future of U.S. foreign policy and offers a revealing examination of the classic ideas underlying American diplomacy and their relation to the nation's historic purpose.",
        "Category": " Political Science , General",
        "Publisher": "NYU Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "We Now Know: Rethinking Cold War History (Council on Foreign Relations Book)",
        "Authors": "By Gaddis, John Lewis",
        "Description": "Did the Soviet Union want world revolution?  Why did the USSR send missiles to Cuba?  What made the Cold War last as long as it did? The end of the Cold War makes it possible, for the first time, to begin writing its history from a truly international perspective.  Based on the latest findings of Cold War historians and extensive research in American archives as well as the recently opened archives in Eastern Europe, the former Soviet Union, and China, We Now Know provides a vividly written, eye-opening account of the Cold War during the years from the end of World War II to its most dangerous moment, the Cuban missile crisis.  We Now Know stands as a powerful vindication of US policy throughout the period, and as a thought-provoking reassessment of the Cold War by one of its most distinguished historians.",
        "Category": " History , Modern , 20th Century",
        "Publisher": "Clarendon Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The In-Between Church: Navigating Size Transitions in Congregations",
        "Authors": "By Mann, Alice",
        "Description": "Alban Senior Consultant Mann draws on her lengthy experience in helping congregations deal with the hurdles and anxieties of expansion or contraction in size. Often, congregations experiencing size change do not recognize the need to change culture and form as part of the successful adaptation process. Mann details the adjustments in attitude—as well as practice—that are necessary to support successful size change.",
        "Category": " Religion , Christian Church , Administration",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Crisis Years: Kennedy and Khrushchev, 1960-1963",
        "Authors": "By Beschloss, Michael R.",
        "Description": "Analyzes the relationship between the superpower leaders",
        "Category": " History , United States , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "6.15",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Personal Faith, Public Policy: The 7 Urgent Issues that We, as People of Faith, Need to Come Together and Solve",
        "Authors": "By Jackson, Harry R., Jr. and Perkins, Tony",
        "Description": "Harry Jackson and Tony Perkins believe that America stands at a crossroads. As a nation we must choose God's blessings or His destruction of our society. The \"Religious Right,\" as it has been termed, often looks to the world as its enemy, and many Christians have seen themselves as combatants in war against anti-God forces. In Personal Faith, Public Policy, Jackson and Perkins take a radical new position, stating that the Christian church must lead morally and impact the culture with personal spiritual power and unified Christian public policy, demonstrating how a unified church can tackle each one of the seven major problems of our culture. Achieving victories in each of the seven areas presented will result in vanquishing the big problem facing our country-moral decay. Show Less",
        "Category": " Religion , Christian Living , Social Issues",
        "Publisher": "Frontline",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Lay of the Land",
        "Authors": "By Ford, Richard",
        "Description": "Frank Bascombe has arrived at a state of optimistic pragmatism that he calls the Permanent Period of life. Frank reflects that now there are fewer opportunities left in life to get things wrong. As Thanksgiving dinner with his children and first wife nears, the Permanent Period proves as full of possibility as life had ever been.",
        "Category": " Fiction , General",
        "Publisher": "Bloomsbury",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Edge of Disaster: Rebuilding a Resilient Nation",
        "Authors": "By Flynn, Stephen",
        "Description": "Why do we remain unprepared for the next terrorist attack or natural disaster?Where are we most vulnerable?How have we allowed our government to be so negligent?Who will keep you and your family safe?Is America living on borrowed time?How can we become a more resilient nation?Americans are in denial when it comes to facing up to how vulnerable our nation is to disaster, be it terrorist attack or act of God. We have learned little from the cataclysms of September 11 and Hurricane Katrina. When it comes to catastrophe, America is living on borrowed time–and squandering it. In this new book, leading security expert Stephen Flynn issues a call to action, demanding that we wake up and prepare immediately for a safer future.The truth is acts of terror cannot always be prevented, and nature continues to show its fury in frighteningly unpredictable ways. Resiliency, argues Flynn, must now become our national motto. With chilling frankness and clarity, Flynn paints an all too real scenario of the threats we face within our own borders. A terrorist attack on a tanker carrying liquefied natural gas into Boston Harbor could kill thousands and leave millions more of New Englanders without power or heat. The destruction of a ship with a cargo of oil in Long Beach, California, could bring the West Coast economy to its knees and endanger the surrounding population. But even these all-too-plausible terrorist scenarios pale in comparison to the potential destruction wrought by a major earthquake or hurricane.Our growing exposure to man-made and natural perils is largely rooted in our own negligence, as we take for granted the infrastructure handed down to us by earlier generations. Once the envy of the world, this infrastructure is now crumbling. After decades of neglect, our public health system leaves us at the mercy of microbes that could kill millions in the next flu pandemic. Flash flooding could wipe out a fifty-year-old dam north of Phoenix, placing thousands of homes and lives at risk. The next San Francisco earthquake could destroy century-old levees, contaminating the freshwater supply that most of California relies on for survival.It doesn’t have to be this way. The Edge of Disaster tells us what we can do about it, as individuals and as a society. We can–and, Flynn argues, we must–construct a more resilient nation. With the wounds of recent national tragedies still unhealed, the time to act is now. Flynn argues that by tackling head-on, eyes open the perils that lie before us, we can remain true to our most important and endearing national trait: our sense of optimism about the future and our conviction that we can change it for the better for ourselves–and our children.“Steve Flynn offers the answer not only to protecting America from terrorist attacks and natural disaster but also to revitalizing our democracy. This book is a must-read for all members of Congress, 2008 presidential candidates, and ordinary citizens who want to build a better and safer future.”–Anne-Marie Slaughter, dean, Woodrow Wilson School of Public and International Affairs, Princeton UniversityAdvance praise for The Edge of Disaster“Steve Flynn has done it again. Like America the Vulnerable before it, The Edge of Disaster is the must-read book for every American, elected official, and presidential candidate who is committed to ensuring that our nation continue to thrive in perilous times.”–Mark Warner, former governor of Virginia“Since 9/11, protecting our nation against a terrorist attack has consumed policy makers in Washington. What Stephen Flynn points out in The Edge of Disaster is that much of this effort has been directed overseas, often at the expense of our homeland and its much more likely areas of vulnerability. Laying out a series of potential disasters both manmade and natural, Flynn calls for a greater emphasis on preparedness and the ability of communities and the nation to recover. Painting an often frustrating and infuriating picture of missed opportunities, The Edge of Disaster is a call to action. The time to act is now. We can only hope that policy makers are listening.” –Christine Todd Whitman, former governor of New Jersey and former administrator, Environmental Protection Agency (2001-03)“Steve Flynn’s book makes the very persuasive argument that national security preparedness is linked to natural disaster preparedness. By investing significantly in our critical infrastructure, in citizen preparedness, and most importantly in leadership, we can be better prepared for all hazards. A great book that I highly recommend.” –James Lee Witt, former director, Federal Emergency Management Agency“Steve Flynn has become a relentless contributor to the dialogue on prioritizing the work of the post-9/11 security environment. The Edge of Disaster calls into question the neglect of domestic preparedness in favor of the Department of Defense-driven offensive in the global war on terrorism. The book offers provocative challenges to both our elected and our private-sector leaders, and both should read it thoroughly.” –Admiral James M. Loy, former commandant, U.S. Coast Guard, and former deputy secretary of homeland security",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Wealth and Democracy: A Political History of the American Rich",
        "Authors": "By Phillips, Kevin P.",
        "Description": "For more than thirty years, Kevin Phillips' insight into American politics and economics has helped to make history as well as record it.  His bestselling books, including The Emerging Republican Majority (1969) and The Politics of Rich and Poor (1990), have influenced presidential campaigns and changed the way America sees itself. Widely acknowledging Phillips as one of the nation's most perceptive thinkers, reviewers have called him a latter-day Nostradamus and our \"modern Thomas Paine.\"  Now, in the first major book of its kind since the 1930s, he turns his attention to the United States' history of great wealth and power, a sweeping cavalcade from the American Revolution to what he calls \"the Second Gilded Age\" at the turn of the twenty-first century.The Second Gilded Age has been staggering enough in its concentration of wealth to dwarf the original Gilded Age a hundred years earlier. However, the tech crash and then the horrible events of September 11, 2001, pointed out that great riches are as vulnerable as they have ever been.  In Wealth and Democracy, Kevin Phillips charts the ongoing American saga of great wealth–how it has been accumulated, its shifting sources, and its ups and downs over more than two centuries.  He explores how the rich and politically powerful have frequently worked together to create or perpetuate privilege, often at the expense of the national interest and usually at the expense of the middle and lower classes.With intriguing chapters on history and bold analysis of present-day America, Phillips illuminates the dangerous politics that go with excessive concentration of wealth.  Profiling wealthy Americans–from Astor to Carnegie and Rockefeller to contemporary wealth holders–Phillips provides fascinating details about the peculiarly American ways of becoming and staying a multimillionaire.   He exposes the subtle corruption spawned by a money culture and financial power, evident in economic philosophy, tax favoritism, and selective bailouts in the name of free enterprise, economic stimulus, and national security.Finally, Wealth and Democracy turns to the history of Britain and other leading world economic powers to examine the symptoms that signaled their declines–speculative finance, mounting international debt, record wealth, income polarization, and disgruntled politics–signs that we recognize in America at the start of the twenty-first century.  In a time of national crisis, Phillips worries that the growing parallels suggest the tide may already be turning for us all.From the Hardcover edition.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "To Prevail: An American Strategy for the Campaign Against Terrorism",
        "Authors": "By Campbell, Kurt M. and Flournoy, Michele A.",
        "Description": "Immediately after the attacks of Sept. 11, 2001, the Center for Strategic and International Studies in Washington, DC, gathered together a task force of regional scholars, terrorism experts, military representatives, intelligence analysts, former policymakers, and strategic thinkers to develop a comprehensive strategy that the US might adopt in challenging global terrorism. The collection that resulted comprises 16 chapters of analysis and recommendations in both domestic and foreign policy arenas. Appendices provide the text of selected public addresses on and after Sept. 11 as well as brief profiles of major international terrorist organizations. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Peace",
        "Publisher": "Center for Strategic & International Studies",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "A World Transformed",
        "Authors": "By Scowcroft, Brent and Bush, George",
        "Description": "It was one of the pivotal times of the twentieth century--during George Bush's presidency, an extraordinary series of international events took place that materially changed the face of the world. Now, former President Bush and his national security advisor, Brent Scowcroft, tell the story of those tumultuous years.Here are behind-the-scenes accounts of critical meetings in the White House and of summit conferences in Europe and the United States, interspersed with excerpts from Mr. Bush's diary. We are given fresh and intriguing views of world leaders such as Mikhail Gorbachev, Boris Yeltsin, Margaret Thatcher, Helmut Kohl, and François Mitterrand--and witness the importance of personal relationships in diplomacy. There is the dramatic description of how President Bush put together the alliance against Saddam Hussein in the Gulf War. There are the intensive diplomatic exchanges with Beijing following the events of Tiananmen Square, and the intricate negotiations leading up to German reunification. And there is the sometimes poignant, sometimes grim portrayal of Gorbachev's final years in power.A World Transformed is not simply a record of accomplishment; Bush and Scowcroft candidly recount how the major players sometimes disagreed over issues, and analyze what mistakes were made. This is a landmark book on the conduct of American foreign policy--and how that policy is crucial to the peace of the world. It is a fascinating inside look at great events that deepens our understanding of today's global issues.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Pueblo Surrender: A Covert Action by the National Security Agency",
        "Authors": "By Liston, Robert A.",
        "Description": "Offers a clear, simple account of what really happened prior to, during, and after the seizure of the USS \"Pueblo\" by the North Koreans in January of 1968, implicating the National Security Agency in an espionage power play",
        "Category": "",
        "Publisher": "M Evans & Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Sarah: How a Hockey Mom Turned the Political Establishment Upside Down",
        "Authors": "By Johnson, Kaylene",
        "Description": "In Sarah, the first biography released of Governor Palin, author Kaylene Johnson draws upon personal interviews with Palin, her family, and other highly placed sources to explore Palin's family life, her upbringing in a devout Christian home, her political rise, and how she went from being a long-shot candidate to—potentially—one of the world's most powerful women and political figures. The book features dozens of family and political photos and contains source notes. An Epicenter Press book, distributed by Tyndale House. Tyndale will also provide a free online discussion guide designed to engage readers on the subject of faith and politics: www.FaithandPoliticsDiscussionGuide.com.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Majolica Pottery: An Identification and Value Guide/Second Series",
        "Authors": "By Katz-Marks, Mariann",
        "Description": "",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Arousing the Goddess: Sex and Love in the Buddhist Ruins of India",
        "Authors": "By Ward, Tim",
        "Description": "\"[T]he only subjective account of a mystical experience induced during ritual tantric sex ever written. That Ward experienced it, and that this experience was profound, there seems little reason to doubt. . . . Diabolically funny at times, this is also a brave, wise, and brilliant book.\"—Toronto Star\"This book is . . . about learning. Its great strength, aside from its finely crafted prose, is Ward’s honesty about what he learned . . . The process of acquiring wisdom provides the narrative with its dramatic muscle . . . risky, bracing stuff.\"—The Globe and MailTim Ward spent six years in the Orient wandering the Dharma trail. He visited temples and monasteries, desert ashrams, and mountain top holy places, seeking out monks and mystics.In this, his third and most sensual book, Tim falls in love with Sabina, who has come to India to research the temptation of the Buddha by Mara (Hinduism’s devil) and his three daughters. The Buddha overcame his final temptation, in the moment before Enlightenment, by touching the earth beneath him, and asking the Earth to bear witness to his Realization. The Earth Goddess rose in his defense. For her thesis, Sabina must record and photograph rare Buddhist statues bearing this scene. Tim accompanies her as her assistant.A mixture of sex, love, coming of age, and Buddhism, Arousing the Goddess is filled with humor and recognition of the absurdities of life. It has been praised for its honesty and insight.Tim Ward is the author of What the Buddha Never Taught, which was a best-seller in Canada, and a Book of the Month selection in the United States. He has written for a variety of publications, including Reader’s Digest, The Toronto Globe and Mail, Common Boundary Magazine, and several Traveler’s Tales anthologies. He is president of Intermedia Communications Training, Inc., in Maryland where he lives with his -family.",
        "Category": " Religion , Spirituality",
        "Publisher": "Monkfish Book Publishing",
        "Price Starting With ($)": "5.25",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Great Transformation: The Beginning of Our Religious Traditions",
        "Authors": "By Armstrong, Karen",
        "Description": "In the ninth century BCE, the peoples of four distinct regions of the civilized world created the religious and philosophical traditions that have continued to nourish humanity to the present day: Confucianism and Daoism in China, Hinduism and Buddhism in India, monotheism in Israel, and philosophical rationalism in Greece. Later generations further developed these initial insights, but we have never grown beyond them. Rabbinic Judaism, Christianity, and Islam, for example, were all secondary flowerings of the original Israelite vision. Now, in The Great Transformation, Karen Armstrong reveals how the sages of this pivotal “Axial Age” can speak clearly and helpfully to the violence and desperation that we experience in our own times. Armstrong traces the development of the Axial Age chronologically, examining the contributions of such figures as the Buddha, Socrates, Confucius, Jeremiah, Ezekiel, the mystics of the Upanishads, Mencius, and Euripides. All of the Axial Age faiths began in principled and visceral recoil from the unprecedented violence of their time. Despite some differences of emphasis, there was a remarkable consensus in their call for an abandonment of selfishness and a spirituality of compassion. With regard to dealing with fear, despair, hatred, rage, and violence, the Axial sages gave their people and give us, Armstrong says, two important pieces of advice: first there must be personal responsibility and self-criticism, and it must be followed by practical, effective action. In her introduction and concluding chapter, Armstrong urges us to consider how these spiritualities challenge the way we are religious today. In our various institutions, we sometimes seem to be attempting to create exactly the kind of religion that Axial sages and prophets had hoped to eliminate. We often equate faith with doctrinal conformity, but the traditions of the Axial Age were not about dogma. All insisted on the primacy of compassion even in the midst of suffering. In each Axial Age case, a disciplined revulsion from violence and hatred proved to be the major catalyst of spiritual change.",
        "Category": " Philosophy , History & Surveys , Ancient & Classical",
        "Publisher": "Alfred A. Knopf / Random House",
        "Price Starting With ($)": "6.01",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Saints for Every Occasion: 101 Of Heaven's Most Powerful Patrons",
        "Authors": "By Craughwell, Thomas J.",
        "Description": "",
        "Category": " Biography & Autobiography , Reference",
        "Publisher": "Ignatius Press",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Jesus, the One and Only",
        "Authors": "By Moore, Beth and McCleskey, Dale",
        "Description": "In her previous books, Beth Moore has introduced her readers to David and Paul. In Jesus, the One and Only, Beth introduces them to an intimate Savior as they get a close-up and personal portrait of the life of Jesus the Messiah.But this is far more than just a work on the life of Christ. As He has done in the past, God uses Beth’s words to woo the reader into a romance with the One and Only. The reader comes to know Christ personally, watching and listening as He breaks up a funeral by raising the dead, confronts conniving religious leaders of His day, teaches on a Galilean hillside, or walks on the waves and calms the storm.",
        "Category": " Religion , Biblical Studies , New Testament , General",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "In Nixon's Web: A Year in the Crosshairs of Watergate",
        "Authors": "By Gray, L. Patrick, III and Gray, Ed",
        "Description": "The last untold story of Watergate--by the FBI director who maintained his silence for more than thirty years L.Patrick Gray III was the man caught in the middle of the Watergate scandal. He was a lifelong Republican, but Richard Nixon considered him a threat. Closing in on the conspiracy, Gray became the target of one of Watergate's most shocking acts--Nixon's \"smoking gun\" attempt to have the CIA stop the FBI investigation. And when the U.S. Senate focused its attention on Gray in April 1973, the White House threw him to the wolves; John Ehrlichman famously advised that he be left to \"twist slowly, slowly in the wind.\" This book is Gray's firsthand account of what really happened during his crucial year as acting director of the FBI, based on a never-before-published first-person account and previously secret documents. He reveals the witches' brew of intrigue and perfidy that permeated Washington, and he tells the unknown story of his complex relationship with his top deputy, Mark Felt, raising disturbing questions about the methods and motives of the man purported to be Deep Throat. Gray's book was completed and expanded by his son, the journalist Ed Gray, who has supplemented the text with revelatory excerpts from documents, tape transcripts, and third-party accounts. Every other major figure has told his story, and now Patrick Gray's unique inside account will change the way we think about the crisis that destroyed the Nixon presidency.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Times Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "My Land and My People: The Original Autobiography of His Holiness the Dalai Lama of Tibet",
        "Authors": "By Dalai Lama XIV",
        "Description": "Schooled behind ancient palace walls to become the leader of Tibet, the Dalai Lama has become a spiritual leader to the world and a leading civil rights advocate. My Land and My People tells the story of his life.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Sister Bernadette's Barking Dog: The Quirky History and Lost Art of Diagramming Sentences",
        "Authors": "By Florey, Kitty Burns",
        "Description": "“Kitty Burns Florey seems to write from a great wellspring of inner calm that derives from a gleeful appreciation of life's smallest details.”—Richard Russo, Pulitzer Prize-winning author of Empire FallsOnce wildly popular in grammar schools across the country, sentence diagramming has  fallen out of fashion. But are we that much worse for not knowing the word-mapping  method? Now, in this illustrated personal history that any language lover will adore,  Kitty Burns Florey explores the rise and fall of sentence diagramming, including  its invention by a mustachioed man named Brainerd “Brainy” Kellogg and his wealthy  accomplice Alonzo Reed ... the inferior “balloon diagram” predecessor ... and what  diagrams of sentences by Hemingway, Welty, Proust, Kerouac and other famous writers  reveal about them. Florey also offers up her own common-sense approach to learning  and using good grammar. And she answers some of literature’s most pressing questions:  Was Mark Twain or James Fenimore Cooper a better grammarian? What are the silliest  grammar rules? And what’s Gertude Stein got to do with any of it?",
        "Category": " Literary Collections , Essays",
        "Publisher": "Melville House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "God In All Worlds: An Anthology of Contemporary Spiritual Writing",
        "Authors": "By Vardey, Lucinda (EDT)",
        "Description": "Encompassing virtually every religious tradition, a compilation of twentieth-century spiritual essays includes the works of Mother Teresa, Albert Einstein, Thomas Merton, the Dalai Lama, Carl Jung, Mahatma Gandhi, Vaclav Havel, Barry Lopez, and others. Reprint. 25,000 first printing.",
        "Category": " Religion , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "So Close To Heaven: The Vanishing Buddhist Kingdoms of the Himalayas",
        "Authors": "By Crossette, Barbara",
        "Description": "Tantric Buddhism, with its complex and fascinating rites, rose to its highest levels on the trans-Himalayan Tibetan plateau, where it had flowered since the eighth century. But now the small kingdoms - Sikkim and Ladakh among them - where the teachings and miracles of the great lamas were revered have been gobbled up by bigger powers. The story of that loss is a prelude to Barbara Crossette's richly evocative journey into the historical past and courageous present of Bhutan, where the Buddhist world can still be seen intact, peaceful, harmonious - and threatened.We enter a landscape of frozen peaks, high windy flatlands, and deep verdant valleys where, until the 1960s, the Bhutanese lived a medieval existence - where temples and monasteries, monks and lamas, provided not only spiritual but legal and even medical sustenance. We move through farmlands, villages, and towns whose clusters of painted ornamental buildings and wooden half-timberings might be illustrations for old fairy tales, where thanks to Bhutan's devoted rulers change has thus far been gradual; where the tolerance, good humor, generosity - and gorgeous ritual - of Himalayan Buddhism continues to shine through.Into this setting creep the tensions, deep and destructive, that threaten to wound Bhutan despite its best efforts to ward off the outside world. We see how open borders and recent air links have led to high-stakes smuggling of temple treasures and gold, as well as the ravages of AIDS; how tourism is importing dollars, distance from village roots, and a new urban phenomenon - burglary.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Knopf",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Leveling Wind: Politics, the Culture, and Other News",
        "Authors": "By Will, George F.",
        "Description": "The nationally syndicated conservative columnist and ABC-TV political commentator presents his fifth collection of columns, speeches, and reviews from 1990 through 1994, including observations on the pleasures of sports and family life. Reprint.",
        "Category": " Political Science , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Breaking the Da Vinci Code: Answers to the Questions Everyone's Asking",
        "Authors": "By Bock, Darrell L.",
        "Description": "Many who have read the New York Times bestseller The Da Vinci Code have questions that arise from seven codes-expressed or implied-in Dan Brown's book. In Breaking the Da Vinci Code: Answers to the Questions Everyone's Asking, Darrell Bock, Ph.D., responds to the novelist's claims using central ancient texts and answers the following questions: Who was Mary Magdalene?Was Jesus Married?Would Jesus Being Single be Un-Jewish?Do the So-Called Secret Gnostic Gospels Help Us Understand Jesus?What Is the Remaining Relevance of The Da Vinci Code?Darrell Bock's research uncovers the origins of these codes by focusing on the 325 years immediately following the birth of Christ, for the claims of The Da Vinci Code rise or fall on the basis of things emerging from this period. Breaking the Da Vinci Code, now available in trade paper, distinguishes fictitious entertainment from historical elements of the Christian faith. For by seeing these differences, one can break the Da Vinci code.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Oliver-Nelson Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Classic Sermons on Worship (Kregel Classic Sermons)",
        "Authors": "By Wiersbe, Warren W.",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Kregel Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "More Than Words: A Dictionary of Christian Faith Offering Definitions and Insight to Preachers, Teachers, and Other Church Leaders",
        "Authors": "By Sydnor, William",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Celebrate the Risen Christ (Today)",
        "Authors": "By Billy Graham, Franklin Graham,, Jack Hayford, Anne Lotz, Max Lucado, John MacArthur, Charles Stanley,, Charles Swindoll",
        "Description": "",
        "Category": "",
        "Publisher": "W Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "10,000 Steps a Day to Your Optimal Weight: Walk Your Way to Better Health",
        "Authors": "By Isaacs, Greg",
        "Description": "Many people do not realize that on a daily basis they probably already walk 900 to 3,000 steps, even if they have a relatively sedentary lifestyle. By incorporating fairly modest changes into their day-to-day routine, people can easily increase their walking count to 10,000 steps. This book shows readers how to do just that. It serves as a tool for those who want to reap all of the rewards of walking. This paperback book includes a FREE pedometer.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Foremothers: Women of the Bible",
        "Authors": "By Nunnally-Cox, Janice",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Seabury Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "Yoga Simply",
        "Authors": "By Yolanda Pettinato",
        "Description": "",
        "Category": "",
        "Publisher": "Hinkler Books Pty Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Mary Baker Eddy - Christian Healer",
        "Authors": "By Yvonne Cache von Fettweis, Robert Townsend Warneck",
        "Description": "",
        "Category": "",
        "Publisher": "The Christian Science Publishing Society",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "DOORWAY TO THE SOUL: How To Have a Profound Spiritual Experience",
        "Authors": "By Scolastico, Ron, Ph.D.",
        "Description": "This inspiring book will teach you how to use the key of consciousness to unlock the secrets of the spiritual dimensions of reality. Dr. Scolastico has experienced these dimensions thousands of times and from these experiences, he gives a potent, step-by-step method for inwardly exploring the very foundations of existence. He shows you how to discover the true meaning and purpose of life through an inner engagement with the spiritual forces that sustain life on earth.Combining deep psychological insights with profound spiritual guidance, this book can help you heal painful mental and emotional patterns that block your personal and spiritual growth. It shows you how to deepen your love for yourself and others. It can lead you to enhanced creativity and strengthened intuition. Above all, it will teach you how to have a profound experience of spiritual realities.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Spa Handbook A Guide to Enhancing Physical Mental Spiritual Well Being",
        "Authors": "By Maria Costantino",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Secret of God's Presence (Formerly God's Gift Perfection",
        "Authors": "By Murray, Andrew",
        "Description": "",
        "Category": " Religion , Faith",
        "Publisher": "Whitaker House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Total Rejuvenation: From Skincare To Scalpel",
        "Authors": "By Cohen, Barry J., M.D.",
        "Description": "",
        "Category": " Medical , Reference",
        "Publisher": "Mdpublish",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "How to Be a Budget Fashionista: The Ultimate Guide to Looking Fabulous for Less",
        "Authors": "By Finney, Kathryn",
        "Description": "Good news: You don’t have to sacrifice style just to pay your electric bill. Kathryn Finney, a.k.a. the Budget Fashionista, is the expert on all things chic and cheap. Now she opens up her Prada bag of shopping and style tips to make you fashionably frugal, with change to spare. It’s as easy as 1-2-3!1. Know your budget: Learn innovative, money-saving ways to increase your clothing funds. 2. Know your style: Get helpful hints from fashion insiders and use them to develop your own mode of self-expression. 3. Know your bargains: Discover the art of scoring exclusive friends-and-family coupons for your favorite department stores Whether you’re a homemaker from Houston, a grandma from Grand Rapids, or an M.D. from Manhattan, you don’t need to break the bank to look your best. With great cost-cutting tips, at-home spa secrets, designer discount websites, and access to exclusive deals, The Budget Fashionista is like having your own personal stylist at your beck and call. So before you go out and commit the eighth deadly sin–buying a fake Louis Vuitton–read this must-have guide and learn to be style-smart and budget-wise!",
        "Category": " Self-help , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Entre Nous: A Woman's Guide to Finding Her Inner French Girl",
        "Authors": "By Ollivier, Debra",
        "Description": "French women's secrets to being self-possessed, self-satisfied and fully self-expressed.Provocative and practical, lively and intelligent, Entre Nous unlocks the mystery of the French girl and the secrets of her self-possession.  Why do French women always look inimitably stylish? How do they manage to sit in a café for a three-course lunch and a glass of wine...by themselves?  What gives them the certainty that allows them to refuse anything--whether a man, a job, or a little black dress--that doesn't suit them perfectly?More than just a book on fashion, Entre Nous is about the essence of French living--its observations about French women and their ways will help you take the best of all pages from the French girl's book: the page that reveals how to really enjoy life.\"Ollivier spent a decade in France and learned a thing or two about how French women cultivate that sense of being easy in one's skin...(she) helps us bridge the cultural gap.\"- Seattle Times",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "ESPN Guide to Psycho Fan Behavior",
        "Authors": "By St. John, Warren (EDT), Blumenfeld, Amir (CON), Hall, Spencer (CON), and Trex, Ethan (CON)",
        "Description": "Ever wonder how to brainwash your infant so he doesn't grow up to root, root, root for a rival team? How to goad a basketball player into missing a crucial free throw? How to tear down a goalpost? Do you know the ABCs of body paint? If not, fear not: Warren St. John has recruited an all-star team of fanatics to help you help your team.Guaranteed to raise your performance to a truly insane level, ESPN Guide to Psycho Fan Behavior is packed with professional tips, informative illustrations, and real-life \"fanecdotes.\" Learn how to kidnap a mascot, the best way to swipe a home-run ball from a bleacher bum, and how to keep running after getting Tasered. With sideline reporting and expert analysis from CollegeHumor.com writers Amir Blumenfeld and Ethan Trex, and from Spencer Hall -- who writes the blog Every Day Should Be Saturday under the name Orson Swindle -- this one-of-a-kind survival manual is the surest way to guarantee that you excel in every game situation: home or away, rain or shine, front row or nosebleed seats.",
        "Category": " Humor , Topic , Sports",
        "Publisher": "ESPN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Now I Can Die in Peace: How ESPN's Sports Guy Found Salvation, with a Little Help From Nomar, Pedro, Shawshank, and the 2004 Red Sox",
        "Authors": "By Simmons, Bill",
        "Description": "The author of ESPN's \"Sports Guy\" column describes the long years leading up to the Boston Red Sox World Series win in 2004, reexamining the events and personalities of the historic season and reflecting on what it means to the ultimate Boston Red Sox fan.  50,000 first printing.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "ESPN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Royal Fashion and Beauty Secrets: An Intimate Look at How Princess Diana Achieves Her Radiance, Style, and Grace-Revealed for Women Everywhere",
        "Authors": "By Chubb, Ann",
        "Description": "Includes tips on fashion, hair and skin care, exercise, diet, and makeup based on the techniques used by Princess Diana",
        "Category": " Design , Fashion & Accessories",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    }
]