[
    {
        "Title": "Faces of the Eastern Shore",
        "Authors": "By Van Riper, Frank",
        "Description": "Fifty-seven splendid black-and-white photographic portraits and accompanying text capture the quintessence of the people who live in the cities, towns, and coastal waters of the Delmarva peninsula. Original.",
        "Category": " Photography , General",
        "Publisher": "Lickle Pub Inc",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Reflections of Washington Dc",
        "Authors": "By Berman, Eleanor",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "6.7",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Washington D.C. from the Air",
        "Authors": "By Harris, Bill",
        "Description": "A photographic look at the nation's capital, containing aerial views of the city's famous landmarks, buildings, and natural landscape",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Washington, D.C.: A Photographic Tour",
        "Authors": "By Highsmith, Carol M. and Landphair, Ted",
        "Description": "Carved out, at the close of the eighteenth century, of some of the thickest woods and foulest swamps north of Georgia, the glorious city of Washington D.C., is among America's most stately, most beautiful, and most impressive.  Indeed, once maligned by Charles Dickens as simply \"spacious avenues that begin in nothing and lead nowhere; streets a mile long that only want houses, roads, and inhabitants; public buildings that need but a public to be complete, \" Washington, D.C. today is a powerful symbol not only of our nation but of democracy.Spanning the Potomac in majestic fashion, the city fans out gracefully, offering a multitude of pleasures to the more than twenty million tourists who visit annually.  From official Washington (the imposing Lincoln and Jefferson Memorials, the White House, the Capitol, the souring obelisk of the Washington Monument) to its lush public parks and gardens; from Union Station to Ford's Theater; the Willard Hotel to the Library of Congress to the fabled Belgian Embassy; the charm of its celebrated Cherry Blossom Festival to the somber beauty of the Vietnam Wall; from the delightful Easter egg roll to the profoundly moving Holocaust Museum—Washington D.C., A Photographic Tour manages to convey all the grandeur of the nation's capital while reminding us that this splendor belongs, of course, to all who prize democracy.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Mercy: A Novel",
        "Authors": "By Picoult, Jodi",
        "Description": "Police chief of a small Massachusetts town, Cameron McDonald makes the toughest arrest of his life when his own cousin Jamie comes to him and confesses outright that he has killed his terminally ill wife out of mercy.Now, a heated murder trial plunges the town into upheaval, and drives a wedge into a contented marriage: Cameron, aiding the prosecution in their case against Jamie, is suddenly at odds with his devoted wife, Allie -- seduced by the idea of a man so in love with his wife that he'd grant all her wishes, even her wish to end her life. And when an inexplicable attraction leads to a shocking betrayal, Allie faces the hardest questions of the heart: when does love cross the line of moral obligation? And what does it mean to truly love another? Praised for her \"personal, detail-rich style\" (Glamour), Jodi Picoult infuses this page-turning novel with heart, warmth, and startling candor, taking readers on an unforgettable emotional journey.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Beyond the Dark (Berkley Sensation Paranormal Romance)",
        "Authors": "By Holly, Emma, Knight, Angela, Leigh, Lora, and Whiteside, Diane",
        "Description": "A daring collection of never-before-published erotic desire from four of the hottest names in paranormal romance.  Four of the most sizzling authors of paranormal romance take readers beyond their wildest fantasies, to a seductive midnight world of erotic suspense, demons, mages, vampires, and knights. A world of queens with devilish secrets, and of demons with secret desires. So dangerous and fun, readers may never want to come back down to earth again...",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "How to Draw Dinosaurs",
        "Authors": "By Claridge, Marit",
        "Description": "",
        "Category": "",
        "Publisher": "Edc Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Woodland Life (NATURAL WORLD)",
        "Authors": "By Taylor, Barbara",
        "Description": "Explores different forested environments, describes characteristics of their plant and animal life, and explains measures taken to protect forests from natural disasters and people.",
        "Category": " Juvenile Nonfiction , Science & Nature , Flowers & Plants",
        "Publisher": "Barrons Juveniles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "This Is My World (Sight Word Readers)",
        "Authors": "By Williams, Rozanne Lanczak, Hamaguchi, Carla (EDT), and Rose, Drew (ILT)",
        "Description": "",
        "Category": " Language Arts & Disciplines , Study & Teaching",
        "Publisher": "Creative Teaching Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Tiger Book (Look-Look)",
        "Authors": "By Pfloog, Jan",
        "Description": "A simple introduction to the habits and behavior of tigers, with illustrations and a brief text.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "World Series (Odyssey Classics (Odyssey Classics))",
        "Authors": "By Tunis, John R. and Brooks, Bruce (INT)",
        "Description": "Roy Tucker and his Brooklyn Dodgers teammates summon every ounce of their collective skill to fight for the greatest title in baseball--World Series champs.Includes an introduction by Bruce Brooks.",
        "Category": " Juvenile Fiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Cuckoo Child",
        "Authors": "By King-Smith, Dick and Bowman, Leslie W. (ILT)",
        "Description": "After encountering an ostrich at the local zoo, Jack steals an egg to bring to his farm, but not having planned for any problems, Jack gets a big surprise when it finally hatches. Reprint.",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Catbird's calling and other animal stories",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Highlights for Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "ARTS & IDEAS 8E",
        "Authors": "By Fleming, William",
        "Description": "Traces the development of painting, sculpture, architecture, literature, music, and philosophy from ancient times to the present, focusing on five main stylistic periods",
        "Category": "",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "8.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Illustrated Children's Bible",
        "Authors": "By Farnsworth, Bill",
        "Description": "A lucid modernization of the Bible that scrupulously retains the Scripture's poetic language features bold, full-color illustrations in the styles of great past artists, a dictionary of unfamiliar words, and factual articles providing further information.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Theirs Is the Kingdom: Celebrating the Gospel in Urban America",
        "Authors": "By Lupton, Robert D.",
        "Description": "\"A gripping discovery of God's grace where we least expect to find it—in the decaying core of the city.\" —Ronald A. Nikkel, president, Prison Fellowship International\"The story of Lupton's ministry is one of the most inspiring in America. Those of us who are trying to accomplish something of value in urban settings look to him and his co-workers as models.\" —Tony Campolo, author of Stories That Feed Your SoulUrban ministry activist Robert Lupton moved into a high crime area of Atlanta intending to bring Christ’s message into the ghetto—but his humbling discovery of a spiritual life already flowering in the city’s urban soil forces the minister to reexamine the deepest parts of his own soul, confronting his own patronizing, materialistic attitudes and the biases he himself held against the urban poor.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2011"
        }
    },
    {
        "Title": "Legacies Collecting America's History at the Smithsonian",
        "Authors": "By Lubar, Steven D., Kendrick, Kathleen M., and National Museum of American History (U. S.) (COR)",
        "Description": "The Smithsonian Institution has been America's museum since 1846. What do its vast collections -- from the ruby slippers to a piece of Plymouth Rock, first ladies' gowns to patchwork quilts, a Model T Ford to a customized Ford LTD low rider -- tell Americans about themselves? In this lavishly illustrated guide to the Smithsonian's National Museum of American History, Steven Lubar and Kathleen M. Kendrick tell the stories behind more than 250 of the museum's treasures, many of them never before photographed for publication. These stories not only reveal what America as a nation has decided to save and why but also speak to changing visions of national identity.As the authors demonstrate, views of history change over time, methods of historical investigation evolve and improve, and America's understanding of the past matures. Shifts in focus and attitude lie at the hearth ofLegacies, which is organized around four concepts of what a national museum of history can be: a treasure house, a shrine to the famous, a palace of progress, and a mirror of the nation. Thus, the museum collects cherished or precious objects, houses celebrity memorabilia, documents technological advances, and reflects visitors' own lives. Taking examples from science and technology, politics, decorative arts, military history, ethnic heritage, popular culture and everyday life, the authors provide historical context for the work of the Smithsonian and shed new light on what is important, and who is included, in American history. Throughout its history, Lubar and Kendrick conclude, the museum has played a vital role in both shaping and reflecting America's sense of itself as a nation.From the Hardcover edition.",
        "Category": " History , United States , General",
        "Publisher": "Smithsonian, 2001",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Studio Tips for Artists and Graphic Designers",
        "Authors": "By Bill Gray",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Justice Rehnquist and the Constitution (Princeton Legacy Library)",
        "Authors": "By Davis, Sue",
        "Description": "This analysis of the decision making of William H. Rehnquist from the beginning of his tenure as an Associate Justice of the United States Supreme Court in 1971 until he was nominated to be Chief Justice in 1986 presents a refreshing new perspective on the Burger Court's most conservative member. The common assessment of Rehnquist's career on the Supreme Court is that he has tried to put his own political agenda into effect--deciding as he wishes and justifying it later. Davis disputes that view through careful, insightful analysis of his opinions, his votes, and his public speeches. She argues that Rehnquist does, indeed, have a judicial philosophy--one that has legal positivism at its core. By examining the interaction between the facets of that judicial philosophy and Rehnquist's particular ordering of values, Davis reveals the coherence of his decision making.The author finds that Rehnquist's hierarchy of values gives paramount importance to state autonomy, or the \"new federalism.\" He sees the protection of private property as secondary to the significance of federalism, followed, finally, by the protection of individual rights.Originally published in 1989.The Princeton Legacy Library uses the latest print-on-demand technology to again make available previously out-of-print books from the distinguished backlist of Princeton University Press. These editions preserve the original texts of these important books while presenting them in durable paperback and hardcover editions. The goal of the Princeton Legacy Library is to vastly increase access to the rich scholarly heritage found in the thousands of books published by Princeton University Press since its founding in 1905.",
        "Category": " Political Science , General",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Butterfly Buddies",
        "Authors": "By Sims, Blanche (ILT) and Cox, Judy",
        "Description": "Robin feels so ordinary next to the new girl in her third-grade class. How can Robin impress Zoey who has pierced ears, wears tap shoes, and speaks French? She’s sure a cool girl like Zoey wouldn’t want to be her best friend. Robin’s excited when their teacher Miss Wing makes the girls partners for the butterfly project. But what if she blows her big chance at being best buddies?",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Disaster Science",
        "Authors": "By Klutz, Inc. (EDT)",
        "Description": "Discusses the forces behind such disasters as volcanoes, tornadoes, hurricanes, earthquakes, mudslides and avalanches, floods, tidal waves, and crashes, reveals their effects, and describes methods of dealing with them",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Klutz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "After the Storm : True Stories of Disaster and Recovery at Sea",
        "Authors": "By Rousmaniere, John",
        "Description": "An exploration of loss and survival by one of America's finest nautical writersAfter the Storm is John Rousmaniere's most ambitious work ever, the unique expression of a master storyteller and authority on seamanship who has survived storms at sea. Each of the book's stories of seafaring disaster­­many little known, all exciting and of deep human interest­­presents a broad human drama. Rousmaniere tells of the hopes and choices that put these sailors in harm's way. He takes readers into the gales themselves with authoritative knowledge of horrific weather and the split-second decisions that seamen must make. Finally, he explores the consequences of these disasters for survivors, rescuers, families, communities, and in some cases nations. The pursuit of these elusive strands leads the reader deep into our ambivalent relationship with the sea as both \"destroyer and preserver.\"",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "International Marine/Ragged Mountain Press",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Black Stallion Mystery",
        "Authors": "By Farley, Walter",
        "Description": "The arrival of three strikingly handsome colts in the U. S. leads Alec Ramsey to believe that the sire of his world-famous black stallion is still alive. Reprint.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Size 14 Is Not Fat Either (Heather Wells Mysteries, 2)",
        "Authors": "By Cabot, Meg",
        "Description": "Former pop star Heather Wells has settled nicely into her new life as assistant dorm director at New York College—a career that does not require her to drape her size 12 body in embarrassingly skimpy outfits. She can even cope (sort of) with her rocker ex-boyfriend's upcoming nuptials, which the press has dubbed The Celebrity Wedding of the Decade. But she's definitely having a hard time dealing with the situation in the dormitory kitchen—where a cheerleader has lost her head on the first day of the semester. (Actually, her head is accounted for—it's her torso that's AWOL.)Surrounded by hysterical students—with her ex-con father on her doorstep and her ex-love bombarding her with unwanted phone calls—Heather welcomes the opportunity to play detective . . . again.  If it gets her mind off her personal problems—and teams her up again with the gorgeous P.I. who owns the brownstone where she lives—it's all good. But the murder trail is leading the average-sized amateur investigator into a shadowy world. And if she doesn't watch her step, Heather will soon be singing her swan song!",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Red Hat Club",
        "Authors": "By Haywood Smith",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Wonder Book of Air: A novel",
        "Authors": "By Shearer, Cynthia",
        "Description": "The Wonder Book of the Air leads us through the lives of three generations in a Southern family.At the center is Harrison Durrance, who learns early that the nature of love is both transaction and transgression. As a young man he comes into his own during World War II, where he falls for the magic of flight and thrives on the danger of battle. He has become a man of undeniable magnetism, brash and vigorously optimistic. But when the war is over and he is back on the ground - in cold-war America - Harrison loses his bearings and catapults out of orbit. As his notions of the world begin to fail him and the people he claims to love fail to understand him, he sabotages his career, drinks to excess, and drives his family into emotional bedlam. But the story is not Harrison's alone.In Cynthia Shearer's arresting vision, the turbulence Harrison creates is woven into a canvas that captures the seismic shifts of history, of change, of forces that we try to name to protect ourselves from their randomness. In the wake of Harrison's terrifying-and-terrified behavior, we watch his children search for hope in the emotional wreckage and find some understanding of solace, compassion, and love.",
        "Category": " Fiction , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Can't Get Enough: A Novel (P.G. County Series)",
        "Authors": "By Briscoe, Connie",
        "Description": "The  memorable men and women of P.G. County are back in Connie Briscoe’s  wickedly funny and deliciously daring novel of romance and betrayal,  dangerous choices and seductive second chances.Barbara  Bentley, the grand dame of Prince George's County, an elite suburb in Washington D.C., is tentatively embarking on a  fresh approach to life. She's abandoning the alcohol that served to soften the  edges of her marriage to her bimbo-loving millionaire husband,  Bradford, and she’s been sober for nearly a year. Her part-time work as a  real estate agent has boosted her self-confidence, and the unexpected  attentions of a handsome young colleague have done wonders for her ego.  For Jolene, Bradford’s ambitious, conniving ex-mistress, the status she  covets remains tantalizingly out of reach. Her decent, hard-working  husband, Patrick, has left her for Pearl, a woman proud of her success  as a beauty shop owner and eager to create a loving home for Patrick and  his two teenage daughters. Meanwhile, royalty comes to Silver Lake in the  form of Veronique.  She’s rich, fabulous and everyone’s new friend. Or  is she? As the characters slip in and out of their Pratesi  sheets and stride into mayhem and misdeeds in their Jimmy Choo shoes, Can't Get Enough will hold readers spellbound.",
        "Category": " Fiction , Women",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "All You Need to Know About the Movie and TV Business",
        "Authors": "By Resnik, Gail and Trost, Scott",
        "Description": "From getting the necessary training and understanding the intricate responsibilities of everyone behind or in front of the camera to getting your first break and avoiding career-specific pitfalls, All You Need to Know About the Movie and TV Business leads you topic by topic through  * A breakdown of job descriptions, from casting directors and key grips to stunt coordinators and film editors * What kinds of deals actors, directors, writers, and producers make when they start out and when they hit the top * How to protect and sell your creative work * How movie deals are put together at studios and by independents * The nuts and bolts of a boilerplate contract * The notorious and mysterious world of profit participations, with a detailed explanation of why there's never any profit \"net profit\" deals  The entertainment industry can be an exciting, challenging landscape to negotiate. Having some valuable insight into how to make the most of your career in the movie or TV business can put you on the surest path to success.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Between, Georgia",
        "Authors": "By Jackson, Joshilyn",
        "Description": "Nonny Frett understands the meaning of the phrase \"inbetween a rock and a hard place\" better than any womanalive. She's got two mothers, \"one deaf-blind and theother four baby steps from flat crazy.\" She's got twomen: a husband who's easing out the back door; and abest friend, who's laying siege to her heart in her frontyard. And she has two families: the Fretts, who stole herand raised her right; and the Crabtrees, who won't forgethow they were done wrong. Now, in Between,Georgia, a feud that began the night Nonny was bornis escalating and threatening to expose family secrets.Ironically, it might be just what the town needs...if onlyNonny weren't stuck in between.",
        "Category": " Fiction , Literary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Russian Concubine (A Russian Concubine Novel)",
        "Authors": "By Furnivall, Kate",
        "Description": "A sweeping novel set in war-torn 1928 China, with a star-crossed love story at its center.  In a city full of thieves and Communists, danger and death, spirited young Lydia Ivanova has lived a hard life. Always looking over her shoulder, the sixteen-year-old must steal to feed herself and her mother, Valentina, who numbered among the Russian elite until Bolsheviks murdered most of them, including her husband. As exiles, Lydia and Valentina have learned to survive in a foreign land.  Often, Lydia steals away to meet with the handsome young freedom fighter Chang An Lo. But they face danger: Chiang Kai Shek's troops are headed toward Junchow to kill Reds like Chang, who has in his possession the jewels of a tsarina, meant as a gift for the despot's wife. The young pair's all-consuming love can only bring shame and peril upon them, from both sides. Those in power will do anything to quell it. But Lydia and Chang are powerless to end it.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Moms' Lifesavers: Tips to Help Make Life Easier for New Mothers",
        "Authors": "By Christine Cohen & Joanne Tocci",
        "Description": "",
        "Category": "",
        "Publisher": "Laurel Canyon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Senator's Other Daughter (Belles of Lordsburg #1)",
        "Authors": "By Bly, Stephen A.",
        "Description": "\"Everyone who is seriously interested in the pursuit of science becomes convinced that a spirit is manifest in the laws of the Universe--a spirit vastly superior to that of man, and one in the face of which we with our modest powers must feel humble.\" --Albert Einstein\"I am fascinated by some strange developments going on in astronomy,... The astronomical evidence leads to a biblical view of the origin of the world.\" --Robert Jastrow, director NASA's Goddard Institute for Space StudiesHave you ever looked up into the heavens at night--or felt a tiny baby grip your finger--and been filled with wonder?The world is filled with wonder everywhere we look. Who made all of this? Did it just happen? Or is there really a God who, as the Bible says, \"created the heaven and the earth\"?Can anyone really deny it? If you say there is no God, then all the wonders around you are just an accident. The billions of stars in the sky just happened to make themselves and generate their own power to keep on course. The land just happens to have topsoil without which nothing could grow. The air we breathe--only 50 miles deep and exactly the right composition to support life--is just another accident in the laws of physics.Can you believe these things just happened? Isn't it more reasonable to believe that a supreme mind is behind all of this and everything that exists? Take the deposits of coal, zinc, gold and uranium. Did they get there by accident? And what prevents lakes from freezing solid, all the way down to the bottom, making it impossible for fish to survive?Why does the earth spin at a given speed without slowing up so that we have day and night? Who tilts it so that we get seasons? No one really knows the why and how of the magnetic pulls. Or think of the sun stoking a fire just warm enough to sustain us on earth, but not hot enough to fry us or cold enough to freeze us. Who keeps the fire constant?And what about the human body--an intricate combination of bones, muscles, nerves and blood vessels. The human brain has far greater capacity than any computer we have ever imagined. The kidneys contain approximately 280 miles of tiny tubes, and in the course of a day filter 185 quarts of water from the blood.And then there is the heart, an unbelievably rugged organ: a four-chamber, four-valve pump that handles 5,000 gallons of blood a day--almost enough to fill a railroad tank car. It supplies a circulatory system with 12,000 miles of vessels and, in the course of a lifetime, beats two and one half billion times. All the blood in your body is pumped through your heart every minute while your heart beats 100,800 times a day.Before you say, \"There is no God,\" think of these marvels.All of creation gives evidence that there is a Creator. But why do people still doubt God's existence? How can we know that He really does exist and He is interested in us?The Bible says that we are by nature \"dead in trespasses\" and that we are \"alienated from the life of God\" (Ephesians 2:1; 4:18). Just as a body without physical life is declared physically dead, so anyone who is separated from God is described in the Bible as spiritually dead. And as long as we remain spiritually dead we can never really know God. We all need a new life. We need to be cleansed from sin and its penalty and restored to fellowship with God. This is what Jesus Christ meant when he said we \"must be born again\" (John 3:7).God sent Jesus Christ, His only Son, so that we might have new, everlasting life. The Bible tells us, \"God so loved the world, that He gave His only begotten Son, that whosoever believeth in Him should not perish, but have everlasting life\" (John 3:16).By His death and resurrection Jesus paid for our salvation. He broke the power of sin and death, making it possible for us to have everlasting life.Jesus said, \"I am come that they might have life, and that they might have it more abundantly\" (John 10:10). Receiving the new life that Jesus offers is what being born again means. And this new everlasting life will be yours if you will acknowledge you are a sinner and receive Him as your Savior and Lord.\"This is the record, that God hath given to us eternal life, and this life is in His Son. He that hath the Son hath life; and he that hath not the Son of God hath not life\" (1 John 5:11-12).Is Jesus Christ your Savior? Have you ever been born again? You can be right now by praying and asking Christ to come into your life.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Crossway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Any Human Heart",
        "Authors": "By Boyd, William",
        "Description": "The intimate journals of Logan Mountstuart--author, spy, and man of the world--chronicle his eight-five years of life, from his boyhood in Montevideo, Uruguay, to his education at Oxford and the publication of his first book, to his wartime exploits as an agent for Naval Intelligence, to his career as an art dealer, to his serene retirement in France. Reader's Guide available. Reprint. 50,000 first printing.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Romantic Movement",
        "Authors": "By Botton, Alain De",
        "Description": "In The Romantic Movement, Alain de Botton explores the progress of a love affair from first meeting to breaking up, intercut with musings on the nature of art of love.  The relationship between Alice, an advertising executive, and Eric, a banker, is examined at every stage, supplemented by quizzes and line drawings by the author and commentary by a chorus of great philosophers, from Descartes to Plato to Aretha Franklin. The Romantic Movement will charm readers and lovers alike with wit, insight, and intelligence.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Picador",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Shadow of Doubt (Newpointe 911 Series #2)",
        "Authors": "By Blackstock, Terri",
        "Description": "A poisoned past. A bitter present. Is Celia a murderer … or a victim? Detective Stan Shepherd lies comatose in the hospital, a victim of arsenic poisoning. The Newpointe police have a suspect: Celia Shepherd, Stan’s wife. Celia is no stranger to such charges. When her first husband died of poisoning, a technicality scuttled the case against her and Celia got of scot-free. Now it looks like the same old story—only this time, the motive appears plain. An old flame has moved into town under circumstances bound to raise suspicion. And that’s just for starters. More evidence is gathering that can put Celia away for good. But attorney Jill Clark thinks the pieces of the puzzle fit together a bit too neatly. Either her client’s Christian faith is a sham or she’s the victim of a deadly frame-up—and the real killer is still afoot … Shadow of Doubt is book two in the Newpointe 911 series by award-winning novelist Terri Blackstock. Newpointe 911 offers taut, superbly crafted novels of faith, fear, and close-knit small-town relationships, seasoned with romance and tempered by insights into the nature of relationships, redemption, and the human heart. Look also for Private Justice, Line of Duty, Word of Honor, and Trial by Fire.",
        "Category": " Fiction , Religious",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Shipwreck: A Novel",
        "Authors": "By Begley, Louis",
        "Description": "A mesmerizing novel of deception and betrayal from the acclaimed author of Wartime Lies and About Schmidt.John North, a prize-winning American writer, is suddenly beset by dark suspicions about the real value of his work. Over endless hours and bottles of whiskey consumed in a mysterious café called L’Entre Deux Mondes, he recounts, in counterpoint to his doubts, the one story he has never told before, perhaps the only important one he will ever tell. North’s chosen interlocutor–who could be his doppelgänger–is transfixed by the revelations and becomes the narrator of North’s tale. North has always been faithful to his wife, Lydia, but when one of his novels achieves a special success, he allows himself a dalliance with Léa, a starstruck young journalist. Coolly planning to make sure that his life with Lydia will not be disturbed, North is taken off guard when Léa becomes obsessed with him and he with her elaborate erotic games. As the hypnotic and serpentine confession unfurls, we gradually discover the extraordinary lengths to which North has gone to indulge a powerful desire for self-destruction. Shipwreck is a daring parable of the contradictory impulses that can rend a single soul–narcissism and self-loathing, refinement and lust.From the Hardcover edition.",
        "Category": " Fiction , Psychological",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Touchpoints-Birth to Three",
        "Authors": "By Brazelton, T. Berry and Sparrow, Joshua D., M.D. (CON)",
        "Description": "From America's most beloved pediatrician comes the classic guide to a child's physical, emotional, and behavioral developmentAll over the U.S. and in over twenty countries around the world, Touchpoints has become required reading for anxious parents of babies and small children. T. Berry Brazelton's great empathy for the universal concerns of parenthood, and honesty about the complex feelings it engenders, as well as his uncanny insight into the predictable leaps and regressions of early childhood, have comforted and supported families since its publication in 1992. In this completely revised edition Dr. Brazelton introduces new information on physical, emotional, and behavioral development. He also addresses the new stresses on families and fears of children, with a fresh focus on the role of fathers and other caregivers. This updated volume also offers new insights on prematurity, sleep patterns, early communication, toilet training, co-sleeping, play and learning, SIDS, cognitive development and signs of developmental delay, childcare, asthma, a child's immune system, and safety. Dr. Sparrow, Brazelton's co-author on several other books, brings a child psychiatrist's insights into the many perennial childhood issues covered in this comprehensive book. No parent should be without the reassurance and wisdom Touchpoints provides.",
        "Category": " Social Science , Children's Studies",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Many Adventures of Winnie the Pooh: A Classic Disney Treasury",
        "Authors": "By Walt Disney Productions (COR) and Milne, A. A. (EDT)",
        "Description": "For the first time ever, all of the classic Winnie the Pooh stories from the popular animated films have been collected together in this gorgeous and charming treasury.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Two of a Kind #13: War of the Wardrobes",
        "Authors": "By Stine, Megan",
        "Description": "Asheley can't believe it. White Oak Academy is going to require the students to wear uniforms--and its all her fault! Ahsley wrote an article about dress codes for the school newspaper, and everyone is talking about it. her sister, Mary-Kate, doesn't think uniforms are such a bad idea. In fact, they'd make life a whole lot simpler. But she knows Ashley dreads a fashionless future. Now, Mary-Kate and Ashley have to devise a brilliant plan to ban the uniforms--and fast!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "HarperEntertainment",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Cat in My New Christmas Hat & Other Stories: Featuring Six New \"Miss Lillie\" Stories About Life on the Farm in the 1930s",
        "Authors": "By Forester, Naomi M.",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "PublishAmerica",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Arthur and George",
        "Authors": "By Barnes, Julian",
        "Description": "With a mixture of detailed research and imagination, this is a novel in which the events of a hundred years ago set off contemporary echoes, a novel about low crime and high spirituality, guilt and innocence, identity, nationality and race; about what we think, what we believe, and what we know.",
        "Category": " Fiction , Historical",
        "Publisher": "Jonathan Cape",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Holt Spanish Level One VEN CONMIGO: Alternative Assessment Guide",
        "Authors": "By Catherine Dallas Purdy",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "American Girls Collection, Book 4: Happy Birthday, Josefina!: A Springtime Story",
        "Authors": "By Tripp, Valerie, Tibbles, Jean-Paul (ILT), and McAliley, Susan",
        "Description": "Josefina hopes to become a \"curandera\" or healer like Ti+a7a Magdalena, and she is tested just before her tenth birthday when her Pueblo Indian friend Mariana receives a potentially fatal snakebite. Simultaneous.",
        "Category": " Juvenile Fiction , Lifestyles , Farm & Ranch Life",
        "Publisher": "American Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Josefina Saves The Day (American Girl Collection)",
        "Authors": "By Tripp, Valerie and Tibbles, Jean-Paul (ILT)",
        "Description": "In 1825 Santa Fe, when Josefina trusts a trader named Patrick with an important deal, she makes a surprising discovery about this friendly young American who leaves town without paying her. Simultaneous.",
        "Category": " Juvenile Fiction , People & Places , General",
        "Publisher": "American Girl",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Baltimore orioles (A Science I can read book)",
        "Authors": "By Brenner, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Maggie: A Girl of the Streets and Other Writings About New York (Barnes & Noble Classics Series)",
        "Authors": "By Crane, Stephen and Tine, Robert",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RMaggie: A Girl of the Streets and Other Writings about New York&&L/I&&R, by &&LB&&RStephen Crane&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RWritten before but published after &&LI&&RThe Red Badge of Courage&&L/I&&R, &&LSTRONG&&RStephen Crane&&L/B&&R’s &&LI&&RMaggie: A Girl of the Streets&&L/I&&R offers a stark image of the underbelly of urban American life at the end of the nineteenth century. Maggie Johnson, a lovely innocent too slight to carry the weight of poverty, dreams of escaping New York’s Bowery and the casual cruelty of her alcoholic family. After her younger brother dies, she runs off with Pete, a bartender with pretensions to wealth and culture. But Pete himself is easily seduced by the seemingly sophisticated Nellie, and Maggie finds herself abandoned in the unforgiving metropolis.&&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RPublishers feared that Crane’s portrait of brutal fathers swilling away their lives in cheap bars, drunken mothers raging at terrified children, and ruined young women walking the streets, would be more than their readers could bear. But Crane’s impressionistic style and thematic intensity won the day, and &&LI&&RMaggie&&L/I&&R—the author’s favorite among his works—helped to shape the writers that followed him and begin the era of literary naturalism.&&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RThis edition also includes the short novel George’s Mother, plus “A Night at the Millionaire’s Club,” “Opium’s Varied Dreams,” “When a Man Falls, a Crowd Gathers,” and several other of Crane’s masterful short stories.&&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&RRobert Tine&&L/B&&R&&L/B&&R is the author of six novels, including &&LI&&RState of Grace and Black Market&&L/I&&R. He has written for a variety of periodicals and magazines—from the &&LI&&RNew York Times&&L/I&&R to &&LI&&RNewsweek&&L/I&&R.&&L/P&&R&&L/DIV&&R",
        "Category": " Fiction , Classics",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Journey from the Land of No: A Girlhood Caught in Revolutionary Iran",
        "Authors": "By Hakakian, Roya",
        "Description": "From the Hardcover“We stormed every classroom, inscribed our slogans on the blackboard . . . Never had mayhem brought more peace. All our lives we had been taught the virtues of behaving, and now we were discovering the importance of misbehaving. Too much fear had tainted our days. Too many afternoons had passed in silence, listening to a fanatic’s diatribes. We were rebelling because we were not evil, we had not sinned, and we knew nothing of the apocalypse. . . . This was 1979, the year that showed us we could make our own destinies. We were rebelling because rebelling was all we could do to quell the rage in our teenage veins. Together as girls we found the courage we had been told was not in us.”In Journey from the Land of No Roya Hakakian recalls her childhood and adolescence in prerevolutionary Iran with candor and verve. The result is a beautifully written coming-of-age story about one deeply intelligent and perceptive girl’s attempt to ï¬?nd an authentic voice of her own at a time of cultural closing and repression. Remarkably, she manages to re-create a time and place dominated by religious fanaticism, violence, and fear with an open heart and often with great humor.Hakakian was twelve years old in 1979 when the revolution swept through Tehran. The daughter of an esteemed poet, she grew up in a household that hummed with intellectual life. Family gatherings were punctuated by witty, satirical exchanges and spontaneous recitations of poetry. But the Hakakians were also part of the very small Jewish population in Iran who witnessed the iron fist of the Islamic fundamentalists increasingly tightening its grip. It is with the innocent confusion of youth that Roya describes her discovery of a swastika—“a plus sign gone awry, a dark reptile with four hungry claws”—painted on the wall near her home. As a schoolgirl she watched as friends accused of reading blasphemous books were escorted from class by Islamic Society guards, never to return. Only much later did Roya learn that she was spared a similar fate because her teacher admired her writing.Hakakian relates in the most poignant, and at times painful, ways what life was like for women after the country fell into the hands of Islamic fundamentalists who had declared an insidious war against them, but we see it all through the eyes of a strong, youthful optimist who somehow came up in the world believing that she was different, knowing she was special. At her loneliest, Roya discovers the consolations of writing while sitting on the rooftop of her house late at night. There, “pen in hand, I led my own chorus of words, with a melody of my own making.” And she discovers the craft that would ultimately enable her to find her own voice and become her own person.A wonderfully evocative story, Journey from the Land of No reveals an Iran most readers have not encountered and marks the debut of a stunning new talent.",
        "Category": " Religion , Judaism , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Top Girls",
        "Authors": "By Churchill, Caryl",
        "Description": "Marlene hosts a dinner party in a London restaurant to celebrate her promotion to managing director of 'Top Girls' employment agency. Her guests are five women from the past: Isabella Bird (1831- 1904) - the adventurous traveller; Lady Nijo (b1258) - the mediaeval courtesan who became a Buddhist nun and travelled on foot through Japan; Dull Gret, who as Dulle Griet in a Bruegel painting, led a crowd of women on a charge through hell; Pope Joan - the transvestite early female pope and last but not least Patient Griselda, an obedient wife out of Chaucer's Canterbury Tales. As the evening continues we are involved with the stories of all five women and the impending crisis in Marlene's own life. A classic of contemporary theatre, Churchill's play is seen as a landmark for a new generation of playwrights. It was premiered by the Royal Court in 1982.\"Top Girls has a combination of directness and complexity which keeps you both emotionally and intellectually alert. You can smell life, and at the same time feel locked in an argument with an agile and passionate mind.\" (John Peter, Sunday Times)",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Methuen Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "New York Minute: The Secret of Jane's Success (Mary-Kate & Ashley Olsen)",
        "Authors": "By Fox, Emily (CRT) and Adams, Kylie",
        "Description": "The secret of Jane's success...Jane's three-step wish list: First, volunteer on a senator's campaign.Next, get elected student body president.Then, win a scholarship to Oxford University.Easy, right? But what will Jane do when she uncovers a scandal, falls in love with her presidential opponent and, thanks to Roxy, ends up in trouble with the police?",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "HarperEntertainment",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Arthur and the Big Blow-Up",
        "Authors": "By Brown, Marc",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown Children's Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Madame Amelia Tells All",
        "Authors": "By Moss, Marissa",
        "Description": "Quizzes, analyses, and games in the handwriting of a nine-year old reveals fortunes, future careers, spirit names, and personality.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Heart to Heart (Madison Finn #11)",
        "Authors": "By Dower, Laura",
        "Description": "What gives? The Far Hills Junior High Winter Jubilee sounds like fun, until kids in chorus start giving Madison the cold shoulder. Even worse, Mom and Dad's relationship is in a deep freeze. Can volunteering at a local nursing home help Madison turn all this ice...into nice? It'll take more than a little mistletoe to get everyone back in the holiday spirit!",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Volo",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Bit the Jackpot (Vegas Vampires, Book 2)",
        "Authors": "By McCarthy, Erin",
        "Description": "The USA Today bestselling author of High Stakes returns to Vegas, where falling for a vampire isn't such a long shot.  Politics make strange coffinfellows...  Vampire Seamus Fox is supposed to be the campaign manager for a Vampire Nation presidential candidate. Instead, he finds himself running around Vegas keeping tabs on the candidate's wife and female entourage.  Seamus has had his fill of women: a disastrous and deadly love affair has haunted him for over two centuries. Talk about baggage. But suddenly he finds himself obsessed with a mysterious stripper who dances behind a screen. The sultry yet shy Cara Kim whets his appetite for more, but leave it to Seamus to fall fangs over feet for that rarest of Vegas attractions-a good girl.  After a sudden run-in on the street, though, they may soon have a lot more in common...",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley Sensation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Wine-Dark Sea (Aubrey/Maturin Novels, 16) (Book 16)",
        "Authors": "By O'Brian, Patrick",
        "Description": "At the outset of this adventure filled with disaster and delight, Jack Aubrey and Stephen Maturin pursue an American privateer through the Great South Sea. The strange color of the ocean reminds Stephen of Homer's famous description, and portends an underwater volcanic eruption that will create a new island overnight and leave an indelible impression on the reader's imagination.Surprise",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Happy Thanksgiving (Robin Hill School Ready-to-Read, Level 1)",
        "Authors": "By Gordon, Mike (ILT) and McNamara, Margaret",
        "Description": "Mrs. Connor's class celebrates Thanksgiving in this Level 1 Ready-to-Read!Thanksgiving time is here, and Mrs. Connor's class is dressing up to celebrate. When the fire alarm goes off, they share their Thanksgiving cheer with the whole school!  Ready-to-read books offer children a world of possibilities at four different reading levels: Pre-Level One: Recognizing Words -Word repetition -Familiar words and phrases -Simple sentences  Level One: Starting to Read -Simple stories -Increased vocabulary -Longer sentences  Level Two: Reading Independently -More-complex stories -Varied sentence structure -Paragraphs and short chapters  Level Three: Reading Proficiently -Rich vocabulary -More-challenging stories -Longer chapters",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Listening to the Littlest",
        "Authors": "By Reardon, Ruth",
        "Description": "",
        "Category": "",
        "Publisher": "Peggy Pinson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "All About Elk (Hunter's Information Series)",
        "Authors": "By Lapinski, Mike",
        "Description": "",
        "Category": "",
        "Publisher": "North American Hunting Club",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Been There, Done That : A Novel",
        "Authors": "By Lee, Darrien",
        "Description": "In Darrien Lee's much-anticipated sequel to All That and a Bag of Chips, readers meet up again with Craig Bennett, who is still wary of love even years after his affair with Venice Taylor.  This compelling continuation of the Craig Bennett and Venice Taylor saga reveals Craig to be still smarting from Venice's decision to marry her high school sweetheart despite the passion she and Craig shared during their college romance. Devastated by the loss, Craig has dedicated himself to building his company, Bennett Architectural, Inc., into a multimillion-dollar empire and rising to career success. However, his personal life is not quite as fruitful -- even though he has had several meaningless flings with beautiful, intelligent women -- due to the impenetrable wall of regret preventing him from reaching out to another woman. As fate would have it, Craig finds himself faced with a challenge that tests his will, trust, and capacity to love and forces him to confront the issues that have been plaguing him for the past seven years.  In Been There, Done That Darrien Lee crafts a fascinating novel complete with intricate relationships, life-changing decisions, and painful matters of the heart.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Strebor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Give and Take (Madison Finn #10)",
        "Authors": "By Dower, Laura and Power, Stephanie (ILT)",
        "Description": "There's double trouble at Far Hills Junior High! When Madison and Fiona start a friendly competition with Egg and Chet to see who can make the best Web page, the computer disks really start to fly!",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Volo",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Don't Go to the Cosmetics Counter Without Me, 7th Edition",
        "Authors": "By Begoun, Paula",
        "Description": "This well-organized, authoritative book helps women find products that make them look great without spending a fortune. From drugstores and home shopping to department stores and catalogs, Paula Begoun reviews all the major cosmetic and skin-care lines, product by product, with more than 30,000 total. Regardless of cost, there are good and bad products in almost every line, and with the turn of a page, readers can get concise reviews and fast answers. A user-friendly rating system makes it easy to find items worth trying.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Beginning Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Every Woman's Guide to Eating During Pregnancy",
        "Authors": "By Shulman, Martha Rose and Davis, Jane L.",
        "Description": "From a best-selling cookbook author and a nationally respected ob-gyn, a book that makes eating well during pregnancy easier than everNow that you're pregnant, what you eat is more important than ever before. You may be nauseous or starving or alternately one and the other, and your tastes may change constantly. Whatever your condition, whether you're twenty-seven or forty-seven, and whether you love cooking or hate it, Every Woman's Guide to Eating During Pregnancy gives you all the practical information and tips you need to keep you and your baby healthy. It includes • suggestions for coping with nausea and heartburn • ideas on how to make your cravings work for you • a clear explanation of your changing nutritional needs by trimester • a week's worth of flexible meal programs, with plenty of ideas for nutritious breakfasts, lunches, dinners, and snacks:    lower-carb, high-protein plans for weight control    higher-carb, high-protein plans      ovo-lacto and vegan plans    plans for women who don't want to cook, including a list of healthful packaged foods from the supermarket    calcium-rich menus for the lactose-intolerant    plans for women who are expecting multiples    plans for women with gestational diabetes    plans for each trimester • 100 easy, nourishing recipes, including Buttermilk Pancakes, High-Protein Muffins, Mediterranean Chicken Stew, Pasta with Tomato-Mushroom Sauce, and Chocolate Pudding",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Rux Martin/Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Nostradamus: The Man Who Saw Through Time",
        "Authors": "By McCann, Lee",
        "Description": "Fascinating glimpse into the life and career of the enigmatic physician whose books of prophecy have intrigued readers since their publication in the 16th century.  Presents modern interpretations of his most astonishing prophecies-many imminent in the next ten years!  This has been a huge bestseller.  448 pages.",
        "Category": " Body, Mind & Spirit , Prophecy",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "JUST BETWEEN GIRLFRIENDS: African-American Women Celebrate Friendship",
        "Authors": "By Coleman, Chrisena",
        "Description": "In a busy world in which we often juggle our careers, families, and everything else that comes at us, who makes us laugh, wipes our tears, and still manages to always come through in a pinch? Only a true friend.  In Just Between Girlfriends, Chrisena Coleman shares stories of famous friends and everyday friends, old friends and new friends, best friends and lost friends, soul mates and confidantes. She captures the soul-filled flavor of African-American culture, which resonates with themes of acceptance, strength, loyalty, and love. Inspirational and sprinkled with humor, this collection contains a cast of unforgettable friends. Find everlasting friendship in the middle of a snowstorm with Gayle King and Oprah Winfrey: flip out with Dominique Dawes, Crystal Bennett, and Umme Salim; discover solidarity and sisterhood with Dr. Betty Shabazz, Myrlie Evers-Williams, and Coretta Scott King.  Along with charming line drawings, more wise words and anecdotes about how to spot a true-blue girlfriend are sprinkled throughout the book. And to nourish the seed that these tales have planted, there's a calendar of girl-friends-only get-togethers. For every month of the year, Coleman has devised a creative plan to make room for some quality time and to let loose -- there are ideas for a pity party, for how to make spring cleaning fun, and a New Year's Eve Gong Show.  Just Between Girlfriends is a treasured keepsake. The ideal gift for an old friend, a new friend, a rediscovered friend, or a distant friend, this collection will be savored for years to come as a joyful celebration of the strength, humor, and beauty that mark African-American women. You'll be inspired to reach out to your old girlfriends, hug the steadfast ones who are always by your side, and make some new ones.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Happiness Digest",
        "Authors": "By E.G. White",
        "Description": "",
        "Category": "",
        "Publisher": "Hagerstown, MD, U.S.A. : Review & Herald Publishing Association, 1994",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Summer Pleasures: Second NatureOne Summer",
        "Authors": "By Roberts, Nora",
        "Description": "Second NatureGetting an exclusive interview with notoriously reclusive horror writer Hunter Brown was all Celebrity magazine reporter Lee Radcliffe ever wanted. And when Hunter agrees to the interview on the condition that Lee conduct it on a camping trip, she can hardly refuse. But after spending some time alone with the seductively mysterious author, Lee discovers the only thing she wants exclusively is Hunter. One SummerA summer spent traveling across America with cynical, brooding photojournalist Shade Colby was not Celebrity photographer Bryan Mitchell's idea of a dream assignment. But Bryan will have to manage for an entire summer if she wants the fabulous cross-country photo shoot for a book, which they're both salivating over. However, Bryan and Shade disagree about everything&#151;everything, that is, except the fierce attraction they have for each other&#133;.",
        "Category": " Fiction , Literary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Forgiven (Firstborn Series-Baxter 2, Book 2)",
        "Authors": "By Kingsbury, Karen",
        "Description": "Karen Kingsbury has skyrocketed to the top of the CBA charts. With Forgiven, she brings readers the second book in her life-changing Firstborn series.A-list Hollywood actor Dayne Matthews wrestles with the shocking information he learned about his past in Karen's best-selling novelReunion. Now Dayne must come to terms with the reality of his situation and find both forgiveness and family along the way.",
        "Category": " Fiction , Religious",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Family (Firstborn Series-Baxter 2, Book 4)",
        "Authors": "By Kingsbury, Karen",
        "Description": "In the wake of finding his firstborn son, John Baxter looks for a way to tell his other children the truth about a secret he's kept from them all their lives. At the same time, a sensational Hollywood trial brings Dayne Matthews and Katy Hart together again, this time in a very public way. Just when love might have the chance to win, doubts and presumed scandals place them farther apart than ever. In the midst of this crisis, the truth is clear for all of them—never in their lives has family been more important.",
        "Category": " Fiction , Religious",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "7.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The City of Florence",
        "Authors": "By Lewis, R. W. B.",
        "Description": "A New York Times Notable BookIn this deeply personal and learned labor of love, R.W.B. Lewis provides a new look at the glories of Florence, the smallish Tuscan city which has been a prime source for modern Western culture and which has also been his second home for fifty years. With a scholar's eye and a lover's passion, he invites us to share his vision of a city and the way of life it has engendered and inspired.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Maine Off the Beaten Path, 5th: A Guide to Unique Places (Off the Beaten Path Series)",
        "Authors": "By Curtis, Wayne",
        "Description": "",
        "Category": " Travel , United States , Northeast , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Mount Vernon: The Story of a Shrine: An Account of the Rescue and Continuing Restoration of George Washington's Home",
        "Authors": "By Johnson, Gerald White",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Mount Vernon Ladies Assn of the",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Many Deadly Returns (Henry Tibbett Mysteries)",
        "Authors": "By Moyes, Patricia",
        "Description": "Officer Tibbett investigates the death of Lady Crystal Balaclava who succumbs to an apparent heart attack shortly after receiving her birthday presents",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Christmas Night Murder (Christine Bennett Mysteries)",
        "Authors": "By Harris, Lee",
        "Description": "A Christine Bennett Mystery.A cheerful Christmas party at St. Stephen's Convent is spoiled when the guest of honor, Father Hudson McCormick, fails to arrive. Worried Sister Joseph asks Christine Bennet, a former St. Stephen' s nun, to investigate. Now every signpost points Christine into the past -- to a troubled young woman who committed suicide and a once-prominent family that has vanished as mysteriously as Father McCormick himself . . .",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Wee Sing Silly Songs (Book Only)",
        "Authors": "By Beall, Pamela Conn and Nipp, Susan Hagen",
        "Description": "",
        "Category": " Juvenile Fiction , Performing Arts , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "A Thread of Grace: A Novel",
        "Authors": "By Russell, Mary Doria",
        "Description": "Set in Italy during the dramatic finale of World War II, this new novel is the first in seven years by the bestselling author of The Sparrow and Children of God.It is September 8, 1943, and fourteen-year-old Claudette Blum is learning Italian with a suitcase in her hand. She and her father are among the thousands of Jewish refugees scrambling over the Alps toward Italy, where they hope to be safe at last, now that the Italians have broken with Germany and made a separate peace with the Allies. The Blums will soon discover that Italy is anything but peaceful, as it becomes overnight an open battleground among the Nazis, the Allies, resistance fighters, Jews in hiding, and ordinary Italian civilians trying to survive.Mary Doria Russell sets her first historical novel against this dramatic background, tracing the lives of a handful of fascinating characters. Through them, she tells the little-known but true story of the network of Italian citizens who saved the lives of forty-three thousand Jews during the war’s final phase. The result of five years of meticulous research, A Thread of Grace  is an ambitious, engrossing novel of ideas, history, and marvelous characters that will please Russell’s many fans and earn her even more.From the Hardcover edition.",
        "Category": " Fiction , Coming of Age",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Danger on Cue",
        "Authors": "By Rebecca Holland",
        "Description": "",
        "Category": "",
        "Publisher": "Raven House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Smart Love: The Compassionate Alternative to Discipline That Will Make You a Better Parent and Your Child a Better Person",
        "Authors": "By Pieper, Martha Heineman and Pieper, William J.",
        "Description": "No parent wants to be a disciplinarian, but most fear that the only alternative is permissiveness.  Not so, says Drs. Martha and William Pieper, the husband-wife team, parents of five themselves, who have written this revolutionary new volume based on years on groundbreaking research.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The World's Healthiest Food",
        "Authors": "By Marshall, Anne E., Wymant, Phil (PHT), Johnson, Peter (PHT), Kelly, Carolyn, and Olds, Margaret",
        "Description": "The World's Healthiest Food is a triumphant culinary celebration of all that is healthy yet delicious to eat and beautiful to serve to your family, friends and guests. These choice recipes have been culled from cuisines around the world and reworked under guidelines endorsed by the American Heart Association. Spectacularly photographed, these dishes are all low in fat, cholesterol, sodium and calories.All recipes contain explanatory notes and sidebars with an extensive nutritional analysis of each dish. Two informative chapters discuss nutrition and offer helpful dietary tips. Also included is an extensive glossary and a cross-referenced index.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Washington on foot: 23 walking tours of Washington, D.C., Old Town Alexandria, Virginia, and historic Annapolis, Maryland",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Smithsonian Institution Press",
        "Price Starting With ($)": "7.39",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Patriots: The Men Who Started the American Revolution",
        "Authors": "By Langguth, A. J.",
        "Description": "With meticulous research and page-turning suspense, Patriots brings to life the American Revolution—the battles, the treacheries, and the dynamic personalities of the men who forged our freedom.George Washington, John Adams, Samuel Adams, Ben Franklin, Thomas Jefferson, Patrick Henry—these heroes were men of intellect, passion, and ambition. From the secret meetings of the Sons of Liberty to the final victory at Yorktown and the new Congress, Patriots vividly re-creates one of history's great eras.",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Hats in the Ring: An Illustrated History of American Presidential Campaigns",
        "Authors": "By Whelan, Richard and Cornog, Evan",
        "Description": "\"America suffers from a sort of intermittent fever. . . . Every fourth year there come terrible shakings, passing into the hot fit of the presidential election; then follows what physicians call 'the interval'; then the fit again.\"                        --James Bryce,The American Commonwealth, 1888 Once every four years, Americans enter into a months-long national spectacle, one with bitter battles, high drama, often hilarious blunders, and, ultimately, a victor to whom we entrust the leadership of our country. It is a process integral to the American ideals of freedom and democracy, and each election reveals a tremendous amount about where and who we are as a nation. In Hats in the Ring, Evan Cornog and Richard Whelan have created a hugely entertaining, splendidly illustrated history of every election from Washington's to Clinton's. For the first time, all the vibrancy, fanfare, and zaniness of American presidential campaigns come to life in one dazzling volume.         Award-winning author Evan Cornog provides a lively narrative of the people, parties, and politics of more than two hundred years of history. Every engaging, pithy chapter is packed with fascinating information about the candidates and their campaigns. From the Wide Awakes to the Know-Nothings, fervent supporters and their candidates, including some of the greatest figures in American history--Washington, Jefferson, Lincoln, FDR--progress vividly through these pages.        The visual richness of the campaigns is brought to life with more than two hundred color and black-and-white illustrations, including portraits, leaflets, cartoons, photographs, posters, campaign buttons, and other memorabilia, all selected by the eminent cultural historian Richard Whelan. He has delved deep into public and private collections to find the defining images, both classic and unfamiliar, of each election. There are portraits of heroic men beside those of also-rans, moments of triumph and shame captured by the camera, hilarious cartoons and works of art created by many of the greatest American artists, from Gilbert Stuart to Ben Shahn, Thomas Nast to Herblock.        The chapter for each election provides a wonderful snapshot of United States history and culture. Short sidebars on important aspects of the development of American politics (including constitutional changes, third parties, and suffrage for blacks and women) complement the narrative throughout. There are also clear, concise charts that offer at-a-glance information on every election, including major-party candidates and electoral tallies.        Presidential campaigns have provided some of the most stirring moments, poignant images, and idiosyncratic characters in our nation's annals. No matter what your political leanings are, Hats in the Ring delivers a sparkling and invaluable tour though some of the greatest episodes in American history.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Inside the Walls of Alcatraz",
        "Authors": "By Heaney, Frank",
        "Description": "Traces the history of Alcatraz, describes the prisoners' daily life, and discusses demonstrations and attempted escapes",
        "Category": " Political Science , General",
        "Publisher": "Bull Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Bed & Breakfast in the Mid-Atlantic States: Delaware, Maryland, New Jersey, New York, North Carolina, Pennsylvania, Virginia, Washington D.C., West (BED AND BREAKFAST IN THE MID-ATLANTIC STATES)",
        "Authors": "By Chesler, Bernice",
        "Description": "",
        "Category": " Travel , Bed & Breakfast",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "10.72",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Smithsonian Guide to Historic America: Texas & the Arkansas River Valley (The Smithsonian guide to historic America)",
        "Authors": "By Gordon, Alice and Dunn, Jerry Camarillo",
        "Description": "",
        "Category": "",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Terrorist: A Novel",
        "Authors": "By Updike, John",
        "Description": "The terrorist of John Updike’s title is eighteen-year-old Ahmad Ashmawy Mulloy, the son of an Irish American mother and an Egyptian father who disappeared when he was three. Devoted to Allah and to the Qur’an as expounded by the imam of his neighborhood mosque, Ahmad feels his faith threatened by the materialistic, hedonistic society he sees around him in the slumping New Jersey factory town of New Prospect. Neither Jack Levy, his life-weary guidance counselor at Central High, nor Joryleen Grant, his seductive black classmate, succeeds in diverting Ahmad from what the Qur’an calls the Straight Path. Now driving a truck for a local Lebanese furniture store—a job arranged through his imam—Ahmad thinks he has discovered God’s purpose for him. But to quote the Qur’an: Of those who plot, God is the best.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Random House Rhyming Dictionary",
        "Authors": "By Stein, Jess (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1974"
        }
    },
    {
        "Title": "One Eyed Kings",
        "Authors": "By Cohen, William S.",
        "Description": "U.S. Senator Sean Falcone and reporter Philip Drake ponder Congressional committees and espionage while investigating the deaths of another Senator and the Israeli ambassador, both linked to a beautiful Mossad agent",
        "Category": " Fiction , General",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "119.95",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Biggest Loser: The Weight Loss Program to Transform Your Body, Health, and Life--Adapted from NBC's Hit Show!",
        "Authors": "By Greenwood-Robinson, Maggie and Harper, Bob (FRW)",
        "Description": "The book fans have been clamoring for—the diet and exercise plan that enabled contestants to transform their bodies and their lives on TV's new smash hit reality showThe Biggest Loser was NBC's surprise hit of the Fall 2004 television season, drawing a passionate audience and prompting people nationwide to start their own Biggest Loser competitions. This unscripted weight-loss drama was based on overweight contestants competing to lose weight and win a quarter of a million dollars with the help of a team of doctors, dietitians, and trainers Bob Harper and Jillian Michaels.On the evening that the first season's finale aired, legions of fans went to the NBC Web site to look for the diet and fitness plan that the contestants used. It wasn't available to the public—until now. With this book, people looking for change can accomplish the same type of radical makeover of their bodies, their health, and their lives that they saw on The Biggest Loser.The book features the food and fitness plans from Maggie Greenwood-Robinson, Cheryl Forberg, Michael Dansinger, and Biggest Loser Experts and Cast Staff, and motivational tips from the contestants themselves. The contestants' compelling stories and reasons for losing weight, dramatic before-and-after photos, and real-life advice provide the inspiration and upbeat attitude that made this show a smash hit.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Home Schooling Father: How You Can Play a Decisive Role in Your Child's Success",
        "Authors": "By Farris, Michael P.",
        "Description": "",
        "Category": " Religion , Christian Education , General",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Doing What Scientists Do: Children Learn to Investigate Their World",
        "Authors": "By Doris, Ellen",
        "Description": "Teachers and administrators wanting to make elementary science programs work will find out how in these pages.",
        "Category": " Education , Teaching Methods & Materials , Science & Technology",
        "Publisher": "Heinemann",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Gates of Mitzvah: Shaarei Mitzvah: A Guide to the Jewish Life Cycle",
        "Authors": "By Maslin, Simeon J. (EDT)",
        "Description": "",
        "Category": " Religion , Judaism , Rituals & Practice",
        "Publisher": "CCAR Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Teacher's Planbook and Calendar of Year-Round Activities (Troll Teacher Ideas Series)",
        "Authors": "By Dov, Dorothy and Bernstein, Alice",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Get Well, Good Knight (Penguin Young Readers, Level 3)",
        "Authors": "By Plecas, Jennifer (ILT) and Thomas, Shelley Moore",
        "Description": "The much-heralded Good Knight is back-only this time his three little dragon friends are sick in bed.  Their scaly foreheads are hot and their noses are drip-drip-dripping.  They feel awful.  The Good Knight comes to the rescue again!  He brings them some slimy, grimy soup from the wizard to make them feel better.  But the dragons wont touch it.  What is a Good Knight to do?",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "WWJD for Kidz: What Would Jesus Do for Kids - Great Bible Stories to Help Children Walk in Jesus' Steps",
        "Authors": "By Hollingsworth, Mary",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Right and Wrong: Basic Readings in Ethics",
        "Authors": "By Sommers, Hoff Christina",
        "Description": "",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Tales of Knock Your Socks Off Service: Inspiring Stories of Outstanding Customer Service (Knock Your Socks Off Series)",
        "Authors": "By Zemke, Ron and Anderson, Kristin",
        "Description": "",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Traveler's Gift: Seven Decisions that Determine Personal Success",
        "Authors": "By Andrews, Andy",
        "Description": "Coming Soon the Continuation of David Ponder’s Story in The Traveler’s SummitWhat makes the difference between failure and success?A New York Times, Wall Street Journal, USA Today, and Publisher’s Weekly bestseller, The Traveler’s Gift offered a modern-day parable of one man’s choices.Only a few months ago, David Ponder was a successful executive. Now he’s a desperate man. In times of great uncertainty, we need divine wisdom. Many of the greatest minds in history overcame personal struggles and adversity, and they emerged the stronger for it. What guidance would iconic heroes, such as Abraham Lincoln, King Solomon, and Anne Frank, give us today in our ever-changing climate of world events?Join David Ponder in The Traveler’s Summit on his incredible journey to discover the Seven Decisions for Success that can turn any life around, no matter how hopeless a situation may seem.The Traveler’s Gift became required reading for some of America’s high schools and a “life skills” tool for members of several college sports teams as well as some MLB and NFL franchises. Discover with David Ponder that attitude makes the difference between success and failure.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.98",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "A Course in Phonetics",
        "Authors": "By Ladefoged, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Piloting, Seamanship and Small Boat Handling, Chapmans Piloting Edition",
        "Authors": "By Chapman, Charles F.",
        "Description": "",
        "Category": "",
        "Publisher": "Motor Boating Sailing Bks",
        "Price Starting With ($)": "8.56",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Winnie the Pooh's Jingle Bells",
        "Authors": "By Disney Enterprises Inc",
        "Description": "",
        "Category": "",
        "Publisher": "Random House / Disney Enterprises",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Winnie the Pooh's Sweet Christmas",
        "Authors": "By Disney Enterprises",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Enterprises",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    }
]