[
    {
        "Title": "Wheel of Seasons",
        "Authors": "By Marsi, Rick",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Bufflehead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "The Icemen",
        "Authors": "By Morris, M. E.",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "No Bones About It (Ginger Barnes Main Line Mysteries)",
        "Authors": "By Murray, Donna Huston",
        "Description": "Is man's best friend also his deadliest enemy?The dog days of Bryn Derwyn Academy's summer holidays yawn ahead for Ginger Barnes-- headmaster's wife, mother of two teenagers and occasional detective. But the tedium is soon shattered when Dr. Karl Vogel, an elite Philadelphia diet guru, is found chewed to death right beside his bloody-mouthed German shepherd, Tibor. And his ex-wife Linda-- a dog trainer with whom he shared custody of the prized pet-- is arrested for programming Tibor to be a lethal weapon.Linda, denying everything, beseeches her old schoolmate Gin to save Tibor from being put down. But who else would murder the good doctor? To hound down the killer, Gin must investigate snarling patients, animal activists, a secretary fired for getting fat, canine teeth prints, and the devious, deadly patterns of the human mind.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Khrushchev : A Career",
        "Authors": "By Crankshaw, Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Viking",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Off the Map: The Curious Histories of Place-Names",
        "Authors": "By Nelson, Derek",
        "Description": "The names of places can reflect linguistic or ethnic conflicts; errors in boundary-setting and mapmaking; or the story of the exploration, conquest, or liberation of the area. The author's extensive discussion of the history of cartography notes the degree to which the discipline has been influenced by ignorance, mythic beliefs, greed, and politics. Includes numerous reproductions of old maps. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Kodansha Amer Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Order of Things: How Everything in the World Is Organized into Hierarchies, Structures, and Pecking Orders; Revised Edition",
        "Authors": "By Kipfer, Barbara Ann",
        "Description": "Explains the organization of three hundred hierarchies in the arts, business, history, religion, science, sports, and other fields",
        "Category": " Reference , Research",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Sea Turtles of the World (Worldlife Library)",
        "Authors": "By Ripple, Jeff",
        "Description": "Millions of sea turtles once roamed the earth’s oceans. Within the past five centuries, trade in sea turtle meat, eggs, shells, oil, and leather has driven almost every species to the brink of extinction. Explore the world of the sea turtle in this engaging book. Learn their general characteristics, how they navigate underwater, who their predators are, what human threats exist, and where conservation efforts are being made worldwide. Jeff Ripple profiles every species of sea turtle from the loggerhead to the leatherback. More than 60 breath-taking photographs capture these fascinating creatures underwater and on land.",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "Voyageur Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "My Boys Can Swim!: The Official Guy's Guide to Pregnancy",
        "Authors": "By David, Ian and Davis, Ian",
        "Description": "Finally—A Pregnancy Book That Won't Put Men to SleepMy Boys Can Swim! tells real men everything they really want to know about pregnancy, such as: How much is it going to cost? Why does your wife primp before seeing her doctor when she hasn't put a stitch of make-up on for you in months? And, most important, what's it going to do to your sex life? This rollicking, laugh-out-loud book is for expectant dads in search of bottom-line pregnancy information, without all that boring touchy-feely stuff you find in those books written for women. Inside you'll discover helpful—and hilarious—information and insights on such topics as: The Maternity Wardrobe: \"A key part of the maternity wardrobe is maternity underwear—parachute-like undies big enough to fit an NFL defensive lineman.\" Baby Names: \"Don't give your kids mockable names like Thaddeus, which is Greek for 'I'm a dork and should be beaten up.'\" The Birth: \"No one told me it's normal that babies' heads can be misshapen at birth. I was convinced that my wife gave birth to Veldar, the conehead.\"",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Sherlocks Logic",
        "Authors": "By Neblett, William",
        "Description": "",
        "Category": "",
        "Publisher": "Dorset House Publishing Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Round the Fire Stories",
        "Authors": "By Doyle, Arthur Conan, Sir",
        "Description": "A collection of 17 works of the great storyteller reprinted from the 1908 McClure Co. edition. These horror stories manifest the skill and ingenuity of the Holmes canon. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Chronicle Books Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Ravished",
        "Authors": "By Quick, Amanda",
        "Description": "From the cozy confines of a tiny seaside village to the glittering crush of a fashionable London soiree comes an enthralling tale of a thoroughly mismatched couple... poised to discover the rapture of love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "From Botswana to the Bering Sea: My Thirty Years With National Geographic",
        "Authors": "By Canby, Thomas Y.",
        "Description": "National Geographic has been called a window on the world and a passport to adventure. Each month an estimated forty million people in 190 countries open its pages and are transported to exotic realms that delight the eye and mind. Such widespread renown gives the magazine&#39;s writers an almost magical access to people and happenings, as doors that are closed to the rest of the journalistic world open wide.Thomas Y. Canby was fortunate to be a NationalGeographic writer and science editor from 1961 to 1991, a time during which the Society&#39;s ventures and size grew by leaps and bounds and the resources available to staff were seemingly limitless. In From Botswana to the Bering Sea, he gives readers an on-the-ground look at the life of a National Geographic field staffer and an insider&#39;s view of the fascinating dynamics within the magazine&#39;s editorial chambers.Canby&#39;s assignments dealt largely with issues of global concern, and his travels took him to the farthest reaches of the planet. This book gives the reader the visas and tickets to share in Canby&#39;s experiences -- from a Filipino rice harvest capped by a feast of deep-fried rats, to impoverished villages of Asia and Africa gripped by the world&#39;s most widespread famine, to seal hunting and dog sledding with Eskimos in the Canadian high Arctic. Readers match wits with paranoid guardians of the secret Soviet space program; skirt land mines in the flaming oil fields of Kuwait; and dodge death while scuba diving to an archaeological site in a Florida sinkhole. The book also gives insight into the magazine&#39;s inner workings: how article subjects are chosen; how writers are assigned and interact; how prolonged trips to impossibly remote destinations are planned; how staffers operate in the field.Working for National Geographic has been called \"the best job in the world.\" From Botswana to the Bering Sea describes that unique job, and answers from first-hand knowledge the question Canby and his colleagues are so often asked: \"So, what is it like to work for National Geographic?\"",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Island Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Gypsy Lord",
        "Authors": "By Martin, Kat",
        "Description": "He was Dominic Edgemont, Lord Nightwyck, heir to the Marquis of Gravenwold. But he was also a dark-eyed, half-gypsy bastard...When tall, handsome Dominic sees one of his Romany band whipping a beautiful, flame-haired captive, he never dreams she is a pampered heiress stolen fro the English court. To have her, he will pay a king's ransom and make himself her lord.Lovely Catrina forbids Dominic her bed, but her fiery temper is no match for his cool determination to take her as his lover. Still, she will not be passion's slave forever. She and her Gypsy Lord will meet again-in a glittering London setting, far from the rustic tent they shared. Will her desire for revenge overwhelm her natural urge to love?",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Highlander Unchained: A Novel (Macleods of Skye)",
        "Authors": "By McCarty, Monica",
        "Description": "Lachlan Maclean will do whatever it takes to protect his clan–even if it means abducting the most willful woman in the Highlands with the secret intention of wooing her for marriage. A born searing sensual leader possessing brute strength, and an imposing command, Lachlan is unprepared for the beautiful spitfire Flora MacLeod, who jeopardizes his plans to save his clan, and digs beneath his hard, chiseled exterior to expose a tenderness that may be his undoing.The greatest marriage prize in the Highlands, Flora is determined at all costs to avoid her mother’s fate of being bartered away as a political pawn. Vowing to make her captor pay for his ruthlessness, she boldly engages him in a battle of wills, sweetening the challenge with dangerous passion–even as the lingering curse and deadly ghosts of a past tragedy reach out to thwart a tender love that has yet to be spoken.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "View from the Eye of the Storm: Terror and Reason in the Middle East",
        "Authors": "By Harari, Haim",
        "Description": "In 2004, internationally known physicist Haim Harari was invited to address the advisory board of a major multinational corporation. In a short speech he offered a penetrating analysis of the components of terror, and presented a passionate call for a new era in the Middle East. The speech, entitled \"A View from the Eye of the Storm,\" was not intended for publication, but when a copy was leaked and posted onto the Internet, it caused a worldwide sensation, eventually being translated into more than half a dozen languages. Now—as the modern era of Islamic terror continues to unfold—Harari reaches further, to offer this serious yet accessible survey of the landscape of Middle Eastern war and peace at this challenging crossroads in history.Moving beyond the sterile discourse of foreign affairs journals, Harari encourages the world to view the Middle East through the eyes of a \"proverbial taxi driver,\" a man on the street whose wisdom (and sense of humor) outstrips that of the experts. And, as he observes, to anyone familiar with the Middle East from a taxi driver's perspective, the \"persistent ugly storm\" engulfing the Arab world is far more than a territorial battle with Israel: It is an \"undeclared World War III\" that rages from Bali to Madrid, from Nairobi to New York, from Buenos Aires to Istanbul, and from Tunis to Moscow. The sad result is that much of the Arab world has become an \"unprecedented breeding ground for cruel dictators, terror networks, fanaticism, incitement, suicide murders, and general decline.\" And unless the free nations of the world mobilize to stop it, Harari argues, this new world war will continue to cause bloodshed on all continents.As a fifth-generation Israeli-born observer, Harari includes a thorough response to the conventional wisdom about Middle Eastern affairs, including a frank dissection of the media's lopsided portrait of the Arab-Israeli conflict. Drawing on his family's two centuries of life in the Middle East, he offers a compelling catalog of the steps necessary to reach a lasting peace between Israel and the Palestinians—steps, he writes, that are \"inevitable—not because everybody accepts them today, but because all sides must accept them before peace can be achieved.\" And he urges the civilized world to combat terror by isolating its state sponsors, blocking its funding, and promoting education, women's equality, and human rights reform.Eloquent in its simplicity, written with passion, humor, and the directness of a scientist who has spent a lifetime explaining his work to the general public, A View from the Eye of the Storm is that rare book with the power to change hearts and minds.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "From conservation to ecology: The development of environmental concern, (Problem studies in American history)",
        "Authors": "By Pursell, Carroll W.",
        "Description": "",
        "Category": "",
        "Publisher": "Crowell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Makers of Nineteenth Century Culture: 1800-1914",
        "Authors": "By Wintle, Justin (EDT)",
        "Description": "This volume provides a critical examination of the lives and works of the leading novelists, poets, dramatists, artists, philosophers, social thinkers, mathematicians and scientists of the period. The subjects are assessed in the light of their cultural importance, and each entry is deliberately interpretative, making this work both an essential reference tool and an engaging collection of essays. Figures covered include: Marx, Wagner,Darwin, Malthus, Balzac, Jane Austen, Nietzsche, Babbage, Edgar Allan Poe, Ruskin, Schleiermacher, Herbert Spencer, Harriet Martineau and Oscar Wilde.",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Routledge Kegan & Paul",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "KnockOut: An FBI Thriller (FBI Thrillers)",
        "Authors": "By Coulter, Catherine",
        "Description": "Seven-year-old Autumn Backman needed a hero. When she saw Special Agent Dillon Savich on TV after he'd brought down bank robbers in a Georgetown bank, she knew she'd found him. She called Savich, but she didn't use the phone.\"They were burying dead people in my daddy's grave ... they're coming after us. Please help me.\"\"Who's they?\"\"Blessed, he's coming.\"Ethan Merriweather, sheriff of Titusville, Virginia, a small mountain town near the Titus Hitch Wilderness, goes looking for a missing little girl. Soon after he finds her, Ethan realizes that Autumn has brought him a huge problem - a relentless madman who has the ability to control others simply by looking at them. And the madman is after her and her mom.It's Uncle Blessed, and he wants Autumn.When Savich answers Autumn's call, she tells him Blessed is from Bricker's Bowl, Georgia. Savich and Sherlock go to Blessed's home, learn about his brother, Grace, and meet their mother, Shepherd. Savich soon realizes the only way to stop Blessed is to \"cut off the snake's head.\"Back in Titusville, Ethan, Autumn, and her mother, Joanna, are forced to hide from Blessed and Grace in the wilderness. Ethan knows the brothers will never give up their insane pursuit for Autumn. It's a race to stop the madness, or the madness will destroy them all.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "A Little Treasury Of Limericks Fair And Foul",
        "Authors": "By Letts, John compiled by",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Comfort of a Man",
        "Authors": "By Byrd, Adrianne",
        "Description": "Tired of blind dates and unsuccessful relationships, single mother and business owner Brooklyn Douglas unexpectedly finds the man of her dreams in Isaiah Washington - a high-powered executive who will stop at nothing to get what he wants. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin Kimani Arabesque",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Understanding Tolkien and the Lord of the Rings 1971",
        "Authors": "By William Ready",
        "Description": "",
        "Category": "",
        "Publisher": "PAPERBACK LIBRARY",
        "Price Starting With ($)": "12.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "First With the Most: Nathan Bedford Forrest",
        "Authors": "By Henry, Robert Selph",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Mallard Press",
        "Price Starting With ($)": "5.6",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "In Search of Ancient Mysteries",
        "Authors": "By Landsburg",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1974"
        }
    },
    {
        "Title": "The Basic Darkroom Book (Plume Books)",
        "Authors": "By Tom Grimm",
        "Description": "",
        "Category": "",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "The Secret World of Kids (Giant Cardinal Edition)",
        "Authors": "By Art Linkletter",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "The Black Tower (Adam Dalgliesh Mystery Series #5)",
        "Authors": "By P. D James",
        "Description": "",
        "Category": "",
        "Publisher": "Popular Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Low-Fat Ways to Cook Fish & Shellfish",
        "Authors": "By McIntosh, Susan M. (EDT)",
        "Description": "Offers healthy ways to prepare fish and shellfish in appetizers and soups, salads and sandwiches, entrees, outdoor specialties, and quick and easy main dishes",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Adventures of Hebe",
        "Authors": "By Latham, John",
        "Description": "",
        "Category": "",
        "Publisher": "H. Regnery",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Veiled Promises (Zebra Debut)",
        "Authors": "By MacNish, Tracy",
        "Description": "Dashing Irish sea captain Patrick Mullen knows women like he knows the sea, but he is completely unprepared for the sight of lovely Camille Bradburn, the only daughter of the Duke and Duchess of Eton, and how quickly their love is endangered by those who would keep them apart. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Desperately Seeking A Duke (The Heiress Brides)",
        "Authors": "By Bradley, Celeste",
        "Description": "The only way for vicar's daughter Phoebe Millbury to inherit a family fortune is to find herself a duke—just as her late grandfather demanded in his will. But Phoebe, who's still  trying to make good after a romantic scandal, also has her two cousins to contend with. They're all competing for the same money, maybe even the same men. ..until Phoebe meets her match in the terribly handsome and charming Rafe Marbrook.When she receives a marriage proposal from the Marquis of Brookhaven, Phoebe is thrilled to learn that Rafe is headed for dukedom…and accepts his offer. There's only one problem: It's from Rafe's older, less captivating brother, Calder. Now Phoebe finds herself on the verge of yet another scandal as she faces a desperate choice: Marry Calder for his money—or follow her own heart? Each way can only lead to trouble…",
        "Category": " Fiction , Romance , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Not Quite A Gentleman (Avon Historical Romance)",
        "Authors": "By D'Alessandro, Jacquie",
        "Description": "Nathan Oliver, younger son of an earl, is content being a country doctor. Years ago he had worked for the Crown, but when a spy mission went awry, he left London for a simpler life. Now his world is turned upside down with the arrival of Lady Victoria Wexhall, a pampered Society miss more suited for the ballrooms of London than the quiet countryside of Cornwall. Victoria cannot believe her father would send her to the middle of nowhere, and just when the the Season was in full swing! And with Nathan Oliver, no less! Of course, he's dashing and more interesting than the fops she's acquainted with in Town, and it would be so easy to fall in love with him. But why does he insist on searching through her luggage in the middle of the night? And why does he insist their lives are in danger?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Bedding The Baron",
        "Authors": "By Raleigh, Deborah",
        "Description": "Innkeeper Portia Walker, against her better judgment, finds herself drawn to Fredrick Smith, a mysterious stranger who, using his talent for seduction, draws her into a world of passion and danger. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Kiss (Widows Club, Book 2)",
        "Authors": "By Nash, Sophia",
        "Description": "He had once been her cherished childhood companion, and then the man she lusted for in secret, but Georgiana Wilde hasn't seen recently widowed Quinn Fortesque since the day he married another woman and shattered her heart. Then fate intervenes and brings the man she dreams about each night back to her . . . .Returning to the estate on family business, Quinn would like nothing more than to turn the land over to Georgiana and leave the memories of his former life behind. But then the brooding marquis finds himself under the spell of the beauty he once left behind. With her barely concealed passions, Georgiana melts his coolly guarded heart. Suddenly his well-ordered world is in danger of crashing down. And it all began with just one kiss . . . .",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Around the World in 80 Days: Companion to the Pbs Series (Best of the Bbc)",
        "Authors": "By Palin, Michael (EDT)",
        "Description": "The British actor and humorist describes his eighty-day journey around the world--by train, taxi, camel, dogsled, cargo ship, and balloon--following in the footsteps of the inimitable Phileas Fogg. Reprint. TV tie-in. 25,000 first printing. IP.",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Bay Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Pole to Pole With Michael Palin: North to South by Camel, River Raft, and Balloon (Companion to the Pbs Series)",
        "Authors": "By Palin, Michael, Pao, Basil",
        "Description": "",
        "Category": "",
        "Publisher": "Bay Books",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "To Tempt A Scotsman",
        "Authors": "By Dahl, Victoria",
        "Description": "Shrouded in scandal, Lady Alexandra Huntington, retreating to her brother's country estate to manage his affairs, falls in love with Collin Blackburn, who, unbeknownst to her, believes she is responsible for his brother's death. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Dust to Dust (The Prophecy)",
        "Authors": "By Graham, Heather",
        "Description": "Not long ago, Scott Bryant would have described himself as an ordinary guy. But one act of heroism has changed his life forever&#151;or at least until the apocalypse occurs. Because the end of the world is on its way.Suddenly and inexplicably possessed of superhuman strength, Scott finds himself allied with the enigmatic and alluring Melanie Regan in a quest to find the mysterious Oracle in hopes of averting the absolute destruction that threatens.Melanie herself has been falling into trances, sketching terrifying visions of future events&#151;and she wants answers. She knows better than Scott where to look for help, but even she cannot fathom the powers that have thrust them together in an epic battle of good against evil.The earth itself will soon turn against its inhabitants, and now mortal and immortal must join forces if any are to survive.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Motoring with Mohammed: Journeys to Yemen and the Red Sea",
        "Authors": "By Hansen, Eric",
        "Description": "In 1978 Eric Hansen found himself shipwrecked on a desert island in the Red Sea. When goat smugglers offered him safe passage to Yemen, he buried seven years' worth of travel journals deep in the sand and took his place alongside the animals on a leaky boat bound for a country that he'd never planned to visit.As he tells of the turbulent seas that stranded him on the island and of his efforts to retrieve his buried journals when he returned to Yemen ten years later, Hansen enthralls us with a portrait -- uncannily sympathetic and wildly offbeat -- of this forgotten corner of the Middle East. With a host of extraordinary characters from his guide, Mohammed, ever on the lookout for one more sheep to squeeze into the back seat of his car, to madcap expatriates and Eritrean gun runners- and with landscapes that include cities of dreamlike architectural splendor, endless sand dunes, and terrifying mountain passes, Hansen reveals the indelible allure of a land steeped in custom, conflicts old and new, and uncommon beauty.",
        "Category": " Travel , Asia , China",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "To the Frontier",
        "Authors": "By Geoffrey Moorhouse",
        "Description": "The award-winning writer recounts his travels from Karachi, through the Sind, Baluchistan, and the Punjab, into the high Hindu Kush, travels that brought him into contact with paradox, danger, and the exotic",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Affirmative Reaction (A Tory Travers/David Alvarez Mystery)",
        "Authors": "By Schumacher, Aileen",
        "Description": "Environmental engineer Tory Travers requests the aid of police detective David Alvarez when she discovers the corpse of unpopular county commissioner Pamela Case  in a manhole while inspecting a community development site. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Worldwide Library",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Heat of Lies (Julian Palmer Thrillers)",
        "Authors": "By Stone, Jonathan",
        "Description": "Young, beautiful, police detective Julian Palmer is growing up. Just a few years out of the New York Police Academy, she's earning her stripes fast. Julian has solved high profile murder cases, and been promoted to Lieutenant upstate Troy, New York. But her latest case has her baffled. She's tracking the killer of a respected husband and father. With no suspects, a family hungry for answers, and the press breathing down her neck, Julian is desperate and in over her head. That's when Julian gets an unlikely visitor: her one time mentor and the first man she arrested for murder, former police Chief Winston \"The Bear\" Edwards. Once famed for his physical immensity and unmatched detective skills, Edwards is now a shadow of his former self. He's managed to escape a life in prison, but emerged a beaten man with no family and nowhere to turn. The only thing he has left is his brilliant police mind. Now the one time mentor has returned to his former student, looking for a shot at redemption, and a reason for living. Despite Julian's mistrust and fear of Edwards, the young Lieutenant knows he's still a gifted detective and cautiously brings him in on this seemingly unsolvable case. Working side by side with a man who once tried to kill her, Julian gets drawn deep into the murder investigation-and into the mind of the murder victim's young daughter. The girl forces Julian to confront once again the bizarre events surrounding the decade old murder of her own father. Taut, edgy and utterly unpredictable, The Heat of Lies will shock and scare you and keep you turning the pages long into the night. Jonathan Stone is widely praised as one of today's top thriller writers. Stone knows the importance of character, the significance of nuance, and folly of cliché. This is his second, and most riveting novel.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Comes a Horseman",
        "Authors": "By Liparulo, Robert",
        "Description": "The ancients saw Death as a blazing figure on horseback, swift and merciless.  Those facing the black chasm often mistook their pounding hearts for the beating of hooves.Now, two FBI agents pursuing a killer from a centuries-old cult realize they have become his prey.",
        "Category": " Fiction , Jewish",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Venus Throw: A Mystery of Ancient Rome (Novels of Ancient Rome)",
        "Authors": "By Saylor, Steven",
        "Description": "On a chill January evening in 56 B.C. , two strange visitors to Rome—an Egyptian ambassador and a eunuch priest—seek out Gordianus the Finder whose specialty is solving murders. But the ambassador, a philosopher named Dio, has come to ask for something Gordianus cannot give—help in staying alive. Before the night is out, he will be murdered.Now Gordianus begins his most dangerous case. Hired to investigate Dio's death by a beautiful woman with a scandalous reputation, he will follow a trail of political intrigue into the highest circles of power and the city's most hidden arenas of debauchery. There Gordianus will learn nothing is as it seems—not the damning evidence he uncovers, not the suspect he sends to trial, not even the real truth behind Dio's death which lies in secrets—not of state, but of the heart.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Show of Force",
        "Authors": "By Taylor, Charles D.",
        "Description": "",
        "Category": "",
        "Publisher": "Jove Books",
        "Price Starting With ($)": "37.5",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "FIRST RATE TRAGEDY PA",
        "Authors": "By Preston, Diana",
        "Description": "On November 12, 1912, a rescue team trekking across Antarctica's Great Ice Barrier finally found what they sought -- the  snow-covered tent of the British explorer Robert Falcon Scott. Inside, they made a grim discovery: Scott's frozen body lay between those of two fellow explorers. They had died just eleven miles from the depot of supplies that might have saved them. The remaining two members of the party were nowhere in sight, but Scott's eloquent diary revealed their nightmarishly similar fate. It is a story that continues to haunt the popular imagination, and which has never been told more grippingly or with greater compassion than in this book.",
        "Category": " History , Modern , 20th Century",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Birds at Your Fingertips (At Your Fingertips III)",
        "Authors": "By Nayer, Judy and McGinness, Jim (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "McClanahan Book Co",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Hershey's 1934 Cookbook - Revised and Expanded with Chocolate Recipes Brought up to Date for Use in Today's Kitchen",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hershey Foods Corporation",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Sons of the Wolf",
        "Authors": "By Michaels, Barbara",
        "Description": "A suspense novel about 2 cousins who find themselves under the new guardianship of Mr. Wolfson, a distant relative",
        "Category": " Fiction , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Southern Discomfort",
        "Authors": "By Maron, Margaret",
        "Description": "The heroine of Bootlegger's Daughter returns. Deborah Knott, a newly-appointed District Judge, is making good on a campaign promise by helping to build houses for battered women. But instead of muscle aches, she gets murder--and her fingerprints are on the murder weapon.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Alter Ego",
        "Authors": "By Watson, Patrick",
        "Description": "",
        "Category": "",
        "Publisher": "PENGUIN PUTNAM * TRADE",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Bluish",
        "Authors": "By Hamilton, Virginia",
        "Description": "In this powerful novel researched in NYC schools, Newbery Medalist Virginia Hamilton documents the struggle young people face as they simultaneously assert their independence and yearn for guidance.Friendship isn't always easy.  Natalie is different from the other girls in Dreenie's fifth-grade class. She comes to school in a wheelchair, always wearing a knitted hat. The kids call her \"Bluish\" because her skin is tinted blue from chemotherapy. Dreenie is fascinated by Bluish -- and a little scared of her, too. She watches Bluish and writes her observations in her journal. Slowly, the two girls become good friends. But Dreenie still struggles with with Bluish's illness. Bluish is weak and frail, but she also wants to be independent and respected. How do you act around a girl like that?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "The Blue Sky Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Humbug",
        "Authors": "By Bawden, Nina",
        "Description": "Sent to stay next door with the seemingly pleasant Aunt Sunday, eight-year-old Cora is tormented by Aunt Sunday's mean-spirited, deceitful daughter, but finds an ally in Aunt Sunday's elderly mother",
        "Category": " Juvenile Fiction , Family , Multigenerational",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The Seven 1/2 Sins of Stacey Kendall",
        "Authors": "By hopper, nancy j.",
        "Description": "Stacey Kendall wants to be beautiful instead of ordinary looking, and, when the prettiest girl in class gets her ears pierced, Stacey comes up with a plan that leads to trouble",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "The Protectors (Det. Brian McKenna Novels)",
        "Authors": "By Mahoney, Dan",
        "Description": "When Terrorists With Nothing To Lose...In a dramatic and violent kidnapping, the Spanish ambassador to the U.N. is taken at gunpoint in front of his luxury New York City apartment by a group of professional terrorists. The ambassador's bodyguards are killed, and his wife is threatened before the terrorists escape into the maze of the Big Apple...Kidnap the Rich and Powerful...But for veteran NYPD Detective First Grade Brian McKenna and his partner Cisco Sanchez, this is much more than a high profile kidnapping. This case is personal. The same group of terrorists has also taken their friend, Carmen de la Cruz, the wealthiest and most adored woman in Spain. And when a third kidnapping of another Spanish diplomat follows, the pressure mounts and the stakes are raised in this deadly game of hide and seek...One Cop Must Play By His Own Rules.To unravel a web of terrorists and save his friend, McKenna must first solve the crime in New York and find the ambassador. But his methodical police work and keen insights into the criminal mind might not be enough. This time McKenna might have to break the very laws he has sworn to protect...",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "American Slang",
        "Authors": "By Chapman, Robert L. (EDT)",
        "Description": "From cowpokes to cyber punks, from flappers to gangsta rappers, American Slang chronicles the ever-evolving, informal, unconventional language we use every day. Expanded and completely updated, this 2nd edition contains thousands of contemporary and traditional slang expressions, including the newest computer lingo and slang from the Internet. Entries Feature:Definitions Pronunciations Time and place origins Editorial notes Cross-references Examples that illustrate and validate usageSynonyms and variant forms Impact symbols",
        "Category": " Reference , Word Lists",
        "Publisher": "CollinsRef",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The False-Hearted Teddy: A Bear Collector's Mystery",
        "Authors": "By Lamb, John J.",
        "Description": "A crafter of artisan teddy bears, former homicide detective Brad Lyon, along with his wife, takes his creations to a big-time bear show in Baltimore where tempers run high and chaos ensues when a fellow designer, accused of stealing ideas, drops dead after using her asthma inhaler. Original.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Death a la Provencale",
        "Authors": "By JANET LAURENCE",
        "Description": "",
        "Category": "",
        "Publisher": "Headline Book Publishing, Limi",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Death of an Englishman",
        "Authors": "By Nabb, Magdalen",
        "Description": "When retired Englishman A. Langley-Smythe is found murdered in Florence, the Italian and British police get together to search for the killer",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "The Six Wives of Henry VIII",
        "Authors": "By Weir, Alison",
        "Description": "The tempestuous, bloody, and splendid reign of Henry VIII of England (1509-1547) is one of the most fascinating in all history, not least for his marriage to six extraordinary women. In this accessible work of brilliant scholarship, Alison Weir draws on early biographies, letters, memoirs, account books, and diplomatic reports to bring these women to life. Catherine of Aragon emerges as a staunch though misguided woman of principle; Anne Boleyn, an ambitious adventuress with a penchant for vengeance; Jane Seymour, a strong-minded matriarch in the making; Anne of Cleves, a good-natured and innocent woman naively unaware of the court intrigues that determined her fate; Catherine Howard, an empty-headed wanton; and Catherine Parr, a warm-blooded bluestocking who survived King Henry to marry a fourth time.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Gorillas and chimpanzees (First sight)",
        "Authors": "By Chivers, David John",
        "Description": "",
        "Category": "",
        "Publisher": "Shooting Star Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Pillars of Solomon (Ben and Danielle)",
        "Authors": "By Land, Jon",
        "Description": "Palestinian-American detective Ben Kamal and Israeli police inspector Danielle Barnea return to confront a worldwide criminal plague: white slavery.Ben Kamal hasn't investigated a case since his last assignment with Danielle until he learns about missing children in his native West Bank. And Danielle had put her career on hold until a personal tragedy left her with nothing to turn to except her career; her first case is the seemingly random murder of a Jerusalem shopkeeper.What Ben and Danielle don't know, can't know, is that their separate investigations are linked by a secret born of the blood that forged a nation.To stop history from being rewritten, Ben and Danielle must follow a dangerous path to a truth that no one wants revealed, a truth someone had already killed to keep hidden behind the Pillars of Solomon.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Chadwick Coloring Book",
        "Authors": "By Cummings, Priscilla and Cohen, A. R. (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Schiffer",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The recovery of Europe, 1945-1973",
        "Authors": "By Mayne, Richard J",
        "Description": "",
        "Category": "",
        "Publisher": "Anchor Press",
        "Price Starting With ($)": "6.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Maui Bound",
        "Authors": "By Stevens, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "Pacific Islands Publishing",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The Angry Mountain",
        "Authors": "By Innes, Hammond",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "14.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Frank Hogan remembered: Reminiscences",
        "Authors": "By Cohen, Lester",
        "Description": "",
        "Category": "",
        "Publisher": "Hogan & Hartson",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Spanish Bride: A Novel of Catherine of Aragon",
        "Authors": "By Gardner, Laurien",
        "Description": "Told through the eyes of Estrella de Montoya, Catherine's companion, this powerful novel details the marriage of Catherine of Aragon, a Spanish princess believing she was to wed a knight in shining armor, to King Henry VIII, a cruel monarch whom she found the courage to defy. Original.",
        "Category": " Fiction , Historical",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "A History of the English-Speaking Peoples, Vol. 3: The Age of Revolution",
        "Authors": "By Winston S. Churchill",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "History of the U.s. Marines",
        "Authors": "By Murphy, Jack",
        "Description": "Outlines over two hundred years of Marine history, looks at their participation in the Revolution, Civil War, World Wars, Korea, and Vietnam, and describes the Corps' modern role",
        "Category": " Political Science , General",
        "Publisher": "Bookthrift Co",
        "Price Starting With ($)": "7.01",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "God's Beautiful World: Lord Our Lord, How Excellent Is Thy Name in All the Earth! Psalm 8:1",
        "Authors": "By Ideals Publications Inc",
        "Description": "Photographs depicting the beauty of nature accompany selected passages from Genesis, Chronicles, the Psalms, and Ecclesiastes",
        "Category": " Gardening , General",
        "Publisher": "Ideals Childrens Books",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Horses! (Giant Photo-Fact Collection)",
        "Authors": "By Kathy Wilmore",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks, LLC",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Silent Lightning",
        "Authors": "By Gribble, Joe L.",
        "Description": "When it is learned that Syria has developed a devastating new laser-guided missile system capable of nullifying Israel's defenses, the United States sends a band of special operatives to penetrate Syrian lines. Original.",
        "Category": " Fiction , War & Military",
        "Publisher": "Onyx",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "When I Feel Scared (The Way I Feel Books)",
        "Authors": "By Spelman, Cornelia Maude and Parkinson, Kathy (ILT)",
        "Description": "Children will recognize similar experiences in their own lives as this little bear describes feeling scared when he has a bad dream or his mother goes away.  Eventually our hero realizes that it's OK to be scared sometimes, and there are ways he can help himself when he's frightened.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Albert Whitman & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Death of an Irish Sea Wolf",
        "Authors": "By Gill, Bartholomew",
        "Description": "In a remote community off the west coast of Ireland, residents inclined to gossip speculate why reclusive Clement Ford, the \"Sea Wolf,\" has become such a generous benefactor to his neighbors. then one night, a mysterious figure from Ford's past arrives on the island, and by morning three people are murdered and Ford has disappeared. In the wake of the tragedy, Chief Superintendent Peter McGarr, and his intuitive wife, Noreen, along with his trusted staff from the Murder Squad, must piece together the deadly evening's events and answer the questions: Who really is the enigmatic Sea Wolf? And what does he have that is worth killing so many people for?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Every Day Light: Water for the Soul- Daily Inspirations",
        "Authors": "By Kinkade, Thomas (ILT) and Hughes, Selwyn",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Peters Atlas of the World",
        "Authors": "By Peters, Arno",
        "Description": "A handsome atlas employing the Peters projection (promising greater fidelity in: area, location, and axis yielding a thin South America, a short Greenland). Here is no bias toward Europe and N. America all topographic maps are at the same scale (1 cm=80 km). Uses shaded relief, with color representation of surface character. The 246 thematic maps (at much smaller scale) cover such familiar topics as language, energy, and health; but surprise us with the direction in which scripts are written (to the left, upwards, or to the right), and the number of fighter planes (Iraq 500 to 1,000), and tanks (USSR over 50,000). Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The Fascinating World of Ants",
        "Authors": "By Julivert, Angels and Socias, Marcel (ILT)",
        "Description": "Describes the appearance, life cycle, activities, and social habits of ants",
        "Category": " Juvenile Nonfiction , Animals , Insects, Spiders, etc.",
        "Publisher": "Barrons Juveniles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Birds (World Wildlife Fund)",
        "Authors": "By Dorfman, Gillian and Weare, Phil",
        "Description": "Shows how birds are different from other animals, describes a variety of species, and tells how birds find food, build nests, and raise their young",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Ladybird Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Animals in Danger: Forests of Africa",
        "Authors": "By Gould, Gill",
        "Description": "Depicts the behavior of the mountain gorilla, pygmy hippopotamus, lemur, and other African animals threatened with extinction",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Rourke Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "The World Encyclopedia of Flags: The Definitive Guide to International Flags, Banners, Standards and Ensigns",
        "Authors": "By Znamierowski, Alfred",
        "Description": "",
        "Category": "",
        "Publisher": "HERMES HOUSE",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Trading in Danger",
        "Authors": "By Moon, Elizabeth",
        "Description": "Kylara Vatta is the only daughter in a family full of sons, and her father's only child to buck tradition by choosing a military career instead of joining the family business. For Ky, it's no contest: Even running the prestigious Vatta Transport Ltd. shipping concern can't hold a candle to shipping out as an officer aboard an interstellar cruiser. It's adventure, not commerce, that stirs her soul. And despite her family's misgivings, there can be no doubt that a Vatta in the service will prove a valuable asset. But with a single error in judgment, it all comes crumbling down.Expelled from the Academy in disgrace - and returning home to her humiliated family, a storm of high-profile media coverage, and the gaping void of her own future - Ky is ready to face the inevitable onslaught of anger, disappointment, even pity. But soon after opportunity's door slams shut, Ky finds herself with a ticket to ride - and a shot at redemption - as captain of a Vatta Transport ship.It's a simple assignment: escorting one of the Vatta fleet's oldest ships on its final voyage...to the scrapyard. But keeping it simple has never been Ky's style. And even though her father has provided a crew of seasoned veterans to baby-sit the fledgling captain on her maiden milk run, they can't stop Ky from turning the routine mission into a risky venture - in the name of turning a profit for Vatta Transport, of course.By snapping up a lucrative delivery contract defaulted on by a rival company, and using part of the proceeds to upgrade her condemned vehicle, Ky aims to prove she's got more going for her than just her family's famous name. But business will soon have to take a backseat to bravery, when Ky's change of plans sails her and the crew straight into the middle of a colonial war. For all her commercial savvy, it's her military training and born-soldier's instincts that Ky will need to call on in the face of deadly combat, dangerous mercenaries, and violent mutiny.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Total Television",
        "Authors": "By McNeil, Alex",
        "Description": "An alphabetical listing of network and syndicated programs is accompanied by prime time schedules from 1948 to 1980, Emmy award winners, and ratings leaders",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Monumental Mazes",
        "Authors": "By Burnie, Richard",
        "Description": "Napoleon's freezing army is trying to retreat from Moscow!  A wobbly waiter needs to make his way over precarious pedestrian  walkways on a flooded piazza in Venice! A runaway must escape from the Roman arena, sneaking past the snoozing gladiators and avoiding the hungry lions! Find the right paths through these obstacles--and nine other uniquely challenging mazes--in this gorgeously illustrated and informative puzzle book. Set in eras as varied as ancient Egypt and modern-day Manhattan and on monuments from the Eiffel Tower to the Great Wall of China, these mazes take readers around the world, through different times and places. With quirky characters and activities galore on every page, there is much to keep an eagle-eyed reader engaged, even once (or if!) the mazes are solved. Solutions and historical information for each spread are included.",
        "Category": " Juvenile Nonfiction , Games & Activities , Puzzles",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Story of Jesus (Little Golden Storybook)",
        "Authors": "By Smath, Jerry (ILT) and Watson, Jane Werner",
        "Description": "Introduces the birth and childhood of Jesus, and the major events of His ministry.",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The story of old King Cole",
        "Authors": "By Hogstrom, Daphne Doward",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Ruth, woman of courage (Biblearn series)",
        "Authors": "By Cassell, R.",
        "Description": "",
        "Category": "",
        "Publisher": "Broadman Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Renaissance Europe: Age of recovery and reconciliation",
        "Authors": "By Jensen, De Lamar",
        "Description": "",
        "Category": "",
        "Publisher": "D.C. Heath",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Draw Sports Figures! (Discover Drawing)",
        "Authors": "By Hammond, Lee",
        "Description": "Introduces useful tools and techniques, shows how to portray uniforms, poses, and movement, and includes demonstrations and exercises",
        "Category": " Art , Techniques , Drawing",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Champion Within",
        "Authors": "By Gregg, L.",
        "Description": "",
        "Category": " Sports & Recreation , Soccer",
        "Publisher": "JTC Sports",
        "Price Starting With ($)": "6.11",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Greenpeace Book of Dolphins",
        "Authors": "By May, John (EDT)",
        "Description": "Describes the characteristics and behaviour of dolphins, and explains how many are threatened by pollution and improper commercial fishing techniques",
        "Category": " Science , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Empire of Heaven: A Novel of Nineteenth Century China",
        "Authors": "By Sledge, Linda Ching",
        "Description": "After healing Hung, leader of the Taiping Rebellion in mid-nineteenth-century China, Rulan becomes his obsession and to avoid him she must take refuge as a spy in the mansion of the rebellion's opponent, General Li",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "6.91",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "A Begonia for Miss Applebaum",
        "Authors": "By Zindel, Paul",
        "Description": "Discovering that their beloved former teacher Miss Applebaum is terminally ill, fifteen-year-old Henry and his friend Zelda accompany her on her excursions to the colorful parts of New York City and join her in confronting death with quiet courage.",
        "Category": "",
        "Publisher": "Starfire",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Beastly Behaviors: A Zoo Lover's Companion: What Makes Whales Whistle, Cranes Dance, Pandas Turn Somersaults, and Crocodiles Roar: A Watcher's Guide to How Animals Act and Why",
        "Authors": "By Benyus, Janine M. and Barberis, Juan Carlos",
        "Description": "Beastly Behaviors is a book for animal lovers everywhere - a lively, illustrated armchair \"field guide\" to the behavior and body language of the world's most watchable zoo animals, arranged just the way exhibits are set up at the zoo: Animals of the African jungles, plains, and waterways; Asian forests; the warm oceans; North America; the Poles.In the friendly tone of a knowledgeable zookeeper, Janine Benyus answers questions about specific animals (like \"Why does the gorilla beat its chest?\") as well as questions that could apply to many animals (like \"How does each mother know her own young?\"). Drawing from the extensive research of animal behaviorists, she tells why and how these watchable critters scratch, rub, preen, bathe, stretch and yawn, eat and play, confront each other and court their mates, give birth to young and keep them fed - behaviors that are observable at your local zoo.Beastly Behaviors can be used in any zoo or wild animal park, on safari, on camping trips, on hikes, or even at home while watching wildlife shows on TV. But most of all, it's for browsing before and after - or instead of - a visit to the zoo. Above all, Beastly Behaviors is engaging; like Kipling's The Elephant's Child it is for all those who want to know where the elephant got its trunk, but require a more reliable answer than a \"Just-So\" story.A book for all ages.",
        "Category": " Nature , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Prayers Written at Vailima",
        "Authors": "By Stevenson, Robert Louis",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Concordia Pub House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Meriwether Murder",
        "Authors": "By Shuman, M. K.",
        "Description": "Historian Alan Graham and archaeologist \"Pepper\" Courtney join forces to unravel the mystery behind a burial site that may be home to the body of Meriwether Lewis, a site that someone in Louisiana wants to keep hidden. Original.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Wild Truth Bible Lessons",
        "Authors": "By Oestreicher, Mark",
        "Description": "Ready to introduce your junior highers to wild examples of spiritual maturity? Check out biblical adventures of these people and the character qualities they exemplify -- real people who, in wild Bible stories, did really wild things for God: - Kid King . . . Josiah (influencing others)  - Wise Guy, the King of Good Decisions . . . Solomon (wise decisions)  - Little Timmy, the Teenage Teacher . . . Timothy (living for God while still a young teen)  - Dave's posse . . . David's mighty men (doing outrageous things for God)  - Whiney Bro, the Fair-Share Demander . . . the Prodigal Son's brother (demanding your rights)  - Moe's Mom, the Cruise Director . . . Moses' mother (trusting God in difficult situations)  - Pete, the Second-Chance Wonder . . . Peter (God's forgiveness)  - Samantha, the Water Woman . . . the woman at the well (racism).  You won't believe all the off-the-wall discussion starters, video ideas, scripts, games with a point -- and, of course, Bible passages you can use to springboard junior highers into topics that don't just mean the world to them, but are the world. Friendship. Embarrassment. Rights. Racism. Each lesson reaches back into history to underline for junior highers the reality of Old and New Testament people and principles -- and then reaches forward, challenging your students to make better decisions, better friends, better lives. Each lesson thoroughly preps you to teach it, including convenient reminders of what materials you need and when you need them. And in each lesson students dig into Wild Pages that bring scriptural principles right into the kids' own experience.  12 lessons",
        "Category": " Young Adult Nonfiction , Religion , Biblical Stories & Studies",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Midnight Hag",
        "Authors": "By Joan Fleming",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.87",
        "Publish Date": {
            "Month": "October",
            "Year": "1969"
        }
    },
    {
        "Title": "The Creation (Now You Can Read--Bible Stories.)",
        "Authors": "By Matthews, Leonard",
        "Description": "Retells the Bible stories of the Creation and the Garden of Eden.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Rourke Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Daniel and his friends (Now you can read--Bible stories)",
        "Authors": "By Matthews, Leonard",
        "Description": "",
        "Category": "",
        "Publisher": "Rourke Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "How the West Was Won: A Novel",
        "Authors": "By L'Amour, Louis",
        "Description": "They came by river and by wagon train, braving the endless distances of the Great  Plains and the icy passes of the Sierra Nevada. They were men like Linus Rawlings,  a restless survivor of Indian country who’d headed east to see the ocean but left  his heart—and his home—in the West. They were women like Lilith Prescott, a smart,  spirited beauty who fled her family and fell for a gambling man in the midst of a  frontier gold boom. These pioneering men and women sowed the seeds of a nation with  their courage—and with their blood. Here is the story of how their paths would meet  amid the epic struggle against fierce enemies and nature’s cruelty, to win for all  time the rich and untamed West.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    }
]