[
    {
        "Title": "Landscape Plans (Ortho Library)",
        "Authors": "By Lutsko, Ron, Jr. and Menigoz, Robyn Sherrill (ILT)",
        "Description": "Includes thirty-three sample landscape plans for all styles of homes, a step-by-step guide to drawing your own landscape plans, and listing of the best plants for all regions of the United States",
        "Category": " Gardening , Landscape",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Money Management for Those Who Don't Have Any",
        "Authors": "By Paris, James L.",
        "Description": "",
        "Category": " Business & Economics , Personal Finance , Money Management",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Mysterious Collection of Dr. David Harleyson",
        "Authors": "By Cassels, Jean",
        "Description": "Beloved children’s characters come to life through a puzzle in paintings. The eccentric traveler and world-renowned painter, Dr. David Harleyson, has disappeared, and it is up to his young nephew to find him! By unraveling the clues on the backs of Dr. David’s most recent paintings, his nephew is able to piece together his uncle’s incredible around-the-world journey.What do the most popular creatures from Mother Goose, Grimm, and Aesop—immortalized in Dr. David’s breathtakingly lifelike portraits—have to do with his year-long adventure? Where has Dr. David been, and what will become of him?The mystery awaits, and only by following the clues can you discover the tale behind the mysterious collection of Dr. David Harleyson!",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Walker Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Feeding Frenzy How Attack Journalism Has Transformed American Politics",
        "Authors": "By Sabato, Larry J.",
        "Description": "Shows how attack journalism, attempts to discredit politicians due to personal behavior, has diverted the public's attention from real issues, discouraged worthy candidates, and damaged the press itself",
        "Category": " Political Science , American Government , State",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Word Smart II: 700 More Words to Help Build an Educated Vocabulary (Princeton Review Series)",
        "Authors": "By Robinson, Adam and Princeton Review",
        "Description": "Seven hundred more words to help build an impressive vocabulary compiled by the staff of The Princeton Review will help anyone communicate more effectively. Original. 50,000 first printing.",
        "Category": "",
        "Publisher": "Princeton Review",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Webster's New World Guide to Current American Usage",
        "Authors": "By Randall, Bernice",
        "Description": "Provides information on grammar, punctuation, usage, and the history of the English language, and explains the origin of phrases, idioms, and slang",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "14.44",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Resume Handbook 4th Edition",
        "Authors": "By Rosenberg, Arthur D. and Hizer, David V.",
        "Description": "A useful guide to writing great resumes presents the best and worst resumes ever written, sample resumes for unique situations, new technology for creating resumes, and advice on how to take advantage of the hottest trends in the market. Original.",
        "Category": " Business & Economics , Careers , Resumes",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Water Gardens for Plants and Fish",
        "Authors": "By Thomas, Charles B.",
        "Description": "",
        "Category": " Pets , Fish & Aquariums",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Children: The Challenge",
        "Authors": "By Dreikurs, Rudolf, Stolz, Vicki",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Saucer: The Conquest: The Conquest (Saucer, 2)",
        "Authors": "By Coonts, Stephen",
        "Description": "Bestselling author Stephen Coonts took fans by surprise with the phenomenal and heart-pounding tale of Saucer. Now Rip Cantrell and Charley Pine are back for seconds with with Saucer: The Conquest. Rip Cantrell is brought back to give the saucer one last flight. Charley Pine has started flying for a rich French tycoon, and there is believed to be another downed saucer somewhere in the area. Rip can't quite get over the fact that Charley has dumped him. But when push comes to shove Rip and the United States Government are going to go head to head with this crazy Frenchman in trying to be the first to the saucer. As Stephen Coonts proved in his last outing, there is a great deal of high-flying adventure to be found in the Saucer series. And this one not only promises all the excitement of the last one, but it delivers with much, much more.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Neil Gaiman Reader",
        "Authors": "By Schweitzer, Darrell (EDT)",
        "Description": "Neil Gaiman's talent is so vast that any exploration of his work can only bedescribed as a beginning. Here is one such beginning, an examination of thecreative genius being The Sandman, American Gods, Coraline and so muchmore. His prose fiction has achieved enormous acclaim and popularity. Nowleading scholars provide insights into the Sandman universe, itsmythological underpinnings, Gaiman's technique and his relationship to othermasters of the fantastic imagination. Two extensive interviews with Gaiman areincluded, along with a thorough bibliography of his work to date.",
        "Category": " Literary Criticism , Science Fiction & Fantasy",
        "Publisher": "Wildside Press",
        "Price Starting With ($)": "6.23",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Genuine Lies: A Novel",
        "Authors": "By Roberts, Nora",
        "Description": "A book to die for...Eve Benedict is the last of the movie goddesses, a smoky-voiced sex symbol with two Oscars, four ex-husbands, and a legion of lovers to her name. There is no secret, no scandal she doesn't know. Now Eve has decided to write her memoirs--no holds barred. All Hollywood begs her not to. But Eve has her reasons....Julia Summers is the biographer Eve has handpicked to tell her story. Transported from her quiet life in Connecticut to glitzy Beverly Hills, Julia hates the limelight but loves her work--and the home it built for the ten-year-old son she's raising alone. How can she refuse this chance of a lifetime? But Eve's elegantly sexy stepson, Paul Winthrop, will challenge Eve's determination to tell her story--and Julia's resolve to guard her heart. And as Julia learns just how far Eve's enemies will go to keep her book from publication, she also discovers that Eve has one last, dark secret to share. It is one that will change Julia's life--and could cut it brutally short.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Divine Secrets of the Ya-Ya Sisterhood",
        "Authors": "By Wells, Rebecca",
        "Description": "When Siddalee Walker, oldest daughter of Vivi Abbott Walker, Ya-Ya extraordinaire, is interviewed in the New York Times about a hit play she's directed, her mother gets described as a \"tap-dancing child abuser.\" Enraged, Vivi disowns Sidda. Devastated, Sidda begs forgiveness, and postpones her upcoming wedding. All looks bleak until the Ya-Yas step in and convince Vivi to send Sidda a scrapbook of their girlhood mementos, called \"Divine Secrets of the Ya-Ya Sisterhood.\" As Sidda struggles to analyze her mother, she comes face to face with the tangled beauty of imperfect love, and the fact that forgiveness, more than understanding, is often what the heart longs for. Divine Secrets of the Ya-Ya Sisterhood may call to mind Prince of Tides in its unearthing of family darkness; in its unforgettable heroines and irrepressible humor and female loyalty, it echoes Fannie Flagg's Fried Green Tomatoes at the Whistle Stop Cafe.",
        "Category": " Fiction , Sagas",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Killing With the Edge of the Moon",
        "Authors": "By Attanasio, A. A.",
        "Description": "The speaker is a hickory-faced crone trying to explain to Chet, a shy kidwith eyeglasses and pocket protector, why he can't take her granddaughter to thehigh school dance. For quiet, elfin Flannery is not like other kids. A livingBlud-eye-eth, she has caught the attention of the faerie, beautiful evilcreatures from a mysterious Otherworld, who seduce their victims with moonlightraves before feeding them to a dragon and hunting souls with a supernaturalblack dog of prodigious evil. And they have taken Flannery for one of their own.And she won't be going to the school dance-not unless Chet rescues her.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Prime Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "A Very Wompkee Christmas",
        "Authors": "By Medford, Mark and Shipman, Heather (ILT)",
        "Description": "As Wompkee Wood prepares for the Christmas Eve Festival, Little Twig wishes for her ears to grow so she will be able to fly and place the star on top of the Christmas tree and the Ice Fairies are busy stealing Wompberries for Iglora Borealis, the Ice Queen.As Wompkee Wood prepares for the Christmas Eve Festival, Little Twig wishes for her ears to grow so she will be able to fly and place the star on top of the Christmas tree and the Ice Fairies are busy stealing Wompberries for Iglora Borealis, the Ice Queen.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Vanguard Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Property of a Lady",
        "Authors": "By Adler, Elizabeth",
        "Description": "The magnificent Ivanoff emerald: It surfaced at Christie's at Geneva, \"The Property of a Lady\"--a lady now sought by powerful men intent on seizing a legacy that could tilt the world balance of power . . .The terrifying Ivanoff secret: She lived like a pauper with a royal ransom in gems, determined to carry her secret to the grave . . . until an act of love and a public auction brought the world--and the curse--to her door . . .The last of the Ivanoffs--pawns in a deadly game: The royal gems are merely the lure to the hidden billions for which nations are willing to kill. The last of the Ivanoffs should have died in 1917. Now, two generations later, they are the prize--and the prey . . . From war-torn Russia to New York's teeming Lower East Side . . . from Ziegfeld's Broadway and the Hollywood of the moguls to contemporary Washington, Geneva, and Berlin, Elizabeth's Adler's novel of passion, power, and royal privilege will command your attention to the very last page.From the Paperback edition.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Weird Tales: The 21st Century, Volume 1",
        "Authors": "By",
        "Description": "Originally founded in the 1920s with the mission of finding and publishing\"the next Edgar Allan Poe,\" the dark-fantasy magazine Weird Tales hasfeatured such mind-bending authors of unearthly fiction as H. P. Lovecraft, RayBradbury, Robert E. Howard, Robert Bloch and Stephen King... and now you coulddiscover the myriad horrors of Weird Tales in a brand-newformat!",
        "Category": " Fiction , Science Fiction , Collections & Anthologies",
        "Publisher": "Prime Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Grant: A Novel",
        "Authors": "By Byrd, Max",
        "Description": "The year is 1880, and the Civil War is slowly receding into the past. Lincoln has been dead for fifteen years, and Grant - retired from his second scandal-ridden term in the White House - has just returned home from a triumphant world tour. Now, in the final political battle of his life, he tries for an unprecedented third presidential term. But in one of the most dramatic and tumultuous conventions in American history, he will be defeated for renomination in Chicago. A few months later he will go spectacularly bankrupt in New York - and at the same time learn that he has cancer of the throat.Two journalists are busy describing the dying Grant for posterity: one with enthusiasm, the other with thinly veiled contempt. The supportive biographer, Chicago newspaperman Sylvanus Cadwallader, has covered Grant in the Civil War and seen the human being behind the General's grim, taciturn facade. The other journalist is Yale-educated Nicholas Trist, a wounded soldier who lost his arm to Grant's \"butchery\" at Cold Harbor.But at the core is Grant himself: his unwavering humility and deep pride, his quixotic intelligence, his legendary battles with alcohol, depression, and his father.",
        "Category": " Fiction , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Stanislaski Sisters",
        "Authors": "By Roberts, Nora",
        "Description": "In Taming Natasha, a wild-spirited toy store owner is seduced by a young customer's father, while in Falling for Rachel, a public defender and a rugged bar owner are assigned joint custody of a delinquent teen. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Prevention's Healing With Motion: An All-New Approach to Health and Healing Based on Simple Mind and Body Exercises",
        "Authors": "By Prevention Magazine Health Books (EDT)",
        "Description": "Borrowing from state-of-the-profession medical advice and conventional wisdom, this guide to unleashing the body's natural healing potential focuses on simple motion as a cure for many common ailments. 10,000 first printing.",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Monster (An Alex Delaware Novel)",
        "Authors": "By Kellerman, Jonathan",
        "Description": "A second-rate actor is found mutilated in a car trunk. Then a psychologist at a Los Angeles hospital for the criminally insane is murdered in a similar grisly fashion. Suddenly the incoherent ramblings of an inmate at the presumably secure institution begin to make chilling sense—they are, in fact, horrifying predictions. Yet how can a barely functional psychotic locked behind asylum walls possibly know such vivid details of crimes committed in the outside world? Drawn into a labyrinth of secrets, revenge, sex, and manipulation, Dr. Alex Delaware and Detective Milo Sturgis set out to unlock this enigma and put an end to the brutal killings—before the madman predicts their own demise. . . .",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Alligators: Life in the Wild (Step-Into-Reading, Step 3)",
        "Authors": "By Kulling, Monica and Roper, Marty (ILT)",
        "Description": "Describes the physical characteristics, hunting and feeding behavior, habitat, life cycle, methods of communication, and endangered status of alligators",
        "Category": " Juvenile Nonfiction , Readers , Intermediate",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Mansfield Park (Dover Thrift Editions)",
        "Authors": "By Austen, Jane",
        "Description": "When Fanny Price comes to live with her well-to-do cousins at Mansfield Park, the modest, retiring ten-year-old is treated condescendingly by members of the Bartram family. A poor relation, dependent on the goodwill of her aristocratic relatives, the sweet, sensitive, and frequently ignored Fanny nevertheless eventually develops into the ethical center of the family.Trouble begins with the arrival of Mary Crawford and her brother Henry. Their sophisticated London tastes, and penchant for flirtatious activities, shatter the tranquility of the Bartram home, creating social havoc and precipitating a crisis in the family. But Fanny — always clever, graceful, and pleasant — provides a bulwark of moral strength, eventually winning her family's complete acceptance (and the love of her cousin Edmund).Described by Lionel Trilling as the most experimental and modern of Jane Austen's works, Mansfield Park is also Austen's most serious novel, written in the full flower of the novelist's maturity. Enlivened by an amusing cast of busybodies, ne'er-do-wells, and social climbers, this acclaimed novel of early-19th-century English society will also appeal to readers as an entertaining study of the interplay between manners, education, and ethics.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Virgin Suicides",
        "Authors": "By Eugenides, Jeffrey",
        "Description": "Juxtaposing the most common and the most gothic, the humorous and the tragic, author Jeffrey Eugenides creates a vivid and compelling portrait of youth and lost innocence. He takes us back to the elm-lined streets of suburbia in the seventies, and introduces us to the men whose lives have been forever changed by their fierce, awkward obsession with five doomed sisters: brainy Therese, fastidious Mary, ascetic Bonnie, libertine Lux, and pale, saintly Cecilia, whose spectacular demise inaugurates \"the year of the suicides.\" This is the debut novel that caused a sensation and won immediate acclaim from the critics-a tender, wickedly funny tale of love and terror, sex and suicide, memory and imagination.",
        "Category": " Fiction , Psychological",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Creation of Health: The Emotional, Psychological, and Spiritual Responses That Promote Health and Healing",
        "Authors": "By Shealy, C. Norman and Myss, Caroline M.",
        "Description": "A collaboration between a traditionally trained physician and a medical intuitive, The Creation of Health illuminates the deep connection between emotional dysfunction and physical illness. It describes the role that emotional disturbances play in the most common diseases and ailments from the common cold to arthritis, diabetes, heart disease, and cancer.After providing an introduction to intuitive medicine and its history, method of diagnosis, and relationship to traditional medicine, Myss and Shealy detail the deeper emotional and psychic reasons why illness develops in the body. Dr. Shealy offers a traditional account of a particular disease or ailment, while Dr. Myss sheds light on the deeper causes through her corresponding energy analysis.Confirming the link between illness and emotion, The Creation of Health puts forth a groundbreaking vision of holistic healing.",
        "Category": " Medical , Alternative & Complementary Medicine",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Classic Shrewd Challenges",
        "Authors": "By Terry. H. Stickels",
        "Description": "",
        "Category": "",
        "Publisher": "Main Street Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Learn With Peter Rabbit: A Book of Numbers",
        "Authors": "By Potter, Beatrix and Arkadia Illustrations Ltd (COR)",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "9.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Healthier at Home: The Proven Guide to Self-Care & Being a Wise Health Consumer",
        "Authors": "By Powell, Don",
        "Description": "",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "American Institute for Preventive Medicine Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Glory: A Novel",
        "Authors": "By wouk, herman",
        "Description": "In The Hope, world-famed historical novelist Herman Wouk told the riveting saga of the first twenty years of Israel's existence, culminating in its resounding triumph in the Six-Day War, which amazed the world as few events of this turbulent century have. With The Glory, Wouk rejoins the story of Israel's epic journey in one of his most compelling works yet. From the euphoric aftermath of that stunning victory in 1967, through the harrowing battles of the Yom Kippur War, the heroic Entebbe rescue, the historic Camp David Accords, and finally the celebration of forty years of independence and the opening of the road to peace, Wouk immerses us in the bloody battles, the devastating defeats, the elusive victories.",
        "Category": " Fiction , Literary",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "What Your Doctor May Not Tell You About Premenopause: Balance Your Hormones and Your Life From Thirty to Fifty",
        "Authors": "By Lee, John R., Hopkins, Virginia, and Hanley, Jesse",
        "Description": "A safe, effective hormone balance program for women aged 30-50 suffering from premenopause syndrome. Restore and maintain gynecological health, sex drive, and energy.I'm too young for menopause. So why do I feel like this?  Even if you're a decade or more away from menopause, your hormones may already be out of balance, usually caused by an excess of estrogen and a deficiency of progesterone. Over 50 million women experience premenopause symptoms, including:Unexplained, sudden weight gainSevere PMS, fatigue, irritability, and mood swingsLoss of libidoTender or lumpy breastsFibroids and endometriosisCold hands and feetVery heavy or light periodsOr other symptoms like infertility, memory loss, and migraines.Now Dr. John Lee-author of the groundbreaking What Your Doctor May Not Tell You About Menopause-teams up with women's health expert Jesse Hanley, M.D., to bring you a revolutionary nonprescription \"Balance Program\" with simple, safe, and natural solutions for premenopause.Learn how natural progesterone and changes to your diet and environment can balance your hormones, eliminate premenopausal symptoms, and make you feel better-all without surgery, antidepressants, or prescription hormones.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Science Fiction: The Best of the Year, 2006 Edition (Science Fiction: The Best of ... (Quality))",
        "Authors": "By Horton, Rich",
        "Description": "The best stories of the year: here is a collection of the best sciencefiction prose written in 2005, by some of the genre's greatest authors, andselected by Rich Horton, a contributing reviewer to many of the field's mostrespected magazines. In this volume you'll find stories by James Patrick Kelly,Wil McCarthy, Susan Palwick, Tom Purdom, Robert Reed, Michael Swanwick, JamesVan Pelt, Howard Waldrop, Alastair Reynolds, Ian McDonald, Mary Rosenblum,Stephen Leigh and Joe Haldeman.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Prime Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Quotable Woman: Witty, Poignant, And Insightful Observations From Notable Women",
        "Authors": "By",
        "Description": "\"More than 300 celebrated women share their insights on a wide range of timeless topics, from love and friendship to ambition and the gender gap.\"",
        "Category": " Reference , Quotations",
        "Publisher": "Running Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Eat Your Way Across the USA",
        "Authors": "By Stern, Jane and Stern, Michael",
        "Description": "Recommends cafes, pancake houses, doughnut shops, and all-you-can-eat buffets in each region of the United States",
        "Category": " Travel , Food, Lodging & Transportation , Restaurants",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Race for God",
        "Authors": "By Herbert, Brian",
        "Description": "God, it turns out, lives on the planet Tananius-Ofo in the distant galaxy722C12009. And now, after countless millennia, He's invited us to come visitHim. Not everybody, mind you. Just an odd assortment of heathens, heriticts,pantheists, perverts and true believers of every sect and creed — allcrammed into a single white spaceship piloted by a slightly crazed bio-computer.Each pilgrim is determined to be the first to reach God and learn His secrets...if they don't all kill each other on the way there.",
        "Category": " Fiction , Religious",
        "Publisher": "Wildside Press",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "NATURAL HEALTH, NATURAL MEDICINE",
        "Authors": "By Weil, Andrew",
        "Description": "A physician demonstrates how to take an active role in preventive health care--learning how to eat, exercise, and relax, use vitamins, herbs, and supplements, and maintain the immune system",
        "Category": "",
        "Publisher": "Houghton Mifflin (P)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Healthy Kitchen: Recipes for a Better Body, Life, and Spirit",
        "Authors": "By Weil, Andrew and Daley, Rosie",
        "Description": "Two of America’s most popular authorities on healthy eating and cooking join forces in this inspiring, easy-to-use cookbook. This is not a diet book. It is a lively guide to healthy cooking, day-by-day, packed with essential information and, above all, filled with enticing food.Andrew Weil, M.D.—author of the best-selling Eating Well for Optimum Health—brings to this perfect collaboration a comprehensive philosophy of nutrition grounded in science. Rosie Daley—acclaimed for her best-seller,In the Kitchen with Rosie—brings to it her innovative and highly flavorful spa cuisine.The recipes are eclectic, drawing from the healthy and delicious cooking of the Middle East, the Mediterranean, and Asia, among other cuisines. For starters, you might try Grilled Satay or a Miso Pâté; for soup, often a meal in itself, a hearty Mixed-Bean Minestrone Stew or a Roasted Winter Squash and Apple Soup with Cilantro Walnut Pesto; a special entrée could be the Savory Roasted Cornish Hens with Roasted Garlic or Baked Spicy Tofu with Bean Thread Noodles, Corn, and Mango; for a simple supper, Turkey Burgers or Portobello Burgers; and for the occasional indulgence, a dessert of Almond Fruit Tart or Peach and Blueberry Cobbler.Andy and Rosie do not always agree. When Rosie calls for chicken, Andy offers a tofu alternative; she likes the flavor of coconut milk, whereas he prefers ground nut milk; when she makes a pastry with butter, he suggests using Spectrum Spread. There are no hard-and-fast rules.Lifelong health begins in the kitchen, so this is a lifestyle book as well as a cookbook. In it you will learn from Dr. Weil:• how to make use of nutritional information in everyday cooking• what is organic . . . and how to buy organic foods• the importance of reading labels and what to look for• sensible advice about eggs, milk, cheese, salt, spicy foods, wine, coffee • the facts about sugar and artificial sweeteners. . . and from Rosie:• how to get kids involved—from skinning almonds to layering lasagna• ways to have fun in the kitchen—creating scallion firecrackers and radish rosettes• low-fat and nondairy alternatives for those with special concerns• smart menu planning—letting the seasons be your guide. . . and lots more.This revolutionary book will change forever the way you cook for yourself and your family.With 58 photographs in full color.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Home Owner's Journal, Third Edition",
        "Authors": "By Jenkins, Colleen",
        "Description": "",
        "Category": " House & Home , Reference",
        "Publisher": "Blue Sky Marketing Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Fix-It and Forget-It Recipes for Entertaining: Slow Cooker Favorites for All the Year Round",
        "Authors": "By Ranck, Dawn J. and Good, Phyllis Pellman",
        "Description": "This book is bursting with absolutely delicious recipes, as well as Tips for Hosting, Menus for Meals with Friends, and Ideas for Go-Alongs that compliment clow cooker dishes. You'll love cooking, hosting and eating from this treasure of good food.",
        "Category": " Cooking , Methods , General",
        "Publisher": "Good Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Demon Rumm",
        "Authors": "By Brown, Sandra",
        "Description": "It was the publicity stunt from hell as far as Kirsten Rumm was concerned. She may have been writing the book about her late husband, aeronautical daredevil Demon Rumm, but she didn’t see the need to play host to the arrogant bad-boy actor starring in the film version’s title role. Still, for the good of the project, Kirsten agreed to share her beachfront home with the impossibly sexy screen idol. Any other woman would do anything to be in her sandals, but Kirsten wasn’t falling for Rylan North, even if he did play his role of male lead to perfection. His down-home charm, his gentleness and virile charisma, might be seducing her in every sense of the word, but he was an actor, after all. Seducing an audience was his job. Rylan could have any woman he wanted. So why was he so desperately pretending to want her?From the moment he saw her, Rylan North knew that Kirsten Rumm was the woman he’d been waiting all his life to cast as the star in his real-life love story. What did it matter if he was every woman’s fantasy if he couldn’t get Kirsten to so much as glance his way? He’d caught the look of past hurt behind her sky-blue eyes–a dark secret that shadowed the sparkle. Rylan was determined to find out what tragedy held this passionate woman back from a second chance at love even if it cost him his reputation, his career, and his life. But first he’d have to get Kirsten to act on her instincts . . . and to trust the flesh-and-blood man behind the fantasy.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "A Wrinkle in Time (The Time Quartet)",
        "Authors": "By L'Engle, Madeleine",
        "Description": "This special edition of A Wrinkle in Time includes a new essay that explores the science behind the fantasy.Rediscover one of the most beloved children's books of all time: A Wrinkle in Time by Madeleine L'Engle:Meg Murray, her little brother Charles Wallace, and their mother are having a midnight snack on a dark and stormy night when an unearthly stranger appears at their door.  He claims to have been blown off course, and goes on to tell them that there is such a thing as a \"tesseract,\" which, if you didn't know, is a wrinkle in time.  Meg's father had been experimenting with time-travel when he suddenly disappeared.  Will Meg, Charles Wallace, and their friend Calvin outwit the forces of evil as they search through space for their father?",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1976"
        }
    },
    {
        "Title": "Essentials of Organizational Behavior (6th Edition)",
        "Authors": "By Robbins, Stephen P.",
        "Description": "",
        "Category": " Business & Economics , Management",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Massageworks:  A Practical Encyclopedia of Massage Techniques",
        "Authors": "By Lawrence, D Baloti and Harrison, L.",
        "Description": "Explains how to use various styles of massage to improve physical fitness, treat health problems, reduce tension, and relieve soreness",
        "Category": " Health & Fitness , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "The Partners",
        "Authors": "By Auchincloss, Louis",
        "Description": "",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Bringing Out the Best in People: How to Enjoy Helping Others Excel",
        "Authors": "By McGinnis, Alan Loy",
        "Description": "Fascinating case studies and anecdotes about Lee Iacocca, Sandra Day O'Connor and many others show parents, executives, teachers and more how they can put 12 key principles to work in their families and organizations and gain the satisfaction that comes from bringing out the best in people. Reprint.",
        "Category": " Philosophy , General",
        "Publisher": "Augsburg Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Angel Visions: True Stories of People Who Have Seen Angels, and How You Can See Angels, Too!",
        "Authors": "By Virtue, Doreen (EDT)",
        "Description": "",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Hay House Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Amazing Otters (Books for Young Explorers)",
        "Authors": "By Brownell, M. Barbara",
        "Description": "Introduces in text and illustrations, the physical characteristics, habits, and natural environment of the otter",
        "Category": "",
        "Publisher": "Natl Geographic Soc Childrens books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Hungry, Hungry Sharks (Step-Into-Reading, Step 3)",
        "Authors": "By Joanna Cole",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "World'S Weirdest Sea Creatures-Pbk (8x8)",
        "Authors": "By Roberts, M. L.",
        "Description": "Describes the remarkable anatomy and behavior the wolf fish, tha anglerfish, the squid, the lobster, the manatee, and other marine animals",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Find Waldo Now",
        "Authors": "By Handford, Martin",
        "Description": "In this sequel to \"Where's Waldo?\" readers must find the bespectacled little man in the red-striped shirt as he travels among Egyptians building pyramids, marauding Vikings, Romans in the Colosseum, 1949 gold rush miners, and other populated historical settings",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Fascinating World of Frogs and Toads",
        "Authors": "By Julivert, Angels and Marcel Socias Studios (ILT)",
        "Description": "Describes the physical characteristics, behavior, and habitats of various kinds of frogs and toads.",
        "Category": " Juvenile Nonfiction , Animals , Reptiles & Amphibians",
        "Publisher": "Barrons Juveniles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "DUST: A Richard Jury Mystery",
        "Authors": "By Grimes, Martha",
        "Description": "When an old friend pulls Richard Jury into the investigation of a wealthy bachelor's murder, Jury's not sure what's more perplexing: the circumstances of the fellow's death, the conflicting stories of the man's past, or the motivations of the case's chief inspecting officer, the beautiful and forbidding Lu Aguilar. What Jury is sure of is that he's in over his head, both with the inscrutable and challenging Aguilar and the false leads surrounding the once-charismatic Billy Maples, last seen in a club named Dust.A web of clues draws Jury to London's trendy Clerkenwell galleries, clubs, and hotels, to the dark stories behind Maples's family, and to the Sussex town of Rye, where Billy had temporarily cared for Lamb House, the charming home where Henry James composed his three masterworks ... a place with secrets of its own. With Melrose Plant's investigating Lamb House and with Aguilar's interceding, Scotland Yard's finest, and now infamous, Richard Jury, will need every bit of his intelligence and quiet charm to close in on a mysterious young cousin of Maples's, and crack the case.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking Penguin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Computers Simplified (3-D Visual Series)",
        "Authors": "By Maran, Ruth",
        "Description": "Are you new to computers? Does new technology make you nervous? Relax! You're holding in your hands the easiest guide ever to computers ? a book that skips the long-winded explanations and shows you how things work. All you have to do is open the book, follow the friendly disk character ? and discover just how easy it is to get up to speed.A friendly disk character introduces each taskSelf-contained lessons make learning a snapFull-color illustrations walk you through the basicsUseful tips offer extra hints for each taskSimplified® \"I spent many hours looking for the right book. This is that book! One picture is worth a thousand words. This book is the best computer book I have found; it should be on everyone's shelf.\" ? Larry Ruckert (Ocean Pines, MD)",
        "Category": " Computers , Computer Science",
        "Publisher": "Visual",
        "Price Starting With ($)": "6.02",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Richard Hittleman's Yoga: 28 Day Exercise Plan",
        "Authors": "By Hittleman, Richard",
        "Description": "This short time is all it takes to master the 38  simple exercises in this book. You will quickly  grasp the ancient Yoga secrets of breathing,  concentration, nutrition and muscle control -- in just  minutes of your spare time and without any  discomfort. Day by day you will notice astonishing  results -- loss of weight, greater firmness, more  energy, relief from pain, freedom from stress and an  overall feeling of youthfulness and well-being. This  Yoga regimen will become a lifetime program to  keep your whole organism radiant with a natural  beauty and health.This Yoga regimen  will become a lifetime program to keep your whole  organsim radiant with natural beauty and health!",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "In This Mountain",
        "Authors": "By Karon, Jan",
        "Description": "Father Tim and Cynthia have been at home in Mitford for three years since returning from Whitecap Island.  In the little town that's home-away-from-home to millions of readers, life hums along as usual. Dooley looks toward his career as a vet; Joe Ivey and Fancy Skinner fight a haircut price war that takes no prisoners; and Percy steps out on a limb with a risky new menu item at the Main Street Grill. Though Father Tim dislikes change, he dislikes retirement even more. As he and Cynthia gear up for a year-long ministry across the state line, a series of events sends shock waves through his faith-and the whole town of Mitford. In her seventh novel in the bestselling Mitford Years series, Jan Karon delivers surprises of every kind, including the return of the man in the attic and an ending that no one in Mitford will ever forget.",
        "Category": " Fiction , Religious",
        "Publisher": "Viking",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Fascinated",
        "Authors": "By Schone, Robin, Johnson, Susan, Devine, Thea, and Small, Bertrice (EDT)",
        "Description": "A new anthology of erotic, sensuous historical romance tales presents four original tales, including \"Mastering Lady Lucinda\" by Bertrice Small, Susan Johnson's \"Risking It All,\" \"The Pleasure Game\" by Thea Devine, and \"A Man and a Woman\" by Robin Schone. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Sweet Release",
        "Authors": "By Clare, Pamela",
        "Description": "After purchasing a convict who is near death to save his life, plantation owner Cassie finds herself powerfully drawn to Cole Braden as she nurses him back to health, but unbeknownst to Cassie, Cole is actually an English aristocrat bent on proving his innocence and winning her love. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Dorchester Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Spanish Phrase Book (The Spanish That Kids Really Speak)",
        "Authors": "By Jane Wightwick",
        "Description": "",
        "Category": "",
        "Publisher": "Passport Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Iraq: The Bradt Travel Guide",
        "Authors": "By Dabrowska, Karen",
        "Description": "Iraq today is synonymous in the minds of travelers with the past. Barely two hours from Baghdad, one can walk in the footsteps of Nebuchadnezzar in Babylon or drive past Nineveh's pre-history ochre walls, with their caverns and winged lions.",
        "Category": " Travel , Middle East , General",
        "Publisher": "Bradt Travel Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "James Dean: The Mutant King",
        "Authors": "By Dalton, David",
        "Description": "Contrasts Dean's public and private lives, creating a psychological portrait of the Hollywood actor who came to represent the alienated and rebellious youth of the 1950s",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "St. Martin's Preess",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "My Mother My Self: The Daughter's Search for Identity",
        "Authors": "By Friday, Nancy",
        "Description": "When Nancy Friday began her research for My Mother/My Self in the early 1970’s no work existed that explored the unique interaction between mother and daughter. Today psychotherapists throughout the world acknowledge that if women are to be able to love without possessing, to find work that fulfills them, and to discover their full sexuality, they must first acknowledge their identity as separate from their mother’s. Nancy Friday’s book played a major role in that acceptance. The greatest gift a good mother can give remains unquestioning love planted deep in the first year of life, so deep and anassailable that the tiny child grown to womanhood is never held back by the fear of losing that love, no matter what her own choice in love, sexuality, or work may be.Through candid self-disclosure and hundreds of interviews, Friday investigates a generational legacy and reveals the conflicting feelings of anger, hate, and love the daughter’s hold for their mothers–and why they so often “become” that mother themselves.From the Trade Paperback edition.",
        "Category": " Psychology , General",
        "Publisher": "DELL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "A History of the World in 10 1/2 Chapters",
        "Authors": "By Barnes, Julian",
        "Description": "Offers an idiosyncratic, revisionist history of life on planet Earth, from a playful account of Noah by a stowaway on the Ark, to the spiritual odyssey of a American astronaut",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Parade of Popular Hits (Reader's Digest Songbook)",
        "Authors": "By Reader's Digest Association",
        "Description": "Presents hit songs from the past, including \"More Than You Know,\" \"Chattanooga Choo Choo,\" \"Something's Gotta Give,\" \"That Old Black Magic,\" and \"Buttons and Bows\"",
        "Category": " Music , Printed Music , General",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "A Race on the Edge of Time: Radar-The Decisive Weapon of World War II",
        "Authors": "By Fisher, David E",
        "Description": "Traces the development of radar, explains the strategic edge it gave the Allies in World War II, and argues that radar is still the most important military invention of all time",
        "Category": " History , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Shadow of the Giant (The Shadow Series)",
        "Authors": "By Card, Orson Scott",
        "Description": "The Ender Saga continues with Shadow of the Giant, which parallels the events of Ender's Game from a different character’s point of view.Bean's past was a battle just to survive. He first appeared on the streets of Rotterdam, a tiny child with a mind leagues beyond anyone else. He knew he could not survive through strength; he used his tactical genius to gain acceptance into a children's gang, and then to help make that gang a template for success for all the others. He civilized them, and lived to grow older. Then he was discovered by the recruiters for the Battle School.For Earth was at war - a terrible war with an inscrutable alien enemy. A war that humanity was near to losing. But the long distances of interstellar space has given hope to the defenders of Earth - they had time to train military geniuses up from childhood, forging them into an irresistible force in the high-orbital facility called the Battle School. That story is told in two books, Orson Scott Card's beloved classic Ender's Game, and its parallel, Ender's Shadow. Now, in Shadow of the Giant, Bean's story continues.Bean was the smallest student at the Battle School, but he became Ender Wiggins' right hand, Since then he has grown to be a power on Earth. He served the Hegemon as strategist and general in the terrible wars that followed Ender's defeat of the alien empire attacking Earth. Now he and his wife Petra yearn for a safe place to build a family - something he has never known - but there is nowhere on Earth that does not harbor his enemies - old enemies from the days in Ender's Jeesh, new enemies from the wars on Earth. To find security, Bean and Petra must once again follow in Ender's footsteps. They must leave Earth behind, in the control of the Hegemon, and look to the stars.THE ENDER UNIVERSEEnder seriesEnder’s Game / Speaker for the Dead / Xenocide / Children of the Mind / Ender in Exile / Children of the FleetEnder’s Shadow seriesEnder’s Shadow / Shadow of the Hegemon / Shadow Puppets / Shadow of the Giant / Shadows in FlightThe First Formic War (with Aaron Johnston)Earth Unaware / Earth Afire / Earth AwakensThe Second Formic War (with Aaron Johnston)The Swarm / The HiveEnder novellasA War of Gifts / First Meetings",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Hogarth on High Life: The Marriage á la Mode Series from Georg Christoph Litchtenberg's Commentaries",
        "Authors": "By Wensinger, Arthur S. and Coley, William B.",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Wesleyan University Press",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "For the Baby: Smocks and Sweaters, Samplers, Nursery Accessories, Cuddlies, and Toys to Knit, Crochet, Needlepoint, Sew, Cross-Stitch, Quilt, and Ap",
        "Authors": "By Wilson, Erica",
        "Description": "Offers step-by-step instructions for making more than sixty items for babies--including quilts, sweaters, dresses, pillows, birth samplers, hats, booties, and other articles",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Lost Empires: Living Tribes",
        "Authors": "By Bennett, Ross S. (EDT)",
        "Description": "",
        "Category": " History , General",
        "Publisher": "National Geographic Society",
        "Price Starting With ($)": "8.98",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "The Healing Power of Vitamins, Minerals, and Herbs",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "A comprehensive reference enables readers to make informed decisions about nutritional supplements, from vitamins and minerals to herbal remedies, presented in an alphabetical format and cross-referenced by symptom and ailment.",
        "Category": " Medical , Chemotherapy",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Frigate Constitution and Other Historic Ships",
        "Authors": "By Magoun, Alexander",
        "Description": "Nautical classic presents history, detailed plans, measurements of Constitution, Viking ship, Mayflower, Santa Maria, clipper Flying Cloud, schooner Bluenose. Over 100 illustrations and photos.",
        "Category": " Transportation , Ships & Shipbuilding , History",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Noodles: Over 70 Enticing, Aromatic Dishes - New Influences from the East (Creative Cooking Library Series)",
        "Authors": "By Chan, Kit",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Prepare for the AP World History (BARRON'S HOW TO PREPARE FOR THE AP WORLD HISTORY  ADVANCED PLACEMENT EXAMINATION)",
        "Authors": "By McCannon, John and Jordan, Pam",
        "Description": "Two full-length model AP examinations with answer keys plus a chronological general review of world history make up the greater part of this brand new Advanced Placement test prep manual. Other helpful features include an overview of the exam, and strategies for success in answering multiple-choice and document-based questions, as well as help in answering the comparative essay question. Historical eras in the subject review fall within the five following general categories: Foundations of World Civilization (4000 B.C.-1000 A.D.); World Cultures Maturing (1000-1450); World Cultures Interacting (1450-1750); World Cultures in the Modern Era (1750-1914); and The Twentieth Century and Contemporary World Cultures (1914-present).",
        "Category": " Study Aids , Advanced Placement",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Opera: A Crash Course (Crash Course (Watson-Guptill))",
        "Authors": "By Pettit, Stephen",
        "Description": "",
        "Category": " Music , Genres & Styles , Opera",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Malice",
        "Authors": "By Steel, Danielle",
        "Description": "At seventeen, the night of her mother's funeral, Grace Adams is attacked. It is not the first time, and a brutal crime ensues.And to everyone's horror, Grace will not tell the truth. She is a young woman with secrets too horrible to tell, with hurts so deep they may never heal. She is also beautiful enough for men to want her no matter how much she does not want them. Whatever the outcome, Grace Adams will have to live with whatever happened during those terrible years. After a lifetime of being a victim, now she must pay the price for other people's sins.From the depths of an Illinois women's prison to a Chicago modeling agency to a challenging career in New York, Grace must carry the past with her wherever she goes. And in healing her own pain, she reaches out to battered women and children who live a nightmare she knows all too well.When Grace meets Charles Mackenzie, a New York lawyer, she has found a man who wants nothing from her - except to heal her, to hear her secrets, and to give her the family she so desperately wants. But, with happiness finally within her grasp, and precious loved ones to protect, Grace is at her most vulnerable - in danger of losing everything to a vicious tabloid press and an enemy from her past, an enemy bent on malice at all costs.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "HUMAN BODY AND HOW IT WORKS (Tell Me About)",
        "Authors": "By Shone, Rob (ILT), Royston, Angela, and Forsey, Chris (ILT)",
        "Description": "Questions and answers introduce the human body and how it works.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Building Birdhouses and Feeders (Ortho Library)",
        "Authors": "By Ortho Books (COR), Rae, Norm (EDT), Baldwin, Edward A., and Clapp, Verner Warren",
        "Description": "Provides designs and plans for birdhouses and feeders",
        "Category": " Technology & Engineering , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Christmas Ornaments to Make: 101 Sparkling Holiday Trims",
        "Authors": "By Better Homes and Gardens Books, Dahlstrom, Carol Field (EDT), and Banker, Susan (EDT)",
        "Description": "A comprehensive guide to creating unique, one-of-a-kind ornaments for the holidays presents 101 easy-to-do projects  for both novice and expert crafters, along with step-by-step instructions, patterns, dozens of photographs and illustrations, and a host of creative tips. Original. 60,000 first printing.",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Studies in the Sermon on the Mount: God's Character and the Believer's Conduct (OSWALD CHAMBERS LIBRARY)",
        "Authors": "By Chambers, Oswald",
        "Description": "“All Christians need desperately to read this little volume again and again, until it sinks down into our subconscious minds—all that matters is our relationship with God!”—P. L., MichiganOswald Chambers’ most well-known title, the devotional My Utmost for His Highest, has established him as one of the most influential teachers of our time. But did you know he wrote books on the Bible as well? Now you can take advantage of this teacher’s profound insight on Matthew 5-7 and what it means to focus on God and God alone.",
        "Category": " Religion , Christian Life , Personal Growth",
        "Publisher": "Discovery House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Martha Stewart's Christmas",
        "Authors": "By Stewart, Martha and Baker, Christopher",
        "Description": "The highly successful hostess tells how she prepares for and celebrates the holidays, creating gift baskets, decorating her house, and cooking the Christmas feast",
        "Category": " Cooking , Reference",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Culture Shock! France (Culture Shock! A Survival Guide to Customs & Etiquette)",
        "Authors": "By Taylor, Sally Adamson",
        "Description": "Whether you travel for business, pleasure, or a combination of the two, the ever-popular \"Culture Shock!\" series belongs in your backpack or briefcase. Get the nuts-and-bolts information you need to survive and thrive wherever you go. \"Culture Shock!\" country guides are easy-to-read, accurate, and entertaining crash courses in local customs and etiquette. \"Culture Shock!\" practical guides offer the inside information you need whether you're a student, a parent, a globetrotter, or a working traveler. \"Culture Shock!\" at your Door guides equip you for daily life in some of the world's most cosmopolitan cities. And \"Culture Shock!\" Success Secrets guides offer relevant, practical information with the real-life insights and cultural know-how that can make the difference between business success and failure.Each \"Culture Shock!\" title is written by someone who's lived and worked in the country, and each book is packed with practical, accurate, and enjoyable information to help you find your way and feel at home.",
        "Category": " Travel , Europe , France",
        "Publisher": "Graphic Arts Center Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Texas and the South Central (National Geographic's Driving Guides to America)",
        "Authors": "By White, Mel",
        "Description": "",
        "Category": " Travel , United States , South , West South Central (AR, LA, OK, TX)",
        "Publisher": "Natl Geographic Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Pacific Northwest : Oregon, Washington, and Alaska (National Geographic's Driving Guides to America)",
        "Authors": "By National Geographic Society (U. S.) (COR), Devine, Bob, and Schofield, Phil",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Natl Geographic Society",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "National Geographic's Driving Guide to America: California and Nevada and Hawaii",
        "Authors": "By National Geographic Society (U. S.) (COR), Dunn, Jerry Camarillo, and Schermeister, Phil",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Natl Geographic Society",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "National Geographic Driving Guide to america, Washington DC",
        "Authors": "By National Geographic Society (U. S.) (COR), Kostyal, K. M., Souza, Pete, and Nowitz, Richard",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "How to Be a Lady (A Gentlemanners Book)",
        "Authors": "By Simpson-Giles, Candace",
        "Description": "Whether a woman is a contractor, a stay-at-home mother, or a high-poweredattorney, the suggestions in How to Be a Lady will cause others to think\"Wow! She's got it all together!\"  If a lady is on a diet, she does not speak of it at the table  A lady never eats a meal while behind the wheel of a car  A lady makes it a point to know the names of the teams playing in the    Super BowlThe roles women play in society today are drastically different than theywere 25 years ago, and some of the rules are different as well.Patterned after the successful How to Be a Gentleman, How to Be aLady is a practical book of etiquette that is not snobbish, boring orintimidating. It is designed for a new century by discussing such issues as howto dress for the workplace, the importance of knowing self defense, and how totactfully ask for the sexual history of a person with whom a lady is consideringan intimate relationship.",
        "Category": " Reference , Etiquette",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Literature, the human experience",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Men, Women and Relationships",
        "Authors": "By Gray, John",
        "Description": "John Gray, New York Times bestselling author of Men Are from Mars, Women Are from Venus, reveals that the key to creating and maintaining successful relationships between men and women lies in accepting our differences. By trying to make our partners over in our own likeness, Gray reminds us we destroy what we first found so appealing. Writing with the compassionate understanding that is his trademark, Gray draws on his wealth of experience from twenty years of work in couples therapy, his two mega-selling books, as well as his hugely popular national workshops and seminars. In Men, Women, and Relationships, he ably demonstrates that only through respecting, appreciating, and responding to our natural differences can we achieve real happiness and fulfillment in our relationships. Discover the simple, practical techniques that can enable all of us to experience the healthy, supportive love we deserve.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Agony of Alice",
        "Authors": "By Naylor, Phyllis Reynolds and Mak, Kam (ILT)",
        "Description": "Alice McKinley is about to become a teenager, but she doesn't know how. Her mother has been dead for years, and what do her father and her nineteen-year-old brother, Lester, know about being a teenage girl?   If only she had a role model, like the beautiful sixth-grade teacher Miss Cole. But instead Alice gets assigned to plain, pear-shaped Mrs. Plotkin's class. Is Alice doomed to a life of one embarrassment after another?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Understanding Buying and Selling a House",
        "Authors": "By Phyllis C. Kaufman, Arnold Corrigan, Phyllis C. Kaufman, Arnold Corrigan",
        "Description": "",
        "Category": "",
        "Publisher": "Longmeadow Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Miriam: A Novel",
        "Authors": "By Henderson, Lois T",
        "Description": "Recreates the story of the biblical heroine Miriam, the sister of Moses, whose profound faith and devotion to God and His people made her a key figure in the Exodus and the journey to the Promised Land",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "Simple Little Pleasures (Simpler Times Collection)",
        "Authors": "By Kinkade, Thomas and Buchanan, Anne Christian",
        "Description": "",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "New York : And Pennsylvania and New Jersey (National Geographic's Driving Guides to America)",
        "Authors": "By National Geographic Society (U. S.) (COR), Peffer, Randall S., and Souza, Pete",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Geographic Society",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Plan of Attack",
        "Authors": "By Woodward, Bob",
        "Description": "Plan of Attack is the definitive account of how and why President George W. Bush, his war council, and allies launched a preemptive attack to topple Saddam Hussein and occupy Iraq. Bob Woodward's latest landmark account of Washington decision making provides an original, authoritative narrative of behind-the-scenes maneuvering over two years, examining the causes and consequences of the most controversial war since Vietnam.  Based on interviews with 75 key participants and more than three and a half hours of exclusive interviews with President Bush, Plan of Attack is part presidential history charting the decisions made during 16 critical months; part military history revealing precise details and the evolution of the Top Secret war planning under the restricted codeword Polo Step; and part a harrowing spy story as the CIA dispatches a covert paramilitary team into northern Iraq six months before the start of the war. This team recruited 87 Iraqi spies designated with the cryptonym DB/ROCKSTARS, one of whom turned over the personnel files of all 6,000 men in Saddam Hussein's personal security organization.  What emerges are astonishingly intimate portraits: President Bush in war cabinet meetings in the White House Situation Room and the Oval Office, and in private conversation; Dick Cheney, the focused and driven vice president; Colin Powell, the conflicted and cautious secretary of state; Donald Rumsfeld, the controlling war technocrat; George Tenet, the activist CIA director; Tommy Franks, the profane and demanding general; Condoleezza Rice, the ever-present referee and national security adviser; Karl Rove, the hands-on political strategist; other key members of the White House staff and congressional leadership; and foreign leaders ranging from British Prime Minister Blair to Russian President Putin.  Plan of Attack provides new details on the intelligence assessments of Iraq's alleged weapons of mass destruction and the planning for the war's aftermath.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "S-S-snakes! (Step-Into-Reading, Step 3)",
        "Authors": "By Penner, Lucille Recht and Barrett, Peter (ILT)",
        "Description": "Illus. in full color. A scintillating survey of sensational serpents, from blood-spewing West Indian boas to \"flying\" golden tree snakes.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Volcanoes & Earthquakes - Pbk (Our Planet)",
        "Authors": "By Vrbova, Zuza",
        "Description": "Discusses how and where volcanoes and earthquakes occur and other aspects of these disturbances in the earth",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Earthquakes & Volcanoes",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Petersen's How to Tune Your Car",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Petersen Publishing",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Child in Time (King Penguin)",
        "Authors": "By McEwan, Ian",
        "Description": "Stephen Lewis, a successful writer of children's books, is confronted with the unthinkable: his only child, three-year-old Kate, is snatched from him in a supermarket. In one horrifying moment that replays itself over the years that follow, Stephen realizes his daughter is gone.With extraordinary tenderness and insight, Booker Prize–winning author Ian McEwan takes us into the dark territory of a marriage devastated by the loss of a child. Kate's absence sets Stephen and his wife, Julie, on diverging paths as they each struggle with a grief that only seems to intensify with the passage of time. Eloquent and passionate, the novel concludes in a triumphant scene of love and hope that gives full rein to the author's remarkable gifts. The winner of the Whitbread Prize, The Child in Time is an astonishing novel by one of the finest writers of his generation.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "National Geographic Driving Guide to America: Florida",
        "Authors": "By National Geographic Society (U. S.) (COR), Thompson, John M., and Gehman, Raymond",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "National Geographic Society",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Great Lakes : Illinois, Indiana, Ohio, Michigan, Wisconsin, and Minnesota (National Geographic's Driving Guides to America)",
        "Authors": "By O'Gara, Geoffrey",
        "Description": "A driving guide to the region",
        "Category": " Travel , United States , Midwest , East North Central (IL, IN, MI, OH, WI)",
        "Publisher": "Natl Geographic Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Story Of The White House (Blue Ribbon Book)",
        "Authors": "By Waters, Kate",
        "Description": "A photographic essay captures the history of the White House--from its humble beginnings to today--and offers portraits of the Presidents and First Ladies who have lived in it",
        "Category": " Juvenile Nonfiction , People & Places , United States , General",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "And Then What Happened, Paul Revere?",
        "Authors": "By Fritz, Jean",
        "Description": "Recounts Paul Revere's life as a silversmith and his exciting adventures during the Revolutionary War",
        "Category": "",
        "Publisher": "Putnam Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    }
]