[
    {
        "Title": "Cholesterol: Your Guide for a Healthy Heart (Signet)",
        "Authors": "By Consumer Guide (EDT), Stone, Neil J. (EDT), and McDonald, Arline (EDT)",
        "Description": "Explains the role of cholesterol in the body, discusses the importance of good nutrition, exercise, and stress management, and includes low-fat recipes",
        "Category": " Health & Fitness , General",
        "Publisher": "New Amer Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Beach Girls (Hubbard's Point)",
        "Authors": "By Rice, Luanne",
        "Description": "Luanne Rice is a rarity among novelists today; she's a true storyteller.  Her unique ability to weave together the bonds of love and family with the challenges and rewards of everyday life has garnered her eight consecutive top-ten New York Times bestselling paperbacks.  With Beach Girls, Luanne Rice returns to the place that she was born to write about—the Connecticut shore—to tell a story about a family of women whose lives encompass three generations, their histories intertwined with that of the mystic coastal town that has forever bound them to one another.Beach Girls  explores the complex and contradictory territories of love, family and friendship.  Luanne Rice's sensuous prose and unforgettably rich and textured characters guide us toward a truth that lies within and sometimes beyond our dreams—an enduring strength that we all must embrace to find our way home and into the hearts of those we cherish most. Beach Girls is an enthralling novel of haunting beauty that will resonate long after the final page is turned.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Worst Case Scenario Survival Handbook: Travel",
        "Authors": "By Borgenicht, David and Piven, Joshua",
        "Description": "If you have to leave home, TAKE THIS BOOK! The team that brought you The Worst-Case Scenario Survival Handbook now helps you navigate the perils of travel. Learn what to do when the tarantula crawls up your leg, the riptide pulls you out to sea, the sandstorms headed your way, or your camel just wont stop. Find out how to pass a bribe, remove leeches, climb out of a well, survive a fall onto subway tracks, catch a fish without a rod, and preserve a severed limb. Hands-on, step-by-step instructions show you how to survive these and dozens of other adventures. An appendix of travel tips, useful phrases, and gestures to avoid will also ensure your safe return. Because you just never know...",
        "Category": " Humor , Form , Essays",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Codebreakers: The Inside Story of Bletchley Park",
        "Authors": "By Hinsley, F. H. (EDT) and Stripp, Alan (EDT)",
        "Description": "Familiar to anyone versed in the history of World War II or interested in the study of modern intelligence work, Bletchley Park was arguably the most successful intelligence operation in world history, the top secret workplace of the remarkable people who cracked Germany's vaunted Enigma Code. Almost to the end of the war, the Germans had firm faith in the Enigma ciphering machine, but in fact the codebreakers were deciphering nearly 4,000 German transmissions daily by 1942, reaping a wealth of information on such important matters as the effort to resupply Rommel's army in North Africa and the effect of Allied attempts to mislead the Germans about the location of D-Day landings. Indeed, Winston Churchill hailed the work of Bletchley Park as the \"secret weapon\" that won the war.      Only now, nearly half a century since the end of the Second World War, have any of the men and women in this group come forward to tell this remarkable story in their own words--a story that an oath of secrecy long prevented them from revealing. In Codebreakers, F.H. Hinsley and Alan Stripp have gathered together twenty-seven first-hand accounts of one of the most amazing feats in intelligence history. These engaging memoirs, each written by a different member of the codebreakers team, recount the long hours working in total secrecy and the feelings of camaraderie, tension, excitement, and frustration as these men and women, both British and American, did some of the most important work of the war. These talented people share not only their technical knowledge of cryptography and military logistics, but also poignant personal recollections as well. Walter Eytan, one of a handful of Jews at Betchley Park, recalls intercepting a message from a German vessel which reported that it carried Jews \"en route for Piraeus zur Endlosung (for the final solution).\" Eytan writes \"I had never heard this expression before, but instinctively, I knew what it must mean, and I have never forgotten that moment.\" Vivienne Alford tells of her chilling memory of hearing that the atomic bomb had been dropped on Hiroshima, and the stillness that came over her and her co-workers in Naval Section VI. And William Millward confides that he is still haunted by the work he did in Hut 3 nearly fifty years ago. \"I sometimes wonder, especially during the night, how many sailors I drowned.\"      Few readers will finish this book without feeling that the codebreakers were essential to the outcome of the war--and thereby of major importance in helping to shape the world we live in today.",
        "Category": " History , Europe , Great Britain",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.95",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Donna's Day : Fun Activities That Bring the Family Together",
        "Authors": "By Erickson, Donna and Larochelle, David (ILT)",
        "Description": "Donna Erickson offers parents, grandparents, and other involved adults creative, practical ideas for celebrating the importance of children, strengthening families, and creating memories that last a lifetime. Donna's Day is brimming with fresh, inventive, stimulating activities that prove you don't need endless time or unlimited budgets to entertain and educate kids. Her ideas help answer the question, \"How can I make the precious time I spend with my kids count?\" Throughout, Donna presents her special take on family life - integrating children into everyday routines including cooking, laundry, and raking leaves. It's these little moments together that build relationships and increase self-esteem.",
        "Category": " Family & Relationships , Activities",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Real Plato Jones",
        "Authors": "By Bawden, Nina",
        "Description": "While visiting Greece, thirteen-year-old Plato Jones tries to come to terms with his mixed heritage as he finds out more about his two grandfathers, the Welsh one, a World War II hero, and the Greek one, a supposed traitor",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Ruth",
        "Authors": "By Beaz, Kjersti",
        "Description": "God used Ruth's fierce and loyal spirit to bring about a plan that changed the world forever!",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Religious",
        "Publisher": "Barbour Publishing Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Wheeler's Ghost Town (Wheeler's Adventures)",
        "Authors": "By Schantz, Daniel and Ostendorf, Edward (ILT)",
        "Description": "Two competitive brothers attempt to dig up newsworthy stories in their seemingly uneventful small town in order to win first prize in the junior newspaper reporter contest.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "DK Readers: Pirates: Raiders of the High Seas (Level 4: Proficient Readers) (DK Readers Level 4)",
        "Authors": "By Griffey, Harriet and Maynard, Christopher",
        "Description": "In this Level 4 DK Reader, meet dastardly pirates who lived across the sea, from Captain Blackbeard to Henry Morgan. Learn about the dangerous lives of these swashbuckling villains and find out who got away with murder—and who had to walk the plank. Stunning photographs combine with lively illustrations and engaging, age-appropriate stories in DK Readers, a multilevel reading program guaranteed to capture children's interest while developing their reading skills and general knowledge.With DK Readers, children will learn to read—then read to learn!",
        "Category": " Juvenile Nonfiction , Law & Crime",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "On Board the Titanic: What It Was Like When the Great Liner Sank",
        "Authors": "By Marschall, Ken (ILT) and Tanaka, Shelley",
        "Description": "Named an American Bookseller Pick of the Lists and a Notable Children's Book in the Field of Social Sciences, a vivid account of the infamous shipwreck, as experienced by two young men aboard the ship, includes powerful paintings and ship diagrams. Reprint.",
        "Category": " Juvenile Nonfiction , History , General",
        "Publisher": "Hyperion/Madison Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Nature in Danger (S O S Planet Earth)",
        "Authors": "By O'Neill, Mary Le Duc and Bindon, John (ILT)",
        "Description": "Discusses how the natural resources of the earth and the living things on it are all linked together and being continually threatened by our modern way of life",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Better Homes and Gardens Water Wonders (Fun-to-do Project Books)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Provides instructions for a variety of projects involving handicraft, picture puzzles, or cookery, all relating to water.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "The Road to Wellville",
        "Authors": "By Boyle, T. Coraghessan",
        "Description": "Will Lightbody is a man with a stomach ailment whose only sin is loving his wife, Eleanor, too much. Eleanor is a health nut of the first stripe, and when in 1907 she journeys to Dr. John Harvey Kellogg's infamous Battle Creek Spa to live out the vegetarian ethos, poor Will goes too.So begins T. Coraghessan Boyle's wickedly comic look at turn-of-the-century fanatics in search of the magic pill to prolong their lives--or the profit to be had from manufacturing it. Brimming with a Dickensian cast of characters and laced with wildly wonderful plot twists, Jane Smiley in the New York Times Book Review called The Road to Wellville \"A marvel, enjoyable from beginning to end.\"",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "My Very First Word Book (My Very First)",
        "Authors": "By Wilkes, Angela",
        "Description": "A bright and colorful picture dictionary for young children A bright and colorful picture dictionary for young children. Packed with photographs of children, animals, and everyday objects, each page is designed to make very first learning experiences fun. Words are grouped into themes that focus on a child's daily life, family, and home. Each picture is labeled to help children learn new words.",
        "Category": " Juvenile Nonfiction , Concepts , Alphabet",
        "Publisher": "DK Preschool",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Super Fast, Out of Control! (Marvin Redpost, No. 7)",
        "Authors": "By Wummer, Amy (ILT) and Sachar, Louis",
        "Description": "This chapter book in Newbery Honor–winning and bestselling author Louis Sachar’s Marvin Redpost series is all about daredevils and conquering your fears!    Everyone says that Marvin is going to ride his new mountain bike down Suicide Hill. And everyone is coming to watch him do it—his friends, his family, even his older brother. But the truth is, Marvin can’t climb onto the seat without wobbling. And shifting gears? Braking? Forget about it! What’s Marvin going to do?    Hilarious and relatable, Marvin Redpost is perfect for kids who love to bond with quirky characters like Junie B. Jones and George Brown, Class Clown.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Communist Manifesto",
        "Authors": "By Marx, Karl",
        "Description": "The political tract in which Marx presented the core of his philosophy and revolutionary program, with an introduction analyzing its significance to the realities of today and to Marx's own times",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Othello: The Moor of Venice (Shakespeare, Signet Classic)",
        "Authors": "By Shakespeare, William",
        "Description": "A discussion of the sources and historical background of the play accompanies the text and critical commentaries",
        "Category": " Fiction , Classics",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1962"
        }
    },
    {
        "Title": "Treasure Island (Bantam Classics)",
        "Authors": "By Stevenson, Robert Louis",
        "Description": "Masterfully crafted, Treasure Island is a stunning yarn of piracy on the fiery tropic seas—an unforgettable tale of treachery that embroils a host of legendary swashbucklers from honest young Jim Hawkins to sinister, two-timing Israel Hands to evil incarnate, blind Pew. But above all, Treasure Island is a complex study of good and evil, as embodied by that hero-villain, Long John Silver; the merry unscrupulous buccaneer-rogue whose greedy lust for gold cannot help but win the heart of every one who ever longed for romance, treasure, and adventure.Since its publication in 1883, Treasure Island has provided an enduring literary model for such eminent writers as Anthony Hope, Graham Greene, and Jorge Luis Borges. As David Daiches wrote: “Robert Louis Stevenson transformed the Victorian boys’ adventure into a classic of its kind.”",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Adult Coloring - Designer Series - Daydream Designs",
        "Authors": "By Kappa Books Publishers",
        "Description": "",
        "Category": "",
        "Publisher": "Kappa Books Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2016"
        }
    },
    {
        "Title": "I Heard That Song Before",
        "Authors": "By Clark, Mary Higgins",
        "Description": "In a riveting psychological thriller, Mary Higgins Clark takes the reader deep into the mysteries of the human mind, where memories may be the most dangerous things of all.At the center of her novel is Kay Lansing, who has grown up in Englewood, New Jersey, daughter of the landscaper to the wealthy and powerful Carrington family. Their mansion -- a historic seventeenth-century manor house transported stone by stone from Wales in 1848 -- has a hidden chapel. One day, accompanying her father to work, six-year-old Kay succumbs to curiosity and sneaks into the chapel. There, she overhears a quarrel between a man and a woman who is demanding money from him. When she says that this will be the last time, his caustic response is: \"I heard that song before.\"  That same evening, the Carringtons hold a formal dinner dance after which Peter Carrington, a student at Princeton, drives home Susan Althorp, the eighteen-year-old daughter of neighbors. While her parents hear her come in, she is not in her room the next morning and is never seen or heard from again.  Throughout the years, a cloud of suspicion hangs over Peter Carrington. At age forty-two, head of the family business empire, he is still \"a person of interest\" in the eyes of the police, not only for Susan Althorp's disappearance but also for the subsequent drowning death of his own pregnant wife in their swimming pool.  Kay Lansing, now living in New York and working as a librarian in Englewood, goes to see Peter Carrington to ask for permission to hold a cocktail party on his estate to benefit a literacy program, which he later grants. Kay comes to see Peter as maligned and misunderstood, and when he begins to court her after the cocktail party, she falls in love with him. Over the objections of her beloved grandmother Margaret O'Neil, who raised her after her parents' early deaths, she marries him. To her dismay, she soon finds that he is a sleepwalker whose nocturnal wanderings draw him to the spot at the pool where his wife met her end.  Susan Althorp's mother, Gladys, has always been convinced that Peter Carrington is responsible for her daughter's disappearance, a belief shared by many in the community. Disregarding her husband's protests about reopening the case, Gladys, now terminally ill, has hired a retired New York City detective to try to find out what happened to her daughter. Gladys wants to know before she dies.  Kay, too, has developed gnawing doubts about her husband. She believes that the key to the truth about his guilt or innocence lies in the scene she witnessed as a child in the chapel and knows she must learn the identity of the man and woman who quarreled there that day. Yet, she plunges into this pursuit realizing that \"that knowledge may not be enough to save my husband's life, if indeed it deserves to be saved.\" What Kay does not even remotely suspect is that uncovering what lies behind these memories may cost her her own life.  I Heard That Song Before once again dramatically reconfirms Mary Higgins Clark's worldwide reputation as a master storyteller.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Mother, Help Me Live (One Last Wish)",
        "Authors": "By McDaniel, Lurlene",
        "Description": "Sarah McGreggor has leukemia and needs a bone  marrow transplant. It is at this critical moment that  Sarah learns she was adopted. When the \"One  Last Wish\" check arrives, Sarah decides to  search for her birth mother--and a chance for life.",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "The Innocent Man",
        "Authors": "By Grisham, John",
        "Description": "#1 NEW YORK TIMES BESTSELLER • John Grisham’s first work of nonfiction: a true crime story that will terrify anyone who believes in the presumption of innocence. NOW A NETFLIX ORIGINAL DOCUMENTARY SERIES “Both an American tragedy and [Grisham’s] strongest legal thriller yet, all the more gripping because it happens to be true.”—Entertainment Weekly In the town of Ada, Oklahoma, Ron Williamson was going to be the next Mickey Mantle. But on his way to the Big Leagues, Ron stumbled, his dreams broken by drinking, drugs, and women. Then, on a winter night in 1982, not far from Ron’s home, a young cocktail waitress named Debra Sue Carter was savagely murdered. The investigation led nowhere. Until, on the flimsiest evidence, it led to Ron Williamson. The washed-up small-town hero was charged, tried, and sentenced to death—in a trial littered with lying witnesses and tainted evidence that would shatter a man’s already broken life, and let a true killer go free. Impeccably researched, grippingly told, filled with eleventh-hour drama, The Innocent Man reads like a page-turning legal thriller. It is a book no American can afford to miss. Praise for The Innocent Man “Grisham has crafted a legal thriller every bit as suspenseful and fast-paced as his bestselling fiction.”—The Boston Globe “A gritty, harrowing true-crime story.”—Time “A triumph.”—The Seattle Times",
        "Category": " Social Science , Penology",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Smasher (Stepping Stone, paper)",
        "Authors": "By King-Smith, Dick and Bernal, Richard (ILT)",
        "Description": "Dick King-Smith brings his signature wit and charm to the Stepping Stone line with a lovable new puppy who's sure to capture readers' hearts. Smasher is always getting into trouble, whether it's chasing chickens, chewing up Mrs. Buzzard's slippers, or breaking all her china. Now she wants to get rid of him. Can Farmer Buzzard find a way to save him? Or is Smasher in the doghouse...for good?",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Cat Who Wasn't There",
        "Authors": "By Braun, Lilian Jackson",
        "Description": "In this mystery in the bestselling Cat Who series, Jim Qwilleran takes a trip to Scotland and brings home a case that only his cats Koko and Yum Yum can solve...Qwill’s on his way to Scotland—and on his way to solving another purr-plexing mystery. But this time, Koko’s nowhere near the scene of the crime. He and Yum Yum are back in Pickax, being coddled by a catsitter...but Koko won’t sit still once Qwill’s traveling party returns—minus one member. He’s behaving oddly, and Qwill knows what that means: Koko may have been miles away from the murder scene—but he’s just a whisker away from cracking the case!",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Listen for Rachel",
        "Authors": "By Kassem, Lou",
        "Description": "Feeling lonely and unhappy in her Tennessee mountain home with her grandparents, orphaned Rachel feels out of place among the mountain people who believe that, at fifteen, she should prepare herself for marriage. Reprint.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Flare",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "All Through the Night (Holiday Classics)",
        "Authors": "By Clark, Mary Higgins",
        "Description": "Mary Higgins Clark, the Queen of Suspense, celebrates the season with this Christmas classic featuring two of her most beloved characters.   ALL THROUGH THE NIGHT   All of Alvirah's deductive powers and Willy's world-class common sense are called upon as the two stumble into a Christmas mystery. A woman abandons her newborn at a Manhattan church. Simultaneously, a thief is absconding with a treasured artifact, a chalice adorned with a star-shaped diamond. To elude police, he grabs the stroller and disappears. Seven years later, the mother returns to the scene and finds Alvirah and Willy helping neighborhood kids prepare for a Christmas pageant at an after-school shelter. Soon the savvy sleuths set out to solve the puzzle of the missing child and chalice -- and to unmask scam artists threatening to shut down the shelter.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Ask the Bones: Scary Stories from Around the World",
        "Authors": "By Schwartz, Howard (EDT), Olson, Arielle North (EDT), and Linn, David (ILT)",
        "Description": "What is real and what is imaginary? Do evil creatures lurk in the shadows? Do demons attack the helpless? Are there such things as invisible men? For generations, storytellers have given substance to our worst fears. In Ask the Bones, master storytellers Arielle North Olson and Howard Schwartz retell a varied selection of the world's most frightening folktales. Be warned-these stories could scare you to death!Illustrated by David Linn.\"These twenty-two stories provide a wide variety of supernatural happenings that won't disappoint the young horror acolyte.\" (The Horn Book, starred review)",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "From This Day",
        "Authors": "By Roberts, Nora",
        "Description": "From This Day by Nora Roberts released on May 23, 2003 is available now for purchase.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "And I Mean It, Stanley",
        "Authors": "By Bonsall, Crosby Newell",
        "Description": "A little girl builds a \"truly great thing\" out of junk. Her friend Stanley is nowhere to be found. But who is Stanley anyway? What a mystery! Until the great thing is almost complete, that is. Then, it's playtime, and there's just no stopping Stanley.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Hidden Agendas (Tom Clancy's Net Force, Book 2)",
        "Authors": "By Clancy, Tom",
        "Description": "In the year 2010, computers are the new                                         superpower. Those who control them control                                         the world. To enforce the New Laws,                                         Congress creates the ultimate computer                                         security agency with the FBI: the Net Force.                                          Instructions on how to make a bomb...a list of                                         every U.S. spy in the Euro-Asian                                         theater...Someone with access to classified                                         information is posting it on the Internet-and                                         it's costing lives. Net Force Commander Alex                                         Michaels is in the hot seat. Now, before a                                         hostile Senate committee, he must justify the                                         very existence of the Net Force.                                          Meanwhile, a virus is unleashed that throws                                         the federal financial systems into chaos. And                                         the Net Force operatives must hunt the wily                                         hacker through the twists and turns of                                         cyberspace-down a path that leads them                                         dangerously close to home...",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Lift-the-Flap Bible (Lift-The-Flap Book)",
        "Authors": "By Lloyd-Jones, Sally and Moroney, Tracey (ILT)",
        "Description": "Rich illustrations with forty-five interactive lift-the-flaps provide preschoolers with twelve tales from the Old and New Testaments, such as Noah's Ark and the creation of the world.",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Little School Bus That Talked (Storytime Books)",
        "Authors": "By Eldrid, Brenda Martin",
        "Description": "",
        "Category": "",
        "Publisher": "McClanahan Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Alice in Wonderland: Treasury of Illustrated Classics",
        "Authors": "By Carroll, Lewis (EDT)",
        "Description": "",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Adaptations",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "20,000 Leagues Under The Sea - Pbk (Ic) (Troll Illustrated Classics)",
        "Authors": "By Verne, Jules, James, Raymond, and Geehan, Wayne (ILT)",
        "Description": "An adaptation for a young audience of the nineteenth-century tale of an electric submarine, its eccentric captain, and the undersea world, which anticipated many of the scientific achievements of the twentieth century.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "little peter cottontail",
        "Authors": "By Thornton W. Burgess",
        "Description": "",
        "Category": "",
        "Publisher": "Wonder Books",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "THE PRINCE'S TOOTH IS LOOSE (Pictureback Readers)",
        "Authors": "By Ziefert, Harriet and Alley, R. W. (ILT)",
        "Description": "When the prince complains that he cannot eat because he has a loose tooth, everyone rallies to help him make it come out",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Romantic Journey the Story Thomas Cook",
        "Authors": "By Edmund Swinglehurst",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "From Moses to Einstein;: They all are Jews",
        "Authors": "By Davis, Mac",
        "Description": "",
        "Category": "",
        "Publisher": "Jordan Pub. Co",
        "Price Starting With ($)": "6.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "The Best Nickname (Big Little Golden Books)",
        "Authors": "By Anastasio, Dina",
        "Description": "Everyone has a nickname except Nicky until his pals in the Sixth Street Club come up with a special name.",
        "Category": "",
        "Publisher": "Goldencraft",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Ideals Christmas (Vol 52, No 8)",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publications Corp.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Osceola: Seminole Warrior",
        "Authors": "By Oppenheim, Joanne and Ternay, Bill (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "This Home for Me",
        "Authors": "By Solveig P Russell",
        "Description": "",
        "Category": "",
        "Publisher": "Broadman Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "I Love You Rhymes (Mother Goose Rainbow Books)",
        "Authors": "By Jon Goodell",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The winter of the world",
        "Authors": "By Anderson, Poul",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Beyond the Chocolate War",
        "Authors": "By Cormier, Robert",
        "Description": "The school year is almost at an end, and the chocolate sale is past history.  But no one at Trinity School can forget The Chocolate War.Devious Archie Costello, commander of the secret school organizationcalled the Virgils, stall has some torturous assignments to hand out before he graduates.  In spite of this pleasure, Archie is troubled by his right-hand man, Obie, who has started to move away from the Virgils.  Luckily Archie knows his stooges will fix that.  But won't Archie be shocked when he discovers the surprise Obie has waiting for him?And there are surprises waiting for others.  The time for revenge has come to those boys who secretly suffered the trials of Trinity.  The fuse is set for the final explosion.  Who will survive?",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Peter Pan and Wendy , A Little Golden Book",
        "Authors": "By Bedford, Annie North",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "The Gifts of Christmas (Little Golden Book)",
        "Authors": "By Butcher, Samuel J. (ILT) and Mitter, Matt",
        "Description": "A brightly illustrated holiday book featuring the wide-eyed Precious Moments kids captures the many joys of Christmas, from hanging cards to singing songs.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "What Comes in 2's, 3's & 4's?",
        "Authors": "By Aker, Suzanne and Karlin, Bernie (ILT)",
        "Description": "Introduces the numbers two, three, and four by counting the ways in which they occur in everyday life, from your two eyes and two arms to the four seasons of the year",
        "Category": " Juvenile Nonfiction , Concepts , Counting & Numbers",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "The Masters of Solitude",
        "Authors": "By Marvin Kaye, Parke Godwin",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "July",
            "Year": "1979"
        }
    },
    {
        "Title": "Pemberley: Or Pride and Prejudice Continued",
        "Authors": "By Tennant, Emma",
        "Description": "As Jane Austen's beloved novel Pride and Prejudice comes to a close, Elizabeth Bennet proudly announces her engagement to Mr. Darcy, boasting, \"We are to be the happiest couple in the world.\" But after the nuptials, can a marriage between two people as strong-willed as Elizabeth and Darcy survive? With all the wit and style of Jane Austen, Emma Tennant brilliantly imagines both the perils and pleasure of such a marriage.It's now a year after the wedding, and the time has come for Elizabeth and Darcy to invite their families to visit Pemberley—but not without trepidation, for any gathering that includes both Mrs. Bennet and Lady Catherine de Bourgh must occasion gaffes and hurt feelings. And when Darcy becomes increasingly distant and Elizabeth falls prey to vicious gossip, the forces of pride and prejudice are at work once again in this \"eminently enjoyable\" continuation of Pride and Prejudice (Los Angeles Times).",
        "Category": " Fiction , Historical , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Jed's Junior Space Patrol (Dial easy-to-read)",
        "Authors": "By Marzollo, Jean, Marzollo, Claudio",
        "Description": "",
        "Category": "",
        "Publisher": "Dial Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Wedding Blessings: Prayers and Poems Celebrating Love, Marriage and Anniversaries",
        "Authors": "By Cotner, June (EDT)",
        "Description": "A beautiful collection of poems, prayers, and toasts for all marriage celebrations.Finding the right words about love for a wedding or anniversary can be difficult. In Wedding Blessings, June Cotner has collected perfect selections for the bride, groom, members of the wedding party, and other family and friends to share. From verses and vows to prayers and toasts, the sentiments of Wedding Blessings will help make any marriage celebration more memorable. With selections devoted to \"anniversaries\" and \"Reflections\", Wedding Blessings also serves as a tribute to and affirmation of marriage.Filled with inspiration and timeless words by renowned authors such as Robert Browning, Rainer Maria Rilke, the Persian poet Rumi, as well as many contemporary writers, this spiritual, multi-faith anthology offers true gems suitable for all aspects of weddings, anniversaries, and vow-renewal ceremonies. Wedding Blessings is a wonderful gift for the bride-to-be and others celebrating the union of marriage.",
        "Category": " Reference , Weddings",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Stay in Line (Hello Math Reader, Level 2, Kindergarten-Grade 2)",
        "Authors": "By Slater, Teddy and Fiammenghi, Gioia (ILT)",
        "Description": "Instructed by their teacher to stay in line during a class trip to the zoo, twelve playful children participate in a clever rhyming exercise in which they stay in line by twos, threes, fours, and sixes. Original.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Christmas At Home: Holiday Party Planner",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Humble Creek",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Math Smarts: Tips, Tricks, and Secrets for Making Math More Fun! (American Girl Library)",
        "Authors": "By Long, Lynette and McGuinness, Tracy (ILT)",
        "Description": "In girl-friendly terms, describes the importance of mathematics in everyday life and offers advice on how to make learning math skills easier. Original.",
        "Category": " Juvenile Nonfiction , Mathematics , General",
        "Publisher": "American Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Condensed Chicken Soup for the Soul",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Hansen, Patty (COM)",
        "Description": "This special gift edition of Chicken Soup for the Soul is a collection of the authors' favorite stories from the original Chicken Soup for the Soul, A 2nd Helping of Chicken Soup for the Soul and A 3rd Serving of Chicken Soup for the Soul. Sized so you can carry it comfortably in your purse or pocket, it's the ideal emotional pick-me-up. Whether you are enjoying the healing power of Chicken Soup for the first time or are a longtime fan revisiting the stories that touched you most, you will find comfort and solace in this nourishing anthology.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Hci",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "A Woman's Guide to Spiritual Warfare: A Woman's Guide for Battle (Woman's Guides)",
        "Authors": "By Sherrer, Quin",
        "Description": "Provides women with advice on dealing with family and personal crises from a Christian perspective",
        "Category": " Religion , General",
        "Publisher": "Servant Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "If You Will Ask: Reflections on the Power of Prayer (OSWALD CHAMBERS LIBRARY)",
        "Authors": "By Chambers, Oswald",
        "Description": "Sometimes we're blind in our prayers. Mary Magdalene was weeping at the tomb, asking for the dead body of Jesus. Whom was she asking? Jesus Himself, yet she did not know it. In his matchless way, Oswald Chambers reflects on the truth and the enormous power of prayer.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Discovery House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Thrall's Tale",
        "Authors": "By Lindbergh, Judith",
        "Description": "A tale set in Viking Greenland at the turn of the ninth century follows the intertwined lives of three women straddling the pagan past and Christian future, from the slave Katla, who anticipates the promise of a new land; to Bibrau, the daughter born to Katla after a brutal rape; to the prophetess Thorbjorg, who teaches Norse magic to Bibrau. A first novel. Reprint. 150,000 first printing.",
        "Category": " Fiction , Historical",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Superman Syndrome: Finding God's Strength Where You Least Expect It",
        "Authors": "By Kuhatschek, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Ready",
        "Authors": "By Monroe, Lucy",
        "Description": "The victim of a twisted stalker who has threatened to harm her family, author Lise Barton flees to Seattle to start a new life, until a former Army Ranger, hired by her brother to bring her home for the holidays, enters the picture, placing her life in a whole new kind of danger. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Just Beyond the Clouds (Cody Gunner Series #2)",
        "Authors": "By Kingsbury, Karen",
        "Description": "#1 bestselling author Karen Kingsbury tells the heartwrenching story of Cody Gunner, a widower fighting for stability, and the woman who wants to help him trust again--even when trust is the most terrifying thing of all.Still aching over his wife's death, Cody Gunner can't bear the thought of also letting go of his Down's Syndrome brother, Carl Joseph. Cody wants his brother home, where he will be safe and cared for, not out on his own in a world that Cody knows all too well can be heartless and insecure. So when Carl Joseph's teacher, Elle, begins championing his independence, she finds herself at odds with Cody. But even as these two battle it out, they can't deny the instinctive connection they share, and Cody faces a crisis of the heart. What if Elle is the one woman who can teach Cody that love is still possible? If Cody can let go of his lingering anger, he might just see that sometimes the brightest hope of all lies just beyond the clouds.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Center Street",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "101 Uses for a Bridesmaid Dress",
        "Authors": "By Walker, Cindy",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow & Company, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Bless Your Socks Off (Renewing the Heart)",
        "Authors": "By Aldrich, Sandra Picklesimer",
        "Description": "Aldrich unleashes the power of encouragement with humor and no-nonsense advice that offers readers a practical approach to giving and receiving encouragement.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Focus on the Family",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Five Children and It",
        "Authors": "By NESBIT, E.",
        "Description": "",
        "Category": "",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "14.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Scarlet Letter (Case Studies in Contemporary Criticism)",
        "Authors": "By Hawthorne, Nathaniel and Murfin, Ross C.",
        "Description": "Adopted at more than 1,000 colleges and universities, Bedford/St. Martin's innovative Case Studies in Contemporary Criticism series has introduced more than a quarter of a million students to literary theory and earned enthusiastic praise nationwide. Along with an authoritative text of a major literary work, each volume presents critical essays, selected or prepared especially for students, that approach the work from several contemporary critical perspectives, such as gender criticism and cultural studies. Each essay is accompanied by an introduction (with bibliography) to the history, principles, and practice of its critical perspective. Every volume also surveys the biographical, historical, and critical contexts of the literary work and concludes with a glossary of critical terms. New editions reprint cultural documents that contextualize the literary works and feature essays that show how critical perspectives can be combined.",
        "Category": " Fiction , Classics",
        "Publisher": "Bedford/St Martins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Nicholas: The Lords of Satyr",
        "Authors": "By Amber, Elizabeth",
        "Description": "The last in a fabled line of otherworldly aristocracy, the Lords of Satyr are born to wealth, power, and a talent for sensual delight that mere mortals only dream of. Commanded to marry, these passionate men will travel to Rome, Venice, and Paris--and along the way will explore desires both shamelessly wicked and blissfully divine.  .  .       He Had Sworn To Take A Proper Wife.  He Hadn't Bargained On Meeting His Match.  .  .      Nicholas looks very much like what he is--the handsome, successful heir to a vineyard in Tuscany. But Nicholas is much more, for he is one of the last in an ancient line of satyr men. And the dying king of ElseWorld wants him not only to marry, but to wed one of the king's own daughters--a half-human, half-faerie woman unaware of her heritage. Nicholas won't shirk his duty to produce heirs to guard his race's legacies, but he never plans to make his bride his only lover. A satyr's sexual hunger and sensual skills are legendary. One woman will never satisfy him.     Or so Nicholas believes until he meets Jane. As spirited as she is fey, as beautiful as she is innocent, she is nevertheless determined to make her new husband hers alone--and she's eager for him to teach her every deliciously carnal secret he knows.  .  .   Nicholas:     \".  .  .the leading man is the sexiest one this reader has seen in a long time!\" --Romantic Times    First place winner in Judge A Book By Its Cover, single title 2008, and in the First Coast Romance Writers, Beacon Contest. Placed or finaled in 7 other RWA regional contests including the National Readers Choice Award.    On the Nielsen BookScan list of Top 100 best-sellers    \".  .  .keeps hold of your heart and mind.\"-- Joyfully Reviewed, Recommended Read    \".  .  .on my top ten favorite erotic books list.  .  .a double thumbs up. -- Night Owl Romance, 5 stars",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Aphrodisia",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Better Homes and Gardens Kid's Lunches",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Gives recipes for salads, pasta dishes, pizza, hamburgers, chili, soups, tacos, sandwiches, chicken, muffins, breads, stews, snacks, and desserts",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "The Seeress of Kell (The Malloreon, Book 5)",
        "Authors": "By Eddings, David",
        "Description": "THE FINAL RECKONINGTime was running out for Garion and his companions in their quest to recover Garion's infant son and heir. If they could not locate the Place Which Is No More, then Zandramas, the Child of Dark, would use Garion's son in a rite that would raise the Dark Prophecy to eternal dominion over the universe!Only the Seeress of Kell could reveal the site of that mysterious place--and that she could do only once Garion and Polgara had fulfilled an ancient prophecy in the mountain fastness of the Seers . . .Kell itself was closed to Zandramas--but her dark magic could force the knowledge she needed from one of Garion's party. She laid her traps and dispatched her foul minions, determined to claim the world for the Dark God. But Garion would let nothing stand between him and his son . . .Here is the epochal conclusion to David Eddings' bestselling The Malloreon, the culmination of an unparalleled quest across strange lands and among strange peoples--a magnificent fantasy of men, Kings, Sorcerers, and Gods caught up in the seven-thousand-year war between two ancient, opposing Destinies battling to determine the fate of all creation.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Night Judgement at Sinos (Night Judgment at Sinos)",
        "Authors": "By Higgins, Jack",
        "Description": "The island of Sinos. Strategically positioned between Greece and Turkey, this small Mediterranean isle is a relic of the past--an old Turkish stronghold fortified by the Nazis during World War II. Now it has become a prison for political offenders from the Greek mainland. A fortress of grim solitude andsecrets, Sinos is the last place anyone would voluntarily enter--but deep sea diver Jack Savage has little choice. After losing his boat in a suspicious explosion, Savage is approached by shipping magnate Dimitri Aleko. The multi-millionaire has taken an extreme interest in Savage's background as a Royal Marine Commando and his expertise in underwater sabotage. Aleko also has a job for Savage: masterminding the ultimate breakout...For on the prison island of Sinos, one man holds the fate of thousands in his hands. And Jack Savage is the key to unlocking that fate.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Battlefield Earth : A Saga of the Year 3000",
        "Authors": "By HUBBARD, L. R.",
        "Description": "",
        "Category": "",
        "Publisher": "Bridge Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Up and Away, Reptar!",
        "Authors": "By Rillo, Cary (ILT) and Willson, Sarah",
        "Description": "From the earliest stages of sounding out words to the excitement of reading a whole book without help, Ready-to-Read books open up a world of possibilities to children at three different levels:Level 1: Starting to ReadLevel 2: Reading TogetherLevel 3: Reading AloneHooray! It's the day of the Reptar parade and fair! Tommy, Dil, and their friends are there to carry the big Reptar balloon. But what are the other babies to do when the balloon takes off with Dil? Not to worry -- Reptar knows just how to save the day!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "14.57",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Forging the Darksword: The Darksword Trilogy, Volume 1",
        "Authors": "By Weis, Margaret and Hickman, Tracy",
        "Description": "From the bestselling authors of The Rose of the Prophet and The Death Gate Cycle, the first in a majestic saga of magic, fantasy, and adventure   In the enchanted realm of Merilon, magic is life.   Born without magical abilities and denied his birthright, Joram is left for dead. Yet he grows to manhood in a remote country village, hiding his lack of powers only through constant vigilance and ever more skillful sleight-of-hand.   Forced to kill a man in self-defense, Joram can keep his secret from the townspeople no longer: he has no magic, no life. Fleeing to the Outlands, Joram joins the outlawed Technologists, who practice the long forbidden arts of science. Here he meets the scholarly catalyst Saryon, who has been sent on a special mission to hunt down a mysterious “dead man” and instead finds himself in a battle of wits and power with a renegade warlock of the dark Duuk-tsarith caste.   Together, Joram and Saryon begin their quest toward a greater destiny—a destiny that begins with the discovery of the secret books that will enable them to overthrow the evil usurper Blachloch . . . and forge the powerful magic-absorbing Darksword.",
        "Category": "",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "The Tale of Peter Rabbit (The Peter Rabbit Classics)",
        "Authors": "By Potter, Beatrix",
        "Description": "Peter disobeys his mother by going into Mr. McGregor's garden and almost gets caught.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Hip-O Gets a Pet (Hooked on Phonics, Book 11)",
        "Authors": "By Barney Saltzberg",
        "Description": "",
        "Category": "",
        "Publisher": "Hooked on Phonics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Too Old for This, Too Young for That!: Your Survival Guide for the Middle-School Years",
        "Authors": "By Verdick, Elizabeth (EDT), Mosatche, Harriet S., Ph.D., and Unger, Karen",
        "Description": "No wonder it’s called “middle school.” If you’re in grades 6–9, you’re not a child anymore…but you’re not a grown-up either. You have more freedom…but not enough. Your life is more exciting…and more stressful. You’re faced with a lot of decisions…but where can you turn for advice? Your friends are as confused as you are, and your parents might not understand what you’re going through. Finally there’s a survival guide especially for middle schoolers. Comprehensive, interactive, friendly, and fun, it addresses issues that matter to young people this age. Survival tips cover everything from the physical and emotional changes and how to cope, to dealing with family, friends, and school, to taking charge of your life through good decision making and goal setting. Packed with facts, advice, quotes from kids, and helpful tips for surviving the in-between years, this is just what boys and girls need to make the most of middle school—and beyond.",
        "Category": " Juvenile Nonfiction , Social Topics , General",
        "Publisher": "Free Spirit Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The Thank You Book: Hundreds of Clever, Meaningful, and Purposeful Ways to Say Thank You",
        "Authors": "By Spizman, Robyn Freedman",
        "Description": "Available again in a freshly redesigned edition, The Thank You Book teaches you what to say and how to say it in more unique and clever ways than you've ever imagined.",
        "Category": " Self-help , Creativity",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Catholic Prayer Book",
        "Authors": "By Buckley, Michael (COM) and Castle, Tony (EDT)",
        "Description": "In a day when Catholics have less time and yet a greater need than ever for personal prayer, The Catholic Prayer Book is a much-needed resource. Filled with a wide range of prayer from the rich tradition of the Church-including personal, family, and liturgical prayer and prayer for special occasions. The Catholic Prayer Book serves as a treasury of Catholic worship from ancient times up to the present day. LEATHERETTE EDITION ALSO AVAILABLE&#151; CLICK HERE FOR DETAILS. A Servant Book.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Servant",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Saints",
        "Authors": "By Trickey-Bapty, Carolyn",
        "Description": "",
        "Category": " Religion , Christianity , Christian Science",
        "Publisher": "Regina Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Count of Eleven",
        "Authors": "By Campbell, Ramsey",
        "Description": "Just when he feels that his life is on the right track, Jack Orchard finds that a chain letter he has thrown away has brought him terrible luck, and he is determined to make things right again by keeping the chain going, no matter what. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Runaways",
        "Authors": "By Andrews, V. C.",
        "Description": "The spellbinding Orphans series concludes in this thrilling new novel from V.C. Andrews®...  \"All for one and one for all\" was the girls' motto. In the grim foster home for orphans run by Louise and Gordon Tooey, at least Brooke, Crystal, Raven, and Butterfly had each other. Calling themselves \"sisters,\" together they could forget the past and dream of a new chance...a real home. Then they discovered a secret even more haunting than Gordon's heavy boots pounding on the wooden floors. Their fragile hopes of a better life shattered, they escaped the only way they could. Soon they were runaways in a borrowed car, desperately wishing to wake up one morning in a place of sunshine and love.  Raven hoped to be a singer, Butterfly wanted to be a dancer, Crystal planned for college, and Brooke privately hoped to find her mother in California. On the open road the chains of sadness that had bound them seemed to melt away, and the kindness of strangers made a secure future seem almost real. But the highway was a dangerous place, and soon they were penniless and more vulnerable than ever. Alone under the wide western sky, they had only each other to ask if they should give up their dreams...or if they were really halfway to a haven of safety and happiness....",
        "Category": " Fiction , Horror",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Crystal (Orphans Series)",
        "Authors": "By Andrews, V. C.",
        "Description": "The second title in a \"miniseries\" that will climax in a full-length novel follows an orphaned girl's struggle to realize her dreams of a life of love and happiness away from the shadows of her dark past. Original.",
        "Category": " Fiction , Horror",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "No Peeking (Christmas Foil Books)",
        "Authors": "By Reasoner, Charles",
        "Description": "A child wonders what sort of toy or other delight is hidden in a brightly wrapped Christmas package.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Word for word",
        "Authors": "By Rooney, Andrew A.",
        "Description": "The humorist and commentator offers a collection of essays on such topics as psychiatrists, diets, sweepstakes, spies, the fifty-first state, politics, repairmen, grandfatherhood, and gardening",
        "Category": " Humor , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Aladdin and the Magic Lamp (Read With Me Paperbacks)",
        "Authors": "By Horowitz, Jordan and Buddy, Joe (ILT)",
        "Description": "With the aid of a genie from a magic lamp, Aladdin fights an evil magician and wins the hand of a beautiful princess.",
        "Category": "",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Acceptable Risk (A Medical Thriller)",
        "Authors": "By Cook, Robin",
        "Description": "Robin Cook has always been on the cutting edge of the latest medical controversies.  In Acceptable Risk, he confronts one of the most provocative issues of our time:  personality-altering drugs and the complex moral questions they raise.  Neuroscientist Edward Armstrong has managed to isolate a psychotropic drug with a strange and dark history--one that may account for the public hysteria during the Salem witch trials.  In a brilliant designer-drug transformation, it is developed into an antidepressant with truly startling therapeutic capabilities.  But who can be sure the drug is safe for consumers?  Who defines the boundaries of \"normal\" human behavior?  And if the drug's side effects are proven to be dangerous--even terrifying--how far will the medical community go to alter their standards of...Acceptable Risk.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "High Country (An Anna Pigeon Novel)",
        "Authors": "By Barr, Nevada",
        "Description": "It's fall in the Sierra Mountains, and Anna Pigeon is slinging hash in Yosemite National Park's historic Ahwahnee Hotel. Four young people, all seasonal park employees, have disappeared, and two weeks of work by crack search-and-rescue teams have failed to turn up a single clue; investigators are unsure as to whether the four went AWOL for reasons of their own - or died in the park. Needing an out-of-park ranger to work undercover, Anna is detailed to dining room duty; but after a week of waiting tables, she knows the missing employees are only the first indication of a sickness threatening the park. Her twenty-something roommates give up their party-girl ways and panic; her new restaurant colleagues regard her with suspicion and fear. Yet when Anna's life if threatened and her temporary supervisor turns a deaf ear, she follows the scent of evil, taking a solo hike up a snowy trial to the high country, seeking answers. What awaits her is a nightmare of death and greed - and perhaps her final adventure.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Tomorrow's Heritage.",
        "Authors": "By Coulson, Juanita",
        "Description": "",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Barker Street Regulars (A Dog Lover's Mystery)",
        "Authors": "By Conant, Susan",
        "Description": "Susan Conant continues to surprise--this time by involving dog writer Holly Winter in a wickedly amusing tale full of dastardly deeds and delightful eccentrics.An avid devotion to the works of Sir Arthur Conan Doyle, and an equally avid devotion to dogs, combine to draw Holly Winter and her two beloved malamutes, Rowdy and Kimi, into one of Conant's most original and entertaining mysteries to date.Rowdy has finished his training as a therapy dog and now accompanies Holly on weekly visits to the Gateway Nursing Home, where they meet Althea Battlefield, still formidable at the age of ninety, and her two elderly, admiring cohorts, Hugh and Robert--all fanatic devotees of the Master (as they call Sherlock Holmes).  When Althea's grandnephew is murdered at the home of her younger sister, Ceci, everyone is horrified, but it's the plight of Ceci herself--who is being victimized by an unscrupulous animal psychic--that finally unites this unlikely group in a crime-stopping spree that requires not only the finely tuned ratiocination of the Holmes admirers but the eager cooperation of an outraged Holly and the very particular talents of her willing canine accomplices.No special knowledge of the Sherlockian canon is required for the utmost enjoyment of this engaging romp, and Conant's own devoted followers will be delighted to find her dog-loving alter ego, Holly Winter, still poking fun at the world of Cambridge eccentrics and dog fancy fanatics, but also expanding her horizons into the world of literary trivia and--yes--feline rescue, however initially reluctant.From the Hardcover edition.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "My Lord Vampire (Zebra Regency Romance)",
        "Authors": "By Raleigh, Debbie",
        "Description": "Penniless and alone, Sally Jenkins, after receiving a mysterious amulet, gets the opportunity to become her twin sister, the beautiful Simone, who is the darling of London society, and becomes the obsession of two men--Tristan Soltern, a despicable rake, and Gideon Ravelm, a darkly seductive aristocrat. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Elven Star (The Death Gate Cycle, Volume 2)",
        "Authors": "By Weis, Margaret and Hickman, Tracy",
        "Description": "On steamy Pryan, never-ending sunlight and plentiful rain have created a jungle so vast that humans and elves dwell high in the trees and only dwarves live anywhere near the ground. From the treetops the aristocratic elves sell weapons to the other races, whose incessant warfare sends a steady steam of profits and essential resources skyward. Now, generations of dissent and race hatred will not heal -- not even under the threat of annihilation at the hands of legendary Titans. Armed with little more than their wits and prophecy, an elf, a human, and a dwarf must unite to try to save the world from destruction.",
        "Category": "",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Official Rules of Card Games",
        "Authors": "By Morehead, Albert H.",
        "Description": "With complete rules on more than 300 popular card games, including the new international laws of contract bridge, this comprehensive book also includes special sections on: choosing games for particular occasions, teaching card games to children, the etiquette of card games, technical terms used in card games, and more.From the Paperback edition.",
        "Category": " Games & Activities , Card Games , General",
        "Publisher": "Fawcett Crest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "The Closers (Harry Bosch)",
        "Authors": "By Connelly, Michael",
        "Description": "He walked away from the job three years ago. But Harry Bosch cannot resist the call to join the elite Open/Unsolved Unit. His mission: solve murders whose investigations were flawed, stalled, or abandoned to L.A.'s tides of crime. With some people openly rooting for his failure, Harry catches the case of a teenager dragged off to her death on Oat Mountain, and traces the DNA on the murder weapon to a small-time criminal. But something bigger and darker beckons, and Harry must battle to fit all the pieces together. Shaking cages and rattling ghosts, he will push the rules to the limit-and expose the kind of truth that shatters lives, ends careers, and keeps the dead whispering in the night....",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "I CAN MOVE (I'm Alive Ser.)",
        "Authors": "By Gordon, Mike (ILT) and Suhr, Mandy",
        "Description": "Explains how our bones and muscles help our body move.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Carolrhoda Books",
        "Price Starting With ($)": "14.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Words",
        "Authors": "By Kaufman, Joe",
        "Description": "Each word in a given category--parts of the body, furniture, food, barnyard animals, etc.--is defined by means of a picture.",
        "Category": "",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "Peasant Paintings from Huhsien County",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "People's Fine Arts Publ Hse",
        "Price Starting With ($)": "45.1",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Seashells (Science close-up)",
        "Authors": "By Ingoglia, Gina",
        "Description": "Discusses the origin of shells, how mollusks live and grow, and how to find, recognize, and collect shells, accompanied by five shell samples",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Henry and Mudge Under the Yellow Moon",
        "Authors": "By Cynthia Rylant",
        "Description": "",
        "Category": "",
        "Publisher": "Bradbury Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Isaac and Rebekah (NOW YOU CAN READ)",
        "Authors": "By Rourke, Arlene C. and Green, Gwen (ILT)",
        "Description": "A retelling of the Old Testament story of how Isaac came to marry Rebekah and found the twelve tribes of Israel.",
        "Category": " Religion , General",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Snow White & the Seven Dwarves",
        "Authors": "By John Patience",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    }
]