[
    {
        "Title": "Encounters With God",
        "Authors": "By Family Christian Stores",
        "Description": "",
        "Category": "",
        "Publisher": "Family Christian Stores",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Insight Guide Peru (Peru, 3rd ed)",
        "Authors": "By Barrett, Pam",
        "Description": "",
        "Category": " Travel , South America , General",
        "Publisher": "Apa Productions",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Healing the Angry Heart",
        "Authors": "By Miller, Kathy C.",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Aglow Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Always Daddy's Girl: Understanding Your Fathers Impact on Who You Are",
        "Authors": "By Wright, H. Norman",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "How to Survive and Prosper as an Artist, 5th ed.: Selling Yourself Without Selling Your Soul",
        "Authors": "By Michels, Caroll",
        "Description": "The classic handbook for launching and sustaining a career that \"explodes the romantic notion of the starving artist\", with new and expanded resources for succeeding in the burgeoning Internet art market (The New York Times)Now in its fifth edition, with over 85,000 copies of previous editions sold, How to Survive and Prosper as an Artist is the preeminent guide to taking control of your career and making a good living in the art world. Drawing on over two decades of experience, Caroll Michels walks artists through the complicated process of balancing grants, gallery representation, private dealer sales, and a personal studio to ensure a public profile and a steady income. Included is a wealth of insider's information on getting into a gallery, being your own PR agent, and negotiating prices, as well as innovative marketing, exhibition, and sales opportunities for various art disciplines. The new edition is fully updated with strategies for using the Web—everything from generating income through freelance work, to creating an entrepreneurial web site for promoting work to agents and clients, to assessing online galleries. An expanded and updated appendix adds more than 200 new resources such as Web designers, insurance and legal services for artists, internships, art colonies, and corporate and public art programs.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Learn To Read Music: An Introduction To Keys, Chords, Notes, Beats And Everythi",
        "Authors": "By Baxter and Michael Baxter Harry",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Adoption Is for Always (Albert Whitman Concept Paperbacks)",
        "Authors": "By Friedman, Judith (ILT) and Girard, Linda Walvoord",
        "Description": "Although Celia reacts to having been adopted with anger and insecurity, her parents help her accept her feelings and celebrate their love for her by making her adoption a family holiday.",
        "Category": " Juvenile Nonfiction , Family , Adoption",
        "Publisher": "Albert Whitman & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "How to Be President: What to Do and Where to Go Once You're in Office",
        "Authors": "By Williams, Stephen P.",
        "Description": "Congratulations! You've won the election and taken your oath. You wake up on your first day in the White House?now what do you do? Where's the bathroom? How do you get breakfast? What time is your first meeting? When can you use Air Force One? Can you order a pizza from the Oval Office? What line do you use for personal phone calls? This fully illustrated, how-to, hands-on handbook explains the nuts and bolts of being the President of the United States. Discover how to read a teleprompter, greet foreign dignitaries, and light the White House Christmas tree. Learn where to sit at Cabinet meetings and whether you need to bring your own ball to the White House bowling alley. Your job benefits, vacation schedule, and all the other perks and duties are clearly explained in this indispensable manual. It's a tough job, and somebody's got to do it.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Case of the Surprise Call (New Adventures of Mary-Kate & Ashley)",
        "Authors": "By Metz, Melinda",
        "Description": "When someone breaks into Great-Grandma Olive's detective clubhouse, Mary-Kate and Ashley get to work solving the mystery with clues that involve a singing dragon, footprints from a giant rabbit, and mysterious phone calls. Original.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "No Biting! (Lift-The-Flap Book)",
        "Authors": "By Katz, Karen",
        "Description": "Even the most angelic babies sometimes hit or bite, and no one-not Mommy, or playmates, or even the family pet!-is exempt when the adorable, but frustrated, toddlers in No Biting! decide to act out. But just lift the flaps, and you'll discover that these babies know a better way to act after all. Refreshingly honest and all-too-true, this funny book is one that babies and parents will want to share again and again.",
        "Category": " Juvenile Fiction , Social Themes , Manners & Etiquette",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "It's a Miracle: Real-Life Inspirational Stories Based on the PAX TV Series \"It's A Miracle\"",
        "Authors": "By Thomas, Richard (COM)",
        "Description": "Discover the power of miracles from the show that has touched America’s heartIf you’ve ever doubted, wished, or prayed for a miracle, here is the book to restore your faith and touch your soul. Richard Thomas, host of PAX TV’s successful series It’s a Miracle, has selected his favorite true stories of miracles that have happened in everyday life. You might call them astonishing coincidence, or answered prayers, or amazing acts of heroism...they’re all around us--and right here in these awe-inspiring pages.Here are stories to celebrate: a man whose nightmares end after they help him save a woman’s life . . . a woman whose beloved dog was injured and lost during airline travel--and the psychic who brought them together again . . . orphaned best friends, separated in childhood, who rediscover each other years later when one walks into a restaurant and sits down at the counter--next to her long-lost friend.From angel encounters to extraordinary animal stories, from amazing rescues to remarkable medical recoveries, these intriguing and inspiring true-life dramas will lift your spirits and give you hope and comfort when you need them most.",
        "Category": " Body, Mind & Spirit , Reference",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Double Negative",
        "Authors": "By Carkeet, David",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Felony & Mayhem Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "A.D. The Year Of Our Lord",
        "Authors": "By Editor-Greg Laurie",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Adventures in Missing the Point: How the Culture Controlled Church Neutered the Gospel",
        "Authors": "By McLaren, Brian D. and Campolo, Tony",
        "Description": "If you’re brave enough to take an honest look at the issues facing the culture–controlled church–and the issues in your own life–read on.Do you ever look at how the Christian faith is being lived out in the new millennium and wonder if we’re not doing what we’re supposed to be doing? That we still haven’t quite “gotten it”? That we’ve missed the point regarding many important issues?It’s understandable if we’ve relied on what we’ve been told to believe or what’s widely accepted by the Christian community. But if we truly turned a constructive, critical eye toward our beliefs and vigorously questioned them and their origins, where would we find ourselves? Best-selling authors Brian McLaren and Tony Campolo invite you to do just that. Join them on an adventure–one that’s about uncovering and naming faulty conclusions, suppositions, and assumptions about the Christian faith. In Adventures in Missing the Point, the authors take turns addressing how we’ve missed the point on crucial topics such as:Salvation, The Bible, Being Postmodern, Worship, Homosexuality, Truth, and many more…",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan/Youth Specialties",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Distinguished Inns of America, Select Registry, 17th Edition",
        "Authors": "By Select Registry",
        "Description": "",
        "Category": "",
        "Publisher": "Select Registry",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Main Street #1: Welcome to Camden Falls",
        "Authors": "By Martin, Ann M.",
        "Description": "Combining the heart of her Newbery Honor-winning fiction and the spirit of her legendary Baby-Sitters Club series, Ann M. Martin introduces a timeless new series for girls.Flora and Ruby do not want to move to Camden Falls.  But they don't really have a choice -- their parents are dead and their grandmother, Min, is taking them in.  It's strange to be in a new place.  But luckily, it's a very welcoming place.     Min runs a sewing store, Needle & Thread, at the heart of Main Street in Camden Falls.  There, Flora and Ruby become friends with Olivia, who likes to organize things, and Nikki, who lives on the wrong side of the tracks.  Even if Flora and Ruby never expected it to, Camden Falls becomes their home . . . and its stories become a part of their stories.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Salsa",
        "Authors": "By Hearon, Reed and Capucilli, Karen (PHT)",
        "Description": "Salsa is hot. Salsa goes with anything and is never boring. Salsa is fresh, healthy, intense, easy to make. Sales of salsa have now surpassed those of ketchup and show no signs of slowing. Written by acclaimed chef Reed Hearon, formerly of Santa Fe's Coyote Cafe, and designed by the internationally renowned Carbone Smolan Associates, this selection of 40 authentic, festively photographed salsa recipes offers a comprehensive look at one of Mexico's national treasures. Divided into four chapters (fiery traditional salsas, mild salsas, contemporary salsas, and dessert salsas), and including complete information on cooking techniques, equipment, and ingredient sources, this collection of fresh, easily prepared salsas can turn the simplest of dishes into lively, exciting, upbeat meals.",
        "Category": " Cooking , Reference",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Tailgate Parties: 24 Menus for Gourmet Picnics and Outdoor Entertaining",
        "Authors": "By Wyler, Susan",
        "Description": "Offers recipes for picnics, lunches, outdoor parties, and barbecues, and includes suggestions for salads, dips, meat dishes, soups, and desserts",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Harmony Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "The Chinese New Year Mystery (Nancy Drew Notebooks #39)",
        "Authors": "By Keene, Carolyn and Jones, Jan Naimo (ILT)",
        "Description": "WHAT'S CHINESE NEW YEAR WITHOUT A DRAGON?  The third-grade classes at Nancy's school are learning about Chinese culture, and they'll celebrate the Chinese New Year with a special parade. The highlight of the parade will be a dragon costume. Nancy's class is making it out of feathers, sequins, gold tassels, and red silk. But right before the big day, the dragon disappears!  Nancy, Bess, and George are in the New Year's spirit. They've enjoyed a delicious feast at the home of their classmate Mari Cheng. She's even lent the girls special Chinese outfits to wear. But without the dragon, there will be no parade. And that makes Nancy roaring mad!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Nancy Drew 40: the Moonstone Castle Mystery",
        "Authors": "By Keene, Carolyn",
        "Description": "When Nancy Drew receives a valuable moonstone as a gift from an unknown person, she is amazed and puzzled. But it is only the first of several startling events in this complex mystery that challenge the ingenuity of the pretty sleuth.Why are the Bowens – a missionary couple who recently returned to the United States – having so much trouble finding their missing seventeen-year-old granddaughter, Joanie Horton? Nancy and her friends travel to Deep River, the town where the young Jonie lived. From the motel where Nancy and her friends stay, they can see an intriguing castlelike structure with a drawbridge. Gossipy Mrs. Hemstead at the village tearoom insists that Moonstone Castle is haunted. Curious, the three girls attempt to explore the abandoned castle, but an ominous voice warns them away.Other strange happenings in Deep River convince Nancy that there is a connection between Moonstone Castle and the mysterious moonstone gift. But what is the significance? And where does the baffling disappearance of Joanie Horton fit into the intricate puzzle?",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1962"
        }
    },
    {
        "Title": "Pablo Picasso (Art for Children)",
        "Authors": "By Raboff, Ernest Lloyd",
        "Description": "A brief biography of the famous artist accompanies reproductions and analyses of several of his works.",
        "Category": "",
        "Publisher": "Trophy Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "In the Courts of the Sun",
        "Authors": "By D'Amato, Brian",
        "Description": "Jed DeLanda, a descendant of the Maya living in the year 2012, is a math prodigy who spends his time playing abstract strategy games on his computer and raking in profits from online trading. His secret weapon is something called the \"Sacrifice Game\" - a divination ritual that the ancient Maya used to predict the birth and death of civilizations. But Jed's life is thrown into chaos when his former mentor, the game-theory scientist Taro Mora, and a mysterious game designer named Marena Park, ask him for his opinion on a newly discovered Mayan codex - an ancient book that contains an account of a Game predicting the end of the world.For thousands of years the fate of mankind has been etched into the fabric of history, and not even the greatest advancements in modern science and technology have been able to thwart it. Now at the brink of the end of time, Marena and Taro need someone to travel back to AD 664, to learn to play the original version of the Sacrifice Game, and Jed, who has spent his whole life hungering to retrieve his lost heritage, convinces them that he should be the one to go. With the future of humanity in his hands, the scientists replicate Jed's brainwaves and send them through a \"desktop wormhole\" straight into the mind of a Mayan king. Only something goes wrong. Instead of becoming the Lord of the ancient Maya city of Ix, Jed arrives inside a Maya ballplayer named Chacal, who is seconds away from throwing himself down the temple steps as a human sacrifice. If Jed can survive the next few minutes, he might just save the world.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "When It Happens",
        "Authors": "By Colasanti, Susane",
        "Description": "Reminiscent of the movie Say Anything, a debut novel for all those searching for The One! From the author of the City Love trilogy.Sara and Tobey couldn't be more different. She is focused on getting into her first-choice college; he wants to win Battle of the Bands. Sara's other goal is to find true love, so when Dave, a popular jock, asks her out, she's thrilled. But then there's Tobey. His amazing blue eyes and quirky wit always creep into her thoughts. It just so happens that one of Tobey's goals is also to make Sara fall in love with him. Told in alternating points of view, Sara and Tobey's real connection will have everyone rooting for them from the minute they meet!",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Speak",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Medusa (NUMA Files)",
        "Authors": "By Cussler, Clive and Kemprecos, Paul (CON)",
        "Description": "For seven books, Clive Cussler has dazzled readers with the \"spine-tingling adventures\" (Chicago Tribune) of Kurt Austin, Joe Zavala, and the rest of the NUMA(r) Special Assignments Team, but in Medusa the NUMA(r) team faces what may be its most perilous mission of all. In the Micronesian Islands, a top secret, U.S. government- sponsored undersea lab conducting vital biomedical research on a rare jellyfish known as the Blue Medusa suddenly . . . disappears. At the same time, off Bermuda, a bathysphere is attacked by an underwater vehicle and left helpless a half mile below the surface, its passengers-including Zavala-left to die. Only Kurt Austin's heroic measures save them from a watery grave, but, suspecting a connection, Austin puts the NUMA(r) team on the case. He has no idea what he's just gotten them all into. A hideous series of medical experiments . . . an extraordinarily ambitious Chinese criminal organization . . . a secret new virus that threatens to set off a worldwide pandemic. Austin and Zavala have been in tight spots before, but this time it's not just their own skins they're trying to save-it's the lives of millions. Filled with the high-stakes suspense and boundless invention unique to Cussler, Medusa is the most thrilling novel yet from the grand master of adventure.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Silent Man (A John Wells Novel)",
        "Authors": "By Berenson, Alex",
        "Description": "It's been a rough few years for CIA agent John Wells. The undercover work in Afghanistan and Pakistan, the attack on the United States, the Chinese plot that could have led to war. Wells is exhausted, and his nights filled with disturbing dreams. But he knows he has no time for that. He has made many enemies, and the world won't stay quiet for long.Nevertheless, Wells is not prepared for what is about to happen. He and his colleague - and fiancee - Jennifer Exley are driving into work when traffic comes to a standstill, due to accidents on both bridges into Washington. A pretty big coincidence, he thinks, beginning to get a bad feeling - a feeling that only gets worse when he spots the red motorcycle zooming up between cars toward him. Before the day is over, several people will be dead or severely injured, Exley among them, and Wells will be a man possessed.The attackers are Russian, and it is to Russia that Wells must follow the trail. He finds what he's looking for - but also a great deal more. A plan of almost unimaginable consequences is in motion, and Wells has no idea if he has discovered it in time. The last few years have been rough indeed, but the next few weeks will be much, much worse.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Assassins' Gate: America in Iraq",
        "Authors": "By Packer, George",
        "Description": "Named one of the Best Books of 2005 by The New York Times, The Washington Post Book World, The Boston Globe, The Chicago Tribune, The San Francisco Chronicle Book Review, The Los Angeles Times Book Review, The New York Times Book Review, USA Today, Time, and New York magazine. The Assassins' Gate: America in Iraq recounts how the United States set about changing the history of the Middle East and became ensnared in a guerrilla war in Iraq. It brings to life the people and ideas that created the Bush administration's war policy and led America to the Assassins' Gate—the main point of entry into the American zone in Baghdad. The Assassins' Gate also describes the place of the war in American life: the ideological battles in Washington that led to chaos in Iraq, the ordeal of a fallen soldier 's family, and the political culture of a country too bitterly polarized to realize such a vast and morally complex undertaking. George Packer's best-selling first-person narrative combines the scope of an epic history with the depth and intimacy of a novel, creating a masterful account of America's most controversial foreign venture since Vietnam.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Civil War Battlefields: A Touring Guide",
        "Authors": "By Eicher, David J.",
        "Description": "Describes the historical background of twelve Civil War battlefields, including Chickamauga, Gettysburg, Shiloh, and Vicksburg",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Touring Virginia's and West Virginia's  Civil War Sites (Touring the Backroads)",
        "Authors": "By Johnson, Clint",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Blair",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Civil War: The complete text of the bestselling narrative history of the Civil War--based on the celebrated PBS television series",
        "Authors": "By Ward, Geoffrey C., Burns, Ric, and Burns, Ken",
        "Description": "\"The Civil War defined us as what we are and it opened us to being what we became, good and bad things.... It was the crossroads of our being, and it was a hell of a crossroads: the suffering, the enormous tragedy of the whole thing.\"- Shelby Foote, from The Civil War  When the illustrated edition of The Civil War was first published, The New York Time hailed it as \"a treasure for the eye and mind.\" Now Geoffrey Ward's magisterial work of history is available in a text-only edition that interweaves the author's narrative with the voices of the men and women who lived through the cataclysmic trial of our nationhood: not just Abraham Lincoln, Frederick Douglass, and Robert E. Lee, but genteel Southern ladies and escaped slaves, cavalry officers and common foot soldiers who fought in Yankee blue and Rebel gray.     The Civil War also includes essays by our most distinguished historians of the era: Don E. Fehrenbacher, on the war's origins; Barbara J. Fields, on the freeing of the slaves; Shelby Foote, on the war's soldiers and commanders; James M. McPherson, on the political dimensions of the struggle; and C. Vann Woodward, assessing the America that emerged from the war's ashes.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Massie",
        "Authors": "By Harrison, Lisi",
        "Description": "Massie gets BE-yoo-tiful: After Massie Block gets kicked off her high horse and out of her ultra exclusive Westchester riding camp, her parents force her to do the unthinkable-find a summer job. Not one for dog-walking or brat-sitting, Massie comes up with the ah-bvious solution: She'll be a sales rep for the cosmetics brand Be Pretty. Massie fully hearts her new role as fairy gawdmother of makeup-until she discovers transforming LBRs into glam-girls takes more than a swish of her royal purple mascara wand.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Poppy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Invasion of the Boy Snatchers",
        "Authors": "By Lisi Harrison",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Pokemon: Sinnoh Handbook",
        "Authors": "By West, Tracey and Noll, Katherine",
        "Description": "Gotta read 'em all!Want to know inside stats and battling strengths for all the new Pokemon in the Shinnoh Region? Check out this full guide to all the characters of the all-new Pokemon series! Featuring exclusive tips, plus all the Pokedex info you can handle, this handbook will answer all your questions and help sharpen your skills.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Scholastic, Inc.",
        "Price Starting With ($)": "142.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Janitor's Boy",
        "Authors": "By Clements, Andrew",
        "Description": "IT WAS THE PERFECT CRIME  Unfortunately, it also led to the perfect punishment. When Jack Rankin gets busted for defacing a school desk with a huge wad of disgusting, watermelon bubble gum, the principal sentences him to three weeks of after-school gum cleanup for the chief custodian. The problem is, Jack's anger at the chief custodian was the reason for his gum project in the first place. The chief custodian happens to be Jack's dad.  But doing time in the school basement after hours reveals some pretty surprising things: about the school, about Jack's father, and about Jack himself.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Cloudy With a Chance of Meatballs",
        "Authors": "By Barrett, Ron (ILT) and Barrett, Judi",
        "Description": "The beloved, bestselling tale of edible weather is brought to life!If food dropped like rain from the sky, wouldn't it be marvelous! Or would it? It could, after all, be messy. And you'd have no choice. What if you didn't like what fell? Or what if too much came? Have you ever thought of what it might be like to be squashed flat by a pancake?",
        "Category": " Juvenile Fiction , Cooking & Food",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "A Spirit of Greatness: Stories from the Employees of American Airlines",
        "Authors": "By Capozzi, John M.",
        "Description": "",
        "Category": " Biography & Autobiography , Business",
        "Publisher": "Jmc Pub Services",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Ireland",
        "Authors": "By Constable, Nick",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "7.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Man's Problems - God's Answers",
        "Authors": "By J. Dwight Pentecost",
        "Description": "",
        "Category": "",
        "Publisher": "Moody Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1972"
        }
    },
    {
        "Title": "in pictures Rocky Mountain: The Continuing Story (English and German Edition)",
        "Authors": "By MacK, James A.",
        "Description": "",
        "Category": " Travel , Pictorials",
        "Publisher": "KC Publications, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Republic of China : as exemplified by its people and life in Taiwan",
        "Authors": "By Luppi, Andrea, Pizzinelli, Corrado",
        "Description": "",
        "Category": "",
        "Publisher": "Magnus Edizioni",
        "Price Starting With ($)": "9.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Meaning of Swarthmore",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "SWARTHMORE COLLEGE",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Patriots of the American Revolution",
        "Authors": "By Dorson, Richard Mercer (EDT)",
        "Description": "The Revolutionary War comes to life in true accounts by actual participants in America's struggle for independence.  A doctor describes his experience with George Washington's army during their winter at Valley Forge, a naval hero recounts his exploits at sea with John Paul Jones, and women tell of flirtations with officers in the Continental Army. Within these narratives are descriptions of both thrilling action on the high seas and the dank interiors of prison ships, where many ended their days.  Illustrated with 19 black-and-white period drawings.",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Dog Breeds (Encyclopedias of Animal Breeds)",
        "Authors": "By Cunliffe, Juliette",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Plus",
        "Price Starting With ($)": "8.61",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "To the Sea: A History and Tour Guide of Sherman's March",
        "Authors": "By Miles, Jim",
        "Description": "Discusses Sherman's famous march that was a turning point in the Civil War",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "9.19",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "The 10 Best of Everything: An Ultimate Guide for Travelers (National Geographic the Ten Best of Everything)",
        "Authors": "By Lande, Nathaniel and Lande, Andrew",
        "Description": "From Arnold Palmer's ten finest golf courses to Luciano Pavarotti's ten favorite opera houses to the ten poshest train trips, classiest wristwatches, most atmospheric pubs, and much more, this is a blue-chip bible to delight any traveler for whom only the very best will do—and a rich dreambook for those of us still waiting for our own ships to come in. Compiled by veteran travelers Nathaniel and Andrew Lande, this extravagantly entertaining volume collects superlatives galore: top sporting events and tropical island hideaways, glorious gardens and magnificent museums, stylish ski runs, superb cigars, and even the Ten Best Things to Do on a Sunday Afternoon in more than a dozen of the world's greatest cities. Here are the tastiest foods life has to offer to cordon bleu gourmets, barbecue fanatics, and hard-core chocoholics; here too are a whole host of trips and expeditions for any taste and to every continent including Antarctica, each complete itinerary a unique variation upon the theme of the 21st century Grand Tour.Highlighted by 200 color illustrations, studded with cosmopolitan sidebars and savvy tips, and equipped with a wide array of detailed information on luxury hotels, resorts, restaurants, and more, as well as a wealth of transportation options via land, sea or air, this elegant and sophisticated treasury of travel lore will awaken the wanderlust in readers everywhere.",
        "Category": " Travel , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Little, Brown Handbook (8th Edition)",
        "Authors": "By Aaron, Jane E., Fowler, H. Ramsey, and Anderson, Daniel",
        "Description": "",
        "Category": " Language Arts & Disciplines , Grammar & Punctuation",
        "Publisher": "Longman Pub Group",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "A Sierra Club Naturalist's Guide to the Deserts of the Southwest",
        "Authors": "By Larson, Peggy Pickering",
        "Description": "This handbook on the flora, fauna, and geography of the Southwest deserts includes tips on traveling, hiking, and camping",
        "Category": "",
        "Publisher": "Sierra Club Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1977"
        }
    },
    {
        "Title": "Tae's Sonata, Level 7 (Houghton Mifflin Soar to Success)",
        "Authors": "By Read (COR)",
        "Description": "",
        "Category": " Young Adult Nonfiction , Language Arts , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Bartleby",
        "Authors": "By Melville, Herman",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Learning French (2nd Edition)",
        "Authors": "By Stein, Gail",
        "Description": "You're no idiot, of course.  You appreciate wine and brie, can pronounce \"croissant,\" and know that \"bonjour\" means hello.  But when it comes to actually learning the language, you feel stranded on the Eiffel Tower with no way down.  Don't strap on your parachute just yet!  The Complete Idiot's Guide to Learning French, Second Edition makes mastering French fun and entertaining--instead of bogging you down with verb tenses and vocabulary lists.  You'll feel confident about \"parlaying\" your new proficiency into conversations with native speakers.  In this Complete Idiot's Guide, you get:",
        "Category": " Foreign Language Study , French",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Casseroles: Comfort Food at Its Best",
        "Authors": "By Bramley, Tessa",
        "Description": "",
        "Category": "",
        "Publisher": "Ryland Peters & Small",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Drill Here, Drill Now, Pay Less: A Handbook for Slashing Gas Prices and Solving Our Energy Crisis",
        "Authors": "By Gingrich, Newt and Haley, Vince (CON)",
        "Description": "New York Times bestselling author, former Speaker of the House, and Fox News political analyst Newt Gingrich has a plan for slashing gas prices and reducing our long-term dependence on foreign oil.Gingrich is famous for taking big, visionary ideas and boiling them down into practical solutions as demonstrated in this year's earlier release, Real Change, which was on the New York Times bestseller list for eleven weeks. His new book Drill Here, Drill Now, Pay Less does just that. Dealing not only with spiraling gas prices, but with the energy crisis as a whole, Gingrich shows how we can safely reap the benefits of America's own natural resources and technology in gas, oil, coal, wind, solar, biofuels and nuclear energy.Gingrich argues that the pinch Americans are feeling at the pump is not a blip in the economy but a looming crisis--affecting not only the price of gas, but the price of food, the strength of our economy, and our national security.To meet this crisis, Gingrich lays out a national strategy that will tap America's scientists, engineers, and entrepreneurs, and require Congress to unlock our oil reserves and remove all the impediments and disincentives that unnecessary government regulation has put in the way of American energy independence. The energy crisis is solvable, as Newt Gingrich's plan makes clear. His handbook, Drill Here, Drill Now, Pay Less is sure to become the talk of the presidential campaign season.",
        "Category": " Political Science , Public Policy , Energy Policy",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "1001 Ways to Pay for College: Practical Strategies to Make College Affordable",
        "Authors": "By Tanabe, Gen S. and Tanabe, Kelly Y.",
        "Description": "Both Gen and Kelly Tanabe graduated from Harvard debt-free, and have co-authored five other books on college planning and financial aid. Written for all levels of student high school, college, graduate and adult and parents, their resource text was compiled from seven years of research.  They list 1,000 ways that enterprising students can pay for college, including tips about scholarships, contests for students, reward programs for students, ways to save for college, student tax breaks, ways to maximize financial aid, borrowing money, loan forgiveness programs, military options,  dorm room entrepreneurship, internships and part-time jobs. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Study Aids , Financial Aid",
        "Publisher": "Supercollege, Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Guide to Confident Living",
        "Authors": "By Peale, Norman Vincent",
        "Description": "This amazing book will show you the secrets of how to free your inner powers, how to \"talk out\" your troubles, how to achieve freedom from fear, how to attain married happiness, and how to meet sorrow. Another triumphant breakthrough by the author of \"The Power of Positive Thinking.\"",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Leo Rosten's treasury of Jewish quotations",
        "Authors": "By Rosten, Leo Calvin",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Last Angry Man, a novel",
        "Authors": "By green, gerald",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "84.32",
        "Publish Date": {
            "Month": "June",
            "Year": "1956"
        }
    },
    {
        "Title": "The Splendid Little Book of All Things Cat",
        "Authors": "By Lovka, Bob",
        "Description": "Offers tips and advice on caring for a cat, with chapters on health care, feeding, exercise, play, and grooming",
        "Category": " Pets , Cats , General",
        "Publisher": "Lumina Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The Sebastiani Family Cookbook",
        "Authors": "By Sebastiani, Sylvia",
        "Description": "Recipes for traditional Italian fare and modern dishes for family meals and entertaining reveal Sylvia Sebastiani's expertise in wine as well as the kitchen",
        "Category": " Cooking , General",
        "Publisher": "Lyle Stuart",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "Lean For Life: Phase One - Weight Loss",
        "Authors": "By Holderman, Jerry and Graff, Cynthia Stamper",
        "Description": "",
        "Category": " Health & Fitness , Diets",
        "Publisher": "Griffin Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Year's Best Science Fiction : Sixteenth Annual Collection",
        "Authors": "By Dozois, Gardner R. (EDT)",
        "Description": "A new edition in an award-winning series offers a collection of last year's best science fiction stories, including works by Greg Egan and Robert Silverberg, along with a recap of the year and lists of honorable mentions and recommended readings. Simultaneous.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Journals: 1952-2000",
        "Authors": "By Schlesinger, Arthur Meier, Schlesinger, Andrew (EDT), and Schlesinger, Stephen (EDT)",
        "Description": "A landmark publication in the history of American letters, and a unique opportunity to celebrate the legacy of the one of the great public intellectuals of our time.  For more than a half century, Arthur Schlesinger, Jr. was at the vital center of American political and cultural life. From his entrance into political leadership circles in the 1950s through his years in the Kennedy White House and up until his very last days, he was that rare thing, a master historian who enjoyed an extraordinary eyewitness vantage on history as it was being made. On intimate terms with many of the most prominent political, cultural and intellectual figures of the last fifty years, he was a man whose proximity to power never obscured his appreciation for the reality of those who have none. For that capacity for empathy and for much else, he was often called American liberalism's greatest voice.  For most of his adult life, Arthur Schlesinger, Jr. dutifully recorded his experiences and opinions in journals that, until now, have never been seen. Edited by his oldest sons, they offer remarkably fresh and lucid observations on a half century of public life, and a rare and privileged view into the mind of one of America's most distinguished men of letters. Frank, revelatory, suffused with wit and humanity, these entries offer an intimate history of postwar America, from his days on Adlai Stevenson's campaign team to his years in JFK and RFK's inner circle, through to the election of George W. Bush. They contain his candid reminiscences about many of the signal events of our time - the Bay of Pigs, the devastating assassinations of the 1960s, Vietnam, Watergate, the fall of the Soviet Union, Bush v. Gore. These journals also offer an extraordinary window into the lives of the wide range of politicians, intellectuals, writers and actors who were his friends - from the Kennedys to the Clintons, from Henry Kissinger to Adlai Stevenson, from Norman Mailer to Lauren Bacall. Together they form an astonishingly vivid portrait of American politics and culture in the second half of the 20th century - one that only a man who knew everyone and missed nothing, could provide.  Arthur Schlesinger, Jr. was one of America's greatest moral and intellectual forces, and the publication of his journals is both itself an epic event in the history of American letters, and a fitting opportunity to celebrate this most remarkable American life.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The hurricane years",
        "Authors": "By Hawley, Cameron",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Day the Leader Was Killed",
        "Authors": "By Mahfouz, Naguib and Hashem, Malak (TRN)",
        "Description": "From the Nobel Prize laureate and author of the acclaimed Cairo Trilogy, a beguiling and artfully compact novel set in Sadat's Egypt.The time is 1981, Anwar al-Sadat is president, and Egypt is lurching into the modern world. Set against this backdrop, The Day the Leader Was Killed relates the tale of a middle-class Cairene family. Rich with irony and infused with political undertones, the story is narrated alternately by the pious and mischievous family patriarch Muhtashimi Zayed, his hapless grandson Elwan, and Elwan's headstrong and beautiful fiancee Randa.  The novel reaches its climax with the assassination of Sadat on October 6, 1981, an event around which the fictional plot is skillfully woven. The Day the Leader Was Killed brings us the essence of Mahfouz's genius and is further proof that he has, in the words of the Nobel citation, \"formed an Arabic narrative art that applies to all mankind.\"",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Macbeth (No Fear Shakespeare) (Volume 1)",
        "Authors": "By Shakespeare, William and Crowther, John (EDT)",
        "Description": "Read Shakespeare’s plays in all their brilliance—and understand what every word means!   Don’t be intimidated by Shakespeare! These popular guides make the Bard’s plays accessible and enjoyable.Each No Fear guide contains:The complete text of the original playA line-by-line translation that puts the words into everyday languageA complete list of characters, with descriptionsPlenty of helpful commentary",
        "Category": " Study Aids , Book Notes",
        "Publisher": "SparkNotes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Lonely Planet Diving & Snorkeling Belize (LONELY PLANET DIVING AND SNORKELING BELIZE)",
        "Authors": "By Webster, Mark",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Essential EatingWell Cookbook: Good Carbs, Good Fats, Great Flavors (Eating Well)",
        "Authors": "By Jamieson, Patricia",
        "Description": "This long-awaited collection of more than 350 recipes represents favorites from EatingWell: The Magazine of Food & Health that have migrated to the top of an elite line of new and classic dishes now numbering well into the thousands. These are exciting new recipes that EatingWell's own staff members take home at night alongside the time-tested winners that dedicated readers call and write to request over and over again. All are freshly updated, with improved nutritional analyses and an eye to today's fast-evolving nutritional guidelines. Within these pages you'll find clear, simple and often very quick recipes. You'll also find a unique Healthy Weight Loss Index that identifies which recipes fit into particular diet guidelines, rating them on overall health (calories, carbohydrates, and fats), fiber content, and which recipes best address the needs of those on low-carbohydrate weight-loss plans. Losing weight no longer has to mean sacrificing great tastes and fine dining.Good carbs: don't abandon the things your body needs and craves: whole grains, great-tasting vegetables and fruitsGood fats: enhance your recipes and your family's health with the right fats and oils, while lowering saturated-fat contentGreat flavors: savor rich taste using trustworthy recipes and the secrets of award-winning cooks and the best tricks and techniques from EatingWellRecipes include:Chicken Saute with Mango SauceUpdated Mac & CheeseAsian Stir-Fried Shrimp with Snow PeasGrilled Pork Chops with Rhubarb ChutneyPizza with White Beans, Prosciutto, and RosemarySpring Vegetable StewFragrant Bulgar Pilaf with Toasted AlmondsGrilled Vegetable SaladSunday Sausage StrataVegetarian Hot PotSalmon with North African FlavorsBlueberry DanishFruit-Filled CrepesDouble-Raspberry SoufflesLemon Almond Polenta TortaChocolate-Hazlenut CakePineapple Upside-Down MuffinsMango BruleeLearn the flavors, strategies, and insights to help you keep fit and stay healthy while never boring your palate.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Countryman Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Pamela",
        "Authors": "By Gay, Peter (INT) and Richardson, Samuel",
        "Description": "Unfolding through letters, the novel depicts with much feeling Pamela's struggles to decide how to respond to her would-be seducer and to determine her place in society.Samuel Richardson (1689–1761), a prominent London printer, is considered by many the father of the English novel, and Pamela the first modern novel. Following its hugely successful publication in 1740, it went on to become one of the most influential books in literary history, setting the course for the novel for the next century and beyond. Pamela reflects changing social roles in the late seventeenth and early eighteenth centuries, as a rising middle class offered women more choices and as traditional master-servant relationships underwent change.",
        "Category": " Fiction , Romance , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1958"
        }
    },
    {
        "Title": "Coming into Our Own",
        "Authors": "By Gerzon, Mark",
        "Description": "Prepares readers for an age when most begin to question the paths they have taken during their lives and suggests using this midlife crisis as a cue to embark on a journey of self-discovery. 45,000 first printing. National ad/promo. Tour.",
        "Category": " Psychology , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "What Happened When",
        "Authors": "By Carruth, Gorton",
        "Description": "The Encyclopedia of American facts and dates  is cited in both  BCL3  and  Sheehy.  This is an abridgement of the 8th edition (1987) of that reference. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , United States , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Gifts from God: Encouragement and Hope for Today's Parents",
        "Authors": "By Jeremiah, David",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Chariot Victor Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "What Lips My Lips Have Kissed: The Loves and Love Poems of Edna St. Vincent Millay",
        "Authors": "By Epstein, Daniel Mark",
        "Description": "A  noted biographer  and poet illuminates the unique woman who wrote the greatest American love poetry of the twentieth centuryThis is the story of a rare sort of American genius, who grew up in grinding poverty in Camden, Maine.  Nothing could save the sensitive child but her talent for words, music and drama, and an inexorable desire to be loved.  When she was twenty, her poetry would make her famous; at thirty she would be loved by readers the world over.Edna St. Vincent Millay was widely considered to be the most seductive woman of her age.  Few men could resist her, and many women also fell under her spell.  From the publication of her first poems until the scandal over Fatal Interview twenty years later, gossip about the poet's liberated lifestyle prompted speculation about who might be the real subject of her verses.Using letters, diaries and journals of the poet and her lovers that have only recently become available, Daniel Mark Epstein tells the astonishing story of the life, dedicated to art and love, that inspired the sublime lyrics of Edna St. Vincent Millay.",
        "Category": " Poetry , General",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Theatre: Art in Action (NTC: THEATRE OF ARTS IN ACTION)",
        "Authors": "By Abel, Lisa (EDT) and Pettengill, R. (CON)",
        "Description": "",
        "Category": " Performing Arts , Theater , General",
        "Publisher": "National Textbook Company",
        "Price Starting With ($)": "7.37",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The Chronicles of the Jewish People",
        "Authors": "By Scheindlin, Raymond P.",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Focaccia: Simple Breads from the Italian Oven",
        "Authors": "By Pool, Joyce Oudkerk (PHT) and Field, Carol",
        "Description": "Fragrant with olive oil, sea salt, and herbs from the hillsides, focaccia is the delicious northern Italian flatbread that is fast becoming as popular in this country as pizza. Over 50 recipes for savory and sweet versions offer enticing proof that focaccia is one of the easiest-to-prepare and most versatile of all homemade breads. Written by an acclaimed expert on Italian baking and illustrated with glowing full-color photographs, this inviting cookbook provides the key to making simple, flavorful focaccia a staple of all your meals.",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Bread for All Seasons: Delicious and Distinctive Recipes for Year-Round Baking",
        "Authors": "By Hensperger, Beth",
        "Description": "In the best-selling tradition of Beth Hensperger's earlier titles, this engaging collection of 80 mouthwatering recipes is inspired by international traditions and enhanced by a cornucopia of fresh, seasonal ingredients. Accompanied by a selection of special holiday breads, this gorgeously illustrated cookbook is sure to become an integral part of any bread lover's repertoire all year round.",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Ministry of Special Cases",
        "Authors": "By Englander, Nathan",
        "Description": "The long-awaited novel from Nathan Englander, author of For the Relief of Unbearable Urges.  Englander’s wondrous and much-heralded collection of stories won the 2000 Pen/Malamud Award and was translated into more than a dozen languages. From its unforgettable opening scene in the darkness of a forgotten cemetery in Buenos Aires, The Ministry of Special Cases casts a powerful spell. In the heart of Argentina’s Dirty War, Kaddish Poznan struggles with a son who won’t accept him; strives for a wife who forever saves him; and spends his nights protecting the good name of a community that denies his existence--and denies a checkered history that only Kaddish holds dear. When the nightmare of the disappeared children brings the Poznan family to its knees, they are thrust into the unyielding corridors of the Ministry of Special Cases, the refuge of last resort. Nathan Englander’s first novel is a timeless story of fathers and sons.  In a world turned upside down, where the past and the future, the nature of truth itself, all take shape according to a corrupt government’s whims, one man--one spectacularly hopeless man--fights to overcome his history and his name, and, if for only once in his life, to put things right. Here again are all the marvelous qualities for which Englander’s first book was immediately beloved: his exuberant wit and invention, his cosmic sense of the absurd, his genius for balancing joyfulness and despair. Through the devastation of a single family, Englander captures, indelibly, the grief of a nation.  The Ministry of Special Cases, like Englander’s stories before it, is a celebration of our humanity, in all its weakness, and--despite that--hope.",
        "Category": " Fiction , Family Life",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Here Am I - Send Aaron: Principles From the Book of Exodus for Dry Disciples",
        "Authors": "By Jill Briscoe",
        "Description": "",
        "Category": "",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "CliffsAP United States History Preparation Guide, 3rd Edition",
        "Authors": "By Soifer, Paul and Hoffman, Abraham",
        "Description": "CliffsAP study guides help you gain an edge on Advanced Placement* exams. Review exercises, realistic practice exams, and effective test-taking strategies are the key to calmer nerves and higher AP* scores.CliffsAP United States History, 3rd Edition, is for students who are enrolled in AP U.S. History or who are preparing for the Advanced Placement Examination in United States History. Inside, you’ll find hints for answering the essay and multiple-choice sections, a clear explanation of the exam format, a look at how exams are graded, and more:An overview of U.S. history with definitions, key terms, and conceptsAdvice on how and what to read about U.S. History to gain the most understandingComments on sample essays and their possible scoreLoads of illustrations, tables, maps, photos to help you visualize what you learnA list of Things to Know for each period of historySample questions (and answers!) and practice tests reinforce what you’ve learned in areas such as Colonial America, the New Nation, the World Wars, and the second half of the twentieth century. CliffsAP United States History, 3rd Edition, also includes the following periods:The American Revolution and a look at British imperial policyThe Constitution and the Federalists, plus the structure of government under the ConstitutionJeffersonian and Jacksonian democracyThe Civil War and ReconstructionThe Gilded Age (1877–1900)The Depression, with a look at New Deal agenciesThe United States as a superpower and contemporary AmericaThis comprehensive guide offers a thorough review of key concepts and detailed answer explanations. It’s all you need to do your best — and get the college credits you deserve.*Advanced Placement Program and AP are registered trademarks of the College Board, which was not involved in the production of, and does not endorse this product.",
        "Category": " Study Aids , Advanced Placement",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Becoming a Whole Person in a Broken World: Studies in the Book of Romans",
        "Authors": "By Denney, James D. and Davis, Ron Lee",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Discovery House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Italian Stories (American Literature (Dalkey Archive))",
        "Authors": "By Papaleo, Joseph",
        "Description": "Paying homage to the Italian-American experience, Italian Stories celebrates an Italian neighbourhood in the Bronx during the 1930s and '40s, and mourns the loss of this ethnic identity with the migration of subsequent generations to the suburbs. With stories that are both melancholy and comic, Papaleo here explores the contradictory desires of assimilation: his characters want to live the life of the average American while maintaining a strong link to their rich heritage. In addition, Papaleo rails against the damaging stereotypes of Italian-Americans propagated by the media in movies and television.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Dalkey Archive Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Reviewing Physics: The Physical Setting",
        "Authors": "By",
        "Description": "",
        "Category": " Science , Physics , General",
        "Publisher": "Amsco School Pubns Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Writing Poetry",
        "Authors": "By Tucker",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Good Year Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The Jewish Woman's Book Of Wisdom: Thoughts from Prominent Jewish Women on Spirituality, Identity, Sisterhood,Family, and Faith",
        "Authors": "By Jaffe-Gili, Ellen and Jaffe-Gill, Ellen (EDT)",
        "Description": "Brings together the thoughts of well-known Jewish women of the past and present, such as Naomi Wolf, Bella Abzug, and Anne Frank, to capture the joys and struggles Jewish women of diverse backgrounds have faced in their lives. 25,000 first printing.",
        "Category": " Religion , Judaism , General",
        "Publisher": "Citadel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Biggest Job We'll Ever Have: The Hyde School Program for Character-Based Education and Parenting",
        "Authors": "By Gauld, Laura and Gauld, Malcolm",
        "Description": "Attitude over aptitude. Effort over achievement.  Character over talent.  In this groundbreaking book, Laura and Malcolm Gauld draw on their experience as parents and as educators at Hyde -- an organization of award-winning schools and programs -- to argue persuasively that true education springs not just from seeking good grades and achievements but from reestablishing a commitment to character, attitude, and purpose. Offering a new paradigm for reconnecting education with values, the Gaulds focus attention not on the child, but on the child's primary teacher -- the parent.  After explaining how enormous a parent's impact is on how children approach education and life, the Gaulds detail the Hyde program's 10 Priorities for meeting life's challenges so that any family can embrace them. Interspersed throughout are dozens of remarkable stories of Hyde parents and students; their funny, moving, and provocative anecdotes reveal that astonishing results are possible and that all children -- and their parents -- can exceed expectations and realize their full potential.",
        "Category": " Education , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Steadfast Christianity",
        "Authors": "By Swindoll, Charles R.",
        "Description": "The Apostle Paul's three-chapter letter to the persecuted Thessalonian Christians is packed full of affirmation and encouragement. These eight lessons will give strength to Christians dealing with hard times.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Handbook for Christian Living",
        "Authors": "By Kienel, Paul A. (EDT)",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Coming Out to Parents: A Two-Way Survival Guide for Lesbians and Gay Men and Their Parents",
        "Authors": "By Borhek, Mary V.",
        "Description": "An updated edition examines coming out in the age of AIDS as well as the latest religious views",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Pilgrim Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Judaism (Teach Yourself)",
        "Authors": "By Pilkington, C. M.",
        "Description": "",
        "Category": " Religion , Judaism , General",
        "Publisher": "Teach Yourself",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Children's Quick and Easy Cookbook",
        "Authors": "By Wilkes, Angela",
        "Description": "A vibrant cookbook contains more than one hundred simple recipes for everything from scrambled eggs to delicious pastries, all presented with full-color, step-by-step illustrations, introducing children to the joys of cooking and eating healthy foods.",
        "Category": " Juvenile Nonfiction , Cooking & Food",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Complete Cook",
        "Authors": "By Hale, Sophie",
        "Description": "Contains more than one thousand tested recipes for everything from soups, salads, and appetizers to desserts",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "8.56",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Tambalo and Other Stories of Far Lands",
        "Authors": "By Lide and Alison",
        "Description": "",
        "Category": "",
        "Publisher": "Beckley-Cardy Company",
        "Price Starting With ($)": "6.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1930"
        }
    },
    {
        "Title": "Disney's Read-It-Yourself Storybook",
        "Authors": "By Editors",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Let's Explore Science: Make It Change",
        "Authors": "By Evans, David and Williams, Claudette",
        "Description": "Uses simple observations and experiments to explore how various materials are changed by such processes as heating, wetting, and stirring",
        "Category": " Juvenile Nonfiction , Science & Nature , Chemistry",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Madame Curie. A Biography by Eve Curie",
        "Authors": "By Curie, Eve",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "6.69",
        "Publish Date": {
            "Month": "January",
            "Year": "1938"
        }
    },
    {
        "Title": "Becoming a Healthy Church: 10 Characteristics",
        "Authors": "By MacChia, Stephen A.",
        "Description": "",
        "Category": " Religion , Institutions & Organizations",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Philosophy Made Simple: A Novel",
        "Authors": "By Hellenga, Robert",
        "Description": "Rudy Harrington, an avocado dealer in Chicago, is ready for a new life. His daughters are grown, his wife has died, and the idea of running an avocado grove in Texas suddenly seems infinitely more appealing than the rambling house and the wholesale produce business that have sustained him so far. So a new life it is. Rudy leaves home and heads for a part of the world where he knows scarcely a soul. But he has a guide: a slender book one of his daughters has given him called Philosophy Made Simple, each chapter highlighting the ideas of a different philosopher. As he plunges into his unknown future, Rudy meets his challenges philosopher by philosopher, beginning with Plato and Aristotle and ending with Schopenhauer and Sartre. But no amount of philosophy can prepare Rudy for the surprises that emerge as he arranges for his daughter's Hindu wedding and gets to know Norma Jean - an elephant with a talent for painting who is abandoned to Rudy's care. Norma Jean's vast heart opens up Rudy's spirit and leads to his encounter with an extraordinary woman and the prospect of a new love.",
        "Category": " Fiction , Literary",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Way Baseball Works",
        "Authors": "By Gutman, Dan and McCarver, Tim (INT)",
        "Description": "If baseball is America's national pastime, surely our national genius is in tinkering: taking things apart to see how they are put together and how they work. The Way Baseball Works combines these two expressions of Yankee (to say nothing of Dodger) ingenuity to break the game down into its component parts and examine it through text, charts, computer-generated illustrations, and photos.  The Way Baseball Works explores:  * The development and design of equipment, from the construction of a baseball to the evolution of the glove * The science of the game -- pitching grips and trajectories, the physics of fielding, and the reason why, as Ted Williams said, \"hitting a baseball is the hardest thing in sports\" * The geometry of a ballpark, and why baseball, virtually alone among team sports, is a different game depending upon the park in which it is played. * The game as it is played at its highest level: in the head. How managers decide when to hit-and-run and when to sacrifice, how players make the split-second decisions that spell the difference between hitting .250 and .310...the difference between victory and defeat * The organization of baseball at all levels, including introductions to the dramatis personae of a baseball game -- not just players, but grounds-keepers, umpires, scorers, and trainers, all part of the ceremony and history of this most American of games.  The Way Baseball Works, featuring an introduction and dozens of comments by ex-major leaguer and present-day broadcaster and analyst Tim McCarver, and published with the full cooperation of the National Baseball Hall of Fame, is the ultimate treasure for baseball fans.  If baseball is America's national pastime, surely our national genius is in tinkering: taking things apart to see how they are put together and how they work. The Way Baseball Works combines these two expressions of Yankee (to say nothing of Dodger) ingenuity to break the game down into its component parts and examine it through text, charts, computer-generated illustrations, and photos.  The Way Baseball Works explores:  * The development and design of equipment, from the construction of a baseball to the evolution of the glove * The science of the game -- pitching grips and trajectories, the physics of fielding, and the reason why, as Ted Williams said, \"hitting a baseball is the hardest thing in sports\" * The geometry of a ballpark, and why baseball, virtually alone among team sports, is a different game depending upon the park in which it is played. * The game as it is played at its highest level: in the head. How managers decide when to hit-and-run and when to sacrifice, how players make the split-second decisions that spell the difference between hitting .250 and .310...the difference between victory and defeat * The organization of baseball at all levels, including introductions to the dramatis personae of a baseball game -- not just players, but grounds-keepers, umpires, scorers, and trainers, all part of the ceremony and history of this most American of games.  The Way Baseball Works, featuring an introduction and dozens of comments by ex-major leaguer and present-day broadcaster and analyst Tim McCarver, and published with the full cooperation of the National Baseball Hall of Fame, is the ultimate treasure for baseball fans.",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Pyramids (A First Discovery Book)",
        "Authors": "By Delafosse, Claude, Biard, Philippe (ILT), and Jeunesse, Gallimard (COR)",
        "Description": "Introducing the wonders and mysteries of the Egyptian pyramids, a highly visual guide explains how the ancient Egyptians were able to move huge blocks of stone to the pyramid sites and considers other fascinating structures.",
        "Category": " Juvenile Nonfiction , History , General",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Twelve : The Lives of the Apostles after Calvary",
        "Authors": "By Ruffin, C. Bernard",
        "Description": "",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Our Sunday Visitor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Run, Billy, Run (Matt Christopher Sports Classics)",
        "Authors": "By Christopher, Matt",
        "Description": "After joining the high school track team in an attempt to show up the local braggart, Billy Chekko finds it difficult to handle practice sessions, family responsibilities, and his feelings for a new girl he has met.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Inside the Helmet: A Player's Eye View of the N.F.L.",
        "Authors": "By King, Peter",
        "Description": "To the unsophisticated eye, football is a simple game. Eleven hulking behemoths line up on one side of a football; another eleven line up across from them. When the ball is snapped, both sides erupt into a single writhing, violent mass of bodies. Then, when everyone stops moving, they line up and do it again.Just because football doesn't look neat and precise doesn't mean that it lacks order. In fact, each seemingly chaotic play is the result of analysis, planning, practice, split-second adjustments, and the executions of well-rehearsed movements. And, because every player on the field is involved in the success or failure of each play, the attention to detail in football is mind-boggling.In Inside the Helmet, Peter King, Sports Illustrated's lead pro football columnist, takes us inside the world of professional football and shows us the game only the players and coaches see. As he profiles football's best and brightest, King shows us the intricacies of each position and why attention to detail wins and loses games. He shares a week with Boomer Esiason as he prepares for a game and shows us how his endless hours of film study and pregame preparation translate into action on the field. He shows us how a one-man gang like Bruce Smith can change a game with his speed, strength, and technique and what an offense must do to contain him. He takes us inside the high-stakes game within the game played by league-leading pass receiver Hayward Jeffires and all-pro defensive back Rod Woodson as they face off against each other play after play. He also shows us how Barry Sanders, the game's best running back, finds a hole, as well as what he sees, feels, and senses as he slices through a defense.Inside the Helmet shows us what football coaches really do. We fly across the country with one of the game's best, Jimmy Johnson, as he and his staff look for talent, and watch as they work the phone on draft day. King also shows us how a head coach supervises his team as they get ready for a big game and explains why today's head coaches are more likely to act like business executives than fat guys holding a blocking sled. Finally, King takes us inside the much overlooked kicking game, and explains why all successful coaches say that \"special teams\" are what win or lose championships.Peter King's sources are impeccable, his access is unique, and his understanding and love of the game are unparalleled. Inside the Helmet is the best look yet at football, the real thinking fan's game.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    }
]