[
    {
        "Title": "House Beautiful Colors for Your Home: 300 Designer Favorites",
        "Authors": "By House Beautiful Magazine (EDT)",
        "Description": "What transforms a room from monotone to magical? Color! So, if you’re nervous about splashing that white with bright, this conveniently portable primer based on House Beautiful’s most popular column will help. With special insider advice from top designers, plus a directory of actual paint swatches, this book is the most comprehensive and appealing color resource available today. All the colors are searchable by shade and by room, and every paint is accompanied by its manufacturer, name, and number, so you can match what you want right from the book. The guide’s unique format makes everything easy.Noted designers with long and distinguished careers offer suggestions for every room and mood. They provide advice on which shades to start with and which to experiment with, the classic palettes they keep coming back to, and how the right colors can simply make us feel good. Gorgeous room shots—such as Paula Perlini’s delphinium blue bedroom and Amanda Keyser’s merlot red walls—are accompanied by the exact brands of paint and their swatches, so you can examine the colors closely.An invaluable guide to color, this book will help you pick the right paints that will add beauty and style to your home.",
        "Category": " House & Home , Decorating",
        "Publisher": "Hearst",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Beached in the Hourglass",
        "Authors": "By Ethan Fischer",
        "Description": "",
        "Category": "",
        "Publisher": "The Bunny and the Crocodile Pr",
        "Price Starting With ($)": "6.4",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "10 Things I Want My Son to Know: Getting Him Ready for Life",
        "Authors": "By Chapman, Steve",
        "Description": "Encourages fathers to assume an active part in raising their sons in respectful dedication to God, addressing such topics as unconditional love, the role of discipline, interacting with women, and building successful marital skills. Original.",
        "Category": " Religion , Faith",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Where Grace Abides (The Riverhaven Years)",
        "Authors": "By Hoff, B. J.",
        "Description": "Readers loved Rachel's Secret, the first book in BJ Hoff's wildly popular new series, The Riverhaven Years, and are eagerly awaiting the continuing story of young Amish widow, Rachel Brenneman, and Irish-American riverboat captain, Jeremiah Gant.In Where Grace Abides, the compelling second book in the series, Hoff offers her readers an even closer look at the Amish community of Riverhaven and the people who live and love and work there. Secrets, treachery, and persecution are only a few of the challenges that test Rachel's faith and her love for the forbidden \"outsider,\" while Gant's own hopes and dreams are dealt a life-changing blow, rendering the vow he made to Rachel seemingly impossible to honor.Many of the other characters first introduced in Rachel's Secret now find their gentle, unassuming lives of faith jeopardized by a malicious outside influence. At the same time, those striving to help runaway slaves escape to freedom through the Underground Railroad face deception and the danger of discovery.All the elements readers have come to expect from author BJ Hoff (romance, drama, great characters) join together in Where Grace Abides to fill the pages with a tender, endearing love story and a bold, inspiring journey of faith.",
        "Category": " Fiction , Christian , Historical",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Allie and Her Square Feet",
        "Authors": "By Tutalo, Allison",
        "Description": "",
        "Category": "",
        "Publisher": "Old Line Publishing, LLC",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Static #1 (Flight 29 Down)",
        "Authors": "By Sorrells, Walter",
        "Description": "When their plane's engine dies on the way to a school-sponsored eco-tour, Flight 29 crash-lands on a Pacific island and leaves seven survivors stranded.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Sci-Fi: A Yellowthread Street Mystery (Rinehart Suspense Novel)",
        "Authors": "By Marshall, William Leonard",
        "Description": "During the annual science fiction festival in Hong Kong, Detective Chief Inspector Harry Feiffer must solve a bizarre series of murders by a killer known only as the Spaceman",
        "Category": " Fiction , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "Those Who Trespass: A Novel of Television and Murder",
        "Authors": "By O'Reilly, Bill",
        "Description": "From the mega-bestselling author of The O’Reilly Factor, The No Spin Zone, and Who’s Looking Out for You?, a mystery thriller about the fast-paced and ruthless world of TV journalism.With three consecutive number one bestsellers, Bill O’Reilly has proved that he’s the king of the nonfiction list. With Those Who Trespass, he extends his bestselling domain to fiction, giving readers a novel that’s an exciting look into the no-holds-barred world of television news.  One by one, high-level executives and correspondents are being murdered. Soon it becomes clear that the killings are linked, the work of a bitter former newsman exacting revenge on those who derailed his career.  Tommy O’Malley, a tough but warmhearted New York City detective, is assigned to crack the widening, high-profile murder cases, but encounters competition from a beautiful and tenacious tabloid reporter, Ashley Van Buren. As the story unfolds, Tommy and Ashley quickly discover they’ve got much more in common than a knack for solving crimes.Those Who Trespass combines suspense, action, psychodrama, and romance with a fascinating glimpse into the harsh realities behind the delivery of our daily dose of television news--a picture only Bill O’Reilly could bring to life.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Lonely Planet the Loire",
        "Authors": "By Williams, Nicola and Boone, Virginie",
        "Description": "",
        "Category": " Travel , Europe , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Bad Dogs Have More Fun: Selected Writings on Animals, Family and Life by John Grogan for The Philadelphia Inquirer",
        "Authors": "By Grogan, John",
        "Description": "Bad Dogs Have More Fun is an unforgettable collection of more than seventy-five newspaper articles from The Philadelphia Inquirer written by former columnist John Grogan. Combining humor, wit, poignancy, and affection, these columns provide insight into the intriguing and wonderful world we live in. Whether it be writing about animals (from dogs to elephants to geese!), powerful and moving comments about his own and other families, trenchant comments on life’s foibles and farces, or his interviews and interactions with people who are memorable and unusual in their own right, John Grogan makes us laugh?he makes us cry?he makes us think.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Vanguard Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Hazell plays Solomon",
        "Authors": "By Yuill, P. B.",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Walker",
        "Price Starting With ($)": "37.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Mirage of Peace: Understanding the Never-Ending Conflict in the Middle East",
        "Authors": "By Aikman, David",
        "Description": "Former TIME Magazine Jerusalem bureau chief David Aikman takes a sober, balanced impactful look at the Middle East, bringing a journalist’s mind and a believer’s heart to his examination of a region aflame. In this timely and informed exploration of current Middle East issues that goes beyond headlines and sound bites, Aikman fills in the blanks for thoughtful Christians, accurately tracing recent history and fairly portraying the leaders who have made that history. With a firm grasp on a biblical understanding of Israel’s past, present and future, he turns a critical eye on the political and religious policies of the region’s prime players, resorting neither to blind pro Israeli sentiment nor to reactionary pro Palestinian bias. Aikman challenges us to a uniquely Christian approach to the Middle East, respect, reason and love, rather than unqualified tolerance on the one hand or religious crusading on the other.",
        "Category": " Religion , Christian Life , Social Issues",
        "Publisher": "Regal",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Virtual Cody (Puffin Chapters)",
        "Authors": "By Duffey, Betsy and Thompson, Ellen (ILT)",
        "Description": "In the sequel to Hey New Kid!, third-grader Cody Michaels discovers that his parents had named him after someone's pet, as he records the ups and downs of elementary school life in his personal computer journal. Reprint.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Of Different Minds: Seeing Your AD/HD Child Through the Eyes of God",
        "Authors": "By Angelotti, Maren",
        "Description": "Parents of children with learning differences such as ADD/ADHD and Dyslexia have a unique and exciting road ahead of them. This phenomenon may have been perceived as a burden when their child was first diagnosed with these learning differences, but know that God does not make mistakes. Therefore, parents must refocus their personal expectations of what their child should be and find out where God is guiding this child. It is time to become God’s helper in raising His child. In Of Different Minds, readers will learn why their child is wired a little differently and how to cope with and educate this incredible person. The book also addresses parental denial and the mystery and fear surrounding ADD/ADHD, Dyslexia and related disorders; the toll on marriage; how to parent these children; the future of the family and the future for these children. Can a learning different child be successful? Of course, says Maren Angelotti, and here are the tools to set parents and their children on the path to success.",
        "Category": " Family & Relationships , Learning Disabilities",
        "Publisher": "Regal",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Single Mom's Devotional: A Book of 52 Practical and Encouraging Devotions",
        "Authors": "By Floch, Carol",
        "Description": "When Carol Floch realized that her marriage was about to end and that she was about to join the ranks of moms left to raise their children on their own, she could not stop crying. She mourned her shattered hopes and grieved the loss of the family she had always dreamed of. But mostly, she cried for her children. Into Carol’s grief, regret and fear, God’s Spirit came with a message from Psalm 84: Build your nest near my altar, and I will be your children’s source of security, protection, provision and blessing. In The Single Mom's Devotional, Carol tells her story and shares with the sisterhood of single moms how they can build their family’s nest in the protective shadow of God’s presence. Single mothers, whether on their own after a divorce or a husband’s death, will discover how to find true life in Christ and allow the strength of that inner life to be the compass by which they navigate an unpredictable future. Near God’s altar, the cross of Christ is where single moms will discover life through relinquishment, power through dependence and hope through surrender. Anchored at the foot of the cross, readers will find daily security and hope as they nourish their souls and nurture their children at a place near God’s altar.",
        "Category": " Religion , Christian Life , Family",
        "Publisher": "Regal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "On Mexican Time: A New Life in San Miguel",
        "Authors": "By Cohan, Tony",
        "Description": "An American writer and his wife find a new home—and a new lease on life—in the charming sixteenth-century hill town of San Miguel de Allende, Mexico.When Los Angeles novelist Tony Cohan and his artist wife, Masako, visited central Mexico one winter they fell under the spell of a place where the pace of life is leisurely, the cobblestone streets and sun-splashed plazas are enchanting, and the sights and sounds of daily fiestas fill the air. Awakened to needs they didn’t know they had, they returned to California, sold their house and cast off for a new life in San Miguel de Allende. On Mexican Time is Cohan's evocatively written memoir of how he and his wife absorb the town's sensual ambiance, eventually find and refurbish a crumbling 250-year-old house, and become entwined in the endless drama of Mexican life.  Brimming with mystery, joy, and hilarity, On Mexican Time is a stirring, seductive celebration of another way of life—a tale of Americans who, finding a home in Mexico, find themselves anew.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Forgotten Truth: The Common Vision of the World's Religions",
        "Authors": "By Smith, Huston",
        "Description": "This classic companion to The World's Religions articulates the remarkable unity that underlies the world's religious traditions",
        "Category": " Religion , Comparative Religion",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "One-Minute Prayers® for Women Gift Edition",
        "Authors": "By Lyda, Hope",
        "Description": "Draw near to God today Reach out to God with praise and thanksgiving using these thoughtful and insightful prayers. This delightful collection of one-minute talks with God will help you share your heart's desire to walk with Jesus, grow spiritually strong, reach out to others, and find comfort. Whether you start your morning with God, find strength in the middle of the afternoon, or close your day with Him, you'll experience His peace, embrace His grace, and find joy in His presence. Cause my faith to grow, Lord. Each day that I come to meet with You, may I know You better. Replace my ignorance with Your knowledge. Help me be strong in my commitment to You.",
        "Category": " Religion , Prayer",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Student to Student: A Guide to College Life",
        "Authors": "By Buchanan, Paul (COM) and Miller, Paula (COM)",
        "Description": "New college students face a world of adjustments as they take on the challenge of campus life, and one of the biggest tests is learning to thrive in the midst of monumental life change. Student to Student is a collection of reflections written by students, for students, that takes an honest look at the most common pitfalls and opportunities that life on campus affords. These weekly readings are written by Christian college students from a variety of Christian and secular institutions—over 20 schools are represented—and each entry opens a window into real-life campus experiences. Readers will instantly identify with the authentic voices of students finding their way through the maze of college life while growing their relationships with God.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Follow Me to Freedom: Leading anf Following As an Ordinary Radical",
        "Authors": "By Perkins, John M. and Claiborne, Shane",
        "Description": "Re-imagine Leading and Following in a World Longing for True Justice, Compassion and Freedom Followers of Christ yearn to see the world changed in compassionate, positive, effective ways. As prophetic voices, Shane Claiborne and John Perkins lead the way in this move to be the hands, feet and heart of Jesus. One is young, a self proclaimed reformed redneck who grew up in the hills of Tennessee and now lives in inner city Philadelphia and the other is decades older, an African-American civil rights leader who was almost beaten to death by police in Mississippi, and went on to found a reconciliation movement and counsel three American presidents. Claiborne and Perkins draw on more than a century of combined following and learning, activating and leading. Together they craft a timely message for ordinary people willing to take radical steps to see real change happen. InFollow Me to Freedom, Claiborne and Perkins lead the way toward justice for all, unfolding a proven strategy as ancient as the patriarchs of faith and as fresh as the needs of every human heart. Starting with Moses as a model, they re-imagine leading and following in a world desperate for true social justice, compassion and freedom. They offer practical ways to internalize and live out God’s promise of freedom in the twenty-first century. Followers of Christ will not only be inspired but also catalyzed into action, and the world will never be the same.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Regal",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Marriage Ring (Scandals and Seductions, 3)",
        "Authors": "By Maxwell, Cathy",
        "Description": "“Cathy Maxwell can’t be beat!\"—Jill Barnett New York Times and USA Today bestselling author Cathy Maxwell continues her exciting Scandals and Seductions series with The Marriage Ring—a wonderful battle-of-the-sexes love story that will delight readers of Christina Dodd and Victoria Alexander. A sensuous, fan-pleasing follow up to The Earl Claims His Wife and A Seduction at Christmas, Maxwell’s The Marriage Ring is pure gold from an author praised for her “engaging characters, exceptionally well done dialog, unexpected plot twists, and lively writing style” (Library Journal), and who, after more than a dozen superb historical romances, just keeps getting better and better.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Math on Call: A Mathematics Handbook",
        "Authors": "By Great Source Education Group",
        "Description": "",
        "Category": " Juvenile Nonfiction , Mathematics , General",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Faith Begins at Home: The Family Makeover with Christ at the Center",
        "Authors": "By Holmen, Mark",
        "Description": "A book for parents that will inspire, motivate and equip them to establish their home as the primary place where faith is nurtured. This book is filled with inspirational stories and practical ideas that families can begin implementing today to bring Christ and Christ-like living into the center of their home. This resource isa perfect gift to give to new parents and it also has discussion questions at the end of each chapter which also makes it a perfect resource for family small groups.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Regal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Bad Kitty Gets a Bath",
        "Authors": "By Nick Bruel",
        "Description": "",
        "Category": "",
        "Publisher": "Roaring Brook Press/A Neal Porter Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "11 Innovations in the Local Church: How Today's Leaders Can Learn, Discern and Move into the Future",
        "Authors": "By Towns, Elmer L., Bird, Warren, and Stetzer, Ed",
        "Description": "Join three seasoned church-ministry experts on an insider’s tour of the most innovative churches today! Discover a dozen types of innovation, each with profiles of congregations that have implemented that innovation. This is more than a show and tell tour, however. Each chapter offers a solid take-away for church leaders on how to learn and apply the appropriate innovation profiled. The authors also offer scripturally-based assessments of both the positive and negatives implications of implementing each innovation, providing guidance and wisdom. There are many ways to present the Gospel, and this timely book will serve as a springboard for church leaders scratching their heads and asking themselves, “What should we do next?” By learning from a dozen different church types, church leaders can become more intentional about exploring new directions and reaching more of the world for Christ.",
        "Category": " Religion , Christian Church , Growth",
        "Publisher": "Regal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Warrior Chicks: Rising Strong, Beautiful and Confident",
        "Authors": "By Wagner, Holly",
        "Description": "Some battles we choose, others choose us. The world is looking and waiting for a company of women who will rise in the midst of hard times. It would be so much easier to sit…to give in. And, yet, isn’t there a part inside us all that longs to stand up and fight the battles before us? From her best-selling books, God Chicks and Daily Steps for GodChicks, Holly Wagner identified and encouraged the cultivation of aspects of the God Chick within every woman. The subject of this exciting book is the “Warrior Chick” who realizes she is destined to be an overcomer as she faces challenges, is encouraged as she realizes she is beautiful just the way she is, and is relieved as she learns how to equip herself to fight the fight. As Holly well knows from her experience as a warrior chick battling breast cancer, we aren’t living in peacetime and we can either choose to be a casualty or a warrior. What’s it going to be?",
        "Category": " Religion , Christian Life , Women's Issues",
        "Publisher": "Regal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Do the Right Thing: How Dedicated Employees Create Loyal Customers and Large Profits",
        "Authors": "By Parker, James F.",
        "Description": "The #1 Principle of Sustainable Business Success Is Simpler Than You Think      “Do the Right Thing is about how any company can stay true to its soul. Jim Parker’s deep and abiding belief in the power of people and culture in building a business of lasting worth is evident everywhere; so too is his humility and selflessness as a leader--his stories are not about his own achievements, which are many, but those of the people he led, one of the great success stories of our time.”  --Sean Moriarty, CEO, Ticketmaster     “Do the Right Thing offers insightful views into the culture, leadership, and decisions that build great companies the right way. A must read for my management team. THIS BOOK ROCKS.”  --Kent Taylor, Founder and Chairman, Texas Roadhouse Restaurants     “The book is a fun read filled with memorable stories that get at the heart of what it takes to lead in a way that simultaneously satisfies employees, customers, and shareholders. Jim Parker plays the role of eloquent detective and ferrets out the interweaving parts that distributed leadership, culture, values, and teamwork play as the underlying layers of a company’s success. This is a book about heroes at all levels and the environment needed to create those heroes. A must-read for today’s leaders.”  --Professor Deborah Ancona, Seley Distinguished Professor of Management and Faculty Director of the MIT Leadership Center, Sloan School of Management     “You’ll laugh and cry reading Jim’s book, and probably won’t be able to put it down. It will forever change the way you view the employees in your organization.”  --Beverly K. Carmichael, Member, Board of Directors, Society for Human Resource Management      People matter most.    You know that. But most companies would rather slash costs, cut headcount, replace well-paid employees with lower-paid employees or outsourced workers, and reduce customer service. No wonder so many fail–while others focused on doing the right thing remain profitable and growth oriented for decades. James F. Parker shows why “doing the right thing” isn’t just naïve “feel-goodism:” it’s the most powerful rule for business success. Parker’s stories won’t just convince you: They’ll move you. Naïve? No way. In this book, Southwest Airlines’ former CEO proves why doing what’s right is the #1 rule of business success. James F. Parker tells how after 9/11, Southwest made three pivotal decisions: no layoffs, no pay cuts, and no-hassle refunds for any customer wanting them. The result: Southwest remained profitable and its revenue passenger miles for 4Q01 held steady while the rest of its industry nearly collapsed...and Southwest’s market cap soon exceeded all its major competitors combined. Thes",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Pearson P T R",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Kids Cook!: Fabulous Food for the Whole Family (Kids Can! Series)",
        "Authors": "By Williamson, Sarah, Williamson, Zachary, and Trezzo-Braren, Loretta (ILT)",
        "Description": "Actually written by two real kids, Kids Cook! includes real food menus to be enjoyed by everyone in the family. The sixth title in the Kids Can! series.",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Adventure Stories That Will Thrill You",
        "Authors": "By Chronicle Books Staff",
        "Description": "Emergent readers can explore the Arctic tundra with a pack of sled dogs or go sailboating into the middle of a wild storm in five exerpts taken from exciting picture books by Betsy Byars, Arnold Lobel, and others. Simultaneous.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Image by Design: From Corporate Vision to Business Reality",
        "Authors": "By Shachtman, Tom and Chajet, Clive",
        "Description": "Addresses the importance of establishing a corporate image and examines the success of Lippincott & Margulies, a company that has shaped the images of leading American corporations",
        "Category": " Business & Economics , Strategic Planning",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Eyes Wide Open: Avoiding the Heartbreak of Emotional Promiscuity",
        "Authors": "By Murk, Brienne",
        "Description": "In our postmodern world, we are so driven by our emotions that in “living for the moment” we’ve forgotten to guard our most precious treasure—our hearts. Young people may not realize it, but acts that appear innocent—such as e-mail and instant messages—can entangle our emotions and lead the heart to places it should not go. Most people give their hearts away long before they give their bodies away, so it is imperative that young people learn the importance of emotional purity, how to avoid the steps that too often lead to a physical downfall and how to live pure lives. Like talking to a big sister who’s gone before them, reading Eyes Wide Open will give young people the necessary keys for making decisions about purity, love and romance. She also shows them how to acquire a thirst for purity as they realize it is not just another rule, but a path that leads to a dimension of deep and fresh living where they can truly thrive.",
        "Category": " Young Adult Nonfiction , Social Topics , Dating & Sex",
        "Publisher": "Regal",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Crossing the Threshold of Eternity: What the Dying Can Teach the Living",
        "Authors": "By Wise, Robert L.",
        "Description": "If we learn to listen and observe carefully, the dying can teach us important things that we need to learn in preparing for the end of our own life’s journey. From standing at the bedside of the dying, Dr. Robert Wise came to realize there were important patterns and steps that the dying were trying to describe. And, yet, many miss these life lessons when they go to great lengths to avoid a conversation or encounter with the dying. Wise learned by stopping and listening to the dying that we can get beyond our morbid fears of death, to come to a place of peaceful acceptance and to be able to look ahead to a dignified celebration of death. Inspiring stories of those with one foot stepping into eternity give us assurance, hope and a fresh expectation of what lies beyond the grave. We can all face it without fear. Here are fascinating stories offering reassurance and promise.",
        "Category": " Religion , Christian Life , Death, Grief, Bereavement",
        "Publisher": "Regal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Hush Little Baby",
        "Authors": "By Long, Sylvia",
        "Description": "Hush little baby, don't say a word,Mama's going to show you a hummingbird.If that hummingbird should fly,Mama's going to show you the evening sky.From award-winning artist Sylvia Long comes a touching version of the well-known lullaby, Hush Little Baby. Each spread reveals a tender scene as a mama bunny lulls her baby bunny to sleep by enlisting a parade of bedtime wonders—the beauty of a hummingbird in flight; the magic of a harvest moon; the reassurance of a parent's hug, all these and more combine to create a classic volume sure to be treasured for generations to come.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Through the Fire (Mystery and the Minister's Wife Series #1)",
        "Authors": "By Noble, Diane",
        "Description": "",
        "Category": " Fiction , Christian , Suspense",
        "Publisher": "Guideposts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "America on the Ice: Antarctic Policy Issues",
        "Authors": "By frank g. klotz",
        "Description": "",
        "Category": "",
        "Publisher": "National Defense University Press",
        "Price Starting With ($)": "22.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Touch the Wind : Creative Worship with Children",
        "Authors": "By Carr, Jo",
        "Description": "",
        "Category": "",
        "Publisher": "Upper Room Books",
        "Price Starting With ($)": "6.88",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "A Little Giant® Book: Tongue Twisters (Little Giant Books)",
        "Authors": "By Rosenbloom, Joseph, Kendrick, Dennis (ILT), and Artell, Mike",
        "Description": "An illustrated collection of hundreds of difficult tongue twisters, arranged alphabetically.",
        "Category": " Juvenile Nonfiction , Humor , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "A Book of Simple Prayers",
        "Authors": "By Gaither, Gloria",
        "Description": "Life greets us in different ways each day: We experience joy, confusion, doubt and grief. We walk through seasons of loneliness and times of closeness with God, family and friends. Each event, the birth of a new baby, the death of a loved one, the sound of a familiar melody, can be an occasion for prayer. In A Book of Simple Prayers, beloved songwriter Gloria Gaither shares the prayers she has prayed in moments like these. At times questioning, playful, trusting or anxious, this collection of Gloria's prayer poetry is a medley of honest and open-hearted conversation with God. With her renowned mastery of language and matchless instinct for just the right turn of phrase, she invites us to pray along with her, expressing our hopes and heartaches to the God who listens.",
        "Category": " Religion , Christian Life , Prayer",
        "Publisher": "Regal",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Everything Kids' Travel Activity Book: Games to Play, Songs to Sing, Fun Stuff to Do - Guaranteed to Keep You Busy the Whole Ride!",
        "Authors": "By Hanson, Jeanne and Hanson, Erik A.",
        "Description": "Do you love riding on planes, trains, and automobiles but get restless on the way? If the answer is yes, take along The Everything Kids’ Travel Activity Book and you’ll be there before you know it! Packed full of puzzles, activities, quizzes, and games, this book provides hours of nonstop fun that can be done alone or shared with other kids. There’s cool stuff to do, like: Create your own postcard Invent a new automobile Play detectiveThe Everything Kids’ Travel Activity Book also gives you answers to all sorts of crazy questions: What makes your foot “go to sleep?” Why does your sister cough? Why do we daydream? On top of all that, you can draw caricatures, test your memory, and even keep a weather diary. The traveling fun is so endless you’ll never ask “Are we there yet?” again!",
        "Category": " Juvenile Nonfiction , Travel",
        "Publisher": "Everything",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "To the Top! Climbing the World's Highest Mountain (Step-Into-Reading, Step 5)",
        "Authors": "By Lapadula, Tom (ILT) and Kramer, Sydelle",
        "Description": "Illus. in full color. Here is the gripping story of Hillary and Norgay's perilous ascent of Mount Everest as they battled snow and ice slides, whipping winds, and the grim knowledge that 19 others had died in the same attempt.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "The Great Entertainer: A Century of Great Music 128 Immortal Songs",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Big 3 Music Corporation",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Soviet Air Force at war (The Epic of flight)",
        "Authors": "By Miller, Russell",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "America in the Air War (Epic of Flight)",
        "Authors": "By Jablonski, Edward",
        "Description": "Traces United States aerial operations in World War II and recounts the training and combat experiences of pilots and flight crews",
        "Category": " History , General",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Everyday Mysteries",
        "Authors": "By Wexler, Jerome",
        "Description": "Full-color photographs of everyday objects explore the mysteries of distance, perspective, and light, as they challenge readers to identify the surfaces, cross-sections, edges, and silhouettes of the pictures.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "What is Christmas",
        "Authors": "By Wummer, Amy (ILT) and Adams, Michelle Medlock",
        "Description": "After taking the reader through all the Christmas symbols, the author concludes that it's okay to have gifts, trim the tree, even talk to Santa Claus, but the real reason for the season is Jesus. By the creators of What Is Easter?",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Embattled Confederacy: The Image of War, 1861-1865, Vol. 3 (The Image of War, 1861-1865, V. 3)",
        "Authors": "By Davis, William C. (EDT)",
        "Description": "Photographs show the aftermath at Antietam, Frederickburg, Chancellorsville, and Gettysburg, the addition of Black Union soldiers, and the blockade of the South",
        "Category": " History , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "7.75",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "Dog Facts",
        "Authors": "By Palmer, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "Marboro Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Really Bad Girls of the Bible: More Lessons from Less-Than-Perfect Women",
        "Authors": "By Higgs, Liz Curtis",
        "Description": "When it Comes to Badness, There's Nothing New Under the SunIn her best-selling book Bad Girls of the Bible, Liz Curtis Higgs breathed new life into ancient stories depicting eight of the most infamous women in scriptural history, from Jezebel to Delilah. Biblically sound and cutting-edge fresh, Bad Girls already has helped thousands of women experience God's grace anew by learning more about our nefarious sisters.And there are more where they came from! With Really Bad Girls of the Bible, Liz reveals the power of God's sovereignty in the lives of other shady ladies we know by reputation but have rarely studied in depth: Bathsheba, the bathing beauty. Jael, the tent-peg-toting warrior princess. Herodias, the horrible beheader. Tamar, the widow and not-so-timid temptress. Athaliah, the deadly daughter of Jezebel. And three ancient women whose names we do not know but who have much to teach us: the ashamed Adulteress, the bewitching Medium of En Dor, and the desperate Bleeding Woman. The eye-opening stories of these eight \"Really Bad\" women demonstrate one really life-changing concept: the sovereign power of God to rule our hearts and our lives with grace, compassion, and hope.",
        "Category": " Religion , Biblical Biography , General",
        "Publisher": "Water Brook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Recipes from America's Small Farms: Fresh Ideas for the Season's Bounty: A Cookbook",
        "Authors": "By Hayes, Joanne (EDT), Stein, Lori (EDT), and Webber, Maura (EDT)",
        "Description": "Recipes from America’s Small Farms gathers the most exciting, original, and authentic recipes—using the freshest ingredients—from those who know best how to set a table anytime of the year. Favorite recipes from farmers across the country and members of Community Supported Agriculture—a national organization that facilitates direct farmer-to-consumer sales of produce—will inspire home cooks everywhere. Also included are recipes from high-profile chefs such as Rick Bayless (Frontera Grill), Peter Hoffman (Savoy), Roxanne Klein (Roxanne’s), and Kevin von Klause (White Dog Café).Readers will find it easy to locate recipes, organized by food family, that call for the vegetables and fruits that are in season, readily available, and simple to use. Recipes like Creamy Turnip Soup; Heirloom Tomatoes with Fresh Herbs, Toasted Pine Nuts, and Tapenade Toast Points; Greek Zucchini Cakes; and Hiroko’s Fusion Choy with Tahini-Soy Dip give common produce exotic appeal.The book includes a chapter on meat, poultry, eggs, and seafood, and there are vegan recipes throughout. Each chapter provides details about the history, characteristics, and nutritional qualities of specific fruits and vegetables. Cooking techniques, useful sidebars, and a glossary make this book an indispensable resource.",
        "Category": " Cooking , Specific Ingredients , Natural Foods",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Buzzing Bugs (My First Library)",
        "Authors": "By Greve, Tom",
        "Description": "Introduces harmful flying insects, including bees, wasps, and mosquitoes, and explains why they can be dangerous and how to avoid them.",
        "Category": " Juvenile Nonfiction , Animals , Insects, Spiders, etc.",
        "Publisher": "Rourke Publishing Distributed by Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "My 1st Book of Prayers: Mi Primer Libro de Oraciones",
        "Authors": "By Britt, Stephanie McFetridge (ILT)",
        "Description": "A precious book that teaches young children how to talk to God, MY FIRST BOOK OF PRAYERS is joined by its Spanish-language counterpart in a volume perfect for children studying Spanish or learning English as a second language.",
        "Category": " Juvenile Nonfiction , Religious , Christian , Devotional & Prayer",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Jumping Spiders (Spiders Discovery Library)",
        "Authors": "By Cooper, Jason",
        "Description": "Describes the characteristics, behavior, and life cycle of jumping spiders.",
        "Category": " Juvenile Nonfiction , Animals , Insects, Spiders, etc.",
        "Publisher": "Rourke Publishing Distributed by Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Stories About Cats and the Lives They Touch",
        "Authors": "By Shaefer, Peggy",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Ideals Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "1,001 Low-Fat Vegetarian Recipes, 2nd ed.",
        "Authors": "By Spitler, Sue and Yoakam, Linda R.",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Vietnamese",
        "Publisher": "Surrey Books",
        "Price Starting With ($)": "6.74",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Complete Vegan Cookbook: Over 200 Tantalizing Recipes, Plus Plenty of Kitchen Wisdom for Beginners and Experienced Cooks",
        "Authors": "By Toomay, Mindy and Geiskopf-Hadler, Susann",
        "Description": "Now vegan means vitality and vibrant taste! A simple definition: The vegan diet consists  exclusively of foods from the vegetable kingdom and excludes all animal products—meat,  poultry, fish, seafood, eggs, dairy, and honey—as well as products which are processed  using animal ingredients. Good health and great flavor have finally come together!  Whether you're a full-time vegan or simply looking for an occasional \"ideal\" meal—one  low in saturated fat and cholesterol and high in health-enhancing nutrients and great  taste—here is your definitive source for easy and innovative vegan cooking. It's  proven that eating an abundance of foods from the vegetable kingdom leads to a healthier—and  perhaps longer—life. But healthful eating doesn't have to be bland and boring! The  Complete Vegan Cookbook is your step-by-step guide to creating delicious and satisfying  vegan dishes for breakfast, lunch, dinner, and dessert. You'll discover more than  200 tempting recipes as well as exciting meal plans for special family meals and  entertaining. Now you can experience the health benefits of the vegan diet while  enjoying hearty meals and mouthwatering flavor! Enticing recipes include:  • Southwest  Corn, Chard, and Potato Soup • Yellow Beet and Arugula Salad with Dried Cranberries  • Bulgur and Red Lentil Pilaf with Kale and Olives • Eggplant Enchiladas with Almond  Mole • Spaghetti with Artichoke-Pistachio Pesto • Arborio Rice Pudding with Pears  • Oat and Buckwheat Pancakes with Blueberry Sauce • And many, many more",
        "Category": " Cooking , Vegan",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "7.21",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "God Grew Tired of Us: A Memoir",
        "Authors": "By Sweeney, Michael S. and Dau, John Bul",
        "Description": "\"Lost Boy\" John Bul Dau’s harrowing experience surviving the brutal horrors of Sudanese civil war and his adjustment to life in modern America is chronicled in this inspiring memoir and featured in an award-winning documentary film of the same name. Movingly written, the book traces Dau’s journey through hunger, exhaustion, terror, and violence as he fled his homeland, dodging ambushes, massacres and attacks by wild animals. His tortuous, 14-year journey began in 1987, when he was just 13, and took him on a 1,000-mile walk, barefoot, to Ethiopia, back to Sudan, then to a refugee camp in Kenya, where he lived with thousands of other Lost Boys. In 2001, at the age of 27, he immigrated to the United States. With touching humor, Dau recounts the shock of his tribal culture colliding with life in America. He shares the joy of reuniting with his family and the challenges of making a new life for himself while never forgetting the other Lost Boys he left behind.",
        "Category": " Religion , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "All About Green Tea",
        "Authors": "By Dolby Toews, Victoria and Challem, Jack",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Outdoor Decor : Decorative Projects for the Porch, Patio & Yard (Arts & Crafts for Home Decorating Series)",
        "Authors": "By Cy Decosse Incorporated (EDT)",
        "Description": "Suggests a range of projects for personalizing outdoor living spaces, including water gardens, customized trellises, cushions for outdoor furniture, and creative lighting effects",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "Random House Canada",
        "Price Starting With ($)": "5.33",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Learning Spanish,Second Edition (2nd Edition)",
        "Authors": "By Stein, Gail",
        "Description": "You're no idiot, of course.  You know the difference between a verb and a noun, know \"adios\" means good-bye, and can even order margaritas with just the right flair.  But when it comes to mastering a language, all you can do is order the \"taco grande.\"  Don't rip up that menu just yet!  The Complete Idiot's Guide to Learning Spanish on Your Own, Second Edition makes learning the language fun and easy.  Whether you're planning a vacation or a business trip, this new edition adds new phrases and vocabulary words to help you gain confidence in speaking Spanish.  In this fully revised and updated edition, you get:",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Alpha",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "My Daddy and I",
        "Authors": "By Hallinan, P. K.",
        "Description": "In only about 200 words, author P.K. Hallinan expresses the loving relationship between child and father. With rhyming verse and colorful illustrations, the book is sure to become a storytime favorite.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Yada Yada Prayer Group: The Yada Yada Prayer Group, Book 1 (Women of Faith Fiction) (2008 Novel of the Year)",
        "Authors": "By Jackson, Neta",
        "Description": "What do an ex-con, a former drug addict, a real estate broker, a college student, and a married mother of two have in common?Nothing, or so I thought. Who would have imagined that God would make a prayer group as mismatched as ours the closest of friends? I almost didn't even go to the Chicago Women's Conference--after all, being thrown together with five hundred strangers wasn't exactly my \"comfort zone.\" But something happened that weekend to make us realize we had to hang together, and the \"Yada Yada Prayer Group\" was born! When I faced the biggest crisis of my life, God used my newfound Sisters to show me what it means to be just a sinner saved by grace.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "MythBusters: The Explosive Truth Behind 30 of the Most Perplexing Urban Legends of All Time",
        "Authors": "By Zimmerman, Keith, Zimmerman, Kent, Hyneman, Jamie, Savage, Adam, and Rees, Peter",
        "Description": "The hosts of the hit television series MythBusters go behind the scenes to provide the real story of thirty of our most baffling urban legends, explaining how they use modern-day scientific principles and methods to document what is fact and what is fiction, in a volume that includes illustrations, photographs, blueprints, and interviews to document the process. Leave no urban myth untested. Could you kill someone by dropping a penny from a skyscraper? Can an unsuspecting scuba diver be sucked out of thewater by a firefighting helicopter and get spit out in the middle of a forest fire? Can you save yourself in a plummeting elevator by jumping just before it hits bottom? Special effects experts Jamie Hyneman and Adam Savage, hosts of the Discovery Channel's top-rated MythBusters, use modern-day extreme science to show you what's real and what's fiction. With photographs, illustrations, blueprints, and exclusive interviews to document the mythbusting process, MythBusters: The Explosive Truth Behind 30 of the Most Perplexing Urban Legends of All Time will examine dozens of urban legends, from exploding toilets to being buried alive -- these guys have tested them all. Eye-opening, jaw-dropping, and even laugh-inducing, this book will delight armchair scientists, curious readers, and fans of the show alike. Keith and Kent Zimmerman are the New York Times bestselling coauthors of Hell's Angel and The Best Damn Sports Book, Period, among others.",
        "Category": " Performing Arts , Television , Guides & Reviews",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Sugar Plum Ballerinas #1: Plum Fantastic",
        "Authors": "By Goldberg, Whoopi, Roos, Maryn (ILT), and Cato, Nancy",
        "Description": "Alexandrea Petrakova Johnson does not want to be a beautiful ballerina, and she does not want to leave her friends in Apple Creek.  Unfortunately, that doesn't stop her ballet-crazy mother from moving them to Harlem, or from enrolling Al at the Nutcracker School of Ballet.  Life is hard when you're the new ballerina on the block, and it's even harder when you're chosen to be the Sugar Plum Fairy in the school recital!  Not only is Al a terrible dancer, but she's also got a rotten case of stage fright!  Al's  ballet classmates are going to have to use all the plum power they've got to coach this scary fairy!",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Your Green Home: A Guide to Planning a Healthy, Environmentally Friendly New Home (Mother Earth News Wiser Living Series)",
        "Authors": "By Wilson, Alex and Abrams, John (FRW)",
        "Description": "More and more homeowners today want houses that are healthy to live in and cause minimal damage to the environment. That’s what green building is all about.Your Green Home is written for homeowners planning a new home—whether you are working with an architect or builder, or serving as your own general contractor. Intended to improve the overall environmental performance of new houses being built, the book sets out to answer some of the big-picture questions relating to having a home designed and built—and getting what you want.Your Green Home covers: • Home location and its relationship to the community • Site design • Construction systems • Building design to optimize energy performance • Renewable energy systems • Material selection • Indoor environmental quality • Water efficiency • Material selectionWritten by the founder of BuildingGreen—North America’s premier green building authority—this book will prove useful not only to future homeowners, but also to designers and builders seeking to meet this demand. Building professionals well-versed in green building may find this a useful book to give to potential clients to convey the scope and principles of green building.Alex Wilson is president of BuildingGreen, Inc. and executive editor of Environmental Building News, the oldest and most respected publication serving North America’s green building industry. A green building expert since the 1970s, he has authored countless articles on the topic and several books, including Green Building Products, the Consumer Guide to Home Energy Savings, and Green Development: Integrating Ecology and Real Estate.",
        "Category": " Architecture , Buildings , Residential",
        "Publisher": "New Society Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The 6 Messiahs",
        "Authors": "By Frost, Mark",
        "Description": "In The Six Messiahs, Mark Frost creates a novel of nineteenth-century mystery, adventure, and terror with Arthur Conan Doyle - the creator of the Sherlock Holmes books - at the center of the heart-stopping action.Now off to America for his first book tour, Doyle is joined by his impetuous younger brother, Innes, and a cryptic Irish priest. During their voyage across the Atlantic, the men are stalked by an otherworldly order of assassins attempting to steal a precious piece of the ship's cargo: a priceless book of ancient mysticism.The Book of Zohar is the first piece of a lethal puzzle that will draw Doyle across the burgeoning young nation. From the filthy slums of lower Manhattan to the dark alleys of Chicago to a final apocalyptic confrontation in the searing Arizona desert, Doyle and his companions track the paths of six mysterious strangers who are united by a single, eerie dream. A dream of a black tower rising out of a wasteland - and a river of blood. As their trails converge at the source of this terrifying vision, Doyle and company confront an evil so dark and profound that it threatens to obliterate the very fabric of the world.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "The World is Flat (A Brief History of the Twenty-First Century)",
        "Authors": "By Friedman, Thomas L.",
        "Description": "The World Is Flat is Thomas L. Friedman's account of the great changes taking place in our time, as lightning-swift advances in technology and communications put people all over the globe in touch as never before--creating an explosion of wealth in India and China, and challenging the rest of us to run even faster just to stay in place. This updated and expanded edition features more than a hundred pages of fresh reporting and commentary, drawn from Friedman's travels around the world and across the American heartland--from anyplace where the flattening of the world is being felt.In The World Is Flat, Friedman at once shows \"how and why globalization has now shifted into warp drive\" (Robert Wright, Slate) and brilliantly demystifies the new flat world for readers, allowing them to make sense of the often bewildering scene unfolding before their eyes. With his inimitable ability to translate complex foreign policy and economic issues, he explains how the flattening of the world happened at the dawn of the twenty-first century; what it means to countries, companies, communities, and individuals; how governments and societies can, and must, adapt; and why terrorists want to stand in the way. More than ever, The World Is Flat is an essential update on globalization, its successes and discontents, powerfully illuminated by one of our most respected journalists.",
        "Category": " Technology & Engineering , Social Aspects",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Aquarium Fish (Eyewitness Handbooks)",
        "Authors": "By Mills, Dick and Young, Jerry (PHT)",
        "Description": "Features descriptive entries for more than 500 marine and freshwater fish varieties, discussing characteristics, diet, temperament, classification, and aquarium management",
        "Category": " Pets , Fish & Aquariums",
        "Publisher": "DK",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Laura Rider's Masterpiece",
        "Authors": "By Hamilton, Jane",
        "Description": "Laura and Charlie Rider have been married for twelve years.  They share their nursery business in rural Wisconsin, their love for their animals, and their zeal for storytelling.  Although Charlie's enthusiasm in the bedroom has worn Laura out, although she no longer sleeps with him, they are happy enough going along in their routine.  Jenna Faroli is the host of a popular radio show, and in Laura's mind is \"the single most famous person in the Town of Dover.\"  When Jenna happens to cross Charlie's path one day, and they begin an e-mail correspondence, Laura cannot resist using Charlie to try out her new writing skills.  Together, Laura and Charlie craft florid, strangely intimate messages that entice Jenna in an unexpected way.  The \"project\" quickly spins out of control.  The lines between Laura's words and Charlie's feelings are blurred and complicated, Jenna is transformed in ways that deeply disturb her, and Laura is transformed in her mind's eye into an artist.  The transformations are hilarious and poignant, and for Laura Rider, beyond her wildest expectations.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "And God Said...Let There Be Laughter",
        "Authors": "By Hollingsworth, Mary",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "GuidepostsBooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Cool Math",
        "Authors": "By Maganzini, Christy and Daugavietis, Ruta",
        "Description": "Describes mathematics from zero to infinity with stops along the way for ancient puzzles, awesome math tricks, tantalizing math trivia, incredible shortcuts, and mysterious number magic",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Fang: A Maximum Ride Novel (Book 6) (Maximum Ride, 6)",
        "Authors": "By Patterson, James",
        "Description": "Angel says that Fang will be the first to die, and Angel is never wrong. Maximum Ride is used to living desperately on the run from evil forces sabotaging her quest to save the world--but nothing has ever come as close to destroying her as this horrifying prophetic message. Fang is Max's best friend, her soul mate, her partner in the leadership of her flock of winged children. A life without Fang is a life unimaginable.When a newly created winged boy, the magnificent Dylan, is introduced into the flock, their world is upended yet again. Raised in a lab like the others, Dylan exists for only one reason: he was designed to be Max's perfect other half. Thus unfolds a battle of perfection versus passion that terrifies, twists, and turns . . . and meanwhile, the apocalypse is coming.",
        "Category": " Young Adult Fiction , Science Fiction , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "The New Yorker Book of Doctor Cartoons",
        "Authors": "By The New Yorker",
        "Description": "Arno, Steig, Addams, Shanahan, Leo Cullum, and other distinguished cartoonists present a zany look at the medical profession, in a collection of eighty-five cartoons from the pages of The New Yorker. 40,000 first printing.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Hot Toddies: Mulled Wine, Buttered Rum, Spiced Cider, and Other Soul-Warming Winter Drinks",
        "Authors": "By O'Hara, Christopher B. and Nash, William A. (PHT)",
        "Description": "When the weather outside is frightful, what could be more delightful than a hot toddy? From the scent of nutmeg-laced hot buttered rum to the fizz of a poinsettia cocktail, there’s nothing like a classic winter drink to bring true festivity to the season. And it’s easy as pie—whipping up an eggnog from scratch is a whole lot simpler than cooking the perfect turkey, and your guests will appreciate the gesture as much as the taste. From spiced cider to champagne punch, Hot Toddies is the perfect little collection of winter refreshments, with fail-safe recipes that will make any holiday party shine.These delicious seasonal drink ideas are as perfect for wintertime as a cold smoothie is for summer. Rather than offering guests the same lackluster wine, heat it with sweet spices, spike it with Aquavit, and serve up an authentic Swedish glögg for some true Christmas spirit. Tempt friends with the luscious richness of chocolate eggnog, topped with real chocolate whipped cream. Curl up on a blustery winter’s day with a steamy, frothy Irish coffee, or combine apple cider, bourbon, and spices for a Thanksgiving Day batch of harvest moon punch. In addition to these flavorful recipes, useful tips on everything from keeping punch cold to stocking a bar will help you concoct special drinks all winter long—even the whole year round. Whether it’s a stocking stuffer, a hostess gift, or a great addition to your next holiday party, Hot Toddies is the perfect guide to celebrating the season.",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Ecoart! Earth Friendly Art (Williamson Kids Can! Series)",
        "Authors": "By Carlson, Laurie",
        "Description": "The bestselling author of Kids Create! combines her intuitive sense of each child's need for self-expression and interaction with nature with her wealth of imaginative experiences. All the projects use recyclable, reusable, household materials and/or items found in nature.",
        "Category": " Juvenile Nonfiction , Art , General",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "How Do I Love You",
        "Authors": "By Hallinan, P. K.",
        "Description": "Now, for the first time, How Do I Love You? is available in the popular small boardbook format. The lyrical meter and simple rhyme makes this \"love poem\" especially suitable for the toddler age. And the message is simple: Mom or Dad loves the child -no matter what. P.K. Hallinan's delightful cartoon art will bring a smile to children of all ages.",
        "Category": " Juvenile Nonfiction , Family , General",
        "Publisher": "Candy Cane Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Cities without Suburbs (Woodrow Wilson Center Press)",
        "Authors": "By Rusk, David",
        "Description": "",
        "Category": "",
        "Publisher": "Woodrow Wilson Center Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Die, My Love: A True Story of Revenge, Murder, and Two Texas Sisters",
        "Authors": "By Kathryn Casey",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Better Parties, Better Government: A Realistic Program for Campaign Finance Reform",
        "Authors": "By Gora, Joel M. and Wallison, Peter J.",
        "Description": "American Enterprise Institute fellow Wallison, and Gora (Brooklyn Law School), who argued in court against campaign finance reform for the American Civil Liberties Union, suggest that if there is corruption in US election financing, it can be corrected by removing the shackles from the political parties. If the two dominating political parties could raise and spend money at will, they say, the electoral system would be more competitive, the unique role and capabilities of political parties would be strengthened, and any candidate who raised money from any other source would be viewed with suspicion. Annotation ©2009 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Aei Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "What Is Halloween",
        "Authors": "By Wummer, Amy (ILT) and Adams, Michelle Medlock",
        "Description": "Rhyming text describes some of the fun--but not scary--things one can do to celebrate Halloween, like going to autumn festivals or making jack-o-lanterns.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "In Ashes Lie by Marie Brennan (2009) Hardcover",
        "Authors": "By marie-brennan",
        "Description": "",
        "Category": "",
        "Publisher": "Orbit",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Faux Florals for Your Wedding: Fifty Easy and Original Projects",
        "Authors": "By Beveridge, Ardith",
        "Description": "Faux Florals for Your Wedding is the first craft book on the latest bridal trend: accessories and decorations with gorgeous silk flowers.  More and more couples are choosing faux florals because they're easier to craft than fresh, can be made ahead, offer more choices of flowers and colors, can be safely transported far away, won't wilt, are non-allergenic, and later are keepsakes or home decorations. Above all, faux florals have become amazingly realistic. Faux Florals for Your Wedding is the first book about turning those fabulous florals and wedding craft supplies into romantic, personalized wedding designs. The thirty projects, plus abundant variations in colors and styles, include bouquets, boutonnieres, corsages, headpieces, ceremony accents, centerpieces, toasting glasses, and favors. Step-by-step, photographed instructions ensure professional results even for beginners. This complete guide includes the basics of wedding flowers and faux florals as well as a fill-in organizer. With Faux Florals for Your Wedding, the flowers will be as beautiful, original, and lasting as their love. Fifty projects for bouquets, bridal-party accessories, flowers for the ceremony and reception. Easy projects, no experience needed. All other wedding floral books are about fresh flowers.",
        "Category": " Crafts & Hobbies , Flower Arranging",
        "Publisher": "Quarry Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "1812 (The American Story)",
        "Authors": "By Nevin, David",
        "Description": "The war of 1812 would either make America a global power sweeping all the way to the Pacific--or break it into small pieces bound to mighty England. It was a second revolution of sorts to prove to the British that America had to be taken seriously. The principal actors in this drama were James and Dolley Madison, and Andrew and Rachel Jackson. Their courage and determination would shape America's destiny.",
        "Category": " Fiction , Historical",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Paws to Consider: Choosing the Right Dog for You and Your Family",
        "Authors": "By Kilcommons, Brian and Wilson, Sarah",
        "Description": "Two leading pet experts offer a helpful guide to selecting the best dog to suit one's lifestyle and personality, assessing the various breeds and their unique characteristics, describing the medical and behavioral problems typical of each breed, and furnishing tips on finding a compatible canine companion. 40,000 first printing.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Hope for the Morrow (The Enduring Faith Series, Book 4)",
        "Authors": "By Feldhake, Susan C.",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "The Best Game Ever: Giants Vs. Colts, 1958, and the Birth of the Modern NFL",
        "Authors": "By Bowden, Mark",
        "Description": "On December 28, 1958, the New York Giants and Baltimore Colts met under the lights of Yankee Stadium for that season's NFL Championship game. Football, growing in popularity amid America's post-war economic boom, was still greatly overshadowed by the country's favored pastime - baseball - but the 1958 championship proved to be the turning point for pro football. In The Best Game Ever, Mark Bowden delivers a brilliant narrative on the 1958 NFL Championship game, the story behind the key players, and the effect the contest had on the modern game of football and today's NFL.Played on a freezing Sunday evening in front of 64,000 fans and millions of television viewers around the country, the championship would go down as the greatest in football history. On the field and roaming the sidelines were seventeen future Hall of Famers, including Colts stars Johnny Unitas, Raymond Berry, and Gino Marchetti, and Giants greats Frank Gifford, Sam Huff, and assistant coaches Vince Lombardi and Tom Landry. The championship was a battle of the league's best offense - the Colts - versus its best defense - the Giants. It squared the blue-collar Baltimore team, many of whom worked off-season jobs selling liquor or taking shifts at Bethlehem Steel, against the glamour boys of the Giants squad who often appeared in TV commercials and were seen around town at trendy spots like Toots Shor's mingling with the likes of politicians and Broadway stars.An estimated forty-five million viewers - at that time the largest crowd to have ever watched a football game - tuned in to see what would become the first sudden-death contest in NFL history. The Colts led at halftime, 14-3, but a courageous goal-line stand by the Giants in the beginning of the third quarter fueled a second-half comeback. The Giants took a three-point lead in the fourth quarter on a Frank Gifford touchdown. With two minutes left in regulation, Baltimore had possession deep in its own territory, and the ball in the hands of the still unproven quarterback Johnny Unitas.The Best Game Ever is a brilliant portrait of how a single game changed the history of American sports. Published to coincide with the fiftieth anniversary of the championship, it is destined to be a sports classic.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "17.65",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Night Before Christmas Board Book: The Classic Poem",
        "Authors": "By Moore, Clement Clarke and Mills, Donald (ILT)",
        "Description": "Presents the well-known poem about an important Christmas visitor.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Candy Cane Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Story of Chanukah",
        "Authors": "By Levy, Pamela R. (ILT) and Silberg, Francis Barry",
        "Description": "The highlight of this story is how God kept an almost-extinguished flame kindled in the Temple for eight days. The miraculous burning flame is still a reminder to Jews of God's constant protection and love. Rabbi Francis Barry Silberg explains the story of Chanukah on a level even the youngest child can understand, and Pam Levy's illustrations vividly depict the wonder and beauty of this special Jewish holiday.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Hanukkah",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Casper the Caterpillar (Wiggly Eyes)",
        "Authors": "By Hewat, Katie and Dunstan, David (ILT)",
        "Description": "Casper is invited to a costume party but cannot figure out what to wear until he starts asking some of his friends. On board pages.",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "Hinkler Books, distributed by Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "The Vegetarian Grill: 200 Recipes for Inspired Flame-Kissed Meals",
        "Authors": "By Chesman, Andrea",
        "Description": "In 200 terrific recipes, Andrea Chesman issues a tasty invitation to the many vegetarian cooks who have longed to light up a fire, grab a spatula and fork, and take their rightful place by the grill. Chesman serves up hearty veggie burgers and zesty burritos, splendid pizzas and savory main-course salads, all bound to satisfy not only meatless eaters but also nonvegetarians looking for lighter, healthier fare.Along the way, Chesman imparts the wisdom she's gained in years of testing meatless recipes on the grill: about how to start a fire and how to know when it's ready; about the special qualities of a charcoal fire versus a gas fire, and of covered versus uncovered grilling; about what accessory equipment is truly useful, and what is unnecessary; about kinds of produce that take well to the grill, and kinds that do not; and much more.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Harvard Common Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Mad Morgan",
        "Authors": "By Newcomb, Kerry",
        "Description": "A riveting and action-packed novel of the life and times of Henry Morgan, MAD MORGAN is the legendary pirate's story told with swashbuckling romance, derring-do, and an edge as sharp as Spanish steel.Born in the Welsh countryside in 1655, Henry Morgan is captured as a youth by Spanish raiders and carried off to Santiago de Cuba to a life of cruel servitude. Grown to manhood and unbowed by the slaver's whip, Morgan eventually escapes, stealing a prison ship and rescuing a crew of hardened freebooters in the process. With vengeance in his heart, Morgan sets out to harry the Dons. Before long, the turquoise waters of the Spanish Main run red with blood. No Spanish treasure ship or guarded port is safe--he is Captain Henry Morgan, \"El Tigre de Caribe\", the most feared buccaneer alive and an imposing figure of dread throughout the Caribbean.In a rousing adventure that culminates in Morgan's infamous and bloody conquest of the supposedly impregnable Spanish port of Panama City, Mad Morgan unfolds at a breathtaking pace. Rich with stunning detail, violence, passion and revenge this is a pirate tale that will captivate every armchair adventurer until the last, thrilling page is turned.",
        "Category": " Fiction , Historical",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Jordan's Star",
        "Authors": "By Morris, Gilbert",
        "Description": "It is Jordan’s special star--a celestial token of hope for the life and love she dreams of. How brightly will it shine in the night’s darkest hour?A host of stars crowds the desert sky, arching from the east, with its thriving towns, to the western mountains and an unknown future. Bound for the Oregon frontier, Jordan Bryce and her new husband, Colin, a dashing ex-mariner, face danger from both man and nature: a deadly buffalo stampede . . . tragedy at a river crossing . . . hostile Indians . . . and hatred within their wagon train, escalating from bitter words to the point of bloodshed. All that separates the Bryce’s party from disaster is seasoned leadership, the skillful guidance of Ty Sublette, and the hand of God. For Jordan, the journey west is more than a trip into an untamed land. It is a passage from a teenage girl’s romantic fantasies to the wisdom and character of womanhood. But nothing can prepare Jordan for the testing that awaits her beyond the journey’s end. There, in the face of staggering circumstances, she will face an impossible decision . . . as two good men--one wounded by past grief, the other branded by his own impetuousness--struggle with the demands of faith and honor on behalf of the woman they love.",
        "Category": " Fiction , Religious",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Comfort from Beyond",
        "Authors": "By Bence, Evelyn (EDT) and Piper, Don (FRW)",
        "Description": "",
        "Category": " Religion , Christian Life , Death, Grief, Bereavement",
        "Publisher": "Ideals",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Halfway to Forever (Forever Faithful, Book 3)",
        "Authors": "By Kingsbury, Karen",
        "Description": "You wept with them as they were Waiting for MorningYou shared their Moment of WeaknessNow they face the greatest struggles of their lives.Matt and Hannah Bronzan have found a new life in the face of devastating loss.  Together with Hannah’s daughter, Jenny, they are finally moving forward—toward the adoption of a little girl. A younger sister for Jenny, a daughter for them to love and raise together. But just when the dream seems to be coming true, disaster strikes. Can Hannah survive the loss of another daughter?Jade and Tanner Eastman love the Bronzans. Matt and Tanner are partners in a successful religious freedom law firm, and the two couples share a great deal. Not the least of which has been Jade and Tanner’s struggle to have children.  When they discover Jade is pregnant, their joy is boundless. Until the joyous event becomes a threat to Jade’s very life. Will Tanner come through decades of loneliness only to face losing Jade one final time?Caught in a desperate battle against all that threatens to derail their faith and sideline their futures, these four struggle together to depend daily on God, regardless of what comes against them, as they journey halfway to forever.",
        "Category": " Fiction , Religious",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Guerrillas",
        "Authors": "By Naipaul, V.S.",
        "Description": "On a small, troubled Caribbean island, Englishman Peter Roche, onetime South African Resistance hero, and his English mistress become involved with half-breed revolutionary Jimmy Ahmed in an extravaganza of political and sexual violence",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "The Channel Advantage",
        "Authors": "By Friedman, Lawrence G. and Furey, Timothy R.",
        "Description": "'The Channel Advantage' deals with one topic, and deals with it comprehensively and rigorously: how to construct a sales channel system that will yield world-class sales performance and durable competitive advantage. This book helps readers move decisively away from the notion of channel strategy as a sideline to the core business. Building a channel advantage is the core business today, and this is an essential text and reference for all serious marketing and sales professionals and students. Channel innovation is separating market winners from market losers, and not just in leading-edge technology industries. In a business world where industry players are selling practically the same products at essentially the same prices at about the same cost, the only real source of sustainable competitive advantage is the sales channel: how you sell, not what you sell. Selling becomes a question of how to connect products with customers via the best mix of sales channels: the sales force, value-added partners, distributors, retail stores, telemarketing, and the Internet. In short, how companies sell has become as important as what they sell. 'The Channel Advantage' explains how leading companies develop strategies that integrate e-commerce, telemarketing, sales forces, and distributors to achieve superior sales performance and sustainable competitive advantage.Timothy R. Furey is chairman, CEO and co-founder of Oxford Associates, a privately held consulting firm specializing in sales and market strategy, e-commerce channel integration and market research, based in Bethesda, Maryland. Oxford has achieved an annual growth of more than forty percent since its creation in 1991 and was named one of America's 500 fastest growing private companies by Inc. Magazine in 1997. Furey, a pioneer in the use of hybrid sales and marketing strategies for blue chip companies, works extensively with senior management leadership teams to develop and implement go-to-market growth strategies. His clients include IBM, American Express, Marriott, Xerox, Fidelity Investments, Bristol-Myers Squibb, and Johnson & Johnson. Under his leadership, Oxford Associates has developed leading-edge strategies, business processes and systems for deploying and integrating multi-channel sales and marketing systems. They work to align products with the right customers via an appropriate mix of the Internet, telesales, distributors, value-added partners, and traditional sales force channels.Mr. Furey is the co-author of THE CHANNEL ADVANTAGE (Butterworth-Heinemann, August 31, 1999), which is endorsed by the CEOs of America Online, Lotus Development, Ocean Spray, and Xerox. Mr. Furey also serves on the Board of Directors of Alpha Industries (Nasdaq:AHAA), a leading semiconductor manufacturer for wireless telephone applications.Previously, Mr. Furey worked with Boston Consulting Group, Strategic Planning Associates, Kaiser Associates and the Marketing Science Institute. He earned a BA in Economics, cum laude, from Harvard University and an MBA from the Harvard Business School. Lawrence G. Friedman is an internationally recognized channel strategy consultant whose clients have included companies such as Lotus, AT&T, Canon, Compaq Digital Equipment, Microsoft and Bell Atlantic. He also held executive level positions at Andersen Consulting and Huthwaite, Inc., the sales research firm that developed the SPIN Selling Model.In 1996, Friedman, with Neil Rackham and Richard Ruff, co-authored the best-seller, GETTING PARTNERING RIGHT (McGraw-Hill). He is on the review board of the Journal of Selling and Major Account Management, which published his article, Multiple Channel Sales Strategy, in the April, 1999 issue.His firm, The Sales Strategy Institute, works with clients to identify and evaluate new go-to-market opportunities and conducts in-depth channel strategy workshops and seminars. Mr. Friedman is a frequent guest speaker and lecturer on sales and channel strategy throughout the United States, Europe and Asia.Mr. Friedman earned an MA from the University of Chicago.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Butterworth-Heinemann",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "A Woman's Touch",
        "Authors": "By Ansombe, Isabelle",
        "Description": "Examines the lives and work of pioneering women, such as Vanessa Bell, Sonia Delaunay, and Elsie de Wolfe, whose textile tableware, and furniture designs made important contibutions to the industry of interior design",
        "Category": " Art , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Families and How to Survive Them",
        "Authors": "By Skynner, Robin",
        "Description": "",
        "Category": "",
        "Publisher": "Arrow (a Division of Random House Group)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Inheritors",
        "Authors": "By Robbins, Harold",
        "Description": "",
        "Category": "",
        "Publisher": "New English Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "2nd Chance",
        "Authors": "By Patterson, James and Gross, Andrew",
        "Description": "The Women's Murder Club returns for another thrilling crime investigation. Will their skills be enough to take down a brutal madman?A brutal madman sprays bullets into a crowd of children leaving a San Francisco church. Miraculously-or was it intentionally?-only one person dies. Then an elderly black woman is hung. Police homicide inspector Lindsay Boxer senses a connection and together with medical examiner Claire, assistant D. A. Jill, and Chronicle reporter Cindy, finds a link that sends a chill through the entire nation. This killer's motives are unspeakable.In this \"inventive\" installment of the Women's Murder Club, James Patterson proves once again why he is the #1 master of the murder mystery (Sunday Times).",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Raising Respectful Children in a Disrespectful World (Motherhood Club)",
        "Authors": "By Rigby, Jill",
        "Description": "This inspirational parenting guide offers proactive and positive steps to raising respectful, engaged, and grateful children.In an effort to raise children with a healthy view of themselves, parents often focus on self-esteem rather than self-respect. And author Jill Rigby says there’s a big difference. It’s the difference between self-centered and others-centered children, the difference between performance-driven and purpose-focused teenagers. Raising Respectful Children in a Disrespectful World examines three different styles of parenting—parent-centered, child-centered, and character-centered. Parent-centered parents are more concerned with their own agenda than their child’s best interest. Child-centered parents are more concerned with their child’s approval than their child’s well-being. Character-centered parents are more concerned with their child’s character than their child’s comfort. Drawing a distinction between performance and purpose, this book maintains that rather than focusing on what you want your child to do, you ask what you want your child to become. Finally, Rigby calls for parents to discipline (teach) their children rather than punish them. With wisdom and insight, Jill Rigby shares age-appropriate ways to set boundaries with children without building walls of separation. Whether you’re parenting tots or teens, Raising Respectful Children in a Disrespectful World offers valuable advice for cultivating a house of respect.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    }
]