[
    {
        "Title": "Holy Orders",
        "Authors": "By Thorman, Carolyn",
        "Description": "Vida Sedonis' efforts to gain release from the Sisters of Siluva are complicated by threats of excommunication, a death at the halfway house she supervises, and the return of her despicable parents, Ralph and Tillie",
        "Category": "",
        "Publisher": "Longstreet Pr",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Father and Son: Finding Freedom",
        "Authors": "By Wangerin, Walter, Jr. and Wangerin, Matthew",
        "Description": "Given our history, this father and this son might well have gone completely separate ways ... And only in becoming a father did I even begin to understand what it meant, what it was, what would be required of me, and who I was/am within that identity, father.Pastor, author, and father Walter Wangerin Jr., along with his adopted son, Matthew, tell the story of their own lifelong relationship and how they survived times when brokenness and bitterness seemed inevitable. It is the story of Matthew's desperate search for independence and his father's own search for authentic fatherhood.This is a book of deep emotion and serious meditation about broken lives and redemption. Father and Son weaves together each writer's personal story and shows:how earthly fathers and sons are shaped by a Creator's relationship with his creation how within the human experience of parenting we discover insights into the spiritual nature of home, family, and eternity itself As in As for Me and My House, Mourning into Dancing, and Little Lamb, Who Made Thee? Walter Wangerin Jr. develops a series of insights about family, which readers can apply to their own lives. And these insights gain added resonance from the words of Matthew Aaron Wangerin.Together, father and son have written a book that must be experienced as well as read. It's a book parents will want to bring their lives to, not just their attention. Father and Son is the story of all of us, for we are all wayward children in need of a loving, patient father.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Standard of Excellence Book 2 Book Only - Clarinet",
        "Authors": "By Pearson, Bruce",
        "Description": "",
        "Category": " Music , Instruction & Study , General",
        "Publisher": "Kjos Music Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Windows XP Simplified (Visual from Marangraphics)",
        "Authors": "By Maran, Ruth",
        "Description": "This book uses the Visual® approach to cover the new features of Windows XP, including: the new interface, enhanced start menu, the My Pictures digital image organizer, the My Music digital music organizer; and Media Player 8, whichplays video, DVD, and music. A friendly disk character walks the reader through each task in an easy-to-understand, approachable fashion. Step-by-step instructions provide friendly tutorial for readers who are entirely new to the subject",
        "Category": " Computers , Operating Systems , Windows Desktop",
        "Publisher": "Visual",
        "Price Starting With ($)": "5.81",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Brown Bear Brown Bear What Do You See?",
        "Authors": "By Bill Martin Jr",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Holt and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Plays By Moliere (Modern Library)",
        "Authors": "By Moliere",
        "Description": "",
        "Category": "",
        "Publisher": "The Modern Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Nine Keys to Effective Small Group Leadership: How Lay Leaders Can Establish Dynamic and Healthy Cells, Classes, or Teams",
        "Authors": "By George, Carl F., Bird, Warren, and Coleman, Robert Emerson (FRW)",
        "Description": "",
        "Category": " Religion , Leadership",
        "Publisher": "Kingdom Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Moonface: A True Romance",
        "Authors": "By Balcita, Angela",
        "Description": "“Angela Balcita's love story takes a couple of artsy wanderers off the road and into the bright, scary world of transplants, dialysis, and neonatal intensive care.” —Marion Winik, author of The Glen Rock Book of the DeadFrom the pages of the New York Times’ Modern Love column comes one woman’s moving and uproarious story of how love and laughter rescued her from life-threatening illness. Angela Balcita’s cathartic memoir of finding love while wrestling with kidney failure will strike a chord with anyone yearning for a poignant, true-to-life romance…with a real fairy tale ending.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "The Peanut Allergy Answer Book",
        "Authors": "By Young, Michael C.",
        "Description": "A revised and updated version of the definitive peanut allergy book.Since the publication of The Peanut Allergy Answer Book in May 2001, there has been much additional research published in the field of peanut allergy and anaphylaxis in medical literature. This research includes new diagnostic tests, new vaccines and therapies, and new information on the history of peanut allergy. In addition, there has also been a great increase in public awareness of the societal impact of peanut allergy, such as in schools and other child-care facilities, in restaurants, and in the food and restaurant industry. This attention has led to the publication of guidelines for schools in the management of food allergies and anaphylaxis, to legislation such as the Food Allergen Labeling Consumer Protection Act of 2006, and proposed legislation for restaurant guidelines for food-allergic consumers. The incidence of peanut allergy has doubled in the past five years and continues to increase so the impact of this medical problem, particularly in young children, is enormous.The Peanut Allergy Answer Book, 2nd Edition, contains 50% of new and revised material, including a new foreword and introduction, as well as new chapters such as, \"Why has peanut allergy increased so much in the past 5-10 years?”; “What is the difference between being peanut-sensitive and peanut-allergic?”; “What is the Hygiene Hypothesis?”; and “Can skin contact cause an anaphylactic reaction?”",
        "Category": " Health & Fitness , Allergies",
        "Publisher": "Fair Winds Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Circuit Hikes: In Virginia, West Virginia, Maryland, and Pennsylvania",
        "Authors": "By",
        "Description": "",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Appalachian Trail Conference",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Touched By Love",
        "Authors": "By Garrett, Tracy",
        "Description": "A Texas Promise. . . Texas, 1847. Jaret Walker is a loner, a gun for hire with a heart of ice. He's never had anyone to call his own, and he likes it that way. But when a promise made to a friend leads him on a ride through the desert and to remote Two Roses Ranch where he meets Isabel Bennett, the woman he's supposed to protect, all he can think of is making her his. She's the kind of woman a rough-riding cowboy like him can never have. But her hot gaze tempts him like no other woman has before. . .A Scorching Desire. . . The moment Isabel Bennett lays eyes on Jaret Walker, she remembers the dreams she's denied for so long. She's sworn never to marry. It's the only way to protect her ranch. But when Walker rides into her life, she decides to let herself taste what she's giving up--a passion that burns through her with each kiss--and a desire that won't be denied. . .Praise for Touch of Texas. . . \"Suspenseful, heart-warming, and. . .unforgettable.\" --New York Times bestselling author Lorraine Heath\"Well-written, entertaining Western. A tender story about two people who find out that belonging to each other is all they need.\" --Romantic Times, 4 star reviewTracy Garrett is a Western history buff and an accomplished musician who performs and also conducts a youth choir. She and her husband live near Dallas, Texas.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "French for Mrs. Katz: All the French a Jewish Mother Could Possibly Need",
        "Authors": "By Sequoia, Anna, Sarezky, Louise, and Oxborough, Paul",
        "Description": "Takes familiar Jewish sayings such as \"Caviar schmaviar, I like a nice piece of lox\" and translates them into French to give the classic kvetch a little touch of savoir faire.",
        "Category": " Humor , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "7.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Kingdom of Childhood",
        "Authors": "By Coleman, Rebecca",
        "Description": "The Kingdom of Childhood is the story of a boy and a woman: sixteen-year-old Zach Patterson, uprooted and struggling to reconcile his knowledge of his mother&#39;s extramarital affair, and Judy McFarland, a kindergarten teacher watching her family unravel before her eyes. Thrown together to organize a fundraiser for their failing private school and bonded by loneliness, they begin an affair that at first thrills, then corrupts each of them. Judy sees in Zach the elements of a young man she loved as a child, but what Zach does not realize is that their relationship is&#151;for Judy&#151;only the latest in a lifetime of disturbing secrets.Rebecca Coleman&#39;s manuscript for The Kingdom of Childhood was a semifinalist in the 2010 Amazon Breakthrough Novel Competition. An emotionally tense, increasingly chilling work of fiction set in the controversial Waldorf school community, it is equal parts enchanting and unsettling and is sure to be a much-discussed and much-debated novel.",
        "Category": " Fiction , Literary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "I Corinthians (Anchor Bible)",
        "Authors": "By Walther, James Arthur (EDT) and Orr, William F. (EDT)",
        "Description": "",
        "Category": " Religion , Biblical Commentary , New Testament",
        "Publisher": "Anchor Bible",
        "Price Starting With ($)": "11.05",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "Sunny Days & Starry Nights: A Little Hands Nature Book (A Williamson Little Hands Book ; 1)",
        "Authors": "By Braren, Loretta Trezzo (ILT) and Fusco Castaldo, Nancy",
        "Description": "Explores the outdoors and teaches about a variety of plants and animals with over sixty suggested activities.",
        "Category": " Education , General",
        "Publisher": "Williamson Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Intersections: Faith: Confidence and Doubt in Daily Life (Intersections (Augsburg))",
        "Authors": "By Marty, Martin E.",
        "Description": "",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Augsburg Fortress Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Great Ancestor Hunt: The Fun of Finding Out Who You Are (Clarion Nonfiction)",
        "Authors": "By Perl, Lila",
        "Description": "A guide for tracing one's ancestors via various means. An appendix describes how to use a number of available government resources",
        "Category": " Juvenile Nonfiction , Family , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Business Masterminds: Tom Peters",
        "Authors": "By Heller, Robert",
        "Description": "Presents the ideas of Tom Peters, a leading advocate of management by \"perceptual revolution,\" showing businesses how to survive and thrive in an upside-down world. Masterclasses of tips, checklists, and ideas on practical implementation show how managers can use Peters' ideas. Includes color photos and a glossary. Heller is founding editor of  Management Today  magazine and has written extensively on management. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Entrepreneurship",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Lemonade Mouth: Adapted Movie Tie-In Edition",
        "Authors": "By Hughes, Mark Peter",
        "Description": "Poets. Geniuses. Revolutionaries.The members of the legendary band Lemonade Mouth have been called all of these things. But until now, nobody's known the inside story of how this powerhouse band came to be. How five outcasts in Opoquonsett High School's freshman class found each other, found the music, and went on to change both rock and roll and high school as we know it. Wen, Stella, Charlie, Olivia, and Mo take us back to that fateful detention where a dentist's jingle, a teacher's coughing fit, and a beat-up ukelele gave birth to Rhode Island's most influential band. Told in each of their five voices and compiled by Opoquonsett's \"scene queen,\" freshman Naomi Fishmeier, this anthology is their definitive history.From the Hardcover edition.",
        "Category": " Young Adult Fiction , Performing Arts , Music",
        "Publisher": "Ember",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Accents on Accessories: Ideas and Inspirations from Southern Accents",
        "Authors": "By Irons, Karen Phillips (EDT)",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Paper Fun for Kids (Step-By-Step)",
        "Authors": "By Elliot, Marion",
        "Description": "Introduces paper types and techniques for working with paper, from folding and cutting to stencilling and rubber stamp printing, and provides directions for making a variety of projects.",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Keeping Your Family Strong In a World Gone Wrong",
        "Authors": "By Leman, Kevin",
        "Description": "In his entertaining yet authoritative style, best-selling author and psychologist Kevin Leman shares his “Reality Rule of Relationships,” providing advice and step-by-step guidance for strengthening your family. Discover keys to family relationships in this book packed with enlightening real-life examples and solutions to tough family problems.Inside you'll find the ten biggest needs of husbands and wives—and how to fill them—the best approach to child discipline, techniques for avoiding infidelity and revitalizing your love life, advice for the two-career family, tips for becoming your teenager's best friend, and the biggest danger for the single mom—and how to fight it. This is a repackage and update of Keeping Your Family Together When the World Is Falling Apart.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Living Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Princess Diaries, Volume IV: Princess in Waiting",
        "Authors": "By Cabot, Meg",
        "Description": "The fourth book in the #1 New York Times bestselling Princess Diaries series by Meg Cabot.Never before has the world seen such a princess. Nor have her own subjects, for that matter. But Genovian politics are nothing next to Mia's real troubles.Between canceled dates with her long-sought-after royal consort, a second semester of the dreaded Algebra, more princess lessons from Grandmère, and the inability to stop gnawing on her fingernails, isn't there anything Mia is good at besides inheriting an unwanted royal title?Princess in Waiting is the fourth book in the beloved, bestselling series that inspired the feature film starring Anne Hathaway and Julie Andrews. Beautifully repackaged in paperback, this title will appeal to new readers as well as fans looking to update their collection.",
        "Category": " Young Adult Fiction , Family , Multigenerational",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Lessons From the Edge: For-Profit and Nontraditional Higher Education in America",
        "Authors": "By Berg, Gary",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The New Family Home: Creating the Perfect Home for Today and Tomorrow",
        "Authors": "By Tolpin, Jim and Lathrop, Mary",
        "Description": "Imagine a home designed for the family that lives in it. Author Jim Tolpin features 24 of them in The New Family Home, an innovative and inspiring look at the changing family home in America. The New Family Home takes readers on a tour of homes that meet the unique needs of families of all kinds. From flexible floor plans for blended families, to houses with a heightened sense of style for empty-nesters, this book calls to mind the essential bond between a family and the place it calls home.-- A diverse look at a wide variety of family homes.-- Includes floor plans, color illustrations, and more than 200 photographs.-- Cloth edition has sold more than 40,000 copies since publication.",
        "Category": " House & Home , House Plans",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "199 Power Prayers For The New Year (VALUE BOOKS)",
        "Authors": "By McQuade, Pamela",
        "Description": "Want a fresh perspective on prayer? Ready to revitalize your prayer life? Power Prayers for the New Year gives you solid biblical reasons to pray-and specific prayer starters for 10 key areas of life. Inside, you'll find \"power prayers\" for your relationships, job, church, family, and future. Quick and easy to read, yet packed with spiritual punch, Power Prayers for the New Year is what you need to succeed in this vital profession. Put the power in your prayers",
        "Category": " Religion , Prayerbooks , Christian",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "First Place Member's Guide: A Life-Changing Program with Biblical Integrity",
        "Authors": "By Beth Moore",
        "Description": "",
        "Category": "",
        "Publisher": "Regal Books, R.G. Mitchell Family Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Girl Most Likely To (Red Dress Ink Novels)",
        "Authors": "By Poonam, Sharma",
        "Description": "With meticulous career planning and a couple of dirty martinis, there is very little that New York City investment banker Vina Chopra can't do. And now that sh's decided to get serious about if nding her mate, there is very little that Vina won't try&#151;even if it means letting her parents get involved. After all, what does she have to lose? Her longest-term relationship thus far has been with the ulcer she ultimately named Fred (unless you count the ex-boyfriend who won't go away).Amid a series of dates with 'the nice Indian doctor' and an office scandal that could permanently end her career, Vina starts to question everything sh's been working for. Who has she been trying to please all these years? Is this the life that she really wants? Can she if nally learn to put aside her family's expectations long enough and become the girl most likely to if nd a happiness all her own?",
        "Category": " Fiction , Women",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Light of Day: A Novel",
        "Authors": "By Swift, Graham",
        "Description": "On the anniversary of a life-shattering event, George Webb, a former policeman turned private detective, revisits the catastrophes of his past and reaffirms the extraordinary direction of his future. Two years before, an assignment to follow a strayed husband and his mistress appeared simple enough, but this routine job left George a transformed man.Suspenseful, moving, and hailed by critics as a detective story unlike any other, The Light of Day is a gripping tale of murder and redemption, as well as a bold exploration of love and self-discovery. This powerful novel signals yet another groundbreaking achievement from Graham Swift, the author of the Booker Prize-winning novel Last Orders.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "People Chase Twisters/Other (I Didn't Know That)",
        "Authors": "By Petty, Kate, Moore, Jo (ILT), and Roberts, Peter (ILT)",
        "Description": "Provides information about violent weather phenomena such as thunderstorms, lightning, blizzards, monsoons, and sandstorms.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , General",
        "Publisher": "Copper Beech",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Interpersonal Conflict Resolution (Management Applications Series)",
        "Authors": "By Filley, Alan C.",
        "Description": "Explains the principles and applications of problem-solving methods for handling conflict situations and reducing hostility. Bibliogs",
        "Category": " Social Science , General",
        "Publisher": "Scott Foresman & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1975"
        }
    },
    {
        "Title": "Sixkill (Spenser Mystery)",
        "Authors": "By Parker, Robert B.",
        "Description": "On location in Boston, bad-boy actor Jumbo Nelson is accused of the rape and murder of a young woman. From the start the case seems fishy, so the Boston PD calls on Spenser to investigate. Things don't look so good for Jumbo, whose appetites for food, booze, and sex are as outsized as his name. He was the studio's biggest star, but he's become its biggest liability.In the course of the investigation, Spenser encounters Jumbo's bodyguard: a young, former football-playing Native American named Zebulon Sixkill. He acts tough, but Spenser sees something more within the young man. Despite the odd circumstances, the two forge an unlikely alliance, with Spenser serving as mentor for Sixkill. As the case grows darker and secrets about both Jumbo and the dead woman come to light, it's Spenser-with Sixkill at his side-who must put things right.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Five Skies",
        "Authors": "By Carlson, Ron",
        "Description": "Award-winning short story writer Ron Carlson delivers a stirring novel about three men confronting their pasts and their purpose  Beloved story writer Ron Carlson's first novel in thirty years, Five Skies is the story of three men gathered high in the Rocky Mountains for a construction project that is to last the summer. Having participated in a spectacular betrayal in Los Angeles, the giant, silent Arthur Key drifts into work as a carpenter in southern Idaho. Here he is hired, along with the shiftless and charming Ronnie Panelli, to build a stunt ramp beside a cavernous void. The two will be led by Darwin Gallegos, the foreman of the local ranch who is filled with a primeval rage at God, at man, at life. As they endeavor upon this simple, grand project, the three reveal themselves in cautiously resonant, profound ways. And in a voice of striking intimacy and grace, Carlson's novel reveals itself as a story of biblical, almost spiritual force. A bellwether return from one of our greatest craftsmen, Five Skies is sure to be one of the most praised and cherished novels of the year.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Story of God [Holy Bible]: New International Version (NIV) 927",
        "Authors": "By Biblica",
        "Description": "",
        "Category": "",
        "Publisher": "Biblica Direct",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Phineas and Ferb Laughapalooza Joke Book",
        "Authors": "By Richards, Kitty",
        "Description": "What is Ferb’s favorite month of the year? Ferb-uary, of course!Join stepbrothers Phineas and Ferb, their older sister, Candace, Perry the Platypus (Agent P), the evil Dr. Doofenshmirtz, and the rest of the hilarious gang as they tickle your funny bone with laugh-out-loud jokes and riddles!",
        "Category": " Juvenile Nonfiction , Humor , Jokes & Riddles",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Jesus Lives! Come and See!",
        "Authors": "By Tim Wesemann",
        "Description": "",
        "Category": "",
        "Publisher": "CTA Inc.",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Webster's Spanish-English Dictionary for Students (English and Spanish Edition)",
        "Authors": "By Merriam-Webster (EDT)",
        "Description": "This value-priced Spanish-English, with over 50,000 translations is the best bilingual reference for students. Features of this Book •Over 40,000 entries and 50,000 translations •Spanish-to-English and English-to-Spanish sections •Conjugation of Spanish Verbs •Irregular English Verbs •Value-priced or budget-conscious parents and teachers",
        "Category": " Juvenile Nonfiction , Foreign Language Study , Spanish",
        "Publisher": "Federal Street Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Hannah Montana: Awesome Adventures",
        "Authors": "By Kim Friese",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Children's Books",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Race-Class Relations and Integration in Secondary Education: The Case of Miller High (Secondary Education in a Changing World)",
        "Authors": "By Eick, Caroline",
        "Description": "This history traces evolving cross-group relationships in a comprehensive high school located in a town that shifted from a rural, predominantly white middle-class population to a more urban, multiracial population between 1950 and 2000. Oral historical, archival, and demographic research revealed the ways in which institutional norms, shifting demographics, and students’ diverse backgrounds intersected to shape peer relationships across racial, gender, and class divides.",
        "Category": " Education , Philosophy, Theory & Social Aspects",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Women : Maxim's Unauthorized Guide",
        "Authors": "By Maxim, editors of",
        "Description": "",
        "Category": "",
        "Publisher": "Maxim Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Technical Virgin: How Far is Too Far?",
        "Authors": "By Dimarco, Hayley",
        "Description": "Every teenage girl craves male attention. But how does she know when and where to draw the line? What if she's already stepped over that line? And how can she find her way back? In a culture where hookups and friends-with-benefits are commonplace, how far is too far when it comes to the physical?The technical virgin, a term becoming all too familiar with Christian teens, is someone who believes in abstinence but allows loopholes in their physical relationships, thereby compromising true purity. In this new book, Hayley DiMarco takes a look at what purity really is. With her straightforward, in-your-face writing, she shows girls- what they are really saying about themselves through their sexy actions - what happens when purity is reduced to a technicality - what words like abstinence and commitment really mean - what God says on the subject of purity  With candid advice, personal insight, and tough truth from God's Word, Hayley DiMarco will help teen girls understand who they are so they can make informed, godly decisions about purity and sex.",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Stop Self-Sabotage!",
        "Authors": "By Pearson, Pat",
        "Description": "",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Connemara Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "French Women Don't Sleep Alone",
        "Authors": "By Callan, Jamie Cat",
        "Description": "Did you know that French women don't date?   American  women have been missing out on a few secrets when it comes to the  opposite sex. French women believe that the gift for attracting men has  nothing to do with beauty, work, or even motivation. There are no Rules.  And they don't listen to Dr. Phil's advice. They don't worry about the  care and feeding of their boyfriend. And they certainly don't travel to  Mars to communicate with men. On the contrary, French women's love lives  are romantic, sensual, playful, and intense. They conduct their  relationships with the same unique sense of originality and artfulness  that they choose their clothes and accessories. For the first time ever,  Jamie Cat Callan gives readers a personalized, guided tour through the  corridors of French love.    Discover the secrets to:     • Why French women always feel sexy   • The French art of flirtation   • Why French women walk everywhere and love to be seen   • Where French women meet men   • What French women do when their man misbehaves   Just as we've learned to stop torturing ourselves with fad diets and  have relearned the art of eating, this witty, insightful, and candid  book strives to show American women how to cultivate and enjoy the  pleasures of love, romance, and marriage.   Includes delicious recipes for the perfect, amorous meal!   \"Adorable!\"  --Erica Jong, New York Times bestselling author of Fear of Flying and Fear of Fifty\"Attention  single ladies: here's a new way to meet men and drive them  wild! Jamie  Cat Callan reveals sexy French secrets for upping your  confidence and  attracting potential mates. Your inner goddess will  rejoice--and so  will your new boyfriend! Ooh la la!\" --Bonnie Fuller, former CEO of  American Media, former editor-in-chief of Star Magazine, and author of The Joys of Much Too Much: Go for the Big Life--The Great Career, The Perfect Guy, and Everything Else You've Ever Wanted  \"No matter where you were born, every woman can now be a little bit French, thanks to this delightful book, French Women Don't Sleep Alone. Jamie Cat Callan helps women to look at their love lives and marriages  with new eyes; love and marriage are not jobs but arts.\" --Nahid  Rachlin, author of Persian Girls \"Entertaining and informative!\"  --Helena Firth Powell, author of All You Need To Be Impossibly French",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "Citadel Press",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Diabetic Desserts (Favorite BrandName Recipes)",
        "Authors": "By Weber, Louis",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Diabetic Cooking for One or Two",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Dynamic Path: Access the Secrets of Champions to Achieve Greatness Through Mental Toughness, Inspired Leadership and Personal Transformation",
        "Authors": "By Citrin, James M.",
        "Description": "The best-selling business leader offers a fresh and compelling path to success based on extensive research and candid interviews with some of the greatest winners of our time In James Citrin's new paradigm-shifting book, he identifies the essential characteristics and disciplines that have led many of our outstanding athletes and other extraordinary performers to achieve equally significant accomplishments in their respective business careers. Citrin uses dozens of compelling interviews with personalities as varied and impressive as Colin Powell, Tony Hawk, Billie Jean King, Magic Johnson, Mia Hamm, and Buzz Aldrin, to name a few, to illustrate a new personal achievement program called the Dynamic Path—a plan that any businessperson can put to immediate use. Citrin identifies three stages on this path to greatness:• the Champion—combine the work ethic of Tiger Woods with self-confidence and mental toughness to reach the top• the Great Leader—follow Bob Iger's revitalization of Disney as one of our best brands• the Legacy—learn the ultimate lesson in good and lasting work from Lance ArmstrongWith inspiring anecdotes, real-world business examples, and his trademark penetrating insight into what it takes to get ahead, Citrin once again provides a clear and concise roadmap for personal excellence.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Alone with God (The women's devotional series)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Review and Herald",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Galactic Issue #1: Cosmic Cake: Atomic Comics (Atomic Betty)",
        "Authors": "By Figueroa, Acton",
        "Description": "During his birthday bash, Maximus I.Q. serves a giant birthday cake with mind-altering icing that will bring the people at his party under his control forever unless Atomic Betty can arrive in time to save the universe. Kids.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Dalai Lama, My Son: A Mother's Autobiography",
        "Authors": "By Tsering, Diki and Thondup, Khedroob (EDT)",
        "Description": "The story of the Dalai Lama's mother describes in her own words her feelings about her son being recognized as a living Buddha, her childhood in turn-of-the-century Tibet, her witness to the Chinese invasion, and her observations during her son's formative years. 50,000 first printing.",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Simple As 1 2 3 Holiday",
        "Authors": "By Editors of Publications International",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Legions Now Quiet, The Civil War Novel",
        "Authors": "By Case, Manson Drew",
        "Description": "",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "iUniverse",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Little Miss Bossy (Mr. Men and Little Miss)",
        "Authors": "By Hargreaves, Roger",
        "Description": "Little Miss Bossy tells everyone what to do-until Wilfred the Wizard casts a spell on her.Back to the Mr. Men & Little Miss microsite.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Phineas and Ferb #3: Wild Surprise (Phineas and Ferb Chapter Book, 3)",
        "Authors": "By Mayer, Helena (ADP)",
        "Description": "Series description:Phineas and Ferb know that with only one hundred and four days of summer vacation, you've got to make every one count! Whether they're building a rocket or discovering an ancient mummy, they're dedicated to making each mind-numbing rotation of the earth into something really special. While their sister Candace tries fruitlessly to reveal their crazy endeavors to their mom and Perry the Platypus is saving the world from the dangerous Dr. Doofenshmirtz, Phineas and Ferb are filling their days with one adventure after another.Chapter Book #3: Wild SurpriseWhat better time to be creative than a birthday? With gifts at stake, Phineas and Ferb are at their best. First they surprise Candace by adding her head to Mt. Rushmore, and then they cook up an even BIGGER surprise for their mom's birthday. With all these good intentions, what could possibly go wrong? Meanwhile, Dr. Doofenshmirtz has created a machine that will shrink everything he dislikes. Will this mean the end for Perry the Platypus?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Chronicles of Grace: [Psalm 102:18]",
        "Authors": "By Ebersole, Grace Wenger",
        "Description": "",
        "Category": "",
        "Publisher": "G.W. Ebersole",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Little Miss Sunshine (Mr. Men and Little Miss)",
        "Authors": "By Hargreaves, Roger",
        "Description": "They're back!  Rediscover the zaniest characters you've ever met in this best-selling series which has sold millions worldwide.  Bright and charming, with easily recognizable characters and a small take-along format,  Mr. Men and Little Miss  books are easy enough for young readers, witty enough for humor-prone adults, and highly collectible for one and all. Also check your local listings to view the Mr. Men & Little Miss TV show.Back to the Mr. Men & Little Miss microsite.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Little Miss Fun (Mr. Men and Little Miss)",
        "Authors": "By Hargreaves, Roger",
        "Description": "Little Miss Fun does not let anything stop her from having fun at her party, even when Mr. Clumsy steps on her feet, Mr. Forgetful forgets to come, and the guests fall asleep just as she is about to play a clown.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "How Many Kisses Do You Want Tonight?",
        "Authors": "By Bates, Ivan (ILT) and Bajaj, Varsha",
        "Description": "\"How many kisses do you want tonight?\" the animals ask, snuggling critters tight. This adorable counting bedtime book celebrates the special ritual of goodnight kisses. Children and baby animals request from one to a million kisses from their parents when they settle in for the night. The simple, rhyming text makes for a perfect read aloud.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Babymouse #6: Camp Babymouse",
        "Authors": "By Holm, Jennifer L. and Holm, Matthew",
        "Description": "NEW YORK TIMES bestselling and Newbery Honor winning author Jennifer Holm teams up with Matthew Holm to bring you a fully illustrated graphic novel series packed with humor and kid appeal—BABYMOUSE!    With multiple Children's Choice awards and over 1.7 million books in print, kids, parents, and teachers agree that Babymouse is perfect for fans of Junie B. Jones, Ivy and Bean, Big Nate, Dork Diaries, and the Ramona chapter books!Welcome to Camp Babymouse! Two weeks of fresh air, fun, and friendship! Babymouse  can't wait for the adventures to start. All that she has to do is relax and make  sure she doesn't get lost in the wilderness. What could possibly go wrong, right  Babymouse? Uh . . . Babymouse?  BABYMOUSE? Uh-oh! Will camp be all that Babymouse  dreams of? Or is our brave and fearless camper lost forever?! Find out in Camp Babymouse—the 6th hilarious, action-packed installment of the beloved Babymouse graphic novel series!Here's what people are saying about Babymouse! The  Chicago Sun-Times: \"Move over, Superman, here comes  Babymouse!\" Starred Review, The Horn  Book: \"Nobody puts Babymouse in the corner!\" Booklist: \"Cute, smart, sassy Babymouse is fun and funny, and this book, like its  predecessors, will draw reluctant readers as well as Babymouse fans.\"The Bulletin: \"An almost absurdly likeable  heroine.\"",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Nobodies Album: A Novel",
        "Authors": "By Parkhurst, Carolyn",
        "Description": "From the bestselling author of The Dogs of Babel comes a dazzling literary mystery about the lengths to which some people will go to rewrite their past. Bestselling novelist Octavia Frost has just completed her latest book—a revolutionary novel in which she has rewritten the last chapters of all her previous books, removing clues about her personal life concealed within, especially a horrific tragedy that befell her family years ago. On her way to deliver the manuscript to her editor, Octavia reads a news crawl in Times Square and learns that her rock-star son, Milo, has been arrested for murder. Though she and Milo haven’t spoken in years—an estrangement stemming from that tragic day—she drops everything to go to him. The “last chapters” of Octavia’s novel are layered throughout The Nobodies  Album—the scattered puzzle pieces to her and Milo’s dark and troubled past. Did she drive her son to murder? Did Milo murder anyone at all? And what exactly happened all those years ago? As the novel builds to a stunning reveal, Octavia must consider how this story will come to a close. Universally praised for her candid explorations of the human psyche, Parkhurst delivers an emotionally gripping and resonant mystery about a mother and her son, and about the possibility that one can never truly know another person.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Water-resources engineering (McGraw-Hill series in water resources and environmental engineering)",
        "Authors": "By Linsley, Ray K.",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Spider-Man: Spider-Man versus Electro (I Can Read, Reading with Help, Level 2)",
        "Authors": "By Hill, Susan",
        "Description": "Spider-Man is in for a shock! Electro plans to steal the city's power supply, and he won't let anything get in his way. Can Spider-Man save the day before it's too late?",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "After the Hangover: The Conservatives' Road to Recovery",
        "Authors": "By Tyrrell, R. Emmett, Jr.",
        "Description": "Looking for real hope and change?The man Hardball host Chris Matthews calls “the legendary R. Emmett Tyrrell Jr.” has done it again. Tyrrell, author of such tours de force as New York Times bestseller Boy Clinton: The Political Biography, The Liberal Crack-Up, and The Conservative Crack-Up, serves up an insightful and delightful exploration of the past, present, and future of American conservatism, or what he terms, “America’s longest dying political philosophy.” And its future is bright.Tyrrell begins with a sparkling distillation of conservative theory and history, complete with personal anecdotes from his decades in the movement, inspired by its luminaries, bored by its dim bulbs. He explains the nature of the conservative temperament—its “political libido”—and how it plays out in today’s curious political culture; examines the vital role of a true “political culture” and solidarity in opposing the left and then offers a comprehensive agenda for the future of the movement that every political player on both the right and the left will have to read to grapple with in 2010 and 2012.Tyrrell also considers American Liberalism—its excesses, quirks, and near suicidal instinct. Far from offering mere indictment, however, Tyrrell also delivers a unique perspective on Liberalism’s strengths, such as its intramural ecumenism and rare ability to rally around shared causes, explaining how conservatives could learn and profit from the example.It goes without saying that through it all Tyrrell’s famous humor crackles and lifts the spirit. Conservatives looking for perspective on the current scene, a richer understanding of their shared past, and hope for the future will find After the Hangover as refreshing as it is restorative. PREVIOUS ACCLAIM“The legendary R. Emmett Tyrrell Jr.” ?CHRIS MATTHEWS“No columnist, no author, has had a greater influence upon the course of American political history over the past decade than that ribald contrarian, R. Emmett Tyrrell Jr. Even the slain giants die laughing.” ?TOM WOLFE“Washington would not be the same without Bob Tyrrell and neither would the American conservative movement. While dilettantes come and go, the relentless and irrepressible Tyrrell is forever.” ?DAILY TELEGRAPH (LONDON)“Tyrrell is the master of a particular form—taking broken shards of silliness, deviance, hypocrisy, crime, and treason, shaping them into Erasmian examples of human folly, and doing so with style and flow.” ?ARAM BAKSHIAN“Tyrrell alerts us to the dangers our political system faces . . . and he does it with the insight, wit, and style that mark him as a great American writer.” ?BOB BARR“R. Emmett Tyrrell Jr. has written a stimulating book which should cause many Americans to rethink positions they have taken in the debates of the past decade.” ?HENRY KISSINGER“For a man I disagree with as much as Emmett Tyrrell . . . I must say that I enjoyed the sheer hell out of his book.” ?NORMAN MAILER",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Fish: The Complete Guide to Buying and Cooking",
        "Authors": "By Bittman, Mark and Gottlieb, Dennis M. (PHT)",
        "Description": "Fish: The Complete Guide to Buying and Cooking is a book that simplifies, once and for all, the process of preparing fish. Organized in an easy-reference, A-Z format, Fish gives you the culinary lowdown on seventy kinds of fish and shellfish commonly found in American supermarkets and fish stores. Each entry describes how the fish is sold (fillets, steaks, whole, salted), other names it goes by, how the fish should look, and buying tips. Fish begins with general guidelines on how to store, prepare, and cook fish, whether sauteing, frying, grilling, or smoking, and you will find easy-to-follow illustrations of such important basics as how to gut and fillet a fish. Fish also includes up-to-the-minute information on the health benefits of fish in our diet. In addition, there are more than five hundred recipes and variations, all of which use low-fat, high-flavor ingredients to accent the intrinsic natures of the individual fish rather than mask them. And the vast majority of the recipes are ready in less than thirty minutes.",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Visionaries In Our Midst: Ordinary People who are Changing our World",
        "Authors": "By Silberberg, Allison",
        "Description": "Visionaries In Our Midst is Allison Silberberg's inspiring collection of essays that profiles ordinary people who are changing our world. Silberberg shares the stories of individuals who identified critical needs in their communities and responded with courage and conviction. This is a book about those who inspire hope, those who struggle, and those who make something happen. This is a book about catalysts—those who innovate and work to build a better life for others. This is a time to discover what is possible when individuals stand up for one another. Visionaries In Our Midst is a thought-provoking book that takes the reader on an unforgettable journey.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "University Press Of America",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "A Handful Of Thumbs And Two Left Feet: Sam Venable'S Best Outdoor Stories",
        "Authors": "By Venable, Sam",
        "Description": "Despite his alleged inability to enjoy a meaningful relationship with Mother Nature, Sam Venable is, indeed, an outdoor enthusiast. He is at home in trout streams and duck blinds, bass boats and deer stands. He has traveled from Alaska to the Bahamas, but he is most comfortable in the fields and forests of his native East Tennessee. This collection of some of his best outdoor columns from the Knoxville News-Sentinel includes stories in Sam’s unique style about fishing, hunting, and just enjoying the outdoors.",
        "Category": "",
        "Publisher": "UT Knoxville News Sentinel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "One Grave at a Time",
        "Authors": "By Frost, Jeaniene",
        "Description": "Praise for Jeaniene Frost:“Put Jeaniene Frost on your must-read list!”—Lara Adrian “A gutsy heroine to cheer for and a smoldering hero to die for.”—Kresley ColeReaders can’t get enough of Cat Crawfield and her sexy vampire husband Bones—especially the fans of high quality paranormal fiction who have made the novels of Charlaine Harris, Kim Harrison, Lynsay Sands, and Christine Feehan blockbuster bestsellers. With One Grave at a Time, New York Times bestselling author Jeaniene Frost gives us another spectacular supernatural adventure in her Night Huntress series—as Cat and Bones, after narrowly averting an (under)World War, must figure out how to halt the horrific killing spree of a bloodthirsty witch hunter…a sadistic killer who has already been dead for centuries.",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "XML by Example (By Example)",
        "Authors": "By Marchal, Benoit",
        "Description": "A guide for beginning- through intermediate-level users explains how to use XML to create and customize Web pages, organize Web documents, build flexible 3-tier applications, and explore the Web's new architecture",
        "Category": " Computers , Programming Languages , HTML",
        "Publisher": "Que",
        "Price Starting With ($)": "6.16",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Adobe Illustrator 10-Design Professional",
        "Authors": "By Botello, Chris",
        "Description": "Part of the Design Professional Series, this text offers coverage of basic through more advanced features of Adobe Illustrator 10 including everything from drawing and composing an illustration to preparing these illustrations for print production.",
        "Category": " Computers , Interactive & Multimedia",
        "Publisher": "Course Technology",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Salem Witch Tryouts",
        "Authors": "By McClymer, Kelly",
        "Description": "Prudence Stewart had it all at Beverly Hills High: straight A's, the cutest crush, and a sweet gig as captain of the cheerleading squad. Then poof! Mom and Dad announce they're moving to Salem, Massachusetts. Turns out, Pru comes from a long line of witches and it's time for her to learn the craft. Buh-bye, Beverly Hills High -- hello, Agatha's Day School!   But Pru's not about to trade in her spirit stick for a broomstick! She's sure she can keep her kewl at her new school -- until she discovers it's all magic, all the time, and she's failing Witchcraft 101. Worst of all, even the cheerleaders bring a special \"spirit\" to their routine. As in, triple-back-somersault-with-a-twist kind of spirit.   It's time for Pru to cast a spell and prove she's just as enchanting as the next girl -- and somehow make cheering tryouts a flying S-U-C-C-E-S-S!",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Gift Of Flowers",
        "Authors": "By Ethel R. Buc",
        "Description": "",
        "Category": "",
        "Publisher": "Alorna Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "My Brother, My Keeper",
        "Authors": "By Cooke, Phil",
        "Description": "",
        "Category": "",
        "Publisher": "CEI Publishing",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Build the Fort... Today",
        "Authors": "By Kern, Jim",
        "Description": "",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "J K Enterprises",
        "Price Starting With ($)": "5.83",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Sing a Song of Animals (Learn With Piggback Songs Series)",
        "Authors": "By Warren, Jean, McMahon, Kelly (ILT), and Peterson, Durby",
        "Description": "",
        "Category": "",
        "Publisher": "Totline Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Managing Type II Diabetes: Revised and Updated Edition Your Invitation to a Healthier Lifestyle",
        "Authors": "By Monk, Arlene (EDT), Pearson, Jan, Hollander, Priscilla, M.D., and Bergenstal, Richard M., M.D.",
        "Description": "A guide to living well with type II diabetes provides advice on proper diet, exercise, stress management, medications, and prevention of diabetes-related health problems",
        "Category": " Health & Fitness , Diseases , Diabetes",
        "Publisher": "International Diabetes Center",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Marvelous Me ~ All About the Human Body",
        "Authors": "By Townsend, Anne and Vaghela, Saroj (ILT)",
        "Description": "Explains the workings of the human body, dealing with its various systems and organs, from heart and brain to hair and nails.",
        "Category": " Young Adult Nonfiction , Health & Daily Living , General",
        "Publisher": "A Lion Book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Snow Wonder We're Friends!",
        "Authors": "By Molly Wigand",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Mickey Mouse (Dma Learntodraw Books)",
        "Authors": "By Foster, Walter",
        "Description": "If you want to learn all about drawing cartoons, Disney’s classic characters are a great place to start! With Learn to Draw Mickey Mouse, anyone can quickly learn how exciting the world of drawing can be! Aspiring artists will discover just how easy it is to bring Mickey, Minnie, and all their friends to life on paper with this perennial favorite, which features step-by-step illustrations that show each new step in blue, making it easy to follow along. With this colorful, best-selling how-to-draw title, even children can learn to draw their favorite Disney TV and film characters in no time at all!",
        "Category": " Young Adult Nonfiction , Art , Drawing",
        "Publisher": "Walter Foster Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Justice Brennan: The Great Conciliator",
        "Authors": "By Clark, Hunter R.",
        "Description": "Justice Brennan: The Great Conciliator traces the various stages of William Brennan's life: his Irish Catholic upbringing in Newark, New Jersey; his service as a superb labor trouble-shooter for the army during World War II; his tenure as a New Jersey state judge; his bitter confrontation with Sen. Joseph McCarthy during the dark days of the Communist witch-hunts; and ultimately his career on the Supreme Court.Author Hunter R. Clark has used access to the justice's personal files, granted by Brennan himself, and dozens of interviews with law clerks, associates, and intimates, to fashion a revealing portrait of Brennan and the in-chambers workings of the Supreme Court.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Birch Lane Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Leaving (Bailey Flanigan Series)",
        "Authors": "By Kingsbury, Karen",
        "Description": "The Bailey Flanigan series begins with Bailey leaving Bloomington for the adventure of a lifetime. She has won an audition for the ensemble of a Broadway musical in New York City. She’s determined to take advantage of this once-in-a-lifetime opportunity, but is she really ready to leave family and friends for the loneliness of the city? And what of Cody? His disappearance has her worried about their future and praying that their love can survive. In order to be closer to his mother in jail, Cody takes a coaching job in a small community outside Indianapolis. New friends, distance, and circumstances expose cracks in his relationship with Bailey Flanigan. Love, loneliness, big opportunities, and even bigger decisions highlight the first book in the new Bailey Flanigan series that features members of the popular Baxter family and finally completes the Bailey Flanigan/Cody Coleman story.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Ubuntu Hacks: Tips & Tools for Exploring, Using, and Tuning Linux",
        "Authors": "By Oxer, Jonathan, Rankin, Kyle, and Childers, Bill",
        "Description": "Ubuntu Linux--the most popular Linux distribution on the planet--preserves the spirit embodied in the ancient African word ubuntu, which means both \"humanity to others\" and \"I am what I am because of who we all are.\" Ubuntu won the Linux Journal Reader's Choice Award for best Linux distribution and is consistently the top-ranked Linux variant on DistroWatch.com. The reason this distribution is so widely popular is that Ubuntu is designed to be useful, usable, customizable, and always available for free worldwide.Ubuntu Hacks is your one-stop source for all of the community knowledge you need to get the most out of Ubuntu: a collection of 100 tips and tools to help new and experienced Linux users install, configure, and customize Ubuntu. With this set of hacks, you can get Ubuntu Linux working exactly the way you need it to. Learn how to:Install and test-drive Ubuntu Linux.Keep your system running smoothlyTurn Ubuntu into a multimedia powerhouse: rip and burn discs, watch videos, listen to music, and moreTake Ubuntu on the road with Wi-Fi wireless networking, Bluetooth, etc.Hook up multiple displays and enable your video card's 3-D accelerationRun Ubuntu with virtualization technology such as Xen and VMwareTighten your system's securitySet up an Ubuntu-powered serverUbuntu Hacks will not only show you how to get everything working just right, you will also have a great time doing it as you explore the powerful features lurking within Ubuntu.\"Put in a nutshell, this book is a collection of around 100 tips and tricks which the authors choose to call hacks, which explain how to accomplish various tasks in Ubuntu Linux. The so called hacks range from down right ordinary to the other end of the spectrum of doing specialised things...More over, each and every tip in this book has been tested by the authors on the latest version of Ubuntu (Dapper Drake) and is guaranteed to work. In writing this book, it is clear that the authors have put in a lot of hard work in covering all facets of configuring this popular Linux distribution which makes this book a worth while buy.\"-- Ravi Kumar, Slashdot.org",
        "Category": " Computers , Operating Systems , Linux",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "My First Number Board Book (My First Board Books)",
        "Authors": "By Deschamps, Nicola (EDT) and Ward, Kristin (EDT)",
        "Description": "A first word and picture book of essential preschool number skills. The numbers from 1 to 100 are crisply outlined against a white background, making for easy counting and identification.  DK proudly reintroduces 10 favorite board books from the beloved My First series, all with beautifully redesigned covers for a fresh new look. Filled with full-color photographs and large, easy-to-read text, My First Board Books provide children with an excellent platform for early learning. A variety of first concepts, such as colors, numbers, letters, and more are introduced in a fun, informative way to help children build the vocabulary and basic language skills that form the foundation of learning.",
        "Category": " Juvenile Nonfiction , Concepts , Counting & Numbers",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Voices of Summer",
        "Authors": "By Pearson, Diane",
        "Description": "In the style of Csardas and The Summer of the Barshinskeys, best-selling author Diane Pearson once again creates a cast of vibrant characters and places them in a dazzling, memorable locale for us to enjoy. Her writing has been called \"hauntingly beautiful\" and \"compelling\" by her reviewers and fans, and she is sure to add to her growing popularity with Voices of Summer, in which we visit the shimmering Alps and eavesdrop on the backstage affairs of the little country town of Hochhauser.This Austrian village was no different from any of the others nestled in the Alps, except for one thing - its operetta company. Dreamchild of Willi Zimmerman, the town's exuberant mayor, the company brought music and gaiety to Hochhauser's little theater. It wasn't Salzburg or Vienna, but it had charm and a certain faded elegance. It also had Karl Gesner.Gesner's voice and stage presence made him the matinee idol of the audiences. Unfortunately, this attractiveness did not extend to his personality. Offstage, Gesner was a monster. Each season it became harder and harder to find a soprano willing to appear opposite him, but each season, that was exactly what Franz Busacher, the director, had to do.When, in desperation, Busacher persuaded Therese Aschmann to return to the stage after nearly twenty years in obscurity, years of loneliness and pain, no one could have imagined it was to be the beginning of the most extraordinary season Hochhauser had ever seen - a season of angry scenes and magical transformations, both onstage and off. Above all, it was to be a season in which love blossomed, often in the most unlikely places. Voices of Summer is poignant, funny, romantic, and heartwarming - a gloriously satisfying read.",
        "Category": " Fiction , General",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Portugal",
        "Authors": "By Eiron, Inc. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Bonechi",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Managing Sideways: Using The Rummler-Brache Process Improvement Approach to Achieve Performance Breakthrough",
        "Authors": "By Price Pritchett",
        "Description": "",
        "Category": "",
        "Publisher": "Pritchett, LP",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Adobe Photoshop Lightroom Book for Digital Photographers",
        "Authors": "By Kelby, Scott",
        "Description": "Free Lightroom 1.1 update available. Simply visit peachpit.com/register to gain instant access.Scott Kelby, author of the world's #1 bestselling Photoshop book,  The Photoshop Book for Digital Photographers, brings his same award-winning, step-by-step, plain-English style, look and feel to The Lightroom Book for Digital Photographers.   This groundbreaking new book doesn't just show you \"which sliders do what\" (every Lightroom book does that). This book takes you beyond that to reveal the secrets of the new digital photography workflow, and he does it using three simple, yet brilliant techniques that make this just an incredible learning tool:   #1) Throughout the book Scott shares his own personal settings and studio tested techniques he's developed using Lightroom for his own photography workflow since well before Adobe released even the first Beta version. He knows what really works, what doesn't, and he tells you flat out which tools to use, which to avoid, and why.   #2) The entire book is laid out in a real workflow order with everything step-by-step, so you can jump right in using Lightroom like a pro from the very start and sidestep a lot of productivity killing road blocks and time-wasting frustrations that might have tripped you up along the way.   #3) But what really sets this book apart from the rest, are the last two bonus chapters. This is where Scott visually answers his #1 \"most-asked\" Lightroom question, which is: \"Exactly what order am I supposed to do things in, and where does Photoshop fit in?\"   Scott teaches this in a manner we've never seen before in any book, by really showing every step of the entire process, from the initial shoot to the final prints. Both chapters start with an on-location photo shoot, including full details on the equipment, camera settings, and even the lighting techniques. You'll see it all as he takes the photos from each shoot (with you following right along using the very same images) all the way through the entire workflow process, to the final output of the 16x20\" prints for the client.  Plus, because he incorporates Adobe Photoshop seamlessly right into this workflow, you'll also learn some of his latest Photoshop techniques for portrait and landscape photography, which takes this book to a whole new level.   It's the first, and only book to bring the whole process together in such a clear, concise, and visual way. Best all, it's taught in Scott's trademark plain-English style that has won him legions of Photoshop fans around the world, and made him the #1 bestselling author of all computer books across all Computing and Internet categories since 2004.   If you're one of those people who learns best by actually doing the projects yourself; who learns best without all the complicated technical explanations and confusing jargon, and if you really want to start using Lightroom today to unlock the productivity secrets of  \"The new digital photography workflow,\"----there is no faster, more \"straight-to-the-point\" or more fun way to learn than this groundbreaking new book, and you are absolutely going to love it!",
        "Category": " Photography , Techniques , Digital",
        "Publisher": "Peachpit Press",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Stealing Second Base: A Breast Cancer Survivor's Experience and Breast Cancer Expert's Story",
        "Authors": "By Shockney, Lillie",
        "Description": "Lillie Shockney, RN, BS, MAS,  is the Administrative Director of the Johns Hopkins Avon Foundation Breast Center, member of the surgical faculty, a breast cancer survivor, oncology nurse, and nationally renowned speaker and published author on breast cancer. Her book, Stealing Second Base: A Breast Cancer Survivor's Experience and Breast Cancer Expert's Story, is a unique, empowering, and often humorous story about the journey of a woman who has experienced breast cancer from many perspectives. Lillie Shockney shares her story about flipping to the other side of the patient's side rail when she went from medical professional, wife, and mother to becoming a breast cancer patient, patient advocate, and nationally recognized breast cancer expert, lending her emotional support and medical advice to help lead breast cancer patients and families through their own journey with this life altering disease. This must-have book combines the author's motivational and medical expertise to provide practical, important information on breast cancer diagnosis, treatment, pre- and post-surgery quality of life, sexuality associated with breast cancer treatment, the right to choose breast reconstructive surgery, breast reconstruction resources, and much more! You will laugh and cry, and come away inspired after reading this book. Guaranteed. Her message is powerful. Experience it for yourself.",
        "Category": " Self-help , General",
        "Publisher": "Jones & Bartlett Learning",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Good Food Ideas with Miracle Whip (Favorite Recipes)",
        "Authors": "By Kraft",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Beginning Visual Basic 6 Database Programming",
        "Authors": "By Connell, John",
        "Description": "A guide to Visual Basic 6 programming covers database design and construction principles, constructing VB user interfaces, SQL, programming Internet applications, and Data mining",
        "Category": " Computers , Programming Languages , Visual BASIC",
        "Publisher": "Wrox Press",
        "Price Starting With ($)": "7.18",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Keep Believing in Yourself and Your Special Dreams: Words to Motivate and Inspire Your Dreams (Blue Mountain Arts Collection)",
        "Authors": "By Blue Mountain Arts",
        "Description": "",
        "Category": " Reference , Quotations",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Head Lock",
        "Authors": "By Doolittle, Jerome",
        "Description": "The Reverend Howard Orrin is on a pilgrimage, and he's just a few steps shy of his mecca. It would seem a long way from his family-oriented Virginia theme park, Lordland, to a seat in the Senate, but The Reverend has been riding the high-speed rails of the nineties - television. His ticket to Washington comes courtesy of his right-wing Life Force organization, trained to disrupt abortion clinics and snare major coverage on the evening news. But The Reverend doesn't count on one day invading the privacy of Tom Bethany, Vietnam veteran, former college wrestler, and champion of the lost cause. When Bethany's married lover, Hope Edwards, reveals that she's pregnant by him, he leaves Boston to accompany her on a personal visit to an Arlington, Virginia, clinic. When they are forced to run a gauntlet of The Reverend's vitriolic supporters and intrusive news cameras, which wreak havoc on the emotional state of a teenage patient, Bethany is fighting mad. But when Life Force shows up on Hope's doorstep, and the young girl solves her problems by taking her own life, Bethany is determined to get even.The charismatic Reverend has recruited Archie Weider, the savviest politico in the business, to help him reach the Senate and meld the Word of God with the law of the land. Bethany's not fooled by this charade; he's preparing a full submission hold to put the brakes on the good Pastor's wheels. When Life Force christens him the \"spawn of Satan,\" a badge that Bethany sports with pride, he musters an ad hoc task force to convert The Reverend. Enlisted are Susan Freedman, a journalist who has seen a disturbing side of The Reverend and whose distaste for him grows with every media sound bite...teenage electronics whiz Roy Shipley, the only friend of the troubled young girl whose death has fueled Bethany's desire to even the score...and Wanda Vollmer, massage therapist and proprietress of Personal Leisure World, who harbors a very personal resentment of Life Force, and who jumps at the chance to assist Bethany in his crusade.As Bethany and his team conspire to topple The Reverend from his bully pulpit, they incite the wrath of a man intent upon serving both God and Mammon. In a city that rewards power over scruples, and convenience over faith, Bethany's got his own special brand of political persuasion, and a missionary zeal for the laying on of hands....",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "The Mossad",
        "Authors": "By Eisenberg, Dennis",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.65",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Open Hearts: If Your Heart Is Open, Love Will Always Find Its Way In",
        "Authors": "By Seymour, Jane",
        "Description": "?If Your Heart Is Open,Love Will Always Find Its Way In.”An open heart is a universal symbol of giving and receiving love. This precious keepsake companion perfectly compliments the elegant jewelry designed by Emmy Award-winning actress Jane Seymour for her debut line exclusive to Kay Jewelers. Open Hearts reflects life’s joys, heartaches, and inspirations and symbolizes that only when you can love yourself and keep your heart open are you able to give and receive love. This theme is celebrated through a collection of poems, essays, quotes, and Jane Seymour’s equally inspirational ?Healing Hearts” paintings. The coalescence of words and art speak to every kind of love in people’s lives. They prove that it’s a force that flows unconditionally, because if your heart is open, it can never stay broken.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Running Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "God's Little Lessons of Life for Mom (God's Little Lessons on Life Series)",
        "Authors": "By Honor Books",
        "Description": "",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Alibi For A Cold Winter's Night",
        "Authors": "By Mayr, Ilsa",
        "Description": "",
        "Category": "",
        "Publisher": "Worldwide Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "The Fredericksburg Campaign: Drama on the Rappahannock, 2nd Edition",
        "Authors": "By Stackpole, Edward J",
        "Description": "The Army of the Potomac's defeat by General Lee. A classic reference.",
        "Category": " History , United States , General",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Weapons of World War II",
        "Authors": "By Ludeke, Alexander",
        "Description": "",
        "Category": " History , Military , Weapons",
        "Publisher": "Parragon Books",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "February",
            "Year": "2012"
        }
    },
    {
        "Title": "LEAVING BAYBERRY HOUSE",
        "Authors": "By McLaughlin, Ann L.",
        "Description": "",
        "Category": " Fiction , Historical , General",
        "Publisher": "Daniel & Daniel Publishers",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "February",
            "Year": "2015"
        }
    },
    {
        "Title": "The John Hopkins Complete Home Guide to Symptoms & Remedies: The Comprehensive Reference to More Than 500 Symptoms & Conditions",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Tess Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "I Remember Grandpa",
        "Authors": "By Moser, Barry (ILT) and Capote, Truman",
        "Description": "Bobby, a West Virginia boy, moves with his family from the rural home of his grandparents to the city where his father hopes to find a better job",
        "Category": " Fiction , General",
        "Publisher": "Peachtree Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Computer Literacy for IC3 Second Custom Edition for Hagerstown Community College",
        "Authors": "By PRESTON",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson",
        "Price Starting With ($)": "49.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1969"
        }
    }
]