[
    {
        "Title": "Memories Yearbook",
        "Authors": "By Memories Magazine Editors",
        "Description": "More than four hundred celebrities appear in a mythical high school yearbook featuring actual graduation photographs and captions stating honors, activities, quotes, and future plans",
        "Category": " Humor , General",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "In His Steps",
        "Authors": "By Sheldon, Charles M.",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Total Recall: How to Boost Your Memory Power",
        "Authors": "By Minninger, Joan",
        "Description": "Explains how the human memory works, tells why we forget, and suggests ways to remember faces and names, dates and numbers, and important facts",
        "Category": " Psychology , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Secret Weapons of World War II",
        "Authors": "By Breuer, William B.",
        "Description": "In this ingenious volume, victory or defeat in the twentieth century's climactic conflict depended on the secret war of wits that occurred between the scientists, mathematicians, and codebreakers on each side. This is a fascinating look at the behind the scenes duel to develop the winning weapons of World War II. This book is ideal for any historian, war buff, or fan of technology.  Here are the extraordinary tales behind the brilliant weapons and technological wizardry that determined the outcome of the war. From radar, huff-duff (high frequency direction finding), invisible radio beams, and 'Perfectos' to secret codes, electronic guidance systems, homing devices, and submarine detection equipment, Breuer deftly expose the gargantuan efforts employed by both adversaries and the fascinating details of the high-stakes warfare waged behind the well-known scenes of combat.",
        "Category": " History , Military , World War II",
        "Publisher": "Castle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Burnt Sienna",
        "Authors": "By Morrell, David",
        "Description": "Painters know burnt sienna as the color of earth and fire, the color of passion and life. But when Chase Malone sets eyes on Sienna Bellasar, he sees a beauty unmatched by anyone, or anything, he has ever attempted to capture on canvas.Sienna is the wife of international arms dealer Derek Bellasar, who tries to strong-arm Malone into painting her portrait. But Malone refuses... until he beholds Sienna's beauty. Until the CIA persuades him to spy on Bellasar. And until he learns that Bellasar previously commissioned paintings of three earlier wives - weeks before each died in suspicious accidents.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Grand Central Publishing / Warner",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Is It Worth Dying for",
        "Authors": "By Eliot, Robert S.",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "The DNA of Relationships",
        "Authors": "By Smalley, Gary, Smalley, Michael, Paul, Robert S., and Smalley, Greg",
        "Description": "“Life is relationships; the rest is just details.” We are designed for relationships, yet they often bring us pain. In this paradigm-shifting book, Gary Smalley unravels the DNA of relationships: we are made for three great relationships—with God, others, and ourselves—and all relationships involve choice. Gary exposes a destructive relationship dance that characterizes nearly every relationship conflict, and he offers five new dance steps that will revolutionize relationships.The DNA of Relationships, the cornerstone book in Gary Smalley's relationship campaign, will revolutionize your marriage, family, friendships, and work relationships.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Triumph Over Fear",
        "Authors": "By Ross, Jerilyn and Clafin, Edward",
        "Description": "A leading authority on anxiety disorders combines case histories with behavioral and medical treatment models, offering help and hope to those who suffer from panic attacks, phobias, and other stress and anxiety disorders.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Life (Eyewitness Science)",
        "Authors": "By Burnie, David",
        "Description": "An exploration of animal, human, and plant life covers such diverse topics as DNA, cell division, and photosynthesis with the aid of textual explanations, 3-D models, and more than three hundred full-color photographs and illustrations.",
        "Category": " Juvenile Nonfiction , Science & Nature , Biology",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Michelin In Your Pocket Brittany, 1e (In Your Pocket)",
        "Authors": "By Michelin Travel Publications",
        "Description": "",
        "Category": " Travel , Europe , General",
        "Publisher": "Michelin Travel Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Writing research papers: A guide to the process",
        "Authors": "By Weidenborner, Stephen and Caruso, Domenick",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Nature of Birds",
        "Authors": "By Forsyth, Adrian",
        "Description": "Concentrates on bird behavior, from the swamp rookery of blue herons to the antics of a nesting nuthatch",
        "Category": " Science , General",
        "Publisher": "Firefly Books Ltd",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Fabric of the Future: Women Visionaries of Today Illuminate the Path to Tomorrow",
        "Authors": "By Ryan, M. J. (EDT)",
        "Description": "A landmark anthology draws on a range of thought and spiritual perspectives--from Judeo-Christian to Buddhist to Wicca--to explain how to negotiate the changing world of the future, in contributions from Mariannne Williamson, Joan Broysenko, Gloria Steinem, Starhawk, and others. 50,000 first printing. One Spirit.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Edgar Allan Poe Unabr Ed Pb",
        "Authors": "By Poe, Edgar Allan",
        "Description": "A chronological collection of all of Poe's poems and stories includes tales of adventure, farce, science fiction, black humor, and romance, as well as horror",
        "Category": " Poetry , American , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Introduction to Finches and Softbills",
        "Authors": "By Bates, Hank, Busenbark, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "TFH Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1968"
        }
    },
    {
        "Title": "Traitor's Sun (Daw Book Collectors)",
        "Authors": "By Bradley, Marion Zimmer",
        "Description": "It has been fifteen years since Marguerida Alton returned to Darkover. Fifteen years since she discovered the terrifying powers of her special laran, met and fell in love with Mikhail Lanart-Hastur, heir designate to the throne of Darkover, and journeyed back in time to the Ages of Chaos to answer the call of a long-dead Keeper.Now Marguerida's life is more settled. As the seconds-in-command to the aging Regent, Regis Hastur, and his consort Linnea, life in Comyn Castle for Marguerida and Mikhail is far from serene.But the real root of the current tensions on Darkover has more to do with the Terran Federation than anything internal to Darkover. The once pleasant relationship between Darkover's ruling families and the Terran envoys to Darkover has been shattered, primarily due to the machinations of Lyle Belfontaine, the corrupt and ambitious Station Chief at Federation Headquaters.When the sudden death of Regis Hastur leaves Comyn Council in turmoil, Belfontaine sees an opportunity to wrest by force what he could not gain through diplomacy, and plans a violent takeover on Darkover.Can Mikhail and Marguerida, new Regent and consort on Darkover, face the might of Terran weapons with only their combined telepathic laran powers?",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "DAW Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "What Every Woman Should Know About a Man",
        "Authors": "By James L Johnson",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "Why Government Doesn't Work: How Reducing Government Will Bring Us Safer Cities, Better Schools, Lower Taxes, More Freedom and Prosperity for All",
        "Authors": "By Browne, Harry",
        "Description": "I'm not a politician. Like you, I'm sick of seeing government take almost half the national income and then dole it back to us as though we are children on an allowance. I'm tired of politicians using the crime problem as an excuse for seizing property and liberties from innocent citizens. And I'm not fooled by \"welfare reform\" that doesn't change anything, or by showy \"spending cuts\" that add up to a bigger government budget.As a lifelong libertarian, I'm running for president with a simple platform: We can have higher incomes, safer cities, better schools, and a more civil society if we reduce the size of government drastically - rather than just slowing its growth. This book presents a realistic plan for cutting government, and it shows how you can make me keep my promises if elected.",
        "Category": " Political Science , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "How to Design and Build Storage Projects (Ortho library)",
        "Authors": "By Snow, Diane",
        "Description": "",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Handy Dinosaur Answer Book",
        "Authors": "By Svarney, Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "Visible Ink Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Tyrannosaurus Sue: The Extraordinary Saga of the Largest, Most Fought Over T. Rex Ever Found",
        "Authors": "By Steve Fiffer",
        "Description": "",
        "Category": "",
        "Publisher": "W. H. Freeman and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Configurations of Human Behavior: Life Span Development in Social Environments",
        "Authors": "By Bloom, Martin",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Taking Charge of Your Fertility: The Definitive Guide to Natural Birth Control and Pregnancy Achievement",
        "Authors": "By Weschler, Toni",
        "Description": "Detailing a groundbreaking technique, the Fertility Awareness Method, an illustrated guide for couples facing infertility offers a natural alternative to ineffective procedures and a biologically proven method of fertility control for avoiding or achieving pregnancy. Original. $25,000 ad/promo. Tour.",
        "Category": "",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Escape from Fire Mountain (World of Adventure)",
        "Authors": "By Paulsen, Gary",
        "Description": "Thirteen-year-old Nikki Roberts tries to help two children trapped by a forest fire but finds her efforts blocked by poachers who want her to become one of the fire's victims. But after a shocking turn of events, the fire becomes the least of Nikki's problems. Will Nikki's horse, Goblin, and her years of hunting guide experience save her, or will Fire Mountain reign supreme?",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Bridal Bargains: Secrets to Throwing a Fantastic Wedding on a Realistic Budget",
        "Authors": "By Fields, Denise and Fields, Alan",
        "Description": "Offers sound tips on planning an inexpensive yet fabulous wedding, including advice on gown deposits, shopping for ceremony and reception sites, choosing elegant, inexpensive invitations, and more. Original. 35,000 first printing. Tour.",
        "Category": " Reference , Weddings",
        "Publisher": "Windsor Peak Pr",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Strange Dreams: Collected Stories & Drawings",
        "Authors": "By Andreas, Brian",
        "Description": "",
        "Category": " Poetry , General",
        "Publisher": "StoryPeople",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Nightmare Hour: Time for Terror",
        "Authors": "By Stine, R. L.",
        "Description": "\"These are my scariest stories ever,\" says R.L. Stine, \"because I wrote them at the Nightmare Hour.\" You know when that is...it's when the lights fade, the real world spins into shadow--and the cold, moonlit world of evil dreams takes over your mind.  What horror awaits a boy who has to spend Halloween in the hospital? How do you outwit a ghost who wants your skin? Why is Nightmare Inn the most terrifying place to visit?  R.L. Stine, the #1 bestselling children's authors of all time, spins a web of horror and more. For the first time ever, he shares the secret behind each story, revealing where the idea for each tale came from.  Here are ten stories that will bring a shiver at any hour and take you to the scariest place of all--inside the mind of R.L. Stine.  00 Children's Choices (IRA/CBC)",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Dinosaur Dictionary",
        "Authors": "By Glut, Donald F.",
        "Description": "Photographs and diagrams complement descriptions of the physical characteristics, time period, and locations of fossils of every known genus of dinosaur",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Coromandel Sea Change: A Novel",
        "Authors": "By Godden, Rumer",
        "Description": "The Coromandel coast of southern India seems the ideal place for Mary and Blaise's honeymoon, but before long Mary begins to feel detached from her new husband and powerfully attracted to Krishnan, a local politician now in mortal danger",
        "Category": " Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Billy Graham Story",
        "Authors": "By John Pollock",
        "Description": "",
        "Category": "",
        "Publisher": "Billy Graham Evangelistic Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "On Women & Friendship: A Collection of Victorian Keepsakes and Traditions",
        "Authors": "By Ockenga, Starr",
        "Description": "",
        "Category": "",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Journey Through Brain Trauma: A Mother's Story of Her Daughter's Recovery",
        "Authors": "By Morningstar, Louise Ray and Dorszynski, Alexia",
        "Description": "Misti Morningstar's auto accident leaves her spending weeks in a coma and years recovering from a brain injury that leaves her paralyzed and unable to speak or swallow. Journey Through Brain Trauma is the true story of Louise Morningstar's struggle to help her daughter recover from devastating brain damage.",
        "Category": " Health & Fitness , Physical Impairments",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Prentice Hall Small Business Survival Guide: A Blueprint for Success (Prentice Hall Business Classics)",
        "Authors": "By Turitz, Richard M. and Cross, Michael (CON)",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "A Concise History of England from Stonehenge to the Microchip (Illustrated National Histories)",
        "Authors": "By Halliday, F. E.",
        "Description": "This brief, overall look at English history links the historical periods through the dominant theme of the conflict between order and liberty",
        "Category": " History , Europe , Great Britain",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1980"
        }
    },
    {
        "Title": "Complete Guide to Flags",
        "Authors": "By Crampton, William",
        "Description": "Discusses the history and uses of flags, describes the flags of every nation, and includes international flags",
        "Category": " Reference , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The Haymeadow",
        "Authors": "By Paulsen, Gary",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Children's Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Major Appliances (FIX-IT-YOURSELF)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Clara and the Bookwagon, Level 3 (I Can Read Book)",
        "Authors": "By Croll, Carolyn (ILT) and Levinson, Nancy Smiler",
        "Description": "Papa will not allow Clara to learn to read—he says that ‘Farm people like us do not have time to read.\"  But when the traveling bookwagon, with persuasive Miss Mary at the reins, arrives at their farm, Papa realizes he must change his mind. Based on the true story of America’s first ‘bookmobile.’",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Harper Trophy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Kissing The Rain",
        "Authors": "By Brooks, Kevin",
        "Description": "From the acclaimed author of MARTYN PIG and LUCAS comes another compelling, edgy thriller about love, loss, and pivotal decisions.  Now in a dynamic new Kevin Brooks repackaging!Moo Nelson likes to be alone. Overweight and shy, Moo is constantly mocked and bullied by his cruel classmates. He's happiest spending time on a secluded bridge above the highway, watching the cars go by. One day, from his special spot, Moo witnesses a crime that changes his life forever. He sees a car chase and a murder--and suddenly Moo's a celebrity of sorts. The police, the lawyers, and even the bullies are now really interested in Moo. But so is one shady character who seems intent on tracking Moo down. Now all Moo has to do is find out the truth behind the crime...before it's too late.",
        "Category": " Young Adult Fiction , Law & Crime",
        "Publisher": "Push",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Incredible Voyage",
        "Authors": "By National Geographic Society (U. S.)",
        "Description": "In his foreword, author and physician Sherwin B. Nuland compares Incredible Voyage to \"a great journey with writers and photographers who approach their assignments with the wonder shared by all of us who have devoted our careers to the study and contemplation of the extraordinary edifice of cells that is the human body.\" The skills of these contributors, he adds, \"enable us to see.\"  Following in the grand tradition of Leonardo da Vinci's astonishing notebooks, Vesalius's monumental De Humani Corporis Fabrica, and Gray's Anatomy, Incredible Voyage is a stunning combination of arresting images and definitive explanations. And what an enthralling world it explores, using the latest techniques of microphotography, magnetic resonance imaging, sonography, and more -- to show us everything from individual molecules of DNA to a color-coded map of the deepest recesses of a dreaming brain.  Six informative chapters highlighted by 300 colorful, state-of-the-art illustrations trace the development, structure, and function of the human organism, from conception to old age. With a team of expert authors as your guides, examine the cellular building blocks and genetic master plans that lie at the foundation of life. Explore the body's marvelous natural engineering and its intricate interactions, learn about your amazing biological defenses, and discover what really happens when disease strikes. The book also presents the latest technological improvements in biomedicine, explaining what cutting-edge research has revealed about such diverse subjects as the human consciousness, immunodeficiency, and the aging process. Finally, we look ahead to future developments, ranging from improved diagnostic techniques and alternative medicines to the wonders of genetic engineering.  Incredible Voyage is a true synthesis of extraordinary visual impact and authoritative information that offers a vivid and innovative portrait of human physiology as we understand it, on the brink of the 21st century. It's must reading for anyone interested in the human body and all its fascinating intricacy.",
        "Category": " Science , Life Sciences , Human Anatomy & Physiology",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "6.68",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Theories of Modern Art",
        "Authors": "By Selz, Peter, Chipp, Herschel B.",
        "Description": "",
        "Category": "",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "WALL STREET JOURNAL GUIDE TO UNDERSTANDING PERSONAL FINANCE: Revised and Updated",
        "Authors": "By Morris, Kenneth M. and Siegel, Alan M.",
        "Description": "An updated edition of this classic financial tool offers readers a comprehensive guide to virtually every real-life financial decision they might face, as well as a thorough explanation of underlying issues and pitfalls. Reprint. 50,000 first printing.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "11.98",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Survivors Club",
        "Authors": "By Gardner, Lisa",
        "Description": "One of today’s most electrifying suspense novelists, New York Times bestselling author Lisa Gardner returns with a shattering thriller that dares to play on our deepest vulnerabilities. In this masterful new novel, the killer may very well be the one you sympathize with the most....THE FIRST RULE IS NEVER BLAME THE VICTIM.They survived what no woman should ever have to endure. Now these three women have the means, the opportunity, and the perfect motive. Are they trying to get away with murder--or is someone trying to make sure that this time they don’t get away at all? The Survivors Club. . .that’s what Jillian Hayes, Carol Rosen, and Meg Pesaturo call it. They won’t consider themselves victims. They are survivors. They faced the blazing headlines and helped lead the investigation that caught the man who changed their lives forever. And now that Eddie Como, the College Hill rapist, has been murdered, shot down outside a packed courthouse moments before his trial was about to begin, all three women are openly ecstatic that he’s dead. They are also the prime suspects in his murder. Detective Sergeant Roan Griffin knows all too well what can drive even the best people to cross the line. But he has never seen a case quite like this one. No one doubts that the murder of Eddie Como was a professional job, especially when the gunman is killed only blocks away from the shooting. But questions taunt Griffin: Who ordered the deaths of Eddie Como and his killer? Could three ordinary women have been driven to do he unthinkable? Had someone in the Survivors Club become a killer? Griffin seeks the truth--and finds himself confronted with the leader of the Survivors Club. Jillian Hayes is beautiful, successful, cool as ice, and she harbors a pain that mirrors Griffin’s own. Did the horror of what happened to her push her over the thin and desperate line that separates survival and revenge? And if it did, could he blame her--or anyone in the Survivors Club? Then another woman is brutally attacked. Suddenly, with the city on the ragged edge of panic, gripped in a media and political firestorm of controversy, cover-up, and conspiracy, the hunt is on for a ruthless and cunning killer. For Griffin, this may well be the case that shatters his career. For Jillian, the harrowing nightmare is beginning all over again. Someone is out there. Someone who wants to finish what was started. Someone who wants to make sure that no one survives the Survivors Club.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Everyday Math For Dummies",
        "Authors": "By Seiter, Charles",
        "Description": "After you graduated from high school, college, or even graduate school you might have vowed never to deal with math again, right? But everyday, you’re faced with some form of math, from balancing your checkbook to tipping your server at a restaurant. Well, there’s no reason to be intimidated when it comes to math, and this book will show you why.Everyday Math for Dummies is intended to be a quick, enjoyable adult-oriented course in the aspects of math you need all the time. Whether you’re looking for a refresher on math skills you might have forgotten or want to obtain math skills you never fully understood, Everyday Math For Dummies can help you discover the answers to all kinds of problems.Everyday Math For Dummies helps build your skills so that you can better deal with all sorts of stressful math situations, from refinancing your house to evaluating business news and understanding sports statistics. There’s even a fun chapter on puzzles! With this book as your guide, you’ll be able to:Finally make sense of your checkbookMaster the simplest tipping rules in the worldCalculate compound interest like an investment proUnderstand the math of refinancing and debt managementDecipher the fine print in a credit card agreementFigure percentages easily with a calculator, on paper, or in your headGet a handle on all that stuff from high school—algebra, geometry, and trigEveryday Math For Dummies can help you take charge of your life. Complete with a tear-out cheat sheet for you to keep handy for when the kids need help with their homework or you need help completing your tax return, this book makes math easy.",
        "Category": " Mathematics , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Marriott Hot Shoppes Cookbook: Sixty Years of American Cookery",
        "Authors": "By Marriott Hotels",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "For Marriott by Parsons, Friedmann, Stephan & Rose",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Spider-Man 2: Doc Around the Clock",
        "Authors": "By Gunter, Jacob Ben and Grunter, Jacob Ben (CON)",
        "Description": "Doc Ock has four powerful tentacles, and he's wreaking havoc across New York City. There is only one person standing in his way -- Spider-Man. The web-slinger will do anything in his power to stop the multi-tentacled villain. Read all about one day in the life of Spider-Man's newest nemesis, Doc Ock.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "When in Germany, Do as the Germans Do: The Clued-In Guide to German Life, Language, and Culture",
        "Authors": "By Flippo, Hyde",
        "Description": "Never feel like a stranger in Germany again!On entering a restaurant, should you find your own table or wait to be seated? What is a suitable topic for small-talk with a stranger? In what circumstances might you ask to borrow  ein Handy? All these answers and more can be found in When in Germany, Do As the Germans Do, a fun and intriguing book that teaches you about Germany's culture, language, and people.It features 120 intriguing multiple-choice questions that are cross-referenced to fascinating articles on pop culture, customs, behavior, history, consumer trends, literature, tourist sights, business, language, and more. Also included are key terms and useful expressions, informative charts, and websites for further reference.",
        "Category": " History , Europe , Germany",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "German (Eyewitness Travel Guide Phrase Books)",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "A travel phrasebook for anyone planning a trip to a German-speaking country, this pocket-sized paperback includes all the essential words and phrases for every traveler. Even experienced speakers will benefit from the detailed travel-specific knowledge, and first-time speakers will find it easy to pick up the key words and phrases they need to get by. Easy to browse and easy to carry, it will travel with you wherever you go and give you language help at your fingertips.  Part of the DK Eyewitness Travel Guides Phrase Book series. These pocket dictionaries give business and vacation travelers everything they need for a smooth, successful trip. Organized by subject, they help the traveler quickly find the vocabulary relevant to any situation, whether transportation, hotels, meals, shopping, post offices and banks, sports, or health care, and the phrasebook and glossary are accompanied by a pronunciation guide. At the end of each guide book is a 2,000-word mini-dictionary.",
        "Category": " Travel , Reference",
        "Publisher": "DK",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Wuthering Heights (Penguin Classics)",
        "Authors": "By Bronte, Emily and Nestor, Pauline (EDT)",
        "Description": "The passionate love of Catherine Earnshaw and Heathcliff mirrors the powerful moods of the Yorkshire moors",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Web Security: A Step-By-Step Reference Guide",
        "Authors": "By Stein, Lincoln D.",
        "Description": "A guide for Web site administrators, developers, and end users, showing how to secure a Web site. Explains essential theory of security, tells how to evaluate risks that threaten a site, and provides solutions and checklists. Part I introduces cryptography and discusses specifics of the SSL and SEL protocols. Part II looks at Web security issues from an end-user's point of view and provides practical recipes for avoiding pitfalls. Part III, the longest section, deals with Web security from the Web site administrator's point of view, offering advice on aspects including configuration, controlling access, and CGI scripting. Includes chapter checklists. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": "",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Prayer: My Soul's Adventure With God : The Spiritual Autobiography of Robert H. Schuller",
        "Authors": "By Schuller, Robert Harold",
        "Description": "Prayer: My Soul's Adventure with God is a spiritual autobiography and an inspiring look at how prayer can lead you into a vital and fulfilling life. For over half a century God has been answering prayer and working in Robert Schuller's life. This personal journey offers an intimate, behind-the-scenes look at the early days when a young pastor and his wife started a church at a Southern California drive-in theater; how faith and prayer built the beautiful, seventeen million dollar Crystal Cathedral; the miraculous beginnings of the Hour of Power program and its tremendous growth into a worldwide outreach; what happened when rumors started to mount about Schuller's ministry after the TV evangelist scandals of the 1980s; Schuller's recent miraculous recovery from a life-threatening coma; God's care and faithfulness through family crises and personal loss; and the ways Dr. Schuller's ministry has touched lives, not only throughout the United States, but around the world.",
        "Category": " Religion , Christian Life , Prayer",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Decisions for Healthy Living",
        "Authors": "By Pruitt, B. E. and Stein, Jane J.",
        "Description": "Decisions for Healthy Living is a brief book that focuses on the Rnuts and boltsS of personal health, giving readers all the basic tools they need for healthy living. The clear and friendly writing style keeps readers engaged and interested in the material, without bogging them down in technical details or making judgments about their personal health choices. Decisions for Healthy Living makes ample use of case studies, self-assessment activities, special interest boxes, journal activities, and other engaging exercises to help readers become informed consumers and make positive behavioral changes in their lives.  For college instructors, students, and readers interested in health and",
        "Category": " Health & Fitness , General",
        "Publisher": "Benjamin Cummings",
        "Price Starting With ($)": "6.11",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Find Mouse in the House: Lift the flap-follow the clue",
        "Authors": "By Maisner, Heather and Hard, Charlotte (ILT)",
        "Description": "Daisy's mouse is missing, and the reader can help search by lifting flaps and following the easy-to-read clues.",
        "Category": "",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Chicken Soup for the Teenage Soul Journal (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Kirberger, Kimberly (COM)",
        "Description": "Your hopes, your dreams, your life - Chicken Soup for the Teenage Soul Journal gives you the perfect outlet to record your personal stories, feelings and experiences, in a way that is both fun and challenging. Sections called \"Friendship\", \"Tough Stuff\", \"Follow Your Dreams\" and more will help you to focus on what matters most to you, how to feel about your life, how to love yourself and others. With lots of space where you can write and where you can have friends and family share their feelings with you - it is also filled with great poems, thought provoking quotes, inspirational vignettes, and more. This Journal is sure to become one of your most valued keepsakes.",
        "Category": " Young Adult Nonfiction , Social Topics , General",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Can You Come Here Where I Am? The Poetry and Prose of Seven Breast Cancer Survivors",
        "Authors": "By Busch, Rita (EDT) and Write Away Group (COR)",
        "Description": "",
        "Category": " Poetry , American , General",
        "Publisher": "E M Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "OCP Building Internet Applications I & II Exam Guide",
        "Authors": "By Allen, Christopher",
        "Description": "Prepare to pass the OCP Building Internet Applications I ; II exams--two of four required exams for OCP Application Developer certifications--using this Oracle Press study guide. You'll get complete coverage of all exam topics followed by practice questions and chapter summaries. The CD-ROM contains hundreds of practice exam questions in an adaptive format.",
        "Category": " Computers , Database Management , General",
        "Publisher": "McGraw-Hill Osborne Media",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Renaissance and Reformation: 1300-1648 (Ideas & Institutions in Western Civilization)",
        "Authors": "By Elton, G R",
        "Description": "Writings by leading figures in religion, politics, the arts and sciences, as well as official documents, offer original source material on the central issues of European history during this period",
        "Category": "",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1976"
        }
    },
    {
        "Title": "Ramona the Brave",
        "Authors": "By Tiegreen, Alan (ILT) and Cleary, Beverly",
        "Description": "Newbery Medal–winning author Beverly Cleary lovingly chronicles the ups and downs of elementary school woes. This is perfect for fans of Clementine. For a girl as enthusiastic about life as Ramona, starting the first grade should be easy! But with a teacher who doesn't understand her, a tattletale classmate, and a scary dog who follows her on the walk home from school, Ramona has a hard time acting like the big girl everyone expects her to be. But when she shows up to school with a missing shoe, Ramona gets a fresh grip on her courage in order to make it through a mortifying situation.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Avon Camelot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2020"
        }
    },
    {
        "Title": "Bonsai: The Complete Guide to Art and Technique",
        "Authors": "By Lesniewicz, Paul",
        "Description": "Surveys the various styles of bonsai and explains how to use the methods of bonsai to grow miniature versions of trees",
        "Category": " Gardening , Ornamental Plants",
        "Publisher": "Blandford Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Let's Find Shapes",
        "Authors": "By Silverhardt, Lauryn and Giarrano, Vince (ILT)",
        "Description": "CAN WE FIND SHAPES? YES, WE CAN!  From the square window to the diamond-shaped kite, Bob and his friends show young readers that shapes are everywhere!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "OCP Introduction to Oracle9i: SQL Exam Guide",
        "Authors": "By Couchman, Jason",
        "Description": "Prepare to pass the OCP Introduction to Oracle9i SQL exam--a required exam for OCA/OCP DBA certification--using this Oracle Press study guide. You'll get complete coverage of all exam topics followed by practice questions and chapter summaries. The CD-ROM contains hundreds of practice exam questions in an adaptive format.",
        "Category": " Computers , Programming Languages , SQL",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Autumn Street",
        "Authors": "By Lowry, Lois",
        "Description": "Living with her grandparents in a small Pennsylvania town while her father serves in the Pacific during World War II, sheltered Elizabeth Lorimer encounters racial prejudice when she befriends a young Black boy",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "The American Weekend Garden",
        "Authors": "By Thorpe, Patricia",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "arthur's valentine",
        "Authors": "By Marc Brown",
        "Description": "",
        "Category": "",
        "Publisher": "paperback no dj",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "American Gunfight: The Plot to Kill Harry Truman--and the Shoot-out that Stopped It",
        "Authors": "By Hunter, Stephen and Bainbridge, John, Jr.",
        "Description": "American Gunfight is the fast-paced, definitive, and breathtakingly suspenseful account of an extraordinary historical event -- the attempted assassination of President Harry Truman in 1950 by two Puerto Rican Nationalists and the bloody shoot-out in the streets of Washington, D.C., that saved the president's life.Written by Pulitzer Prize-winner Stephen Hunter, the widely admired and bestselling novelist and author of such books as Havana, Hot Springs, and Dirty White Boys, and John Bainbridge, Jr., an experienced journalist and lawyer, American Gunfight is at once a groundbreaking work of meticulous historical research and the vivid and dramatically told story of an act of terrorism that almost succeeded. They have pieced together, at last, the story of the conspiracy that nearly doomed the president and how a few good men -- ordinary guys who were willing to risk their lives in the line of duty -- stopped it.It is a book about courage -- on both sides -- and about what politics and devotion to a cause can lead men to do, and about what actually happens, second by second, when a gunfight explodes.It begins on November 1, 1950, an unseasonably hot afternoon in the sleepy capital. At 2:00 P.M. in his temporary residence at Blair House, the president of the United States takes a nap. At 2:20 P.M., two men approach Blair House from different directions. Oscar Collazo, a respected metal polisher and family man, and Griselio Torresola, an unemployed salesman, don't look dangerous, not in their new suits and hats, not in their calm, purposeful demeanor, not in their slow, unexcited approach. What the three White House policemen and one Secret Service agent cannot guess is that under each man's coat is a 9mm German automatic pistol and in each head, a dream of assassin's glory.At point-blank range, Collazo and then Torresola draw and fire and move toward the president of the United States.Hunter and Bainbridge tell the story of that November day with narrative power and careful attention to detail. They are the first to report on the inner workings of this conspiracy; they examine the forces that led the perpetrators to conceive the plot. The authors also tell the story of the men themselves, from their youth and the worlds in which they grew up to the women they loved and who loved them to the moment the gunfire erupted. Their telling commemorates heroism -- the quiet commitment to duty that in some moments of crisis sees some people through an ordeal, even at the expense of their lives.",
        "Category": " Political Science , American Government , Executive Branch",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Monsters, monsters!",
        "Authors": "By Muntean, Michaela",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. Co., in conjunction with Children's Television Workshop",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Best Bad Thing (Best Bad Thing Mkm Cloth)",
        "Authors": "By Uchida, Yoshiko",
        "Description": "At first dismayed at having to spend the last month of her summer vacation helping out in the household of recently widowed Mrs. Hata, Rinko discovers there are pleasant surprises for her, but then bad things start to happen. Sequel to \"A Jar of Dreams.\"",
        "Category": " Juvenile Fiction , People & Places , United States , Asian American",
        "Publisher": "Margaret K McElderry",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Country Road",
        "Authors": "By San Souci, Daniel",
        "Description": "As a boy and his father walk down an old country road one morning, the boy is fascinated by the sounds and smells of nature as he spots a red-tailed hawk, moles, horses, and other creatures.",
        "Category": "",
        "Publisher": "Doubleday Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Story of the American Revolution Coloring Book (Dover History Coloring Book)",
        "Authors": "By Copeland, Peter F.",
        "Description": "Noted artist Peter Copeland has captured all the drama and excitement of a fateful era in American history with 40 finely drawn black-and-white illustrations. Modestly priced and historically accurate, Story of the American Revolution Coloring Book contains scenes depicting the Boston Massacre, Paul Revere's ride, the Battle of Lexington, the capture of Fort Ticonderoga, the Battle of Bunker Hill, the signing of the Declaration of Independence, the execution of Nathan Hale, George Washington at the Delaware, Washington's farewell to his officers at Fraunces Tavern, and many more exciting scenes.",
        "Category": " Juvenile Nonfiction , History , United States , Colonial & Revolutionary Periods",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Special Occasions: The Best of Martha Stewart Living",
        "Authors": "By Stewart, Martha",
        "Description": "Hundreds of the best ideas for 12 holidays throughout the year--from New Year's to Halloween--collected from the pages of Martha Stewart Living. Each menu is lavishly illustrated and explained with step-by-step instructions. Sidebars cover such topics as lighting an outdoor party, dyeing Easter eggs, and the perfect cakes to make every occasion memorable. Full-color photographs.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Pirates of the Caribbean: At World's End - The Movie Storybook",
        "Authors": "By Sutherland, Tui (ADP)",
        "Description": "Cheer up, mateys! Everyone's favorite pirate captain is back and up to his usual tricks. Pirates of the Caribbean 3: The Movie Storybook will captivate fans as they follow the cross-seas adventures of Captain Jack Sparrow, Elizabeth Swann, and Will Turner in this beautifully photographed retelling of the third film. Fans would rather walk the plank than miss out on the double-triple-crossings and heart-pounding battles of the Pirates of the Caribbean 3.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Truck Book (Golden Books)",
        "Authors": "By Scarry, Richard and Di Fiori, Larry",
        "Description": "Shows pickup trucks, cherry picker trucks, vans, campers, tractor trailers, tankers, buses, cement mixers, dump trucks, ambulances, delivery trucks, street sweepers, sanitation trucks, and ice cream trucks at work",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Baby's First Bible (The First Bible Collection®)",
        "Authors": "By",
        "Description": "This treasury of carefully selected stories, timeless verses, and delightful rhymes takes the child on a journey from creation through the resurrection.Every book in The First Bible Collection® is beautifully illustrated with peek-through windows. Picture icons in each book let you know when it’s time to share a special activity with your child.The First Bible Collection® and Design are trademarks registered in the United States Patent and Trademark Office by Reader’s Digest Association, Inc. Used by permission.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Standard Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Great Town and Country Bicycle Balloon Chase",
        "Authors": "By Douglass, Barbara and Newsom, Carol (ILT)",
        "Description": "After studying the short cuts in town, Gina and Grandpa hope to win the bicycle balloon chase, but just as they sense victory, they start chasing a parrot instead of the balloon.",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Mega-Fun Map Skills (Grades 2-3)",
        "Authors": "By Hale, James Graham (ILT) and Tamblyn, Catherine M.",
        "Description": "From street maps to globes, students will love learning about and exploring maps with the hands-on activities in this book. Filled with ready-to-go activities and reproducible pages, this complete resource is designed to teach students to read a variety of maps and globes and understand map symbols and directions. Also features 4 interactive sticker maps?plus four pages of reusable stickers?that are sure to be a big hit with young geographers. For use with Grades 2-3.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "What Are Schools For?: Holistic Education in American Culture",
        "Authors": "By Miller, Ron",
        "Description": "",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Alternative Education Resource Organization",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2016"
        }
    },
    {
        "Title": "The Teddy Bear Journal",
        "Authors": "By Perleburg, Pat",
        "Description": "",
        "Category": "",
        "Publisher": "Running Pr Book Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Creative Accessories for the Home: 76 Projects & Ideas (Arts & Crafts for Home Decorating)",
        "Authors": "By Home Decorating Institute",
        "Description": "",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Time Life UK",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Women and Community in Oman",
        "Authors": "By Eickelman, Christine",
        "Description": "Before 1970 Oman was one of teh more isolated countries on the Arab peninsula.  The growth of the oil economy during the seventies, however, has brought rapid change to the small towns and villages that make up the country. In Women and Community in Oman Chritine Eickelman captures the tone and feel of this desert culture on the verge of substantial, and probably irreversible, change.  During 1979 and 1980 she lived in Hamra, an oasis of 2,500 persons and the capital of the Abriyin tribe.  Situated on the western edge of the Jabal al-Akhdar region of inner Oman, this was formerly one of the most inaccessible areas of the peninsula.  Eickelman lived there among the people of Hamra, visiting Omani, this was formerly one of the most inaccessible areas of the peninsula.  Eickelman lived there among the people of Hamra, visiting Omani homes, and speaking daily with the men and women - especially the women.  The result is a lively and very personal firsthand account of day-to-day life in the Omani interior. The book looks at the practical changes in the life of the Omanis, and at the roles, concerns, and aspirations of the women there.  Eickelman explores key concepts in the Omani community and family life, from choosing a spouse and \"negotiating\" a marriage to giving birth and raising children; from work and status within the community to rituals, mores and sociability in the neighborhood. Eickelman's study stands as a discriminateing and sympathetic view of a sturdily independent culture.  This perceptive and informative account will be of lasting importance and interest to Middle East specialists, anthroupoligists, those concerned with women's studies, and to al persons who want to learn more about the implications of political and social change in the Third World.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "NYU Press",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "We Are All Alike... We Are All Different",
        "Authors": "By Cheltenham Elementary Kindergartners",
        "Description": "Kindergarten children describe the likenesses and differences among themselves.",
        "Category": " Education , General",
        "Publisher": "Scholastic Inc.",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Zeely Zebra: Long Vowel e (Let's Read Together ®)",
        "Authors": "By Derubertis, Barbara and Vagreti Cockrille, Eva (ILT)",
        "Description": "Although she is not the biggest or strongest or fastest zebra, Zely practices very hard, with the help of Speedy Cheetah, and wins a spot on the Zebra All Star Racing Team.",
        "Category": " Juvenile Fiction , Sports & Recreation , General",
        "Publisher": "Kane Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Going to Extremes",
        "Authors": "By McGinniss, Joe",
        "Description": "An account of life in today's Alaska takes in whites, Eskimos, and Native Indians, cities, towns, and wilderness, industry and trapping, and the idiosyncracies, dangers, vastness, and wonders of America's last frontier",
        "Category": " Social Science , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "And You Thought It Was All Over!",
        "Authors": "By Gross, Zenith Henkin",
        "Description": "Based on a groundbreaking study of nearly five hundred women, this book examines the problems in the relationships between mothers and their grown children, with a special chapter on how fathers influence second-stage mothering",
        "Category": " Social Science , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "OUR CHILDREN ARE WATCHING",
        "Authors": "By Collins, Susan",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Barrytown/Station Hill Press, Inc.",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Bathtime for Biscuit (My First I Can Read)",
        "Authors": "By Capucilli, Alyssa Satin and Schories, Pat (ILT)",
        "Description": "For fans of Clifford and Spot, welcome everybody’s favorite little yellow puppy, Biscuit, in an I Can Read adventure!Woof, woof! Biscuit needs a bath!Everything is ready for Biscuit's bath; everything except Biscuit! He wants to roll in the mud and play with his friend Puddles! Will Biscuit ever be clean? Join Biscuit in this bathtime fun-filled adventure.Bathtime for Biscuit, a My First I Can Read book, is carefully crafted using basic language, word repetition, sight words, and sweet illustrations—which means it's perfect for shared reading with emergent readers.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Dudley Finds His Home (Adventures of Dudley the Dragon)",
        "Authors": "By Galatis, Alex",
        "Description": "The first book in a new series based on the popular Canadian television show follows the eight-foot-tall Dudley Dragon as he searches for a new home, while offering readers gentle instruction on how to preserve nature. Original. TV tie-in.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Survivor: The True Story of the Sinking of the Doggerbank",
        "Authors": "By Herlin, Hans and Brownjohn, John (TRN)",
        "Description": "In March, 1943, a rusty cargo ship of erratic pedigree was torpedoed and sunk off the Azores on her way back to Germany from the Far East. The survivors naturally assumed that they had fallen victim to an allied submarine, but they were wrong.U-boat commander Hans-Joachim Schwantke had had an unlucky war and was desperate to open his score. Assuming, on scant evidence, that the Doggerbank was an allied ship he sent her to the bottom and then turned away from the survivors, in all probability by now aware that he had made a tragic mistake and anxious to escape from the evidence. But the evidence remained, in the shape of just one man. Of the 365 men on board, alone of those who survived the sinking and managed to reach a life raft or dinghy only Fritz Kuert was to survive to tell his tale.Thanks to Hans Herlin's research, and the translating skills of John Brownjohn, the amazing story of Kuert's journey across the Atlantic, of his rescue and his vain struggle to establish the truth has at last been told.",
        "Category": " History , General",
        "Publisher": "Naval Institute Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Circle of Blue",
        "Authors": "By Stabenfeldt Incorporated",
        "Description": "",
        "Category": "",
        "Publisher": "Stabenfeldt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1833"
        }
    },
    {
        "Title": "The Customer Approved Small Business: Success Secrets For Developing Your Small Business",
        "Authors": "By Schell, Michael",
        "Description": "",
        "Category": " Business & Economics , Consumer Behavior",
        "Publisher": "Approved Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Snowman's Christmas",
        "Authors": "By Parent, Nancy",
        "Description": "",
        "Category": "",
        "Publisher": "Paradise Press",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Story of Johnny Appleseed",
        "Authors": "By Aliki",
        "Description": "",
        "Category": "",
        "Publisher": "The Trumpet Club",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Getting Started in Theatre (NTC: LANGUAGE ARTS)",
        "Authors": "By McGraw-Hill (COR)",
        "Description": "",
        "Category": " Performing Arts , Theater , General",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Don't Get Too Comfortable: The Indignities of Coach Class, The Torments of Low Thread Count, The Never- Ending Quest for Artisanal Olive Oil, and Other First World Problems",
        "Authors": "By Rakoff, David",
        "Description": "A bitingly funny grand tour of our culture of excess from an award-winning humorist.Whether David Rakoff is contrasting the elegance of one of the last flights of the supersonic Concorde with the good-times-and-chicken-wings populism of Hooters Air; working as a cabana boy at a South Beach hotel; or traveling to a private island off the coast of Belize to watch a soft-core video shoot—where he is provided with his very own personal manservant—rarely have greed, vanity, selfishness, and vapidity been so mercilessly skewered. Somewhere along the line, our healthy self-regard has exploded into obliterating narcissism; our manic getting and spending have now become celebrated as moral virtues. Simultaneously a Wildean satire and a plea for a little human decency, Don’t Get Too Comfortable shows that far from being bobos in paradise, we’re in a special circle of gilded-age hell.",
        "Category": " Social Science , Essays",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "I’m Too Young to Be This Old!",
        "Authors": "By Smith, Patricia and Smith, Poppy",
        "Description": "What woman hasn't looked in the mirror and wondered who was staring back at her? Or gasped at how grown up her children look? Or puzzled at how her friends are aging prematurely? I'm Too Young to Be This Old shows women how to face their changing lives with a spirit of fun and fearlessness. With plenty of humor, it leads them through both the lighter side of midlife and the deeper issues that concern them, including erratic emotions, wondering if the best of life is over, changes in health and appearance, aging parents, reentry into the workplace, and more.",
        "Category": " Religion , Inspirational",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Coat of Varnish",
        "Authors": "By Snow, C. P.",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "February",
            "Year": "1979"
        }
    },
    {
        "Title": "World War II Quiz and Fact Book",
        "Authors": "By Benford, Timothy B.",
        "Description": "Gathers information about code names, famous quotations, the land war, naval and aerial operations, historic dates, and important leaders",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Murder in the House",
        "Authors": "By Truman, Margaret",
        "Description": "Congressman Latham has maintained an impeccable record in Washington, and so he seems the logical choice when nominated by his friend, President Scott, to become the next secretary of state. His confirmation hearings appear to be a formality until rumors emerge of sexual misconduct and influence peddling. Then, early one morning, he is found shot to death, an apparent suicide.Nobody close to Paul Latham believes his demise a suicide; there are just too many questions left unanswered. Why would he kill himself, and why would he do it in a public place? Why was there no suicide note? Where did he get the gun? Where is Latham's appointment secretary, Marge Edwards? So Latham's close friend lawyer-professor Mackensie Smith goes about uncovering the truth. In the process he unearths connections to the CIA, businessman Warren Brazier, Russian communists, and a shady private detective. Eventually Smith's own life is threatened, leading him to a dramatic and shocking truth.Murder in the House is a story about the webs of influence people weave to protect their interests, and about those innocent people who, by accident or design, get caught in these webs. It is the story of the abuse of power for personal gain, and of the increasing influence that the global economy has on the way our nation is being run.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Bunny Hop (Little Golden Book)",
        "Authors": "By Albee, Sarah and Swanson, Maggie (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Stuart Finds His Way Home (Stuart-Little)",
        "Authors": "By Richards, Kitty and Bracken, Carolyn (ILT)",
        "Description": "Chased AwayWhen the Littles bring their new son home, their cat, Snowbell, tries to eat him. After all, Stuart is a mouse, not a person. And Snowbell doesn't like the idea of a mouse ordering him around. So he and the neighborhood cats trick Stuart into leaving the Littles. Stuart goes far away, but realizes he misses his family. Will Stuart ever make it back home?",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Not Now! Said the Cow (Bank Street, Level 2)",
        "Authors": "By Oppenheim, Joanne and Demarest, Chris L.",
        "Description": "In this story based on \"The Little Red Hen,\" a little black crow asks his animal friends to help with the planting of some corn seed",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Bank Street",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    }
]