[
    {
        "Title": "Loving Someone Gay",
        "Authors": "By Clark, Donald H.",
        "Description": "Discusses current attitudes toward gay men and women describes what it is like to be a homosexual, and offers advice on how to handle the news that a son, daughter, friend, or relative is gay",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Hofmekler's People",
        "Authors": "By Hofmekler, Ori",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Hopi Kachinas: The Complete Guide to Collecting Kachina Dolls",
        "Authors": "By Wright, Barton",
        "Description": "Recently updated, Hopi Kachinas: The Complete Guide to Collecting Kachina Dolls continues to be the best-selling book for identifying and collecting Kachinas. In this comprehensive guide, Barton Wright identifies over 150 dolls, ranging from the more traditional style of dolls to the new ultra-realistic style. Also included are detailed descriptions of the dolls and invaluable buying tips. Whether you are novice or an experienced collector, this book is a must-have for anyone interested in Kachina dolls.",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "Northland Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "Other Worlds: A Beginners Guide to Planets and Moons",
        "Authors": "By Dickinson, Terence",
        "Description": "What are other planets like? Do they have air and clouds? Water and rocks? Could we walk on the moons of Saturn? Are there planets orbiting around other stars?    Using colorfully dramatic but scientifically accurate illustrations, as well as the latest spacecraft and Hubble Space Telescope portraits of other worlds, Terence Dickinson answers these questions and more in Other Worlds, a fact- and fun-filled tour of the solar system's 9 planets, their 61 known moons and the suspected planets of other stars in our galaxy.    Stand on the rim of a Martian canyon, watch solar systems being born, visit a sulfur-spewing volcano on Jupiter's moon Io (pronounced EYE-oh), plunge into the red atmosphere of Saturn's moon Titan and gaze at the swirling su! rface of a brown dwarf. Travel with award-winning astronomy writer Dickinson on this gigantic odyssey on Other Worlds, his latest book for young            readers.",
        "Category": " Juvenile Nonfiction , Technology , Aeronautics, Astronautics & Space Science",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "A treatise on the law of master and servant,: Including therein masters and workmen in every description of trade and occupation; with an appendix of statutes",
        "Authors": "By Smith, Charles Manley",
        "Description": "",
        "Category": "",
        "Publisher": "T. & J.W. Johnson",
        "Price Starting With ($)": "211.57",
        "Publish Date": {
            "Month": "January",
            "Year": "1852"
        }
    },
    {
        "Title": "Elizabeth and the archdeacon,",
        "Authors": "By Birmingham, George A",
        "Description": "",
        "Category": "",
        "Publisher": "Bobbs-Merrill Company",
        "Price Starting With ($)": "14.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1933"
        }
    },
    {
        "Title": "Carl Sandburg",
        "Authors": "By Golden, Harry",
        "Description": "",
        "Category": "",
        "Publisher": "World Pub. Co",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Fraternal and other addresses,",
        "Authors": "By Sheppard, Morris",
        "Description": "",
        "Category": "",
        "Publisher": "The Beacon Press",
        "Price Starting With ($)": "10.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1914"
        }
    },
    {
        "Title": "Moods",
        "Authors": "By Alcott, Louisa May",
        "Description": "",
        "Category": "",
        "Publisher": "Loring",
        "Price Starting With ($)": "13.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1864"
        }
    },
    {
        "Title": "Conversations with the Fat Girl",
        "Authors": "By Palmer, Liza",
        "Description": "Everyone seems to be getting on with their lives except Maggie.  At 26, she's still serving coffee at The Beanery Coffee House, while her friends are getting married, having babies, and having real careers.  Even Olivia, Maggie's best friend from childhood, is getting married to the doctor with whom she lives.  Maggie's roommate?  Her dog Solo (his name says it all). The man in Maggie's life?  Well there isn't one, except the guy she has a crush on, Domenic, who works with her at the coffee shop as a bus boy.Maggie and Olivia have been best friends since they were in grade school.  Both fatties, they befriended each other when no one else would.  Now grown-up, Maggie is still shopping in the \"women's section\" while Olivia went and had gastric-bypass surgery in search of the elusive size 2, the holy grail for girls everywhere.  So now Olivia's thin and blonde and getting married, and Maggie's the fat bridesmaid. Ain't life grand? In this wonderful debut novel that is sure to remind readers of Jennifer Weiner's Good In Bed, Liza Orr is both witty and wise, giving voice to women everywhere who wish for just once that they could forget about their weight.",
        "Category": " Fiction , Women",
        "Publisher": "5 Spot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Like Water For Chocolate",
        "Authors": "By Esquivel, Laura, Christensen, Carol, and Christensen, Thomas",
        "Description": "Despite the fact that she has fallen in love with a young man, Tita, the youngest of three daughters born to a tyrannical rancher, must obey tradition and remain single and at home to care for her mother. Reprint. Movie tie-in.",
        "Category": " Fiction , General",
        "Publisher": "Anchor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Silver Fang, The",
        "Authors": "By Gray, Tamara",
        "Description": "",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "New Concepts Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Advances in Epileptology: Xth Epilepsy International Symposium",
        "Authors": "By R. Naquet, R.L. Masland, A.B. Scheibel, R.J. Porter, R.H. Mattson, H. Booker, R.D. Rafal, Et Al",
        "Description": "",
        "Category": "",
        "Publisher": "Raven Press, New York",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Sex, Art, and American Culture: Essays",
        "Authors": "By Paglia, Camille",
        "Description": "In a new collection of essays, the anti-feminist and author of Sexual Personae shares her observations on date rape, sexual harassment, the decline of education, culture, and other key issues. Original. 50,000 first printing. $50,000 ad/promo. Tour.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Modern Structured Analysis",
        "Authors": "By Yourdon, Edward",
        "Description": "Yourdon provides a fresh perspective on structured systems  analysis, integrating traditional methodologies with modern  technology. He thoroughly discusses data modeling, real-time  systems, prototyping, and 4GLs.N",
        "Category": " Computers , Software Development & Engineering , Systems Analysis & Design",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Science Wizardry for Kids",
        "Authors": "By Kenda, Margaret and Williams, Phyllis S.",
        "Description": "More than 200 safe, fun, easy-to-perform experiements teach kids basic concepts of physics and chemistry. Experiments deal with the environment, with fooling the senses, and magic tricks with colors and light. Amusing illustrations throughout.",
        "Category": " Juvenile Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Creating the Work You Love: Courage, Commitment, and Career",
        "Authors": "By Jarow, Rick",
        "Description": "In this unique and provocative look at work, career counselor Rick Jarow argues for a return to the concept of vocation--finding a \"calling\" instead of a job. Traditional career guides inventory the individual skills, talents, and abilities that correlate to specific existing jobs. Creating the Work You Love presents a unique alternative approach, using self-reflective exercises based on the seven chakras, to help you determine the elements you need to create a life filled with meaning and purpose.Jarow believes that it is possible to live and act from the most authentic part of oursleves, and to express our strongest values, energies, and talents through our work in the world. Concentrating on the attributes associated with each of the body's energy centers, or chakras, Dr. Jarow helps us form a bridge between our personal priorities and the external activities of the work world. Once this bridge is established, strategies are developed to find a career that nourishes all aspects of our lives.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Destiny Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "The heritage of Asia,",
        "Authors": "By Saunders, Kenneth J",
        "Description": "",
        "Category": "",
        "Publisher": "The MacMillan Company",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1932"
        }
    },
    {
        "Title": "Monday the Rabbi Took Off (A Rabbi Small Mystery)",
        "Authors": "By Kemelman, Harry",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest",
        "Price Starting With ($)": "6.75",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Sundered soul: A mythic tale",
        "Authors": "By Tella, Alfred",
        "Description": "",
        "Category": "",
        "Publisher": "Three Continents Press",
        "Price Starting With ($)": "14.75",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Chess Reader",
        "Authors": "By Salzmann, Jerome",
        "Description": "",
        "Category": "",
        "Publisher": "Greenberg",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "British and American sporting authors,: Their writings and biographies",
        "Authors": "By Higginson, A. Henry",
        "Description": "",
        "Category": "",
        "Publisher": "Blue Ridge Press",
        "Price Starting With ($)": "19.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "Constantino Brumidi,: Michelangelo of the United States Capitol",
        "Authors": "By Murdock, Myrtle Cheney",
        "Description": "",
        "Category": "",
        "Publisher": "Monumental Press",
        "Price Starting With ($)": "29.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Take off ten years in 10 weeks",
        "Authors": "By Wills, Judith",
        "Description": "In 24 workshops - ranging from hour-long assessment sessions to lessons designed to last a lifetime - discover how to evaluate and take control of your size, weight, and shape - including a body-wise eating plan and exercises for muscle tone and flexibility; the fundamentals of personal care and beauty, with advice on makeup, hairstyling, and selecting a flattering wardrobe; guidelines for renewing your energy by learning smart time management, proper eating habits, and stress reduction techniques; ideas for stretching your mind - from exploring educational opportunities to pursuing new hobbies; and innovative ways to get more pleasure out of your personal relationships.",
        "Category": " Health & Fitness , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "THE REVOLUTION WILL NOT BE TELEVISED: Democracy, the Internet, and the Overthrow of Everything",
        "Authors": "By Trippi, Joe",
        "Description": "Joe Trippi's campaign for Howard Dean marked a quantum leap in how the Internet could be used to shake up politics and empower Americans歯w Trippi reveals how technology can harness the power of the people in every sector. When Joe Trippi signed on to manage Howard Dean's 2004 presidential campaign, the long shot candidate had 432 known supporters and $100,000 in the bank. Within a year, Trippi and his energetic but inexperienced team had transformed the most obscure horse in the field into a frontrunner, creating a groundswell of 640,000 people and raising more money than any Democrat in history–more than $50 million–most through donations of $100 or less. This is the story of how Trippi's revolutionary use of the Internet and an impassioned, contagious desire to overthrow politics as usual grew into a national grassroots movement and changed the face of politics forever. But it's more than that. It's also about how to engage Americans in a real dialogue, how business leaders, government leaders and anyone can make use of the most revolutionary idea to come along since man first learned to light a fire. No . . . not the Internet. Or computers. Or telecommunications. Democracy. Joe Trippi explains how汩ght now戮ternet democracy is transforming every aspect of American life, by evenly distributing power. He reveals innovations that are on the horizon, which companies are poised to become first–movers in this new era, and which are in danger of being left behind. From his behind–the–scenes look at Dean's shocking rise and fall to his ⲥven inviolable, irrefutable, ingenious things your business or institution or candidate can do in the age of the Internet that might keep you from getting your ass kicked but then again might not,⟊oe Trippi offers an inspiring glimpse of the world we are becoming. And he shows how power, in the hands of all of us, changes everything.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Designing the User Interface: Strategies for Effective Human-Computer Interaction",
        "Authors": "By Shneiderman, Ben",
        "Description": "",
        "Category": "",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "40-30-30 Fat Burning Nutrition: The Dietary Hormonal Connection to Permanent Weight Loss and Better Health",
        "Authors": "By Daoust, Joyce and Daoust, Gene",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Wharton Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Patient Heal Thyself",
        "Authors": "By Rubin, Jordan",
        "Description": "",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Freedom Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Sloop Of War",
        "Authors": "By Alexander Kent",
        "Description": "",
        "Category": "",
        "Publisher": "Arrow Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Howard Hughes: The Untold Story",
        "Authors": "By Brown, Peter Harry and Broeske, Pat H.",
        "Description": "Howard Hughes was one of the most amazing, intriguing, and controversial figures of the twentieth century. He was the billionaire head of a giant corporation, a genius inventor, an ace pilot, a matinee-idol-handsome playboy, a major movie maker who bedded a long list of Hollywood glamour queens, a sexual sultan with a harem of teenage consorts, a political insider with intimate ties to Watergate, a Las Vegas kingpin, and ultimately a bizarre recluse whose final years and shocking death were cloaked in macabre mystery. Now he is the subject of Martin Scorsese's biopic The Aviator. Few people have been able to penetrate the wall of secrecy that enshrouded this complex man. In this fascinating, revelation-packed biography, the full story of one of the most daring, enigmatic, and reclusive power brokers America has ever known is finally told.",
        "Category": " Performing Arts , Film , Direction & Production",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Reading Lolita in Tehran: A Memoir in Books",
        "Authors": "By Nafisi, Azar",
        "Description": "Every Thursday morning for two years in the Islamic Republic of Iran, a bold and inspired teacher named Azar Nafisi secretly gathered seven of her most committed female students to read forbidden Western classics. As Islamic morality squads staged arbitrary raids in Tehran, fundamentalists seized hold of the universities, and a blind censor stifled artistic expression, the girls in Azar Nafisi’s living room risked removing their veils and immersed themselves in the worlds of Jane Austen, F. Scott Fitzgerald, Henry James, and Vladimir Nabokov. In this extraordinary memoir, their stories become intertwined with the ones they are reading. Reading Lolita in Tehran is a remarkable exploration of resilience in the face of tyranny and a celebration of the liberating power of literature.",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Emergency First Aid for Your Cat",
        "Authors": "By Shearer, Tamara S.",
        "Description": "",
        "Category": "",
        "Publisher": "Ohio Distinctive Pub",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Hope and Glory",
        "Authors": "By Boorman, John",
        "Description": "",
        "Category": " Performing Arts , General",
        "Publisher": "Faber & Faber",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "A Million Little Pieces",
        "Authors": "By Frey, James",
        "Description": "At the age of twenty-three, James Frey woke up on a plane to find his four front teeth had been knocked out. His nose was broken and there was a hole through his cheek. He had no idea where the plane was headed or what had happened over the preceding two weeks. He had been an alcoholic for ten years and a crack addict for three. When he checked into a treatment facility shortly thereafter, he was told he could either stop using or die before he reached twenty-four.A Million Little Pieces is Frey’s acclaimed account of his six weeks in rehab; fiercely honest and deeply affecting, it is one of the most graphic and immediate books ever to be written about addiction and recovery.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Gilbert and Sullivan: The Official D'Oyly Carte Picture History",
        "Authors": "By Wilson, Robin J. and Lloyd, Frederic",
        "Description": "Celebrates each of the twelve major operas as they have been produced over the years, complete with photographs, drawings, paintings, posters, and review clippings",
        "Category": "",
        "Publisher": "Alfred A. Knopf, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Understanding Movies",
        "Authors": "By Giannetti, Louis",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Geography For Fun Projects",
        "Authors": "By Kenyon, Tony (ILT) and Robson, Pam",
        "Description": "Provides instructions for experiments, projects, puzzles, and other hands-on activities that explore maps, the moving surface of the Earth, rivers and seas, ecosystems, human geography, agriculture, and other geographical topics.",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Copper Beech",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Night and Hope",
        "Authors": "By Lustig, Arnost",
        "Description": "",
        "Category": "",
        "Publisher": "University of Iowa",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Build-It-Better-Yourself Country Furniture",
        "Authors": "By Family Handyman (EDT)",
        "Description": "Provides instructions and plans for building woodboxes, shelves, spice cabinets, plate racks, sewing boxes, stools, pegboard rails, mirrors, bookcases, wardrobes, chests, dry sinks, chairs, benches, beds, desks, and tables",
        "Category": " Technology & Engineering , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Physics for Scientists and Engineers: With Modern Physics (Saunders golden sunburst series)",
        "Authors": "By Serway, Raymond A.",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Houghton Mifflin Harcourt School",
        "Price Starting With ($)": "8.06",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "The Templar Revelation: Secret Guardians of the True Identity of Christ",
        "Authors": "By Picknett, Lynn and Prince, Clive",
        "Description": "THE MOST CLOSELY GUARDED SECRET OF THE WESTERN WORLD IS ABOUT TO BE REVEALED -- AND YOU WILL NEVER SEE CHRISTIANITY IN THE SAME LIGHT AGAIN.  In a remarkable achievement of historical detective work that is destined to become a classic, authors Lynn Picknett and Clive Prince delve into the mysterious world of the Freemasons, the Cathars, the Knights Templar, and the occult to discover the truth behind an underground religion with roots in the first century that survives even today. Chronicling their fascinating quest for truth through time and space, the authors reveal an astonishing new view of the real motives and character of the founder of Christianity, as well as the actual historical -- and revelatory -- roles of John the Baptist and Mary Magdalene. Painstakingly researched and thoroughly documented, The Templar Revelation presents a secret history, preserved through the centuries but encoded in works of art and even in the great Gothic cathedrals of Europe, whose final chapter could shatter the foundation of the Christian Church.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Teen Beauty Secrets: Fresh, Simple & Sassy Tips for Your Perfect Look",
        "Authors": "By Irons, Diane",
        "Description": "Hot tips for a fresh look...all on your budget!Teen Beauty Secrets is loaded with fashion tips and techniques to fit your life and to help you look and feel absolutely extraordinary, from weekend shopping and classroom flirting to posing for prom pictures.This must-have guide gives you the edge you need to handle every fashion emergency, including breakouts, bad hair days, makeup mishaps and wardrobe calamities. Learn to fill your closet with all the \"right\" pieces, apply makeup for an all-day, glowing look and keep your friends (and parents) impressed with your attitude and style!Fashion and beauty expert Diane Irons knows all the inside secrets that have kept celebrity teens looking fresh and fantastic. Without breaking the bank, she'll show you how to:--Mix old and new for your winning style--Use baking soda to clear up blemishes--Enjoy spa treatments without leaving the house--And much, much more!",
        "Category": " Young Adult Nonfiction , Health & Daily Living , Beauty & Grooming",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "On the Bright Side, I'm Now the Girlfriend of a Sex God: Further Confessions of Georgia Nicolson",
        "Authors": "By Rennison, Louise",
        "Description": "5:35 p.m.Oh yippee.This is my gorgeous life:I haven't been kissed for a month; my snogging skills will be gone soon.(2) I have a HUGE nose that means I have to live for ever in the Ugly Home.Address:Georgia NicolsonUgly HomeUgly KingdomUgly Universe (3) My Red Herring plan has failed. (4) I am the Bummer Twins' armchair.Georgia Nicolson is back!The irrepressible heroine of Angus, Thongs and Full-Frontal Snogging has just started dating the Sex God ( aka Robbie).  So life should be perfect .... except in Georgia's life, nothing is ever perfect.Readers will be laughing ( and groaning!) out loud all through this \"fabbity-fab-fab\" sequel!",
        "Category": " Young Adult Fiction , Humorous , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "If you don't know where you're going, you'll probably end up somewhere else",
        "Authors": "By Campbell, David P.",
        "Description": "A psychologist discusses the importance of choosing career goals that are in line with individual preferences, abilities, and lifestyles",
        "Category": "",
        "Publisher": "Argus Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "101 Lies Men Tell Women -- And Why Women Believe Them",
        "Authors": "By Hollander, Dory",
        "Description": "‘I’ll call you.’ ‘I love you.’ I’ll be home in 20 minutes.’ ‘No, I don’t think your thighs are too big.’ ‘I’m going to leave my wife.’From first date deception to martial dishonesty to last-ditch efforts to evade detection, 101 Lies Men Tell Women exposes the extraordinary diverse lies that invade male/female relationships and destroy trust.What do men tend to lie about? Why do they feel the need to life? Dr. Dory Hollander offers rare insight into the most prevalent lies and the often startling reasons why men tell them.Based on the provocative findings of her research, Dr. Hollander also shows why women are more vulnerable to certain types of lies that others, while helping the reader to understand the dynamics of deception. Learn how men use the lies as a means of both attracting and distancing themselves from the women in their lives and how this affects the women who love them.Filled with highly amusing, as well as emotionally wrenching stories from the men and women in Dr. Hollander’s study, 101 Lies Men Tell Women captivates and enlightens with original quizzes and exercises for decoding – men’s words and actions.A self-defense manual for women who, until now, have had little understanding of, and even less protection against, the well-told lie.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "HISTORY OF THE INVASION AND CAPTURE OF WASHINGTON and of the Events Which Preceded and Followed.",
        "Authors": "By John S. Williams",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Brothers",
        "Price Starting With ($)": "90.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1857"
        }
    },
    {
        "Title": "The politics of revenue sharing",
        "Authors": "By Dommel, Paul R.",
        "Description": "",
        "Category": "",
        "Publisher": "Indiana University Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "I Thought My Father Was God: And Other True Tales from NPR's National Story Project",
        "Authors": "By Auster, Paul (EDT), Reifler, Nelly (EDT), and National Story Project (U. S.) (COR)",
        "Description": "02 One of America's foremost writers collects the best stories submitted to NPR's popular monthly show--and illuminates the powerful role storytelling plays in all our livesWhen Paul Auster and NPR's Weekend All Things Considered introduced The National Story Project, the response was overwhelming. Not only was the monthly show a critical success, but the volume of submissions was astounding. Letters, emails, faxes poured in on a daily basis- more than 4,000 of them by the time the project celebrated its first birthday. Everyone, it seemed, had a story to tell.I Thought Mmy Father Wwas God gathers 180 of these personal, true-life accounts in a single, powerful volume. They come from people of all ages, backgrounds, and walks of life. Half of the contributors are men; half are women. They live in cities, suburbs, and rural areas, and they come from 42 different states. Most of the stories are short, vivid bits of narrative, combining the ordinary and the extraordinary, and most describe a single incident in the writer's life. Some are funny, like the story of how a Ku Klux Klan member's beloved dog rushed out into the street during the annual KKK parade and unmasked his owner as the whole town looked on. Some are mysterious, like the story of a woman who watched a white chicken walk purposefully down a street in Portland, Oregon, hop up some porch steps, knock on the door-and calmly enter the house. Many involve the closing of a loop, like the one about the woman who lost her mother's ashes in a burglary and recovered them five years later from the mortuary of a local church.Hilarious blunders, wrenching coincidences, brushes with death, miraculous encounters, improbable ironies, premonitions, sorrows, pains, dreams-this singular collection encompasses an extraordinary range of settings, time periods, and subjects. A testament to the important role storytelling plays in all our lives, I Thought My Father Was God offers a rare glimpse into the American soul.  One of America's foremost writers collects the best stories submitted to NPR's popular monthly show--and illuminates the powerful role storytelling plays in all our livesWhen Paul Auster and NPR's Weekend All Things Considered introduced The National Story Project, the response was overwhelming. Not only was the monthly show a critical success, but the volume of submissions was astounding. Letters, emails, faxes poured in on a daily basis- more than 4,000 of them by the time the project celebrated its first birthday. Everyone, it seemed, had a story to tell.I Thought Mmy Father Wwas God gathers 180 of these personal, true-life accounts in a single, powerful volume. They come from people of all ages, backgrounds, and walks of life. Half of the contributors are men; half are women. They live in cities, suburbs, and rural areas, and they come from 42 different states. Most of the stories are short, vivid bits of narrative, combining the ordinary and the extraordinary, and most describe a single incident in the writer's life. Some are funny, like the story of how a Ku Klux Klan member's beloved dog rushed out into the street during the annual KKK parade and unmasked his owner as the whole town looked on. Some are mysterious, like the story of a woman who watched a white chicken walk purposefully down a street in Portland, Oregon, hop up some porch steps, knock on the door-and calmly enter the house. Many involve the closing of a loop, like the one about the woman who lost her mother's ashes in a burglary and recovered them five years later from the mortuary of a local church.Hilarious blunders, wrenching coincidences, brushes with death, miraculous encounters, improbable ironies, premonitions, sorrows, pains, dreams-this singular collection encompasses an extraordinary range of settings, time periods, and subjects. A testament to the important role storytelling plays in all our lives, I Thought My Father Was God offers a rare glimpse into the American soul.",
        "Category": " Literary Collections , General",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "First Films: Illustrious, Obscure, and Embarrassing Movie Debuts",
        "Authors": "By Bernard, Jami",
        "Description": "Chronicles the first screen appearances of more than one hundred actors and directors, including Kevin Costner's inauspicious debut in Sizzle Beach, USA, Julia Roberts's uninspiring Blood Red, and Al Pacino's electrifying cameo in  Me, Natalie. Original.",
        "Category": "",
        "Publisher": "Citadel Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "A Rumor of Distant Tribes: A Novel of Innermost Africa",
        "Authors": "By Jeffers, Eugene",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Ariadne Press",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Fresh Start: Great Low-Fat Recipes, Day-by-Day Menus--The Savvy Way to Cook, Eat, and Live",
        "Authors": "By Rosso, Julee and Hoffman, Annie (ILT)",
        "Description": "A lively, healthful compendium of more than two hundred no-fuss, low-fat recipes, organized into four weeks of daily menus, is accompanied by tips on nutrition, ingredients, cooking techniques, and more. By the author of Great Good Food. Tour.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Mayo Clinic Heart Book, Revised Edition: The Ultimate Guide to Heart Health",
        "Authors": "By Gersh, Bernard J. (EDT)",
        "Description": "Mayo Clinic has the answers people want, as their highly successful books prove--Mayo Clinic Family Health Book has sold more than one million copies worldwide since 1990. Now Mayo introduces a completely revised and updated edition of Mayo Clinic Heart Book. Redesigned for easy access and filled with \"Healthy Heart Tips,\" the book includes the latest information on the prevention, diagnosis, and treatment of cardiovascular disease, the number one killer of women as well as men in our country. Advances in minimally invasive surgeries; the risks and benefits of in-the-news topics such as fish oil and margarine; insights about cardiac disease in women; the controversy surrounding appetite suppressants and heart damage; even new horizons in gene therapy are discussed in full, and much more. Mayo Clinic has the answers people want, as their highly successful books prove--Mayo Clinic Family Health Book has sold more than one million copies worldwide since 1990. Now Mayo introduces a completely revised and updated edition of Mayo Clinic Heart Book. Redesigned for easy access and filled with \"Healthy Heart Tips,\" the book includes the latest information on the prevention, diagnosis, and treatment of cardiovascular disease, the number one killer of women as well as men in our country. Advances in minimally invasive surgeries; the risks and benefits of in-the-news topics such as fish oil and margarine; insights about cardiac disease in women; the controversy surrounding appetite suppressants and heart damage; even new horizons in gene therapy are discussed in full, and much more.Mayo Clinic has the answers people want, as their highly successful books prove--Mayo Clinic Family Health Book has sold more than one million copies worldwide since 1990. Now Mayo introduces a completely revised and updated edition of Mayo Clinic Heart Book. Redesigned for easy access and filled with \"Healthy Heart Tips,\" the book includes the latest information on the prevention, diagnosis, and treatment of cardiovascular disease, the number one killer of women as well as men in our country. Advances in minimally invasive surgeries; the risks and benefits of in-the-news topics such as fish oil and margarine; insights about cardiac disease in women; the controversy surrounding appetite suppressants and heart damage; even new horizons in gene therapy are discussed in full, and much more.",
        "Category": " Medical , Reference",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Autocrat of the Breakfast-Table",
        "Authors": "By Holmes, Oliver Wendell",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Akadine Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Beyond Jennifer & Jason, Madison & Montana : What To Name Your Baby Now",
        "Authors": "By Rosenkrantz, Linda and Satran, Pamela Redmond",
        "Description": "The book all new babies want their parents to read--now with the latest predictions, inspiration, and advice.\"In the decade since we've begun writing about names, the world of baby-nbaming has mushroomed from a sleepy little enterprise, with parents naming their children Jennifer and Jason and wondering whether there might be anything more exciting out there, to an adventurous and intelligent and style-conscious activity in which parents investigate everything from their family trees to names from their ancestors' native lands to atlases and even dictionaries that are ever more inventive, individual, and enlightened.\" --Linda Rosenkrantz and Pamela Redmond SatranNo one knows baby names like these two experts--whose first book Beyond Jennifer & Jason predicted back in 1988 that then-obscure place names like Madison were \"so far out they're on their way in\" (They were right too: By 1998, Jennifer had gone from #4 in popularity to #24 and Madison had become the ninth most popular name for baby girls). This is the guide that tells you what you really need to know: which names are hot, which names are not, and which names are on their way up or down. Who cares if \"Cameron\" means \"crooked nose\" in ancient Scottish Gaelic? If you love the name, you want to know whether it's still as right for a boy as for a girl, and if there are going to be five other Camerons in your child's class at school.The brand-new edition of thie groundbreaking book gives you thousands of new choices and the kind of knolwedgeable guidance you won't find anywhere else. There are all-new sections, with all-new research, on naming a girl and naming a boy today, as well as fresh insights into the power of a name to influence your child's life, and lists of the most important styles and trends:Gender bending--names that defy old stereotypesEthnic names--vastly expanded multicultural options to reflect almost any heritageCelebrity baby names--the most comprehensive up-to-date listing of who's naming their baby whatWhat's hot now--plus The Classics: Sixty Traditional Names that Transcend TimeThe book all new babies want their parents to read--now with the latest predictions, inspiration, and advice.\"In the decade since we've begun writing about names, the world of baby-nbaming has mushroomed from a sleepy little enterprise, with parents naming their children Jennifer and Jason and wondering whether there might be anything more exciting out there, to an adventurous and intelligent and style-conscious activity in which parents investigate everything from their family trees to names from their ancestors' native lands to atlases and even dictionaries that are ever more inventive, individual, and enlightened.\" --Linda Rosenkrantz and Pamela Redmond SatranNo one knows baby names like these two experts--whose first book Beyond Jennifer & Jason predicted back in 1988 that then-obscure place names like Madison were \"so far out they're on their way in\" (They were right too: By 1998, Jennifer had gone from #4 in popularity to #24 and Madison had become the ninth most popular name for baby girls). This is the guide that tells you what you really need to know: which names are hot, which names are not, and which names are on their way up or down. Who cares if \"Cameron\" means \"crooked nose\" in ancient Scottish Gaelic? If you love the name, you want to know whether it's still as right for a boy as for a girl, and if there are going to be five other Camerons in your child's class at school.The brand-new edition of thie groundbreaking book gives you thousands of new choices and the kind of knolwedgeable guidance you won't find anywhere else. There are all-new sections, with all-new research, on naming a girl and naming a boy today, as well as fresh insights into the power of a name to influence your child's life, and lists of the most important styles and trends:Gender bending--names that defy old stereotypesEthnic names--vastly expanded multicultural options to reflect almost any heritageCelebrity baby names--the most comprehensive up-to-date listing of who's naming their baby whatWhat's hot now--plus The Classics: Sixty Traditional Names that Transcend Time",
        "Category": " Family & Relationships , Baby Names",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Better Health Cookbook (Delicious Recipes Low in Fat,High in Nutrients, Waterles",
        "Authors": "By Knight, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Vita Craft",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Tell Me a Riddle",
        "Authors": "By Olsen, Tillie",
        "Description": "Four short stories set in the United States are concerned with the suffering and tragedy in human existence",
        "Category": " Fiction , General",
        "Publisher": "Laurel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1976"
        }
    },
    {
        "Title": "Changed Hearts: The Solution to America's Crime Problem",
        "Authors": "By Charles Colson",
        "Description": "",
        "Category": "",
        "Publisher": "Prison Feellowship Ministries",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "No cause for panic",
        "Authors": "By Baker, Russell",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Die for Love",
        "Authors": "By Peters, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Congdon & Weed",
        "Price Starting With ($)": "32.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Approach to Greek Art",
        "Authors": "By Seltman, Charles Theodore",
        "Description": "",
        "Category": "",
        "Publisher": "E. P. Dutton & Co., Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Polynesians Explorers of the Pacific",
        "Authors": "By Weckler, J. E.",
        "Description": "",
        "Category": "",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1943"
        }
    },
    {
        "Title": "Sand (Scientific American Library)",
        "Authors": "By Siever, Raymond",
        "Description": "Explains how sand is formed, describes its role in geological processes, and discusses sandstone, sand dunes, beaches, and sand as a raw material",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Dark Romance of Dian Fossey",
        "Authors": "By Hayes, Harold T. P.",
        "Description": "Traces the remarkable life of the controversial primatologist, detailing her relationship with Louis Leakey, her stormy experiences in defending the gorillas she studied, and the circumstances surrounding her brutal, still unsolved murder",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Mrs. Wiggs Of The Cabbage Patch",
        "Authors": "By Alice Hegan Rice",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman Publishing Company",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Rex Barney's Thank Youuuu for 50 Years in Baseball from Brooklyn to Baltimore",
        "Authors": "By Macht, Norman L. and Barney, Rex",
        "Description": "September 26, 1981, millions of viewers watched on NBC television as Nolan Ryan pitched his fifth no-hitter. Late in the game, commentator Tony Kubek asked Joe Garagiola, \"Did you ever see anybody throw faster than Nolan Ryan?\"Without hesitating, Joe replied, \"Sure. Rex Barney.\"Joe Garagiola contributes the foreword for this story of Rex Barney, the man who threw faster than Feller, faster than Ryan; whose pitching career sped by quicker than his fastball because he could not control it. Barney became a legend as part of the most exciting era of the Brooklyn Dodgers - 1943 to 1951 - when Jackie Robinson came in and Leo Durocher switched to the hated New York Giants. Two months after Leo's departure, Barney no-hit the Giants in the Polo Grounds.In his own inimitable style, Rex tells the story of his battle to control his fastball and, later, his own life, and his struggles to overcome illness and a near-fatal stroke. Along the way, Rex takes the reader into dugouts, clubhouses, and broadcast booths to meet many of the managers, stars, and scrubinis he has known during his fifty years in baseball.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Tidewater",
        "Price Starting With ($)": "14.55",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Basic Practice of Statistics",
        "Authors": "By Moore, David S.",
        "Description": "",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "W. H. Freeman",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Baby Einstein: 365 Days of Baby Einstein",
        "Authors": "By Zaidi, Nadeem (ILT), Kelman, Marcy, and Aigner-Clark, Julie",
        "Description": "Take baby on a multisensory adventure with 365 Days of Baby Einstein, a collection of stimulating learning experiences designed to enhance verbal acquisition, nurture concept development, and promote a lifetime love of learning. Playful, baby-friendly text, charming illustrations, and real-life photography encourage interactivity between parent and child and create one-on-one learning discoveries in language, art, and poetry that are sure to make baby squeal with delight.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "On the Farm (Good Old Days)",
        "Authors": "By Ken Tate",
        "Description": "",
        "Category": "",
        "Publisher": "House Of White Birches",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Bicycling Magazine's 900 All-Time Best Tips: Top Riders Share Their Secrets to Maximize Fun, Safety, and Performance",
        "Authors": "By Pavelka, Ed (EDT)",
        "Description": "Jump-start your cycling savvy with this one-stop, information-packed reference. This compilation of knowledge will help you become a better cyclist, even on your very next ride. Top riders share their proven tips, covering every aspect of both road cycling and mountain biking.DISCOVER HOW TO:* Use smart strategies to build your skill level.* Maneuver safely through traffic with ease and authority.* Plan your training year to maximize your potential.* Ride to 100 miles-- and longer.* Quickly spot bike damage after a crash.* Cut costs when touring.* Identify and prevent winter weight gain.",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Healthy Aging: A Lifelong Guide to Your Physical and Spiritual Well-Being",
        "Authors": "By Weil, Andrew",
        "Description": "Spontaneous Healing . . . Eight Weeks to Optimum Health . . . Eating Well for Optimum Health . . . The Healthy Kitchen–in each of his widely acclaimed, best-selling books, Dr. Andrew Weil has been an authoritative and companionable guide through a uniquely effective combination of traditional and nontraditional approaches to health and healthy living. Now he gives us a book about aging that is unlike any other in the breadth and depth of its information and understanding. Hugely informative, practical, and uplifting, it is infused with the engaging candor and common sense that have been the hallmarks of all his books.At the heart of Healthy Aging is Dr. Weil’s belief that although aging is an irreversible process, there are myriad things we can do to keep our minds and bodies in good working order through all phases of life. To that end, he draws on the new science of biogerentology (the biology of aging) as well as on the secrets of healthy longevity– diet, activity, and attitude–that he has gathered firsthand from cultures around the world. In Part One–“The Science and Philosophy of Healthy Aging”–he explains how the body ages, and he explores the impact of gender, genes, environment, and lifestyle on an individual’s experience and perception of the process of aging. He describes the various would-be elixirs of life extension–herbs, hormones, and antiaging “medicines”–separating myth from fact and clearly delineating the difference between the spurious notions of preventing or reversing the process of aging and the real possibilities of inhibiting or delaying the onset of diseases that become more likely as we age. He writes movingly about the ways in which an acceptance of aging can be a significant part of doing it well, and of recognizing and appreciating the great rewards of growing older: depth and richness of experience, complexity of being, serenity, wisdom, and its own kind of power and grace. In Part Two–“How to Age Gracefully”–Weil details an easy-to-implement Anti-inflammatory Diet that will protect the immune system and aid your body in resisting and adapting to the changes that time brings. And he provides extensive practical advice on exercise; preventive health care; stress management; physical, mental, and emotional flexibility; and spiritual enhancement–all of which can help you achieve and maintain the best health throughout the lifelong process of aging.Healthy Aging–a book for people of all ages–is Andrew Weil’s most important and far-reaching book yet.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Ersatz Elevator (A Series of Unfortunate Events, Book 6) (A Series of Unfortunate Events, 6)",
        "Authors": "By Snicket, Lemony and Helquist, Brett (ILT)",
        "Description": "NOW A NETFLIX ORIGINAL SERIESIn their most daring misadventure, the Baudelaire orphans are adopted by very, very rich people, whose penthouse apartment is located mysteriously close to the place where all their misfortune began. Even though their new home in the city is fancy, and the children are clever and charming, I'm sorry to say that still, the unlucky orphans will encounter more disaster and woe.In fact, in this sixth book in A Series of Unfortunate Events, the children will experience a darkened staircase, a red herring, an auction, parsley soda, some friends in a dire situation, a secret passageway, and pinstripe suits.Both literary and irreverent, hilarious and deftly crafted, A Series of Unfortunate Events offers an exquisitely dark comedy in the tradition of Edward Gorey and Roald Dahl. Lemon Snicket's uproariously unhappy books continue to win readers, despite all his warnings.",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.78",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Living Simply in an Anxious World: An Invitation to Perspective",
        "Authors": "By Wicks, Robert J.",
        "Description": "Tells how to lead a simple life through listening, seeing, serving, and experiencing, and suggests ways to experience God through our emotions",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Secret Garden",
        "Authors": "By Burnett, Frances Hodgson and Rust, Graham (ILT)",
        "Description": "After the death of her parents, Mary Lennox, a spoiled, sullen young girl, goes to live with her uncle at Misselthwaite Manor on the Yorkshire moors and discovers a magical world of mystery, friendship, and new life",
        "Category": " Juvenile Fiction , People & Places , Europe",
        "Publisher": "David R. Godine, Publisher",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Minerva Clark Gets a Clue",
        "Authors": "By Karbo, Karen",
        "Description": "Minerva Clark is a typical thirteen-year-old girl: she hates her hair, she hates her legs (which somehow manage to look both too fat and too skinny at the same time), and don't get her started on her gigantor bootie. On top of all this puberty, she's being raised by three older brothers, none of whom really get her. But when a fateful encounter with a lightning storm rewires her sense of self, Minerva Clark becomes anything but a typical teen. With a brazen new attitude and a nose for trouble, Minerva soon finds herself drawn inexplicably to the scene of a murder and determined to track down the killer. If only all the clues weren't pointing so close to someone she knows…",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "Bloomsbury USA Childrens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Great Short Works of the American Renaissance",
        "Authors": "By Willard, Ed. Thorp",
        "Description": "",
        "Category": "",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Children with asthma: A manual for parents",
        "Authors": "By Plaut, Thomas F.",
        "Description": "Written for the millions of parents of children with asthma, this doctor's guide explains the basics of the condition, how asthma medicines work, when to seek help, and how to choose a doctor and addresses common questions and fears",
        "Category": "",
        "Publisher": "Pedipress",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Geological Survey of Ohio Report of Progress in 1870",
        "Authors": "By Newberry, J. S. Et Al.",
        "Description": "",
        "Category": "",
        "Publisher": "Nevins & Myers",
        "Price Starting With ($)": "39.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1871"
        }
    },
    {
        "Title": "No Such Thing as a Bad Day: A Memoir",
        "Authors": "By Jordan, Hamilton and Carter, Jimmy (FRW)",
        "Description": "The former White House chief-of-staff recalls his youth in the civil rights-era South, his years in Washington during the Carter administration, and his battle with three different types of cancer.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Longstreet Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Better Homes and Gardens Country Style",
        "Authors": "By Sharon L. Novotne O'Keefe",
        "Description": "This guide to interior design contains ideas for furnishing and decorating the country home, focusing on personal style, ingenuity, and comfort",
        "Category": " Art , General",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "The Shadow of Ararat: Book One of 'The Oath of Empire'",
        "Authors": "By Harlan, Thomas",
        "Description": "In what would be A.D. 600 in our history, the Empire still stands, supported by the Legions and Thaumaturges of Rome. Now the Emperor of the West, the Augustus Galen Atreus, will come to the aid of the Emperor of the East, the Augustus Heraclius, to lift the siege of Constantinople and carry a great war to the very doorstep of the Shahanshah of Persia. It is a war that will be fought with armies both conventional and magical, with bright swords and the darkest necromancy. Against this richly detailed canvas of alternate history and military strategy, Thomas Harlan sets the intricate and moving stories of four people. Dwyrin MacDonald is a Hibernian student at a school for sorcerers in Upper Egypt, until he runs afoul of powerful political interests and is sent off half-trained to the Legions. His teacher, Ahmet,undertakes to follow Dwyrin and aid him, but Ahmet is drawn into service with the queen of Palmeyra. Thyatis is a young female warrior, extensively trained by her patron in the arts of covert warfare. And Maxian Atreus is Galens youngest brother, a physician and sorcerer. He has discovered that an enemy of Rome has placed a dreadful curse on the City, which must be broken before Rome can triumph. Woven with rich detail youd expect from a first-rate historical novel, while through it runs yarns of magic and shimmering glamours that carry you deeply into your most fantastic dreams",
        "Category": " Fiction , Historical",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "UNITED STATES FRIGATE \"CONSTITUTION\"  A Brief Account of Her History, Together with Data for Model Builders",
        "Authors": "By ship models",
        "Description": "",
        "Category": "",
        "Publisher": "Wash. D.C.: Bureau of Construction and Repair Navy Department, 1932",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1932"
        }
    },
    {
        "Title": "A Nation Without a Conscience",
        "Authors": "By LaHaye, Tim F. and Lahaye, Beverly",
        "Description": "Argues that the United States is in a moral decline, owed to the lack of religion in public life",
        "Category": " Religion , General",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "12.43",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Feeding Frenzy: How Attack Journalism Has Transformed American Politics",
        "Authors": "By Sabato, Larry J.",
        "Description": "",
        "Category": " Social Science , Media Studies",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "For All Who Love the Game: Lessons and Teachings for Women",
        "Authors": "By Penick, Harvey, Shrake, Bud, and Shrake, Edwin",
        "Description": "In For All Who Love the Game, Harvey shares the lessons he has learned from all the women he's watched in his seven decades of teaching the game he loves. He describes the techniques that can help women gain greater power, discusses the psychological hurdles some women must overcome to improve their game, and gives his tips for developing the parts of the game where women can and should outplay their male partners. He provides a clear image of the proper swing, gives advice on what equipment every woman should carry, and provides wisdom, inspiration, and sound instruction for anyone hoping to improve her game. With the same blend of sage advice and common sense that made his first two books such an essential part of every golfer's library. Harvey shows how every woman, whatever her other athletic gifts might be, can play great golf and enjoy it to its fullest.Harvey has often said that the day he stops learning is the day he'll quit teaching. Fortunately for us all, that day is still a long way in the future for America's best-loved teacher of the greatest game of all.",
        "Category": " Sports & Recreation , Reference",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Awesome Jokes",
        "Authors": "By Keller, Charles and Sinclair, Jeff (ILT)",
        "Description": "What does a frog say when it sees something terrific? Toad-ally awesome! That's exactly what you'll say about this cartoon-filled collection of jokes, puns, and riddles. Enjoy smart remarks from The Warped Wise Man (Basketball is just a lot of hoopla), and giggle at the silly daffynitions (A hotel is a place where you pay good dollars for poor quarters). It's a barrel of laughs!",
        "Category": " Juvenile Nonfiction , Humor , Jokes & Riddles",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Venetian's Wife: A Strangely Sensual Tale of a Renaissance Explorer, a Computer, and a Metamorphosis",
        "Authors": "By Bantock, Nick",
        "Description": "Nick Bantock's illustrated novel, The Venetian's Wife, is part love story, part mystery, and part ghostly tale&#151;and an altogether bewitching brew of sensuality and lost treasures. Thoroughly bored with her job at the local museum, Sarah heads to the gallery to take another look at that new drawing, the one she can't stop thinking about, the one of the Hindu god Shiva, who dances...That's when it all begins. The next day, an e-mail message brings her a job offer: to find the few remaining pieces of a 15th-century adventurer's renowned collection of Indian sculptures. Her employer, curiously, wishes to communicate only by computer. She has no idea who he is or why he wants her. But other mysteries soon preoccupy her, such as the meaning of an enigmatic illuminated manuscript&#151;and the sensual transformation that seems to be overtaking her. Through her quirkily decorated diary and the artful e-mail exchanges between Sara and her mentor, Nick Bantock has conjured up a richly illustrated tale of a relentless quest, an amorous legacy, and the resonating power of art&#151;a lush, romantic adventure of the soul that tantalizes the reader to the last line.",
        "Category": " Fiction , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "America in Poetry: With Paintings, Drawings, Photographs, and Other Works of Art",
        "Authors": "By Sullivan, Charles (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Abradale/Abrams",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Lasers: Harnessing the Atom's Light",
        "Authors": "By Harbison, James P. and Nahory, Robert E.",
        "Description": "A nontechnical account of the fundamental science behind lasers, the history of their discovery and development, the various kinds in use today, the many applications they are used in, and the potential both for evolving technology and the wider applications. Highly, though tastefully illustrated, mostly in color. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Technology & Engineering , Lasers & Photonics",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The David and the Accademia Gallery",
        "Authors": "By Falletti Franca",
        "Description": "",
        "Category": "",
        "Publisher": "Bonechi-Edizioni \"Il Turismo\".",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Dwarf",
        "Authors": "By Par Lagerkvist",
        "Description": "",
        "Category": "",
        "Publisher": "Hill & Wang",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Fire Along the Sky",
        "Authors": "By Moss, Robert",
        "Description": "Shane Hardacre, a womanizer, arrives in America in the mid-eighteenth century, engaging in a series of adventures that takes him from New York to the Western frontier",
        "Category": " Fiction , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Making love: How to be your own sex therapist",
        "Authors": "By Raley, Patricia E.",
        "Description": "Details and illustrates processes and techniques of personal reflection, self-examination, and action designed to correct sexual dysfunctions and aversions and to enhance sexual pleasure and fulfillment",
        "Category": "",
        "Publisher": "Dial Press",
        "Price Starting With ($)": "24.26",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Builders of our nation;: Stories and pictures of some of the great men who helped to build our country",
        "Authors": "By Francis Raymond Elms",
        "Description": "",
        "Category": "",
        "Publisher": "A. Whitman & company",
        "Price Starting With ($)": "8.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1943"
        }
    },
    {
        "Title": "Capital Celebrations: A Collection of Recipes by the Junior League of Washington",
        "Authors": "By Junior League of Washington",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Junior League of Washington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Becoming a Chef: With Recipes and Reflections from America's Leading Chefs (Hospitality, Travel & Tourism)",
        "Authors": "By Dornenburg, Andrew and Page, Karen",
        "Description": "Provides advice and insight on becoming a chef",
        "Category": " Cooking , Methods , General",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Software Engineering Concepts (McGraw-Hill Series in Software Engineering and Technology)",
        "Authors": "By Fairley, Richard E.",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Mcgraw-Hill College",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "How to Keep a Spiritual Journal: A Guide to Journal Keeping for Inner Growth and Personal Recovery",
        "Authors": "By Klug, Ron",
        "Description": "",
        "Category": "",
        "Publisher": "Augsburg Fortress",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Wit and Wisdom of Abraham Lincoln",
        "Authors": "By Gross, Anthony",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Making Your Own Jewelry: Creative Designs To Make and Wear",
        "Authors": "By Milne, Wendy Haig",
        "Description": "How to transform beads, semiprecious stones, pearls, crystals, wood, and wire into wearable works of art.",
        "Category": " Crafts & Hobbies , Jewelry",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Data Communications: Facilities, Networks, and Systems Design",
        "Authors": "By Doll, Dixon R.",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "December",
            "Year": "1977"
        }
    }
]