[
    {
        "Title": "Treating Type A Behavior- And Your Heart",
        "Authors": "By Friedman, Meyer and Ulmer, Diane",
        "Description": "Details the symptoms of type A behavior and describes how to modify this dangerous behavior in order to reduce the risk of heart attack",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "A Thousand Acres: A Novel",
        "Authors": "By Smiley, Jane",
        "Description": "A thousand acres, a piece of land of almost mythic proportions. Upon this fertile, nourishing earth, Jane Smiley has set her rich, breathtakingly dramatic novel of an American family whose wealth cannot stay the hand of tragedy. It is the intense, compelling story of a father and his daughters, of sisters, of wives and husbands, and of the human cost of a lifetime spent trying to subdue the land and the passions it stirs. The most critically acclaimed novel of the literary season, a classic story of contemporary American life, A THOUSAND ACRES is destined to be read for years to come. 'It has been a long time since a novel so surprised me with its power to haunt . . . . Its genius grows from its ruthless acceptance of the divided nature of every character . . . . This gives A THOUSAND ACRES the prismatic quality of the greatest art.' -- Chicago Tribune Winner of the Pulitzer Prize and the National Book Critics Circle Award",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Dr. Larry Silver's Advice to Parents on Attention-Deficit Hyperactivity Disorder",
        "Authors": "By Silver, Larry B.",
        "Description": "Discusses ADHD's symptoms, treatments, impact on families, and more",
        "Category": " Psychology , Movements , Psychoanalysis",
        "Publisher": "Amer Psychiatric Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Holes",
        "Authors": "By Sachar, Louis",
        "Description": "Stanley Yelnats is under a curse. A curse that began with his no-good-dirty-rotten-pig-stealing-great-great-grandfather and has since followed generations of Yelnats. Now Stanley has been unjustly sent to a boys' detention center, Camp Green Lake, where the warden makes the boys \"build character\" by spending all day, every day, digging holes: five feet wide and five feet deep. It doesn't take long for Stanley to realize there's more than character improvement going on at Camp Green Lake. The boys are digging holes because the warden is looking for something. Stanley tries to dig up the truth in this inventive and darkly humorous tale of crime and punishment—and redemption.",
        "Category": " Young Adult Fiction , Media Tie-In",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Betty Crocker's Cooking Basics: Learning to Cook with Confidence",
        "Authors": "By Crocker, Betty",
        "Description": "Today, many people find they don t know kitchen basics, much less know how to cook a meal. Betty Crocker comes to the rescue in Cooking Basics, covering all the information anyone needs to cook, whether they are just leaving home, or discovering a need to cook at any age. Using the 100 appealing recipes here, anyone can learn to cook a complete meal. Nothing is intimidating, and every technique, term and ingredient is clearly explained. Each recipe has its own two-page spread, complete with a photo of the finished food and how-to photos of techniques used in the recipe. It s never been simpler to create a great dish!    Betty Crocker interviewed inexperienced cooks, to get just the the right recipes for this book, the ones novice cooks really want: hamburgers three way broiled, grilled or fried; Quick Lasagna; Teriyaki Chicken Stir-fry; Quick Chicken Soup; Shrimp Scampi; Quesadillas; Mashed Potatoes; Strawberry Shortcakes, and other tempting treats. Anyone can cook a dinner -- even entertain -- with these sure-fire recipes.    Did you think only gourmets tackled Thanksgiving dinner? Not with Betty Crocker. Included is a complete Thanksgiving feast, with a timetable so everything comes out just right. Whether you want to host the show, or bring a dish to help out your host, this Thanksgiving meal is perfect for everyone.    Also covered is how to set up a kitchen, how to read a recipe, a glossary of ingredients and a complete explanation of food preparation terms. Learn about fresh herbs--what they look like and how to use them -- plus complete easy-to-read listings of pasta shapes and salad greens. Sections on grilling, entertaining, table setting, and refrigerator and freezer storage guides complete the book, and make new cooks feel confident on all fronts. No longer does anyone have to be afraid of the kitchen. With Betty Crocker know-how and experience, you can cook up a great dinner!",
        "Category": " Cooking , Methods , General",
        "Publisher": "Betty Crocker",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Diabetes, Recipes for Health",
        "Authors": "By Ann VonderHaar Christy, Judy Dvorak Germann",
        "Description": "",
        "Category": "",
        "Publisher": "R.J. Brady Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Diagnosing Organizations: Methods, Models, and Processes (Applied Social Research Methods)",
        "Authors": "By Harrison, Michael I.",
        "Description": "How can organizations handle the opportunities and threats posed by rapidly changing markets and external conditions? How can they improve their overall effectiveness? The Second Edition of this popular book contains up-to-date treatments of techniques and models for diagnosing how organizations deal with challenges like these. The book also shows how consultants and applied researchers can help managers find ways to enhance organizational effectiveness. Completely revised, this edition presents the most recent techniques for gathering and analyzing diagnostic data, covers models and methods for diagnosing organizational designs, everyday practices, fits among organizational components, organizational politics and power relations, and explores the ethical and political dilemmas of consulting and diagnosis. The book retains its original coverage of the process of working with members of a client organization to plan and administer a diagnostic study and communicate its results. It also continues to focus on group processes and the quality of working life.",
        "Category": " Social Science , Research",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Best of Salads & Buffets: Over 325 salads and buffet recipes",
        "Authors": "By Teubner, Christian and Wolter, Annette",
        "Description": "Supplies recipes for a wide variety of cold foods, including sandwiches, egg dishes, fish, meat platters, soups, and stuffed vegetables",
        "Category": " Cooking , General",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Dare to Win: The Guide to Getting What You Want Out of Life",
        "Authors": "By Canfield, Jack (COM) and Hansen, Mark Victor (COM)",
        "Description": "“An ideal book for anyone who really wants to achieve more in life”* from Jack Canfield and Mark Victor Hansen, the #1 New York Times bestselling authors of the Chicken Soup for the Soul series.   How are you doing? Just okay? Not so great? Getting by?    Jack Canfield and Mark Victor Hansen have inspired millions of people around the world to break through their fears and create their ideal lives. Now, in Dare to Win, they show you how to eliminate the roadblocks that prevent you from fulfilling your potential so you can get what you want out of life. From expanding your imagination and focusing your energy, to achieving total prosperity and awakening your spiritual self, Dare to Win teaches you to think like the winner you truly are and to believe in what you can become. You’ll soon discover that you can conquer your fears, accept life’s rewarding challenges—and win.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Lord Jim",
        "Authors": "By Conrad, Joseph",
        "Description": "A young Englishman branded as a coward seeks personal redemption for an act of selfishness",
        "Category": " Fiction , General",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1961"
        }
    },
    {
        "Title": "When the Century Was Young",
        "Authors": "By Brown, Dee",
        "Description": "The author of Bury My Heart at Wounded Knee describes his life from his first job as a delivery boy and his adolescent career in mail-order fraud, to his stint in journalism and his participation in World War II. Reprint.",
        "Category": "",
        "Publisher": "August House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Bernard Shaw V 1: The Search For Love (1856-1898)",
        "Authors": "By Holroyd, Michael",
        "Description": "",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Sinatra: The Pictorial Biography",
        "Authors": "By Irwin, Lew",
        "Description": "Tracks Frank Sinatra's life from his early days in Hoboken and his turbulent marriages through his relationships with the \"Rat Pack\" and his award-winning career, and provides more than one hundred photographs taken at each stage of his life.",
        "Category": "",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Regime Change: U.S. Strategy through the Prism of 9/11 (Woodrow Wilson Center Press)",
        "Authors": "By Litwak, Robert S.",
        "Description": "Litwak (international security studies, Woodrow Wilson International Center for Scholars) critically analyzes the Bush administration's emphasis on the need for regime change to confront the perceived threat of weapons of mass destruction in the hands of \"rogue states\" or allied terrorist groups. He argues that the turn towards regime change has left an unresolved tension in US foreign policy--behavior change versus regime change--that frustrates the effective integration of force and diplomacy and points to Libya's dismantling of its WMD programs as an example of effective diplomacy of the type that could be upset by too much careless regime change rhetoric. Finally, he illustrate his argument with case studies of US approaches towards Iraq, Libya, Iran, North Korea, and nonstate actors such as Al Qaeda. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Granta 42: Krauts! (Granta: The Magazine of New Writing)",
        "Authors": "By Buford, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Granta Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Nature in Art",
        "Authors": "By Anthea Peppin",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Harcourt (HMH)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Stacks: Interoperability in Today's Computer Networks",
        "Authors": "By Malamud, Carl",
        "Description": "A lively and opinionated, but quite technical overview of the latest tools used in computer networks. Addressed to creators of networks rather than to their users, explains the various components and how they are, and can be, combined for general and specific applications. Includes good bibliographic references. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Irresistible Fondues (Quick & Easy)",
        "Authors": "By Rynio, Jorn (PHT), Illies, Angelika, and Llies, Angelika",
        "Description": "",
        "Category": " Cooking , Methods , General",
        "Publisher": "Silverback Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Adlai Stevenson of Illinois",
        "Authors": "By Martin, John Bartlow",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "March",
            "Year": "1977"
        }
    },
    {
        "Title": "Recipes from a country cook",
        "Authors": "By Bea Toms",
        "Description": "",
        "Category": "",
        "Publisher": "Diversions Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Pocket Guide to Cheese",
        "Authors": "By Ensrud, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Photographic Supplement to the Diary of Anais Nin",
        "Authors": "By Nin, Anais",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "21.84",
        "Publish Date": {
            "Month": "October",
            "Year": "1974"
        }
    },
    {
        "Title": "The Trellis Cookbook: Contemporary American Cooking in Colonial Williamsburg",
        "Authors": "By Desaulniers, Marcel",
        "Description": "Provides seasonal recipes for appetizers, soups, salads, main dishes, side dishes, and desserts, and discusses cooking equipment and techniques",
        "Category": " Cooking , Reference",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "5.21",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Best of America's Test Kitchen 2007: The Year's Best Recipes, Equipment Reviews, and Tastings",
        "Authors": "By America's Test Kitchen",
        "Description": "Presents nearly one thousand recipes--from appetizers and salads to entrees and desserts--developed by America's Test Kitchen chefs, along with tips for choosing equipment, preparing food, or saving money in the kitchen.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Cook's Illustrated",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Executive Privilege: A Novel",
        "Authors": "By Margolin, Phillip",
        "Description": "New York Times bestselling author Phillip Margolin is back, this time with a powerful tale of murder that snakes its way through Washington, D.C.'s halls of power, leading straight to the White House and the most powerful office on earth.When private detective Dana Cutler is hired by an attorney with powerful political connections, the assignment seems simple enough: follow a pretty college student named Charlotte Walsh and report on where she goes and whom she sees. But then the unexpected happens. One night, Cutler follows Walsh to a secret meeting with Christopher Farrington, the president of the United States. The following morning, Walsh's dead body shows up and Cutler has to run for her life.In Oregon, Brad Miller, a junior associate in a huge law firm is working on the appeal of a convicted serial killer. Clarence Little, now on death row, claims he was framed for the murder of a teenager who, at the time of her death, worked for the then governor, Christopher Farrington. Suddenly, a small-time private eye and a fledgling lawyer find themselves in possession of evidence that suggests that someone in the White House is a murderer. Their only problem? Staying alive long enough to prove it.Executive Privilege, with its nonstop action, unforgettable characters, and edge-of-your-seat suspense, proves once again that Phillip Margolin—whose work has been hailed as \"frighteningly plausible\" (Pittsburgh Post-Gazette) and \"twisted and brilliant\" (Chicago Tribune)—belongs in the top echelon of thriller writers.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Yiddish Policemen's Union: A Novel (P.S.)",
        "Authors": "By Chabon, Michael",
        "Description": "The New York Times bestseller, now available in paperback—“an excellent, hyperliterate, genre-pantsing detective novel that deserves every inch of its…blockbuster superfame” (New York).For sixty years Jewish refugees and their descendants have prospered in the Federal District of Sitka, a \"temporary\" safe haven created in the wake of the Holocaust and the shocking 1948 collapse of the fledgling state of Israel. The Jews of the Sitka District have created their own little world in the Alaskan panhandle, a vibrant and complex frontier city that moves to the music of Yiddish. But now the District is set to revert to Alaskan control, and their dream is coming to an end.Homicide detective Meyer Landsman of the District Police has enough problems without worrying about the upcoming Reversion. His life is a shambles, his marriage a wreck, his career a disaster. And in the cheap hotel where Landsman has washed up, someone has just committed a murder—right under his nose. When he begins to investigate the killing of his neighbor, a former chess prodigy, word comes down from on high that the case is to be dropped immediately, and Landsman finds himself contending with all the powerful forces of faith, obsession, evil, and salvation that are his heritage.At once a gripping whodunit, a love story, and an exploration of the mysteries of exile and redemption, The Yiddish Policemen's Union is a novel only Michael Chabon could have written.",
        "Category": " Fiction , Alternative History",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "8.98",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "One Bite Won't Kill You: More than 200 Recipes to Tempt Even the Pickiest Kids on Earth",
        "Authors": "By Chast, Roz (ILT) and Hodgman, Ann",
        "Description": "The toughest challenge many cooks face each day is feeding their own children. By her own admission, the writer and humorist Ann Hodgman's kids are the worst eaters in the world, and if she finds something one likes, the other inevitably hates it. Now, for all similarly beleaguered parents, Hodgman brings together more than two hundred recipes that everyone in the family can agree on, like Nonthreatening Cheese Fondue, Taco Bake, and Roast Pork Loin with Apple Crust, many of them gathered from fellow parents. ONE BITE WON'T KILL YOU also includes: menus for holiday meals, recipes for birthday parties, suggestions for in-flight and car-trip snacks, sections on feeding toddlers, preschoolers, elementary school kids, and adolescents. With hundreds of tips and anecdotes from other parents, ONE BITE WON'T KILL YOU makes the task of feeding kids not only a little easier, but also a whole lot more fun.",
        "Category": " Cooking , General",
        "Publisher": "Rux Martin/Houghton Mifflin Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "American Art of the 20th Century: Painting, Sculpture, Architecture",
        "Authors": "By Hunter, Sam and Jacobus, John M.",
        "Description": "A comprehensive survey of artists, styles, and movements in the modern history of American painting, sculpture, and architecture",
        "Category": " Art , History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "7.66",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "Sushi (Quick & Easy)",
        "Authors": "By Furtmayr, Andreas",
        "Description": "Classic sushi combines raw fish with rice and is eaten cold. Preparing sushi has always been daunting for Westeners. Once the basic principals are understood, however, you'll discover that sushi can be easy. One thing is a must.... the highest quality, fresh fish! By the way, eating sushi is not only for a group, even for two, its fun to knead the rice and enhance it with flavorful ingredients. And if there are guests... have them jump in to knead and roll!",
        "Category": " Cooking , Regional & Ethnic , Japanese",
        "Publisher": "Silverback Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Dutch Seventeenth-Century Painting",
        "Authors": "By Bugler, Caroline",
        "Description": "",
        "Category": "",
        "Publisher": "Mayflower Books, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "Biggest Book of Easy Canned Soup Recipes (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books (EDT) and Laning, Tricia (EDT)",
        "Description": "Convenient, crowd-pleasing meals using a variety of canned soups.Recipes that combine canned soups with familiar, off-the-shelf ingredients to make meals easy and delicious.Dozens of timesaving tips and creative hints for making dishes the entire family will love.Preparation and cooking times, nutrition information, and calorie counts for every recipe.",
        "Category": " Cooking , Specific Ingredients , General",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Cooking from Quilt Country : Hearty Recipes from Amish and Mennonite Kitchens",
        "Authors": "By Adams, Marcia and Avakian, Alexandra",
        "Description": "Provides seasonal recipes for breads, rolls, muffins, pancakes, fruit dishes, vegetables, salads, meat, chicken, soups, cakes, cookies, and pies.",
        "Category": " Cooking , Methods , Cookery for One",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Rustic Italian Cooking (De Gustibus Presents the Great Cooks' Cookbooks)",
        "Authors": "By Eckerle, Tom (PHT) and Feltman-Sailhac, Arlene",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Black Dog & Leventhal Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Favorite Brand Name Recipes For People Who Eat Food; Velveeta Kraft",
        "Authors": "By Kraft",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Pacific Northwest the Beautiful CookKathy Casey (1995) Paperback",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "HARPER COLLINS",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Stirring It Up: How to Make Money and Save the World",
        "Authors": "By Hirshberg, Gary",
        "Description": "A true force for change, Gary Hirshberg has been at the forefront of movements working for environmental and social transformation for 30 years. From his early days as an educator and activist to his current position as President and CE-Yo of Stonyfield Farm, the world's largest organic yogurt company, Hirshberg's positive outlook has inspired thousands of people to recognize their ability to make the world a better place.In Stirring It Up, Hirshberg calls on individuals to realize their power to effect change in the marketplace--\"the power of one\"--while proving that environmental commitment makes for a healthier planet and a healthier bottom line. Drawing from his 25 years' experience growing Stonyfield Farm from a 7-cow start-up, as well as the examples of like-minded companies, such as Newman's Own, Patagonia, Wal-Mart and Timberland, Hirshberg presents stunning evidence that business not only can save the planet, but is able to simultaneously deliver higher growth and superior profits as well.Hirshberg illustrates his points with practical information and advice, as well as engaging anecdotes from what he calls \"the bad old days\" of his yogurt company: how a power outage left him milking cows by hand, how a dumpster fire revealed the need for better packaging, and his camel manure taste test challenge to a local shock jock. He also describes hands-on grassroots marketing strategies--printing yogurt lids with provocative, politically charged messages, handing out thousands of free samples to subway commuters to thank them for using public transit, and devising the country's first organic vending machine--explaining how these approaches make a much more powerful impact on consumers than traditional advertising.An inspiring book for business owners and managers as well as anyone interested in saving the environment, Stirring It Up demonstrates how companies can work to save the planet, while achieving greater profits and satisfaction, and how we can all use the power of conscious consumption to encourage green corporate behavior.",
        "Category": " Business & Economics , Industrial Management",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Last Place on Earth",
        "Authors": "By Huntford, Roland",
        "Description": "Recounts the efforts of Scott, a British explorer, and Amundsen, a Norwegian, to be the first to reach the South Pole",
        "Category": " History , Europe , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Breakfast With the Pope: Daily Readings",
        "Authors": "By John Paul II, Pope and Servant Publications (EDT)",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Servant Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Webster's New Explorer Thesaurus",
        "Authors": "By Merriam-Webster (EDT)",
        "Description": "",
        "Category": " Reference , Thesauri",
        "Publisher": "Federal Street Pr",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The Polar Bear Strategy: Reflections on Risk in Modern Life",
        "Authors": "By Ross, John F.",
        "Description": "From cholesterol to cancer, asteroids to AIDS, we face more risks than our grandparents ever dreamed of. But most of us are 200 years behind the curve when it comes to making intelligent risk-based decisions: We refuse to fly, but don’t wear seat belts in our far more dangerous cars. We panic about toxic waste dumps, but collectively smoke a billion cigarettes a year. In this entertaining and enlightening look at risk in the modern age, John Ross argues that the burgeoning science of risk assessment has given us powerful new tools to cope in a complex world, if we could only learn how to speak the language. Ross examines the building blocks of this new language, and helps us identify and relinquish long-held, often pre-set, biological and psychological responses to risk. Through vivid stories and compelling science, Ross empowers us to take control of our lives and to exercise our most basic democratic freedom—the power to make our own decisions—both as individuals and as a society.",
        "Category": " Social Science , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "1,000 Classic Recipes From Around the World",
        "Authors": "By Jo-Anne Cox, Elizabeth Towers",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Dempsey Parr",
        "Price Starting With ($)": "11.82",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Web Database Applications with PHP & MySQL",
        "Authors": "By Lane, David and Williams, Hugh E.",
        "Description": "What do eBay, Amazon.com and CNN.com have in common? They're all applications that integrate large databases with the Web. The popularity (and power) of these applications stems from their accessibility and usability: thousands of users can access the same data at the same time without theneed to install any additional software on their computers.Web Database Applications with PHP and MySQL offersweb developers a mixture of theoretical and practical information on creating web database applications. Using PHP, and MySQL, two open source technologies that are often combined to develop web applications, the book offers detailed information on designing relational databases and on web application architecture, both of which will be useful to readers who have never dealt with these issues before.  The book also introduces Hugh and Dave's OnlineWines, a complete (but fictional) online retail site that allows users to browse, search a database, add items to a shopping cart, manage their membership, and purchase wines. Using this site as an example, the book shows you how to implement searching and browsing, store user data, validate user input, manage transactions, and maintain security.If you want to build small to medium-scale web database applications that can run on modest hardware and process more than a million hits a day from users, this book will show you how.",
        "Category": " Computers , Programming Languages , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Booknotes: Life Stories: Notable Biographers on the People Who Shaped America",
        "Authors": "By Lamb, Brian (EDT)",
        "Description": "Conversations with the most admired biographers of our time on the people who have forged our contemporary landscapeC-SPAN founder Brian Lamb invites readers into a virtual conversation -- via the art of biography -- with the legends and luminaries who have helped define America. This informal dictionary of biography peers into the personalities who have left a mark on our world -- a Who's Who of American history, and the next best thing to chatting directly with the likes of Abraham Lincoln, Walt Whitman, Susan B. Anthony, Eleanor Roosevelt, J. Edgar Hoover, Elijah Muhammad, Amelia Earhart, Katharine Graham, John F. Kennedy, Martin Luther King, Jr., Frank McCourt, Bill Clinton, and many others.Based on C-SPAN's popular weekly Booknotes program, this absorbing collection of life stories presents illuminating profiles and often surprising details from our favorite biographers. Booknotes follows the evolution of American history chronologically, and covers the lives of writers and thinkers, inventors and scientists, politicians and soldiers. Lamb reacquaints us with the great figures of our times, in an engaging conversation about America.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Watching Nature: A Mid-Atlantic Natural History",
        "Authors": "By Garland, Mark S. and Anderton, John (ILT)",
        "Description": "Shows and describes common varieties of plants and animals, including bats, fish, skunks, insects, gulls, trees, berrys, and violets",
        "Category": " Nature , General",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Without a Map: A Memoir",
        "Authors": "By Hall, Meredith",
        "Description": "Meredith Hall’s moving but unsentimental memoir begins in 1965, when she becomes pregnant at sixteen. Shunned by her insular New Hampshire community, she is then kicked out of the house by her mother. Her father and stepmother reluctantly take her in, hiding her before they finally banish her altogether. After giving her baby up for adoption, Hall wanders recklessly through the Middle East, where she survives by selling her possessions and finally her blood. She returns to New England and stitches together a life that encircles her silenced and invisible grief. When he is twenty-one, her lost son finds her. Hall learns that he grew up in gritty poverty with an abusive father—in her own father’s hometown. Their reunion is tender, turbulent, and ultimately redemptive. Hall’s parents never ask for her forgiveness, yet as they age, she offers them her love. What sets Without a Map apart is the way in which loss and betrayal evolve into compassion, and compassion into wisdom.\"Meredith Hall boldly charts one of the bravest of stories, the journey from disrupted youth up through that most tricky and forbidding territory, the family circle. Bone-honest and strong in its every line, this work of memory is a remarkably deep retrieval of its times and souls, thereby reflecting our own.\" —Ivan Doig, author of Heart Earth“This is an unusually elegant memoir that feels as though its been carved straight out of Meredith Hall’s capacious heart. The story is riveting, the words perfect. It is rare to read a work that manages to be at once artful and compelling, which for me best describes Meredith Hall’s debut work. She is an author who deserves to be widely read. Few people write like this. Fewer still have the courage to live like this – without the comfort of any cliché.” —Lauren Slater, author of Opening Skinner's Box, Prozac Diary, and Welcome to My Country “Meredith Hall’s long journey from an inexcusably betrayed girlhood to the bittersweet mercies of womanhood is a triple triumph—of survival; of narration; and of forgiveness. Her portrait of her own empty bravado collapsing into total psychological and geographical dislocation is one of the most harrowing passages I’ve ever read. The subsequent turn toward memory and honesty is agonized, profound, and salvific. Without a Map is a masterpiece.” —David James Duncan, author of The Brothers K and God Laughs and Plays“Meredith Hall is like a geiger counter ticking along the radium edge of these recent decades. She gives us self as expert-witness—Without a Map is smart, sharp, and redemptively honest. ” —Sven Birkerts, author of The Gutenberg Elegies and My Sky Blue Trades“Meredith Hall’s story of loss, shame, and betrayal is also a story of joy, reconnection, and survival; each memory takes us deep to the marrow of sorrow and celebration. A work of extraordinary beauty and grace.” —Kim Barnes, author of In the Wilderness: Coming of Age in Unknown Country\"Without A Map tells an important and perceptive story about loss, about aloneness and isolation in a time of great need, about a life slowly coming back into focus and the calm that finally emerges. Meredith Hall is a brave new writer who earns our attention.\" —Annie Dillard, author of Pilgrim at Tinker Creek“Think for a moment of Shakespeare’s The Winter’s Tale, of banishment, reconciliation, redemption, and you’ll get the scope of Without a Map, the new memoir by Meredith Hall . . . An extraordinary tale, made all the more moving by Hall’s unsentimental prose and ample heart.” —gettrio.com“a compelling, painful, hopeful story.” —more.com\"Meredith Hall's magnificent book held me in its thrall from the moment I began reading the opening pages. WITHOUT A MAP is a fluid, beautifully-written, hard-won piece of work that belongs on the shelf next to the best modern memoirs, and yet is in a category all its own. It is a moving example of a difficult life redeemed first through examination, then reeflection, then finally—like a rough stone polished until it gleams—into a genuine work of art.\" —Dani Shapiro, author of Family History“Hall, a brave and graceful writer who teaches at UNH, examines her life with wide open eyes and an equally open heart. Even as she wrestles with the grief of many losses—her child, her parents’ love and respect, her standing in her community, her identity—she demonstrates the writer’s gift of separating from her own experiences, establishing an objectivity that allows her to make meaning for herself and readers.” —Rebecca Rule, Nashua Telegraph“Open adoptions and connections between birth mothers and their children were not the way of life for a young girl who got pregnant in the '60s. Meredith Hall, in her beautifully written, poignant memoir, tells us what life was like for a naive girl who found herself pregnant and abandoned by her mother and father. This is a tale of loss, of endless traveling in search of an intangible something, and, uuuuultimately, of forgiveness.” —Gayle Shanks, Changing Hands Bookstore, Tempe, AZ“Hall’s sensitive, honest account of her personal odyssey shows one remarkable woman transcending this trauma to become a better, stronger person.” —Wendy Smith, AARP The Magazine“Hall's life, as depicted in this memoir, was nothing if not two things—difficult and fascinating. With no family, friends or other support system, she took her life into her own hands at an early, tender age, and she fell quite far before finally rising up. The reader gets the benefit of her trials, a gritty view of the world from America to Europe to the Middle East.” —INtake Weekly“Without a Map tells a stunning story of exile and ostracization. Meredith grew up on the seacoast of New Hampshire and became pregnant at age 16, in 1965. Her memoir is a rare and clear glimpse into the social mores of the mid 60's, and reveals the state of shame many families faced when an unmarried daughter became pregnant.” —Liz Bulkley, Host of “The Front Porch,” NH Public Radio“Appalling and infuriating, yet uplifting and inspiring, Without A Map pulls you into Hall’s personal experience of sudden rejection and expulsion from her only sources of sustenance and connection. As an adoptive parent I cried and cheered for her through her exile and return to a very different home. Meredith Hall is a hero of awesome courage and eloquence.” —Frank Kramer, Harvard Book Store, Cambridge, MA“[Without a Map] is a searing memoir about loss, betrayal, love and, in some measure, reconciliation. It has already brought Hall a celebrity that surprises her: stories in People, Oprah and Elle, an interview on National Public Radio, brisk sales in a crowded marketplace. It is on the extended New York Times bestseller list. What is arresting about this memoir is the world it reveals.” —Mike Pride, Concord Monitor“Without a Map, is so well written that it was hard for me to accept that the book had to end.\" —Tina Ristau, The Des Moines Register\"Painfully honest and beautifully written…Meredith Hall has managed to distill courage from raw pain, and then somehow write this gem of a book about the experience…A stunning book…You must read it.” —Lola Furber, Maine Women’s Journal“Fans of Jeannette Walls’ The Glass Castle should take note of Meredith Hall’s memoir, heartbreaking and ultimately heartwarming...\" —Mary Cotton, owner of Newtonville Books, Newton TAB“I’m awed by Meredith Hall’s wisdom and integrity, by her gorgeous prose that deepens my understanding of resilience and love, of loss and forgiveness. A courageous and brilliant memoir.” —Ursula Hegi, author of The Worst Thing I’ve Done",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "As Thousands Cheer: The Life of Irving Berlin",
        "Authors": "By Bergreen, Laurence",
        "Description": "Chronicles the songwriter's rags-to-riches career, from his birth in czarist Russia, to life as an immigrant on New York's Lower East Side, to his rise to the heights of Broadway and Hollywood",
        "Category": " Biography & Autobiography , Composers & Musicians",
        "Publisher": "Viking",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Party Receipts from the Charleston Junior League: Hors D'Oeuvres, Savories, Sweets",
        "Authors": "By Conway, Linda Glick (EDT)",
        "Description": "The third Charleston Junior League cookbook reveals more secrets of the city's legendary hospitality.",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Simon & Schuster Super Crossword Puzzle Dictionary And Reference Book",
        "Authors": "By Lark Productions (COR) and Seth Godin Productions (COR)",
        "Description": "Everything a crossword solver could ever need -- in one complete volume!  Who won the Academy Award for best actress in 1993? What's another word for \"nerd\"? If you're a modern puzzler, you need not only a quick and easy reference, but a book that is as interesting and intelligent as the puzzles of today -- and the people who solve them.  The Crossword Puzzle Dictionary section is brimming with more than 200,000 words organized by letter count and synonym. Looking for an 11-letter word for \"knotted\"? It's not too complicated:  knotted: 5 kinky; 6 gnarly, kinked, knotty, snarly; 7 gnarled, knobbed, raveled, snarled, tangled; 8 involved; 9 entangled, intricate, perplexed; 11 complicated; 12 inextricable  The Reference Book section is jam-packed with up-to-date lists of awards, important figures, records, and happenings in a wide variety of fields, including sports, history, literature, film, music, and politics. It's just what you need to stir your memory, brainstorm ideas, get out of a rut, and maybe even learn something new.  The Simon & Schuster Super Crossword Puzzle Dictionary and Reference Book brings together the solid information of an almanac, the word power of Roget's, and the quirkiness of a trivia collection all in one place. Eminently practical, this fun- and fact-filled volume, bursting with all manner of information, belongs in the library of every puzzle aficionado.",
        "Category": " Games , Crosswords , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Fresh Kills",
        "Authors": "By Loehfelm, Bill",
        "Description": "Set in the bleak, haunted landscape of blue-collar Staten Island and told with the gritty realism of a native, Fresh Kills tells the story of a son's search for answers - and for his father's killer.At first, John Sanders, Jr., couldn't care less that his father is dead, let alone murdered. The only thing he regrets is that he didn't pull the trigger, or so he thinks. When he reunites with his sister, Julia, at their childhood home, the siblings' reactions could not be more different. While Julia sees to funeral arrangements and plans a memorial, Junior rages out of control, his anger at his father for a lifetime of violence and abuse matched only by his need to seek vengeance for the man's death.Yet Julia suffers too, hiding her own hurt and filling the role of the responsible daughter, while Junior, unhinged by his father's death and frustrated by the cops' stagnant investigation, hunts for his own answers. Two detectives assigned to the case - one a childhood friend of Junior's, the other a veteran cop who knew John Sr. - are simply roadblocks in his path to justice.But a string of dead ends and violent encounters leaves Junior no closer than the cops to any answers. His relationship with his beloved sister crumbles, while his affair with an old high school sweetheart wreaks havoc on his fracturing psyche. Despite the helping hands extended to him, Junior turns his back on those who love him most; the memories of his childhood have left him broken. When a chance at revenge finally arrives, he must decide whether he will continue the chain of violence that has nearly destroyed him, or accept the challenge of a new beginning.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Tuscany the Beautiful Cookbook",
        "Authors": "By HarperCollins",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Everything Card Games Book: A complete guide to over 50 games to please any crowd",
        "Authors": "By Katz, Nikki",
        "Description": "If you find yourself coming down with a case of rainy-day boredom or \"I can't watch another rerun on TV\" syndrome, grab the closest deck of cards and get ready for some serious fun! The Everything Card Games Book is packed with loads of variety to keep you entertained for hours with games you can play solo or with a group of people. Wow your friends and family with your card-shark skills by mastering these basic games - along with a handful of more advanced ones, too! In addition to key rules and instructions for play, The Everything Card Games Book provides tips on shuffling and dealing, essential etiquette, and knowing when to hold and when to fold.Learn how to play:Classic games, such as bridge and whistTeam games, such as pinochle and spadesVariations of games, such as Mexican Stud and Pai Gow PokerGames from abroad, such as Black Maria and Scopone ScientificoKids' games, such as Go Fish and Memoryand more!The perfect way to get you up to speed on more than fifty popular games, The Everything Card Games Book is your wild card for scoring big. Pull up a seat, gather your friends, and let the games begin!",
        "Category": " Games & Activities , Card Games , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Food with Flair (New Basics)",
        "Authors": "By",
        "Description": "",
        "Category": " Cooking , Entertaining",
        "Publisher": "Silverback Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "I Love My Family",
        "Authors": "By Hudson, Wade and Massey, Cal (ILT)",
        "Description": "At a joyous family reunion, relatives sing, dance, eat lots of food, and pose for a family picture",
        "Category": "",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "All About Pruning",
        "Authors": "By Deaton, Charles",
        "Description": "",
        "Category": " Gardening , Techniques",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "First Daughter",
        "Authors": "By Lustbader, Eric",
        "Description": "Sometimes the weakness we fear most can become our greatest strength . . .  Jack McClure has had a troubled life.  His dyslexia always made him feel like an outsider.  He escaped from an abusive home as a teenager and lived by his wits on the streets of Washington D.C.  It wasn’t until he realized that dyslexia gave him the ability to see the world in unique ways that he found success, using this newfound strength to become a top ATF agent. When a terrible accident takes the life of his only daughter, Emma, and his marriage falls apart, Jack blames himself, numbing the pain by submerging himself in work.  Then he receives a call from his old friend Edward Carson.  Carson is just weeks from taking the reins as President of the United States when his daughter, Alli, is kidnapped.  Because Emma McClure was once Alli’s best friend, Carson turns to Jack, the one man he can trust to go to any lengths to find his daughter and bring her home safely. The search for Alli leads Jack on a road toward reconciliation . . . and into the path of a dangerous and calculating man.  Someone whose actions are as cold as they are brilliant.  Whose power and reach are seemingly infinite. Faith, redemption, and political intrigue play off one another as McClure uses his unique abilities to journey into the twisted mind of a stone cold genius who is constantly one step ahead of him.  Jack will soon discover that this man has affected his life and his country in more ways than he could ever imagine.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Merry-Go-Round: A Book ABout Nouns (Sandcastle Books)",
        "Authors": "By Heller, Ruth",
        "Description": "Teaches young readers all about nouns, discussing such concepts as abstract nouns, possessives, plurals, concrete nouns, and more",
        "Category": " Juvenile Fiction , Concepts , Words",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Secret of Wildcat Swamp (The Hardy Boys, No. 31)",
        "Authors": "By Dixon, Franklin W.",
        "Description": "An invitation from Cap Bailey, science teacher at Bayport High, to accompany him out West to Wildcat Swamp on an archaeological expedition triggers off a series of dangerous events for Frank and Joe Hardy. On their way West the boys and Cap have a near-fatal accident in a private plane which has been sabotaged. Though warned to leave the area, Frank, Joe, and Cap doggedly remain until they have caught the cunning ex-convicts they are up against in this swift-paced adventure.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "First Acts: A Memoir",
        "Authors": "By Reid, Benjamin Lawrence",
        "Description": "The author looks back on his childhood, his experiences as a conscientious objector during World War II, and the start of his teaching career",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Univ of Georgia Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Man and Microbes",
        "Authors": "By Karlen, Arno",
        "Description": "AIDS, Lyme disease, and the deadly hantavirus are just a few of the dozens of new diseases to arrive in recent years. Old ones such as TB and cholera have returned with sharper virulence. Where do new diseases come from? Why are old ones back as vicious changelings? Why now? We created this epidemic of epidemics by transforming our environment and behavior - our landscape, technology, and sex lives. Thus we hasten microbes' evolution and our own, making the world a global village for diseases.In Man and Microbes, respected science writer Arno Karlen presents a dramatic panorama of the natural history of disease. Drawing on case studies and tales of medical detection, he uncovers the ills of ancient hunter-gatherers, relates the rise of diseases that came with each domesticated species, and exposes the origins of modern urban epidemics. Citing original sources and extensive research, Karlen recounts the terror of measles and smallpox that raked the ancient empires of Rome and China; the intertwined stories of leprosy and tuberculosis throughout thousands of years of history; the onslaught of European microbes that devastated the peoples of the Americas far more than did the firearms of their conquerors; and the much-forgotten influenza pandemic of 1918 that killed tens of millions. He also analyzes the most recent medical reports of mysterious new diseases from around the world and provides a view of how they have arisen and what they bode for the future.Man and Microbes makes clear that infection is a natural and necessary part of life. It shows how the search for food, shelter, and a safer, more prosperous life has altered the environment, changed the dance of adaptation between humans and microbes, and generated new diseases. The means to surmount the growing public health crisis in our ever-accelerating global society lie in the same ingenuity that created it. Understanding the complex and vital relationships between man and microbe can help us tame or make truce with our microbial fellow travelers on planet Earth.",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Reframing Organizations: Artistry, Choice, and Leadership (The Jossey-Bass Management Series)",
        "Authors": "By Bolman, Lee G. and Deal, Terrence E.",
        "Description": "In this updated version of their best-selling classic, the authors explain how the powerful tool of reframing --appraising situations from diverse perspectives--can be used to build high-performing, responsive organizations.",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Cancer: An Alternative Medicine Definitive Guide (Alternative Medicine Definitive Guides)",
        "Authors": "By Diamond, W. John, Cowden, W. Lee, and Goldberg, Burton",
        "Description": "Provides information on alternative cancer treatments and includes patient case histories",
        "Category": " Health & Fitness , Diseases , Cancer",
        "Publisher": "Alternativemedicine.com Books",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Psychology of Aging: An Annotated Bibliography (Bibliographies and Indexes in Gerontology)",
        "Authors": "By Hayslip, Bert, Servaty, Heather L., and Ward, Amie S.",
        "Description": "A sampling of over 500 journal articles, books, and book chapters offers graduate students and beginning researchers both access to useful information sources and an overview of the direction of research in the past 10-15 years. Emphasizes research summaries and literature reviews rather than reports on narrow topics; also includes some older classic works. The annotations of one or two sentences are descriptive and critical. Among the sections are theory in the psychology of aging, learning and memory, therapy and intervention, and death and dying. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Social Science , Gerontology",
        "Publisher": "Greenwood",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Passions : The Wines and Travels of Thomas Jefferson",
        "Authors": "By Gabler, James M.",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Bacchus Pr Ltd",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Good Life Cooking: Light Classics from Today's Gourmet",
        "Authors": "By Pepin, Jacques",
        "Description": "Featuring fast, easy, healthy recipes from the master chef, a collection of delicious French dishes--each accompanied by a nutritional analysis--makes eating at home as tasty and fun as eating out at a fine restaurant. Original. 40,000 first printing. IP.",
        "Category": " Cooking , Reference",
        "Publisher": "Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Twilight (The Twilight Saga, Book 1)",
        "Authors": "By Meyer, Stephenie",
        "Description": "With 160 million copies of the Twilight Saga sold worldwide, this addictive love story between a teenage girl and a vampire redefined romance for a generation. Here's the book that started it all.Isabella Swan's move to Forks, a small, perpetually rainy town in Washington, could have been the most boring move she ever made. But once she meets the mysterious and alluring Edward Cullen, Isabella's life takes a thrilling and terrifying turn.Up until now, Edward has managed to keep his vampire identity a secret in the small community he lives in, but now nobody is safe, especially Isabella, the person Edward holds most dear. The lovers find themselves balanced precariously on the point of a knife-between desire and danger.Deeply romantic and extraordinarily suspenseful, Twilightcaptures the struggle between defying our instincts and satisfying our desires. This is a love story with bite. p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Helvetica} span.s1 {font-kerning: none} \"People do not want to just read Meyer's books; they want to climb inside them and live there.\"-Time\"A literary phenomenon.\"-The New York Times",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Botox Diaries: A Novel",
        "Authors": "By Kaplan, Janice and Schnurnberger, Lynn",
        "Description": "In a world where plastic surgery is as popular as a pair of sexy Manolo Blahniks, suburban single mom Jessica Taylor is trying to make it past forty with nothing more than moisturizer and a swipe of mascara. Her glamorous best friend, TV producer Lucy Baldor, has a different idea of aging gracefully. “My body is a temple,” Lucy explains. “I just don’t want it to crumble like St. John the Divine.”Jess and Lucy’s friendship has weathered the trials of marriage, the births of children, and the transition from itty-bitty bikinis to “Kindest Cut” one-piece suits. Now the women are discovering that midlife crises aren’t just for men—they’re equal-opportunity dilemmas.To Jess’s dismay, Lucy announces that she’s taken a lover. A very famous lover. Her husband, Dan, is bound to find out (especially after a picture of the amorous duo appears on Page Six of the New York Post), but Lucy’s too wrapped up in the joys of expensive lingerie and romantic retreats to care. Jess finds herself in the midst of her own romantic predicament when, after ten years of silence, her sexy French ex-husband, Jacques, ends up back in her life—and in her bed. Whether navigating bake sales, bicoastal affairs, or bagels-and-Botox parties, these wise and witty women know that their friendship will remain the one true thing they can count on. Well, that and a good push-up bra, of course. And their bond withstands everything—from an orgy in Willie Nelson’s trailer to a reality TV-show bachelor named Boulder.Funny, brazen, and often poignant, this irresistible novel offers an unexpected and entertaining look at two women’s midlife adventures. From Thai massage to tantric sex, who would have thought forty could be so much fun?",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Any Place I Hang My Hat: A Novel",
        "Authors": "By Isaacs, Susan",
        "Description": "Amy wasn't born to fortune. Her mother abandoned her before her first birthday and her father couldn't handle anything as conventional as parenting. Amy worked for her luck. At age fourteen, she got herself a scholarship to a New England boarding school, then to Harvard, then to Columbia School of Journalism. She's smart, she's enterprising, but after a few years as a reporter for a prestigious magazine, she doesn't know who she is or how to connect.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "VERSAILLES Complete Guide English Edition",
        "Authors": "By Hoog, Simone and Daniel Meyer",
        "Description": "",
        "Category": "",
        "Publisher": "ART LYS",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Storming to Power (The Third Reich)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Traces Hitler's rise to power from his imprisonment in Landsberg prison to his swearing in as chancellor, and explains the factors that led to Nazi rule",
        "Category": " History , General",
        "Publisher": "Time Life Books",
        "Price Starting With ($)": "6.94",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Fists of Steel (The Third Reich)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Traces the rebuilding of Germany's military after it was all but dismantled at the end of World War I, and the prepaations for the next war",
        "Category": " Political Science , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "June 1941: Hitler and Stalin",
        "Authors": "By Lukacs, John",
        "Description": "This brilliant new work by the author of the best-selling Five Days in London, May 1940 is an unparalleled drama of two great leaders confronting each other in June 1941. It describes Hitler and Stalin’s strange, calculating, and miscalculating relationship before the German invasion of Soviet Russia, with its gigantic (and unintended) consequences. John Lukacs questions many long-held beliefs; he suggests, for example, that among other things Hitler’s first purpose involved England: if Stalin’s Communist Russia were to be defeated, Hitler’s Third Reich would be well-nigh invincible, and the British and American peoples would be forced to rethink the war against Hitler. The book offers penetrating insights and a new portrait of Hitler and Stalin, moved by their long-lasting inclinations. Yet among other things, Lukacs presents evidence that Hitler (rather than his generals) had moments of dark foreboding before the invasion. Stalin could not, because he wished not, believe that Hitler would choose the risk of a two-front war by attacking him; he was stunned and shocked and came close to a breakdown. But he recovered, grew into a statesman, and eventually became a prime victor of the Second World War. Such are the ironies of history; John Lukacs paints them with a shining narrative skill.",
        "Category": " History , Military , World War II",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Priestess of Avalon (Avalon, Book 4)",
        "Authors": "By Paxson, Diana L. and Bradley, Marion Zimmer",
        "Description": "Priestess of Avalon tells the story of the British princess Eilan, known to the Romans as Helena. Helena's journey begins in Avalon when she falls in love with a Roman officer destined for imperial greatness. But she will find that forbidden love comes at an unexpected cost; she is banished from Avalon. We follow Helena as she grows from maiden to mother to wisewoman, experiencing both joy, with the birth of her child, and loss, when politics will force her lover to choose between her and the Empire. But when her son Constantine becomes Emperor she slowly discovers that her role has gone far beyond that of the traditional mother.Helena finds herself at the center of a crucial turning point in Western history as she seeks a way to bridge the pagan world of the Goddess and the new Christian Empire. And, as Empress-Mother, Helena embarks on a pilgrimage to the Holy Land to find the truth that transcends both the old religion and the new.",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Wilding (Daw Book Collectors)",
        "Authors": "By Friedman, C.S.",
        "Description": "",
        "Category": "",
        "Publisher": "DAW Hardcover",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Let It Rot!: The Home Gardener's Guide to Composting",
        "Authors": "By Campbell, Stu",
        "Description": "",
        "Category": "",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Abel's Island",
        "Authors": "By Steig, William",
        "Description": "Abel's place in his familiar, mouse world has always been secure; he had an allowance from his mother, a comfortable home, and a lovely wife, Amanda. But one stormy August day, furious flood water carry him off and dump him on an uninhabited island. Despite his determination and stubborn resourcefulness--he tried crossing the river with boats and ropes and even on stepping-stones--Abel can't find a way to get back home.Days, then weeks and months, pass. Slowly, his soft habits disappear as he forages for food, fashions a warm nest in a hollow log, models clay statues of his family for company, and continues to brood on the problem of how to get across the river--and home.Abel's time on the island brings him a new understanding of the world he's separated from. Faced with the daily adventure of survival in his solitary, somewhat hostile domain, he is moved to reexamine the easy way of life he had always accepted and discovers skills and talents in himself that hold promise of a more meaningful life, if and when he should finally return to Mossville and his dear Amanda again.",
        "Category": " Juvenile Fiction , Animals , Mice, Hamsters, Guinea Pigs, etc.",
        "Publisher": "Farrar, Straus and Giroux (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "A World Destroyed: The Atomic Bomb and the Grand Alliance",
        "Authors": "By Martin J. Sherwin",
        "Description": "Examines the motives, assumptions, and decisions of the scientists, military men, politicians, and diplomats involved in the development and use of the atomic bomb and their impact on the military and diplomatic conduct of World War II",
        "Category": "",
        "Publisher": "Random House Usa Inc",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Jumping Ship and Other Stories",
        "Authors": "By James, Kelvin Christopher",
        "Description": "Vibrant, magical, musical, pulsing with the rhythms of Trinidad and Harlem, Kelvin Christopher James's prose is as striking and bold as his subject matter. It speaks directly to the heart and the senses as it takes us to such exotic places as a lush but lethal garden of earthly delights or depicts a fledgling drug dealer's grisly revenge.Jumping Ship and Other Stories takes place in Trinidad, the United States, and in between. Part One is set in the Caribbean and gives us lyrical and sensuous tales of growing up and living there: A valiant woman defends her family from a Rastaman who means to frighten them from their home; a pair of tourists invite trouble when they try to photograph an Obeah (witchcraft) rite; a feud between a one-handed butcher and a humpbacked shoemaker reaches its dramatic climax at the full moon.Part Two lets us experience the journey made by those in the Caribbean who would come to the United States. In the title story, two village men jump ship to confront the unimaginable neon, crowds, and noise of the big city. In \"The Vagabond's Genie,\" a wry fugitive perpetrates a wild ruse at a guardhouse on the border.Part Three consists of moving and sometimes violent and shocking stories set in Harlem: A young man in prison contemplates the death of his older brother in a holdup; the relationship between two young drug dealers goes awry with terrifying results; a homeless woman lashes out to defend her territory. The final story concerns a father taking his young Americanized son home to the Caribbean to meet his grandmother for the first time.Kelvin Christopher James's Jumping Ship and Other Stories is about good and evil, rich and poor, macho and matriarchy, dislocation and the meaning of \"home.\" It is the exciting beginning of what promises to be a major literary career.",
        "Category": " Fiction , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Skin in the Game: How Putting Yourself First Today Will Revolutionize Health Care Tomorrow",
        "Authors": "By Harkins, Phil and Hammergren, John",
        "Description": "While the American health care system has consistently been criticized for its noticeable detriments, few have taken the time to recognize the significant benefits and potential of this system. But with Skin in the Game, authors John Hammergren and Phil Harkins provide a comprehensive overview of the history of our health care system, an explanation of its current state, and a picture of the great strides that they see being made in the near future.",
        "Category": " Medical , Health Care Delivery",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Pruning: How-to Guide for Gardeners",
        "Authors": "By Maccaskey, Micheal and Stebbins, Robert L.",
        "Description": "Discusses the efforts of pruning on plant growth and supplies detailed advice on the pruning of trees, shrubs, vines, and flowering plants",
        "Category": " Gardening , General",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Smith & Hawken: The Gardeners' Community Cookbook",
        "Authors": "By Miksch, Alison (PHT) and Wise, Victoria",
        "Description": "A big, ripe cornucopia of a book by gardeners who cook and cooks who garden, Smith & HawkenThe Gardeners' Community Cookbook celebrates both the Smith & Hawken gardening community and Second Harvest, the largest charitable hunger relief organization in the United States. Over 300 contributors from all 50 states share the fruit and vegetables of their labors--the secrets of their tomatoes and their tomato sauce. There are herb growers. Patio gardeners. Farmers. And famous chef/gardeners and writers, such as Deborah Madison, Alice Waters, Barbara Kafka, Ken Hom, Paula Wolfert, Thomas Keller, and Barbara Damrosch, who forces Belgian endive in buckets under the kitchen sink during bitter Maine winters.And what they offer are over 400 recipes that give a cross section of creative American garden cooking. Here are garden-to-table dishes: Spinach and Strawberry Salad; Mexican Bruschetta. Seasonal inspirations: Curried Zucchini Soup; Tortellini with Pumpkin Alfredo; Asparagus Mushroom Flan. Prime pickings: Chicken and Chives; New Mexico Chard Enchiladas. And harvest put-ups: Green Tomato Chutney; Sweet Red Bell Pepper Pickle. Compiled and written by Victoria Wise, this is the cookbook to meet like-minded neighbors and friends you never knew you had, exchanging ideas and recipes just for the pleasure of it.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Steak Lover's Cookbook",
        "Authors": "By Rice, William",
        "Description": "Marrying simplicity and succulence, steak is a food everyone can understand, and one of the very few to inspire genuine craving. Steak is William Rice's avocation, his passion, and he's researched different preparations and flavors of steak from all over the world. A collection of over 140 recipes, steak lover's cookbook is divided between fancy uptown cuts (e.g., tenderloins, porterhouses, ribs) and the plainer but just as tasty downtown cuts (skirt, chuck, flank, round). It includes the Best-Ever recipe for each type, plus dozens of inviting alternatives, not to mention Steak Fries, Outrageous Onion Rings, and Mississippi Mud Pie. It's a steakhouse at home.  84,000 copies in print.",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Haunted Bath (Pitkin Guides)",
        "Authors": "By Matthews, Ruper",
        "Description": "The story of haunted Bath",
        "Category": " Social Science , Folklore & Mythology",
        "Publisher": "Pitkin Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Complete Meat Cookbook: A Juicy and Authoritative Guide to Selecting, Seasoning, and Cooking Today's Beef, Pork, Lamb, and Veal",
        "Authors": "By Kelly, Denis and Aidells, Bruce",
        "Description": "“Grass-fed.” “Organic.” “Natural.” “Pastured.” “Raised Without Antibiotics.” “Heirloom Breed.” Meat has never been better, but the vast array of labels at today’s meat counter can overwhelm even the savviest shopper. Which are worth the price? Which are meaningless? Bruce Aidells, America’s foremost meat expert and the founder of Aidells Sausage Company, makes sense of the confusion and helps you choose the best steaks, chops, roasts, and ribs and match them to the right preparation method.The definitive book for our time, The Great Meat Cookbook includes• hundreds of extraordinary recipes, from such “Great Meat Dishes of the World” as Whole Beef Fillet Stuffed with Prosciutto and Parmigiano-Reggiano to economical dishes that use small amounts of meat, like Thai Pork Salad, to American classics like Steak House Grilled Rib Eye• handy recipe tags like “Fit for Company,” “In a Hurry,” and “Great Leftovers” that help you match each dish to the occasion• at-a-glance guides to all the major cuts, with a full-color photo of each• recipes for handcrafted sausages, pâtés, confits, and hams• recipes for newly popular meats like bison, goat, heirloom pork, and grass-fed beef, veal, and lamb• recipes for underappreciated parts that make delicious dishes without breaking the bankWith straight talk and an affable voice, Aidells provides every single bit of information you need to get comfortable in the kitchen, from which thermometers are the most reliable, to instructions for thawing frozen meat from the farmers’ market, to tips that will make you a grill and barbecue pro.",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The News from Paraguay: A Novel",
        "Authors": "By Tuck, Lily",
        "Description": "The year is l854. In Paris, Francisco Solano -- the future dictator of Paraguay -- begins his courtship of the young, beautiful Irish courtesan Ella Lynch with a poncho, a Paraguayan band, and ahorse named Mathilde. Ella follows Franco to Asunción and reigns there as his mistress. Isolated and estranged in this new world, she embraces her lover's ill-fated imperial dream -- one fueled by a heedless arrogance that will devastate all of Paraguay.With the urgency of the narrative, rich and intimate detail, and a wealth of skillfully layered characters, The News from Paraguay recalls the epic novels of Gabriel García Márquez and Mario Vargas Llosa.",
        "Category": " Fiction , War & Military",
        "Publisher": "HarperPerennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Be My Knife: A Novel",
        "Authors": "By Grossman, David, Almog, Vered (TRN), and Gurantz, Maya (TRN)",
        "Description": "The international bestseller: a compelling love story from the leading Israeli novelist of his generation\"We  could be like two people who inject themselves with truth serum, and at  long last have to tell it--the truth.  I want to be able to say to  myself, 'I bled truth with her,' yes, that's what I want.  Be a knife  for me, and I, I swear, will be a knife for you.\"An awkward,  neurotic seller of rare books writes a desperate letter to a beautiful  stranger whom he sees at a class reunion.  This simple, lonely attempt  at seduction begins a love affair of words between Yair and Miriam, two  married, middle-aged adults, dissatisfied with their lives, yearning for  the connection that has always eluded them--and, eventually, reawakened  to feelings that they thought had passed them by.  Their correspondence  unfolds into an exchange of their most naked confessions: of desire,  childhood tragedies, joys, and humiliations. Through the  dialogue between Yair--a family man and surprisingly successful  adulterer, whose complex, guarded letters reveal a life of secrets kept  from the people closest to him--and Miriam, at first deceptively open  and warm, who fills her life with distraction to avoid a past full of  painful secrets, Be My Knife explores the nature and the limits of intimacy. A deep departure from David Grossman's previous work, Be My Knife is his subtlest, most passionate novel yet.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Picador",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Believing in Ourselves: The Wisdom of Women",
        "Authors": "By Eisen, Armand",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "So Big (Perennial Classics)",
        "Authors": "By Ferber, Edna",
        "Description": "Winner of the 1924 Pulitzer Prize, So Big is widely regarded as Edna Ferber's crowning achievement. A rollicking panorama of Chicago's high and low life, this stunning novel follows the travails of gambler's daughter Selina Peake DeJong as she struggles to maintain her dignity, her family, and her sanity in the face of monumental challenges.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial Modern Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Gentlemen of the Road: A Tale of Adventure",
        "Authors": "By Chabon, Michael",
        "Description": "#1 SAN FRANCISCO CHRONICLE BESTSELLER • NAMED ONE OF THE BEST BOOKS OF THE YEAR BY THE CHICAGO TRIBUNE“A picaresque, swashbuckling adventure.”—The Washington Post Book WorldThey’re an odd pair, to be sure: pale, rail-thin, black-clad Zelikman, a moody, itinerant physician fond of jaunty headgear, and ex-soldier Amram, a gray-haired giant of a man as quick with a razor-tongued witticism as with a sharpened battle-ax. Brothers under the skin, comrades in arms, they make their rootless way through the Caucasus Mountains, circa a.d. 950, living as they please and surviving however they can—as blades and thieves for hire and as practiced bamboozlers, cheerfully separating the gullible from their money. But when they are dragooned into service as escorts and defenders to a prince of the Khazar Empire, they soon find themselves the half-willing generals in a full-scale revolution—on a road paved with warriors and whores, evil emperors and extraordinary elephants, secrets, swordplay, and such stuff as the grandest adventures are made of.Praise for Gentlemen of the Road“Within a few pages I was happily tangled in [Chabon’s] net of finely filigreed language, seduced by an old-school-style swashbuckling quest . . . laced with surprises and humor.”—San Francisco Chronicle “[Chabon] is probably the premiere prose stylist—the Updike—of his generation.”—Time “The action is intricate and exuberant. . . . It’s hard to resist its gathering momentum, not to mention the sheer headlong pleasure of Chabon’s language.”—The New York Times Book Review “[A] wild, wild adventure . . . abounds with lush language . . . This book roars to be read aloud.”—Chicago Sun-Times",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Pie in the Sky: A Memoir About Writing and Publishing",
        "Authors": "By Johnston, Patricia Condon",
        "Description": "",
        "Category": " Biography & Autobiography , Business",
        "Publisher": "Afton Historical Society Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Air Force Role in Low-Intensity Conflict, The",
        "Authors": "By Lt Col David J. Dean, USAF",
        "Description": "",
        "Category": "",
        "Publisher": "Air University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Pendragon Chronicles: Heroic Fantasy From the Time of King Arthur",
        "Authors": "By Ashley, Mike (EDT)",
        "Description": "A look at the legend of King Arthur features sixteen retellings--by John Steinbeck, Andre Norton, John Brunner, and other writers--that capture all the romance and excitement of earlier accounts.",
        "Category": "",
        "Publisher": "Wings Books",
        "Price Starting With ($)": "18.77",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Savoring France: Recipes and Reflections on French Cooking (The Savoring Series)",
        "Authors": "By Williams, Chuck, Williams, Chuck (EDT), and Brennan, Georgeanne",
        "Description": "Presents recipes celebrating the cuisine of France",
        "Category": "",
        "Publisher": "Time Life Books",
        "Price Starting With ($)": "8.56",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "On the Border: Portraits of America's Southwestern Frontier",
        "Authors": "By Miller, Tom",
        "Description": "Focuses on the people, problems, and folklore of the unique society living along the border between the United States and Mexico",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Univ of Arizona Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "The Illustrated Encyclopedia of Classical Music: A Guide to Composers and Recommended Recordings",
        "Authors": "By Salter, Lionel",
        "Description": "Contains more than one hundred thirty entries of recommended recorded versions and outlines a suggested discography for the definitive classical music collection",
        "Category": "",
        "Publisher": "Crown Pub",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "The Alamo",
        "Authors": "By Guerra, Mary Ann Noonan",
        "Description": "",
        "Category": "",
        "Publisher": "Alamo Pr",
        "Price Starting With ($)": "19.97",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Antietam: The Soldiers' Battle",
        "Authors": "By Priest, John Michael",
        "Description": "On September 13, 1862, in a field near Frederick, Maryland, four Union soldiers hit the jack-pot.  There they found, wrapped carelessly around three cigars, a copy of General Robert E. Lee's most recent orders detailing Southern objectives and letting Union officers know that Lee had split his Army into four vulnerable groups.  General George B. McClellan realized his opportunity to destroy the Army of Northern Virginia one piece at a time.  \"If I cannot whip Bobbie Lee,\" exulted McClellan, \"I will be willing to go home.\"  But the notoriously prudent Union general allowed precious hours to pass, and, by the time he moved, Lee's army had begun to regroup and prepare for battle near Antietam Creek.  The ensuing fight would prove to be not only the bloodiest single day of the entire Civil War, but the bloodiest in the history of the U.S. Army.       Countless historians have analyzed Antietam (known as Sharpsburg in the South) and its aftermath, some concluding that McClellan's failure to vanquish Lee constituted a Southern victory, others that the Confederate retreat into Virginia was a strategic win for the North.  But in Antietam: The Soldiers' Battle, historian John Michael Priest tells this brutal tale of slaughter from an entirely new point of view: that of the common enlisted man. Concentrating on the days of actual battle--September 16, 17, and 18, 1862--Priest vividly brings to life the fear, the horror, and the profound courage that soldiers displayed, from the first Federal cavalry probe of the Confederate lines to the last skirmish on the streets of Sharpsburg.  Antietam is not a book about generals and their grand strategies, but rather concerns men such as the Pennsylvanian corporal who lied to receive the Medal of Honor; the Virginian who lay unattended on the battlefield through most of the second day of fighting, his arm shattered from a Union artillery shell; the Confederate surgeon who wrote to the sweetheart he left behind enemy lines in Harrisburg, Pennsylvania that he had seen so much death and suffering that his \"head had whitened and my very soul turned to stone.\"       Besides being a gripping tale charged with the immediacy of firsthand accounts of the fighting, Antietam also dispels many misconceptions long held by historians and Civil War buffs alike.  Seventy-two detailed maps--which describe the battle in the hourly and quarter-hourly formats established by the Cope Maps of 1904--together with rarely-seen photographs and his own intimate knowledge of the Antietam terrain, allow Priest to offer a substantially new interpretation of what actually happened.        When the last cannon fell silent and the Antietam Creek no longer ran red with Union and Confederate blood, twice as many Americans had been killed in just one day as lost their lives in the War of 1812, the Mexican War, and the Spanish-American war combined.  This is a book about battle, but more particularly, about the human dimension in battle.  It asks \"What was it like?\" and while the answers to this simple question by turns horrify and fascinate, they more importantly add a whole new dimension to the study of the American Civil War.",
        "Category": " Art , Sculpture & Installation",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Hurricane of Independence: The Untold Story of the Deadly Storm at the Deciding Moment of the American Revolution",
        "Authors": "By Williams, Tony",
        "Description": "THE AMERICAN COLONIES WERE IN THE CLUTCHES OF TWO DEADLY STORMS Only months before, the first shot of what would become the American Revolution had been fired. But not everyone was committed to battle. The people were caught between a patriotic fervor for the cause of liberty and deep concern about the righteousness of, and the danger in, rebelling against the world's largest empire. And unbeknowst to them, as September 1775 opened, a powerful hurricane was making its way across the Atlantic, one that would test the colonists' strength, resolve, and faith in the rebellion. Hurricane of Independence is the untold story of a violent storm and the violent birth of a nation. On September 2, 1775, the 8th deadliest Atlantic hurricane of all time landed on American shores. Over the coming days, it would race up the East Coast, striking all of the important colonial capitals and eventually killing more than four thousand people. In an era where hurricanes were viewed as omens from God, what this storm meant to the colonists about the justness of their cause would yield unexpected results.  Hurricane of Independence is the story of the individual people in the eye of the storm and how they saved the American Revolution. From well-known founders like George Washington, Thomas Jefferson, and Benjamin Franklin to ordinary individuals such as sailors, escaped slaves, farmers, and fishermen, Tony Williams paints a stunning picture of what it meant to live at the opening of the American Revolution and the incredible weight of the choice the people were facing at that deciding moment. Hurricane of Independence brings to life an incredible moment when the forces of nature and the forces of history came together, and the courageous stories of sacrifice, survival, and strength amidst the fight for freedom.",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "Sourcebooks Inc",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Desperate Engagement: How a Little-Known Civil War Battle Saved Washington, D.C., and Changed American History",
        "Authors": "By Leepson, Marc",
        "Description": "The Battle of Monocacy, which took place on the blisteringly hot day of July 9, 1864, is one of the Civil War’s most significant yet little-known battles. What played out that day in the corn and wheat fields four miles south of Frederick, Maryland., was a full-field engagement between some 12,000 battle-hardened Confederate troops led by the controversial Jubal Anderson Early, and some 5,800 Union troops, many of them untested in battle, under the mercurial Lew Wallace, the future author of Ben-Hur. When the fighting ended, some 1,300 Union troops were dead, wounded or missing or had been taken prisoner, and Early---who suffered some 800 casualties---had routed Wallace in the northernmost Confederate victory of the war.Two days later, on another brutally hot afternoon, Monday, July 11, 1864, the foul-mouthed, hard-drinking Early sat astride his horse outside the gates of Fort Stevens in the upper northwestern fringe of Washington, D.C. He was about to make one of the war’s most fateful, portentous decisions: whether or not to order his men to invade the nation’s capital.  Early had been on the march since June 13, when Robert E. Lee ordered him to take an entire corps of men from their Richmond-area encampment and wreak havoc on Yankee troops in the Shenandoah Valley, then to move north and invade Maryland. If Early found the conditions right, Lee said, he was to take the war for the first time into President Lincoln’s front yard. Also on Lee’s agenda: forcing the Yankees to release a good number of troops from the stranglehold that Gen. U.S. Grant had built around Richmond.Once manned by tens of thousands of experienced troops, Washington’s ring of forts and fortifications that day were in the hands of a ragtag collection of walking wounded Union soldiers, the Veteran Reserve Corps, along with what were known as hundred days’ men---raw recruits who had joined the Union Army to serve as temporary, rear-echelon troops. It was with great shock, then, that the city received news of the impending rebel attack. With near panic filling the streets, Union leaders scrambled to coordinate a force of volunteers.But Early did not pull the trigger. Because his men were exhausted from the fight at Monocacy and the ensuing march, Early paused before attacking the feebly manned Fort Stevens, giving Grant just enough time to bring thousands of veteran troops up from Richmond. The men arrived at the eleventh hour, just as Early was contemplating whether or not to move into Washington. No invasion was launched, but Early did engage Union forces outside Fort Stevens. During the fighting, President Lincoln paid a visit to the fort, becoming the only sitting president in American history to come under fire in a military engagement.Historian Marc Leepson shows that had Early arrived in Washington one day earlier, the ensuing havoc easily could have brought about a different conclusion to the war. Leepson uses a vast amount of primary material, including memoirs, official records, newspaper accounts, diary entries and eyewitness reports in a reader-friendly and engaging description of the events surrounding what became known as “the Battle That Saved Washington.”  Praise for Flag: An American Biography“There is no story about the flag that he omits…. [We] now have a comprehensive guide to its unfolding.”---The Wall Street Journal “The fascination of history is in its details, and the author of Flag: An American Biography knows how to find them and turn them into compelling reading. This book brings out the irony, humor, myth, and behind-the-scenes happenings that make our flag’s 228-year history so fascinating.”---The Saturday Evening Post “Flag is a valuable addition to American history, and Leepson...certainly is due a portion of authorly glory for this absorbing account of America’s national icon.”---Richmond Times-Dispatch “Timely and insightful.”---The Dallas Morning News “To understand the USA and her citizens, it is necessary to understand the origins, the legends, and the meaning of our flag. Marc Leepson’s Flag is a grand book, worthy of its grand subject.”---Homer Hickam, author of Rocket Boys and The Keeper’s Son “Flag is a very significant contribution to our history. And it is a book that everyone who cares about the United States should read.”---Veteran Magazine",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "24.48",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Stripped: Uncensored Grace on the Streets of Vegas",
        "Authors": "By Wilhite, Jud and Taaffe, Bill (CON)",
        "Description": "“Uncensored grace is what you get from a loving God when all the religious types have gone home, and every last hope for your own effort has blown up in your face.”What comes to mind first when you think “Las Vegas”? Maybe glitz and glam. Or dealers and dancers, high rollers and hell raisers. And why not? After all, the town they call Sin City is an American icon, an anything-goes shrine to pleasure, money, sex–and another lucky roll of the dice.Probably when you think Las Vegas, you don’t think about God or grace.Neither did Jud Wilhite when he was first invited to become the senior pastor at the city’s largest church. But the people he’s met since moving there with his family have changed all that. Today, Vegas stands for something much different and more surprising for Jud. He doesn’t think of Vegas as Sin City anymore. Now, to him, it is Grace City.Working with veteran journalist Bill Taaffe, Jud takes you past the neon and the hype to another side of Vegas–where people whose lives have been marred by loneliness, addiction, and despair are finding hope and freedom in a vital community of faith. Stripped is an account of what happens when ordinary people get honest with each other and an extraordinary God. In its pages you’ll meet gaming industry movers and shakers. You’ll meet working exotic dancers, a Flying Elvis, an American Idol contestant, a cop who won the hearts of a crime-hardened city, and more.Each of them has encountered what Jud calls “uncensored grace.” He writes, “Uncensored means that there is no formula or membership or performance that stands between you and God’s goodness.”Stripped is their unforgettable account of people who are betting everything on a very big idea: that as wide and deep and high as your mountain of personal ruin might get, God’s transforming grace is always wider and deeper and higher.",
        "Category": " Religion , Christianity , History",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Japan",
        "Authors": "By Spry-Leverton, Peter, Kornicki, Peter, and Sackett, Joel",
        "Description": "Describes modern life in Japan, briefly looks at Japan's history, and discusses Japanese culture, industry, and social customs",
        "Category": " History , General",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    }
]