[
    {
        "Title": "How to Be a Christian Without Being Religious (Bible Commentary for Layman)",
        "Authors": "By Ridenour, Fritz",
        "Description": "",
        "Category": " Religion , Biblical Criticism & Interpretation , New Testament",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Super-Fine Valentine (A Little Bill Book for Beginning Readers)",
        "Authors": "By Cosby, Bill and Honeywood, Varnette P. (ILT)",
        "Description": "Little Bill's friends are teasing him! They say he's in love!Will he get them to stop?Now available in Scholastic Reader!Little Bill has a crush, and it's on his classmate Mia! But he doesn't know how to handle these new emotions. He feels awkward when the other kids tease him, and he runs away whenever he sees her.Soon Valentine's Day arrives, and Little Bill makes a card for Mia with a poem inside, but he is too shy to give it to her. The other kids don't seem to have a problem sharing their cards, though, so Little Bill finally decides that he will give his card to Mia.And he learns that it's better to let people know that you like them!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Leadership",
        "Authors": "By Dubrin, Andrew J.",
        "Description": "You're no idiot, of course.  You handle your work assignments, monitor the progress of your workgroup, and meet your goals.  But when it comes to inspiring others and creating change in your organization, you're confused about what to do next.  Want some help? The Complete Idiot's Guide to Leadership shows you how to start thinking and acting like a leader who can help people perform well and meet organizational goals for increased productivity, quality, and customer satisfaction.  In this complete Idiot's Guide, you get:",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Alpha",
        "Price Starting With ($)": "9.03",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Gingerbread Boy",
        "Authors": "By Landoll, Inc.",
        "Description": "",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Landoll, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Miracle Strain: A Genetic Thriller",
        "Authors": "By Cordy, Michael",
        "Description": "Dr. Tom Carter - surgeon, geneticist, husband, father - is riding high. He has invented a revolutionary machine, the Genescope, that can decode the blueprint of man. From the DNA found in just one hair follicle, Carter can read a person's genes, predicting the onset of disease, determining how and when he or she will die.But at the moment of his greatest triumph, as he is being presented the Nobel Prize for medicine, Carter's world is shattered: An assassin's bullet meant for him kills his wife.In the aftermath of her death, a Genescope scan reveals that his young daughter, Holly, has inherited an incurable brain disease and has less than a year to live. His greatest achievement, which will save countless lives, can offer his beloved daughter only a death sentence. Even the most advanced medical science cannot save her. Tom Carter needs a miracle.A secret brotherhood, two thousand years old, may have the answer. Its members need his new technology to complete a sacred quest of their own. In return they offer Carter the chance to decode the DNA of the most famous healer in history - to look beyond the genes of man and into the genes of God.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "CliffsNotes on Hemingway's A Farewell to Arms",
        "Authors": "By Roberts, J. L. (EDT)",
        "Description": "Cliffs Test Preparation Guides help students prepare for and improve their performance on standardized tests ACT Preparation Guide CBEST Preparation Guide CLAST Preparation Guide ELM Review GMAT Preparation Guide GRE Preparation Guide LSAT Preparation Guide MAT Preparation Guide MATH Review for Standardized Tests MSAT Preparation Guide Memory Power for Exams Police Officer Examination Preparation Guide Police Sergeant Examination Preparation Guide Police Management Examinations Preparation Guide Postal Examinations Preparation Guide Praxis I: PPST Preparation Guide Praxis II: NTE Core Battery Preparation Guide SAT Preparation Guide SAT II Writing Preparation Guide TASP Preparation Guide TOEFL Preparation Guide with 2 cassettes Advanced Practice for the TOEFL with 2 cassettes Verbal Review for Standardized Tests Writing Proficiency Examinations You Can Pass the GED Cliffs Quick Reviews help students in introductory college courses or Advanced Placement classes Algebra I Algebra II Anatomy & Physiology Basic Math and Pre-Algebra Biology Calculus Chemistry Differential Equations Economics Geometry Linear Algebra Microbiology Physics Statistics Trigonometry Cliffs Advanced Placement Preparation Guides help high school students taking Advanced Placement courses to earn college credit AP Biology AP Calculus AB AP Chemistry AP English Language & Composition AP English Literature & Composition AP United States History Cliffs Complete Study Editions are comprehensive study guides with complete text, running commentary and glossary Chaucer's Prologue Chaucer's Wife of Bath Hamlet Julius Caesar King Henry IV, Part I King Lear Macbeth The Merchant of Venice Othello Romeo and Juliet The Tempest Twelfth Night See inside back cover for listing of Cliffs Notes titles Registered trademarks include: GRE, MSAT, the Praxis Series, and TOEFL (Educational Testing Service); AP, Advanced Placement Program, and SAT (College Entrance Examination Board); GMAT (Graduate Management Admission Council); and LSAT (Law School Admission Council.) A Farewell to Arms",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Shakespeare's Macbeth (Cliff's Notes)",
        "Authors": "By Cliffs Notes, Inc.",
        "Description": "",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "CliffsNotes on Orwell's 1984",
        "Authors": "By Thompson, F. (EDT)",
        "Description": "If your latest assignment has you so confused that you're actually beginning to think that 2 + 2 does equal 5, then let CliffsNotes on 1984 help you navigate the tumultuous waters of George Orwell's dystopian world of Oceania. The expert commentaries and critical analyses in this study guide will help you decipher the Doublethink and Newspeak of what is possibly the most complicated socio-political novel ever written. Character studies of protagonist Winston Smith, his ally and love interest Julia, his nemesis O'Brien, and Big Brother himself give you insight into what it might be like to live in such an oppressed society, and the CliffsNotes Review and Resource Center will provide you with valuable tools for getting the most out of Orwell's classic novel.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Hansel and Gretel (Fairy Tale Classics Storybook)",
        "Authors": "By Landoll",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "When I Grow Up (Look-Look)",
        "Authors": "By Mayer, Mercer",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Grapes of Wrath: Including Life and Background, Introduction, General Plot Summary, List of Characters, Chapter Summaries and Commentaries",
        "Authors": "By Roberts, James Lamar and Carey, G. K. (EDT)",
        "Description": "",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1965"
        }
    },
    {
        "Title": "The Wife of Bath and Other Cantebury Tales",
        "Authors": "By Chaucer, Geoffrey",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Cabrillo National Monument",
        "Authors": "By Brown, Joseph E.",
        "Description": "",
        "Category": "",
        "Publisher": "Cabrillo Historical Assn",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "The road to Huddersfield: A journey to five continents",
        "Authors": "By Morris, James.",
        "Description": "",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Washington, D.C., Then and Now (Then & Now)",
        "Authors": "By Mitchell, Alexander D.",
        "Description": "Millions of schoolchildren and visitors make the pilgrimage to our nation's capital each year. Built on reclaimed swampland, Washington is now the country's neoclassical seat of government and culture. Now you can witness Washington's development over the last century and a half. Seventy modern color photographs are compared side-by-side with seventy archival photographs from the 1850s to the 1950s. While focusing on famous vistas and familiar landmarks, it also explores well-known neighborhoods. The Then and Now series includes: New York, Washington, Boston, and San Francisco.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Thunder Bay Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "My Big Fat Greek Diet: How a 467-Pound Physician Hit His Ideal Weight and How You Can Too",
        "Authors": "By Yorkey, Mike (CON) and Yphantides, Nick, M.D.",
        "Description": "In My Big Fat Greek Diet, Dr. Nick Yphantides teaches readers the powerful 7 Pillars of Weight Loss, which features medically safe, practical how-tos anyone can apply, whether they need to lose 10 or 300 pounds. Analyzing components of a variety of diets, Dr. Nick assists readers in customizing a weight-loss program to their specific needs and lifestyles.Topping out at 467 pounds, Dr. Nick was known in San Diego as a big man with a big heart. When a battle with cancer inspired him to focus on his own health, he embarked on a lifestyle change that would drop him to a svelte 200 pounds. His book, now in trade paper, will inspire and equip readers to design a program that allows them to experience their own weight-loss miracle!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Descartes' Error",
        "Authors": "By Damasio, Antonio R.",
        "Description": "In this wondrously lucid and engaging book, renowned neurologist Antonio Damasio demonstrates what many of us have long suspected: emotions are not a luxury, they are essential to rational thinking.Descartes' Error takes the reader on an enthralling journey of scientific discovery, starting with the case of Phineas Gage--a construction foreman who in 1848 survived a freak accident in which a 3 1/2 foot iron rod passed through his head--and continuing on to Damasio's experiences with modern-day neurological patients affected by brain damage. Far from interfering with rationality, his research shows us, the absence of emotion and feeling can break down rationality and make wise decision making almost impossible.",
        "Category": " Psychology , General",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Rumsfeld's War: The Untold Story of America's Anti-Terrorist Commander",
        "Authors": "By Scarborough, Rowan",
        "Description": "Bush's Pentagon chief emerges from the pages of this journalistic portrait as a mixture of embattled hero and shrewd chief executive officer, battling terrorists and bureaucrats alike in an almost single-handed effort to win the so-called \"War on Terror.\" Scarborough ( Washington Times ), while allowing occasional criticisms of the Defense Secretary to slip through, primarily celebrates Rumsfeld's most recent tenure as Secretary, describing his Pentagon restructuring efforts, his decisions regarding the wars in Afghanistan and Iraq, his increasing reliance on special operations, and his battles with senior military men and other members of the Bush administration. One chapter offers a biographical portrait of somewhat wider scope. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Childsplay: A Collection of Scenes and Monologues for Children (Limelight)",
        "Authors": "By Muir, Kerry (EDT)",
        "Description": "(Limelight). \" Childsplay  is a very charming and enchanting book   and an important book for children who want to act! Not only can they use this wonderful collection as a guide to the sorts of plays and parts that are available to them, they will discover here how plays ca be read just for pleasure. And they will particularly enjoy the selections written by children themselves.\"  Julie Harris",
        "Category": " Performing Arts , Monologues & Scenes",
        "Publisher": "Limelight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Taylor's Pocket Guide to Herbs and Edible Flowers",
        "Authors": "By Taylor, Norman and Reilly, Ann (EDT)",
        "Description": "Herbs are both easy to grow and a delicious addition to almost any meal. The Pocket Guide to Herbs and Edible Flowers illustrates over 75 plants, including basil, rosemary, oregano, and sunflowers. Special tips for best climate and planting are included for each plant.",
        "Category": " Gardening , Herbs",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Secrets of Power Persuasion: Everything You'll Ever Need to Get Anything You'll Ever Want",
        "Authors": "By Dawson, Roger",
        "Description": "A guide to developing the art of persuasion supplies specific instructions on how to develop charisma, nurture a sense of humor, build credibility, create an obligation, bond with people, and more. Original.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "What's the Big Deal?: Why God Cares about Sex (God's Design for Sex)",
        "Authors": "By Jones, Brenna B. and Jones, Stan",
        "Description": "",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Facing the Facts: The Truth About Sex and You (God's Design for Sex, Book 4)",
        "Authors": "By Jones, Brenna B. and Jones, Stan",
        "Description": "",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "The Washington Historical Atlas: Who Did What When and Where in the Nation's Capital",
        "Authors": "By Bergheim, Laura",
        "Description": "A guidebook to the capital from its inception to the present the author's engaging narrative is interspersed with historical journal and diary entries, social notes, and old advertisements, as well as photos, prints, maps, and drawings. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , United States , General",
        "Publisher": "Woodbine House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Complete Book of Home Storage of Vegetables and Fruits",
        "Authors": "By Loveday, Evelyn V",
        "Description": "",
        "Category": "",
        "Publisher": "Garden Way Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Your Two-Year-Old: Terrible or Tender",
        "Authors": "By Ames, Louise Bates and Ilg, Frances L.",
        "Description": "Are two-year-olds really so terrible, or does the world have a slightly skewed view of this sometimes difficult, sometimes adorable lot? Drs. Ames and Ilg, recognized worldwide as authorities on child behavior and development, offer parents practical advice and enlightening psychological insights on children this age.   What are two-year-old girls and boys thinking and feeling? How do they see others around them? With humor and compassion, the authors describe the general characteristics of these complex toddlers: their physical growth trends, their emotional and psychological maturation. Also included are insights into how two-year-olds behave with family and other children, and advice on how to handle them, as well as tings to avoid.   Included in this book: • A two-year-old’s view of the world—and himself • Bath and dressing routines • Sex differences • Stories from real life • A list of age-appropriate toys and books • A bibliography for parents   “Louise Bates Ames and her colleagues synthesize a lifetime of observation of children, consultation, and discussion with parents. These books will help parents to better understand their children and will guide them through the fascinating and sometimes trying experiences of modern parenthood.”—Donald J. Cohen, M.D., Director, Yale Child Study Center, Irving B. Harris Professor of Child Psychiatry, Pediatrics, and Psychology, Yale School of Medicine",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "DELL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1980"
        }
    },
    {
        "Title": "Your Three-Year-Old: Friend or Enemy",
        "Authors": "By Ames, Louise Bates and Ilg, Frances L.",
        "Description": "A three-year-old is a real puzzle to parents, sometimes anxious to please and befriend, sometimes strong-willed and difficult to get along with. At the heart of the three-year-old’s personality is often an emotional insecurity—and this causes a host of problems for parents! Drs. Ames and Ilg, recognized authorities on child behavior and development, help parents understand what’s going on inside that three-year-old head, what problems children have, and how to cope with the toddler who is sometimes friend, sometimes enemy.   Included in this book: • Jealousy of a new sibling • Toilet training • How to improve a child’s eating habits • Friendships with peers • Common fears • Developing language skills • Nursery school • Books for parents and three-year-olds   “Louise Bates Ames and her colleagues synthesize a lifetime of observation of children, consultation, and discussion with parents. These books will help parents to better understand their children and will guide them through the fascinating and sometimes trying experiences of modern parenthood.”—Donald J. Cohen, M.D., Director, Yale Child Study Center, Irving B. Harris Professor of Child Psychiatry, Pediatrics, and Psychology, Yale School of Medicine",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Dell Trade Paperback",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "Lucy Comes to Stay",
        "Authors": "By Wells, Rosemary and Graham, Mark (ILT)",
        "Description": "Mary Elizabeth loves her new puppy Lucy but discovers that puppies need special care and understanding",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Dial",
        "Price Starting With ($)": "37.48",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Picture Perfect Walls: Techniques & Ideas for Framing, Matting & Wall Arrangements",
        "Authors": "By The Home Decorating Institute",
        "Description": "Offers advice and instructions on creating wall decorations, building wooden boxes and shelves, creating floral wall accessories, and embellishing ordinary picture frames",
        "Category": "",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Life's Healing Choices: Freedom from Your Hurts, Hang-ups, and Habits",
        "Authors": "By Baker, John and Warren, Rick (FRW)",
        "Description": "LIFE HAPPENS.    Happiness and Healing are yours for the choosing.    We've all been hurt by other people, we've hurt ourselves, and we've hurt others. And as a result, every single one of us ends up with some sort of hurt, hang-up, or habit. But the question we all face is, Where do we go from here?   Life's Healing Choices offers freedom from our hurts, hang-ups, and habits through eight healing choices that promise true happiness and life transformation. Using the Beatitudes of Jesus as a foundation, Senior Pastor Rick Warren of Saddleback Church and John Baker, who is also a pastor at Saddleback, developed the eight choices shared in this book.   In addition to practical, encouraging biblical teaching, each chapter includes two real-life stories of men and women whose lives have been transformed by living out the eight choices in this book. Through making each of these choices, you too will find God's pathway to wholeness, growth, spiritual maturity, happiness, and healing. You'll find real answers, real hope, and a real future -- one healing choice at a time.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Quilts Say It Best",
        "Authors": "By Westfall, Eileen",
        "Description": "",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Martingale & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Presidential Courage: Brave Leaders and How They Changed America 1789-1989",
        "Authors": "By Beschloss, Michael R.",
        "Description": "From the acclaimed bestselling author of The ConquerorsMichael Beschloss has brought us a brilliantly readable and inspiring saga about crucial times in America's history when a courageous President dramatically changed the future of the United States.With surprising new sources and a dazzling command of history and human character, Beschloss brings to life these flawed, complex men -- and their wives, families, friends and foes. Never have we had a more intimate, behind-the-scenes view of Presidents coping with the supreme dilemmas of their lives.You will be in the room with the private George Washington, braving threats of impeachment and assassination to make peace with England. John Adams, incurring his party's \"unrelenting hatred\" by refusing to fight France and warning his enemies, \"Great is the guilt of an unnecessary war.\" Andrew Jackson, in a death struggle against the corrupt Bank of the United States. Abraham Lincoln, risking his Presidency to insist that slaves be freed.Beschloss also shows us Theodore Roosevelt, taunting J. P. Morgan and the Wall Street leaders who dominated his party. Franklin Roosevelt, defying the isolationists -- and maybe the law -- to stop Adolf Hitler. Harry Truman, risking a walkout by top officials to recognize a Jewish state. John Kennedy, the belated champion of civil rights, complaining that he has cost himself a second term. And finally, two hundred years after Washington, Ronald Reagan, irking some of his oldest backers to seek an end to the Cold War.As Beschloss shows in this gripping and important book, none of these Presidents was eager to incur ridicule, vilification or threats of political destruction and even assassination. But in the end, bolstered by friends and family, hidden private beliefs and, sometimes, religious faith, each ultimately proved himself to be, in Andrew Jackson's words, \"born for the storm.\"",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Be Near Me",
        "Authors": "By O'Hagan, Andrew",
        "Description": "\"Always trust a stranger,\" said David’s mother when he returned from Rome. \"It’s the people you know who let you down.\" Half a life later, David is Father Anderton, a Catholic priest with a small parish in Scotland. He befriends Mark and Lisa, rebellious local teenagers who live in a world he barely understands. Their company stirs memories of earlier happiness—his days at a Catholic school in Yorkshire, the student revolt in 1960s Oxford, and a choice he once made in the orange groves of Rome. But their friendship also ignites the suspicions and smoldering hatred of a town that resents strangers, and brings Father David to a reckoning with the gathered tensions of past and present. In this masterfully written novel, Andrew O’Hagan explores the emotional and moral contradictions of religious life in a faithless age.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Donovan Legacy: Captivated/ Entranced/ Charmed",
        "Authors": "By Roberts, Nora",
        "Description": "Three extraordinary cousins--Morgana, Sebastian, and Anastasia--who have inherited some most unusual magical talents from their Celtic ancestors--find true love, in a trio of novels--Captivated, Entranced, and Charmed. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Babbitt",
        "Authors": "By Lewis, Sinclair",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Dibs in Search of Self",
        "Authors": "By Axline, Virginia M.",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1977"
        }
    },
    {
        "Title": "Waking the Dead: The Glory of a Heart Fully Alive",
        "Authors": "By Eldredge, John",
        "Description": "There is a glory to life that most people-including believers-never see. In this insightful new book, John Eldredge presents the heart as central to life. Not only is the heart essential; the heart God has ransomed is also good. Building on these foundational truths, Eldredge shows readers why real Christianity is a process of restoration, where the broken parts of our hearts are mended and the captive parts are set free.Waking the Dead leads listeners to understand how to live from the heart, care for their heart like the treasures of the kingdom, and give from fullness instead of emptiness. This message also shows how living from the heart can energize people to love God and others in a way they've never experienced, revealing to them life's purpose: fighting for the hearts of others.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Extras (The Uglies)",
        "Authors": "By Westerfeld, Scott",
        "Description": "FameIt's a few years after rebel Tally Youngblood took down the uglies/pretties/specials regime. Without those strict roles and rules, the world is in a complete cultural renaissance. \"Tech-heads\" flaunt their latest gadgets, \"kickers\" spread gossip and trends, and \"surge monkeys\" are hooked on extreme plastic surgery. And it's all monitored on a bazillion different cameras. The world is like a gigantic game of American Idol. Whoever is getting the most buzz gets the most votes. Popularity rules. As if being fifteen doesn't suck enough, Aya Fuse's rank of 451,369 is so low, she's a total nobody. An extra. But Aya doesn't care; she just wants to lie low with her drone, Moggle. And maybe kick a good story for herself.Then Aya meets a clique of girls who pull crazy tricks, yet are deeply secretive of it. Aya wants desperately to kick their story, to show everyone how intensely cool the Sly Girls are. But doing so would propel her out of extra-land and into the world of fame, celebrity...and extreme danger. A world she's not prepared for.",
        "Category": " Young Adult Fiction , Science Fiction , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Earth and Sky (First Discovery Book)",
        "Authors": "By Jeunesse, Gallimard, Perols, Sylvaine (ILT), and Verdet, Jean-Pierre",
        "Description": "Colorful drawings encourage young readers to turn a brightly colored transparent page to reveal the Earth revolving around the Sun, in a sturdy board book.",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Daily Fitness and Nutrition Journal",
        "Authors": "By Fahey, Thomas D., Insel, Paul M., Roth, Walton T.",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Better Homes and Gardens Rug Making",
        "Authors": "By Gerald Knox",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Better Homes and Gardens: Afghans to Knit & Crochet",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "White Crochet",
        "Authors": "By Edited by Knox, Gerald M.",
        "Description": "Includes patterns for making crocheted table linens, pillows, samplers, bed linens, and baby gifts",
        "Category": " Crafts & Hobbies , Needlework , Crocheting",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Better Homes and Gardens New Patchwork and Quilting Book",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Cruelty: Poems",
        "Authors": "By Ai",
        "Description": "",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "37.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Only You, Sierra (The Sierra Jensen Series #1)",
        "Authors": "By Gunn, Robin Jones",
        "Description": "Normally a confident and adventurous sixteen-year-old, Sierra returns from a missionary tour in England to a number of unsettling changes in her home and family",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Focus on the Family Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Schoolhouse Mystery (10) (The Boxcar Children Mysteries)",
        "Authors": "By Warner, Gertrude Chandler and Cunningham, David (ILT)",
        "Description": "Grandpa Alden and the Alden children encounter danger, excitement, adventure, and mystery in a quiet island fishing village",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Albert Whitman & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Great Brain",
        "Authors": "By Fitzgerald, John D.",
        "Description": "The Great Brain is Tom D. Fitzgerald, aged ten. The story is told by J.D., a sometimes confounded but always admiring younger brother. Such people as Mr. Standish, the mean schoolmaster, regret the day they came up against The Great Brain. But others, like the Jensen kids lost in Skeleton Cave, Basil, the Greek kid, or Andy, who has lost his leg and his friends, know that Tom's great brain never fails to find a way home.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1972"
        }
    },
    {
        "Title": "The Best Light Recipe",
        "Authors": "By Cook's Illustrated Magazine (EDT), Burgoyne, John (ILT), Van Ackere, Daniel J. (PHT), and Tremblay, Carl (PHT)",
        "Description": "The Best Light REcipe offers more than 300 full-flavored lower-fat and reduced calorie recipes that still taste great and are guaranteed foolproof by the test cooks and editors who bring you Cook's Illustrated magazine.  If we weren't satisfied with the results in our kitchen, the recipe didn't make the book.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Cooks Illustrated",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Eleven Kids, One Summer",
        "Authors": "By Martin, Ann M.",
        "Description": "The huge Rosso family--eleven family members in all--decides to take a vacation, and what follows is a chaotic and loving adventure. Reprint.",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Maynard and Jennica",
        "Authors": "By Delson, Rudolph",
        "Description": "A wildly original debut,Maynard and Jennica is both a hilarious urban comedy and a captivating love story. In the summer of 2000, while riding the uptown number 6 train, the musician/filmmaker Maynard Gogarty first encounters the beautiful Jennica Green.Though their initial meeting is brief, when fate next brings them together a romance ensues, and as with most things in life, everyone has an opinion.Delson tells the story of this improbable love affair through the voices of Maynard and Jennica, along with their family, friends, and assorted characters (among them two attorneys, three journalists, and a rap star) pulled into their dizzying orbit.He brings to life a pair of lovers who are flawed, complex, at once eccentric and deeply familiar—and in whose story we continue to feel invested long after we’ve turned the last page.In the words of Mohsin Hamid, author of The Reluctant Fundamentalist, “this book is the reason we should all read first novels.”",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.78",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Native American Wisdom (RP Minis)",
        "Authors": "By Curtis, Edward S. (PHT)",
        "Description": "The words and evocative black/white photographs in this book provide a dramatic visual and spiritual portrayal of Native American culture. Quotations by Native American leaders inspire us with their wisdom.",
        "Category": " Social Science , Folklore & Mythology",
        "Publisher": "RP Minis",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "On Lee's To Kill a Mockingbird (Cliffs Notes)",
        "Authors": "By Castleman, Tamara",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.In CliffsNotes on To Kill a Mockingbird, you explore Harper Lee&#39;s literary masterpiece—a novel that deals with Civil Rights and racial bigotry in the segregated southern United States of the 1930s. Told through the eyes of the memorable Scout Finch, the novel tells the story of her father, Atticus, as he hopelessly strives to prove the innocence of a black man accused of raping and beating a white woman.Chapter summaries and commentaries take you through Scout&#39;s coming of age journey. Critical essays give you insight into racial relations in the South during the 1930s, as well as a comparison between the novel and its landmark film version. Other features that help you study includeCharacter analyses of the main charactersA character map that graphically illustrates the relationships among the charactersA section on the life and background of Harper LeeA review section that tests your knowledgeA Resource Center full of books, articles, films, and Internet sitesClassic literature or modern-day treasure—you&#39;ll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Literary Criticism , Reference",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Prevention's Disease Fighting Foods",
        "Authors": "By Prevention Magazine",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Cup Of Comfort F/Women",
        "Authors": "By Sell, Colleen (EDT)",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Cup of Comfort",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Little House",
        "Authors": "By Virginia Lee Burton",
        "Description": "",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Beautiful Miscellaneous: A Novel",
        "Authors": "By Smith, Dominic",
        "Description": "NATHAN NELSON IS THE AVERAGE SON OF A GENIUS. His father, a physicist of small renown, has prodded him toward greatness from an early age -- enrolling him in whiz kid summer camps, taking him to the icy tundra of Canada to track a solar eclipse, and teaching him college algebra. But despite Samuel Nelson's efforts, Nathan remains ordinary.Then, in the summer of 1987, everything changes. While visiting his small-town grandfather in Michigan, Nathan is involved in a terrible accident. After a brief clinical death --  which he later recalls as a lackluster affair lasting less than the length of a Top 40 pop song -- he falls into a coma. When he awakens, Nathan finds that everyday life is radically different. His perceptions of sight, sound, and memory have been irrevocably changed. The doctors and his parents fear permanent brain damage. But the truth of his condition is more unexpected and leads to a renewed chance for Nathan to find his place in the world.Thinking that his son's altered brain is worthy of serious inquiry, Samuel arranges for Nathan to attend the Brook-Mills Institute, a Midwestern research center where savants, prodigies, and neurological misfits are studied and their specialties applied. Immersed in this strange atmosphere -- where an autistic boy can tell you what day Christmas falls on in 3026 but can't tie his shoelaces, where a medical intuitive can diagnose cancer during a long-distance phone call with a patient -- Nathan begins to unravel the mysteries of his new mind. He also tries to make peace with the crushing weight of his father's expectations.The Beautiful Miscellaneous is an extraordinary follow-up to Dominic Smith's critically acclaimed debut, The Mercury Visions of Louis Daguerre. This dazzling new novel explores the fault lines that can cause a family to drift apart and the unexpected events that can pull them back together.",
        "Category": " Fiction , Psychological",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Be All That You Are",
        "Authors": "By Florence, Susan",
        "Description": "",
        "Category": "",
        "Publisher": "Peggy Pinson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Tales from the Bed: On Living, Dying, and Having It All",
        "Authors": "By Estess, Jenifer, Estess, Valerie, and Couric, Katie (FRW)",
        "Description": "Jenifer Estess is a woman on the verge: She's about to launch her own company; she's looking buff and dating vigorously; she's driving in the fast lane -- with the top down. At the age of thirty-five, Jenifer dreams of falling in love and starting a family. Then she notices muscle twitches in her legs. Walking down a city block feels exhausting. At first, doctors write off Jenifer's symptoms to stress, but she is quickly diagnosed with ALS, a fatal brain disease that is absolutely untreatable.   Max out your credit cards and see Paris, suggests one doctor. Instead of preparing to die, Jenifer gets busy. She dreams deeper, works harder, and loves endlessly. For Jenifer, being fatally ill is not about letting go. It's about holding on and reaching -- for family, friends, goals.  Jenifer's girlhood pact with her sisters Valerie and Meredith -- nothing will ever break us apart -- guides them as Jenifer faces down one of the most devastating illnesses known to humankind. That same enduring pact inspires the creation of Project A.L.S., a movement started by the sisters that changes the way science and medicine approach research for ALS and the related diseases Parkinson's and Alzheimer's, and which has already raised more than $18 million. Will Project A.L.S. help scientists discover medicine in time for her?   Jenifer answers these questions and others in this beautifully written and wholly inspiring memoir that celebrates a life fuelled by memory. Tales from the Bed forces us to reconsider society's notion of \"having it all,\" and illustrates, more than anything, the importance of endurance, hope, and, most of all, love.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Against All Enemies: Inside America's War on Terror",
        "Authors": "By Clarke, Richard A.",
        "Description": "\"The [Bush] administration has squandered the opportunity to eliminate al Qaeda....A new al Qaeda has emerged and is growing stronger, in part because of our own actions and inactions. It is in many ways a tougher opponent than the original threat we faced before September 11, and we are not doing what is necessary to make America safe from that threat.\"   No one has more authority to make that claim than Richard Clarke, the former counterterrorism czar for both Bill Clinton and George W. Bush. The one person who knows more about Usama bin Laden and al Qaeda than anyone else in this country, he has devoted two decades of his professional life to combating terrorism. Richard Clarke served seven presidents and worked inside the White House for George H.W. Bush, Bill Clinton, and George W. Bush until he resigned in March 2003. He knows, better than anyone, the hidden successes and failures of the Clinton years. He knows, better than anyone, why we failed to prevent 9/11. He knows, better than anyone, how President Bush reacted to the attack and what happened behind the scenes in the days that followed. He knows whether or not Iraq presented a terrorist threat to the United States and whether there were hidden costs to the invasion of that country.   Most disturbing of all are Clarke's revelations about the Bush administration's lack of interest in al Qaeda prior to September 11. From the moment the Bush team took office and decided to retain Clarke in his post as the counterterrorism czar, Clarke tried to persuade them to take al Qaeda as seriously as had Bill Clinton. For months, he was denied the opportunity even to make his case to Bush. He encountered key officials who gave the impression that they had never heard of al Qaeda; who focused incessantly on Iraq; who even advocated long-discredited conspiracy theories about Saddam's involvement in previous attacks on the United States.   Clarke was the nation's crisis manager on 9/11, running the Situation Room -- a scene described here for the first time -- and then watched in dismay at what followed. After ignoring existing plans to attack al Qaeda when he first took office, George Bush made disastrous decisions when he finally did pay attention. Coming from a man known as one of the hard-liners against terrorists, Against All Enemies is both a powerful history of our two-decades-long confrontation with terrorism and a searing indictment of the current administration.",
        "Category": " Political Science , American Government , Executive Branch",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "From Boys to Men: A Woman's Guide to the Health of Husbands, Partners, Sons, Fathers, and Brothers",
        "Authors": "By Senay, Emily and Waters, Rob",
        "Description": "The first book on the health of boys and men designed for women -- the unsung heroes who make most families' health-care decisions -- From Boys to Men will forever dispel the notion that women are the weaker sex.  There is a shocking gap in health and longevity between males and females. Men die, on average, nearly six years earlier than women and have a higher mortality rate for all ten leading causes of death in America. Yet there is no known biological reason.  Perhaps the answer lies in social forces that teach men not to care for themselves, says author, physician, and CBS medical correspondent Emily Senay. Instead, caregiving falls to wives, partners, mothers, sisters, and daughters, who have never had a resource written specifically to help them understand and cope with the health issues of men and boys.  Until now. With an expert, intimate voice, Dr. Senay offers accessible, pragmatic information and anecdotes that follow males from conception through the arc of life. Mothers of sons will learn about the unique issues boys face as they grow, including:  ? Health issues unique to baby boys  ? The major health threats to boys -- accidents and injuries  ? Understanding the higher risk of learning disabilities, including AD/HD and other developmental problems  ? Weight issues and body image  ? Knowing how and when to discuss sexuality  ? Helping teenagers take healthy risks   ? Understanding the new world of sports, including pressure for early specialization  For men, Dr. Senay covers such topics as:  ? Helping him change -- how to work as partners to lose weight, improve diet, or quit smoking  ? Helping your partner overcome denial, one of the biggest threats to men's health  ? Solving bedroom problems  ? Helping him lower cholesterol and blood pressure  ? Recognizing and treating depression and stress  ? Essential medical tests every man should have  ? Snoring and the promise of rest  As a mother, wife, daughter -- and doctor -- Emily Senay shares her readers' concern for the men in their lives -- and provides the answers women have been waiting for. And as men take better care of themselves, the longevity gap will close as their sons learn by example.  The first book on the health of boys and men designed for women -- the unsung heroes who make most families' health-care decisions -- From Boys to Men will forever dispel the notion that women are the weaker sex.  There is a shocking gap in health and longevity between males and females. Men die, on average, nearly six years earlier than women and have a higher mortality rate for all ten leading causes of death in America. Yet there is no known biological reason.  Perhaps the answer lies in social forces that teach men not to care for themselves, says author, physician, and CBS medical correspondent Emily Senay. Instead, caregiving falls to wives, partners, mothers, sisters, and daughters, who have never had a resource written specifically to help them understand and cope with the health issues of men and boys.  Until now. With an expert, intimate voice, Dr. Senay offers accessible, pragmatic information and anecdotes that follow males from conception through the arc of life. Mothers of sons will learn about the unique issues boys face as they grow, including:  ? Health issues unique to baby boys  ? The major health threats to boys -- accidents and injuries  ? Understanding the higher risk of learning disabilities, including AD/HD and other developmental problems  ? Weight issues and body image  ? Knowing how and when to discuss sexuality  ? Helping teenagers take healthy risks   ? Understanding the new world of sports, including pressure for early specialization  For men, Dr. Senay covers such topics as:  ? Helping him change -- how to work as partners to lose weight, improve diet, or quit smoking  ? Helping your partner overcome denial, one of the biggest threats to men's health  ? Solving bedroom problems  ? Helping him lower cholesterol and blood pressure  ? Recognizing and treating depression and stress  ? Essential medical tests every man should have  ? Snoring and the promise of rest  As a mother, wife, daughter -- and doctor -- Emily Senay shares her readers' concern for the men in their lives -- and provides the answers women have been waiting for. And as men take better care of themselves, the longevity gap will close as their sons learn by example.",
        "Category": " Health & Fitness , Men's Health",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Phil Gordon's Little Blue Book: More Lessons and Hand Analysis in No Limit Texas Hold'em",
        "Authors": "By Gordon, Phil",
        "Description": "In Poker: The Real Deal and Phil Gordon's Little Green Book, Phil Gordon -- a world-class player and teacher -- shared the strategies, tips, and expertise he's gleaned during his phenomenally successful career. Now he shows players how to apply those theories to actual hands in order to make smart, confident decisions with every move.   Gordon walks readers through hands that he's encountered in cash games; early, middle, and late tournament play; Sit & Gos; satellites and supersatellites; and the final table of the World Series of Poker, revealing not only what plays he made but also why he made them. He relates what goes through a pro's mind in every situation, whether it's a timely bluff or a questionable call, and helps players calculate their own best moves in the most pressure-fueled of situations. In analyzing specific hands, Gordon also imparts important lessons in key poker skills such as calculating odds, shorthanded play, and discovering tells. And he discusses memorable plays -- the good and the oh-so-bad -- explaining why certain moves were made and, in many cases, how the hands should have been played differently.   Insightful, witty, and filled with real-life pro secrets, Phil Gordon's Little Blue Book is required reading for every player looking to make a profit and raise his game to the next level.",
        "Category": " Games , Card Games , Poker",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Crippled Lamb",
        "Authors": "By Lucado, Max and Bonham, Liz (ILT)",
        "Description": "Because Joshua the Lamb was different, he often felt left out-like on the wintry night when he was left behind in a Bethlehem stable. This touching tale helps kids see that even if they're different, God has a unique plan for their lives.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Taylor's Encyclopedia of Garden Plants (Taylor's Guides)",
        "Authors": "By Tenenbaum, Frances (EDT)",
        "Description": "At the heart of every garden are the plants, which enhance our land and engage our souls. For gardeners, no matter how new or how advanced, whether we cultivate for ourselves or for landscaping clients, plants are the sine qua non. They intrigue us and inspire us. And the more we learn about them, the more they add to our pleasure in gardening.   For all of these reasons, every gardener needs a good plant encyclopedia. And, as the only plant encyclopedia written exclusively for North American gardeners, Taylor’s Encyclopedia of Garden Plants will be as useful twenty years from now as it is today. If a plant can’t be grown on this continent, you won’t find it here.   Readers will use this book in a number of ways: as a resource for identifying plants, as a guide to purchasing the best species and cultivars for particular gardening locations and growing conditions, and as an important way to save the cost and disappointment of buying plants that won’t thrive or will overwhelm a garden. Choosing just the right tree or shrub can add the crowning touch to your landscape plan.   Here you’ll find expert information about more than a thousand species of trees, shrubs, roses, bulbs, perennials, annuals, and ground covers. Illustrated with 1,200 color photos and hundreds of line drawings, the encyclopedia includes instructions on how to grow the plants and even on how to propagate many of them. An extensive glossary and a common name index make this book accessible to beginners as well as longtime gardeners.   Like gardening itself, Taylor’s Encyclopedia of Garden Plants will bring its readers immediate pleasure as well as long-term rewards.",
        "Category": " Gardening , Reference",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "6.57",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Walt Disney's Classic Cinderella",
        "Authors": "By Walt Disney Company",
        "Description": "Though mistreated by her family, Cinderella manages to get to the prince's ball with the help of her fairy godmother and to inspire the prince's undying love.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Press / Western Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "The London Ritz Book of Afternoon Tea",
        "Authors": "By Simpson, Helen",
        "Description": "Afternoon tea is the english meal-time institution, a social as well as a culinary event.It is precisely this atmosphere which is embodied in the Palm Court Tearoom at the Ritz in London, which for many years has been one of the most delightful and traditional places to take tea.The London Ritz Book of Afternoon Tea captures the essence of this traditional British occasion and provides the reader with all the Ritz expertize in the ceremony as well as over 50 recipes, illustrated with passages from Dickens to Oscar Wilde and charming drawings.",
        "Category": " Cooking , Regional & Ethnic , English, Scottish & Welsh",
        "Publisher": "MorrowCB",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "American History to 1877 (Barron's EZ-101 Study Keys)",
        "Authors": "By Geise, Robert D.",
        "Description": "American History to 1877 covers all the major themes, historical figures, major dates and events from your introductory American History courses. Topics covered include Pre-Columbian America to the post-Civil War Reconstruction era.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Barrons Educational Services",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "One Week in March",
        "Authors": "By Mark Sherwin",
        "Description": "",
        "Category": "",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "8.21",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "The Baseball I.Q. Challenge",
        "Authors": "By Schlossberg, Dan",
        "Description": "Gathers baseball trivia questions about hitters, pitchers, managers, teams, ballparks, rules, all-stars, and the World Series",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "A Private Family Matter: A Memoir",
        "Authors": "By Rivers, Victor Rivas",
        "Description": "\"This is a story about how I was saved by love at a time when most people considered me beyond rescue,\" begins Victor Rivas Rivers in this powerful chronicle of how he escaped the war zone of domestic violence -- too often regarded as a \"private family matter\" -- and went on to become a good man, a film star, and a prominent activist.  The Cuban-born author begins by recalling when he was kidnapped, along with three of his siblings, by his own father, who abandoned Victor's pregnant mother and took the children on a cross-country hell-ride that nearly ended in a fatal collision. This journey of survival portrays with riveting detail how, instead of becoming a madman like his father, Victor was saved by a band of mortal angels. Miraculously, seven families stepped forward, along with teachers and coaches, to empower him on his road from gang member to class president, through harrowing and hilarious football adventures at Florida State and with the Miami Dolphins, to overcoming the Hollywood odds and becoming a champion for all those impacted by domestic violence.  Though at times Victor's odyssey is heartbreaking and disturbing, A Private Family Matter is ultimately a triumphant testament to humanity, courage, and love. Profound and poignant, it is a compelling memoir with a cause. Victor Rivers's way of thanking all the angels and advocates who made a difference in his life is by trying to make a difference in all of ours.",
        "Category": " Family & Relationships , Abuse , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Flawless Execution: Use the Techniques and Systems of America's Fighter Pilots to Perform at Your Peak and Win the Battles of the Business World",
        "Authors": "By Murphy, James D.",
        "Description": "From the former F-15 fighter pilot and CEO of one ofInc.'s 500 fastest-growing companies: ahard-hitting primer on performance excellencein the workplace -- military styleAccording to former U.S. Air Force pilot-turned-management guru James D. Murphy, businesses need to take a lesson from the American military's fighter pilots. While F-15s, F-16s, and F/A-18s are the ultimate aerial combat machines, they are entirely dependent on the men and women who fly and maintain them. At Mach 2, the instrument panel is screaming out information, the horizon is a blur, the wingman is occupied, the pilot's busy, the jet is hanging on the edge -- and yet fighter pilots routinely handle the stress. It's not much different in today's fast-paced, unforgiving world of business. One slipup and the company is bankrupt before the employees know what hit them.What works on the squadron level for F-15 pilots will also work for your marketing team, sales force, or research and development group. By analyzing the work environment and attacking its centers of gravity in parallel, you'll begin to utilize the Plan-Brief-Execute-Debrief-Win cycle that makes up Flawless Execution. The result will make a rapid impact on your business's future success. Developed over the course of nearly fifty years, the rigorous practice of Flawless Execution has helped U.S. fighter squadrons reduce their mistake rate, cut casualties and losses of equipment, and rack up an envious victory record. Through Afterburner's multimedia seminars conducted by \"Murph\" and his fellow pilots-turned-businesspeople, businesses have benefited by adopting the techniques, systems and strategies of America's Top Guns. Now, with Flawless Execution, you can too.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Teammates",
        "Authors": "By Golenbock, Peter and Bacon, Paul (ILT)",
        "Description": "This is the moving story of how Jackie Robinson became the first black player on a Major League baseball team when he joined the Brooklyn Dodgers in the 1940s, and how on a fateful day in Cincinnati, Pee Wee Reese took a stand and declared Jackie his teammate. Illustrated with a blend of historic photographs and eloquent watercolors by Paul Bacon.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Sports & Recreation",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Vicious Circle: A Novel of Complicity",
        "Authors": "By Littell, Robert",
        "Description": "An Israeli government minister is assassinated in the home of his mistress. Days later, Elihu, an aging and decorated Mossad officer, leads his final raid, killing a Hamas leader in his bed and barely escaping with his life. Out of this familiarly cyclical scenario emerges what is perhaps Robert Littell s most heartfelt and suspenseful novel. The action moves forward into the near future, when the global community, united under the leadership of a visionary woman president of the United States, brokers a major compromise between Israel and the Palestinian authority in the hopes of snuffing out the violent flash-point that fuels the flames of global terrorism. But then, Isaac Apflbaum, a well-known fundamentalist Rabbi, is taken hostage by Dr. al-Saath, a legendary Palestinian terrorist, who demands the release of several Palestinian prisoners in exchange for his prisoner. As Israel coaxes Elihu out of retirement to hunt down the terrorist who motivated his final mission, al-Saath and Apflbaum find themselves building an extraordinary relationship between hostage taker and hostage: parallels between these two battle-hardened partisans become the bonds that could lead to reconciliation. But with the Mossad strike team closing in, has the vicious circle already been closed. Ferociously suspenseful and brilliantly topical, Vicious Circle is a thriller that, like The Company before it, breaks down an entire culture of violence into the corrupted consciences that embody it.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "The Overlook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Lion's Bed",
        "Authors": "By Massie, Diane Redfield",
        "Description": "Horrified at the prospect of the lion's moving to their part of the jungle, the animals set about building him a bed--but not to sleep in.",
        "Category": "",
        "Publisher": "Weekly Reader Book Club Xerox Family Education Services",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "City Sounds (Disney's the Hunchback of Notre Dame)",
        "Authors": "By Packard, Mary and Baker, Darrell (ILT)",
        "Description": "Quasimodo listens to the sounds he hears in Paris, including a Gypsy violinist, a tambourine, seagulls by the dock, and the cathedral bells.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Artist & Writers Guild Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "My Year in Iraq: The Struggle to Build a Future of Hope",
        "Authors": "By McConnell, Malcolm and Bremer, L. Paul",
        "Description": "This memoir of fourteen months as America's proconsul in Iraq is the only senior insider's perspective on the crucial period following the collapse of Saddam Hussein's regime. Bremer describes negotiations with emerging Iraqi leaders as they struggle to forge the democratic institutions vital to Iraq's future; his resistance to the cut-and-run policy that would have quickly delivered governance of Iraq to a handful of unrepresentative anti-Saddam exiles; heated sessions among members of America's National Security Council; his frustration with intelligence operations that concentrated on the search for weapons of mass destruction while the insurgency gathered strength; the selfless and courageous work of thousands of American servicemen and -women and civilians; and working with Iraq's traumatized and divided population to find a path to a responsible government.--From publisher description.The former head of the coalition government in Iraq describes the challenges they faced after the toppling of Saddam Hussein, including limited resources, rampant violence, and groups of exiles who vied for control over the nation.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Rainbow Fish and Friends A Fishy Story",
        "Authors": "By Donovan, Gail",
        "Description": "",
        "Category": "",
        "Publisher": "Night Sky Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Do-It-Yourself Lettering Book",
        "Authors": "By Gamble, Kim (ILT) and Burgess, Anna",
        "Description": "Presents a variety of simple and elaborate types of lettering, many of them incorporating drawings appropriate to the meaning of the words for which they are used, and shows how to use them in posters, report covers, and other projects",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "My \"s\" book (My first steps to reading)",
        "Authors": "By Moncure, Jane Belk",
        "Description": "Little s goes for a walk along the sea and finds many things that begin with the letter \"s\" to put in his box.",
        "Category": "",
        "Publisher": "distributed by Children's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Madeline",
        "Authors": "By Bemelmans, Ludwig",
        "Description": "Madeline, smallest and naughtiest of the twelve little charges of Miss Clavel, wakes up one night with an attack of appendicitis.",
        "Category": " Juvenile Fiction , Family , Orphans & Foster Homes",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1977"
        }
    },
    {
        "Title": "Richard Scarry's Lowly Worm Meets the Early Bird",
        "Authors": "By Scarry, Richard",
        "Description": "Early Bird looks and looks, but he can't seem to find a worm to play with. A jumping frog and a tiny field mouse try to help out, but there just aren't any worms to be found. Early Bird is about to give up when he meets a friendly fellow in a funny hat--it's Lowly Worm! This Richard Scarry classic early reader will delight a whole new audience!Step 2 Readers use basic vocabulary and short sentences to tell simple stories, and are for children who recognize familiar words and can sound out new words with help.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Land of the Silver Apples (Sea of Trolls)",
        "Authors": "By Farmer, Nancy",
        "Description": "THE CHILDREN   FROM THE SEA OF TROLLS   BRAVE THEIR WORST   NIGHTMARES -- UNDERGROUND.   Jack is amazed to have caused an earthquake. He is thirteen, after all, and only a bard-in-training. But his sister, Lucy, has been stolen by the Lady of the Lake; stolen a second time in her young life, as he learns to his terror. Caught between belief in the old gods and Christianity (790 AD, Britain), Jack calls upon his ash wood staff to subdue a passel of unruly monks, and, for his daring, ends up in a knucker hole. It is unforgettable -- for the boy and for readers -- as are the magical reappearance of the berserker Thorgil from a burial by moss; new characters Pega, a slave girl from Jack's village, and the eager-to-marry-her Bugaboo (a hobgoblin king); kelpies; yarthkins; and elves (not the enchanted sprites one would expect but the fallen angels of legend). Rarely does a sequel enlarge so brilliantly the world of the first story. Look for the conclusion in The Islands of the Blessed in 2009.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "The South Beach Heart Program: The 4-Step Plan that Can Save Your Life (The South Beach Diet)",
        "Authors": "By Agatston, Arthur, M.D.",
        "Description": "A pioneering cardiologist and the author of the international bestseller The South Beach Diet presents the truth about cardiac care in this country and offers his proven program for preventing heart attacks and strokes. This year alone more than 1 million men and women in this country will suffer a heart attack or stroke. The shocking fact is that the majority of heart attacks and strokes can be prevented with the medical knowledge we already possess. Yet this isn’t happening. Why? Because doctors and hospitals are paid more to treat disease with invasive techniques like angioplasty and bypass surgery than to prevent it. In his most personal and passionate work yet, Dr. Arthur Agatston champions a revolution in heart disease prevention that will enable people to stay out of the hospital and off the operating table. In Part 1 of this compelling book, he tells you why seemingly healthy people can suddenly have a heart attack and why people with great cholesterol numbers can be walking time bombs. He explains why belly fat can be an early warning sign of future heart disease and why a noninvasive heart scan can help predict your risk of heart attack. In Part 2, he presents the South Beach Heart Program, his 4-step plan for detecting, preventing, and even reversing heart disease: The 4 steps include: Heart-healthy eating, regular aerobic and core-strengthening exercise, state-of-the art diagnostic testing, and the latest heart-protective medications, as necessary. Thanks to his aggressive prevention approach, Dr. Agatston rarely sees a heart attack or stroke in his practice. Now you can benefit from the prevention strategy he uses to help his patients every day.",
        "Category": " Medical , Cardiology",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Sweet Potato Queens' First Big-Ass Novel: Stuff We Didn't Actually Do, but Could Have, and May Yet",
        "Authors": "By Browne, Jill Conner and Gillespie, Karin",
        "Description": "\"I have no pride. I tell anything,\" Jill Conner Browne is fond of saying. As Her Royal Highness, Boss Queen of the Sweet Potato Queens®, she has told legions of fans, known as \"SPQ Wannabes,\" her delectable secrets to living, loving -- and eating -- like a queen. In her words, \"More is more.\"How much more? The #1 New York Times bestselling author of five works of nonfiction now serves up The Sweet Potato Queens' First Big-Ass Novel: Stuff We Didn't Actually Do, but Could Have, and May Yet. The humor in this uproarious coming-of-queen novel is more delicious than a favorite dessert (the Queens favor Chocolate Stuff?, of course).In Jackson, Mississippi, Mary Bennett, Patsy, Gerald, and Jill are high school classmates whose daily routine is paced like a shuffle through the local red dirt -- until the arrival of a redheaded newcomer banishes monotony forever. With her luxurious mane and voluptuous figure, Tammy Myers aspires to join the silver-spooners, who make things happen in their lives. When Jill convinces Tammy and the others that money might buy a certain kind of good time and that true friendship has no price tag, the \"Sweet Potato Queens\" are born. \"If it ain't fun, we ain't doin' it,\" runs their official club motto, and the Queens are true to their word.Together, the Queens laugh out loud as they step down the long -- and not altogether pretty --  road toward making their very own queen dust, the sparkle that comes from livin' and lovin' their own lives. The Sweet Potato Queens' First Big-Ass Novel: Stuff We Didn't Actually Do, but Could Have, and May Yet reveals that the journey isn't always easy, but in the company of the Queens, you can sparkle, too.",
        "Category": " Fiction , Humorous",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "No Excuses: Concessions of a Serial Campaigner",
        "Authors": "By Shrum, Robert",
        "Description": "He was named by The Atlantic Monthly as \"the most sought-after strategist in the Democratic party.\" He was targeted by National Review as the Democratic Party's \"poet goon.\" From his unique perspective, Robert Shrum gives us an epic and personal story of the struggle for power in America during the past four decades. With wit and humor, rare candor, and a wealth of detail, he vividly recounts the real personalities and real forces that shaped the outcome of the closest and most important elections of our time. We are there with Shrum in the back rooms, on the planes, and in the motorcades with Ted Kennedy, Al Gore, John Kerry, John Edwards, and Bill and Hillary Clinton.Shrum reveals the manipulations and limitations of old and new forms of political persuasion, from the historic and sometimes controversial speeches he wrote to the negative ads he created for national and statewide candidates, from prepping presidential nominees for critical debates to the deployment of the new political weapon, the Internet. He lifts the curtain on decisive moments. Did John Kerry and John Edwards actually believe in the Iraq war they voted for? What was the real reason the Kerry campaign didn't respond faster to the Swift Boat attacks? Why didn't Al Gore let Bill Clinton campaign all-out in 2000? How did Clinton get through the first perilous week of the Lewinsky scandal? This is a provocative journey through recent history: George McGovern's antiwar campaign of 1972, the improbable rise of Jimmy Carter, Senate campaigns that made historic breakthroughs and shaped the presidential contests of the future, the gifts that made Bill Clinton a great politician -- and the circumstances and calculations that kept him from being a great president. As strategist, adviser, and often friend to the leaders he enlisted with, Shrum shows them as they are, with their strengths and human weaknesses -- as well as his own. Assailed as a populist who pushed the Democratic Party, in a phrase he coined, \"to stand for the people, not the powerful,\" Shrum argues that unlike Republicans from Reagan on, Democrats fall short, politically or in office, when they trim their convictions and walk away from fundamental issues -- like universal health coverage.This is one of the most fascinating books ever written about the victories and defeats, the causes and candidates, the \"flawed heroes\" that drive the high drama of American politics.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Marriage Game: A Novel",
        "Authors": "By Michaels, Fern",
        "Description": "",
        "Category": "",
        "Publisher": "POCKET",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Snow White (Once-Upon-a-Time-Tales)",
        "Authors": "By Jane, Jerrard",
        "Description": "",
        "Category": "",
        "Publisher": "New Seasons Publishings",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The sleeping beauty (Leap frog)",
        "Authors": "By Jerrard, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "New Seasons Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Corrie Ten Boom: Heroine of Harlem (Heroes of the Faith)",
        "Authors": "By Wellman, Sam",
        "Description": "",
        "Category": " Biography & Autobiography , Rich & Famous",
        "Publisher": "Barbour Pub Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Missing Tooth (Step into Reading)",
        "Authors": "By Hafner, Marylin (ILT) and Cole, Joanna",
        "Description": "Illus. in full color. \"Best friends Robby and Arlo dress alike and do most of the same things. However, their friendship is in jeopardy over a bet about who will lose the next tooth. Realistic, humorous illustrations provide ample reading clues on every page. Should encourage emerging readers to flex their reading muscles.\"--School Library Journal.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Homer's Iliad (Cliffs Notes)",
        "Authors": "By Linn, Bob",
        "Description": "",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1962"
        }
    },
    {
        "Title": "John Wesley's Message Today (Pocket Guide)",
        "Authors": "By Weems, Lovett H.",
        "Description": "With its plain, easy-to-understand language, this Pocket Guide will help you understand the major aspects of John Wesley's theology. You will discover what Wesley believed about...The image of God and original sin Stewardship Justification by faith The witness of the Spirit Social holiness ...and more. This 96 page booklet also offers study questions that will help you or your group discuss the importance of Wesley's ideas for Christians today.",
        "Category": " Religion , Christianity , Methodist",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Say It in Italian (Dover Language Guides Say It Series)",
        "Authors": "By Ragusa, Olga",
        "Description": "Compact and comprehensive, this handy guide belongs in the pocket of every traveler. Built to hold up to years of use, it offers the easiest method ever devised for quickly finding the words, phrases, and sentences you need to communicate clearly. The guide includes over 1,000 up-to-date entries for any occasion, simple pronunciation transcriptions, numbered and indexed entries, quick word substitutions, and a handy bilingual glossary.",
        "Category": " Foreign Language Study , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1958"
        }
    },
    {
        "Title": "Red Hats, Purple Shoes & Afternoon Teas",
        "Authors": "By Cq Products",
        "Description": "",
        "Category": "",
        "Publisher": "CQ Products",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Totally Coffee Cookbook (Totally Cookbooks Series)",
        "Authors": "By Siegel, Helene and Gillingham, Karen",
        "Description": "Mochas and frappes, cookies and cakes, and even sauces and meat – no matter your preference, there are plenty of ways for coffee-lovers to get their fix in this handy pocket-size cookbook. Totally Coffee Cookbook will fill your kitchen with the comforting aroma of freshly baked cookies and muffins, the caffeinated kick of brewing coffee, or the spicy scent of Mexican mole.",
        "Category": " Cooking , Beverages , Coffee & Tea",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Maximum Ride Saving The World And Other Extreme Sports",
        "Authors": "By Patterson, James",
        "Description": "In MAXIMUM RIDE: SAVING THE WORLD AND OTHER EXTREME SPORTS, the time has arrived for Max and her winged \"Flock\" to face their ultimate enemy and discover their original purpose: to defeat the takeover of \"Re-evolution\", a sinister experiment to re-engineer a select population into a scientifically superior master race...and to terminate the rest. Max, Fang, Iggy, Nudge, Gasman, and Angel have always worked together to defeat the forces working against them--but can they save the world when they are torn apart, living in hiding and captivity, halfway across the globe from one another?",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "jimmy patterson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "LE MOT JUSTE V690",
        "Authors": "By Buchanan-Brown, John",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Lily's Crossing",
        "Authors": "By Giff, Patricia Reilly",
        "Description": "This “brilliantly told” (New York Times) Newbery Honor Book gives readers a sense of what it was like to be on the American home front while our soldiers were away fighting in World War II.   As in past years, Lily will spend the summer in Rockaway, in her family’s summer house by the Atlantic Ocean. But this summer of 1944, World War II has changed everyone’s life. Lily’s best friend, Margaret, has moved to a wartime factory town, and, much worse, Lily’s father is going overseas to the war.   There’s no one Lily’s age in Rockaway until the arrival of Albert, a refugee from Hungary with a secret sewn into his coat. Albert has lost most of his family in the war; he’s been through things Lily can’t imagine. But soon they form a special friendship. Now Lily and Albert have secrets to share: They both have told lies, and Lily has told one that may cost Albert his life.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "102 Dalmatians",
        "Authors": "By Downes, Alice",
        "Description": "A full-length treatment for middle-grade readers of the new movie from Walt Disney Pictures will have young dog lovers on the edge of their seats and includes an eight-page color insert with photos from the film. Original. 150,000 first printing.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Going for Great (Ag Fiction (American Girl))",
        "Authors": "By Brockmann, Carolee",
        "Description": "Feeling abandoned by her parents and her best friend, sixth grader Jenna worries that her severe stage fright will spoil her performance at a flute competition--until she gets to know a class misfit who is a good musician and an even better friend",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    }
]