[
    {
        "Title": "Italian Fat-free Healthy Ways with a Favourite Cuisine",
        "Authors": "By Anne Sheasby",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Wok & Stir Fry",
        "Authors": "By Linda Doeser",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Indian Deliciously Authentic Dishes",
        "Authors": "By Shehzad Husain",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Frommer's Irreverent Guide to Amsterdam (Irreverent Guides)",
        "Authors": "By McDonald, George",
        "Description": "Looking for a travel guide that goes where other guides fear to tread? One that rides roughshod over ad-copy puffery to smartly deliver the real scoop on a destination's sites and attractions? One that dares to be honest, hip, and fun? Look no more. Frommer's Irreverent Travel Guides are wickedly irreverent, unabashedly honest, and downright hilarious, and provide an insider's perspective on which attractions are overrated tourist traps and which are the secret gems that locals love. You'll get the lowdown on restaurants, lodging, and shopping, and even find out what the locals think of you. \"Like being taken around by a savvy local,\" said the New York Times. \"Hipper and savvier than other guides,\" concurred Diversion magazine. Never shy about confronting the issues, the Irreverents are guides to real travel in the real world.The one-dimensional Amsterdam of tulips, wooden shoes, and 17th-century architecture is the stuff of many a standard guidebook, but with its booming economy, legalized prostitution, and tolerant attitude toward recreational drug use, the city is much more than that. For savvy travelers who want to fully experience the place as the locals live it, Frommer's Irreverent Guide to Amsterdam is the way to go, offering the lowdown on this hip, cultivated city, where old and new sunnily coexist. You'll discover the proper way to knock back genever (Dutch gin--the potent national spirit), why Amsterdam is considered the Gay Capital of Europe, plus the inside scoop on the red-light district, complete with advice and warnings.",
        "Category": " Travel , Europe , Benelux Countries (Belgium, Netherlands, Luxembourg)",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Hurricane Watch: Forecasting the Deadliest Storms on Earth",
        "Authors": "By Williams, Jack and Sheets, Bob",
        "Description": "The ultimate guide to the ultimate storms, Hurricane Watch is a fascinating blend of science and history from one of the world's foremost meteorologists and an award-winning science journalist. This in-depth look at these awe-inspiring acts of nature covers everything from the earliest efforts by seafarers at predicting storms to the way satellite imaging is revolutionizing hurricane forecasting. It reveals the latest information on hurricanes: their effects on ocean waves, the causes of the variable wind speeds in different parts of the storm, and the origins of the super-cooled shafts of water that vent at high altitudes.Hurricane Watch is a compelling history of man's relationship with the deadliest storms on earth.Includes:- The story of the nineteenth-century Cuban Jesuit whose success at predicting the great cyclones was considered almost mystical.- A new look at Isaac Cline, whose infamous failure to predict the Galveston Hurricane left him obsessed with the devastating effects of storm surge.- The story of the Hurricane Hunters, including the first man ever to deliberately fly into a hurricane.- A complete account of how computer modeling has changed hurricane tracking.- A history of Project Stormfury: the only significant, organized effort to reduce the damaging strength of severe hurricanes.- A unique firsthand account of Hurricane Andrew by both authors, who were at the National Hurricane Center when Andrew struck.- A listing of the deadliest storms in history.",
        "Category": " Science , Earth Sciences , Meteorology & Climatology",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Eight Little Piggies: Reflections in Natural History (Norton Paperback)",
        "Authors": "By Gould, Stephen Jay",
        "Description": "Among scientists who write, no one illuminates as well as Stephen Jay Gould doesthe wonderful workings of the natural world. Now in a new volume of collected essays—his sixth since Ever Since Darwin—Gould speaks of the importance of unbroken connections within our own lives and to our ancestralgenerations. Along with way, he opens to us the mysteries of fish tails, frog calls, and other matters, and shows once and for all why we must take notice when a seemingly insignificant creature is threatened, like the land snail Partula from Moorea, whose extinction he movingly relates.",
        "Category": " Nature , Animals , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Mixed Media (Artist's Library Series)",
        "Authors": "By Light, Duane R.",
        "Description": "",
        "Category": " Art , Mixed Media",
        "Publisher": "Walter Foster Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Career Mastery: Keys to Taking Charge of Your Career Throughout Your Work Life",
        "Authors": "By Levinson, Harry",
        "Description": "Solidly anchored in research findings and counseling experience, this book provides detailed guidance on the skills, self-knowledge, attitudes, and behavior necessary for career success. Practical advice on working effectively with a problem boss, cultivating productive relationships with co-workers, and succeeding in a major career change are among the topics covered.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Great Tasting Stir-Fries And More",
        "Authors": "By Editorial Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Publication International LTD",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Eat Here: Reclaiming Homegrown Pleasures in a Global Supermarket (The Worldwatch Environmental Alert Series)",
        "Authors": "By Halweil, Brian",
        "Description": "Everyone everywhere depends increasingly on long-distance food. Since 1961 the tonnage of food shipped between nations has grown fourfold. In the United States, food typically travels between 1,500 and 2,500 miles from farm to plate—as much as 25 percent farther than in 1980. For some, the long-distance food system offers unparalleled choice. But it often runs roughshod over local cuisines, varieties, and agriculture, while consuming staggering amounts of fuel, generating greenhouse gases, eroding the pleasures of face-to-face interactions, and compromising food security. Fortunately, the long-distance food habit is beginning to weaken under the influence of a young, but surging, local-foods movement. From peanut-butter makers in Zimbabwe to pork producers in Germany and rooftop gardeners in Vancouver, entrepreneurial farmers, start-up food businesses, restaurants, supermarkets, and concerned consumers are propelling a revolution that can help restore rural areas, enrich poor nations, and return fresh, delicious, and wholesome food to cities.",
        "Category": " Nature , Ecology",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Kids Party Games And Activities (Children's Party Planning Books)",
        "Authors": "By Warner, Penny and Rogers, Kathy (ILT)",
        "Description": "Penny Warner knows hundreds of ways to have fun at kids’ parties—now you will, too!This book has so many great activities for kids’ parties, you’ll want to try them long before your child’s next birthday. Here are hundreds of the most entertaining games and activities for kids ages 2 to 12—more ideas than any other book has! You’ll find clear step-by-step instructions plus helpful illustrations and trouble-shooting tips to guarantee a successful party. Whether you’re planning an elaborate event or want to throw a simple party without spending much time and money, this is the book for you. — Chock-Full of Ideas! • Icebreakers • Traditional favorites • Contemporary games • Competitive and noncompetitive activities • Indoor and outdoor fun • Group projects • Outings and events • Entertainers • Plus great ideas for prizes and favors!",
        "Category": " Juvenile Nonfiction , Games & Activities , General",
        "Publisher": "Running Press Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "The Uses of Enchantment: The Meaning and Importance of Fairy Tales",
        "Authors": "By Bettelheim, Bruno",
        "Description": "The great child psychologist gives us a moving revelation of the enormous and irreplaceable value of fairy tales - how they educate, support and liberate the emotions of children.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Vintage",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Secrets of the Best Choice (Let's-Talk-About-It Stories for Kids   Ser)",
        "Authors": "By Johnson, Lois Walfrid",
        "Description": "",
        "Category": "",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Delights, Dilemmas and Decisions: The Gift of Living Lightly",
        "Authors": "By Bedrosian, Margaret McAuliffe",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Knowledge Ideas & Trends",
        "Price Starting With ($)": "6.17",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Mustang, Wild Spirit of the West",
        "Authors": "By Henry, Marguerite and Lougheed, Robert (ILT)",
        "Description": "Horses were in Annie Bronn's blood. For as long as she could remember, she had been fascinated by the spirited wild mustangs that roamed free throughout the West. So when greedy cattlemen started to round up the mustangs for slaughter, Annie knew it was up to her to save the breed.  The true story of Wild Horse Annie's crusade to save the mustangs is inspiring. Readers will cheer her on, all the way to the White House, in her struggle to preserve these beautiful creatures from extinction.",
        "Category": " Young Adult Fiction , Animals , Horses",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Johnny Holliday: From Rock to Jock",
        "Authors": "By Moore, Stephen and Holliday, Johnny",
        "Description": "",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Sports Publishing LLC",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "And I Haven't Had a Bad Day Since: From the Streets of Harlem to the Halls of Congress",
        "Authors": "By Rangel, Charles B. and Wynter, Leon E.",
        "Description": "In this inspiring and often humorous memoir, the outspoken Democratic congressman from Harlem--now the chairman of the powerful House Ways and Means Committee--tells about his early years on Lenox Avenue, being awarded a Bronze Star and a Purple Heart for wounds sustained in a horrific Korean War battle (the last bad day of his life, he says), and his many years in Congress.      A charming, natural storyteller, Rangel recalls growing up in Harlem, where from the age of nine he always had at least one job, including selling the legendary Adam Clayton Powell's newspaper; his group of streetwise sophisticates who called themselves Les Garçons; and his time in law school--a decision made as much to win his grandfather's approval as to establish a career. He recounts as well his life in New York politics during the 1960s and the grueling civil rights march from Selma to Montgomery.      With New York street smarts, Rangel is a tough liberal and an independent thinker, but also a collegial legislator respected by Democrats and Republicans alike who knows and honors the House's traditions. First elected to Congress in 1970, Rangel served on the House Judiciary Committee during the hearings on the articles of impeachment of President Nixon, helped found the Congressional Black Caucus, and led the fight in Congress to pressure U.S. corporations to divest from apartheid South Africa.      Best of all, this is a political memoir with heart, the story of a life filled with friends, humor, and accomplishments. Charles Rangel is one of a kind, and this is the story of how he became the celebrated person and politician he is today.      He opens his memoir with a preface about the 2006 elections and an outline of his goals as chairman of Ways and Means. From day one he wants to put the public first so that more Americans can say they haven't had a bad day since.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Life in the Slow Lane: Tales of Covered Bridges Written by and for the People Who Love 'Em",
        "Authors": "By Jerry Wiebel",
        "Description": "",
        "Category": " Photography , Reference",
        "Publisher": "Country Store Reiman Pubs",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Getting the Grant: How Educators Can Write Winning Proposals And Manage Successful Projects",
        "Authors": "By Gajda, Rebecca and Tulikangas, Richard",
        "Description": "This resource for educators begins with an overview of the principles of effective grant writing. The authors (both successful education grant writers) share their expertise in locating various kinds of sponsors, understanding the Request for Proposals (RFP), and writing a persuasive proposal. The second half of the volume describes how to evaluate the success of a project as well as other steps necessary to ensure long-term program sustainability. Annotation ©2005 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Finance",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Collecting Blue and White Stoneware: An Identification and Value Guide",
        "Authors": "By McNerney, K.",
        "Description": "This guide is essential for blue & white stoneware collectors. The pitchers, crocks, canisters, and other pieces have continued to increase in popularity. This handy full-color guide has hundreds of photos and descriptions. 2000 values.",
        "Category": " Antiques & Collectibles , Pottery & Ceramics",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "Tehran Rising: Iran's Challenge to the United States",
        "Authors": "By Berman, Ilan",
        "Description": "Iran is the most significant current threat to the United States, the Middle East, and the West. As the evidence demonstrating this threat mounts, one thing remains clear to Ilan Berman: \"Washington is woefully unprepared to deal with this mounting peril.\" Berman's approach is hard-hitting, provocative, alarmist, and unflinchingly critical. But he takes the indictment of Iran one step further providing what has been missing so far in the foreign policy discourse regarding Iran—both within the U.S. government and outside it—policy prescriptions designed to contain Iran's strategic ambitions.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Temple Dancer: A Novel of India (Novels of India)",
        "Authors": "By Speed, John",
        "Description": "India, 1657.When Maya, a graceful, young temple dancer with a mysterious past, is sold into slavery, she enters a world of intrigue, violence, and forbidden love. Bought by a Portuguese trader and sold as a concubine to the dissolute vizier of Bijapur, she embarks on a treacherous journey.In a caravan led by the dangerous settlement man Da Gama, she travels by elephant on the hostile road to Bijapur, joined by Geraldo, a Portuguese adventurer, and Pathan, a handsome prince who carries a dark secret. Together with Lucinda, a beautiful, spoiled young Goan heiress, and the manipulative eunuch Slipper, they climb the windswept mountain road through the Western Ghats. When their caravan is attacked by bandits, the travelers’ lives are turned upside down. In the aftermath, Maya and Lucinda suddenly find themselves stranded in a strange, exotic world, a world filled with passion, romance, and deception, pure love and lurking evil, where nothing is as it seems and the two women are faced with great temptation as well as heart-wrenching decisions that will affect the rest of their lives. Greed, politics, commitment, courage, love, and intolerance mesh to form a vibrant Indian tapestry. With spectacular settings, unforgettable characters, fierce sensuality, and intense scholarship, this adventure-packed novel marks the debut of an exciting new storyteller. The Temple Dancer is the first volume of John Speed’s Indian trilogy, a three-book journey that will cover the final years of the Mogul Empire and the rise of the Marathis under the highwayman Shivaji. It will leave you breathlessly awaiting his next novel.",
        "Category": " Fiction , Historical , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "The Myth of the A.D.D. Child: 50 Ways Improve your Child's Behavior attn Span w/o Drugs Labels or Coercion",
        "Authors": "By Armstrong, Thomas",
        "Description": "In this controversial and provocative book, Dr. Thomas Armstrong confronts America's obsession with Attention Deficit Disorder.  With more than one million children diagnosed with ADD, the condition has gained national attention on talk shows, magazine covers and The New York Times bestseller list. Dr. Armstrong, well-known for his writings on parenting and education, presents the very real argument that ADD may, in fact, not exist. He believes that many behaviors labeled as ADD are simply a child's active response to complex social, emotional, and educational influences, and that by tackling the root causes of a child's attention and behavior problems—rather than masking the symptoms with medication and behavior-modification programs—parents can help their children begin to experience fundamentally positive changes in their lives.This groundbreaking book provides parents and professionals with 50 innovative and proven strategies they can use to help children overcome their attention and behavior problems. His checklist helps parents decide which strategies are most appropriate, and hundreds of resources, including books and organizations are included.  The Myth of the A.D.D. Child offers much needed practical help to both parents and professionals.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Word Topical Bible of Issues and Answers",
        "Authors": "By Pinson, William",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Teens Talkin' Faith: A Christian Perspective",
        "Authors": "By Trujillo, Michelle L.",
        "Description": "Michelle Trujillo, best known to teens as Mrs. \"T\", has compiled acollection of passages from teenagers across the nation that readers will findrelevant to their own life as they are lead upon a captivating spiritualjourney. Throughout this powerful and unique book, teens share their lifeexperiences from trial and tragedy to triumph and joy. Teen contributors providepersonal stories written from the heart about how God has given them thestrength and courage to deal with tough situations, along with love and comfortin times of loneliness. Teens also share what it means to accept God's grace andrely on His guidance. At the end of each chapter, Mrs. T shares heart-wrenchingstories and spiritual inspiration, while inviting readers to continue or begin apromising relationship with God.Regardless of religious differences, teens will find this book to be aguiding light along their path. Teens Talkin' Faith is a gift from Mrs. Tand its teen contributors-a gift of faith, love and hope. Teens will accept itand hold it close to their hearts-it will make a difference in their lives.",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "Faith Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Society of Mind",
        "Authors": "By Minsky, Marvin",
        "Description": "Marvin Minsky -- one of the fathers of computer science and cofounder of the Artificial Intelligence Laboratory at MIT -- gives a revolutionary answer to the age-old question: \"How does the mind work?\"Minsky brilliantly portrays the mind as a \"society\" of tiny components that are themselves mindless. Mirroring his theory, Minsky boldly castsThe Society of Mind as an intellectual puzzle whose pieces are assembled along the way. Each chapter -- on a self-contained page -- corresponds to a piece in the puzzle. As the pages turn, a unified theory of the mind emerges, like a mosaic. Ingenious, amusing, and easy to read, The Society of Mind is an adventure in imagination.",
        "Category": " Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Powerful Leadership Skills for Women",
        "Authors": "By Miller, Patricia M.",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Seminars Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The Practical Rock & Water Garden: A Step-by-Step Guide from Planning and Construction to Plants and Planting",
        "Authors": "By Peter Robinson",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Encyclopedia of Reptiles and Amphibians",
        "Authors": "By Breen, J. F.",
        "Description": "Provides instructions for the care of live specimens as well as describing the characteristics, habits, and life cycles of numerous species",
        "Category": " Pets , Reptiles, Amphibians & Terrariums",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Sharpe's Regiment (Richard Sharpe's Adventure Series #17)",
        "Authors": "By Cornwell, Bernard",
        "Description": "Disguised as a new recruit, Major Richard Sharpe uncovers a web of treachery and corruption in an England poised for Wellington's invasion of France",
        "Category": " Fiction , General",
        "Publisher": "Penguin Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Dean and Me: (A Love Story)",
        "Authors": "By Lewis, Jerry and Kaplan, James",
        "Description": "They were the unlikeliest of pairs—a handsome crooner and a skinny monkey, an Italian from Steubenville, Ohio, and a Jew from Newark, N.J.. Before they teamed up, Dean Martin seemed destined for a mediocre career as a nightclub singer, and Jerry Lewis was dressing up as Carmen Miranda and miming records on stage. But the moment they got together, something clicked—something miraculous—and audiences saw it at once. Before long, they were as big as Elvis or the Beatles would be after them, creating hysteria wherever they went and grabbing an unprecedented hold over every entertainment outlet of the era: radio, television, movies, stage shows, and nightclubs. Martin and Lewis were a national craze, an American institution. The millions (and the women) flowed in, seemingly without end—and then, on July 24, 1956, ten years from the day when the two men joined forces, it all ended. After that traumatic day, the two wouldn’t speak again for twenty years. And while both went on to forge triumphant individual careers—Martin as a movie and television star, recording artist, and nightclub luminary (and charter member of the Rat Pack); Lewis as the groundbreaking writer, producer, director, and star of a series of hugely successful movie comedies—their parting left a hole in the national psyche, as well as in each man’s heart.In a memoir by turns moving, tragic, and hilarious, Jerry Lewis recounts with crystal clarity every step of a fifty-year friendship, from the springtime, 1945 afternoon when the two vibrant young performers destined to conquer the world together met on Broadway and Fifty-fourth Street, to their tragic final encounter in the 1990s, when Lewis and his wife ran into Dean Martin, a broken and haunted old man.In Dean &  Me, Jerry Lewis makes a convincing case for Dean Martin as one of the great—and most underrated—comic talents of our era. But what comes across most powerfully in this definitive memoir is the depth of love Lewis felt, and still feels, for his partner, and which his partner felt for him: truly a love to last for all time.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "101 More Hymn Stories: The Inspiring True Stories Behind 101 Favorite Hymns",
        "Authors": "By Osbeck, Kenneth W.",
        "Description": "(Foreword by J. Stratton Shufelt) Excellent for devotional reading, sermon illustrations, and bulletin inserts, as well as for historical or biographical research.",
        "Category": " Music , Instruction & Study , Voice",
        "Publisher": "Kregel Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Rent: Vocal Selections",
        "Authors": "By Alfred Publishing Staff (COR)",
        "Description": "",
        "Category": " Music , Printed Music , General",
        "Publisher": "Hal Leonard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "The Doge's Palace in Venice (Electa Concise Guides)",
        "Authors": "By Eugenia Bianchi, Nadia Righi, and Maria Cristina Terzaghi",
        "Description": "",
        "Category": "",
        "Publisher": "Electa",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Wheels on the Bus (A First Little Golden Book)",
        "Authors": "By Alley, R. W.",
        "Description": "In this version of the classic song, the wheels go round, the wipers go swish, the money goes clink, the people go up and down, and so on, all around the town. Printed music at the end.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Sailing in the Fog (Seamanship Series)",
        "Authors": "By Duncan, Roger F",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Intl Marine Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "A Dickens of a Cat: And Other Stories of the Cats We Love",
        "Authors": "By Grant, Callie Smith (EDT)",
        "Description": "Pets are such a big part of so many of our lives. As any pet lover knows, a wagging tail or a tender purr can soothe the soul after a hard day. And sometimes, the presence of dogs and cats in our lives can do even more. In these delightful books, Callie Smith Grant collects stories that celebrate the dogs and cats in our lives--stories that touch our hearts, renew our spirit, and show us how God created these beasts for unique purposes. A funny little dog named Prince earns his title by protecting the children of the house. A \"dickens of a cat\" gives a cancer survivor something else to think about. A lively litter of puppies soothes a troubled child. A scrawny kitten helps an anorexic girl begin to eat.  Well-known authors, including Melody Carlson, Tracie Peterson, and Robert Benson, as well as new voices share their inspirational true stories of these otherwise ordinary cats and dogs whose presence in the lives of humans make them remarkable. Each book also includes interesting sidebars, memorable quotes, helpful hints for living with dogs and cats, and forewords by H. Norman Wright. The stories are warm, captivating, and ideal for a good curl-up-and-read or for a gift to any pet lover. Cat lovers, dog lovers, and anyone who likes to read uplifting stories will cherish these books.",
        "Category": " Pets , Cats , General",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Wooden: A Lifetime of Observations and Reflections On and Off the Court",
        "Authors": "By Wooden, John R. and Jamison, Steve",
        "Description": "NATIONAL BESTSELLER\"I am just a common man who is true to his beliefs.\"--John Wooden Evoking days gone by when coaches were respected as much for their off-court performances as for their success on the court, Wooden presents the timeless wisdom of legendary basketball coach John Wooden.In honest and telling passages about virtually every aspect of life, Coach shares his personal philosophy on family, achievement, success, and excellence.  Raised on a small farm in south-central Indiana, he offers lessons and wisdom learned throughout his career at UCLA, and life as a dedicated husband, father, and teacher.These lessons, along with personal letters from Bill Walton, Denny Crum, Kareem Abdul-Jabbar, and Bob Costas, among others, have made Wooden: A Lifetime of Observations and Reflections on and off the Court an inspirational classic.",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Do-It-Yourself Guide to Age Defiance (Smartly Said: Little Books With Lots of Laughs)",
        "Authors": "By Richmond, Marianne",
        "Description": "Smartly Said...Little Books with Lots of LaughThe sassy collection of good humored guidance on topics near and dear to a woman's heart. Share them with those who need a laugh.",
        "Category": " Family & Relationships , Friendship",
        "Publisher": "Sourcebooks Jabberwocky",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Jonas Brothers: Hello Beautiful: Stars of Camp Rock",
        "Authors": "By Edwards, Posy",
        "Description": "Now tweens can get closer than ever to their favorite musical heartthrobs: The Jonas Brothers! Here’s the lowdown on their likes and dislikes, their pets, their hobbies, and more, along with fun quizzes so fans can find out which boy would be their perfect date. There’s even a space for dreamy-eyed Jonas lovers to put their photos next to the one they like the bestand a FREE poster, too!",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Performing Arts",
        "Publisher": "Orion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "The Word Parents Handbook",
        "Authors": "By Richards, Lawrence",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The Sistine Chapel",
        "Authors": "By Mancinelli, Fabrizio",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Treasures Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Birds of North America (Golden Field Guide from St. Martin's Press)",
        "Authors": "By Robbins, Chandler S.",
        "Description": "Maps, color illustrations, and statistics on 700 species of birds are contained in this field guide",
        "Category": " Nature , Animals , Birds",
        "Publisher": "Golden Guides from St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Good Morning, Gorillas (Magic Tree House #26)",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "The #1   bestselling chapter book series of all time celebrates 25 years with new   covers and a new, easy-to-use numbering system! Gentle giants or giant monsters? That's the question Jack and Annie have   about gorillas when the Magic Tree House sweeps them to the mountains of   Africa. There they meet a group of amazing and sometimes frightening mountain   gorillas. Annie knows how to play with the creatures right away. But Jack is   left out. Will the gorillas be able to teach him some special magic? Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and Annie,   perfect for readers who are just beginning chapter books Merlin Missions: More challenging adventures for the experienced   reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite Magic Tree House   adventures Have more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Needlepoint Book",
        "Authors": "By Christensen, Jo Ippolito",
        "Description": "Descriptions of more than four hundred different stitches and the basic techniques of needlepoint accompany step-by-step instructions for a variety of projects, covering all stages and design variations",
        "Category": "",
        "Publisher": "Englewood s-20 Prentice-Hall, Inc. 1976.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Senior Moments",
        "Authors": "By Jacqueline D. Byrd",
        "Description": "",
        "Category": "",
        "Publisher": "Byrd & Byrd, LLC",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "A Student of Living Things",
        "Authors": "By Shreve, Susan Richards",
        "Description": "The Frayn family of Washington, D.C., is coping pretty well with twenty-first century realities of life?snipers, bomb threats, natural disasters, etc. Then, in the moment it takes Claire Frayn to dig for her umbrella, her politically outspoken brother Steven is shot down right next to her on the library steps.  Steven?s murder shatters the tightly knit Frayn family, and his sister Claire becomes determined to unravel the mystery of why her brother was killed. Searching for answers, Claire meets Victor, an enigmatic stranger who claims to know who killed Steven. Claire begins an unusual correspondence with the suspected assassin, but instead of uncovering the truth of her brother?s death, she finds herself drawn to this man, and increasingly apprehensive about cooperating with Victor?s plans to avenge Steven?s death.  A gripping family drama with an unusual love story at its center, this is an intimate portrait of grief, the futility of revenge, and the miracle of forgiveness.",
        "Category": " Fiction , Psychological",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "1001 Incredible Things to Do on the Internet",
        "Authors": "By Leebow, Ken",
        "Description": "",
        "Category": "",
        "Publisher": "MK Distributors",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The World's Greatest Valentine (Spongebob Squarepants Chapter Books)",
        "Authors": "By Collins, Terry and O'Hare, Mark (ILT)",
        "Description": "On Valentine's Day, SpongeBob makes the biggest, sweetest valentine ever for his best friend, Patrick. But when a herd of chocolate-eating scallops threaten the valentine's arrival, SpongeBob has to come up with a new plan. Can SpongeBob save the day -- and the citizens of Bikini Bottom -- before the disappointed Patrick loses control? Find out in this new book based on the special SpongeBob SquarePants episode \"Valentine's Day.\"",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Mummies and Pyramids: A Nonfiction Companion to Magic Tree House #3: Mummies in the Morning",
        "Authors": "By Murdocca, Sal (ILT), Osborne, Mary Pope, and Osborne, Will",
        "Description": "The #1   bestselling chapter book series of all time celebrates 25 years with new   covers and a new, easy-to-use numbering system! Getting the facts behind the   fiction has never looked better.  Track   the facts with Jack and Annie!!   When Jack and Annie got back from their adventure in Magic Tree House   #3: Mummies in the Morning, they had lots of questions. Why did people   make mummies? What was the mysterious writing on mummy cases? How   did most ancient Egyptians spend their days? How were the pyramids   built? Find out the answers to these questions and more as Jack and   Annie track the facts. Filled with up-to-date information, photos, illustrations, and fun tidbits   from Jack and Annie, the Magic Tree House Fact Trackers are the perfect way   for kids to find out more about the topics they discovered in their favorite   Magic Tree House adventures. And teachers can use Fact Trackers alongside   their Magic Tree House fiction companions to meet common core text pairing   needs.   Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and Annie, perfect for readers who   are just beginning chapter books Merlin Missions: More challenging adventures for the experienced   reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite   Magic Tree House adventures Have more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Nonfiction , History , Ancient",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Twister on Tuesday (Magic Tree House, No. 23)",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "The #1   bestselling chapter book series of all time celebrates 25 years with new   covers and a new, easy-to-use numbering system! An adventure to blow you away! That's what Jack and Annie get when the   Magic Tree House whisks them back to the 1870s. They land on the prairie near   a one-room schoolhouse, where they meet a teenage schoolteacher, some cool   kids, and one big, scary bully. But the biggest and scariest thing is yet to come! Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and   Annie, perfect for readers who are just beginning chapter books Merlin Missions: More challenging adventures for the experienced   reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite Magic Tree House   adventures Have more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Answers Book: The 20 Most-Asked Questions About Creation, Evolution & the Book of Genesis Answered! Revised & Expanded Edition",
        "Authors": "By Sarfati, Jonathan, Batten, Don (EDT), Ham, Ken, and Wieland, Carl",
        "Description": "",
        "Category": " Religion , Reference",
        "Publisher": "Master Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Starting a Home-Based Business (The Complete Idiot's Guide)",
        "Authors": "By Weltman, Barbara",
        "Description": "You're no idiot, of course.  You have ideas, skills, and talents that have brought you success for years.  (You even figured out how to program your VCR.)  But turning your ideas and talents into your own business can make you feel like an idiot.  Taxes, zonning laws, insurance, marketing:  how do you juggle all of these and still succeed at what you do for a living?  But there's hope!  This book gives you the lowdown on all those things you need to get going:  financing for your business, setting up your system, and selling your product or service. In this Complete Idiot's Guide you get:",
        "Category": " Business & Economics , Entrepreneurship",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Coin Clinic: 1,001 Frequently Asked Questions",
        "Authors": "By Herbert, Alan",
        "Description": "",
        "Category": " Antiques & Collectibles , Coins, Currency & Medals",
        "Publisher": "Krause Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Webmastering For Dummies",
        "Authors": "By Tauber, Daniel A. and Kienan, Brenda",
        "Description": "Free Webmastering \"Cheat Sheet\" Inside!This Is Your Guide to Planning and Producing a Winning Web Site with Fresh, Compelling Content! \"Webmaster\" means many things to many people. Today's Webmaster may create or produce content, administer a site or a server, or even acquire a budget and then outsource everything. If you're looking for a friendly mentor, then Webmastering For Dummies® will show you where to start, how to develop strategies, and much more. This is the book the authors wished for when they were starting ? chock full of what a Webmaster really needs to know.Inside, find helpful advice on how to:Get on track and stay there, whether you're a Webmaster of all trades or one specializing in content, production, technology, or managementPromote your site with smarts and get big-time trafficSell your product or service on the Web, with or without your own Web siteFind out the six possible goals of a Web site, determine your site's goals, and measure your successUnderstand legal bugaboos and avoid pitfallsEstablish and maintain a bulletproof budget and effective procedures and standardsRun your own server or deal effectively with an Internet service providerMaximize navigation of your site through savvy architecture and solid search capabilitiesUse databases as the backbone of your robust and dynamic Web siteAsk for IDG Books' ?For Dummies® Books, the Fun and Easy Way to Find Out about Computers. Ask for IDG Books' Java? For Dummies®, 2nd Edition, the fun and easy way to add interactivity to your Web pages, and The Internet For Dummies®, 4th Edition, the fast and friendly way to get connected to the Net.",
        "Category": " Computers , Desktop Applications , Desktop Publishing",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Great German Cars",
        "Authors": "By Roberts, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark+publishers Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Joy of Scrapbooking",
        "Authors": "By Arquette, Kerry, Zocchi, Andrea, and D'agostino, Darlene",
        "Description": "This mammoth book contains so much valuable information, and so many exciting examples of great work, it will become the must-have resource for every beginning and experienced scrapbooker’s library! In more than 300 pages, the history of the craft unfolds, from the old-fashioned albums of eras past to the renaissance of creative scrapbooking today. Interviews and profiles of leading designers and companies offer insight into the art, and there’s abundant advice for newcomers on improving their images and their layouts. They’ll find out how to take full advantage of the camera’s key components; store photographs and ensure archival quality; and create a powerful, balanced design on the page. Invaluable tips cover choice of materials, selecting and integrating type, and using words to enhance the images. And of course there’s a plethora of fabulous techniques to try, from cropping, matting and mounting photos to stamping, embossing, and distressing to creating custom papers on the computer. And the sample layouts spotlight those important moments that everyone most wants to commemorate: birthdays, graduations, weddings, and special family events.A Main Selection of the Crafters Choice Book Club.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Santas Christmas Surprise Landoll",
        "Authors": "By Landoll",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll Inc",
        "Price Starting With ($)": "12.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Whisper a Prayer: For Moms",
        "Authors": "By Beth Sparkman",
        "Description": "",
        "Category": "",
        "Publisher": "Tynedale House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Ideals, Christmas Issue",
        "Authors": "By No Author",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "in pictures Yellowstone: The Continuing Story",
        "Authors": "By Robinson, Sandra Chisholm and Robinson, George B.",
        "Description": "",
        "Category": " Travel , Pictorials",
        "Publisher": "KC Publications, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "A Life in a Year : The American Infantryman in Vietnam, 1965-1972",
        "Authors": "By Ebert, James R.",
        "Description": "Finally, a book that focuses completely on the life of the \"grunt\" (infantry soldier) in Vietnam. The voices of more than sixty army and marine infantrymen speak with restrained elegance of their experiences from induction to the jungles and rice paddies of \"Indian country\" to their return to \"The World.\"From I Corps in the north to IV Corps in the south, and from the early days of 1965 to the American withdrawal in 1972, A Life in a Year offers a unique look at the grunt's war in Vietnam - as seen through the eyes of the soldiers themselves. The insights of these combat veterans are woven into the narrative, giving the reader a sense of what it was like to serve in an infantry unit fighting Viet Cong guerrillas and North Vietnamese regulars. Veterans can compare their own experiences to those of infantrymen who served in different time periods during the Vietnam era and in different parts of the country. Civilians and veterans who did not experience life in the \"boonies\" will appreciate the author's candid explanations of the war in terms that will help them to better understand the individual soldier's experience. This lively, topically arranged account will appeal to both scholars and casual readers alike. A Life in a Year is sure to become a classic and is a valuable addition to Vietnam War literature.",
        "Category": " History , Military , Vietnam War",
        "Publisher": "Presidio Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Baedeker Yugoslavia (English and German Edition)",
        "Authors": "By Baedeker, Karl (EDT)",
        "Description": "Describes the history, culture, climate and landscape of Yugoslavia, and gives advice on sightseeing, shopping, accommodations and dining",
        "Category": " Travel , General",
        "Publisher": "Baedekers Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Resurrection of the Shroud: New Scientific, Medical, and Archeological Evidence",
        "Authors": "By Antonacci, Mark",
        "Description": "An examination of the Shroud of Turin, which will be displayed in Italy in August of the year 2000, presents new scientific findings that challenge radiocarbon testing done on the Shroud to determine its age. Tour.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "M. Evans & Company",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "All the Best in the Mediterranean",
        "Authors": "By Clark, Sydney",
        "Description": "",
        "Category": "",
        "Publisher": "Dodd, Mead & Company",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Totally Shrimp Cookbook (Totally Cookbooks Series)",
        "Authors": "By Siegel, Helene",
        "Description": "Cooking shrimp? Don’t worry, shrimp cocktail is only the tip of the iceberg when it comes to shrimp-based meals. Bursting with scrumptious recipes such as Steamed Shrimp Dumplings, Lime-and-Chile Barbecued Shrimp, and Marinated Shrimp and Fennel Salad, this pocket-size cookbook will make you see this little food in a big new way.",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Soccerhead: An Accidental Journey into the Heart of the American Game",
        "Authors": "By Haner, Jim",
        "Description": "Before his son enlisted for a season of Youth Soccer at the neighborhood Boys and Girls Club in College Park, Maryland, Jim Haner was just your typical white middle-class suburban father. And as a journalist for The Baltimore Sun, Haner was more likely to write about scoundrels than soccer.But his son had caught the bug, so Haner reluctantly found himself in a room full of anxious parents, listening to the Youth Soccer Commissioner proudly proclaim that \"soccer is the essence of being!\" He wondered, What's this all about? and before he knew it, he was giving pep talks to nine-year-olds in shin guards and cleats. As the coach of the Hornets, a ragtag team of ten boys and one determined girl, Haner found himself eating, sleeping, and dreaming soccer: the game became an overwhelming, all-consuming obsession. So he immersed himself in soccer lore, dug deep into the historical record, took road trips to meet the living greats, and funneled his research into an intimate portrait of the soccer craze from the bottom up, and from the past to the present. The coach-turned-soccer apostle describes how \"Mob Ball\" fever was spread when successive waves of immigrants arrived in the States from England, Europe, South America, and Africa. He traces the rises and falls in the game's popularity in the decades since, up to the current wave of \"soccermania.\" When 100,000 people showed up in Pasadena to see the Americans take the Women's World Cup title in 1999, it was clear that the craze had become unstoppable.Soccerhead is a timely meditation on the poetry and politics of the game - a memoir, a cultural history, and a reflection on the Zen-ness of the sport, all rolled into one.",
        "Category": " Sports & Recreation , History",
        "Publisher": "North Point Press",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Long Day's Journey Into War: Pearl Harbor and a World at War-December 7, 1941",
        "Authors": "By Weintraub, Stanley",
        "Description": "",
        "Category": " History , Military , World War II",
        "Publisher": "Lyons Pr",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Dog Lover's Companion to Washington, DC-Baltimore",
        "Authors": "By Oldenburg, Don, Oldenburg, Ann, and Frank, Phil (ILT)",
        "Description": "",
        "Category": " Pets , Dogs , General",
        "Publisher": "Rick Steves",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Undutchables: A Observation of the Netherlands : Its Culture and Its Inhabitants",
        "Authors": "By White, Colin",
        "Description": "",
        "Category": "",
        "Publisher": "Colin White & Laurie Boucke",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Silks",
        "Authors": "By Francis, Dick and Francis, Felix",
        "Description": "When defence barrister Geoffrey Mason hears the judge's verdict, he quietly hopes that a long and arduous custodial sentence will be handed down to his arrogant young client. That Julian Trent only receives eight years seems all too lenient. Little does Mason expect that he'll be looking Trent in the eyes again much sooner than he'd ever imagined.Setting aside his barrister's wig, Mason heads to Sandown to don his racing silks. An amateur jockey, his true passion is to be found in the saddle on a Thoroughbred, pounding the turf in the heat of a steeplechase. But when a fellow rider is brutally murdered - a pitchfork driven through his chest - Mason's racing life soon becomes all too close to his working life. The prime suspect is one of their brethren, champion jockey Steve Mitchell; the evidence is overwhelming.Mason is reluctant to heed Mitchell's pleas for legal advice - but soon he finds himself at the centre of a sinister web of threat and intimidation. Mason is left fighting a battle of right and wrong, and more immediately, a battle of life and death...his own.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Light Construction Techniques: From Foundation to Finish",
        "Authors": "By Ball, John E",
        "Description": "",
        "Category": "",
        "Publisher": "Reston Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "LOOK, LISTEN, AND LO",
        "Authors": "By Kenworth, Catherine",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Demass: Transforming the Dinosaur Corporation",
        "Authors": "By Stuckey, M. M.",
        "Description": "Starting with the premise that giant corporations are more likely to go extinct than adjust to change, the author lays out a program to help slovenly dinosaur organizations evolve into responsive predatory wildcats. The core of his plan calls for de-centralization and prudently butchering the massive beast into smaller, autonomous profit centers. Not a new idea, but certainly the emphasis is deserving. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Productivity Pr",
        "Price Starting With ($)": "7.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Plays Unpleasant (Shaw Library)",
        "Authors": "By Shaw, Bernard and Laurence, Dan H.",
        "Description": "",
        "Category": " Drama , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "How to Fix Almost Everything: The Standard A to Z Guide to One Thousand and One Household Fix-It Problems",
        "Authors": "By Schuler, Stanley",
        "Description": "Shows how to mend everything from acoustical tile to a zipper and explains general repair methods such as fastening, soldering, glueing, and painting",
        "Category": " House & Home , Repair",
        "Publisher": "M Evans & Co",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "October",
            "Year": "1975"
        }
    },
    {
        "Title": "Where Is Baby's Pumpkin? (Karen Katz Lift-the-Flap Books)",
        "Authors": "By Katz, Karen",
        "Description": "In Karen Katz's distinctive style, an adorable baby searches throughout the house for her pumpkin.In Karen Katz's distinctive style, an adorable baby searches throughout the house for her pumpkin. Is the pumpkin under the leaves, behind the curtain, under the bed? NO! But Baby finds many other surprises as a ghost, a witch's hat, cute-as-a-button bats, and candy apples are found beneath each flap. Finally after Baby finds her pumpkin, she's ready to go trick-or-treating and the final flap reveals a Halloween extravaganza!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "How Soccer Explains the World",
        "Authors": "By Foer, Franklin",
        "Description": "“An eccentric, fascinating exposé of a world most of us know nothing about.” —The New York Times Book Review \"An insightful, entertaining, brainiac sports road trip.\" —The Wall Street Journal \"Foer’s skills as a narrator are enviable. His characterizations… are comparable to those in Norman Mailer's journalism.\" —The Boston Globe A groundbreaking work—named one of the five most influential sports books of the decade by Sports Illustrated—How Soccer Explains the World is a unique and brilliantly illuminating look at soccer, the world’s most popular sport, as a lens through which to view the pressing issues of our age, from the clash of civilizations to the global economy.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The World According to Clarkson",
        "Authors": "By Clarkson, Jeremy",
        "Description": "Jeremy Clarkson shares his opinions on just about everything in The World According to Clarkson. Jeremy Clarkson has seen rather more of the world than most. He has, as they say, been around a bit. And as a result, he's got one or two things to tell us about how it all works; and being Jeremy Clarkson he's not about to voice them quietly, humbly and without great dollops of humour. In The World According to Clarkson, he reveals why it is that: Too much science is bad for our health '70s rock music is nothing to be ashamed of Hunting foxes while drunk and wearing night-sights is neither big nor clever We must work harder to get rid of cricket He likes the Germans (well, sometimes) With a strong dose of common sense that is rarely, if ever, found inside the M25, Clarkson hilariously attacks the pompous, the ridiculous, the absurd and the downright idiotic, whilst also celebrating the eccentric, the clever and the sheer bloody brilliant. Less a manifesto for living and more a road map to modern life, The World According to Clarkson is the funniest book you'll read this year. Don't leave home without it. 'The World According to Clarkson is a hilarious collection of Jeremy's Sunday Times columns and the first in his The World According to Clarkson series which also includes And Another Thing; For Crying Out Loud! and How Hard Can It Be? 'Brilliant, laugh-out-loud' Daily Telegraph 'Outrageously funny . . . will have you in stitches' Time Out Number-one bestseller and presenter of the hugely popular Top Gear, Jeremy Clarkson writes on cars, current affairs and anything else that annoys him in his sharp and funny collections. Born To Be Riled, Clarkson On Cars, Don't Stop Me Now, Driven To Distraction, Round the Bend, Motorworld, and I Know You Got Soul are also available as Penguin paperbacks; the Penguin App iClarkson: The Book of Cars can be downloaded on the App Store.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Penguin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Colonial Williamsburg Decorates for Christmas",
        "Authors": "By Oliver, Libby H.",
        "Description": "Detailed instructions and diagrams show how to make traditional colonial-style Christmas decorations",
        "Category": " House & Home , General",
        "Publisher": "Colonial Williamsburg Foundation",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Automobile Quarterly's World Of Cars,",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Decision Making by the Book: How to Choose Wisely in an Age of Options",
        "Authors": "By Robinson, Haddon W.",
        "Description": "It’s said that decisions are made in the details. And yet, we make hundreds, even thousands of decisions daily. So how do Christians process all those details and come up with answers that please God? In Decision-Making by the Book, author, lecturer, and radio personality, Haddon W. Robinson, takes his usual clear-eyed, not-a-word-wasted approach, to help you make decisions according to biblical principles—every time.",
        "Category": " Religion , Ethics",
        "Publisher": "Discovery House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Little People Big Book About Nature",
        "Authors": "By Time-Life for Children",
        "Description": "A collection of stories, folktales, informational articles, poems, games, and other activities relating to nature.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "I Am The Clay",
        "Authors": "By Potok, Chaim",
        "Description": "While fleeing from their village, a Korean peasant farmer and his wife take in a wounded boy, an act of love that gives birth to an odd, unlikely family. By the author of The Chosen and My Name Is Asher Lev. 30,000 first printing.",
        "Category": " Fiction , War & Military",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Unseen Companion",
        "Authors": "By Orenstein, Denise Gosliner",
        "Description": "In the late 1960's, in the small community of Bethel, Alaska, a beaten teenager named Dove Alexie is in prison.  One day, he mysteriously vanishes, and curiously, there is no mention of hi s arrival or departure on the prison records.  Four young people in Bethel tell their stories, and the narrative circles around Dove – their unseen companion. Told with humour and insight, Unseen Companion spins together four unique voices that capture the complexities of human existence and the search for one's place in the universe.  o Based on the author's own experiences living and doing social work in fourteen Alaskan bush villages, which left Orenstein uniquely qualified to write the kind of loss and hopelessness presented in this novel. o An intriguing and layered narrative structure, unique voices, and a brilliant over–arching metaphor that sums up one's place in the universe make this a unique and resonant book that will stick with readers for years to come.  Ages 12 +",
        "Category": " Young Adult Fiction , Family , Orphans & Foster Homes",
        "Publisher": "Katherine Tegen Books",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Primary Phonics: Tim: Set 1 Book 4: (Braille)",
        "Authors": "By Barbara Makar",
        "Description": "",
        "Category": "",
        "Publisher": "Educators Publishing Service, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "How come ...?: Easy answers to hard questions (A Child guidance book)",
        "Authors": "By Richards, Joyce",
        "Description": "",
        "Category": "",
        "Publisher": "Platt & Munk",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Prentice Hall Science Explorer Sound and Light",
        "Authors": "By Pasachoff, Jay M., Botting, Rose-Marie (CON), Coffey, John (CON), Evans, Edward (CON), and Kahan, Peter (CON)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Day the Babies Crawled Away",
        "Authors": "By Rathmann, Peggy",
        "Description": "What a lovely day at the fair. Children lining up for pony rides . . . moms and dads in a pie-eating contest . . . babies chasing butterflies . . . babies heading for the trees . . . I SAY! Where are those babies GOING? Only a small boy sees them leaving and follows as the babies chase butterflies in trees, frogs in a bog, even bats in a cave, ignoring pleas to come back.  But not to worry, our hero saves the day, making sure that all the babies get home safely from their appealing adventures.  Caldecott Medal winner Peggy Rathmann has created a highly original story told in a lilting text and a bold new style with classic black silhouettes against stunning skies of many colors that change and glow as afternoon turns into evening.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "G.P. Putnam's Sons Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Illustrated Children's Bible: Popular Stories from the Old and New Testaments",
        "Authors": "By Winkler, Jude",
        "Description": "Presents familiar stories from both the Old and New Testaments and additional background information on the Bible.",
        "Category": " Bibles , Other English Translations , Children",
        "Publisher": "Catholic Book Publishing",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Crimes and Misdumbmeanors: 100 New Stories from the Files of America's Dumbest Criminals",
        "Authors": "By Ray, Alan, Butler, Daniel, and Rose, Larry L.",
        "Description": "Crimes and MisDumbMeanors is the fourth in the highly successful series of books based on theAmerica's Dumbest Criminals™ television series.",
        "Category": " Humor , General",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Be Angry But Don't Blow It! Maintaining Your Passion Without Losing Your Cool",
        "Authors": "By Bevere, Lisa",
        "Description": "Are you tired of anger destroying your life, health, and relationships? Or perhaps you're upset and have held it in for far too long. Guess what-you're not alone! A lot of women are angry, and they're blowing it! They vent it on the very ones they love the most and desperately want to stop but they don't know how. This book interweaves powerful scriptural truths with practical, personal examples and prayer. Readers will learn to channel passionate emotions constructively. Anger is not wrong, it is how we express it and how far we take it that determines the outcome. For those really ready to be honest and get free, this book will light the way.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Oliver-Nelson Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Country Living Country Decorating",
        "Authors": "By Niles, Bo",
        "Description": "Explains how to produce the country look in interior design, room by room, using patterns and instructions to create country arts and create an imaginative living space",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "The Quilting Primer: Second Edition Covering Advanced Techniques",
        "Authors": "By Frager, Dorothy",
        "Description": "Pictures and describes an array of items, including samplers, crazy quilts, nursery and boutique items, tablecloths, place mats, aprons, and wall hangings, and supplies sixty full-size, ready-to-work patterns",
        "Category": " Art , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "You Can't Go Home Again",
        "Authors": "By Wolfe, Thomas",
        "Description": "George Webber has written a successful novel about his family and hometown. When he returns to that town he is shaken by the force of the outrage and hatred that greets him. Family and friends feel naked and exposed by the truths they have seen in his book, and their fury drives him from his home. He begins a search for his own identity that takes him to New York and a hectic social whirl; to Paris with an uninhibited group of expatriates; to Berlin, lying cold and sinister under Hitler's shadow. At last Webber returns to America and rediscovers it with love, sorrow, and hope.  \"If there stills lingers and doubt as to Wolfe's right to a place among the immortals of American letters, this work should dispel it.\"--Cleveland News  \"Wolfe wrote as one inspired. No one of his generation had his command of language, his passion, his energy.\"--The New Yorker  \"You Can't Go Home Again will stand apart from everything else that he wrote because this is the book of a  man who had come to terms with himself, who has something profoundly important to say.\"--New York Times Book Review",
        "Category": " Fiction , Classics",
        "Publisher": "HarpPerenM",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Cooperstown: Hall of Fame Players by Paul Adomites (2005) Hardcover",
        "Authors": "By Paul Adomites",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Ency Of Watercolor Techniq",
        "Authors": "By Harrison, Hazel",
        "Description": "Step-by-step photographs and text teach watercolorists forty different watercolor techniques, and offer tips on choosing materials, viewing a potential subject, and applying techniques appropriately",
        "Category": " Art , Techniques , Watercolor Painting",
        "Publisher": "Running Press",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "The Life and Strange Surprising Adventures of Robinson Crusoe (Illustrated Junior Library)",
        "Authors": "By Daniel Defoe",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "Feng Shui Made Easy: Designing Your Life with the Ancient Art of Placement",
        "Authors": "By Spear, William",
        "Description": "Did you know that you can improve your love life by moving your bed? Or enhance your wealth by rearranging your office? Or even deflect bad luck with convex mirrors? Chinese philosophers have understood geomancy (the art of placement) for more than two thousand years-and architects like I. M. Pei, businesses like Virgin Airways, and real estate moguls like Donald Trump are listening. Integrating interior design with the I Ching, feng shui (pronounced fung-schway) harmonizes our external and internal environments by creating balanced, peaceful dwellings in which we can develop health and happiness. its powerful secrets have been closely guarded for centuries-and what has been written tends to be mystifying and impractical. But reading Feng Shui Mode Easy is like having an expert visit your own home or office. William Spear is a sought-after consultant in the field-and with specific case studies, as well as fifty drawings that clearly demonstrate the subtle energy flow principles of the art of placement, he shows you how to easily apply the wisdom of geomancy to everyday living. \"Feng Shui Mode Easy tells you more than just how to rearrange your furniture, it tells you how to change your life.\" Home Shui Home!",
        "Category": " Body, Mind & Spirit , Feng Shui",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Life You've Always Wanted Participant's Guide: Six Sessions on Spiritual Disciplines for Ordinary People (Groupware)",
        "Authors": "By Ortberg, John, Sorenson, Stephen, and Sorenson, Amanda",
        "Description": "In the six-session small group bible study, The Life You’ve Always Wanted, John Ortberg guides you and your group through the spiritual disciplines and teaches you how they can transform your spiritual life.What does true spiritual life really look like? And what keeps you from living it? What can you do to pursue it?If you’re tired of the status quo – if you suspect there’s more to Christianity than what you’ve experienced – John Ortberg invites you to join him on a road to transformation and spiritual vigor that anyone can take.Cultivate new intimacy and confidence in prayer. Discover the freedom of secrecy. Taste the benefits of slowing life’s frenetic pace. Learn how to be guided by the Holy Spirit…and much more.As in a marathon, the secret lied not in trying hard, but in training consistently. Proven by followers of Jesus over the centuries, the spiritual disciplines are exercises that strengthen your endurance race on the road to growth.This Participant Guide is designed for use together with The Life You’ve Always Wanted DVD (sold separately). When used together, they provide you with a practical tool that can grow your faith.Sessions include: 1. It’s Morphing Time 2. Slowing Down and Celebrating3. Praying and Confessing4. Meditating on Scripture and Seeking Guidance5. Practicing Servanthood, Finding Freedom6. Going the Distance with a Well-Ordered Heart",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    }
]