[
    {
        "Title": "The Last Battle: The Mayaguez Incident and the End of the Vietnam War",
        "Authors": "By Wetterhahn, Ralph",
        "Description": "As commanding and revelatory as the recent best-sellers Flags of Our Fathers and Black Hawk Down, this new volume on the Vietnam War ranges from an obscure Cambodian island in Southeast Asia to the Oval Office of the White House as it chronicles one of the most overlooked incidents and heartbreaking episodes in America's costliest foreign conflict. On May 12, 1975, barely two weeks after U.S. helicopters lifted off the roof of the American embassy in Saigon, the S.S. Mayaguez was seized by Cambodian forces. Four days later, President Gerald Ford ordered a raid to free the ship, even though American diplomacy had already successfully negotiated its release. The U.S. Marine strike force took flight. The ensuing battle, the last of the war, took fourteen hours and the lives of forty-one Americans, including three soldiers who were unwittingly left behind when the U.S. choppers flew off. Vietnam veteran Ralph Wetterhahn has spent more than five years investigating what happened that day in the Cambodian jungle: how the abandonment of the three men who guarded the flank of the vulnerable Marine position occurred; why they were left to their tragic fate; and how -- from unprecedented interviews with the Khmer Rouge captors -- they met their grisly deaths. His spellbinding account redeems to our national memory these three entirely forgotten young Marines and their brave deeds under fire.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Chocolate (Williams-Sonoma Kitchen Library)",
        "Authors": "By Williams, Chuck (EDT), Rosenberg, Allan (PHT), and Brody, Lora",
        "Description": "Offers recipes for chocolate cakes, pies, cookies, candies, puddings, and frozen desserts and includes tips on equipment, chocolate varieties, and decorating with chocolate",
        "Category": " Cooking , Courses & Dishes , Chocolate",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Best Life Diet Daily Journal",
        "Authors": "By Greene, Bob",
        "Description": "In The Best Life Diet, bestselling author Bob Greene gave you the keys to losing weight and keeping it off. In The Best Life Diet Daily Journal, the essential companion volume, Greene gives you the tools you need to stay motivated. No matter what phase of the program you are in, this beautifully designed book will reinforce your long-term personal plan for health and emotional well-being. Each day has space that helps you assess how well you've met your daily goals as well as a place to record your feelings and eating patterns. A weekly summary gives you an easy-to-evaluate snapshot of your progress, allowing you to begin the next week of your program with a clear picture of what you did well, where you fell short, and how you can improve.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Colorado Christmas: How to be a Millionaire/Love by Accident/Wife in Name Only (Heartsong Novella Collection)",
        "Authors": "By Dow, Rosey",
        "Description": "Historical Romance: A Christy award-winning author creates a rich blend of Christmas romance in three stories. Maggie Collier decides to train a bellboy to act like a millionaire to refer her brother for a loan approval. Will a case of mistaken identity lead to a hot spring of shame or uncover romance? Where a small train is caught in an avalanche near Rachel Wainwright's ranch,her family takes in a group of strangers over Christmas. But will a handsome neighbor's offer to help reawaken a family grudge? Catherine Priestly must pose as married to get a cooking job on a respectable ranch. Will her charade become a barrier to true love?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Publishing, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Kids Holiday Cooking (Williams-Sonoma Lifestyles)",
        "Authors": "By Williams, Chuck and Katzman, Susan Manlin",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life Custom Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Cooperstown: Baseball's Hall of Fame: Where the Legends Live Forever: Revised",
        "Authors": "By Reidenbaugh, Lowell, Hoppel, Joe, Carter, Craig, and Sloan, Dave (EDT)",
        "Description": "",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "What's That Pig Outdoors?: A Memoir of Deafness",
        "Authors": "By Kisor, Henry",
        "Description": "The author, who has been deaf since the age of three, recounts how deafness has affected his childhood, education, work as a newspaper editor, marriage, and family life",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Everything Buddhism Book: Learn the Ancient Traditions and Apply Them to Modern Life",
        "Authors": "By Sach, Jacky",
        "Description": "Provides an easy-to-understand introduction to the principles and practices of Buddhism, tracing the origins and history of the religion, examining the life of the Buddha and the development of his teachings, and discussing the tenets of the Four Noble Truths, the Eightfold Path, and the Five Precepts of Buddhist ethics. Original.",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Israel (Insight Guide Israel)",
        "Authors": "By Barrett, Pam",
        "Description": "Notable for its evocative color photography focusing as much on the people as places, this guidebook covers the major sites of interest, including history, descriptions, and maps, with a full listing of basic travel details. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Travel , Middle East , Israel",
        "Publisher": "Langenscheidt Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Home Plays, a Collection of Plays for Boys and Girls by Various Living Writers with Plain Instructions for Costumes, Scenery, Etc",
        "Authors": "By Bullivant, Cecil H (Ed. )",
        "Description": "",
        "Category": "",
        "Publisher": "Dodge Publishing Company, New York [1911]",
        "Price Starting With ($)": "17.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1911"
        }
    },
    {
        "Title": "Begum's Fortune, The With an Account of The Mutineers of the \"Bounty\"",
        "Authors": "By Jules Verne",
        "Description": "",
        "Category": "",
        "Publisher": "Sampson Low, Marston, Searle & Rivington",
        "Price Starting With ($)": "222.57",
        "Publish Date": {
            "Month": "January",
            "Year": "1883"
        }
    },
    {
        "Title": "Dirigible",
        "Authors": "By Frank A. Andrews",
        "Description": "",
        "Category": "",
        "Publisher": "A.L. Burt Company",
        "Price Starting With ($)": "49.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1931"
        }
    },
    {
        "Title": "VINEGARROON The Saga of Judge Roy Bean, \"Law West of the Pecos\"",
        "Authors": "By McDaniel, Ruel",
        "Description": "",
        "Category": "",
        "Publisher": "Southern Publishers",
        "Price Starting With ($)": "14.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1936"
        }
    },
    {
        "Title": "Portrait of the assassin,",
        "Authors": "By Ford, Gerald R.",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "10.65",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Sandra Lee Semi-Homemade Cooking 3",
        "Authors": "By Lee, Sandra",
        "Description": "Internationally acclaimed lifestyle and food expert Sandra Lee creates gourmet-tasting meals perfectly suited for today's busy lifestyle. Using 70% store bought ingredients and 30% “fresh” or homemade, Semi-Homemade Cooking 3 is an exciting collection of more than 120 recipes embracing all types of popular cuisine: Comfort Food, Italian, French, Mexican, Soul Food, and Pan-Asian flavors. As a bonus, Sandra offers a chapter that showcases recipes from her closest friends and family as well as a chapter featuring recipes inspired by some of her fellow Food Network celebrity chefs, such as Bobby Flay, Wolfgang Puck, and Emeril Lagasse. And back by popular demand, Sandra shares another batch of Restaurant Remakes, making it easier than ever to recreate those dine-out favorites in the comfort of your own kitchen.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "The Folk Remedy Encyclopedia: Olive Oil, Vinegar, Honey and 1,001 Other Home Remedies",
        "Authors": "By Frank W. Cawood and Associates",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Everyday Life of Medieval Travellers",
        "Authors": "By Rowling, Marjorie",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Dorset Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "An Introduction to Christianity",
        "Authors": "By McGrath, Alister E.",
        "Description": "After an introduction to biblical sources and a discussion of the central figure of Jesus, sections explain Christian theology, the history of Christianity, and Christianity in the modern world. Includes study questions, boxed key concepts, a glossary, a guide to Christian resources on the Internet, and a list of software packages related to the study of Christianity. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Wiley-Blackwell",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Real Goods Solar Living Source Book: The Complete Guide to Renewable Energy Technologies and Sustainable Living",
        "Authors": "By Schaeffer, John (EDT) and Pratt, Doug (EDT)",
        "Description": "Covers power, conservation, and gear",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Real Goods",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Semi Homemade 20 Minute Meals 2",
        "Authors": "By Lee, Sandra",
        "Description": "In Semi-Homemade 20-Minute Meals 2, Sandra Lee delivers another delicious collection of timesaving, shortcut meals that use the 70% store bought and 30% “fresh” or homemade formula. The cookbook features 60 perfect meal pairs, so there is no time wasted guessing which main dish will go with which side dish. And, if the occasion calls for it, there are chapters on tempting Treats and Starters, all designed to maximize flavor and minimize your time in the kitchen.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Super Crunchers: Why Thinking-By-Numbers is the New Way To Be Smart",
        "Authors": "By Ayres, Ian",
        "Description": "An international sensation—and still the talk of the relevant blogosphere—this Wall Street Journal and New York Times business bestseller examines the “power” in numbers. Today more than ever, number crunching affects your life in ways you might not even imagine. Intuition and experience are no longer enough to make the grade. In order to succeed—even survive—in our data-based world, you need to become statistically literate.Cutting-edge organizations are already crunching increasingly larger databases to find the unseen connections among seemingly unconnected things to predict human behavior with staggeringly accurate results. From Internet sites like Google and Amazon that use filters to keep track of your tastes and your purchasing history, to insurance companies and government agencies that every day make decisions affecting your life, the brave new world of the super crunchers is happening right now. No one who wants to stay ahead of the curve should make another keystroke without reading Ian Ayres’s engrossing and enlightening book.",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Best Kept Secrets to Healthy Aging",
        "Authors": "By Purity Research Department",
        "Description": "",
        "Category": "",
        "Publisher": "Purity Products",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Teaching Word Recognition, Spelling, and Vocabulary: Strategies from the Reading Teacher",
        "Authors": "By International Reading Association (COR), Rasinski, Timothy V. (EDT), Padak, Nancy D. (EDT), Church, Brenda Weible (EDT), Fawcett, Gay (EDT), Hendershop, Judith (EDT), Henry, Justin (EDT), Moss, Barbara G. (EDT), Peck, Jacqueline K. (EDT), Pryor, Elizabeth (EDT), and Roskos, Kathleen A. (EDT)",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Intl Literacy Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Grow Organic, Cook Organic: Natural Food from Garden to Table, with Over 1750 Photographs",
        "Authors": "By Ysanne Spevack, Christine Lavelle, Michael Lavelle",
        "Description": "",
        "Category": "",
        "Publisher": "Lorenz Books",
        "Price Starting With ($)": "8.82",
        "Publish Date": {
            "Month": "June",
            "Year": "2015"
        }
    },
    {
        "Title": "Women Living With Multiple Sclerosis: Conversations on Living, Laughing and Coping",
        "Authors": "By Nichols, Judith Lynn",
        "Description": "This is a unique guide for women dealing with the difficulties of multiple sclerosis. After she was diagnosed with Multiple Sclerosis in 1976, author Judith Lynn Nichols realized that people suffering from chronic illness fare better when they share experiences with people fighting the same disease. While researching MS on the Internet, she connected with a group of women fighting to live with MS. The group quickly became each woman's support network, and, in the daily emails compiled in this book, they offered each other wisdom and humor about everything this disorder affects: diagnosis, employment, spirituality, family reactions, sexuality, pain control, depression, and more.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Hunter House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Alhambra and the Generalife",
        "Authors": "By Marino Antequera",
        "Description": "",
        "Category": "",
        "Publisher": "Editorial Padre Suarez",
        "Price Starting With ($)": "7.03",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "World Hunger: Twelve Myths (22)",
        "Authors": "By Lappe, Frances Moore, Collins, Joseph, Rosset, Peter, and Institute for Food and Development Policy (Oakland, Calif.) (COR)",
        "Description": "In this completely revised and updated edition of the most authoritative book on world hunger, three of our foremost experts on food and agriculture expose and explode the myths that prevent us from effectively addressing the problem. Drawing on and distilling the extensive research of the Institute for Food and Development Policy (Food First), Lappé, Collins, and Rosset examine head-on the policies and politics that have kept hungry people from feeding themselves around the world, in both Third and First World countries, as well as the misconceptions that have obscured our own national, social, and humanitarian interests. Written in a straightforward, easy-to-read style, World Hunger: Twelve Myths shakes many tenaciously held beliefs; but most important, it convinces readers that by standing together with the hungry we can advance not only humanitarian interests, but our own well-being.",
        "Category": " Social Science , Poverty & Homelessness",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "A Tapestry of Justice, Service and Unity: Local Ecumenism in the United States, 1950-2000",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "NAEIS Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Blueprint for Disaster: A Get Fuzzy Collection (Volume 5)",
        "Authors": "By Conley, Darby",
        "Description": "You have to wonder what kind of pets cartoonist Darby Conley had as a child. If they were anything like Bucky Katt and Satchel Pooch. . . well, life in the Conley house must have been interesting to say the least. The wacky triumvirate of Bucky, Satchel, and Rob are back in the fourth Get Fuzzy collection, Blueprint for Disaster, and ?interesting? doesn?t begin to describe their antics. Rob Wilco is the mild-mannered ad executive caretaker of Bucky and Satchel. Satchel is a sweet and naive shar-pei-yellow-Lab cross, while Bucky is a Siamese with ?cat-titude? to spare. Bucky and Satchel get along like, well, like cats and dogs. Like a beleaguered parent, Rob constantly must thwart Bucky?s schemes and protect the unsuspecting Satchel. His pets? mischief continually disrupts his attempts to meet women. You try explaining to your date why your cat thinks he?s a gangsta rapper and your dog is filming his ?crib? for MTV. Would anyone live with humans who behaved like this?Bitingly funny with a wry sense of the absurdity of life with pets, Get Fuzzy appeals to everyone who has ever lived in a mixed-species household. Blueprint for Disaster is sure to be yet another Get Fuzzy best-seller.",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Chinese Business Etiquette: A Guide to Protocol, Manners, and Culture in thePeople's Republic of China",
        "Authors": "By Seligman, Scott D. and Trenn, Edward J. (ILT)",
        "Description": "East-West business is booming as thousands of people flock to China. The author, with 25 years of experience dealing with the Chinese, provides up-to-date advice on how to succeed, avoid gaffes, interpret behaviour and make positive impressions.",
        "Category": " Business & Economics , Business Etiquette",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "As One with Authority",
        "Authors": "By Carroll, Jackson W.",
        "Description": "",
        "Category": " Religion , Christian Living , Professional Growth",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Emyl Jenkins' Pleasures Of The Garden",
        "Authors": "By Jenkins, Emyl, Henderson, Chip (PHT), and Henderson, Chip",
        "Description": "The author of Emyl Jenkins' Southern Christmas explores the poetry and allure of the garden, interspersing reminiscences, literary quotations, and imaginative crafts with 250 color photographs. 35,000 first printing. Tour.",
        "Category": " Gardening , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Golf's Sacred Journey: Seven Days at the Links of Utopia",
        "Authors": "By David L. Cook",
        "Description": "",
        "Category": "",
        "Publisher": "Sacred Journey Stories",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Japan: A Concise History (Littlefield Adams Quality Paperbacks)",
        "Authors": "By Meyer, Milton W.",
        "Description": "This popular introduction to Japan offers readers an authoritative and up-to-date overview of 2,000 years of Japanese history. Milton W. Meyer's concise explanations of Japanese traditions, religion, history, economics, politics, and relations with the West provide an invaluable aid for understanding contemporary Japanese society and values.",
        "Category": " History , Asia , Japan",
        "Publisher": "Littlefield Adams Quality Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Under the Blood-Red Sun",
        "Authors": "By Salisbury, Graham",
        "Description": "Tomi was born in Hawaii. His grandfather and parents were born in Japan, and came to America to escape poverty.World War II seems far away from Tomi and his friends, who are too busy playing ball on their eighth-grade team, the Rats.But then Pearl Harbor is attacked by the Japanese, and the United States declares war on Japan. Japanese men are rounded up, and Tomi’s father and grandfather are arrested. It’s a terrifying time to be Japanese in America. But one thing doesn’t change: the loyalty of Tomi’s buddies, the Rats.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "No Experience Necessary: Contacting and Inviting Made Easy",
        "Authors": "By Baker, Ron",
        "Description": "",
        "Category": "",
        "Publisher": "DreamHouse Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Instruction Book for Being a Person: Or Just Feeling Better",
        "Authors": "By Lewis, Jerry",
        "Description": "",
        "Category": "",
        "Publisher": "Executive Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "If They Say No, Just Say NEXT!:  24 Secrets for Going Through the Noes to Get to the Yeses",
        "Authors": "By Fuhrman, John",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Markowski Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Sway: A Novel",
        "Authors": "By Lazar, Zachary",
        "Description": "Three dramatic and emblematic stories intertwine in Zachary Lazar's extraordinary new novel, SWAY--the early days of the Rolling Stones, including the romantic triangle of Brian Jones, Anita Pallenberg, and Keith Richards; the life of avant-garde filmmaker Kenneth Anger; and the community of Charles Manson and his followers. Lazar illuminates an hour in American history when rapture found its roots in idolatrous figures and led to unprovoked and inexplicable violence. Connecting all the stories in this novel is Bobby Beausoleil, a beautiful California boy who appeared in an Anger film and eventually joined the Manson \"family.\" With great artistry, Lazar weaves scenes from these real lives together into a true but heightened reality, making superstars human, giving demons reality, and restoring mythic events to the scale of daily life.  \"One hypnotic tone poem.... It is not the now-historic acts of violence that make Sway so riveting, but its vivid character portraits and decadent, muzzy atmosphere, all rendered with the heightened sensory awareness associated with drugs and paranoia. The near miniaturist precision with which he describes Keith Richards's attempts to master his guitar, Brian Jones's acid trips and Anger's obsessive desire for Beausoleil bring this large-scale tableau into stunning relief.\" --Liz Brown, Time Out New York",
        "Category": " Fiction , Biographical",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Stop Dating the Church!: Fall in Love with the Family of God (LifeChange Books)",
        "Authors": "By Harris, Joshua",
        "Description": "Putting in their hour or two on the weekend, many Christians take the rest of the week off, neglecting the church and her needs. It’s not a serious relationship. Some shop around, looking for a church that suits their lifestyle. It’s dating, with no assurances, no obligations. Bestselling author Joshua Harris calls Christians to stop playing the field and commit, just as Christ is committed to us, His bride. In his new book, Harris explores the ramifications of Ephesians 5:25–32, which proclaims the intensity and the breadth of Jesus Christ’s love for His church. God has designed us to build our lives around a local church; we cannot be indifferent or uninvolved. Rather, we must be in love with and committed to God’s plan and purpose through the church. Are you dating the church, or are you committed?Are You Dating the Church? We are a generation of consumers, independent and critical. We attend church, but we don't want to settle down and truly invest ourselves. We're not into commitment — we only want to date the church. Is this what God wants for us? Stop Dating the Church reminds us that faith was never meant to be a solo pursuit. The church is the place God grows us, encourages us, and uses us best. Loving Jesus Christ involves a passionate commitment to His church — around the world and down the street. We can't be apathetic. It's time to fall in love with the family of God.Story Behind the BookLike all my books, this one is very closely tied to my own journey. I’ve been a church-dater. And I’ve learned just how good it is to get serious about the church. I want to see my generation get a hold of God’s purpose and plan for the local church, too. The same month this book is released I’ll become the senior pastor of my church. This awesome responsibility is being passed on to me by my mentor, C. J. Mahaney, a pastor who has faithfully served for over 26 years. So this book is marking a very important transition in my life. The church isn’t some other generation’s responsibility—it isn’t somebody else’s business. I have to take responsibility. I have to be passionate and committed to it. Through the pages of this book, I’m calling my generation to do the same.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Elijah (The Nightwalkers, Book 3)",
        "Authors": "By Frank, Jacquelyn",
        "Description": "New York Times BestsellerDear Reader,       Please note that the text of this story, ELIJAH by Jacquelyn Frank, begins on page 7.  The first six pages are the teaser copy, the Also By The Author page, the title page, the copyright page and the dedication.     Also on the inside front cover, it lists NOAH as available now.  That title will be published in September, 2008.      Sorry for any confusion.        They are called the Demons, one of the elusive Nightwalker races living in shadow and struggling for survival against their human enemies. Their proudest warrior is Elijah, a man who bends for nothing and no one.  .  .until one woman brings him to his knees.  .  .      Some Feelings You Just Can't Fight      He is known as the Warrior Captain--a master of every weapon, a fierce soldier sworn to protect his kind. Powerful, relentless, merciless, Elijah has always won every battle he's ever taken on--until now. Ambushed by necromancers, he is left for dead only to be discovered by the woman who could very well deliver the final blow.  .  .Siena, the Lycanthrope Queen.    With three centuries of warring, little more than a decade of uneasy peace has existed between the Lycanthropes and Elijah's people. Now, after a lifetime of suspicion, the warrior in Elijah is consumed with a different battle--winning Siena's heart by giving her pleasure beyond all boundaries. What starts as attraction and arousal soon burns into a passion with consequences that will echo through the ages for both their people. And as would-be enemies become inseparable lovers, another threat approaches, one with the power to destroy them all.  .  .        Surrender to the night.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Prime for Life: Functional Fitness for Ageless Living",
        "Authors": "By Raugh, Randy",
        "Description": "Each year, hundreds of people make the decision to leave the routines and restrictions of their daily lives and come to Canyon Ranch, the world-renowned wellness and health center in Tucson, Arizona, for a life-changing week. Within that short time, guests at the ranch reconnect with the natural world and their place in it as living, breathing, moving creatures.   In his role as fitness director of the Life Enhancement Program at Canyon Ranch, physical therapist Randy Raugh helps guests of all ages—and with all ranges of fitness levels—understand how movement and activity will not only enrich their lives but will also protect them from disease, obesity, and the negative aspects of aging. As children, our bodies are primed to move—every ligament, tendon, and muscle is supple and receptive to even the most sudden movements. As we age, however, our movements become more careful due to pain or fear of injury. According to Randy Raugh, it doesn't have to be this way. The latest research suggests that it's not our bodies that compel us to slow down or stop enjoying what we used to do, but it's our conscious connection to our bodies that diminishes. And that's a big part of what makes us \"feel old\"—when we don't have to at all.   In Prime for Life, Randy Raugh offers the revolutionary approach he uses with his patients at Canyon Ranch to help them achieve long, active lives. By focusing on maintaining healthy joints and providing specific strategies for doing so, Raugh shows you how to: -Prevent injuries and heal physical damage accumulated over a lifetime -Achieve better results from exercise while eliminating joint and muscle pain -Learn how to talk to doctors about surgeries and detect common misdiagnoses-Discover how to create a simple fitness plan that fits into your daily routine -Find out the truth behind common myths, such as \"surgery is your only option\"   Based on cutting-edge research, more than two decades of hands-on experience, and the stories of real people, Prime for Life provides the innovative exercise strategies, tips, and tools you need to build and maintain a strong, pain-free, youthful body.",
        "Category": " Health & Fitness , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Child of a Dead God: A Novel of the Noble Dead (Series One, Bk. 6)",
        "Authors": "By Hendee, Barb and Hendee, J. C.",
        "Description": "For years, Magiere and Leesil have sought a long-forgotten artifact, even though its purpose has been shrouded in mystery. All Magiere knows is that she must keep the orb from falling into the hands of a murdering Noble Dead, her half- brother Welstiel. And now, dreams of a castle locked in ice lead her south, on a journey that has become nothing less than an obsession?",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Dark Embrace (Masters of Time, Book 3)",
        "Authors": "By Joyce, Brenda",
        "Description": "Aidan, the Wolf of Awe, has abandoned the Brotherhood and forsaken his vows. Feared by all and trusted by none, he hunts alone, seeking vengeance against the evil that destroyed his son. He has not saved an Innocent in sixty-six years&#151;until he hears Brianna Rose’s scream of terror across centuries, and leaps to modern-day Manhattan to rescue her&#133;.Brie is a gifted empath who spends her time fighting evil from the safety of her laptop&#151;and fantasizing about the medieval Highlander she met just once. Still, her life is pretty ordinary&#151;until she awakens one night consumed with Aidan’s pain and rage. When Aidan suddenly appears and takes her hostage, Brie cannot believe how dark and dangerous he has become. She knows she should be afraid, but instead, she will fight across time for his redemption&#133;and his love.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Hollywood Moon: A Novel (Hollywood Station)",
        "Authors": "By Wambaugh, Joseph",
        "Description": "There's a saying at Hollywood station that the full moon brings out the beast--rather than the best--in the precinct's citizens.  One moonlit night, LAPD veteran Dana Vaughn and \"Hollywood\" Nate Weiss, a struggling-actor-turned cop, get a call about a young man who's been attacking women.  Meanwhile, two surfer cops known as Flotsam and Jetsam keep bumping into an odd, suspicious duo--a smooth-talking player in dreads and a crazy-eyed, tattooed biker.  No one suspects that all three dubious characters might be involved in something bigger, more high-tech, and much more illegal.  After a dizzying series of twists, turns, and chases, the cops will find they've stumbled upon a complex web of crime where even the criminals can't be sure who's conning whom.  Wambaugh once again masterfully gets inside the hearts and minds of the cops whose jobs have them constantly on the brink of danger.  By turns heart-wrenching, exhilarating, and laugh-out-loud funny, Hollywood Moon is his most thrilling and deeply affecting ride yet through the singular streets of LA.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "24.95",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "No Rest for the Witches",
        "Authors": "By Davidson, MaryJanice, Warren, Christine, McCray, Cheyenne, and Handeland, Lori",
        "Description": "MaryJanice Davidson “The Majicka”Life’s a bit crowded for Ireland and her roommates—a fairy, a werewolf, a vampire, and now a zombie…especially when a mysterious man walks through the door. Will there be any room left for love? Lori Handeland “Voodoo Moon”For Devil’s Fork–based FBI Agent Dana Duran, the only way to fight a supernatural serial killer just may be to embrace life. But little did she know that voodoo could be so viciously sexy… Cheyenne McCray “Breath of Magic” San Francisco’s witches are in an epic battle. But even if Sydney can use her sultry ways and ancient Druid powers to save the world, can she risk losing her heart to handsome warrior Conlan? Christine Warren“Any Witch Way She Can”A desperately lonely witch decides to take matters of love into her own hands when she casts a cosmic personal ad…only to find that the perfect formula for love is a strange brew indeed.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Night Fall: A Novel (T-FLAC: Night Trilogy)",
        "Authors": "By Adair, Cherry",
        "Description": "T-FLAC/psi operative Simon Blackthorne goes to Africa to continue the global war against paranormal terror–never expecting to clash swords with strong-willed Kess Goodall. Kess struggles in her own desperate battle to unravel a deadly secret that has killed millions in the tiny country of Mallaruza. But Simon proves to be the ultimate distraction: his very presence takes her body to the edge of a pleasure-filled abyss, his touch superbly rapturous. Now, against a backdrop of staggering beauty and horrific violence, with danger at every turn and libidos in overdrive, a spirited woman and an indomitable wizard face a malevolent force more frightening than both can imagine.With foes strong and numerous, Kess and Simon must forge a bond strong enough to eliminate a sadistic enemy before Mallaruza is lost to terrorist control and the world forever changed.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Phonics They Use: Words for Reading and Writing (4th Edition)",
        "Authors": "By Cunningham, Patricia M.",
        "Description": "In this update of the 2000 edition, Cunningham (Wake Forest U.) includes new chapters on fluency and assessment, new activities and strategies, an adaptable fluency development lesson, updated research grounding this approach, and a glossary of phonics jargon teachers need to know. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Language Arts & Disciplines , Reading Skills",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Seduced by Magic (Magic Series, Book 2)",
        "Authors": "By McCray, Cheyenne",
        "Description": "Copper Ashcroft is an accomplished D’Anu witch, but the magic she wields is a potent force—strong enough to hurl her into a mysterious Otherworld when a spell backfires. Before Copper can escape, another being is pulled into her realm—Tiernan, a powerfully virile Tuatha D’Danann warrior. Blond, blue-eyed, and shamelessly seductive, Tiernan could be Copper’s savior…and his touch sets her body on fire. Like others of his kind, Tiernan stands alongside the D’Anu witches to battle the demons of the Underworld. Obligation to his cause and his people cautions against any entanglement with Copper, yet each second spent with this beautiful, uninhibited woman stirs an insatiable hunger. Desire explodes into carnal bliss, but the visions that haunt Copper’s dreams are growing stronger, and they foretell a terrifying evil waiting to be unleashed… Saving the city will take more than brute strength…more than witchcraft. Only together can Copper and Tiernan find a way to overcome the dark forces—and seize a passion that has bewitched them both.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Great Jewish Ideas",
        "Authors": "By Abraham Ezra (Editor) Millgram",
        "Description": "",
        "Category": "",
        "Publisher": "B'nai B'rith Dept of Adult Jewish Education",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Shadow Magic (Magic Series, Book 4)",
        "Authors": "By McCray, Cheyenne",
        "Description": "Bestselling author Cheyenne McCray’s Shadow Magic is dark and dangerous. And deeply sensual...THE SINS OF THE PASTWhen Hannah Wentworth temporarily flees her life in San Francisco to join her sister D’Anu witches in Otherworld, she vows to help them conquer the evil bent on destroying the human realm. But the only one who can help her happens to be the king of the Dark Elves. The father to her nemesis, Rhiannon of the D’Anu. And the one man Hannah can never, ever trust...especially because of her dangerous attraction to him.ARE COMING TO LIGHT…Garran knows that the beautiful, headstrong Hannah is wary of him for having banished his people to a life underground. But now Garran can right that wrong by helping her and the other gray witches in their dangerous battle in San Francisco—even if doing so means sacrificing the passion he’s found only in Hannah’s arms…“Cheyenne McCray has created a fabulous new world. You won’t be able to get enough!”—Lori Handeland, USA Today bestselling author",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The paper economy",
        "Authors": "By BAZELON, David T.",
        "Description": "",
        "Category": "",
        "Publisher": "Random",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Master of Darkness (Primes Series, Book 4)",
        "Authors": "By Sizemore, Susan",
        "Description": "When vampire hunter Eden Faveau mistakes Laurent, a renegade vampire of Tribe Manticore, for her new partner, he's not about to correct her. He's stolen a laptop full of sensitive files from the Tribe leader, Justinian, and needs help cracking the encryption. At first he wants sexy and intelligent Eden only for her computer wizardry -- but soon he wants her for much, much more.   Working by night and growing closer every day, Laurent and Eden struggle with the passion that threatens to overwhelm them. But when Justinian captures Eden, and Laurent proves his loyalty to his Tribe in the most shocking of ways, Eden vows to kill Laurent for his deception. Can he find a way to prove his love for her before a full-on war breaks out between vampires and humans?",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Dog and the Hog (Sounds & Symbols Early Phonics Storybooks)",
        "Authors": "By Connie McCallister",
        "Description": "",
        "Category": "",
        "Publisher": "Calvert School Inc.",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Sotah (Readers Guide Editions)",
        "Authors": "By Ragen, Naomi",
        "Description": "Fragile, exquisite Dina Reich was raised to be an obedient daughter, a dutiful wife. In modern Jerusalem, within the vigilant confines of the ultra-orthodox world of the Haredim, she is bound by the strictest letter of ancient law.At seventeen, Dina enters an arranged marriage to a loving, generous man. But restless yearnings - for knowledge, for romance, for excitement - drive her into a dangerous flirtation. When the insular community learns of her transgression, Dina is subjected to an ordeal. Like the Biblically ordained ritual for the wife suspected of adultery, the Sotah, this will either destroy her or vindicate her completely. Forced into exile in New York, Dina is appalled by the shallowness of American life. Yet it is here that she must fashion her own traditions and find the courage to return to Jerusalem to reclaim her husband, her family and her life. Ninety three weeks on the best seller lists.",
        "Category": " Fiction , Literary",
        "Publisher": "Toby Pr",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Hallowed Hymns New and Old",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Biglow & Main",
        "Price Starting With ($)": "53.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1908"
        }
    },
    {
        "Title": "The New Millennium Reader (2nd Edition)",
        "Authors": "By Hirschberg, Stuart (EDT) and Hirschberg, Terry (EDT)",
        "Description": "The second edition of The New Millennium Reader features many authors and particular works that have never before been anthologized. This thematic reader identifies and brings together in one collection some of the most important insights, discoveries, and reflections of the past millennia by the most noteworthy writers in nonfiction and fiction.",
        "Category": " Language Arts & Disciplines , Rhetoric",
        "Publisher": "Prentice-Hall",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "FIX-IT and FORGET-IT LIGHTLY : Healthy, Low-Fat Recipes for Your Slow Cooker",
        "Authors": "By Good, Phyllis Pellman",
        "Description": "Yes, Now you can have it all: Food from your slow cooker that is scrumptious, quick and easy to prepare and low fat!",
        "Category": " Cooking , Reference",
        "Publisher": "Good Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Just Like Jesus: Learning to Have a Heart Like His",
        "Authors": "By Lucado, Max",
        "Description": "In his best-selling book Just Like Jesus, Max Lucado explains that God loves you just the way you are . . . but He refuses to leave you that way.  Why?  Because our ultimate goal should be a life that is just like Jesus.  And with determination, faith and God's help, we can all change for the better, no matter how long the bad habits have settled in.  The reputation and recognition of the bestseller is sure to make this new edition an instant favorite.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Seventy Times Seven: The Power of Forgiveness",
        "Authors": "By Arnold, Johann Christoph",
        "Description": "Tells stories of real people scarred by crime, betrayal, abuse, and war, and how they used forgiveness to heal themselves and achieve peace of mind",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Plough Pub House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "From a Mother's Heart: Stories of God's Faithfulness",
        "Authors": "By Difato, Theresa",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Word Among Us Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Handbook (Softcover) Grades 5-6 2004 (Math at Hand)",
        "Authors": "By Great Source Education Group",
        "Description": "Provides information on math concepts, including number theory, fractions, percentages, and geometry.",
        "Category": " Juvenile Nonfiction , Mathematics , Arithmetic",
        "Publisher": "GREAT SOURCE",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Studies in the Early Church: A year's course providing a daily scheme for personal study",
        "Authors": "By Morgan, Charles Herbert, Taylor,Thomas Eddy, and Taylor, S. Earl",
        "Description": "",
        "Category": "",
        "Publisher": "Jennings & Graham",
        "Price Starting With ($)": "8.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1907"
        }
    },
    {
        "Title": "From Reliable Sources: An Introduction to Historical Methods",
        "Authors": "By Howell, Martha C. and Prevenier, Walter",
        "Description": "From Reliable Sources is a lively introduction to historical methodology, an overview of the techniques historians must master in order to reconstruct the past. Its focus on the basics of source criticism, rather than on how to find references or on the process of writing, makes it an invaluable guide for all students of history and for anyone who must extract meaning from written and unwritten sources.Martha Howell and Walter Prevenier explore the methods employed by historians to establish the reliability of materials; how they choose, authenticate, decode, compare, and, finally, interpret those sources. Illustrating their discussion with examples from the distant past as well as more contemporary events, they pay particular attention to recent information media, such as television, film, and videotape.The authors do not subscribe to the positivist belief that the historian can attain objective and total knowledge of the past. Instead, they argue that each generation of historians develops its own perspective, and that our understanding of the past is constantly reshaped by the historian and the world he or she inhabits.A substantially revised and updated edition of Prevenier's Uit goede bron, originally published in Belgium and now in its seventh edition, From Reliable Sources also provides a survey of western historiography and an extensive research bibliography.",
        "Category": " Philosophy , Methodology",
        "Publisher": "Cornell University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Thief and the Dogs",
        "Authors": "By Mahfouz, Naguib",
        "Description": "Naguib Mahfouz's haunting novella of post-revolutionary Egypt combines a vivid pychological portrait of an anguished man with the suspense and rapid pace of a detective story.After four years in prison, the skilled young thief Said Mahran emerges bent on revenge. He finds a world that has changed in more ways than one. Egypt has undergone a revolution and, on a more personal level, his beloved wife and his trusted henchman, who conspired to betray him to the police, are now married to each other and are keeping his six-year-old daughter from him. But in the most bitter betrayal, his mentor, Rauf Ilwan, once a firebrand revolutionary who convinced Said that stealing from the rich in a unjust society is an act of justice, is now himself a rich man, a respected newspaper editor who wants nothing to do with the disgraced Said. As Said's wild attempts to achieve his idea of justice badly misfire, he becomes a hunted man so driven by hatred that he can only recognize too late his last chance at redemption.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Search",
        "Authors": "By Mahfouz, Naguib, Islam, Mohamed (TRN), and Wahba, Magdi (EDT)",
        "Description": "A powerful story of lust, greed and murder.  Unflinching, tough, and dramatic, The Search was most certainly intended to be a harsh criticism of Post-Revolution morality, but, on its most elemental level, it is  a lurid and compelling tale.",
        "Category": " Fiction , General",
        "Publisher": "Anchor Books Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Gandhi: His Life and Message for the World",
        "Authors": "By Fischer, Louis",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "Theft of the Spirit: A Journey to Spiritual Healing",
        "Authors": "By Hammerschlag, Carl A.",
        "Description": "Using Native American experience as an example, the author provides advice on living wisely, well, and spiritually in an increasingly materialistic world",
        "Category": " Psychology , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Red, White & Dead (An Izzy McNeil Novel, 3)",
        "Authors": "By Caldwell, Laura",
        "Description": "Izzy McNeil is hot on the trail of one of Chicago's most notorious gangsters. Not that he realizes the crimson-tressed enchantress, a self-proclaimed \"lapsed lawyer,\" is moonlighting as a private investigator. But when an unexpected run-in trashes Izzy's cover, she's swept into an evil underworld where she is definitely not safe.That is until Izzy receives help from an unlikely source: the ultimate guardian angel. And the last person she ever dreamed she'd see again. Now Izzy is racing from Chicago to Rome, all the while battling personal demons, Mafiosi killers and red hot emergency desires….",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Clinton & Me",
        "Authors": "By Katz, Mark",
        "Description": "A whimsical account of life in politics chronicles the odyssey of the eventful life and times of the in-house humor writer for the Clinton administration, offering a unique view of American politics at work. 35,000 first printing.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Miramax",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Why Don't Cats Like to Swim?: An Imponderables Book (Imponderables Series, 1)",
        "Authors": "By Feldman, David and Schwan, Kassie (ILT)",
        "Description": "Why does an \"X\" stand for a kiss?Which fruits are in Juicy Fruit® gum?Why do people cry at happy endings?Why do you never see baby pigeons?Pop-culture guru David Feldman demystifies these topics and so much more in Why Don't Cats Like to Swim? -- the unchallenged source of answers to civilization's most perplexing questions. Part of the Imponderables® series, Feldman's book arms readers with information about everyday life -- from science, history, and politics to sports, television, and radio -- that encyclopedias, dictionaries, and almanacs just don't have. Where else will you learn what makes women open their mouths when applying mascara?",
        "Category": " Humor , Form , Essays",
        "Publisher": "Harper-perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Gloves-off Economy: Workplace Standards at the Bottom of America's Labor Market (LERA Research Volumes)",
        "Authors": "By Bernhardt, Annette (EDT), Boushey, Heather (EDT), Dresser, Laura (EDT), and Tilly, Chris (EDT)",
        "Description": "Across the United States, increasing numbers of employers are breaking, bending, or evading long-established laws and standards designed to protect workers, from the minimum wage to job safety standards to the right to organize. This \"gloves-off economy,\" no longer confined to a marginal set of sweatshops and fly-by-night small businesses, is sending shock waves into every corner of the low-wage labor market. In the process, employers who play by the rules are under growing pressure to follow suit, intensifying the search for low-cost business strategies across a wide range of industries and ratcheting up into ever higher reaches of the labor market. Although other books have touched on pieces of this problem, The Gloves-off Economy is the first to provide a comprehensive, integrated analysis—and quite a disturbing one.This book examines a range of gloves-off practices, the workers who are affected by them, and strategies for enforcing workplace standards. The editors, four respected labor scholars, have brought together economists, sociologists, labor attorneys, union strategists, and other experts to offer varying perspectives on both the problem and the creative solutions currently being explored in a wide range of communities and industries. Annette Bernhardt, Heather Boushey, Laura Dresser, and Chris Tilly and the volume's other authors combine rigorous analysis with a stirring call to renew worker protections in the twenty-first century.",
        "Category": " Business & Economics , Labor",
        "Publisher": "ILR Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Welcome!: A Biblical and Practical Guide to Receiving New Members",
        "Authors": "By Stutzman, Ervin R.",
        "Description": "",
        "Category": " Social Science , Sociology of Religion",
        "Publisher": "Herald Press (PA)",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Valentine'S Day Grump - Pbk (Giant First Start Reader)",
        "Authors": "By Greydanus, Rose and Page, Don (ILT)",
        "Description": "Everyone is too afraid of Gus the grump to give him a valentine and make him happy",
        "Category": "",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Chemical Free Lawn",
        "Authors": "By Schultz, Warren",
        "Description": "Tells how to select a type of grass appropriate to the site, discusses seeding, sodding, feeding, and mowing, and suggests ways to handle weeds and pets",
        "Category": " Gardening , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Legion",
        "Authors": "By Altimari, William",
        "Description": "",
        "Category": " Fiction , War & Military",
        "Publisher": "Imperium Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "When Chocolate Milk Moved In (Life in the 'fridge)",
        "Authors": "By Harvey, Ken and Hermes, Mary Sue (ILT)",
        "Description": "Frank Gallon is suspicious of Fuller Chocolate when he moves into the magical refrigerator, and all their food friends have to pitch in when their relationship turns sour.",
        "Category": " Juvenile Fiction , Social Issues , Values & Virtues",
        "Publisher": "Brookfield Reader",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Best of Mexico",
        "Authors": "By Righter, Evie (EDT)",
        "Description": "Among the world's great cuisines, the foods of Mexico stand out in their diversity and creativity. Rooted in its history of great and ancient Indian civilizations, inspired by the Spanish Conquistadores of the sixteenth century, and influenced by European tastes in the later revolutionary years, it is indeed a dynamic cuisine -- adaptable but remarkably complete even in its melding of different cultures.In The Best of Mexico, food editor Evie Righter has chosen the finest examples of culinary creativity from this intriguing and vibrant country. From the chiles, chocolate, nuts, and tomatoes puréed into exquisite sauces, to the corn, beans, avocados, and seafood combined into flavorful dishes, she presents the Mexican cook's ingredients and techniques in a clear and accessible style that will enlighten and inspire.Here are the favorite drinks, salsas, and tacos; festive dishes including enchiladas, tamales, and pozoles; elegant entrées like Mole Poblano de Guajolote and Pescado a la Veracruzana, and well-loved desserts like Flan and Buñuelos.Color photographs throughout feature the dishes themselves as well as the bountiful waters and lively marketplaces so representative of Mexico. An essential guide to this distinctive cuisine, The Best of Mexico helps turn an ordinary meal into a fiesta.",
        "Category": " Cooking , Regional & Ethnic , Mexican",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Survival Kit Family Haggadah: Everything a Family Needs to Create an Enjoyable, Educational and Spiritual Seder",
        "Authors": "By Apisdorf, Shimon (EDT)",
        "Description": "The ancient Hebrew text, combined with a unique, easy-to-follow translation of the Haggadah make the family seder fun and meaningful for all Jewish families. Original. IP.",
        "Category": " Religion , Judaism , Rituals & Practice",
        "Publisher": "Leviathan Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "J. B. - A Play In Verse Sentry Edition",
        "Authors": "By MacLeish, Archibald",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "The Saturday Evening Post Carnival of Humor",
        "Authors": "By Yoder, Robert M. Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice-Hall",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Earth: The Sequel: The Race to Reinvent Energy and Stop Global Warming",
        "Authors": "By Krupp, Fred and Horn, Miriam",
        "Description": "The forecasts are grim and time is running out, but that's not the end of the story. In this book, Fred Krupp, longtime president of Environmental Defense Fund, brings a stirring and hopeful call to arms: We can solve global warming. And in doing so we will build the new industries, jobs, and fortunes of the twenty-first century.In these pages the reader will encounter the bold innovators and investors who are reinventing energy and the ways we use it. Among them: a frontier impresario who keeps his ice hotel frozen all summer long with the energy of hot springs; a utility engineer who feeds smokestack gases from coal-fired plants to voracious algae, then turns them into fuel; and a tribe of Native Americans, for two thousand years fishermen in the roughest Pacific waters, who are now harvesting the fierce power of the waves themselves.These entrepreneurs are poised to remake the world's biggest business and save the planet—if America's political leaders give them a fair chance to compete.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Financial Shenanigans: How to Detect Accounting Gimmicks & Fraud in Financial Reports",
        "Authors": "By Schilit, Howard Mark, Ph.D.",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Webster's Compact Rhyming Dictionary",
        "Authors": "By Merriam-Webster",
        "Description": "\"Fresh, creative expressions for the poet and language lover. 50,000 words arranged by rhyming sounds. Includes one-, two-, and three-syllable rhymes. Quick and easy alphabetical sequence.\"",
        "Category": " Reference , Dictionaries",
        "Publisher": "Merriam-webster+ Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Editors on Editing: What Writers Need to Know About What Editors Do",
        "Authors": "By Gross, Gerald (EDT)",
        "Description": "Since 1962 Editors on Editing has been an indispensable guide for editors, would-be editors, and especially writers who want to understand the publishing process. Written by America’s most distinguished editors, these 38 essays will teach, inform, and inspire anyone interested in the world of editing. Editors on Editing includes essays on the evolution of the American editor; the ethical and moral dimensions of editing; what an editor looks for in a query letter, proposal, and manuscript; line editing; copyediting; the freelance editor; the question of political correctness; making the most of writers’ conferences; and numerous other topics",
        "Category": " Language Arts & Disciplines , Editing & Proofreading",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Returning Home: The Poetics of Whim and Fancy",
        "Authors": "By Porter, Tracy and Porter, Tracy (ILT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Peterson First Guide To Insects Of North America",
        "Authors": "By Peterson, Roger Tory (EDT), Leahy, Christopher, and White, Richard E. (ILT)",
        "Description": "A simplified version of the full-sized field guides makes it easy and fun to get started in the field. Peterson First Guides are the first books the beginning naturalist needs. Condensed versions of the famous Peterson Field Guides, the First Guides focus on the animals, plants, and other natural things you are most likely to see. They make it fun to get into the field and easy to progress to the full-fledged Peterson Guides.",
        "Category": " Nature , Animals , Insects & Spiders",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Payback (Fearless, No. 6)",
        "Authors": "By Pascal, Francine",
        "Description": "Prey on the old and you're a coward.  Prey on the young and you're pathetic.  Prey on the weak and you're even weaker.  Prey on my friends...and you're history.",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Sport Americana Baseball Card Price Guide",
        "Authors": "By Beckett, James",
        "Description": "",
        "Category": "",
        "Publisher": "Not Avail",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "When I Was Your Age, Volume Two: Original Stories About Growing Up",
        "Authors": "By Ehrlich, Amy (EDT)",
        "Description": "\"Ehrlich offers more of a good thing in this second volume of memoirs of adolescence by renowned, contemporary YA authors.\" – Publishers Weekly (starred review)\"Tell me a story of when you were little,\" children everywhere love to ask. In this acclaimed collection, ten award-winning, well-known writers comply by reaching across their own childhoods to those of their readers. Whether telling of growing up in Japan or upstate New York or the California coast, recalling The Great Depression or World War II or the 1950s, describing children’s victories or heartaches, the writers of these stories make it clear that despite the difference between one childhood and another, all children share a complex humanity and a deep capacity for joy.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Parvana's Journey",
        "Authors": "By Ellis, Deborah",
        "Description": "A sequel to The Breadwinner, this novel tells the story of Parvana's journey once she leaves Kabul to search for her family. The Taliban still controls Afghanistan, but Kabul is in ruins, Parvana's father has died, and her mother, sister and brother could be anywhere in the country. Parvana doesn't know where they are. She just knows she has to find them.Parvana is twelve now, but she sets out alone, masquerading as a boy. Her journey becomes even more perilous when war breaks out, though she doesn't know why the bombs are falling. In her search for shelter and food as she makes her way across the desolate Afghan countryside, she meets other children who are strays from the war -- an infant boy in a bombed-out village; a nine-year-old girl who believes she has magical powers over landmines; and a boy with one leg who is so obnoxious that Parvana can hardly stand him. The children travel together because it is easier than being alone. And, as they forge their own family in the war zone that Afghanistan has become, their resilience, imagination and luck help them to survive.",
        "Category": " Juvenile Fiction , People & Places , General",
        "Publisher": "Groundwood Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Minding the Body, Mending the Mind by Borysenko, Joan by Borysenko, Joan",
        "Authors": "By Borysenko, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "Addison-Wesley Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Ruth: A novel",
        "Authors": "By Henderson, Lois T",
        "Description": "",
        "Category": "",
        "Publisher": "Guideposts",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Tell Me a Mitzvah: Little and Big Ways to Repair the World",
        "Authors": "By Friedman, Judith (ILT) and Siegel, Danny",
        "Description": "Recounts the mitzvahs, or good deeds, of a dozen men and women and suggests ways young people can help others",
        "Category": " Religion , General",
        "Publisher": "Kar-Ben Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "101 Easy-to-Do Magic Tricks (Dover Magic Books)",
        "Authors": "By Daniel, Frank (ILT) and Tarr, Bill",
        "Description": "This abundantly illustrated, easy-to-follow guide offers beginning magicians expert advice for successfully performing over 100 tricks, each graded according to difficulty. Requiring neither sleight of hand nor complex props, these fascinating tricks can all be performed with everyday objects.Step-by-step instructions, complemented by nearly 400 explanatory illustrations, show you how to master such all-time classics as The Inexhaustible Hat, The Cut and Restored Turban, Dyeing the Silks, The Chinese Rings, and The Vanishing Bowl of Water. You'll also learn to perform the mystifying manipulations of The Rising Cards, The Telltale Card, and The Impossible Location and to execute such quick tricks as The Invisible Lasso, Steel through Steel, and The Indestructible Handkerchief. With this book as your guide, you'll even master such baffling exploits of mental magic as Fingers That See, The Great Telephone Trick, Magic Squares, Super Memory, and dozens more. In addition to complete instructions, the text includes a glossary of professional terms, notes on constructing necessary props, and a brief but fascinating section on great magicians, past and present.Like many magicians, author Bill Tarr has been performing since an early age. In this book, his enthusiasm, knowledge, and admiration for his subject are readily apparent. By following the expert advice and instructions he has put forth in this easy-to-follow guide, you'll soon be adept at a repertoire of tricks sure to dazzle friends and family alike.",
        "Category": " Juvenile Nonfiction , Games & Activities , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "A Right to Be Hostile: The Boondocks Treasury",
        "Authors": "By McGruder, Aaron and Moore, Michael (FRW)",
        "Description": "Here&apos;s the first big book of The Boondocks, more than four years and 800 strips of one of the most influential, controversial, and scathingly funny comics ever to run in a daily newspaper.&apos;With bodacious wit, in just a few panels, each day Aaron serves up&apos;and sends up&apos;life in America through the eyes of two African-American kids who are full of attitude, intelligence, and rebellion. Each time I read the strip, I laugh&apos;and I wonder how long The Boondocks can get away with the things it says. And how on earth can the most truthful thing in the newspaper be the comics?&apos;&apos;From the foreword by Michael Moore",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Crown",
        "Price Starting With ($)": "47.48",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Chaos Mode (Mode, No. 3)",
        "Authors": "By Anthony, Piers",
        "Description": "United in a world of parallel universes, Colene from Earth, Darius, the king of another planet and her lover, Seqiro the telepathic horse, and a tentacled creature named Burgess return to Earth to help Colene confront her troubled past. Reprint.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "FranklinCovey Principle-Centered Leadership - Softcover",
        "Authors": "By Covey, Stephen R.",
        "Description": "From the author that brought you the New York Times bestseller The 7 Habits of Highly Effective People comes a foundational guide to leadership.How do individuals and organizations survive and thrive amid tremendous change? Why are efforts to improve organizations failing despite the millions of dollars in time, capital, and human effort being spent on them? How do we unleash creativity, talent, and energy within ourselves—and others—in the midst of pressure? Is it realistic to believe that balance among personal, family, and professional life is possible? Stephen R. Covey demonstrates that the answer to these and other dilemmas is principle-centered leadership, a long-term, inside-out approach to developing people and organizations. The key to dealing with the challenges that face us today is to develop a principle-centered core within both ourselves and our organizations. Dr. Covey offers insights and guidelines that can help you apply these principles both at work and at home—leading not just to a new understanding of how to increase quality and productivity, but also to a new appreciation of the importance of building personal and professional relationships. The result is a more balanced, more rewarding, and more effective life.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Fireside Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Eyewitness Travel Guide to Washington, DC (Eyewitness Travel Guides)",
        "Authors": "By Powers, Alice L.",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Iron Hunt (Hunter Kiss, Book 1)",
        "Authors": "By Liu, Marjorie M.",
        "Description": "First in a stunning new urban fantasy series from an author who “NEVER CEASES TO AMAZE.” (BOOKLIST, STARRED REVIEW)Demon hunter Maxine Kiss wears her armor as tattoos, which unwind from her body to take on forms of their own at night. They stand between her and her enemies, just as Maxine stands between humanity and the demons breaking out from behind the prison veils. It is a life lacking in love, reveling in death, until one moment—and one man— changes everything.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    }
]